000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.    AHKUT026.                                         00020000
000300 AUTHOR.        CHERI MASTEL.                                     00030000
000400 INSTALLATION.  KOHLS.                                            00040000
000500 DATE-WRITTEN   AUG, 1997.                                        00050000
000600 DATE-COMPILED.                                                   00060000
000700                                                                  00070000
000800* ************************************************************** *00080000
000900* * AHKUT026.  "ARCHIVE HISTORY" PROJECT.  EXTRACT PROGRAM.    * *00090000
001000* *                                                            * *00100000
001100* * PURPOSE:                                                   * *00110000
001200* * THIS PROGRAM CREATES AN EXTRACT FILE FROM: TRECITM.        * *00120000
001300* * THIS EXTRACT FILE CONSISTS OF ROWS ELIGIBLE TO BE:         * *00130000
001400* * 1) LOADED TO THE "ARCHIVE/HISTORY" VERSIONS OF THE TABLES. * *00140000
001500* * 2) DELETED FROM THE OPERATIONAL VERSIONS OF THE TABLES.    * *00150006
001600* *                                                            * *00160000
001700* * PROCESSING OVERVIEW:                                       * *00170000
001800* * THIS PROGRAM READS A "DRIVER" FILE. FOR EACH RECORD READ,  * *00180000
001900* * 1) INCREMENT COUNT OF RECORDS READ.                        * *00190000
002000* * 2) ATTEMPT TO FIND RELATED ROW(S) ON THE TABLE.            * *00200000
002100* *    2.A) IF NO MATCH(ES):                                   * *00210000
002200* *         2.A.1) PROCESSING CONTINUES                        * *00220000
002300* *         2.A.2) DO NOT PERFORM ERROR/REPORTING ROUTINES;    * *00230000
002400* *                THIS SYSTEM DOES NOT CLEANSE DATA NOR REPORT* *00240000
002500* *                ON UNCLEAN DATA.  IT SIMPLY MIGRATES        * *00250000
002600* *                CONDITIONS OCCURRING IN OPERATIONAL         * *00260006
002700* *                TABLES OVER TO THE ARCHIVE/HISTORY TABLES.  * *00270000
002800* *    2.B) IF MATCH(ES):                                      * *00280000
002900* *         2.B.1) INCREMENT COUNT OF ROW(S) FOUND.            * *00290000
003000* *         2.B.2) WRITE THESE ROW(S) TO THE EXTRACT FILE.     * *00300000
003100* *         2.B.3) INCREMENT COUNT OF RECORDS WRITTEN.         * *00310000
003200* *         2.B.4) DO NOT REMOVE THE ROW(S) FROM THE TABLE     * *00320000
003300* *                AT THIS TIME.  THEY WILL BE REMOVED IN OTHER* *00330000
003400* *                PROCESSING, AFTER HAVING BEEN LOADED TO THE * *00340000
003500* *                ARCHIVE/HISTORY TABLE.                      * *00350000
003600* * 3) EVERY NTH RECORD (IE: INITIAL SETTING 1000), REPORT     * *00360000
003700* *    RECORD COUNT AND CURRENT DATE/TIME.  THIS WILL ASSIST   * *00370000
003800* *    WITH RUN-TIME ESTIMATE OF TIME REMAINING TO COMPLETE.   * *00380000
003900* ************************************************************** *00390000
004000 ENVIRONMENT DIVISION.                                            00400000
004100 CONFIGURATION SECTION.                                           00410000
004200 SOURCE-COMPUTER.        IBM-3090.                                00420000
004300 OBJECT-COMPUTER.        IBM-3090.                                00430000
004400                                                                  00440000
004500 INPUT-OUTPUT SECTION.                                            00450000
004600 FILE-CONTROL.                                                    00460000
004700                                                                  00470000
004800     SELECT IN-DRIVER-FILE                ASSIGN TO IN01.         00480000
004900     SELECT OUT-EXTRACT-FILE              ASSIGN TO OUT01.        00490000
005000                                                                  00500000
005100******************************************************************00510000
005200 DATA DIVISION.                                                   00520000
005300 FILE SECTION.                                                    00530000
005400                                                                  00540000
005500 FD  IN-DRIVER-FILE                                               00550000
005600     RECORDING MODE IS F                                          00560000
005700     LABEL RECORDS ARE STANDARD                                   00570000
005800     BLOCK CONTAINS 0 RECORDS.                                    00580000
005900 01  IN-DRIVER-RECORD                PIC  X(004).                 00590000
006000                                                                  00600000
006100**** TRECITM:                                                     00610000
006200 FD  OUT-EXTRACT-FILE                                             00620000
006300     RECORDING MODE IS F                                          00630000
006400     LABEL RECORDS ARE STANDARD                                   00640000
006500     BLOCK CONTAINS 0 RECORDS.                                    00650000
006600 01  OUT-EXTRACT-RECORD              PIC  X(356).                 00660007
006700                                                                  00670000
006800                                                                  00680000
006900                                                                  00690000
007000 WORKING-STORAGE SECTION.                                         00700000
007100                                                                  00710000
007200 01  PC-PROGRAM-CONSTANTS.                                        00720000
007300     05  PC-CURRENT-PROGRAM-NAME     PIC X(08) VALUE 'AHKUT026'.  00730000
007400     05  PC-PGM-PROGRESS-DESC.                                    00740000
007500         10  PC-BEGINNING            PIC X(09) VALUE 'BEGINNING'. 00750000
007600         10  PC-CONTINUING           PIC X(10) VALUE              00760000
007700                                               'CONTINUING'.      00770000
007800         10  PC-ENDING               PIC X(06) VALUE 'ENDING'.    00780000
007900         10  PC-ABENDING             PIC X(08) VALUE 'ABENDING'.  00790000
008000     05  PC-ABEND-INFO.                                           00800000
008100         10  PC-ABEND                PIC X(11) VALUE              00810000
008200                                               '** ABEND **'.     00820000
008300         10  PC-ABEND-MSG-PARA       PIC X(15) VALUE              00830000
008400                                               '- PARA       : '. 00840000
008500         10  PC-ABEND-MSG-DISPLAY-PARA                            00850000
008600                                     PIC X(15) VALUE              00860000
008700                                               '  CALLED PARA: '. 00870000
008800         10  PC-ABEND-MSG-NUMBER     PIC X(15) VALUE              00880000
008900                                               '  FOR ABEND# : '. 00890000
009000         10  PC-ABEND-MSG-DESC       PIC X(15) VALUE              00900000
009100                                               '- ERROR IS   : '. 00910000
009200         10  PC-ABEND-MSG-INDENT-15  PIC X(15) VALUE SPACES.      00920000
009300         10  PC-ABEND-MSG-ACTION     PIC X(15) VALUE              00930000
009400                                               '- ACTION     : '. 00940000
009500     05  PC-HOW-OFTEN-TO-DISPLAY     PIC 9(9)  VALUE 5000.        00950005
009600                                                                  00960000
009700 01  PS-PROGRAM-SWITCHES.                                         00970000
009800     05  PS-IN-DRIVER-EOF-SW         PIC X(01) VALUE 'N'.         00980000
009900         88  PS-IN-DRIVER-EOF                  VALUE 'Y'.         00990000
010000         88  PS-IN-DRIVER-NOT-EOF              VALUE 'N'.         01000000
010100     05  PS-CURSOR-HAS-DATA-SW       PIC X(01) VALUE 'N'.         01010000
010200         88  PS-CURSOR-HAS-DATA                VALUE 'Y'.         01020000
010300         88  PS-CURSOR-HAS-NO-DATA             VALUE 'N'.         01030000
010400     05  PS-TABLE-LOOP-DONE-SW       PIC X(01) VALUE 'N'.         01040000
010500         88  PS-TABLE-LOOP-DONE                VALUE 'Y'.         01050000
010600         88  PS-TABLE-LOOP-NOT-DONE            VALUE 'N'.         01060000
010700                                                                  01070000
010800 01  PV-PROGRAM-VARIABLES.                                        01080000
010900     05  PV-PO-NBR-COMP              PIC S9(9) VALUE 0 COMP.      01090000
011000     05  PV-PO-NBR-NUM               PIC  9(9) VALUE 0.           01100002
011100     05  PV-IN-DRIVER-RECS-READ-CNT  PIC  9(9) VALUE 0.           01110000
011200     05  PV-RECS-WITH-MATCHES-CNT    PIC  9(9) VALUE 0.           01120000
011300     05  PV-TABLE-ROW-SELECT-CNT     PIC  9(9) VALUE 0.           01130000
011400     05  PV-EXTRACT-WRITTEN-CNT      PIC  9(9) VALUE 0.           01140000
011500                                                                  01150000
011600     05  PV-PARAGRAPH-NAME           PIC X(30) VALUE SPACES.      01160000
011700     05  PV-DB2-OPERATION-MSG-1      PIC X(79) VALUE SPACES.      01170000
011800     05  PV-DB2-TABLE-NAME           PIC X(18) VALUE SPACES.      01180000
011900     05  PV-DISPLAY-NTH-MULTIPLE     PIC 9(9)  VALUE 0.           01190000
012000     05  PV-DISPLAY-NTH-REMAINDER    PIC 9(9)  VALUE 0.           01200000
012100     05  PV-SQLCODE                  PIC +999  VALUE ZERO.        01210000
012200                                                                  01220000
012300     05  PV-TMST                     PIC X(26) VALUE SPACES.      01230000
012400     05  PV-TIMESTAMP-DETAIL                                      01240000
012500         REDEFINES                                                01250000
012600         PV-TMST.                                                 01260000
012700         10  PV-TIMESTAMP-19.                                     01270000
012800             15  PV-TMS-DATE.                                     01280000
012900                 20  PV-TMS-YEAR.                                 01290000
013000                     25  PV-TMS-CC   PIC X(02).                   01300000
013100                     25  PV-TMS-YY   PIC X(02).                   01310000
013200                 20  FILLER          PIC X(01).                   01320000
013300                 20  PV-TMS-MONTH    PIC X(02).                   01330000
013400                 20  FILLER          PIC X(01).                   01340000
013500                 20  PV-TMS-DAY      PIC X(02).                   01350000
013600             15  FILLER              PIC X(01).                   01360000
013700             15  PV-TMS-HOUR         PIC X(02).                   01370000
013800             15  FILLER              PIC X(01).                   01380000
013900             15  PV-TMS-MINUTE       PIC X(02).                   01390000
014000             15  FILLER              PIC X(01).                   01400000
014100             15  PV-TMS-SECOND       PIC X(02).                   01410000
014200         10  FILLER                  PIC X(01).                   01420000
014300         10  PV-TMS-MSECOND          PIC X(06).                   01430000
014400                                                                  01440000
014500 01  DM-DISPLAY-MESSAGE.                                          01450000
014600     05  DM-01-10.                                                01460000
014700         10  DM-PROGRAM              PIC X(08) VALUE SPACE.       01470000
014800         10  FILLER                  PIC X(02) VALUE ': '.        01480000
014900     05  DM-11-80.                                                01490000
015000         10  FILLER                  PIC X(37) VALUE              01500000
015100                        'SELECT ROWS MATCHING PO DRIVER FILE, '.  01510000
015200         10  FILLER                  PIC X(30) VALUE              01520000
015300                        'CREATING TRECITM EXTRACT FILE.'.         01530000
015400         10  FILLER                  PIC X(01) VALUE SPACE.       01540000
015500         10  FILLER                  PIC X(01) VALUE ALL '*'.     01550000
015600     05  DM-81-120.                                               01560000
015700         10  FILLER                  PIC X(40) VALUE ALL '*'.     01570000
015800                                                                  01580000
015900 01  DP-DISPLAY-PROGRESS-MSG.                                     01590000
016000     05  DP-PROGRAM                  PIC X(08) VALUE SPACE.       01600000
016100     05  FILLER                      PIC X(02) VALUE SPACE.       01610000
016200     05  DP-STATUS-DESCRIPTION       PIC X(10) VALUE SPACE.       01620000
016300     05  FILLER                      PIC X(04) VALUE ' AT '.      01630000
016400     05  DP-TIMESTAMP-19             PIC X(19) VALUE SPACE.       01640000
016500     05  FILLER                      PIC X(03) VALUE '.  '.       01650000
016600     05  FILLER                      PIC X(03) VALUE              01660000
016700                                         'IN:'.                   01670000
016800     05  DP-IN-CNT                   PIC ZZZ,ZZZ,ZZ9              01680000
016900                                               VALUE ZERO.        01690000
017000     05  FILLER                      PIC X(02) VALUE ', '.        01700000
017100*    05  FILLER                      PIC X(16) VALUE              01710000
017200*                                        'DRIVER W/ROW(S):'.      01720000
017300*    05  DP-MATCHES-FOUND-CNT        PIC ZZZ,ZZZ,ZZ9              01730000
017400*                                              VALUE ZERO.        01740000
017500*    05  FILLER                      PIC X(02) VALUE ', '.        01750000
017600     05  FILLER                      PIC X(14) VALUE              01760000
017700                                         'ROWS SELECTED:'.        01770000
017800     05  DP-ROWS-SELECTED-CNT        PIC ZZZ,ZZZ,ZZ9              01780000
017900                                               VALUE ZERO.        01790000
018000     05  FILLER                      PIC X(02) VALUE ', '.        01800000
018100     05  FILLER                      PIC X(04) VALUE              01810000
018200                                         'OUT:'.                  01820000
018300     05  DP-OUT-CNT                  PIC ZZZ,ZZZ,ZZ9              01830000
018400                                               VALUE ZERO.        01840000
018500     05  FILLER                      PIC X(01) VALUE '.'.         01850000
018600                                                                  01860000
018700 01  ABEND-CODE                      PIC S9(04)                   01870000
018800                                               VALUE ZEROES       01880000
018900                                               COMP SYNC.         01890000
019000                                                                  01900000
019100*---------------------------------------------------------------* 01910000
019200*  DB2 FORMATTED MESSAGE AREA                                     01920000
019300*---------------------------------------------------------------* 01930000
019400     COPY DPWS004.                                                01940000
019500                                                                  01950000
019600                                                                  01960000
019700*---------------------------------------------------------------* 01970000
019800*  AHRD002  - RECORD LAYOUT FOR PO DRIVER FILE, INPUT.          * 01980008
019900*---------------------------------------------------------------* 01990000
020000     COPY AHRD002.                                                02000008
020100                                                                  02010000
020200                                                                  02020000
020300*---------------------------------------------------------------* 02030000
020400*    DB2 AREA FOR TRECITM                                       * 02040000
020500*---------------------------------------------------------------* 02050000
020600     EXEC SQL                                                     02060000
020700          INCLUDE TRECITM                                         02070000
020800     END-EXEC.                                                    02080000
020900                                                                  02090000
021000*---------------------------------------------------------------* 02100000
021100*    DB2 AREA FOR COMMUNICATIONS                                * 02110000
021200*---------------------------------------------------------------* 02120000
021300     EXEC SQL                                                     02130000
021400          INCLUDE SQLCA                                           02140000
021500     END-EXEC.                                                    02150000
021600                                                                  02160000
021700*---------------------------------------------------------------* 02170000
021800*    DEFINE CURSOR FOR TRECITM :                                * 02180000
021900*    PULL ALL AVAILABLE COLUMNS, SO EXTRACT FILE WILL CONTAIN   * 02190000
022000*    ALL DATA TO POPULATE "ARCHIVE HISTORY" COPY OF THIS TABLE. * 02200000
022100*---------------------------------------------------------------* 02210000
022200     EXEC SQL                                                     02220000
022300          DECLARE TABLE-CURSOR CURSOR FOR                         02230000
022400           SELECT ORD_NBR                                         02240000
022500                 ,ORD_LNE_NBR                                     02250000
022600                 ,REC_SEQ_NBR                                     02260000
022700                 ,OPER_UNT_ID                                     02270000
022800                 ,FCLTY_ID                                        02280000
022900                 ,CRE_TMST                                        02290000
023000                 ,CRE_UID                                         02300000
023100                 ,PO_VER_NBR                                      02310000
023200                 ,ITM_NBR                                         02320000
023300                 ,PRE_TKT_IND                                     02330000
023400                 ,TKT_FMT_ID                                      02340000
023500                 ,RTV_IND                                         02350000
023600                 ,STATUS_CDE                                      02360000
023700                 ,VER_STATUS_CDE                                  02370000
023800                 ,PKSL_ITM_QTY                                    02380000
023900                 ,DTL_CK_ITM_QTY                                  02390000
024000                 ,INNR_PACK_QTY                                   02400000
024100                 ,CASE_PACK_QTY                                   02410000
024200                 ,RTV_QTY                                         02420000
024300                 ,EXPTED_CART_CNT                                 02430000
024400                 ,ACTL_CART_CNT                                   02440000
024500                 ,MKING_APRON_TMST                                02450000
024600                 ,UNT_COST_AMT                                    02460000
024700                 ,COLOR_DESC                                      02470000
024800                 ,SIZE_DESC                                       02480000
024900                 ,VEND_STYL_NAME                                  02490000
025000                 ,VEND_DESC                                       02500000
025100                 ,VERFYD_TMST                                     02510000
025200                 ,PKSL_NBR                                        02520000
025300                 ,REC_INV_LNE_NBR                                 02530000
025400                 ,DMG_ITM_QTY                                     02540000
025500                 ,UPD_TMST                                        02550000
025600                 ,UPD_UID                                         02560000
025700                 ,UPD_PGM_ID                                      02570000
025800                 ,RCPT_DISTR_UPD_CDE                              02580001
025900                 ,VRFD_USR_ID                                     02590000
026000                 ,LAST_TRSCP_TMST                                 02600000
026100                 ,LAST_TRSCP_USR_ID                               02610000
026110                 ,PREPK_ID                                        02611007
026120                 ,PREPK_RATO_QTY                                  02612007
026130                 ,PREPK_ODD_UNT_QTY                               02613007
026140                 ,PREPK_DRV_LNE_CDE                               02614007
026200* ******** FROM   TKMA235.TRECITM                                 02620000
026300           FROM   TRECITM                                         02630000
026400          WHERE  (ORD_NBR = :PV-PO-NBR-COMP)                      02640000
026500*      ORDER BY                                                   02650000
026600            FOR  FETCH ONLY                                       02660000
026700           WITH  UR                                               02670000
026800     END-EXEC.                                                    02680000
026900                                                                  02690000
027000                                                                  02700000
027100 PROCEDURE DIVISION.                                              02710000
027200********************                                              02720000
027300                                                                  02730000
027400 0000-PROGRAM-MAINLINE.                                           02740000
027500                                                                  02750000
027600     PERFORM 1000-INITIALIZE.                                     02760000
027700                                                                  02770000
027800     SET PS-IN-DRIVER-NOT-EOF TO TRUE.                            02780000
027900     PERFORM 2000-PROCESS-DRIVER-FILE                             02790000
028000         UNTIL PS-IN-DRIVER-EOF.                                  02800000
028100                                                                  02810000
028200     PERFORM 6000-EOJ-ROUTINE.                                    02820000
028300     STOP RUN.                                                    02830000
028400                                                                  02840000
028500                                                                  02850000
028600* ************************************************************** *02860000
028700* * INITIALIZATIONS                                            * *02870000
028800* ************************************************************** *02880000
028900 1000-INITIALIZE.                                                 02890000
029000                                                                  02900000
029100     MOVE PC-CURRENT-PROGRAM-NAME TO DM-PROGRAM.                  02910000
029200     DISPLAY DM-DISPLAY-MESSAGE.                                  02920000
029300                                                                  02930000
029400     MOVE PC-BEGINNING              TO DP-STATUS-DESCRIPTION.     02940000
029500     PERFORM 6200-DISPLAY-PGM-PROGRESS.                           02950000
029600                                                                  02960000
029700     PERFORM 9000-OPEN-IN-DRIVER-FILE.                            02970000
029800     PERFORM 9700-OPEN-OUT-EXTRACT-FILE.                          02980000
029900                                                                  02990000
030000                                                                  03000000
030100* ************************************************************** *03010000
030200* * 1) GET NEXT RECORD FROM DRIVER FILE, AND                   * *03020000
030300* *    1A- POPULATE KEY (WHERE CLAUSE) FOR TABLE CURSOR        * *03030000
030400* *    1B- OPEN TABLE CURSOR                                   * *03040000
030500* *    1C- LOOP THRU TABLE CURSOR TO EXTRACT ALL               * *03050000
030600* *        ROWS FOR THIS INPUT DRIVER RECORD                   * *03060000
030700* *    2) FOR EACH ROW,                                        * *03070000
030800* *       2A- INCREMENT COUNTS                                 * *03080000
030900* *       2B- WRITE EXTRACT RECORD                             * *03090000
031000* *    1D- CLOSE TABLE CURSOR                                  * *03100000
031100* ************************************************************** *03110000
031200 2000-PROCESS-DRIVER-FILE.                                        03120000
031300                                                                  03130000
031400     PERFORM 9050-READ-IN-DRIVER-FILE.                            03140000
031500     IF PS-IN-DRIVER-EOF                                          03150000
031600         CONTINUE                                                 03160000
031700     ELSE                                                         03170000
031800         MOVE AH002-PO-NBR TO         PV-PO-NBR-COMP              03180009
031900                                      PV-PO-NBR-NUM               03190000
032000         PERFORM 2100-CHECK-PGM-PROGRESS                          03200000
032100         SET PS-TABLE-LOOP-NOT-DONE   TO TRUE                     03210000
032200         SET PS-CURSOR-HAS-NO-DATA    TO TRUE                     03220000
032300         PERFORM 9100-OPEN-TABLE-CURSOR                           03230000
032400         PERFORM 3000-EXTRACT-ROWS-FROM-TABLE                     03240000
032500             UNTIL PS-TABLE-LOOP-DONE                             03250000
032600         PERFORM 9190-CLOSE-TABLE-CURSOR                          03260000
032700     END-IF.                                                      03270000
032800                                                                  03280000
032900                                                                  03290000
033000* ************************************************************** *03300000
033100* *    EVERY NTH RECORD (IE: INITIAL SETTING 1000), REPORT     * *03310000
033200* *    RECORD COUNT AND CURRENT DATE/TIME.  THIS WILL ASSIST   * *03320000
033300* *    WITH RUN-TIME ESTIMATE OF TIME REMAINING TO COMPLETE.   * *03330000
033400* ************************************************************** *03340000
033500 2100-CHECK-PGM-PROGRESS.                                         03350000
033600     DIVIDE    PV-IN-DRIVER-RECS-READ-CNT                         03360000
033700         BY        PC-HOW-OFTEN-TO-DISPLAY                        03370000
033800         GIVING    PV-DISPLAY-NTH-MULTIPLE                        03380000
033900         REMAINDER PV-DISPLAY-NTH-REMAINDER.                      03390000
034000                                                                  03400000
034100     IF PV-DISPLAY-NTH-REMAINDER = ZERO                           03410000
034200         MOVE PC-CONTINUING         TO DP-STATUS-DESCRIPTION      03420000
034300         PERFORM 6200-DISPLAY-PGM-PROGRESS                        03430000
034400     END-IF.                                                      03440000
034500                                                                  03450000
034600                                                                  03460000
034700* ************************************************************** *03470000
034800* * EXTRACT ROWS FROM TABLE, FOR THE CURRENT DRIVER RECORD     * *03480000
034900* ************************************************************** *03490000
035000 3000-EXTRACT-ROWS-FROM-TABLE.                                    03500000
035100     INITIALIZE DCLTRECITM.                                       03510000
035200     PERFORM 9150-FETCH-TABLE-CURSOR.                             03520000
035300     IF PS-TABLE-LOOP-DONE                                        03530000
035400         CONTINUE                                                 03540000
035500     ELSE                                                         03550000
035600         PERFORM 9750-WRITE-EXTRACT-RECORD                        03560000
035700     END-IF.                                                      03570000
035800                                                                  03580000
035900                                                                  03590000
036000* ************************************************************** *03600000
036100* * DISPLAY END OF RUN MESSAGE, CLOSE THE OUTPUT FILES         * *03610003
036200* ************************************************************** *03620000
036300 6000-EOJ-ROUTINE.                                                03630000
036400                                                                  03640000
036500     PERFORM 9090-CLOSE-IN-DRIVER-FILE.                           03650000
036600     PERFORM 9790-CLOSE-OUT-EXTRACT-FILE.                         03660000
036700                                                                  03670000
036800     MOVE PC-ENDING                 TO DP-STATUS-DESCRIPTION.     03680000
036900     PERFORM 6200-DISPLAY-PGM-PROGRESS.                           03690000
037000                                                                  03700000
037100                                                                  03710000
037200* ************************************************************** *03720000
037300* * DISPLAY PROGRAM PROGRESS.                                  * *03730000
037400* ************************************************************** *03740000
037500 6200-DISPLAY-PGM-PROGRESS.                                       03750000
037600                                                                  03760000
037700     EXEC SQL                                                     03770000
037800          SET :PV-TMST = CURRENT TIMESTAMP                        03780000
037900     END-EXEC.                                                    03790000
038000                                                                  03800000
038100     MOVE PC-CURRENT-PROGRAM-NAME   TO DP-PROGRAM.                03810000
038200     MOVE PV-TIMESTAMP-19           TO DP-TIMESTAMP-19.           03820000
038300     MOVE PV-IN-DRIVER-RECS-READ-CNT                              03830000
038400                                    TO DP-IN-CNT.                 03840000
038500*    MOVE PV-RECS-WITH-MATCHES-CNT  TO DP-MATCHES-FOUND-CNT.      03850000
038600     MOVE PV-TABLE-ROW-SELECT-CNT   TO DP-ROWS-SELECTED-CNT.      03860000
038700     MOVE PV-EXTRACT-WRITTEN-CNT    TO DP-OUT-CNT.                03870000
038800                                                                  03880000
038900     DISPLAY DP-DISPLAY-PROGRESS-MSG.                             03890000
039000                                                                  03900000
039100                                                                  03910000
039200* ************************************************************** *03920000
039300* * FILE AND DB2 TABLE ACCESS PARAGRAPHS.                      * *03930000
039400* * 90XX- INPUT:  DRIVER FILE                                  * *03940000
039500* * 91XX- INPUT:  TABLE CURSOR                                 * *03950000
039600* * 97XX- OUTPUT: TABLE EXTRACT                                * *03960000
039700* ************************************************************** *03970000
039800                                                                  03980000
039900* ************************************************************** *03990000
040000* * OPEN  INPUT DRIVER FILE                                    * *04000000
040100* ************************************************************** *04010000
040200 9000-OPEN-IN-DRIVER-FILE.                                        04020000
040300     OPEN  INPUT  IN-DRIVER-FILE.                                 04030000
040400                                                                  04040000
040500                                                                  04050000
040600* ************************************************************** *04060000
040700* * READ  INPUT DRIVER FILE OF ELIGIBLE DATA TO EXTRACT        * *04070000
040800* ************************************************************** *04080000
040900 9050-READ-IN-DRIVER-FILE.                                        04090000
041000     READ IN-DRIVER-FILE                                          04100000
041100          INTO AH002-DRIVER-RECORD-LAYOUT                         04110009
041200          AT END                                                  04120000
041300              SET PS-IN-DRIVER-EOF TO TRUE.                       04130000
041400                                                                  04140000
041500     IF PS-IN-DRIVER-EOF                                          04150000
041600         CONTINUE                                                 04160000
041700     ELSE                                                         04170000
041800         ADD +1 TO PV-IN-DRIVER-RECS-READ-CNT                     04180000
041900     END-IF.                                                      04190000
042000                                                                  04200000
042100                                                                  04210000
042200* ************************************************************** *04220000
042300* * CLOSE INPUT DRIVER FILE                                    * *04230000
042400* ************************************************************** *04240000
042500 9090-CLOSE-IN-DRIVER-FILE.                                       04250000
042600     CLOSE IN-DRIVER-FILE.                                        04260000
042700                                                                  04270000
042800                                                                  04280000
042900* ************************************************************** *04290000
043000* * OPEN  TABLE CURSOR                                         * *04300000
043100* ************************************************************** *04310000
043200 9100-OPEN-TABLE-CURSOR.                                          04320000
043300     EXEC SQL                                                     04330000
043400          OPEN TABLE-CURSOR                                       04340000
043500     END-EXEC.                                                    04350000
043600                                                                  04360000
043700     EVALUATE TRUE                                                04370000
043800         WHEN SQLCODE = ZERO                                      04380000
043900              ADD +1 TO PV-RECS-WITH-MATCHES-CNT                  04390000
044000              SET PS-CURSOR-HAS-DATA TO TRUE                      04400000
044100         WHEN SQLCODE = +100                                      04410000
044200              SET PS-TABLE-LOOP-DONE TO TRUE                      04420000
044300         WHEN SQLWARN0 NOT EQUAL SPACE                            04430000
044400         WHEN SQLCODE  NOT EQUAL ZERO                             04440000
044500              MOVE '9100-OPEN-TABLE-CURSOR'                       04450000
044600                                 TO PV-PARAGRAPH-NAME             04460000
044700              MOVE 'OPEN TABLE CURSOR'                            04470000
044800                                 TO PV-DB2-OPERATION-MSG-1        04480000
044900              MOVE 'TRECITM'     TO PV-DB2-TABLE-NAME             04490000
045000              PERFORM 9999-DB2-ABEND                              04500000
045100     END-EVALUATE.                                                04510000
045200                                                                  04520000
045300                                                                  04530000
045400* ************************************************************** *04540000
045500* * FETCH TABLE CURSOR                                         * *04550000
045600* ************************************************************** *04560000
045700 9150-FETCH-TABLE-CURSOR.                                         04570000
045800     EXEC SQL                                                     04580000
045900         FETCH TABLE-CURSOR                                       04590000
046000          INTO  :RECITM-ORD-NBR                                   04600000
046100               ,:RECITM-ORD-LNE-NBR                               04610000
046200               ,:RECITM-REC-SEQ-NBR                               04620000
046300               ,:RECITM-OPER-UNT-ID                               04630000
046400               ,:RECITM-FCLTY-ID                                  04640000
046500               ,:RECITM-CRE-TMST                                  04650000
046600               ,:RECITM-CRE-UID                                   04660000
046700               ,:RECITM-PO-VER-NBR                                04670000
046800               ,:RECITM-ITM-NBR                                   04680000
046900               ,:RECITM-PRE-TKT-IND                               04690000
047000               ,:RECITM-TKT-FMT-ID                                04700000
047100               ,:RECITM-RTV-IND                                   04710000
047200               ,:RECITM-STATUS-CDE                                04720000
047300               ,:RECITM-VER-STATUS-CDE                            04730000
047400               ,:RECITM-PKSL-ITM-QTY                              04740000
047500               ,:RECITM-DTL-CK-ITM-QTY                            04750000
047600               ,:RECITM-INNR-PACK-QTY                             04760000
047700               ,:RECITM-CASE-PACK-QTY                             04770000
047800               ,:RECITM-RTV-QTY                                   04780000
047900               ,:RECITM-EXPTED-CART-CNT                           04790000
048000               ,:RECITM-ACTL-CART-CNT                             04800000
048100               ,:RECITM-MKING-APRON-TMST                          04810000
048200               ,:RECITM-UNT-COST-AMT                              04820000
048300               ,:RECITM-COLOR-DESC                                04830000
048400               ,:RECITM-SIZE-DESC                                 04840000
048500               ,:RECITM-VEND-STYL-NAME                            04850000
048600               ,:RECITM-VEND-DESC                                 04860000
048700               ,:RECITM-VERFYD-TMST                               04870000
048800               ,:RECITM-PKSL-NBR                                  04880000
048900               ,:RECITM-REC-INV-LNE-NBR                           04890000
049000               ,:RECITM-DMG-ITM-QTY                               04900000
049100               ,:RECITM-UPD-TMST                                  04910000
049200               ,:RECITM-UPD-UID                                   04920000
049300               ,:RECITM-UPD-PGM-ID                                04930000
049400               ,:RECITM-RCPT-DISTR-UPD-CDE                        04940000
049500               ,:RECITM-VRFD-USR-ID                               04950000
049600               ,:RECITM-LAST-TRSCP-TMST                           04960000
049700               ,:RECITM-LAST-TRSCP-USR-ID                         04970000
049710               ,:RECITM-PREPK-ID                                  04971007
049720               ,:RECITM-PREPK-RATO-QTY                            04972007
049730               ,:RECITM-PREPK-ODD-UNT-QTY                         04973007
049740               ,:RECITM-PREPK-DRV-LNE-CDE                         04974007
049800     END-EXEC.                                                    04980000
049900                                                                  04990000
050000     EVALUATE TRUE                                                05000000
050100         WHEN SQLCODE = ZERO                                      05010000
050200              ADD +1                 TO PV-TABLE-ROW-SELECT-CNT   05020000
050300              SET PS-CURSOR-HAS-DATA TO TRUE                      05030000
050400         WHEN SQLCODE = +100                                      05040000
050500              SET PS-TABLE-LOOP-DONE TO TRUE                      05050000
050600         WHEN SQLWARN0 NOT EQUAL SPACE                            05060000
050700         WHEN SQLCODE NOT EQUAL ZERO                              05070000
050800              MOVE '9150-FETCH-TABLE-CURSOR'                      05080000
050900                                 TO PV-PARAGRAPH-NAME             05090000
051000              MOVE 'FETCH TABLE CURSOR'                           05100000
051100                                 TO PV-DB2-OPERATION-MSG-1        05110000
051200              MOVE 'TRECITM'     TO PV-DB2-TABLE-NAME             05120000
051300              PERFORM 9999-DB2-ABEND                              05130000
051400     END-EVALUATE.                                                05140000
051500                                                                  05150000
051600                                                                  05160000
051700* ************************************************************** *05170000
051800* * CLOSE TABLE CURSOR                                         * *05180000
051900* ************************************************************** *05190000
052000 9190-CLOSE-TABLE-CURSOR.                                         05200000
052100     EXEC SQL                                                     05210000
052200          CLOSE TABLE-CURSOR                                      05220000
052300     END-EXEC.                                                    05230000
052400                                                                  05240000
052500     EVALUATE TRUE                                                05250000
052600         WHEN SQLCODE = ZERO                                      05260000
052700              CONTINUE                                            05270000
052800         WHEN SQLWARN0 NOT EQUAL SPACE                            05280000
052900         WHEN SQLCODE NOT EQUAL ZERO                              05290000
053000              MOVE '9190-CLOSE-TABLE-CURSOR'                      05300000
053100                                 TO PV-PARAGRAPH-NAME             05310000
053200              MOVE 'CLOSE TABLE CURSOR'                           05320000
053300                                 TO PV-DB2-OPERATION-MSG-1        05330000
053400              MOVE 'TRECITM'     TO PV-DB2-TABLE-NAME             05340000
053500              PERFORM 9999-DB2-ABEND                              05350000
053600     END-EVALUATE.                                                05360000
053700                                                                  05370000
053800                                                                  05380000
053900* ************************************************************** *05390000
054000* * OPEN OUTPUT EXTRACT FILE                                   * *05400000
054100* ************************************************************** *05410000
054200 9700-OPEN-OUT-EXTRACT-FILE.                                      05420000
054300     OPEN OUTPUT OUT-EXTRACT-FILE.                                05430000
054400                                                                  05440000
054500                                                                  05450000
054600* ************************************************************** *05460000
054700* * WRITE A RECORD TO THE TABLE EXTRACT FILE                   * *05470000
054800* ************************************************************** *05480000
054900 9750-WRITE-EXTRACT-RECORD.                                       05490000
055000     WRITE  OUT-EXTRACT-RECORD  FROM  DCLTRECITM.                 05500000
055100     ADD +1 TO PV-EXTRACT-WRITTEN-CNT.                            05510000
055200                                                                  05520000
055300                                                                  05530000
055400* ************************************************************** *05540000
055500* * CLOSE OUTPUT EXTRACT FILE                                  * *05550000
055600* ************************************************************** *05560000
055700 9790-CLOSE-OUT-EXTRACT-FILE.                                     05570000
055800     CLOSE OUT-EXTRACT-FILE.                                      05580000
055900                                                                  05590000
056000                                                                  05600000
056100* ************************************************************** *05610000
056200* * DISPLAY INFORMATION NEEDED FOR DEBUGGING/MAINTENANCE/SUPPORT *05620000
056300* * AND CALL THE ABEND PROCESSOR IN THE EVENT THAT AN          * *05630000
056400* * SQL ERROR OR WARNING CODE OCCURS.                          * *05640000
056500* ************************************************************** *05650000
056600 9999-DB2-ABEND.                                                  05660000
056700                                                                  05670000
056800     DISPLAY PC-CURRENT-PROGRAM-NAME                              05680000
056900             ' 9999-DB2-ABEND'.                                   05690000
057000     DISPLAY PC-CURRENT-PROGRAM-NAME                              05700000
057100             ' ** ABEND           **'.                            05710000
057200     DISPLAY PC-CURRENT-PROGRAM-NAME                              05720000
057300             ' ** PARAGRAPH       ** = ' PV-PARAGRAPH-NAME.       05730000
057400     DISPLAY PC-CURRENT-PROGRAM-NAME                              05740000
057500             ' ** TABLES AFFECTED ** = ' PV-DB2-TABLE-NAME.       05750000
057600     DISPLAY PC-CURRENT-PROGRAM-NAME                              05760000
057700             ' ** OPERATION       ** = ' PV-DB2-OPERATION-MSG-1.  05770000
057800                                                                  05780000
057900     DISPLAY PC-CURRENT-PROGRAM-NAME                              05790000
058000             ' ** SQLCODE         ** = ' SQLCODE.                 05800000
058100     MOVE SQLCODE TO PV-SQLCODE.                                  05810000
058200     DISPLAY PC-CURRENT-PROGRAM-NAME                              05820000
058300             ' ** PV-SQLCODE      ** = ' PV-SQLCODE '.'.          05830000
058400                                                                  05840000
058500     DISPLAY PC-CURRENT-PROGRAM-NAME                              05850000
058600             ' ** SQLWARN0        ** = ' SQLWARN0 '.'.            05860000
058700                                                                  05870000
058800                                                                  05880000
058900*----------------------------------------------------------------*05890000
059000* THIS COPY BOOK MEMBER CONTAINS THE PROCEDURE DIVISION STATE-   *05900000
059100* MENTS THAT ARE REQUIRED TO UTILIZE THE DB2 ABEND MODULE        *05910000
059200* 'DSNTIAR' AND CONVERT THE SQLCA INFORMATION INTO A READABLE    *05920000
059300* FORMAT.                                                        *05930000
059400*----------------------------------------------------------------*05940000
059500     COPY DPPD004.                                                05950000
059600                                                                  05960000
059700     MOVE PC-ABENDING               TO DP-STATUS-DESCRIPTION.     05970000
059800     PERFORM 6200-DISPLAY-PGM-PROGRESS.                           05980000
059900     PERFORM 9090-CLOSE-IN-DRIVER-FILE.                           05990000
060000     PERFORM 9790-CLOSE-OUT-EXTRACT-FILE.                         06000000
060100                                                                  06010000
060200*----------------------------------------------------------------*06020000
060300* CALL ABEND                                                     *06030000
060400*----------------------------------------------------------------*06040000
060500     MOVE +4013                  TO ABEND-CODE.                   06050000
060600     CALL 'ILBOABN0' USING ABEND-CODE.                            06060000
060700*                                                                 06070000
