000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.    AHKUT014.                                         00020000
000300 AUTHOR.        CHERI MASTEL.                                     00030000
000400 INSTALLATION.  KOHLS.                                            00040000
000500 DATE-WRITTEN   AUG, 1997.                                        00050000
000600 DATE-COMPILED.                                                   00060000
000700                                                                  00070000
000800******************************************************************00080009
000900*   AHKUT014.  "ARCHIVE HISTORY" PROJECT.  EXTRACT PROGRAM.      *00090009
001000*                                                                *00100009
001100*   PURPOSE:                                                     *00110009
001200*   THIS PROGRAM CREATES AN EXTRACT FILE FROM: TPREQIT.          *00120009
001300*   THIS EXTRACT FILE CONSISTS OF ROWS ELIGIBLE TO BE:           *00130009
001400*   1) LOADED TO THE "ARCHIVE/HISTORY" VERSIONS OF THE TABLES.   *00140009
001500*   2) DELETED FROM THE OPERATIONAL VERSIONS OF THE TABLES.      *00150009
001600*                                                                *00160009
001700*   PROCESSING OVERVIEW:                                         *00170009
001800*   THIS PROGRAM READS A "DRIVER" FILE. FOR EACH RECORD READ,    *00180009
001900*   1) INCREMENT COUNT OF RECORDS READ.                          *00190009
002000*   2) ATTEMPT TO FIND RELATED ROW(S) ON THE TABLE.              *00200009
002100*      2.A) IF NO MATCH(ES):                                     *00210009
002200*           2.A.1) PROCESSING CONTINUES                          *00220009
002300*           2.A.2) DO NOT PERFORM ERROR/REPORTING ROUTINES;      *00230009
002400*                  THIS SYSTEM DOES NOT CLEANSE DATA NOR REPORT  *00240009
002500*                  ON UNCLEAN DATA.  IT SIMPLY MIGRATES          *00250009
002600*                  CONDITIONS OCCURRING IN OPERATIONAL           *00260009
002700*                  TABLES OVER TO THE ARCHIVE/HISTORY TABLES.    *00270009
002800*      2.B) IF MATCH(ES):                                        *00280009
002900*           2.B.1) INCREMENT COUNT OF ROW(S) FOUND.              *00290009
003000*           2.B.2) WRITE THESE ROW(S) TO THE EXTRACT FILE.       *00300009
003100*           2.B.3) INCREMENT COUNT OF RECORDS WRITTEN.           *00310009
003200*           2.B.4) DO NOT REMOVE THE ROW(S) FROM THE TABLE       *00320009
003300*                  AT THIS TIME.  THEY WILL BE REMOVED IN OTHER  *00330009
003400*                  PROCESSING, AFTER HAVING BEEN LOADED TO THE   *00340009
003500*                  ARCHIVE/HISTORY TABLE.                        *00350009
003600*   3) EVERY NTH RECORD (IE: INITIAL SETTING 1000), REPORT       *00360009
003700*      RECORD COUNT AND CURRENT DATE/TIME.  THIS WILL ASSIST     *00370009
003800*      WITH RUN-TIME ESTIMATE OF TIME REMAINING TO COMPLETE.     *00380009
003900*  DATE  01/13/02                                                 00390010
004000*      CHANGE MADE: MOVED PROGRAM BACK FOR RECOMPILE BECAUSE IS   00400010
004100*      OUT OF SYNC._______________________________________________00410010
004200*      MADE BY: L SCHALLHORN___________ WR/IR #: ______           00420010
004210*                                                                 00421014
004230* 06/19/07                                                        00423015
004240*     MATCH BY DC PROJECT.                                        00424014
004250*     INCREASED SIZE OF INPUT FILE FROM 186 TO 189.  THIS WAS     00425014
004260*     NEEDED TO ALLOW FOR THE 2 NEW FIELDS IN THE AHRD001         00426014
004270*     COPYBOOK: DC-NBR AND MTCH-LVL-CDE.                          00427014
004280* MADE BY: MICHELE RINDFLEISCH                 WR# 32804          00428014
004290*----------------------------------------------------------------*00429012
004300******************************************************************00430009
004400 ENVIRONMENT DIVISION.                                            00440000
004500 CONFIGURATION SECTION.                                           00450000
004600 SOURCE-COMPUTER.        IBM-3090.                                00460000
004700 OBJECT-COMPUTER.        IBM-3090.                                00470000
004800                                                                  00480000
004900 INPUT-OUTPUT SECTION.                                            00490000
005000 FILE-CONTROL.                                                    00500000
005100                                                                  00510000
005200     SELECT IN-DRIVER-FILE                ASSIGN TO IN01.         00520000
005300     SELECT OUT-EXTRACT-FILE              ASSIGN TO OUT01.        00530000
005400                                                                  00540000
005500******************************************************************00550000
005600 DATA DIVISION.                                                   00560000
005700 FILE SECTION.                                                    00570000
005800                                                                  00580000
005900 FD  IN-DRIVER-FILE                                               00590000
006000     RECORDING MODE IS F                                          00600000
006100     LABEL RECORDS ARE STANDARD                                   00610000
006200     BLOCK CONTAINS 0 RECORDS.                                    00620000
006300 01  IN-DRIVER-RECORD                PIC  X(189).                 00630012
006400                                                                  00640000
006500**** TPREQIT:                                                     00650000
006600 FD  OUT-EXTRACT-FILE                                             00660000
006700     RECORDING MODE IS F                                          00670000
006800     LABEL RECORDS ARE STANDARD                                   00680000
006900     BLOCK CONTAINS 0 RECORDS.                                    00690000
007000 01  OUT-EXTRACT-RECORD              PIC  X(020).                 00700000
007100                                                                  00710000
007200                                                                  00720000
007300                                                                  00730000
007400 WORKING-STORAGE SECTION.                                         00740000
007500                                                                  00750000
007600 01  PC-PROGRAM-CONSTANTS.                                        00760000
007700     05  PC-CURRENT-PROGRAM-NAME     PIC X(08) VALUE 'AHKUT014'.  00770000
007800     05  PC-PGM-PROGRESS-DESC.                                    00780000
007900         10  PC-BEGINNING            PIC X(09) VALUE 'BEGINNING'. 00790000
008000         10  PC-CONTINUING           PIC X(10) VALUE              00800000
008100                                               'CONTINUING'.      00810000
008200         10  PC-ENDING               PIC X(06) VALUE 'ENDING'.    00820000
008300         10  PC-ABENDING             PIC X(08) VALUE 'ABENDING'.  00830000
008400     05  PC-ABEND-INFO.                                           00840000
008500         10  PC-ABEND                PIC X(11) VALUE              00850000
008600                                               '** ABEND **'.     00860000
008700         10  PC-ABEND-MSG-PARA       PIC X(15) VALUE              00870000
008800                                               '- PARA       : '. 00880000
008900         10  PC-ABEND-MSG-DISPLAY-PARA                            00890000
009000                                     PIC X(15) VALUE              00900000
009100                                               '  CALLED PARA: '. 00910000
009200         10  PC-ABEND-MSG-NUMBER     PIC X(15) VALUE              00920000
009300                                               '  FOR ABEND# : '. 00930000
009400         10  PC-ABEND-MSG-DESC       PIC X(15) VALUE              00940000
009500                                               '- ERROR IS   : '. 00950000
009600         10  PC-ABEND-MSG-INDENT-15  PIC X(15) VALUE SPACES.      00960000
009700         10  PC-ABEND-MSG-ACTION     PIC X(15) VALUE              00970000
009800                                               '- ACTION     : '. 00980000
009900     05  PC-HOW-OFTEN-TO-DISPLAY     PIC 9(9)  VALUE 100000.      00990004
010000                                                                  01000000
010100 01  PS-PROGRAM-SWITCHES.                                         01010000
010200     05  PS-IN-DRIVER-EOF-SW         PIC X(01) VALUE 'N'.         01020000
010300         88  PS-IN-DRIVER-EOF                  VALUE 'Y'.         01030000
010400         88  PS-IN-DRIVER-NOT-EOF              VALUE 'N'.         01040000
010500     05  PS-CURSOR-HAS-DATA-SW       PIC X(01) VALUE 'N'.         01050000
010600         88  PS-CURSOR-HAS-DATA                VALUE 'Y'.         01060000
010700         88  PS-CURSOR-HAS-NO-DATA             VALUE 'N'.         01070000
010800     05  PS-TABLE-LOOP-DONE-SW       PIC X(01) VALUE 'N'.         01080000
010900         88  PS-TABLE-LOOP-DONE                VALUE 'Y'.         01090000
011000         88  PS-TABLE-LOOP-NOT-DONE            VALUE 'N'.         01100000
011100                                                                  01110000
011200 01  PV-PROGRAM-VARIABLES.                                        01120000
011300     05  PV-PAYT-REQ-SEQ-NBR-COMP    PIC S9(9) VALUE 0 COMP.      01130000
011400     05  PV-PAYT-REQ-SEQ-NBR-NUM     PIC  9(9) VALUE 0.           01140002
011500     05  PV-IN-DRIVER-RECS-READ-CNT  PIC  9(9) VALUE 0.           01150000
011600     05  PV-RECS-WITH-MATCHES-CNT    PIC  9(9) VALUE 0.           01160000
011700     05  PV-TABLE-ROW-SELECT-CNT     PIC  9(9) VALUE 0.           01170000
011800     05  PV-EXTRACT-WRITTEN-CNT      PIC  9(9) VALUE 0.           01180000
011900                                                                  01190000
012000     05  PV-PARAGRAPH-NAME           PIC X(30) VALUE SPACES.      01200000
012100     05  PV-DB2-OPERATION-MSG-1      PIC X(79) VALUE SPACES.      01210000
012200     05  PV-DB2-TABLE-NAME           PIC X(18) VALUE SPACES.      01220000
012300     05  PV-DISPLAY-NTH-MULTIPLE     PIC 9(9)  VALUE 0.           01230000
012400     05  PV-DISPLAY-NTH-REMAINDER    PIC 9(9)  VALUE 0.           01240000
012500     05  PV-SQLCODE                  PIC +999  VALUE ZERO.        01250000
012600                                                                  01260000
012700     05  PV-TMST                     PIC X(26) VALUE SPACES.      01270000
012800     05  PV-TIMESTAMP-DETAIL                                      01280000
012900         REDEFINES                                                01290000
013000         PV-TMST.                                                 01300000
013100         10  PV-TIMESTAMP-19.                                     01310000
013200             15  PV-TMS-DATE.                                     01320000
013300                 20  PV-TMS-YEAR.                                 01330000
013400                     25  PV-TMS-CC   PIC X(02).                   01340000
013500                     25  PV-TMS-YY   PIC X(02).                   01350000
013600                 20  FILLER          PIC X(01).                   01360000
013700                 20  PV-TMS-MONTH    PIC X(02).                   01370000
013800                 20  FILLER          PIC X(01).                   01380000
013900                 20  PV-TMS-DAY      PIC X(02).                   01390000
014000             15  FILLER              PIC X(01).                   01400000
014100             15  PV-TMS-HOUR         PIC X(02).                   01410000
014200             15  FILLER              PIC X(01).                   01420000
014300             15  PV-TMS-MINUTE       PIC X(02).                   01430000
014400             15  FILLER              PIC X(01).                   01440000
014500             15  PV-TMS-SECOND       PIC X(02).                   01450000
014600         10  FILLER                  PIC X(01).                   01460000
014700         10  PV-TMS-MSECOND          PIC X(06).                   01470000
014800                                                                  01480000
014900 01  DM-DISPLAY-MESSAGE.                                          01490000
015000     05  DM-01-10.                                                01500000
015100         10  DM-PROGRAM              PIC X(08) VALUE SPACE.       01510000
015200         10  FILLER                  PIC X(02) VALUE ': '.        01520000
015300     05  DM-11-80.                                                01530000
015400         10  FILLER                  PIC X(37) VALUE              01540000
015500                        'SELECT ROWS MATCHING TO DRIVER FILE, '.  01550000
015600         10  FILLER                  PIC X(30) VALUE              01560000
015700                        'CREATING TPREQIT EXTRACT FILE.'.         01570000
015800         10  FILLER                  PIC X(01) VALUE SPACE.       01580000
015900         10  FILLER                  PIC X(01) VALUE ALL '*'.     01590000
016000     05  DM-81-120.                                               01600000
016100         10  FILLER                  PIC X(40) VALUE ALL '*'.     01610000
016200                                                                  01620000
016300 01  DP-DISPLAY-PROGRESS-MSG.                                     01630000
016400     05  DP-PROGRAM                  PIC X(08) VALUE SPACE.       01640000
016500     05  FILLER                      PIC X(02) VALUE SPACE.       01650000
016600     05  DP-STATUS-DESCRIPTION       PIC X(10) VALUE SPACE.       01660000
016700     05  FILLER                      PIC X(04) VALUE ' AT '.      01670000
016800     05  DP-TIMESTAMP-19             PIC X(19) VALUE SPACE.       01680000
016900     05  FILLER                      PIC X(03) VALUE '.  '.       01690000
017000     05  FILLER                      PIC X(03) VALUE              01700000
017100                                         'IN:'.                   01710000
017200     05  DP-IN-CNT                   PIC ZZZ,ZZZ,ZZ9              01720000
017300                                               VALUE ZERO.        01730000
017400     05  FILLER                      PIC X(02) VALUE ', '.        01740000
017500*    05  FILLER                      PIC X(16) VALUE              01750000
017600*                                        'DRIVER W/ROW(S):'.      01760000
017700*    05  DP-MATCHES-FOUND-CNT        PIC ZZZ,ZZZ,ZZ9              01770000
017800*                                              VALUE ZERO.        01780000
017900*    05  FILLER                      PIC X(02) VALUE ', '.        01790000
018000     05  FILLER                      PIC X(14) VALUE              01800000
018100                                         'ROWS SELECTED:'.        01810000
018200     05  DP-ROWS-SELECTED-CNT        PIC ZZZ,ZZZ,ZZ9              01820000
018300                                               VALUE ZERO.        01830000
018400     05  FILLER                      PIC X(02) VALUE ', '.        01840000
018500     05  FILLER                      PIC X(04) VALUE              01850000
018600                                         'OUT:'.                  01860000
018700     05  DP-OUT-CNT                  PIC ZZZ,ZZZ,ZZ9              01870000
018800                                               VALUE ZERO.        01880000
018900     05  FILLER                      PIC X(01) VALUE '.'.         01890000
019000                                                                  01900000
019100 01  ABEND-CODE                      PIC S9(04)                   01910000
019200                                               VALUE ZEROES       01920000
019300                                               COMP SYNC.         01930000
019400                                                                  01940000
019500*---------------------------------------------------------------* 01950000
019600*  DB2 FORMATTED MESSAGE AREA                                     01960000
019700*---------------------------------------------------------------* 01970000
019800     COPY DPWS004.                                                01980000
019900                                                                  01990000
020000                                                                  02000000
020100*---------------------------------------------------------------* 02010000
020200*  AHRD001  - RECORD LAYOUT FOR DRIVER FILE, INPUT.             * 02020007
020300*---------------------------------------------------------------* 02030000
020400     COPY AHRD001.                                                02040007
020500                                                                  02050000
020600                                                                  02060000
020700*---------------------------------------------------------------* 02070000
020800*    DB2 AREA FOR TPREQIT                                       * 02080000
020900*---------------------------------------------------------------* 02090000
021000     EXEC SQL                                                     02100000
021100          INCLUDE TPREQIT                                         02110000
021200     END-EXEC.                                                    02120000
021300                                                                  02130000
021400*---------------------------------------------------------------* 02140000
021500*    DB2 AREA FOR COMMUNICATIONS                                * 02150000
021600*---------------------------------------------------------------* 02160000
021700     EXEC SQL                                                     02170000
021800          INCLUDE SQLCA                                           02180000
021900     END-EXEC.                                                    02190000
022000                                                                  02200000
022100*---------------------------------------------------------------* 02210000
022200*    DEFINE CURSOR FOR TPREQIT :                                * 02220000
022300*    PULL ALL AVAILABLE COLUMNS, SO EXTRACT FILE WILL CONTAIN   * 02230000
022400*    ALL DATA TO POPULATE "ARCHIVE HISTORY" COPY OF THIS TABLE. * 02240000
022500*---------------------------------------------------------------* 02250000
022600     EXEC SQL                                                     02260000
022700          DECLARE TABLE-CURSOR CURSOR FOR                         02270000
022800           SELECT PAYT_REQ_SEQ_NBR                                02280000
022900                 ,PAYT_REQ_LNE_NBR                                02290000
023000                 ,PAY_REQ_LNE_QTY                                 02300000
023100                 ,QTY_UNT_OF_MSMT                                 02310000
023200                 ,UNT_COST_AMT                                    02320000
023300********** FROM   TKMA235.TPREQIT                                 02330009
023400           FROM   TPREQIT                                         02340000
023500          WHERE  (PAYT_REQ_SEQ_NBR = :PV-PAYT-REQ-SEQ-NBR-COMP)   02350000
023600*      ORDER BY                                                   02360000
023700            FOR  FETCH ONLY                                       02370000
023800           WITH  UR                                               02380000
023900     END-EXEC.                                                    02390000
024000                                                                  02400000
024100                                                                  02410000
024200 PROCEDURE DIVISION.                                              02420000
024300********************                                              02430000
024400                                                                  02440000
024500 0000-PROGRAM-MAINLINE.                                           02450000
024600                                                                  02460000
024700     PERFORM 1000-INITIALIZE.                                     02470000
024800                                                                  02480000
024900     SET PS-IN-DRIVER-NOT-EOF TO TRUE.                            02490000
025000     PERFORM 2000-PROCESS-DRIVER-FILE                             02500000
025100         UNTIL PS-IN-DRIVER-EOF.                                  02510000
025200                                                                  02520000
025300     PERFORM 6000-EOJ-ROUTINE.                                    02530000
025400     STOP RUN.                                                    02540000
025500                                                                  02550000
025600                                                                  02560000
025700******************************************************************02570009
025800*   INITIALIZATIONS                                              *02580009
025900******************************************************************02590009
026000 1000-INITIALIZE.                                                 02600000
026100                                                                  02610000
026200     MOVE PC-CURRENT-PROGRAM-NAME TO DM-PROGRAM.                  02620000
026300     DISPLAY DM-DISPLAY-MESSAGE.                                  02630000
026400                                                                  02640000
026500     MOVE PC-BEGINNING              TO DP-STATUS-DESCRIPTION.     02650000
026600     PERFORM 6200-DISPLAY-PGM-PROGRESS.                           02660000
026700                                                                  02670000
026800     PERFORM 9000-OPEN-IN-DRIVER-FILE.                            02680000
026900     PERFORM 9700-OPEN-OUT-EXTRACT-FILE.                          02690000
027000                                                                  02700000
027100                                                                  02710000
027200******************************************************************02720009
027300*   1) GET NEXT RECORD FROM DRIVER FILE, AND                     *02730009
027400*      1A- POPULATE KEY (WHERE CLAUSE) FOR TABLE CURSOR          *02740009
027500*      1B- OPEN TABLE CURSOR                                     *02750009
027600*      1C- LOOP THRU TABLE CURSOR TO EXTRACT ALL                 *02760009
027700*          ROWS FOR THIS INPUT DRIVER RECORD                     *02770009
027800*      2) FOR EACH ROW,                                          *02780009
027900*         2A- INCREMENT COUNTS                                   *02790009
028000*         2B- WRITE EXTRACT RECORD                               *02800009
028100*      1D- CLOSE TABLE CURSOR                                    *02810009
028200******************************************************************02820009
028300 2000-PROCESS-DRIVER-FILE.                                        02830000
028400                                                                  02840000
028500     PERFORM 9050-READ-IN-DRIVER-FILE.                            02850000
028600     IF PS-IN-DRIVER-EOF                                          02860000
028700         CONTINUE                                                 02870000
028800     ELSE                                                         02880000
028900         MOVE AH001-B-PAYT-REQ-SEQ-NBR TO                         02890007
029000                                      PV-PAYT-REQ-SEQ-NBR-COMP    02900000
029100                                      PV-PAYT-REQ-SEQ-NBR-NUM     02910000
029200         PERFORM 2100-CHECK-PGM-PROGRESS                          02920000
029300         SET PS-TABLE-LOOP-NOT-DONE   TO TRUE                     02930000
029400         SET PS-CURSOR-HAS-NO-DATA    TO TRUE                     02940000
029500         PERFORM 9100-OPEN-TABLE-CURSOR                           02950000
029600         PERFORM 3000-EXTRACT-ROWS-FROM-TABLE                     02960000
029700             UNTIL PS-TABLE-LOOP-DONE                             02970000
029800         PERFORM 9190-CLOSE-TABLE-CURSOR                          02980000
029900     END-IF.                                                      02990000
030000                                                                  03000000
030100                                                                  03010000
030200******************************************************************03020009
030300*      EVERY NTH RECORD (IE: INITIAL SETTING 1000), REPORT       *03030009
030400*      RECORD COUNT AND CURRENT DATE/TIME.  THIS WILL ASSIST     *03040009
030500*      WITH RUN-TIME ESTIMATE OF TIME REMAINING TO COMPLETE.     *03050009
030600******************************************************************03060009
030700 2100-CHECK-PGM-PROGRESS.                                         03070000
030800     DIVIDE    PV-IN-DRIVER-RECS-READ-CNT                         03080000
030900         BY        PC-HOW-OFTEN-TO-DISPLAY                        03090001
031000         GIVING    PV-DISPLAY-NTH-MULTIPLE                        03100001
031100         REMAINDER PV-DISPLAY-NTH-REMAINDER.                      03110001
031200                                                                  03120000
031300     IF PV-DISPLAY-NTH-REMAINDER = ZERO                           03130000
031400         MOVE PC-CONTINUING         TO DP-STATUS-DESCRIPTION      03140000
031500         PERFORM 6200-DISPLAY-PGM-PROGRESS                        03150000
031600     END-IF.                                                      03160000
031700                                                                  03170000
031800                                                                  03180000
031900******************************************************************03190009
032000*   EXTRACT ROWS FROM TABLE, FOR THE CURRENT DRIVER RECORD       *03200009
032100******************************************************************03210009
032200 3000-EXTRACT-ROWS-FROM-TABLE.                                    03220000
032300     INITIALIZE DCLTPREQIT.                                       03230000
032400     PERFORM 9150-FETCH-TABLE-CURSOR.                             03240000
032500     IF PS-TABLE-LOOP-DONE                                        03250000
032600         CONTINUE                                                 03260000
032700     ELSE                                                         03270000
032800         PERFORM 9750-WRITE-EXTRACT-RECORD                        03280000
032900     END-IF.                                                      03290000
033000                                                                  03300000
033100                                                                  03310000
033200******************************************************************03320009
033300*   DISPLAY END OF RUN MESSAGE, CLOSE THE OUTPUT FILES           *03330009
033400******************************************************************03340009
033500 6000-EOJ-ROUTINE.                                                03350000
033600                                                                  03360000
033700     PERFORM 9090-CLOSE-IN-DRIVER-FILE.                           03370000
033800     PERFORM 9790-CLOSE-OUT-EXTRACT-FILE.                         03380000
033900                                                                  03390000
034000     MOVE PC-ENDING                 TO DP-STATUS-DESCRIPTION.     03400000
034100     PERFORM 6200-DISPLAY-PGM-PROGRESS.                           03410000
034200                                                                  03420000
034300                                                                  03430000
034400******************************************************************03440009
034500*   DISPLAY PROGRAM PROGRESS.                                    *03450009
034600******************************************************************03460009
034700 6200-DISPLAY-PGM-PROGRESS.                                       03470000
034800                                                                  03480000
034900     EXEC SQL                                                     03490000
035000          SET :PV-TMST = CURRENT TIMESTAMP                        03500000
035100     END-EXEC.                                                    03510000
035200                                                                  03520000
035300     MOVE PC-CURRENT-PROGRAM-NAME   TO DP-PROGRAM.                03530000
035400     MOVE PV-TIMESTAMP-19           TO DP-TIMESTAMP-19.           03540000
035500     MOVE PV-IN-DRIVER-RECS-READ-CNT                              03550000
035600                                    TO DP-IN-CNT.                 03560000
035700*    MOVE PV-RECS-WITH-MATCHES-CNT  TO DP-MATCHES-FOUND-CNT.      03570000
035800     MOVE PV-TABLE-ROW-SELECT-CNT   TO DP-ROWS-SELECTED-CNT.      03580000
035900     MOVE PV-EXTRACT-WRITTEN-CNT    TO DP-OUT-CNT.                03590000
036000                                                                  03600000
036100     DISPLAY DP-DISPLAY-PROGRESS-MSG.                             03610000
036200                                                                  03620000
036300                                                                  03630000
036400******************************************************************03640009
036500*   FILE AND DB2 TABLE ACCESS PARAGRAPHS.                        *03650009
036600*   90XX- INPUT:  DRIVER FILE                                    *03660009
036700*   91XX- INPUT:  TABLE CURSOR                                   *03670009
036800*   97XX- OUTPUT: TABLE EXTRACT                                  *03680009
036900******************************************************************03690009
037000                                                                  03700000
037100******************************************************************03710009
037200*   OPEN  INPUT DRIVER FILE                                      *03720009
037300******************************************************************03730009
037400 9000-OPEN-IN-DRIVER-FILE.                                        03740000
037500     OPEN  INPUT  IN-DRIVER-FILE.                                 03750000
037600                                                                  03760000
037700                                                                  03770000
037800******************************************************************03780009
037900*   READ  INPUT DRIVER FILE OF ELIGIBLE DATA TO EXTRACT          *03790009
038000******************************************************************03800009
038100 9050-READ-IN-DRIVER-FILE.                                        03810000
038200     READ IN-DRIVER-FILE                                          03820000
038300          INTO AH001-DRIVER-RECORD-LAYOUT                         03830007
038400          AT END                                                  03840000
038500              SET PS-IN-DRIVER-EOF TO TRUE.                       03850000
038600                                                                  03860000
038700     IF PS-IN-DRIVER-EOF                                          03870000
038800         CONTINUE                                                 03880000
038900     ELSE                                                         03890000
039000         ADD +1 TO PV-IN-DRIVER-RECS-READ-CNT                     03900000
039100     END-IF.                                                      03910000
039200                                                                  03920000
039300                                                                  03930000
039400******************************************************************03940009
039500*   CLOSE INPUT DRIVER FILE                                      *03950009
039600******************************************************************03960009
039700 9090-CLOSE-IN-DRIVER-FILE.                                       03970000
039800     CLOSE IN-DRIVER-FILE.                                        03980000
039900                                                                  03990000
040000                                                                  04000000
040100******************************************************************04010009
040200*   OPEN  TABLE CURSOR                                           *04020009
040300******************************************************************04030009
040400 9100-OPEN-TABLE-CURSOR.                                          04040000
040500     EXEC SQL                                                     04050000
040600          OPEN TABLE-CURSOR                                       04060000
040700     END-EXEC.                                                    04070000
040800                                                                  04080000
040900     EVALUATE TRUE                                                04090000
041000         WHEN SQLCODE = ZERO                                      04100000
041100              ADD +1 TO PV-RECS-WITH-MATCHES-CNT                  04110000
041200              SET PS-CURSOR-HAS-DATA TO TRUE                      04120000
041300         WHEN SQLCODE = +100                                      04130000
041400              SET PS-TABLE-LOOP-DONE TO TRUE                      04140000
041500         WHEN SQLWARN0 NOT EQUAL SPACE                            04150000
041600         WHEN SQLCODE  NOT EQUAL ZERO                             04160000
041700              MOVE '9100-OPEN-TABLE-CURSOR'                       04170000
041800                                 TO PV-PARAGRAPH-NAME             04180000
041900              MOVE 'OPEN TABLE CURSOR'                            04190000
042000                                 TO PV-DB2-OPERATION-MSG-1        04200000
042100              MOVE 'TPREQIT'     TO PV-DB2-TABLE-NAME             04210000
042200              PERFORM 9999-DB2-ABEND                              04220000
042300     END-EVALUATE.                                                04230000
042400                                                                  04240000
042500                                                                  04250000
042600******************************************************************04260009
042700*   FETCH TABLE CURSOR                                           *04270009
042800******************************************************************04280009
042900 9150-FETCH-TABLE-CURSOR.                                         04290000
043000     EXEC SQL                                                     04300000
043100         FETCH TABLE-CURSOR                                       04310000
043200          INTO  :PREQIT-PAYT-REQ-SEQ-NBR                          04320000
043300               ,:PREQIT-PAYT-REQ-LNE-NBR                          04330000
043400               ,:PREQIT-PAY-REQ-LNE-QTY                           04340000
043500               ,:PREQIT-QTY-UNT-OF-MSMT                           04350000
043600               ,:PREQIT-UNT-COST-AMT                              04360000
043700     END-EXEC.                                                    04370000
043800                                                                  04380000
043900     EVALUATE TRUE                                                04390000
044000         WHEN SQLCODE = ZERO                                      04400000
044100              ADD +1                 TO PV-TABLE-ROW-SELECT-CNT   04410000
044200              SET PS-CURSOR-HAS-DATA TO TRUE                      04420000
044300         WHEN SQLCODE = +100                                      04430000
044400              SET PS-TABLE-LOOP-DONE TO TRUE                      04440000
044500         WHEN SQLWARN0 NOT EQUAL SPACE                            04450000
044600         WHEN SQLCODE NOT EQUAL ZERO                              04460000
044700              MOVE '9150-FETCH-TABLE-CURSOR'                      04470000
044800                                 TO PV-PARAGRAPH-NAME             04480000
044900              MOVE 'FETCH TABLE CURSOR'                           04490000
045000                                 TO PV-DB2-OPERATION-MSG-1        04500000
045100              MOVE 'TPREQIT'     TO PV-DB2-TABLE-NAME             04510000
045200              PERFORM 9999-DB2-ABEND                              04520000
045300     END-EVALUATE.                                                04530000
045400                                                                  04540000
045500                                                                  04550000
045600******************************************************************04560009
045700*   CLOSE TABLE CURSOR                                           *04570009
045800******************************************************************04580009
045900 9190-CLOSE-TABLE-CURSOR.                                         04590000
046000     EXEC SQL                                                     04600000
046100          CLOSE TABLE-CURSOR                                      04610000
046200     END-EXEC.                                                    04620000
046300                                                                  04630000
046400     EVALUATE TRUE                                                04640000
046500         WHEN SQLCODE = ZERO                                      04650000
046600              CONTINUE                                            04660000
046700         WHEN SQLWARN0 NOT EQUAL SPACE                            04670000
046800         WHEN SQLCODE NOT EQUAL ZERO                              04680000
046900              MOVE '9190-CLOSE-TABLE-CURSOR'                      04690000
047000                                 TO PV-PARAGRAPH-NAME             04700000
047100              MOVE 'CLOSE TABLE CURSOR'                           04710000
047200                                 TO PV-DB2-OPERATION-MSG-1        04720000
047300              MOVE 'TPREQIT'     TO PV-DB2-TABLE-NAME             04730000
047400              PERFORM 9999-DB2-ABEND                              04740000
047500     END-EVALUATE.                                                04750000
047600                                                                  04760000
047700                                                                  04770000
047800******************************************************************04780009
047900*   OPEN OUTPUT EXTRACT FILE                                     *04790009
048000******************************************************************04800009
048100 9700-OPEN-OUT-EXTRACT-FILE.                                      04810000
048200     OPEN OUTPUT OUT-EXTRACT-FILE.                                04820000
048300                                                                  04830000
048400                                                                  04840000
048500******************************************************************04850009
048600*   WRITE A RECORD TO THE TABLE EXTRACT FILE                     *04860009
048700******************************************************************04870009
048800 9750-WRITE-EXTRACT-RECORD.                                       04880000
048900     WRITE  OUT-EXTRACT-RECORD  FROM  DCLTPREQIT.                 04890000
049000     ADD +1 TO PV-EXTRACT-WRITTEN-CNT.                            04900000
049100                                                                  04910000
049200                                                                  04920000
049300******************************************************************04930009
049400*   CLOSE OUTPUT EXTRACT FILE                                    *04940009
049500******************************************************************04950009
049600 9790-CLOSE-OUT-EXTRACT-FILE.                                     04960000
049700     CLOSE OUT-EXTRACT-FILE.                                      04970000
049800                                                                  04980000
049900                                                                  04990000
050000******************************************************************05000009
050100*   DISPLAY INFORMATION NEEDED FOR DEBUGGING/MAINTENANCE/SUPPORT *05010009
050200*   AND CALL THE ABEND PROCESSOR IN THE EVENT THAT AN            *05020009
050300*   SQL ERROR OR WARNING CODE OCCURS.                            *05030009
050400******************************************************************05040009
050500 9999-DB2-ABEND.                                                  05050000
050600                                                                  05060000
050700     DISPLAY PC-CURRENT-PROGRAM-NAME                              05070000
050800             ' 9999-DB2-ABEND'.                                   05080000
050900     DISPLAY PC-CURRENT-PROGRAM-NAME                              05090000
051000             ' ** ABEND           **'.                            05100000
051100     DISPLAY PC-CURRENT-PROGRAM-NAME                              05110000
051200             ' ** PARAGRAPH       ** = ' PV-PARAGRAPH-NAME.       05120000
051300     DISPLAY PC-CURRENT-PROGRAM-NAME                              05130000
051400             ' ** TABLES AFFECTED ** = ' PV-DB2-TABLE-NAME.       05140000
051500     DISPLAY PC-CURRENT-PROGRAM-NAME                              05150000
051600             ' ** OPERATION       ** = ' PV-DB2-OPERATION-MSG-1.  05160000
051700                                                                  05170000
051800     DISPLAY PC-CURRENT-PROGRAM-NAME                              05180000
051900             ' ** SQLCODE         ** = ' SQLCODE.                 05190000
052000     MOVE SQLCODE TO PV-SQLCODE.                                  05200000
052100     DISPLAY PC-CURRENT-PROGRAM-NAME                              05210000
052200             ' ** PV-SQLCODE      ** = ' PV-SQLCODE '.'.          05220000
052300                                                                  05230000
052400     DISPLAY PC-CURRENT-PROGRAM-NAME                              05240000
052500             ' ** SQLWARN0        ** = ' SQLWARN0 '.'.            05250000
052600                                                                  05260000
052700                                                                  05270000
052800*----------------------------------------------------------------*05280000
052900* THIS COPY BOOK MEMBER CONTAINS THE PROCEDURE DIVISION STATE-   *05290000
053000* MENTS THAT ARE REQUIRED TO UTILIZE THE DB2 ABEND MODULE        *05300000
053100* 'DSNTIAR' AND CONVERT THE SQLCA INFORMATION INTO A READABLE    *05310000
053200* FORMAT.                                                        *05320000
053300*----------------------------------------------------------------*05330000
053400     COPY DPPD004.                                                05340000
053500                                                                  05350000
053600     MOVE PC-ABENDING               TO DP-STATUS-DESCRIPTION.     05360000
053700     PERFORM 6200-DISPLAY-PGM-PROGRESS.                           05370000
053800     PERFORM 9090-CLOSE-IN-DRIVER-FILE.                           05380000
053900     PERFORM 9790-CLOSE-OUT-EXTRACT-FILE.                         05390000
054000                                                                  05400000
054100*----------------------------------------------------------------*05410000
054200* CALL ABEND                                                     *05420000
054300*----------------------------------------------------------------*05430000
054400     MOVE +4013                  TO ABEND-CODE.                   05440000
054500     CALL 'ILBOABN0' USING ABEND-CODE.                            05450000
054600*                                                                 05460000
