000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.    AHKUT022.                                         00020000
000300 AUTHOR.        CHERI MASTEL.                                     00030000
000400 INSTALLATION.  KOHLS.                                            00040000
000500 DATE-WRITTEN   AUG, 1997.                                        00050000
000600 DATE-COMPILED.                                                   00060000
000700                                                                  00070000
000800* ************************************************************** *00080000
000900* * AHKUT022.  "ARCHIVE HISTORY" PROJECT.  EXTRACT PROGRAM.    * *00090000
001000* *                                                            * *00100000
001100* * PURPOSE:                                                   * *00110000
001200* * THIS PROGRAM CREATES AN EXTRACT FILE FROM: TPLNSHP.        * *00120000
001300* * THIS EXTRACT FILE CONSISTS OF ROWS ELIGIBLE TO BE:         * *00130000
001400* * 1) LOADED TO THE "ARCHIVE/HISTORY" VERSIONS OF THE TABLES. * *00140000
001500* * 2) DELETED FROM THE OPERATIONAL VERSIONS OF THE TABLES.    * *00150005
001600* *                                                            * *00160000
001700* * PROCESSING OVERVIEW:                                       * *00170000
001800* * THIS PROGRAM READS A "DRIVER" FILE. FOR EACH RECORD READ,  * *00180000
001900* * 1) INCREMENT COUNT OF RECORDS READ.                        * *00190000
002000* * 2) ATTEMPT TO FIND RELATED ROW(S) ON THE TABLE.            * *00200000
002100* *    2.A) IF NO MATCH(ES):                                   * *00210000
002200* *         2.A.1) PROCESSING CONTINUES                        * *00220000
002300* *         2.A.2) DO NOT PERFORM ERROR/REPORTING ROUTINES;    * *00230000
002400* *                THIS SYSTEM DOES NOT CLEANSE DATA NOR REPORT* *00240000
002500* *                ON UNCLEAN DATA.  IT SIMPLY MIGRATES        * *00250000
002600* *                CONDITIONS OCCURRING IN OPERATIONAL         * *00260005
002700* *                TABLES OVER TO THE ARCHIVE/HISTORY TABLES.  * *00270000
002800* *    2.B) IF MATCH(ES):                                      * *00280000
002900* *         2.B.1) INCREMENT COUNT OF ROW(S) FOUND.            * *00290000
003000* *         2.B.2) WRITE THESE ROW(S) TO THE EXTRACT FILE.     * *00300000
003100* *         2.B.3) INCREMENT COUNT OF RECORDS WRITTEN.         * *00310000
003200* *         2.B.4) DO NOT REMOVE THE ROW(S) FROM THE TABLE     * *00320000
003300* *                AT THIS TIME.  THEY WILL BE REMOVED IN OTHER* *00330000
003400* *                PROCESSING, AFTER HAVING BEEN LOADED TO THE * *00340000
003500* *                ARCHIVE/HISTORY TABLE.                      * *00350000
003600* * 3) EVERY NTH RECORD (IE: INITIAL SETTING 1000), REPORT     * *00360000
003700* *    RECORD COUNT AND CURRENT DATE/TIME.  THIS WILL ASSIST   * *00370000
003800* *    WITH RUN-TIME ESTIMATE OF TIME REMAINING TO COMPLETE.   * *00380000
003900* ************************************************************** *00390000
004000 ENVIRONMENT DIVISION.                                            00400000
004100 CONFIGURATION SECTION.                                           00410000
004200 SOURCE-COMPUTER.        IBM-3090.                                00420000
004300 OBJECT-COMPUTER.        IBM-3090.                                00430000
004400                                                                  00440000
004500 INPUT-OUTPUT SECTION.                                            00450000
004600 FILE-CONTROL.                                                    00460000
004700                                                                  00470000
004800     SELECT IN-DRIVER-FILE                ASSIGN TO IN01.         00480000
004900     SELECT OUT-EXTRACT-FILE              ASSIGN TO OUT01.        00490000
005000                                                                  00500000
005100******************************************************************00510000
005200 DATA DIVISION.                                                   00520000
005300 FILE SECTION.                                                    00530000
005400                                                                  00540000
005500 FD  IN-DRIVER-FILE                                               00550000
005600     RECORDING MODE IS F                                          00560000
005700     LABEL RECORDS ARE STANDARD                                   00570000
005800     BLOCK CONTAINS 0 RECORDS.                                    00580000
005900 01  IN-DRIVER-RECORD                PIC  X(004).                 00590000
006000                                                                  00600000
006100**** TPLNSHP:                                                     00610000
006200 FD  OUT-EXTRACT-FILE                                             00620000
006300     RECORDING MODE IS F                                          00630000
006400     LABEL RECORDS ARE STANDARD                                   00640000
006500     BLOCK CONTAINS 0 RECORDS.                                    00650000
006600 01  OUT-EXTRACT-RECORD              PIC  X(184).                 00660000
006700                                                                  00670000
006800                                                                  00680000
006900                                                                  00690000
007000 WORKING-STORAGE SECTION.                                         00700000
007100                                                                  00710000
007200 01  PC-PROGRAM-CONSTANTS.                                        00720000
007300     05  PC-CURRENT-PROGRAM-NAME     PIC X(08) VALUE 'AHKUT022'.  00730000
007400     05  PC-PGM-PROGRESS-DESC.                                    00740000
007500         10  PC-BEGINNING            PIC X(09) VALUE 'BEGINNING'. 00750000
007600         10  PC-CONTINUING           PIC X(10) VALUE              00760000
007700                                               'CONTINUING'.      00770000
007800         10  PC-ENDING               PIC X(06) VALUE 'ENDING'.    00780000
007900         10  PC-ABENDING             PIC X(08) VALUE 'ABENDING'.  00790000
008000     05  PC-ABEND-INFO.                                           00800000
008100         10  PC-ABEND                PIC X(11) VALUE              00810000
008200                                               '** ABEND **'.     00820000
008300         10  PC-ABEND-MSG-PARA       PIC X(15) VALUE              00830000
008400                                               '- PARA       : '. 00840000
008500         10  PC-ABEND-MSG-DISPLAY-PARA                            00850000
008600                                     PIC X(15) VALUE              00860000
008700                                               '  CALLED PARA: '. 00870000
008800         10  PC-ABEND-MSG-NUMBER     PIC X(15) VALUE              00880000
008900                                               '  FOR ABEND# : '. 00890000
009000         10  PC-ABEND-MSG-DESC       PIC X(15) VALUE              00900000
009100                                               '- ERROR IS   : '. 00910000
009200         10  PC-ABEND-MSG-INDENT-15  PIC X(15) VALUE SPACES.      00920000
009300         10  PC-ABEND-MSG-ACTION     PIC X(15) VALUE              00930000
009400                                               '- ACTION     : '. 00940000
009500     05  PC-HOW-OFTEN-TO-DISPLAY     PIC 9(9)  VALUE 5000.        00950004
009600                                                                  00960000
009700 01  PS-PROGRAM-SWITCHES.                                         00970000
009800     05  PS-IN-DRIVER-EOF-SW         PIC X(01) VALUE 'N'.         00980000
009900         88  PS-IN-DRIVER-EOF                  VALUE 'Y'.         00990000
010000         88  PS-IN-DRIVER-NOT-EOF              VALUE 'N'.         01000000
010100     05  PS-CURSOR-HAS-DATA-SW       PIC X(01) VALUE 'N'.         01010000
010200         88  PS-CURSOR-HAS-DATA                VALUE 'Y'.         01020000
010300         88  PS-CURSOR-HAS-NO-DATA             VALUE 'N'.         01030000
010400     05  PS-TABLE-LOOP-DONE-SW       PIC X(01) VALUE 'N'.         01040000
010500         88  PS-TABLE-LOOP-DONE                VALUE 'Y'.         01050000
010600         88  PS-TABLE-LOOP-NOT-DONE            VALUE 'N'.         01060000
010700                                                                  01070000
010800 01  PV-PROGRAM-VARIABLES.                                        01080000
010900     05  PV-PO-NBR-COMP              PIC S9(9) VALUE 0 COMP.      01090000
011000     05  PV-PO-NBR-NUM               PIC  9(9) VALUE 0.           01100001
011100     05  PV-IN-DRIVER-RECS-READ-CNT  PIC  9(9) VALUE 0.           01110000
011200     05  PV-RECS-WITH-MATCHES-CNT    PIC  9(9) VALUE 0.           01120000
011300     05  PV-TABLE-ROW-SELECT-CNT     PIC  9(9) VALUE 0.           01130000
011400     05  PV-EXTRACT-WRITTEN-CNT      PIC  9(9) VALUE 0.           01140000
011500                                                                  01150000
011600     05  PV-PARAGRAPH-NAME           PIC X(30) VALUE SPACES.      01160000
011700     05  PV-DB2-OPERATION-MSG-1      PIC X(79) VALUE SPACES.      01170000
011800     05  PV-DB2-TABLE-NAME           PIC X(18) VALUE SPACES.      01180000
011900     05  PV-DISPLAY-NTH-MULTIPLE     PIC 9(9)  VALUE 0.           01190000
012000     05  PV-DISPLAY-NTH-REMAINDER    PIC 9(9)  VALUE 0.           01200000
012100     05  PV-SQLCODE                  PIC +999  VALUE ZERO.        01210000
012200                                                                  01220000
012300     05  PV-TMST                     PIC X(26) VALUE SPACES.      01230000
012400     05  PV-TIMESTAMP-DETAIL                                      01240000
012500         REDEFINES                                                01250000
012600         PV-TMST.                                                 01260000
012700         10  PV-TIMESTAMP-19.                                     01270000
012800             15  PV-TMS-DATE.                                     01280000
012900                 20  PV-TMS-YEAR.                                 01290000
013000                     25  PV-TMS-CC   PIC X(02).                   01300000
013100                     25  PV-TMS-YY   PIC X(02).                   01310000
013200                 20  FILLER          PIC X(01).                   01320000
013300                 20  PV-TMS-MONTH    PIC X(02).                   01330000
013400                 20  FILLER          PIC X(01).                   01340000
013500                 20  PV-TMS-DAY      PIC X(02).                   01350000
013600             15  FILLER              PIC X(01).                   01360000
013700             15  PV-TMS-HOUR         PIC X(02).                   01370000
013800             15  FILLER              PIC X(01).                   01380000
013900             15  PV-TMS-MINUTE       PIC X(02).                   01390000
014000             15  FILLER              PIC X(01).                   01400000
014100             15  PV-TMS-SECOND       PIC X(02).                   01410000
014200         10  FILLER                  PIC X(01).                   01420000
014300         10  PV-TMS-MSECOND          PIC X(06).                   01430000
014400                                                                  01440000
014500 01  DM-DISPLAY-MESSAGE.                                          01450000
014600     05  DM-01-10.                                                01460000
014700         10  DM-PROGRAM              PIC X(08) VALUE SPACE.       01470000
014800         10  FILLER                  PIC X(02) VALUE ': '.        01480000
014900     05  DM-11-80.                                                01490000
015000         10  FILLER                  PIC X(37) VALUE              01500000
015100                        'SELECT ROWS MATCHING PO DRIVER FILE, '.  01510000
015200         10  FILLER                  PIC X(30) VALUE              01520000
015300                        'CREATING TPLNSHP EXTRACT FILE.'.         01530000
015400         10  FILLER                  PIC X(01) VALUE SPACE.       01540000
015500         10  FILLER                  PIC X(01) VALUE ALL '*'.     01550000
015600     05  DM-81-120.                                               01560000
015700         10  FILLER                  PIC X(40) VALUE ALL '*'.     01570000
015800                                                                  01580000
015900 01  DP-DISPLAY-PROGRESS-MSG.                                     01590000
016000     05  DP-PROGRAM                  PIC X(08) VALUE SPACE.       01600000
016100     05  FILLER                      PIC X(02) VALUE SPACE.       01610000
016200     05  DP-STATUS-DESCRIPTION       PIC X(10) VALUE SPACE.       01620000
016300     05  FILLER                      PIC X(04) VALUE ' AT '.      01630000
016400     05  DP-TIMESTAMP-19             PIC X(19) VALUE SPACE.       01640000
016500     05  FILLER                      PIC X(03) VALUE '.  '.       01650000
016600     05  FILLER                      PIC X(03) VALUE              01660000
016700                                         'IN:'.                   01670000
016800     05  DP-IN-CNT                   PIC ZZZ,ZZZ,ZZ9              01680000
016900                                               VALUE ZERO.        01690000
017000     05  FILLER                      PIC X(02) VALUE ', '.        01700000
017100*    05  FILLER                      PIC X(16) VALUE              01710000
017200*                                        'DRIVER W/ROW(S):'.      01720000
017300*    05  DP-MATCHES-FOUND-CNT        PIC ZZZ,ZZZ,ZZ9              01730000
017400*                                              VALUE ZERO.        01740000
017500*    05  FILLER                      PIC X(02) VALUE ', '.        01750000
017600     05  FILLER                      PIC X(14) VALUE              01760000
017700                                         'ROWS SELECTED:'.        01770000
017800     05  DP-ROWS-SELECTED-CNT        PIC ZZZ,ZZZ,ZZ9              01780000
017900                                               VALUE ZERO.        01790000
018000     05  FILLER                      PIC X(02) VALUE ', '.        01800000
018100     05  FILLER                      PIC X(04) VALUE              01810000
018200                                         'OUT:'.                  01820000
018300     05  DP-OUT-CNT                  PIC ZZZ,ZZZ,ZZ9              01830000
018400                                               VALUE ZERO.        01840000
018500     05  FILLER                      PIC X(01) VALUE '.'.         01850000
018600                                                                  01860000
018700 01  ABEND-CODE                      PIC S9(04)                   01870000
018800                                               VALUE ZEROES       01880000
018900                                               COMP SYNC.         01890000
019000                                                                  01900000
019100*---------------------------------------------------------------* 01910000
019200*  DB2 FORMATTED MESSAGE AREA                                     01920000
019300*---------------------------------------------------------------* 01930000
019400     COPY DPWS004.                                                01940000
019500                                                                  01950000
019600                                                                  01960000
019700*---------------------------------------------------------------* 01970000
019800*  AHRD002  - RECORD LAYOUT FOR PO DRIVER FILE, INPUT.          * 01980006
019900*---------------------------------------------------------------* 01990000
020000     COPY AHRD002.                                                02000006
020100                                                                  02010000
020200                                                                  02020000
020300*---------------------------------------------------------------* 02030000
020400*    DB2 AREA FOR TPLNSHP                                       * 02040000
020500*---------------------------------------------------------------* 02050000
020600     EXEC SQL                                                     02060000
020700          INCLUDE TPLNSHP                                         02070000
020800     END-EXEC.                                                    02080000
020900                                                                  02090000
021000*---------------------------------------------------------------* 02100000
021100*    DB2 AREA FOR COMMUNICATIONS                                * 02110000
021200*---------------------------------------------------------------* 02120000
021300     EXEC SQL                                                     02130000
021400          INCLUDE SQLCA                                           02140000
021500     END-EXEC.                                                    02150000
021600                                                                  02160000
021700*---------------------------------------------------------------* 02170000
021800*    DEFINE CURSOR FOR TPLNSHP :                                * 02180000
021900*    PULL ALL AVAILABLE COLUMNS, SO EXTRACT FILE WILL CONTAIN   * 02190000
022000*    ALL DATA TO POPULATE "ARCHIVE HISTORY" COPY OF THIS TABLE. * 02200000
022100*---------------------------------------------------------------* 02210000
022200     EXEC SQL                                                     02220000
022300          DECLARE TABLE-CURSOR CURSOR FOR                         02230000
022400           SELECT SHIPT_NBR                                       02240000
022500                 ,VER_NBR                                         02250000
022600                 ,VER_STATUS_CDE                                  02260000
022700                 ,SHIPT_TYP_CDE                                   02270000
022800                 ,SHIPT_DEST_NBR                                  02280000
022900                 ,SHIPT_POINT_TXT                                 02290000
023000                 ,FOB_POINT_TXT                                   02300000
023100                 ,FRGT_PAYT_CDE                                   02310000
023200                 ,VEND_FRGT_PCT                                   02320000
023300                 ,KOHLS_FRGT_PCT                                  02330000
023400                 ,LATE_SHIPT_IND                                  02340000
023500                 ,EARLY_SHIPT_IND                                 02350000
023600                 ,PARTIAL_SHIPT_IND                               02360000
023700                 ,BCKORDS_PERMTD_IND                              02370000
023800                 ,PORT_ENTR_DESC                                  02380000
023900                 ,STRT_FCTRY_DTE                                  02390000
024000                 ,LAST_FCTRY_DTE                                  02400000
024100                 ,DONT_SHIP_BEF_DTE                               02410000
024200                 ,CAN_IFNOT_SHIP_DTE                              02420000
024300                 ,EXT_CAN_DTE                                     02430000
024400                 ,LAST_UPD_TMST                                   02440000
024500                 ,STATUS_CDE                                      02450000
024600                 ,ENT_ID                                          02460000
024700                 ,PO_NBR                                          02470000
024800                 ,LAST_UPD_BY_UID                                 02480000
024900                 ,FOB_CDE                                         02490000
025000                 ,POE_CDE                                         02500000
025200           FROM   TPLNSHP                                         02520000
025300          WHERE  (PO_NBR = :PV-PO-NBR-COMP)                       02530000
025500            FOR  FETCH ONLY                                       02550000
025600           WITH  UR                                               02560000
025700     END-EXEC.                                                    02570000
025800                                                                  02580000
025900                                                                  02590000
026000 PROCEDURE DIVISION.                                              02600000
026100********************                                              02610000
026200                                                                  02620000
026300 0000-PROGRAM-MAINLINE.                                           02630000
026400                                                                  02640000
026500     PERFORM 1000-INITIALIZE.                                     02650000
026600                                                                  02660000
026700     SET PS-IN-DRIVER-NOT-EOF TO TRUE.                            02670000
026800     PERFORM 2000-PROCESS-DRIVER-FILE                             02680000
026900         UNTIL PS-IN-DRIVER-EOF.                                  02690000
027000                                                                  02700000
027100     PERFORM 6000-EOJ-ROUTINE.                                    02710000
027200     STOP RUN.                                                    02720000
027300                                                                  02730000
027400                                                                  02740000
027500* ************************************************************** *02750000
027600* * INITIALIZATIONS                                            * *02760000
027700* ************************************************************** *02770000
027800 1000-INITIALIZE.                                                 02780000
027900                                                                  02790000
028000     MOVE PC-CURRENT-PROGRAM-NAME TO DM-PROGRAM.                  02800000
028100     DISPLAY DM-DISPLAY-MESSAGE.                                  02810000
028200                                                                  02820000
028300     MOVE PC-BEGINNING              TO DP-STATUS-DESCRIPTION.     02830000
028400     PERFORM 6200-DISPLAY-PGM-PROGRESS.                           02840000
028500                                                                  02850000
028600     PERFORM 9000-OPEN-IN-DRIVER-FILE.                            02860000
028700     PERFORM 9700-OPEN-OUT-EXTRACT-FILE.                          02870000
028800                                                                  02880000
028900                                                                  02890000
029000* ************************************************************** *02900000
029100* * 1) GET NEXT RECORD FROM DRIVER FILE, AND                   * *02910000
029200* *    1A- POPULATE KEY (WHERE CLAUSE) FOR TABLE CURSOR        * *02920000
029300* *    1B- OPEN TABLE CURSOR                                   * *02930000
029400* *    1C- LOOP THRU TABLE CURSOR TO EXTRACT ALL               * *02940000
029500* *        ROWS FOR THIS INPUT DRIVER RECORD                   * *02950000
029600* *    2) FOR EACH ROW,                                        * *02960000
029700* *       2A- INCREMENT COUNTS                                 * *02970000
029800* *       2B- WRITE EXTRACT RECORD                             * *02980000
029900* *    1D- CLOSE TABLE CURSOR                                  * *02990000
030000* ************************************************************** *03000000
030100 2000-PROCESS-DRIVER-FILE.                                        03010000
030200                                                                  03020000
030300     PERFORM 9050-READ-IN-DRIVER-FILE.                            03030000
030400     IF PS-IN-DRIVER-EOF                                          03040000
030500         CONTINUE                                                 03050000
030600     ELSE                                                         03060000
030700         MOVE AH002-PO-NBR TO         PV-PO-NBR-COMP              03070006
030800                                      PV-PO-NBR-NUM               03080000
030900         PERFORM 2100-CHECK-PGM-PROGRESS                          03090000
031000         SET PS-TABLE-LOOP-NOT-DONE   TO TRUE                     03100000
031100         SET PS-CURSOR-HAS-NO-DATA    TO TRUE                     03110000
031200         PERFORM 9100-OPEN-TABLE-CURSOR                           03120000
031300         PERFORM 3000-EXTRACT-ROWS-FROM-TABLE                     03130000
031400             UNTIL PS-TABLE-LOOP-DONE                             03140000
031500         PERFORM 9190-CLOSE-TABLE-CURSOR                          03150000
031600     END-IF.                                                      03160000
031700                                                                  03170000
031800                                                                  03180000
031900* ************************************************************** *03190000
032000* *    EVERY NTH RECORD (IE: INITIAL SETTING 1000), REPORT     * *03200000
032100* *    RECORD COUNT AND CURRENT DATE/TIME.  THIS WILL ASSIST   * *03210000
032200* *    WITH RUN-TIME ESTIMATE OF TIME REMAINING TO COMPLETE.   * *03220000
032300* ************************************************************** *03230000
032400 2100-CHECK-PGM-PROGRESS.                                         03240000
032500     DIVIDE    PV-IN-DRIVER-RECS-READ-CNT                         03250000
032600         BY        PC-HOW-OFTEN-TO-DISPLAY                        03260000
032700         GIVING    PV-DISPLAY-NTH-MULTIPLE                        03270000
032800         REMAINDER PV-DISPLAY-NTH-REMAINDER.                      03280000
032900                                                                  03290000
033000     IF PV-DISPLAY-NTH-REMAINDER = ZERO                           03300000
033100         MOVE PC-CONTINUING         TO DP-STATUS-DESCRIPTION      03310000
033200         PERFORM 6200-DISPLAY-PGM-PROGRESS                        03320000
033300     END-IF.                                                      03330000
033400                                                                  03340000
033500                                                                  03350000
033600* ************************************************************** *03360000
033700* * EXTRACT ROWS FROM TABLE, FOR THE CURRENT DRIVER RECORD     * *03370000
033800* ************************************************************** *03380000
033900 3000-EXTRACT-ROWS-FROM-TABLE.                                    03390000
034000     INITIALIZE DCLTPLNSHP.                                       03400000
034100     PERFORM 9150-FETCH-TABLE-CURSOR.                             03410000
034200     IF PS-TABLE-LOOP-DONE                                        03420000
034300         CONTINUE                                                 03430000
034400     ELSE                                                         03440000
034500         PERFORM 9750-WRITE-EXTRACT-RECORD                        03450000
034600     END-IF.                                                      03460000
034700                                                                  03470000
034800                                                                  03480000
034900* ************************************************************** *03490000
035000* * DISPLAY END OF RUN MESSAGE, CLOSE THE OUTPUT FILES         * *03500002
035100* ************************************************************** *03510000
035200 6000-EOJ-ROUTINE.                                                03520000
035300                                                                  03530000
035400     PERFORM 9090-CLOSE-IN-DRIVER-FILE.                           03540000
035500     PERFORM 9790-CLOSE-OUT-EXTRACT-FILE.                         03550000
035600                                                                  03560000
035700     MOVE PC-ENDING                 TO DP-STATUS-DESCRIPTION.     03570000
035800     PERFORM 6200-DISPLAY-PGM-PROGRESS.                           03580000
035900                                                                  03590000
036000                                                                  03600000
036100* ************************************************************** *03610000
036200* * DISPLAY PROGRAM PROGRESS.                                  * *03620000
036300* ************************************************************** *03630000
036400 6200-DISPLAY-PGM-PROGRESS.                                       03640000
036500                                                                  03650000
036600     EXEC SQL                                                     03660000
036700          SET :PV-TMST = CURRENT TIMESTAMP                        03670000
036800     END-EXEC.                                                    03680000
036900                                                                  03690000
037000     MOVE PC-CURRENT-PROGRAM-NAME   TO DP-PROGRAM.                03700000
037100     MOVE PV-TIMESTAMP-19           TO DP-TIMESTAMP-19.           03710000
037200     MOVE PV-IN-DRIVER-RECS-READ-CNT                              03720000
037300                                    TO DP-IN-CNT.                 03730000
037400*    MOVE PV-RECS-WITH-MATCHES-CNT  TO DP-MATCHES-FOUND-CNT.      03740000
037500     MOVE PV-TABLE-ROW-SELECT-CNT   TO DP-ROWS-SELECTED-CNT.      03750000
037600     MOVE PV-EXTRACT-WRITTEN-CNT    TO DP-OUT-CNT.                03760000
037700                                                                  03770000
037800     DISPLAY DP-DISPLAY-PROGRESS-MSG.                             03780000
037900                                                                  03790000
038000                                                                  03800000
038100* ************************************************************** *03810000
038200* * FILE AND DB2 TABLE ACCESS PARAGRAPHS.                      * *03820000
038300* * 90XX- INPUT:  DRIVER FILE                                  * *03830000
038400* * 91XX- INPUT:  TABLE CURSOR                                 * *03840000
038500* * 97XX- OUTPUT: TABLE EXTRACT                                * *03850000
038600* ************************************************************** *03860000
038700                                                                  03870000
038800* ************************************************************** *03880000
038900* * OPEN  INPUT DRIVER FILE                                    * *03890000
039000* ************************************************************** *03900000
039100 9000-OPEN-IN-DRIVER-FILE.                                        03910000
039200     OPEN  INPUT  IN-DRIVER-FILE.                                 03920000
039300                                                                  03930000
039400                                                                  03940000
039500* ************************************************************** *03950000
039600* * READ  INPUT DRIVER FILE OF ELIGIBLE DATA TO EXTRACT        * *03960000
039700* ************************************************************** *03970000
039800 9050-READ-IN-DRIVER-FILE.                                        03980000
039900     READ IN-DRIVER-FILE                                          03990000
040000          INTO AH002-DRIVER-RECORD-LAYOUT                         04000006
040100          AT END                                                  04010000
040200              SET PS-IN-DRIVER-EOF TO TRUE.                       04020000
040300                                                                  04030000
040400     IF PS-IN-DRIVER-EOF                                          04040000
040500         CONTINUE                                                 04050000
040600     ELSE                                                         04060000
040700         ADD +1 TO PV-IN-DRIVER-RECS-READ-CNT                     04070000
040800     END-IF.                                                      04080000
040900                                                                  04090000
041000                                                                  04100000
041100* ************************************************************** *04110000
041200* * CLOSE INPUT DRIVER FILE                                    * *04120000
041300* ************************************************************** *04130000
041400 9090-CLOSE-IN-DRIVER-FILE.                                       04140000
041500     CLOSE IN-DRIVER-FILE.                                        04150000
041600                                                                  04160000
041700                                                                  04170000
041800* ************************************************************** *04180000
041900* * OPEN  TABLE CURSOR                                         * *04190000
042000* ************************************************************** *04200000
042100 9100-OPEN-TABLE-CURSOR.                                          04210000
042200     EXEC SQL                                                     04220000
042300          OPEN TABLE-CURSOR                                       04230000
042400     END-EXEC.                                                    04240000
042500                                                                  04250000
042600     EVALUATE TRUE                                                04260000
042700         WHEN SQLCODE = ZERO                                      04270000
042800              ADD +1 TO PV-RECS-WITH-MATCHES-CNT                  04280000
042900              SET PS-CURSOR-HAS-DATA TO TRUE                      04290000
043000         WHEN SQLCODE = +100                                      04300000
043100              SET PS-TABLE-LOOP-DONE TO TRUE                      04310000
043200         WHEN SQLWARN0 NOT EQUAL SPACE                            04320000
043300         WHEN SQLCODE  NOT EQUAL ZERO                             04330000
043400              MOVE '9100-OPEN-TABLE-CURSOR'                       04340000
043500                                 TO PV-PARAGRAPH-NAME             04350000
043600              MOVE 'OPEN TABLE CURSOR'                            04360000
043700                                 TO PV-DB2-OPERATION-MSG-1        04370000
043800              MOVE 'TPLNSHP'     TO PV-DB2-TABLE-NAME             04380000
043900              PERFORM 9999-DB2-ABEND                              04390000
044000     END-EVALUATE.                                                04400000
044100                                                                  04410000
044200                                                                  04420000
044300* ************************************************************** *04430000
044400* * FETCH TABLE CURSOR                                         * *04440000
044500* ************************************************************** *04450000
044600 9150-FETCH-TABLE-CURSOR.                                         04460000
044700     EXEC SQL                                                     04470000
044800         FETCH TABLE-CURSOR                                       04480000
044900          INTO  :PLNSHP-SHIPT-NBR                                 04490000
045000               ,:PLNSHP-VER-NBR                                   04500000
045100               ,:PLNSHP-VER-STATUS-CDE                            04510000
045200               ,:PLNSHP-SHIPT-TYP-CDE                             04520000
045300               ,:PLNSHP-SHIPT-DEST-NBR                            04530000
045400               ,:PLNSHP-SHIPT-POINT-TXT                           04540000
045500               ,:PLNSHP-FOB-POINT-TXT                             04550000
045600               ,:PLNSHP-FRGT-PAYT-CDE                             04560000
045700               ,:PLNSHP-VEND-FRGT-PCT                             04570000
045800               ,:PLNSHP-KOHLS-FRGT-PCT                            04580000
045900               ,:PLNSHP-LATE-SHIPT-IND                            04590000
046000               ,:PLNSHP-EARLY-SHIPT-IND                           04600000
046100               ,:PLNSHP-PARTIAL-SHIPT-IND                         04610000
046200               ,:PLNSHP-BCKORDS-PERMTD-IND                        04620000
046300               ,:PLNSHP-PORT-ENTR-DESC                            04630000
046400               ,:PLNSHP-STRT-FCTRY-DTE                            04640000
046500               ,:PLNSHP-LAST-FCTRY-DTE                            04650000
046600               ,:PLNSHP-DONT-SHIP-BEF-DTE                         04660000
046700               ,:PLNSHP-CAN-IFNOT-SHIP-DTE                        04670000
046800               ,:PLNSHP-EXT-CAN-DTE                               04680000
046900               ,:PLNSHP-LAST-UPD-TMST                             04690000
047000               ,:PLNSHP-STATUS-CDE                                04700000
047100               ,:PLNSHP-ENT-ID                                    04710000
047200               ,:PLNSHP-PO-NBR                                    04720000
047300               ,:PLNSHP-LAST-UPD-BY-UID                           04730000
047400               ,:PLNSHP-FOB-CDE                                   04740000
047500               ,:PLNSHP-POE-CDE                                   04750000
047600     END-EXEC.                                                    04760000
047700                                                                  04770000
047800     EVALUATE TRUE                                                04780000
047900         WHEN SQLCODE = ZERO                                      04790000
048000              ADD +1                 TO PV-TABLE-ROW-SELECT-CNT   04800000
048100              SET PS-CURSOR-HAS-DATA TO TRUE                      04810000
048200         WHEN SQLCODE = +100                                      04820000
048300              SET PS-TABLE-LOOP-DONE TO TRUE                      04830000
048400         WHEN SQLWARN0 NOT EQUAL SPACE                            04840000
048500         WHEN SQLCODE NOT EQUAL ZERO                              04850000
048600              MOVE '9150-FETCH-TABLE-CURSOR'                      04860000
048700                                 TO PV-PARAGRAPH-NAME             04870000
048800              MOVE 'FETCH TABLE CURSOR'                           04880000
048900                                 TO PV-DB2-OPERATION-MSG-1        04890000
049000              MOVE 'TPLNSHP'     TO PV-DB2-TABLE-NAME             04900000
049100              PERFORM 9999-DB2-ABEND                              04910000
049200     END-EVALUATE.                                                04920000
049300                                                                  04930000
049400                                                                  04940000
049500* ************************************************************** *04950000
049600* * CLOSE TABLE CURSOR                                         * *04960000
049700* ************************************************************** *04970000
049800 9190-CLOSE-TABLE-CURSOR.                                         04980000
049900     EXEC SQL                                                     04990000
050000          CLOSE TABLE-CURSOR                                      05000000
050100     END-EXEC.                                                    05010000
050200                                                                  05020000
050300     EVALUATE TRUE                                                05030000
050400         WHEN SQLCODE = ZERO                                      05040000
050500              CONTINUE                                            05050000
050600         WHEN SQLWARN0 NOT EQUAL SPACE                            05060000
050700         WHEN SQLCODE NOT EQUAL ZERO                              05070000
050800              MOVE '9190-CLOSE-TABLE-CURSOR'                      05080000
050900                                 TO PV-PARAGRAPH-NAME             05090000
051000              MOVE 'CLOSE TABLE CURSOR'                           05100000
051100                                 TO PV-DB2-OPERATION-MSG-1        05110000
051200              MOVE 'TPLNSHP'     TO PV-DB2-TABLE-NAME             05120000
051300              PERFORM 9999-DB2-ABEND                              05130000
051400     END-EVALUATE.                                                05140000
051500                                                                  05150000
051600                                                                  05160000
051700* ************************************************************** *05170000
051800* * OPEN OUTPUT EXTRACT FILE                                   * *05180000
051900* ************************************************************** *05190000
052000 9700-OPEN-OUT-EXTRACT-FILE.                                      05200000
052100     OPEN OUTPUT OUT-EXTRACT-FILE.                                05210000
052200                                                                  05220000
052300                                                                  05230000
052400* ************************************************************** *05240000
052500* * WRITE A RECORD TO THE TABLE EXTRACT FILE                   * *05250000
052600* ************************************************************** *05260000
052700 9750-WRITE-EXTRACT-RECORD.                                       05270000
052800     WRITE  OUT-EXTRACT-RECORD  FROM  DCLTPLNSHP.                 05280000
052900     ADD +1 TO PV-EXTRACT-WRITTEN-CNT.                            05290000
053000                                                                  05300000
053100                                                                  05310000
053200* ************************************************************** *05320000
053300* * CLOSE OUTPUT EXTRACT FILE                                  * *05330000
053400* ************************************************************** *05340000
053500 9790-CLOSE-OUT-EXTRACT-FILE.                                     05350000
053600     CLOSE OUT-EXTRACT-FILE.                                      05360000
053700                                                                  05370000
053800                                                                  05380000
053900* ************************************************************** *05390000
054000* * DISPLAY INFORMATION NEEDED FOR DEBUGGING/MAINTENANCE/SUPPORT *05400000
054100* * AND CALL THE ABEND PROCESSOR IN THE EVENT THAT AN          * *05410000
054200* * SQL ERROR OR WARNING CODE OCCURS.                          * *05420000
054300* ************************************************************** *05430000
054400 9999-DB2-ABEND.                                                  05440000
054500                                                                  05450000
054600     DISPLAY PC-CURRENT-PROGRAM-NAME                              05460000
054700             ' 9999-DB2-ABEND'.                                   05470000
054800     DISPLAY PC-CURRENT-PROGRAM-NAME                              05480000
054900             ' ** ABEND           **'.                            05490000
055000     DISPLAY PC-CURRENT-PROGRAM-NAME                              05500000
055100             ' ** PARAGRAPH       ** = ' PV-PARAGRAPH-NAME.       05510000
055200     DISPLAY PC-CURRENT-PROGRAM-NAME                              05520000
055300             ' ** TABLES AFFECTED ** = ' PV-DB2-TABLE-NAME.       05530000
055400     DISPLAY PC-CURRENT-PROGRAM-NAME                              05540000
055500             ' ** OPERATION       ** = ' PV-DB2-OPERATION-MSG-1.  05550000
055600                                                                  05560000
055700     DISPLAY PC-CURRENT-PROGRAM-NAME                              05570000
055800             ' ** SQLCODE         ** = ' SQLCODE.                 05580000
055900     MOVE SQLCODE TO PV-SQLCODE.                                  05590000
056000     DISPLAY PC-CURRENT-PROGRAM-NAME                              05600000
056100             ' ** PV-SQLCODE      ** = ' PV-SQLCODE '.'.          05610000
056200                                                                  05620000
056300     DISPLAY PC-CURRENT-PROGRAM-NAME                              05630000
056400             ' ** SQLWARN0        ** = ' SQLWARN0 '.'.            05640000
056500                                                                  05650000
056600                                                                  05660000
056700*----------------------------------------------------------------*05670000
056800* THIS COPY BOOK MEMBER CONTAINS THE PROCEDURE DIVISION STATE-   *05680000
056900* MENTS THAT ARE REQUIRED TO UTILIZE THE DB2 ABEND MODULE        *05690000
057000* 'DSNTIAR' AND CONVERT THE SQLCA INFORMATION INTO A READABLE    *05700000
057100* FORMAT.                                                        *05710000
057200*----------------------------------------------------------------*05720000
057300     COPY DPPD004.                                                05730000
057400                                                                  05740000
057500     MOVE PC-ABENDING               TO DP-STATUS-DESCRIPTION.     05750000
057600     PERFORM 6200-DISPLAY-PGM-PROGRESS.                           05760000
057700     PERFORM 9090-CLOSE-IN-DRIVER-FILE.                           05770000
057800     PERFORM 9790-CLOSE-OUT-EXTRACT-FILE.                         05780000
057900                                                                  05790000
058000*----------------------------------------------------------------*05800000
058100* CALL ABEND                                                     *05810000
058200*----------------------------------------------------------------*05820000
058300     MOVE +4013                  TO ABEND-CODE.                   05830000
058400     CALL 'ILBOABN0' USING ABEND-CODE.                            05840000
058500*                                                                 05850000
