000100* ************************************************************** *00010000
000200* * AHRD006.                                                   * *00020000
000300* * ARCHIVE/HISTORY DATA OFFLOAD.                              * *00030000
000400* * TTRBNTF EXTRACT FILE                                       * *00040000
000500* * LRECL: 247                                                 * *00050000
000600* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00060000
000700* *    NOTE: IF THE DCLGEN FOR TTRBNTF (DCLTTRBNTF) IS CHANGED,* *00070000
000800* *    THIS COPYBOOK MUST BE CHANGED ALSO.                     * *00080000
000900* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00090000
001000* ************************************************************** *00100000
001100 01 AH006-TTRBNTF.                                                00110000
001110    10 AH006-NOTIF-NBR               PIC  S9(9) COMP.             00111000
001120    10 AH006-OPER-UNT-ID             PIC  S9(4) COMP.             00112000
001130    10 AH006-FCLTY-ID                PIC  S9(4) COMP.             00113000
001140    10 AH006-DEPT-NBR                PIC   X(3).                  00114000
001150    10 AH006-ENT-ID                  PIC  S9(9) COMP.             00115000
001160    10 AH006-PO-NBR                  PIC  S9(9) COMP.             00116000
001170    10 AH006-PO-LNE-NBR              PIC  S9(9) COMP.             00117000
001180    10 AH006-REC-SEQ-NBR             PIC  S9(9) COMP.             00118000
001190    10 AH006-TRBL-RSN-CDE            PIC  S9(4) COMP.             00119000
001191    10 AH006-NOTIF-TMST              PIC   X(26).                 00119100
001192    10 AH006-NOTIF-UID               PIC   X(8).                  00119200
001193    10 AH006-RESOLVED-IND            PIC   X(1).                  00119300
001194    10 AH006-RESOLVED-TMST           PIC   X(26).                 00119400
001195    10 AH006-RESOLVED-UID            PIC   X(8).                  00119500
001196    10 AH006-ACKNOWLG-TMST           PIC   X(26).                 00119600
001197    10 AH006-ACKNOWLG-UID            PIC   X(8).                  00119700
001198    10 AH006-CNTCT-EXT               PIC  S9(9) COMP.             00119800
001199    10 AH006-FCLTY-AREA-ID           PIC   X(6).                  00119900
001200    10 AH006-SHIPT-ID                PIC  S9(9) COMP.             00120000
001201    10 AH006-PKSL-SEQ-NBR            PIC  S9(4) COMP.             00120100
001202    10 AH006-PKSL-LNE-NBR            PIC  S9(9) COMP.             00120200
001203    10 AH006-WORK-ORD-SEQ-NBR        PIC  S9(4) COMP.             00120300
001204    10 AH006-WO-INSTR-SEQ-NBR        PIC  S9(4) COMP.             00120400
001205    10 AH006-OVER-SHT-PCT            PIC  S9(4) COMP.             00120500
001206    10 AH006-LAST-DTL-CRE-TMST       PIC   X(26).                 00120600
001207    10 AH006-CRE-IND                 PIC   X(1).                  00120700
001208    10 AH006-PRORATE-IND             PIC   X(1).                  00120800
001209    10 AH006-RTV-IND                 PIC   X(1).                  00120900
001210    10 AH006-RTV-RESPONSE-TMST       PIC   X(26).                 00121000
001211    10 AH006-PO-VER-NBR              PIC  S9(9) COMP.             00121100
001212    10 AH006-PO-LNE-VER-NBR          PIC  S9(9) COMP.             00121200
001213    10 AH006-PLN-SHIP-VER-NBR        PIC  S9(9) COMP.             00121300
001214    10 AH006-ERLY-LTE-DAY-QTY        PIC  S9(4) COMP.             00121400
001215    10 AH006-INITR-ID                PIC  S9(4) COMP.             00121500
001216    10 AH006-RSPNB-RSLU-ID           PIC  S9(4) COMP.             00121600
001217    10 AH006-PFMC-TRKG-ID            PIC  S9(4) COMP.             00121700
001218    10 AH006-ACTVY-RSLU-CDE          PIC   X(2).                  00121800
001219    10 AH006-INITR-ENT-ID            PIC  S9(9) COMP.             00121900
001220    10 AH006-FOB-CDE                 PIC   X(3).                  00122000
001221    10 AH006-POE-CDE                 PIC   X(3).                  00122100
001222    10 AH006-PREPK-ID                PIC  S9(4) COMP.             00122200
