000100* ************************************************************** *00010000
000200* * AHRD020.                                                   * *00020000
000300* * ARCHIVE/HISTORY DATA OFFLOAD.                              * *00030000
000400* * DRIVER FILE RECORD LAYOUT: INPUT.                          * *00040000
000500* * LRECL: 665                                                 * *00050002
000600* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00060000
000700* *    NOTE: IF THE DCLGEN FOR TAUCNTK(DCLTAUCNTK) IS CHANGED, * *00070000
000800* *    THIS COPYBOOK MUST ALSO BE CHANGED                      * *00080000
000900* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00090000
001000* ************************************************************** *00100000
001100 01 AH020-DRIVER-RECORD-LAYOUT.                                   00110000
001200     05 AH020-TAUCNTK-FIELDS.                                     00120001
              10 AH020-CONTNR-ID           PIC   X(12) VALUE SPACE.     00130000
              10 AH020-CONTNR-SEQ-NBR      PIC  S9(4) COMP VALUE ZERO.  00140000
              10 AH020-CONSLR-SCAC-ID      PIC   X(4)  VALUE SPACE.     00150000
              10 AH020-MOM-IMPRT-TRIP-ID   PIC   X(10) VALUE SPACE.     00160000
              10 AH020-MOM-DPRTR-TMST      PIC   X(26) VALUE SPACE.     00170000
              10 AH020-MOM-POE-DELY-TMST   PIC   X(26) VALUE SPACE.     00180000
              10 AH020-MOM-CARR-SCAC-ID    PIC   X(4)  VALUE SPACE.     00190000
              10 AH020-MOM-FOB-CDE         PIC   X(5)  VALUE SPACE.     00200000
              10 AH020-MOM-IMPRT-VEH-NM    PIC   X(25) VALUE SPACE.     00210000
              10 AH020-MOM-TRIP-TYP-CDE    PIC   X(1)  VALUE SPACE.     00220000
              10 AH020-MOM-DEST-POE-CDE    PIC   X(4)  VALUE SPACE.     00230000
              10 AH020-FDR-IMPRT-TRIP-ID   PIC   X(10) VALUE SPACE.     00240000
              10 AH020-FDR-DPRTR-TMST      PIC   X(26) VALUE SPACE.     00250000
              10 AH020-FDR-POE-DELY-TMST   PIC   X(26) VALUE SPACE.     00260000
              10 AH020-FDR-CARR-SCAC-ID    PIC   X(4)  VALUE SPACE.     00270000
              10 AH020-FDR-FOB-CDE         PIC   X(5)  VALUE SPACE.     00280000
              10 AH020-FDR-IMPRT-VEH-NM    PIC   X(25) VALUE SPACE.     00290000
              10 AH020-FDR-TRIP-TYP-CDE    PIC   X(1)  VALUE SPACE.     00300000
              10 AH020-FDR-DEST-POE-CDE    PIC   X(4)  VALUE SPACE.     00310000
              10 AH020-SIZE-CDE            PIC   X(5)  VALUE SPACE.     00320000
              10 AH020-CART-CNT            PIC  S9(9) COMP VALUE ZERO.  00330000
              10 AH020-CBMT-QTY            PIC  S9(9)V9(2) COMP-3       00340000
                                                   VALUE ZERO.          00350000
              10 AH020-WT-KGRM-QTY         PIC  S9(9) COMP VALUE ZERO.  00360000
              10 AH020-UNT-QTY             PIC  S9(9) COMP VALUE ZERO.  00370000
              10 AH020-ORGN-SHPD-FR-CDE    PIC   X(3)  VALUE SPACE.     00380000
              10 AH020-ORGN-SHPD-TO-CDE    PIC   X(3)  VALUE SPACE.     00390000
              10 AH020-EST-LBD-NM          PIC   X(30) VALUE SPACE.     00400000
              10 AH020-EST-LBD-TMST        PIC   X(26) VALUE SPACE.     00410000
              10 AH020-RISU-DO-RSN-CDE     PIC   X(3)  VALUE SPACE.     00420000
              10 AH020-BKR-FRGT-RLSE-TMST  PIC   X(26) VALUE SPACE.     00430000
              10 AH020-DO-TO-DCONSLR-TMST  PIC   X(26) VALUE SPACE.     00440000
              10 AH020-DO-RCVD-TMST        PIC   X(26) VALUE SPACE.     00450000
              10 AH020-CONTNR-PU-TMST      PIC   X(26) VALUE SPACE.     00460000
              10 AH020-DAT-SRC-ENT-ID      PIC  S9(9) COMP VALUE ZERO.  00470000
              10 AH020-LAST-UPD-BY-USR-ID  PIC   X(8)  VALUE SPACE.     00500000
              10 AH020-LAST-UPD-TMST       PIC   X(26) VALUE SPACE.     00510000
              10 AH020-AUD-FUNC-CDE        PIC   X(1)  VALUE SPACE.     00511002
              10 AH020-AUD-TMST            PIC   X(26) VALUE SPACE.     00512002
              10 AH020-ACTL-POE-DELY-TMST  PIC   X(26) VALUE SPACE.     00520000
              10 AH020-ACTL-DEST-POE-CDE   PIC   X(4)  VALUE SPACE.     00530000
              10 AH020-ACTL-LBD-NM         PIC   X(30) VALUE SPACE.     00540000
              10 AH020-ACTL-LBD-TMST       PIC   X(26) VALUE SPACE.     00550000
              10 AH020-DVN-TMST            PIC   X(26) VALUE SPACE.     00560000
              10 AH020-DCONSLR-SCAC-ID     PIC   X(4)  VALUE SPACE.     00570000
              10 AH020-DCONSLR-RET-TMST    PIC   X(26) VALUE SPACE.     00580000
              10 AH020-MOM-POL-CDE         PIC   X(5)  VALUE SPACE.     00590000
              10 AH020-FDR-POL-CDE         PIC   X(5)  VALUE SPACE.     00600000
              10 AH020-MOM-POR-CDE         PIC   X(5)  VALUE SPACE.     00610000
              10 AH020-FDR-POR-CDE         PIC   X(5)  VALUE SPACE.     00620000
              10 AH020-DCONSLR-DELY-TMST   PIC   X(26) VALUE SPACE.     00630000
