000100* ************************************************************** *00010000
000200* * AHRD005.                                                   * *00020004
000300* * ARCHIVE/HISTORY DATA OFFLOAD.                              * *00030000
000400* * TMIITEM EXTRACT FILE.                                      * *00040004
000500* * LRECL: 023                                                 * *00050000
000600* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00060000
000700* *    NOTE: IF THE DCLGEN FOR TMIITEM (DCLTMIITEM) IS CHANGED,* *00070000
000800* *    THIS COPYBOOK MUST ALSO BE CHANGED.                     * *00080004
001300* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00130000
001400* ************************************************************** *00140000
001500 01  AH005-TMIITEM.                                               00150004
001700     05 AH005-PAYT-REQ-SEQ-NBR        PIC S9(9) VALUE ZERO COMP.  00170004
001900     05 AH005-PAYT-REQ-LNE-NBR        PIC S9(9) VALUE ZERO COMP.  00190004
002100     05 AH005-UNT-COST-SEL-CDE        PIC X(1)  VALUE SPACE.      00210004
002200     05 AH005-PO-NBR                  PIC S9(9) VALUE ZERO COMP.  00220004
002500     05 AH005-VER.                                                00250004
002600        10 AH005-VER-NBR              PIC S9(9) VALUE ZERO COMP.  00260004
002800        10 AH005-VER-NBR-NULL-IND     PIC X(01) VALUE SPACE.      00280004
003000           88 AH005-VER-NBR-IS-NULL             VALUE '?'.        00300004
003100           88 AH005-VER-NBR-NOTNULL             VALUE '0'.        00310004
003110           88 AH005-VER-NBR-UNKNOWN             VALUE SPACE.      00311004
003300     05 AH005-PO-LNE.                                             00330004
003400        10 AH005-PO-LNE-NBR           PIC S9(9) VALUE ZERO COMP.  00340004
003600        10 AH005-PO-LNE-NBR-NULL-IND  PIC X(01) VALUE SPACE.      00360004
003800           88 AH005-PO-LNE-NBR-IS-NULL          VALUE '?'.        00380004
003900           88 AH005-PO-LNE-NBR-NOTNULL          VALUE '0'.        00390004
004000           88 AH005-PO-LNE-NBR-UNKNOWN          VALUE SPACE.      00400004
