000100* ************************************************************** *00010000
000200* * AHRD009.                                                   * *00020000
000300* * ARCHIVE/HISTORY DATA OFFLOAD.                              * *00030000
000400* * DRIVER FILE RECORD LAYOUT: INPUT.                          * *00040000
000500* * LRECL: 152                                                 * *00050002
000600* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00060000
000700* *    NOTE: IF THE DCLGEN FOR TIMCNUP(DCLTIMCNUP) IS CHANGED, * *00070003
000800* *    THIS COPYBOOK MUST ALSO BE CHANGED                      * *00080000
000900* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00090000
001000* ************************************************************** *00100000
001100 01 AH009-ARCHIVE-RECORD-LAYOUT.                                  00110000
001200     05 AH009-TIMCNUP-FIELDS.                                     00120000
              10 AH009-CONTNR-ID            PIC   X(12)   VALUE SPACES. 00130000
              10 AH009-CONTNR-SEQ-NBR       PIC  S9(4) COMP VALUE ZERO. 00140000
              10 AH009-PO-NBR               PIC  S9(9) COMP VALUE ZERO. 00150000
              10 AH009-VS-NBR               PIC   X(30) VALUE SPACES.   00160000
              10 AH009-UPC-NBR              PIC  S9(15)V COMP-3         00170000
                                                            VALUE ZERO. 00171000
              10 AH009-PO-LNE-NBR           PIC  S9(9) COMP VALUE ZERO. 00180000
              10 AH009-UPC-CART-CNT         PIC  S9(9) COMP VALUE ZERO. 00190000
              10 AH009-UPC-CBMT-QTY         PIC  S9(7)V9(2) COMP-3      00200001
                                                            VALUE ZERO. 00201000
              10 AH009-UPC-WT-KGRM-QTY      PIC  S9(9) COMP VALUE ZERO. 00210000
              10 AH009-UPC-UNT-QTY          PIC  S9(9) COMP VALUE ZERO. 00220000
              10 AH009-CRE-BY-USR-ID        PIC   X(8) VALUE SPACES.    00230000
              10 AH009-CRE-TMST             PIC   X(26) VALUE SPACES.   00240000
              10 AH009-LAST-UPD-BY-USR-ID   PIC   X(8) VALUE SPACES.    00250000
              10 AH009-LAST-UPD-TMST        PIC   X(26) VALUE SPACES.   00260000
              10 AH009-SKU-NBR              PIC  S9(8)V COMP-3          00270000
                                                            VALUE ZERO. 00271000
              10 AH009-ASN-PKGNG-CDE        PIC   X(2)  VALUE SPACES.   00280000
