000100* ************************************************************** *00010000
000200* * AHRD022.                                                   * *00020000
000300* * ARCHIVE/HISTORY DATA OFFLOAD.                              * *00030000
000400* * DRIVER FILE RECORD LAYOUT: INPUT.                          * *00040000
000500* * LRECL: 145                                                 * *00050002
000600* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00060000
000700* *    NOTE: IF THE DCLGEN FOR TAUCNUP(DCLTAUCNUP) IS CHANGED, * *00070000
000800* *    THIS COPYBOOK MUST ALSO BE CHANGED                      * *00080000
000900* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00090000
001000* ************************************************************** *00100000
001100 01 AH022-ARCHIVE-RECORD-LAYOUT.                                  00110000
001200     05 AH022-TAUCNUP-FIELDS.                                     00120001
              10 AH022-CONTNR-ID            PIC   X(12)   VALUE SPACES. 00130000
              10 AH022-CONTNR-SEQ-NBR       PIC  S9(4) COMP VALUE ZERO. 00140000
              10 AH022-PO-NBR               PIC  S9(9) COMP VALUE ZERO. 00150000
              10 AH022-VS-NBR               PIC   X(30) VALUE SPACES.   00160000
              10 AH022-UPC-NBR              PIC  S9(15)V COMP-3         00170000
                                                            VALUE ZERO. 00171000
              10 AH022-PO-LNE-NBR           PIC  S9(9) COMP VALUE ZERO. 00172000
              10 AH022-UPC-CART-CNT         PIC  S9(9) COMP VALUE ZERO. 00173000
              10 AH022-UPC-CBMT-QTY         PIC  S9(7)V9(2) COMP-3      00174000
                                                            VALUE ZERO. 00175000
              10 AH022-UPC-WT-KGRM-QTY      PIC  S9(9) COMP VALUE ZERO. 00176000
              10 AH022-UPC-UNT-QTY          PIC  S9(9) COMP VALUE ZERO. 00177000
              10 AH022-LAST-UPD-BY-USR-ID   PIC   X(8) VALUE SPACES.    00180000
              10 AH022-LAST-UPD-TMST        PIC   X(26) VALUE SPACES.   00190000
              10 AH022-AUD-FUNC-CDE         PIC   X(1) VALUE SPACES.    00191002
              10 AH022-AUD-TMST             PIC   X(26) VALUE SPACES.   00192002
              10 AH022-SKU-NBR              PIC  S9(8)V COMP-3          00200000
                                                            VALUE ZERO. 00210000
              10 AH022-ASN-PKGNG-CDE        PIC   X(2)  VALUE SPACES.   00220000
