000100* ************************************************************** *00010000
000200* * AHRD028.                                                   * *00020000
000300* * ARCHIVE/HISTORY DATA OFFLOAD.                              * *00030000
000400* * DRIVER FILE RECORD LAYOUT: INPUT.                          * *00040000
000500* * LRECL: 345                                                 * *00050001
000600* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00060000
000700* *    NOTE: IF THE DCLGEN FOR TAUCSEN (DCLTAUCSEN)            * *00070000
000700* *          IS CHANGED, THIS COPYBOOK MUST ALSO BE CHANGED.   * *00080000
000900* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00090000
001000* ************************************************************** *00100000
001100 01 AH028-ARCHIVE-RECORD-LAYOUT.                                  00110000
001200     05 AH028-TAUCSEN-FIELDS.                                     00120000
              10 AH028-CSTM-ENTR-ID       PIC   X(12)     VALUE SPACES. 00130000
              10 AH028-ENT-ID             PIC  S9(9) COMP VALUE ZEROS.  00140000
              10 AH028-BKR-REF-NBR        PIC   X(15)     VALUE SPACES. 00150000
              10 AH028-FILD-TMST          PIC   X(26)     VALUE SPACES. 00160000
              10 AH028-EST-CLR-TMST       PIC   X(26)     VALUE SPACES. 00161000
              10 AH028-ACTL-CLR-TMST      PIC   X(26)     VALUE SPACES. 00162000
              10 AH028-EXM-TMST           PIC   X(26)     VALUE SPACES. 00163000
              10 AH028-REJ-TMST           PIC   X(26)     VALUE SPACES. 00164000
              10 AH028-REJ-DESC           PIC   X(30)     VALUE SPACES. 00165000
              10 AH028-LQDN-TMST          PIC   X(26)     VALUE SPACES. 00166000
              10 AH028-LQDN-SSPNN-TMST    PIC   X(26)     VALUE SPACES. 00167000
              10 AH028-LQDN-SSPNN-DESC    PIC   X(30)     VALUE SPACES. 00168000
              10 AH028-DAT-SRC-ENT-ID     PIC  S9(9) COMP VALUE ZEROS.  00169000
              10 AH028-LAST-UPD-BY-USR-ID PIC   X(8)      VALUE SPACES. 00190000
              10 AH028-LAST-UPD-TMST      PIC   X(26)     VALUE SPACES. 00191000
              10 AH028-AUD-FUNC-CDE       PIC   X(1)      VALUE SPACES. 00191101
              10 AH028-AUD-TMST           PIC   X(26)     VALUE SPACES. 00191201
              10 AH028-MOM-DEST-POE-CDE       PIC   X(4)  VALUE SPACES. 00192000
              10 AH028-MOM-TRIP-TYP-CDE       PIC   X(1)  VALUE SPACES. 00193000
              10 AH028-ENTR-TYP-CDE           PIC   X(2)  VALUE SPACES. 00194000
