000100* ************************************************************** *00010000
000200* * AHRD025.                                                   * *00020000
000300* * ARCHIVE/HISTORY DATA OFFLOAD.                              * *00030000
000400* * DRIVER FILE RECORD LAYOUT: INPUT.                          * *00040000
000500* * LRECL: 146                                                 * *00050002
000600* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00060000
000700* *    NOTE: IF THE DCLGEN FOR TAUCNRL (DCLTAUCNRL)            * *00070000
000700* *          IS CHANGED, THIS COPYBOOK MUST ALSO BE CHANGED.   * *00080000
000900* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00090000
001000* ************************************************************** *00100000
001100 01 AH025-ARCHIVE-RECORD-LAYOUT.                                  00110000
001200     05 AH025-TAUCNRL-FIELDS.                                     00120000
              10 AH025-CONTNR-ID        PIC   X(12)     VALUE SPACES.   00130000
              10 AH025-CONTNR-SEQ-NBR   PIC  S9(4) COMP VALUE ZERO.     00140000
              10 AH025-PO-NBR           PIC  S9(9) COMP VALUE ZERO.     00150000
              10 AH025-DCONSLR-RLSE-CDE PIC   X(1) VALUE SPACES.        00160000
              10 AH025-DCONSLR-REQR-DTE PIC   X(10) VALUE SPACES.       00161000
              10 AH025-DCONSLR-ACTL-DTE PIC   X(10) VALUE SPACES.       00162000
              10 AH025-DCONSLR-ACTL-TM  PIC   X(8) VALUE SPACES.        00163000
              10 AH025-CRE-TMST         PIC   X(26) VALUE SPACES.       00164000
              10 AH025-CRE-BY-UID       PIC   X(8) VALUE SPACES.        00165000
              10 AH025-AUD-FUNC-CDE     PIC   X(1) VALUE SPACES.        00165101
              10 AH025-AUD-TMST         PIC   X(26)  VALUE SPACES.      00165201
              10 AH025-LAST-UPD-TMST    PIC   X(26) VALUE SPACES.       00166000
              10 AH025-LAST-UPD-BY-UID  PIC   X(8) VALUE SPACES.        00167000
              10 AH025-DCONSLR-ENT-ID   PIC  S9(9) COMP VALUE ZERO.     00168000
