000100* ************************************************************** *00010000
000200* * AHRD018.                                                   * *00020000
000300* * ARCHIVE/HISTORY DATA OFFLOAD.                              * *00030000
000400* * DRIVER FILE RECORD LAYOUT: INPUT.                          * *00040000
000500* * LRECL: 460                                                 * *00050001
000600* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00060000
000700* *    NOTE: IF THE DCLGEN FOR TIMBKPO (DCLTIMBKPO)            * *00070000
000700* *          IS CHANGED, THIS COPYBOOK MUST ALSO BE CHANGED.   * *00080000
000900* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00090000
001000* ************************************************************** *00100000
001100 01 AH018-ARCHIVE-RECORD-LAYOUT.                                  00110000
001200     05 AH018-TIMBKPO-FIELDS.                                     00120000
              10 AH018-PO-NBR             PIC S9(9) COMP VALUE ZERO.    00130000
              10 AH018-PO-BKG-SEQ-NBR     PIC S9(4) COMP VALUE ZERO.    00140000
              10 AH018-PO-BKG-DELY-TMST   PIC  X(26)     VALUE SPACES.  00150000
              10 AH018-EXTL-REF-NBR       PIC  X(15)     VALUE SPACES.  00160000
              10 AH018-ORGN-SHPD-FR-CDE   PIC  X(3)      VALUE SPACES.  00161000
              10 AH018-CONSLR-SCAC-ID     PIC  X(4)      VALUE SPACES.  00162000
              10 AH018-IMPRT-TRIP-ID      PIC  X(10)     VALUE SPACES.  00163000
              10 AH018-DPRTR-TMST         PIC  X(26)     VALUE SPACES.  00164000
              10 AH018-POE-DELY-TMST      PIC  X(26)     VALUE SPACES.  00165000
              10 AH018-CARR-SCAC-ID       PIC  X(4)      VALUE SPACES.  00166000
              10 AH018-FOB-CDE            PIC  X(5)      VALUE SPACES.  00167000
              10 AH018-IMPRT-VEH-NM       PIC  X(25)     VALUE SPACES.  00168000
              10 AH018-TRIP-TYP-CDE       PIC  X(1)      VALUE SPACES.  00169000
              10 AH018-DEST-POE-CDE       PIC  X(4)      VALUE SPACES.  00170000
              10 AH018-C-O-PROD-CDE       PIC  X(3)      VALUE SPACES.  00180000
              10 AH018-PROD-FCTRY-NM      PIC  X(35)     VALUE SPACES.  00190000
              10 AH018-PO-CART-CNT        PIC S9(9) COMP VALUE ZERO.    00200000
              10 AH018-PO-CBMT-QTY    PIC S9(7)V9(2) COMP-3 VALUE ZERO. 00210000
              10 AH018-PO-WT-KGRM-QTY     PIC S9(9) COMP VALUE ZERO.    00220000
              10 AH018-PO-UNT-QTY         PIC S9(9) COMP VALUE ZERO.    00230000
              10 AH018-PO-EXC-APVL-CDE    PIC  X(2)      VALUE SPACES.  00240000
              10 AH018-PO-EXC-APVL-USR-ID PIC  X(8)      VALUE SPACES.  00250000
              10 AH018-PO-EXC-APVL-TMST   PIC  X(26)     VALUE SPACES.  00260000
              10 AH018-PO-EXC-RSN-DESC    PIC  X(30)     VALUE SPACES.  00270000
              10 AH018-EST-LBD-NM         PIC  X(30)     VALUE SPACES.  00280000
              10 AH018-EST-LBD-TMST       PIC  X(26)     VALUE SPACES.  00290000
              10 AH018-SHIPT-BKG-TMST     PIC  X(26)     VALUE SPACES.  00300000
              10 AH018-VOY-CHG-RSN-DESC   PIC  X(30)     VALUE SPACES.  00310000
              10 AH018-DAT-SRC-ENT-ID     PIC S9(9) COMP VALUE ZERO.    00320000
              10 AH018-CRE-BY-USR-ID      PIC  X(8)      VALUE SPACES.  00330000
              10 AH018-CRE-TMST           PIC  X(26)     VALUE SPACES.  00340000
              10 AH018-LAST-UPD-BY-USR-ID PIC  X(8)      VALUE SPACES.  00350000
              10 AH018-LAST-UPD-TMST      PIC  X(26)     VALUE SPACES.  00360000
