000100* ************************************************************** *00010000
000200* * AHRD016.                                                   * *00020000
000300* * ARCHIVE/HISTORY DATA OFFLOAD.                              * *00030000
000400* * DRIVER FILE RECORD LAYOUT: INPUT.                          * *00040000
000500* * LRECL: 099                                                 * *00050001
000600* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00060000
000700* *    NOTE: IF THE DCLGEN FOR TIMCSPO (DCLTIMCSPO)            * *00070000
000700* *          IS CHANGED, THIS COPYBOOK MUST ALSO BE CHANGED.   * *00080000
000900* *    * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *00090000
001000* ************************************************************** *00100000
001100 01 AH016-ARCHIVE-RECORD-LAYOUT.                                  00110000
001200     05 AH016-TIMCSPO-FIELDS.                                     00120001
              10 AH016-CSTM-ENTR-ID       PIC   X(12)     VALUE SPACES. 00130000
              10 AH016-PO-NBR             PIC  S9(9) COMP VALUE ZEROS.  00140000
              10 AH016-CRE-BY-USR-ID      PIC   X(8)      VALUE SPACES. 00150000
              10 AH016-CRE-TMST           PIC   X(26)     VALUE SPACES. 00160000
              10 AH016-LAST-UPD-BY-USR-ID PIC   X(8)      VALUE SPACES. 00161000
              10 AH016-LAST-UPD-TMST      PIC   X(26)     VALUE SPACES. 00162000
              10 AH016-EXTL-REF-NBR       PIC   X(15)     VALUE SPACES. 00163000
