*          DATA SET APKM345    AT LEVEL 010 AS OF 05/26/95                      
*          DATA SET APKM345    AT LEVEL 001 AS OF 03/20/95              00001*10
*          DATA SET APKM345    AT LEVEL 027 AS OF 08/18/94              00002*10
  PRINT  NOGEN                                                          00003*10
*-------------------------------------------------------------------*   00004*10
*                                                                   *   00005*10
*        MAPSET  APKM345                                            *   00006*10
*        MAP     AP345A                                             *   00007*10
*        PROGRAM APKCS345                                           *   00008*10
*        TRANSID A345 - INVOICE ITEM INQUIRY LIST                   *   00009*10
*                                                                   *   00010*10
*-------------------------------------------------------------------*   00011*10
APKM345 DFHMSD TYPE=MAP,                                               X00012*10
               MODE=INOUT,                                             X00013*10
               LANG=COBOL,                                             X00014*10
               TIOAPFX=YES,                                            X00015*10
               CTRL=(FREEKB)                                            00016*10
AP345A  DFHMDI LINE=2,COLUMN=1,                                        X00017*10
               SIZE=(19,80),                                           X00018*10
               MAPATTS=(COLOR,HILIGHT),                                X00019*10
               DSATTS=(COLOR,HILIGHT)                                   00020*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 01                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00026*10
               INITIAL='INVOICE NBR :',                                X00027*10
               LENGTH=13,                                              X00028*10
               COLOR=NEUTRAL,                                          X00029*10
               POS=(01,1)                                               00030*10
AINVNBR  DFHMDF ATTRB=(ASKIP,NORM),                                    X00031*10
               LENGTH=22,                                              X00032*10
               COLOR=BLUE,                                             X00033*10
               POS=(01,15)                                              00034*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00035*10
               INITIAL='ITEMS',                                        X00036*10
               COLOR=NEUTRAL,                                          X00037*10
               LENGTH=5,                                               X00038*10
               POS=(01,44)                                              00039*10
****************************************                                00040*10
*  VARIABLE = LIST-FIRST-ITEM      N006                                 00041*10
****************************************                                00042*10
ASTRTIT  DFHMDF ATTRB=(UNPROT,FSET,NUM),                               X00043*10
               JUSTIFY=(LEFT,BLANK),                                   X00044*10
               PICOUT='ZZZ,ZZ9',                                       X00045*10
               LENGTH=7,                                               X00046*10
               COLOR=GREEN,                                            X00047*10
               HILIGHT=UNDERLINE,                                      X00048*10
               POS=(01,50)                                              00049*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00050*10
               INITIAL='TO',                                           X00051*10
               LENGTH=2,                                               X00052*10
               COLOR=NEUTRAL,                                          X00053*10
               POS=(01,58)                                              00054*10
****************************************                                00055*10
*  VARIABLE = LIST-LAST-ITEM      N006                                  00056*10
****************************************                                00057*10
AENDIT   DFHMDF ATTRB=(PROT),                                          X00058*10
               PICOUT='ZZZ,ZZ9',                                       X00059*10
               LENGTH=7,                                               X00060*10
               COLOR=BLUE,                                             X00061*10
               POS=(01,61)                                              00062*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00063*10
               INITIAL='OF',                                           X00064*10
               LENGTH=2,                                               X00065*10
               COLOR=NEUTRAL,                                          X00066*10
               POS=(01,69)                                              00067*10
****************************************                                00068*10
*  VARIABLE = LIST-TOTAL-ITEMS      N006                                00069*10
****************************************                                00070*10
ATOTIT   DFHMDF ATTRB=(PROT),                                          X00071*10
               PICOUT='ZZZ,ZZ9',                                       X00072*10
               LENGTH=7,                                               X00073*10
               COLOR=BLUE,                                             X00074*10
               POS=(01,72)                                              00075*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 02                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00082*10
               INITIAL='PO NBR......:',                                X00083*10
               LENGTH=13,                                              X00084*10
               COLOR=NEUTRAL,                                          X00085*10
               POS=(02,1)                                               00086*10
APONBR   DFHMDF ATTRB=(ASKIP,NORM),                                    X00087*10
               PICOUT='ZZZZZZZZ9',                                     X00088*10
               LENGTH=9,                                               X00089*10
               COLOR=BLUE,                                             X00090*10
               POS=(02,15)                                              00091*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00092*10
               INITIAL='TOTAL CST:',                                   X00093*10
               LENGTH=10,                                              X00094*10
               COLOR=NEUTRAL,                                          X00095*10
               POS=(02,37)                                              00096*10
ATOTCST  DFHMDF ATTRB=(ASKIP,NORM),                                    X00097*10
               PICOUT='ZZZZZZ9.99',                                    X00098*10
               LENGTH=10,                                              X00099*10
               COLOR=BLUE,                                             X00100*10
               POS=(02,48)                                              00101*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00102*10
               INITIAL='CALC CST:',                                    X00103*10
               LENGTH=9,                                               X00104*10
               COLOR=NEUTRAL,                                          X00105*10
               POS=(02,60)                                              00106*10
ACLCCST  DFHMDF ATTRB=(ASKIP,NORM),                                    X00107*10
               PICOUT='ZZZZZZ9.99',                                    X00108*10
               INITIAL='9999999.99',                                   X00109*10
               LENGTH=10,                                              X00110*10
               COLOR=BLUE,                                             X00111*10
               POS=(02,70)                                              00112*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 03                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00114*10
               INITIAL='INVOICE STAT:',                                X00115*10
               COLOR=NEUTRAL,                                          X00116*10
               LENGTH=13,                                              X00117*10
               POS=(03,01)                                              00118*10
ASTATUS  DFHMDF ATTRB=(PROT),                                          X00119*10
               COLOR=BLUE,                                             X00120*10
               LENGTH=11,                                              X00121*10
               POS=(03,15)                                              00122*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00123*10
               INITIAL='DEPT:',                                        X00124*10
               LENGTH=5,                                               X00125*10
               COLOR=NEUTRAL,                                          X00126*10
               POS=(03,27)                                              00127*10
ADEPT    DFHMDF ATTRB=(ASKIP,NORM),                                    X00128*10
               LENGTH=3,                                               X00129*10
               COLOR=BLUE,                                             X00130*10
               POS=(03,33)                                              00131*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00132*10
               INITIAL='TOTAL QTY:',                                   X00133*10
               LENGTH=10,                                              X00134*10
               COLOR=NEUTRAL,                                          X00135*10
               POS=(03,37)                                              00136*10
ATOTQTY  DFHMDF ATTRB=(ASKIP,NORM),                                    X00137*10
               PICOUT='ZZZZZ9',                                        X00138*10
               LENGTH=6,                                               X00139*10
               COLOR=BLUE,                                             X00140*10
               POS=(03,48)                                              00141*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00142*10
               INITIAL='CALC QTY:',                                    X00143*10
               LENGTH=9,                                               X00144*10
               COLOR=NEUTRAL,                                          X00145*10
               POS=(03,60)                                              00146*10
ACLCQTY  DFHMDF ATTRB=(ASKIP,NORM),                                    X00147*10
               PICOUT='ZZZZZ9',                                        X00148*10
               LENGTH=6,                                               X00149*10
               COLOR=BLUE,                                             X00150*10
               POS=(03,70)                                              00151*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 04                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00157*10
               INITIAL='VENDOR......:',                                X00158*10
               LENGTH=13,                                              X00159*10
               COLOR=NEUTRAL,                                          X00160*10
               POS=(04,01)                                              00161*10
AVENDOR  DFHMDF ATTRB=(ASKIP,NORM),                                    X00162*10
               LENGTH=10,                                              X00163*10
               COLOR=BLUE,                                             X00164*10
               POS=(04,15)                                              00165*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00166   
               INITIAL='STR:',                                         X00167   
               LENGTH=4,                                               X00168**2
               COLOR=NEUTRAL,                                          X00169   
               POS=(04,28)                                              00170   
ASTRNBR  DFHMDF ATTRB=(ASKIP,NORM),                                    X00171   
               LENGTH=4,                                               X00172   
               COLOR=BLUE,                                             X00173   
               POS=(04,33)                                              00174   
         DFHMDF ATTRB=(PROT,BRT),                                      X00157*10
               INITIAL='DC:',                                          X00158*10
               LENGTH=3,                                               X00159*10
               COLOR=NEUTRAL,                                          X00160*10
               POS=(04,44)                                              00161*10
ADCNBR   DFHMDF ATTRB=(ASKIP,NORM),                                    X00162*10
               LENGTH=4,                                               X00163*10
               COLOR=BLUE,                                             X00164*10
               POS=(04,48)                                              00165*10
         DFHMDF POS=(04,53),LENGTH=01,ATTRB=ASKIP                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 05                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00171*10
               INITIAL='PO',                                           X00172*10
               LENGTH=2,                                               X00173*10
               POS=(05,23)                                              00174*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00175*10
               INITIAL='INVC',                                         X00176*10
               LENGTH=4,                                               X00177*10
               POS=(05,76)                                              00178*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 06                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00184*10
               INITIAL='SEL',                                          X00185*10
               LENGTH=3,                                               X00186*10
               POS=(06,1)                                               00187*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00188*10
               INITIAL='PIECES',                                       X00189*10
               LENGTH=6,                                               X00190*10
               POS=(06,5)                                               00191*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00192*10
               INITIAL='UNIT COST',                                    X00193*10
               LENGTH=9,                                               X00194*10
               POS=(06,12)                                              00195*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00196*10
               INITIAL='LINE',                                         X00197*10
               LENGTH=4,                                               X00198*10
               POS=(06,22)                                              00199*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00200*10
               INITIAL='UPC CODE',                                     X00201*10
               LENGTH=8,                                               X00202*10
               POS=(06,27)                                              00203*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00204*10
               INITIAL='SKU',                                          X00205*10
               LENGTH=3,                                               X00206*10
               POS=(06,44)                                              00207*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00212*10
               INITIAL='STYLE',                                        X00213*10
               LENGTH=5,                                               X00214*10
               POS=(06,53)                                              00215*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00216*10
               INITIAL='CLR',                                          X00217*10
               LENGTH=3,                                               X00218*10
               POS=(06,66)                                              00219*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00220*10
               INITIAL='SIZE',                                         X00221*10
               LENGTH=4,                                               X00222*10
               POS=(06,70)                                              00223*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00224*10
               INITIAL='LINE',                                         X00225*10
               LENGTH=4,                                               X00226*10
               POS=(06,76)                                              00227*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 07                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASEL01   DFHMDF ATTRB=(UNPROT,FSET),                                   X00233*10
               LENGTH=1,                                               X00234*10
               COLOR=GREEN,                                            X00235*10
               HILIGHT=UNDERLINE,                                      X00236*10
               POS=(07,1)                                               00237*10
AACT01   DFHMDF ATTRB=(ASKIP,NORM),                                    X00238*10
               LENGTH=1,                                               X00239*10
               COLOR=BLUE,                                             X00240*10
               POS=(07,3)                                               00241*10
APECS01  DFHMDF ATTRB=(UNPROT),                                        X00242*10
               LENGTH=6,                                               X00243*10
               COLOR=GREEN,                                            X00244*10
               HILIGHT=UNDERLINE,                                      X00245*10
               POS=(07,5)                                               00246*10
AUCST01  DFHMDF ATTRB=(UNPROT),                                        X00247*10
               LENGTH=9,                                               X00248*10
               COLOR=GREEN,                                            X00249*10
               HILIGHT=UNDERLINE,                                      X00250*10
               POS=(07,12)                                              00251*10
APOLN01  DFHMDF ATTRB=(PROT,BRT),                                      X00255*10
               LENGTH=4,                                               X00256*10
               COLOR=BLUE,                                             X00257*10
               POS=(07,22)                                              00258*10
AUPCD01  DFHMDF ATTRB=(PROT,BRT),                                      X00259*10
               LENGTH=16,                                              X00260*10
               COLOR=BLUE,                                             X00261*10
               POS=(07,27)                                              00262*10
ASKU01   DFHMDF ATTRB=(PROT,BRT),                                      X00263*10
               LENGTH=8,                                               X00264*10
               COLOR=BLUE,                                             X00265*10
               POS=(07,44)                                              00266*10
ASTYL01  DFHMDF ATTRB=(PROT,BRT),                                      X00271*10
               LENGTH=12,                                              X00272*10
               COLOR=BLUE,                                             X00273*10
               POS=(07,53)                                              00274*10
ACOLR01  DFHMDF ATTRB=(PROT,BRT),                                      X00275*10
               LENGTH=3,                                               X00276*10
               COLOR=BLUE,                                             X00277*10
               POS=(07,66)                                              00278*10
ASIZE01  DFHMDF ATTRB=(PROT,BRT),                                      X00279*10
               LENGTH=5,                                               X00280*10
               COLOR=BLUE,                                             X00281*10
               POS=(07,70)                                              00282*10
AINVL01  DFHMDF ATTRB=(PROT,BRT),                                      X00283*10
               LENGTH=4,                                               X00284*10
               COLOR=BLUE,                                             X00285*10
               POS=(07,76)                                              00286*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 08                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASEL02   DFHMDF ATTRB=(UNPROT,FSET),                                   X00292*10
               LENGTH=1,                                               X00293*10
               COLOR=GREEN,                                            X00294*10
               HILIGHT=UNDERLINE,                                      X00295*10
               POS=(08,1)                                               00296*10
AACT02   DFHMDF ATTRB=(ASKIP,NORM),                                    X00297*10
               LENGTH=1,                                               X00298*10
               COLOR=BLUE,                                             X00299*10
               POS=(08,3)                                               00300*10
APECS02  DFHMDF ATTRB=(UNPROT),                                        X00301*10
               LENGTH=6,                                               X00302*10
               COLOR=GREEN,                                            X00303*10
               HILIGHT=UNDERLINE,                                      X00304*10
               POS=(08,5)                                               00305*10
AUCST02  DFHMDF ATTRB=(UNPROT),                                        X00306*10
               LENGTH=9,                                               X00307*10
               COLOR=GREEN,                                            X00308*10
               HILIGHT=UNDERLINE,                                      X00309*10
               POS=(08,12)                                              00310*10
APOLN02  DFHMDF ATTRB=(PROT,BRT),                                      X00314*10
               LENGTH=4,                                               X00315*10
               COLOR=BLUE,                                             X00316*10
               POS=(08,22)                                              00317*10
AUPCD02  DFHMDF ATTRB=(PROT,BRT),                                      X00318*10
               LENGTH=16,                                              X00319*10
               COLOR=BLUE,                                             X00320*10
               POS=(08,27)                                              00321*10
ASKU02   DFHMDF ATTRB=(PROT,BRT),                                      X00322*10
               LENGTH=8,                                               X00323*10
               COLOR=BLUE,                                             X00324*10
               POS=(08,44)                                              00325*10
ASTYL02  DFHMDF ATTRB=(PROT,BRT),                                      X00330*10
               LENGTH=12,                                              X00331*10
               COLOR=BLUE,                                             X00332*10
               POS=(08,53)                                              00333*10
ACOLR02  DFHMDF ATTRB=(PROT,BRT),                                      X00334*10
               LENGTH=3,                                               X00335*10
               COLOR=BLUE,                                             X00336*10
               POS=(08,66)                                              00337*10
ASIZE02  DFHMDF ATTRB=(PROT,BRT),                                      X00338*10
               LENGTH=5,                                               X00339*10
               COLOR=BLUE,                                             X00340*10
               POS=(08,70)                                              00341*10
AINVL02  DFHMDF ATTRB=(PROT,BRT),                                      X00342*10
               LENGTH=4,                                               X00343*10
               COLOR=BLUE,                                             X00344*10
               POS=(08,76)                                              00345*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 09                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASEL03   DFHMDF ATTRB=(UNPROT,FSET),                                   X00351*10
               LENGTH=1,                                               X00352*10
               COLOR=GREEN,                                            X00353*10
               HILIGHT=UNDERLINE,                                      X00354*10
               POS=(09,1)                                               00355*10
AACT03   DFHMDF ATTRB=(ASKIP,NORM),                                    X00356*10
               LENGTH=1,                                               X00357*10
               COLOR=BLUE,                                             X00358*10
               POS=(09,3)                                               00359*10
APECS03  DFHMDF ATTRB=(UNPROT),                                        X00360*10
               LENGTH=6,                                               X00361*10
               COLOR=GREEN,                                            X00362*10
               HILIGHT=UNDERLINE,                                      X00363*10
               POS=(09,5)                                               00364*10
AUCST03  DFHMDF ATTRB=(UNPROT),                                        X00365*10
               LENGTH=9,                                               X00366*10
               COLOR=GREEN,                                            X00367*10
               HILIGHT=UNDERLINE,                                      X00368*10
               POS=(09,12)                                              00369*10
APOLN03  DFHMDF ATTRB=(PROT,BRT),                                      X00373*10
               LENGTH=4,                                               X00374*10
               COLOR=BLUE,                                             X00375*10
               POS=(09,22)                                              00376*10
AUPCD03  DFHMDF ATTRB=(PROT,BRT),                                      X00377*10
               LENGTH=16,                                              X00378*10
               COLOR=BLUE,                                             X00379*10
               POS=(09,27)                                              00380*10
ASKU03   DFHMDF ATTRB=(PROT,BRT),                                      X00381*10
               LENGTH=8,                                               X00382*10
               COLOR=BLUE,                                             X00383*10
               POS=(09,44)                                              00384*10
ASTYL03  DFHMDF ATTRB=(PROT,BRT),                                      X00389*10
               LENGTH=12,                                              X00390*10
               COLOR=BLUE,                                             X00391*10
               POS=(09,53)                                              00392*10
ACOLR03  DFHMDF ATTRB=(PROT,BRT),                                      X00393*10
               LENGTH=3,                                               X00394*10
               COLOR=BLUE,                                             X00395*10
               POS=(09,66)                                              00396*10
ASIZE03  DFHMDF ATTRB=(PROT,BRT),                                      X00397*10
               LENGTH=5,                                               X00398*10
               COLOR=BLUE,                                             X00399*10
               POS=(09,70)                                              00400*10
AINVL03  DFHMDF ATTRB=(PROT,BRT),                                      X00401*10
               LENGTH=4,                                               X00402*10
               COLOR=BLUE,                                             X00403*10
               POS=(09,76)                                              00404*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 10                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASEL04   DFHMDF ATTRB=(UNPROT,FSET),                                   X00410*10
               LENGTH=1,                                               X00411*10
               COLOR=GREEN,                                            X00412*10
               HILIGHT=UNDERLINE,                                      X00413*10
               POS=(10,1)                                               00414*10
AACT04   DFHMDF ATTRB=(ASKIP,NORM),                                    X00415*10
               LENGTH=1,                                               X00416*10
               COLOR=BLUE,                                             X00417*10
               POS=(10,3)                                               00418*10
APECS04  DFHMDF ATTRB=(UNPROT),                                        X00419*10
               LENGTH=6,                                               X00420*10
               COLOR=GREEN,                                            X00421*10
               HILIGHT=UNDERLINE,                                      X00422*10
               POS=(10,5)                                               00423*10
AUCST04  DFHMDF ATTRB=(UNPROT),                                        X00424*10
               LENGTH=9,                                               X00425*10
               COLOR=GREEN,                                            X00426*10
               HILIGHT=UNDERLINE,                                      X00427*10
               POS=(10,12)                                              00428*10
APOLN04  DFHMDF ATTRB=(PROT,BRT),                                      X00432*10
               LENGTH=4,                                               X00433*10
               COLOR=BLUE,                                             X00434*10
               POS=(10,22)                                              00435*10
AUPCD04  DFHMDF ATTRB=(PROT,BRT),                                      X00436*10
               LENGTH=16,                                              X00437*10
               COLOR=BLUE,                                             X00438*10
               POS=(10,27)                                              00439*10
ASKU04   DFHMDF ATTRB=(PROT,BRT),                                      X00440*10
               LENGTH=8,                                               X00441*10
               COLOR=BLUE,                                             X00442*10
               POS=(10,44)                                              00443*10
ASTYL04  DFHMDF ATTRB=(PROT,BRT),                                      X00448*10
               LENGTH=12,                                              X00449*10
               COLOR=BLUE,                                             X00450*10
               POS=(10,53)                                              00451*10
ACOLR04  DFHMDF ATTRB=(PROT,BRT),                                      X00452*10
               LENGTH=3,                                               X00453*10
               COLOR=BLUE,                                             X00454*10
               POS=(10,66)                                              00455*10
ASIZE04  DFHMDF ATTRB=(PROT,BRT),                                      X00456*10
               LENGTH=5,                                               X00457*10
               COLOR=BLUE,                                             X00458*10
               POS=(10,70)                                              00459*10
AINVL04  DFHMDF ATTRB=(PROT,BRT),                                      X00460*10
               LENGTH=4,                                               X00461*10
               COLOR=BLUE,                                             X00462*10
               POS=(10,76)                                              00463*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 11                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASEL05   DFHMDF ATTRB=(UNPROT,FSET),                                   X00469*10
               LENGTH=1,                                               X00470*10
               COLOR=GREEN,                                            X00471*10
               HILIGHT=UNDERLINE,                                      X00472*10
               POS=(11,1)                                               00473*10
AACT05   DFHMDF ATTRB=(ASKIP,NORM),                                    X00474*10
               LENGTH=1,                                               X00475*10
               COLOR=BLUE,                                             X00476*10
               POS=(11,3)                                               00477*10
APECS05  DFHMDF ATTRB=(UNPROT),                                        X00478*10
               LENGTH=6,                                               X00479*10
               COLOR=GREEN,                                            X00480*10
               HILIGHT=UNDERLINE,                                      X00481*10
               POS=(11,5)                                               00482*10
AUCST05  DFHMDF ATTRB=(UNPROT),                                        X00483*10
               LENGTH=9,                                               X00484*10
               COLOR=GREEN,                                            X00485*10
               HILIGHT=UNDERLINE,                                      X00486*10
               POS=(11,12)                                              00487*10
APOLN05  DFHMDF ATTRB=(PROT,BRT),                                      X00491*10
               LENGTH=4,                                               X00492*10
               COLOR=BLUE,                                             X00493*10
               POS=(11,22)                                              00494*10
AUPCD05  DFHMDF ATTRB=(PROT,BRT),                                      X00495*10
               LENGTH=16,                                              X00496*10
               COLOR=BLUE,                                             X00497*10
               POS=(11,27)                                              00498*10
ASKU05   DFHMDF ATTRB=(PROT,BRT),                                      X00499*10
               LENGTH=8,                                               X00500*10
               COLOR=BLUE,                                             X00501*10
               POS=(11,44)                                              00502*10
ASTYL05  DFHMDF ATTRB=(PROT,BRT),                                      X00507*10
               LENGTH=12,                                              X00508*10
               COLOR=BLUE,                                             X00509*10
               POS=(11,53)                                              00510*10
ACOLR05  DFHMDF ATTRB=(PROT,BRT),                                      X00511*10
               LENGTH=3,                                               X00512*10
               COLOR=BLUE,                                             X00513*10
               POS=(11,66)                                              00514*10
ASIZE05  DFHMDF ATTRB=(PROT,BRT),                                      X00515*10
               LENGTH=5,                                               X00516*10
               COLOR=BLUE,                                             X00517*10
               POS=(11,70)                                              00518*10
AINVL05  DFHMDF ATTRB=(PROT,BRT),                                      X00519*10
               LENGTH=4,                                               X00520*10
               COLOR=BLUE,                                             X00521*10
               POS=(11,76)                                              00522*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 12                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASEL06   DFHMDF ATTRB=(UNPROT,FSET),                                   X00528*10
               LENGTH=1,                                               X00529*10
               COLOR=GREEN,                                            X00530*10
               HILIGHT=UNDERLINE,                                      X00531*10
               POS=(12,1)                                               00532*10
AACT06   DFHMDF ATTRB=(ASKIP,NORM),                                    X00533*10
               LENGTH=1,                                               X00534*10
               COLOR=BLUE,                                             X00535*10
               POS=(12,3)                                               00536*10
APECS06  DFHMDF ATTRB=(UNPROT),                                        X00537*10
               LENGTH=6,                                               X00538*10
               COLOR=GREEN,                                            X00539*10
               HILIGHT=UNDERLINE,                                      X00540*10
               POS=(12,5)                                               00541*10
AUCST06  DFHMDF ATTRB=(UNPROT),                                        X00542*10
               LENGTH=9,                                               X00543*10
               COLOR=GREEN,                                            X00544*10
               HILIGHT=UNDERLINE,                                      X00545*10
               POS=(12,12)                                              00546*10
APOLN06  DFHMDF ATTRB=(PROT,BRT),                                      X00550*10
               LENGTH=4,                                               X00551*10
               COLOR=BLUE,                                             X00552*10
               POS=(12,22)                                              00553*10
AUPCD06  DFHMDF ATTRB=(PROT,BRT),                                      X00554*10
               LENGTH=16,                                              X00555*10
               COLOR=BLUE,                                             X00556*10
               POS=(12,27)                                              00557*10
ASKU06   DFHMDF ATTRB=(PROT,BRT),                                      X00558*10
               LENGTH=8,                                               X00559*10
               COLOR=BLUE,                                             X00560*10
               POS=(12,44)                                              00561*10
ASTYL06  DFHMDF ATTRB=(PROT,BRT),                                      X00566*10
               LENGTH=12,                                              X00567*10
               COLOR=BLUE,                                             X00568*10
               POS=(12,53)                                              00569*10
ACOLR06  DFHMDF ATTRB=(PROT,BRT),                                      X00570*10
               LENGTH=3,                                               X00571*10
               COLOR=BLUE,                                             X00572*10
               POS=(12,66)                                              00573*10
ASIZE06  DFHMDF ATTRB=(PROT,BRT),                                      X00574*10
               LENGTH=5,                                               X00575*10
               COLOR=BLUE,                                             X00576*10
               POS=(12,70)                                              00577*10
AINVL06  DFHMDF ATTRB=(PROT,BRT),                                      X00578*10
               LENGTH=4,                                               X00579*10
               COLOR=BLUE,                                             X00580*10
               POS=(12,76)                                              00581*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 13                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASEL07   DFHMDF ATTRB=(UNPROT,FSET),                                   X00587*10
               LENGTH=1,                                               X00588*10
               COLOR=GREEN,                                            X00589*10
               HILIGHT=UNDERLINE,                                      X00590*10
               POS=(13,1)                                               00591*10
AACT07   DFHMDF ATTRB=(ASKIP,NORM),                                    X00592*10
               LENGTH=1,                                               X00593*10
               COLOR=BLUE,                                             X00594*10
               POS=(13,3)                                               00595*10
APECS07  DFHMDF ATTRB=(UNPROT),                                        X00596*10
               LENGTH=6,                                               X00597*10
               COLOR=GREEN,                                            X00598*10
               HILIGHT=UNDERLINE,                                      X00599*10
               POS=(13,5)                                               00600*10
AUCST07  DFHMDF ATTRB=(UNPROT),                                        X00601*10
               LENGTH=9,                                               X00602*10
               COLOR=GREEN,                                            X00603*10
               HILIGHT=UNDERLINE,                                      X00604*10
               POS=(13,12)                                              00605*10
APOLN07  DFHMDF ATTRB=(PROT,BRT),                                      X00609*10
               LENGTH=4,                                               X00610*10
               COLOR=BLUE,                                             X00611*10
               POS=(13,22)                                              00612*10
AUPCD07  DFHMDF ATTRB=(PROT,BRT),                                      X00613*10
               LENGTH=16,                                              X00614*10
               COLOR=BLUE,                                             X00615*10
               POS=(13,27)                                              00616*10
ASKU07   DFHMDF ATTRB=(PROT,BRT),                                      X00617*10
               LENGTH=8,                                               X00618*10
               COLOR=BLUE,                                             X00619*10
               POS=(13,44)                                              00620*10
ASTYL07  DFHMDF ATTRB=(PROT,BRT),                                      X00625*10
               LENGTH=12,                                              X00626*10
               COLOR=BLUE,                                             X00627*10
               POS=(13,53)                                              00628*10
ACOLR07  DFHMDF ATTRB=(PROT,BRT),                                      X00629*10
               LENGTH=3,                                               X00630*10
               COLOR=BLUE,                                             X00631*10
               POS=(13,66)                                              00632*10
ASIZE07  DFHMDF ATTRB=(PROT,BRT),                                      X00633*10
               LENGTH=5,                                               X00634*10
               COLOR=BLUE,                                             X00635*10
               POS=(13,70)                                              00636*10
AINVL07  DFHMDF ATTRB=(PROT,BRT),                                      X00637*10
               LENGTH=4,                                               X00638*10
               COLOR=BLUE,                                             X00639*10
               POS=(13,76)                                              00640*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 14                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASEL08   DFHMDF ATTRB=(UNPROT,FSET),                                   X00646*10
               LENGTH=1,                                               X00647*10
               COLOR=GREEN,                                            X00648*10
               HILIGHT=UNDERLINE,                                      X00649*10
               POS=(14,1)                                               00650*10
AACT08   DFHMDF ATTRB=(ASKIP,NORM),                                    X00651*10
               LENGTH=1,                                               X00652*10
               COLOR=BLUE,                                             X00653*10
               POS=(14,3)                                               00654*10
APECS08  DFHMDF ATTRB=(UNPROT),                                        X00655*10
               LENGTH=6,                                               X00656*10
               COLOR=GREEN,                                            X00657*10
               HILIGHT=UNDERLINE,                                      X00658*10
               POS=(14,5)                                               00659*10
AUCST08  DFHMDF ATTRB=(UNPROT),                                        X00660*10
               LENGTH=9,                                               X00661*10
               COLOR=GREEN,                                            X00662*10
               HILIGHT=UNDERLINE,                                      X00663*10
               POS=(14,12)                                              00664*10
APOLN08  DFHMDF ATTRB=(PROT,BRT),                                      X00668*10
               LENGTH=4,                                               X00669*10
               COLOR=BLUE,                                             X00670*10
               POS=(14,22)                                              00671*10
AUPCD08  DFHMDF ATTRB=(PROT,BRT),                                      X00672*10
               LENGTH=16,                                              X00673*10
               COLOR=BLUE,                                             X00674*10
               POS=(14,27)                                              00675*10
ASKU08   DFHMDF ATTRB=(PROT,BRT),                                      X00676*10
               LENGTH=8,                                               X00677*10
               COLOR=BLUE,                                             X00678*10
               POS=(14,44)                                              00679*10
ASTYL08  DFHMDF ATTRB=(PROT,BRT),                                      X00684*10
               LENGTH=12,                                              X00685*10
               COLOR=BLUE,                                             X00686*10
               POS=(14,53)                                              00687*10
ACOLR08  DFHMDF ATTRB=(PROT,BRT),                                      X00688*10
               LENGTH=3,                                               X00689*10
               COLOR=BLUE,                                             X00690*10
               POS=(14,66)                                              00691*10
ASIZE08  DFHMDF ATTRB=(PROT,BRT),                                      X00692*10
               LENGTH=5,                                               X00693*10
               COLOR=BLUE,                                             X00694*10
               POS=(14,70)                                              00695*10
AINVL08  DFHMDF ATTRB=(PROT,BRT),                                      X00696*10
               LENGTH=4,                                               X00697*10
               COLOR=BLUE,                                             X00698*10
               POS=(14,76)                                              00699*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 15                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASEL09   DFHMDF ATTRB=(UNPROT,FSET),                                   X00705*10
               LENGTH=1,                                               X00706*10
               COLOR=GREEN,                                            X00707*10
               HILIGHT=UNDERLINE,                                      X00708*10
               POS=(15,1)                                               00709*10
AACT09   DFHMDF ATTRB=(ASKIP,NORM),                                    X00710*10
               LENGTH=1,                                               X00711*10
               COLOR=BLUE,                                             X00712*10
               POS=(15,3)                                               00713*10
APECS09  DFHMDF ATTRB=(UNPROT),                                        X00714*10
               LENGTH=6,                                               X00715*10
               COLOR=GREEN,                                            X00716*10
               HILIGHT=UNDERLINE,                                      X00717*10
               POS=(15,5)                                               00718*10
AUCST09  DFHMDF ATTRB=(UNPROT),                                        X00719*10
               LENGTH=9,                                               X00720*10
               COLOR=GREEN,                                            X00721*10
               HILIGHT=UNDERLINE,                                      X00722*10
               POS=(15,12)                                              00723*10
APOLN09  DFHMDF ATTRB=(PROT,BRT),                                      X00727*10
               LENGTH=4,                                               X00728*10
               COLOR=BLUE,                                             X00729*10
               POS=(15,22)                                              00730*10
AUPCD09  DFHMDF ATTRB=(PROT,BRT),                                      X00731*10
               LENGTH=16,                                              X00732*10
               COLOR=BLUE,                                             X00733*10
               POS=(15,27)                                              00734*10
ASKU09   DFHMDF ATTRB=(PROT,BRT),                                      X00735*10
               LENGTH=8,                                               X00736*10
               COLOR=BLUE,                                             X00737*10
               POS=(15,44)                                              00738*10
ASTYL09  DFHMDF ATTRB=(PROT,BRT),                                      X00743*10
               LENGTH=12,                                              X00744*10
               COLOR=BLUE,                                             X00745*10
               POS=(15,53)                                              00746*10
ACOLR09  DFHMDF ATTRB=(PROT,BRT),                                      X00747*10
               LENGTH=3,                                               X00748*10
               COLOR=BLUE,                                             X00749*10
               POS=(15,66)                                              00750*10
ASIZE09  DFHMDF ATTRB=(PROT,BRT),                                      X00751*10
               LENGTH=5,                                               X00752*10
               COLOR=BLUE,                                             X00753*10
               POS=(15,70)                                              00754*10
AINVL09  DFHMDF ATTRB=(PROT,BRT),                                      X00755*10
               LENGTH=4,                                               X00756*10
               COLOR=BLUE,                                             X00757*10
               POS=(15,76)                                              00758*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 16                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASEL10   DFHMDF ATTRB=(UNPROT,FSET),                                   X00764*10
               LENGTH=1,                                               X00765*10
               COLOR=GREEN,                                            X00766*10
               HILIGHT=UNDERLINE,                                      X00767*10
               POS=(16,1)                                               00768*10
AACT10   DFHMDF ATTRB=(ASKIP,NORM),                                    X00769*10
               LENGTH=1,                                               X00770*10
               COLOR=BLUE,                                             X00771*10
               POS=(16,3)                                               00772*10
APECS10  DFHMDF ATTRB=(UNPROT),                                        X00773*10
               LENGTH=6,                                               X00774*10
               COLOR=GREEN,                                            X00775*10
               HILIGHT=UNDERLINE,                                      X00776*10
               POS=(16,5)                                               00777*10
AUCST10  DFHMDF ATTRB=(UNPROT),                                        X00778*10
               LENGTH=9,                                               X00779*10
               COLOR=GREEN,                                            X00780*10
               HILIGHT=UNDERLINE,                                      X00781*10
               POS=(16,12)                                              00782*10
APOLN10  DFHMDF ATTRB=(PROT,BRT),                                      X00786*10
               LENGTH=4,                                               X00787*10
               COLOR=BLUE,                                             X00788*10
               POS=(16,22)                                              00789*10
AUPCD10  DFHMDF ATTRB=(PROT,BRT),                                      X00790*10
               LENGTH=16,                                              X00791*10
               COLOR=BLUE,                                             X00792*10
               POS=(16,27)                                              00793*10
ASKU10   DFHMDF ATTRB=(PROT,BRT),                                      X00794*10
               LENGTH=8,                                               X00795*10
               COLOR=BLUE,                                             X00796*10
               POS=(16,44)                                              00797*10
ASTYL10  DFHMDF ATTRB=(PROT,BRT),                                      X00802*10
               LENGTH=12,                                              X00803*10
               COLOR=BLUE,                                             X00804*10
               POS=(16,53)                                              00805*10
ACOLR10  DFHMDF ATTRB=(PROT,BRT),                                      X00806*10
               LENGTH=3,                                               X00807*10
               COLOR=BLUE,                                             X00808*10
               POS=(16,66)                                              00809*10
ASIZE10  DFHMDF ATTRB=(PROT,BRT),                                      X00810*10
               LENGTH=5,                                               X00811*10
               COLOR=BLUE,                                             X00812*10
               POS=(16,70)                                              00813*10
AINVL10  DFHMDF ATTRB=(PROT,BRT),                                      X00814*10
               LENGTH=4,                                               X00815*10
               COLOR=BLUE,                                             X00816*10
               POS=(16,76)                                              00817*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 17                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASEL11   DFHMDF ATTRB=(UNPROT,FSET),                                   X00823*10
               LENGTH=1,                                               X00824*10
               COLOR=GREEN,                                            X00825*10
               HILIGHT=UNDERLINE,                                      X00826*10
               POS=(17,1)                                               00827*10
AACT11   DFHMDF ATTRB=(ASKIP,NORM),                                    X00828*10
               LENGTH=1,                                               X00829*10
               COLOR=BLUE,                                             X00830*10
               POS=(17,3)                                               00831*10
APECS11  DFHMDF ATTRB=(UNPROT),                                        X00832*10
               LENGTH=6,                                               X00833*10
               COLOR=GREEN,                                            X00834*10
               HILIGHT=UNDERLINE,                                      X00835*10
               POS=(17,5)                                               00836*10
AUCST11  DFHMDF ATTRB=(UNPROT),                                        X00837*10
               LENGTH=9,                                               X00838*10
               COLOR=GREEN,                                            X00839*10
               HILIGHT=UNDERLINE,                                      X00840*10
               POS=(17,12)                                              00841*10
APOLN11  DFHMDF ATTRB=(PROT,BRT),                                      X00845*10
               LENGTH=4,                                               X00846*10
               COLOR=BLUE,                                             X00847*10
               POS=(17,22)                                              00848*10
AUPCD11  DFHMDF ATTRB=(PROT,BRT),                                      X00849*10
               LENGTH=16,                                              X00850*10
               COLOR=BLUE,                                             X00851*10
               POS=(17,27)                                              00852*10
ASKU11   DFHMDF ATTRB=(PROT,BRT),                                      X00853*10
               LENGTH=8,                                               X00854*10
               COLOR=BLUE,                                             X00855*10
               POS=(17,44)                                              00856*10
ASTYL11  DFHMDF ATTRB=(PROT,BRT),                                      X00861*10
               LENGTH=12,                                              X00862*10
               COLOR=BLUE,                                             X00863*10
               POS=(17,53)                                              00864*10
ACOLR11  DFHMDF ATTRB=(PROT,BRT),                                      X00865*10
               LENGTH=3,                                               X00866*10
               COLOR=BLUE,                                             X00867*10
               POS=(17,66)                                              00868*10
ASIZE11  DFHMDF ATTRB=(PROT,BRT),                                      X00869*10
               LENGTH=5,                                               X00870*10
               COLOR=BLUE,                                             X00871*10
               POS=(17,70)                                              00872*10
AINVL11  DFHMDF ATTRB=(PROT,BRT),                                      X00873*10
               LENGTH=4,                                               X00874*10
               COLOR=BLUE,                                             X00875*10
               POS=(17,76)                                              00876*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 19                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT,BRT),                                      X00882*10
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00883*10
               LENGTH=25,                                              X00884*10
               COLOR=NEUTRAL,                                          X00885*10
               POS=(19,45)                                              00886*10
****************************************                                00887*10
*  VARIABLE = LIST-SELECTED-ITEMS      N006                             00888*10
****************************************                                00889*10
ASELIT   DFHMDF ATTRB=(PROT),                                          X00890*10
               PICOUT='ZZZ,ZZ9',                                       X00891*10
               LENGTH=7,                                               X00892*10
               COLOR=BLUE,                                             X00893*10
               POS=(19,72)                                              00894*10
         DFHMSD TYPE=FINAL                                              00895*10
         END                                                            00896*10
