*     THIS WAS COPIED FROM APKM340 BY M BESKE 5/02/00                           
*FOR A SPECIFIED PO NUMBER.  IT WILL THEN CHANGE THE VALUE                      
*OF THE STORE NUMBER TO BE 000.  THIS WILL ALLOW THE PO TO                      
*BE TREATED AS A BULK PO.                                                       
*                                                                               
*                                                                               
        PRINT  NOGEN                                                            
APKM367 DFHMSD LANG=COBOL,                                             C        
               MODE=INOUT,                                             C        
               STORAGE=AUTO,                                           C        
               TERM=3270-2,                                            C        
               TIOAPFX=YES,                                            C        
               TYPE=DSECT                                                       
**************                                                                  
AP367A  DFHMDI COLUMN=1,                                               C        
               CTRL=(FREEKB),                                          C        
               DSATTS=(COLOR,HILIGHT),                                 C        
               LINE=2,                                                 C        
               MAPATTS=(COLOR,HILIGHT),                                C        
               SIZE=(19,80)                                                     
**********                                                                      
        DFHMDF ATTRB=(NORM,PROT),                                      C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=7,                                               C        
               POS=(1,4),                                              C        
               INITIAL='PO NBR:'                                                
APONBR  DFHMDF ATTRB=(ASKIP,NORM,NUM),                                 C        
               COLOR=BLUE,                                             C        
               LENGTH=9,                                               C        
               PICOUT='ZZZZZZZZ9',                                     C        
               POS=(1,12)                                                       
        DFHMDF ATTRB=(NORM,PROT),                                      C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=9,                                               C        
               POS=(1,25),                                             C        
               INITIAL='VEND NBR:'                                              
AVNDNBR DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=9,                                               C        
               POS=(1,35)                                                       
        DFHMDF ATTRB=(NORM,PROT),                                      C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=5,                                               C        
               POS=(1,48),                                             C        
               INITIAL='NAME:'                                                  
AVNDNME DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=20,                                              C        
               POS=(1,54)                                                       
**********                                                                      
        DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=5,                                               C        
               POS=(2,44),                                             C        
               INITIAL='ITEMS'                                                  
ASTRTIT DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=5,                                               C        
               PICOUT='ZZZZ9', ASTRTITO                                C        
               POS=(2,50)                                                       
        DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=2,                                               C        
               POS=(2,56),                                             C        
               INITIAL='TO'                                                     
AENDIT  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=5,                                               C        
               PICOUT='ZZZZ9',                                         C        
               POS=(2,59)                                                       
        DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=2,                                               C        
               POS=(2,65),                                             C        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=5,                                               C        
               PICOUT='ZZZZ9',                                         C        
               POS=(2,68)                                                       
**********                                                                      
        DFHMDF ATTRB=(NORM,PROT),                                      C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=14,                                              C        
               POS=(4,3),                                              C        
               INITIAL='INVOICE NUMBER'                                         
        DFHMDF ATTRB=(NORM,PROT),                                      C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=12,                                              C        
               POS=(4,20),                                             C        
               INITIAL='INVOICE DATE'                                           
        DFHMDF ATTRB=(NORM,PROT),                                      C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=3,                                               C        
               POS=(4,34),                                             C        
               INITIAL='STR'                                                    
        DFHMDF ATTRB=(NORM,PROT),                                      C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=2,                                               C        
               POS=(4,39),                                             C        
               INITIAL='DC'                                                     
        DFHMDF ATTRB=(NORM,PROT),                                      C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=2,                                               C        
               POS=(4,43),                                             C        
               INITIAL='TY'                                                     
        DFHMDF ATTRB=(NORM,PROT),                                      C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=2,                                               C        
               POS=(4,46),                                             C        
               INITIAL='ST'                                                     
        DFHMDF ATTRB=(NORM,PROT),                                      C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=3,                                               C        
               POS=(4,50),                                             C        
               INITIAL='LVL'                                                    
        DFHMDF ATTRB=(NORM,PROT),                                      C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=9,                                               C        
               POS=(4,56),                                             C        
               INITIAL='GROSS AMT'                                              
        DFHMDF ATTRB=(NORM,PROT),                                      C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=10,                                              C        
               POS=(4,69),                                             C        
               INITIAL='ENTRY DATE'                                             
**********                                                                      
ASEL01  DFHMDF POS=(05,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AINVN01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=14,                                              C        
               POS=(5,3)                                                        
AIDTE01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(5,21)                                                       
ASTRN01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(5,33)                                                       
ADCNB01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(5,38)                                                       
ATYPE01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(5,43)                                                       
ASTAT01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(5,46)                                                       
AMLVL01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=1,                                               C        
               POS=(5,51)                                                       
AGAMT01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=12,                                              C        
               POS=(5,54)                                                       
AEDTE01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(5,69)                                                       
**********                                                                      
ASEL02  DFHMDF POS=(06,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AINVN02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=14,                                              C        
               POS=(6,3)                                                        
AIDTE02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(6,21)                                                       
ASTRN02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(6,33)                                                       
ADCNB02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(6,38)                                                       
ATYPE02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(6,43)                                                       
ASTAT02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(6,46)                                                       
AMLVL02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=1,                                               C        
               POS=(6,51)                                                       
AGAMT02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=12,                                              C        
               POS=(6,54)                                                       
AEDTE02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(6,69)                                                       
**********                                                                      
ASEL03  DFHMDF POS=(07,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AINVN03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=14,                                              C        
               POS=(7,3)                                                        
AIDTE03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(7,21)                                                       
ASTRN03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(7,33)                                                       
ADCNB03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(7,38)                                                       
ATYPE03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(7,43)                                                       
ASTAT03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(7,46)                                                       
AMLVL03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=1,                                               C        
               POS=(7,51)                                                       
AGAMT03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=12,                                              C        
               POS=(7,54)                                                       
AEDTE03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(7,69)                                                       
**********                                                                      
ASEL04  DFHMDF POS=(08,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AINVN04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=14,                                              C        
               POS=(8,3)                                                        
AIDTE04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(8,21)                                                       
ASTRN04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(8,33)                                                       
ADCNB04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(8,38)                                                       
ATYPE04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(8,43)                                                       
ASTAT04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(8,46)                                                       
AMLVL04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=1,                                               C        
               POS=(8,51)                                                       
AGAMT04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=12,                                              C        
               POS=(8,54)                                                       
AEDTE04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(8,69)                                                       
**********                                                                      
ASEL05  DFHMDF POS=(09,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AINVN05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=14,                                              C        
               POS=(9,3)                                                        
AIDTE05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(9,21)                                                       
ASTRN05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(9,33)                                                       
ADCNB05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(9,38)                                                       
ATYPE05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(9,43)                                                       
ASTAT05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(9,46)                                                       
AMLVL05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=1,                                               C        
               POS=(9,51)                                                       
AGAMT05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=12,                                              C        
               POS=(9,54)                                                       
AEDTE05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(9,69)                                                       
**********                                                                      
ASEL06  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AINVN06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=14,                                              C        
               POS=(10,3)                                                       
AIDTE06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(10,21)                                                      
ASTRN06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(10,33)                                                      
ADCNB06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(10,38)                                                      
ATYPE06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(10,43)                                                      
ASTAT06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(10,46)                                                      
AMLVL06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=1,                                               C        
               POS=(10,51)                                                      
AGAMT06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=12,                                              C        
               POS=(10,54)                                                      
AEDTE06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(10,69)                                                      
**********                                                                      
ASEL07  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AINVN07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=14,                                              C        
               POS=(11,3)                                                       
AIDTE07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(11,21)                                                      
ASTRN07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(11,33)                                                      
ADCNB07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(11,38)                                                      
ATYPE07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(11,43)                                                      
ASTAT07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(11,46)                                                      
AMLVL07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=1,                                               C        
               POS=(11,51)                                                      
AGAMT07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=12,                                              C        
               POS=(11,54)                                                      
AEDTE07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(11,69)                                                      
**********                                                                      
ASEL08  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AINVN08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=14,                                              C        
               POS=(12,3)                                                       
AIDTE08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(12,21)                                                      
ASTRN08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(12,33)                                                      
ADCNB08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(12,38)                                                      
ATYPE08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(12,43)                                                      
ASTAT08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(12,46)                                                      
AMLVL08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=1,                                               C        
               POS=(12,51)                                                      
AGAMT08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=12,                                              C        
               POS=(12,54)                                                      
AEDTE08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(12,69)                                                      
**********                                                                      
ASEL09  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AINVN09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=14,                                              C        
               POS=(13,3)                                                       
AIDTE09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(13,21)                                                      
ASTRN09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(13,33)                                                      
ADCNB09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(13,38)                                                      
ATYPE09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(13,43)                                                      
ASTAT09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(13,46)                                                      
AMLVL09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=1,                                               C        
               POS=(13,51)                                                      
AGAMT09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=12,                                              C        
               POS=(13,54)                                                      
AEDTE09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(13,69)                                                      
**********                                                                      
ASEL10  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AINVN10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=14,                                              C        
               POS=(14,3)                                                       
AIDTE10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(14,21)                                                      
ASTRN10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(14,33)                                                      
ADCNB10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(14,38)                                                      
ATYPE10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(14,43)                                                      
ASTAT10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(14,46)                                                      
AMLVL10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=1,                                               C        
               POS=(14,51)                                                      
AGAMT10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=12,                                              C        
               POS=(14,54)                                                      
AEDTE10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(14,69)                                                      
**********                                                                      
ASEL11  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AINVN11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=14,                                              C        
               POS=(15,3)                                                       
AIDTE11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(15,21)                                                      
ASTRN11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(15,33)                                                      
ADCNB11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(15,38)                                                      
ATYPE11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(15,43)                                                      
ASTAT11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(15,46)                                                      
AMLVL11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=1,                                               C        
               POS=(15,51)                                                      
AGAMT11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=12,                                              C        
               POS=(15,54)                                                      
AEDTE11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(15,69)                                                      
**********                                                                      
ASEL12  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AINVN12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=14,                                              C        
               POS=(16,3)                                                       
AIDTE12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(16,21)                                                      
ASTRN12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(16,33)                                                      
ADCNB12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(16,38)                                                      
ATYPE12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(16,43)                                                      
ASTAT12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(16,46)                                                      
AMLVL12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=1,                                               C        
               POS=(16,51)                                                      
AGAMT12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=12,                                              C        
               POS=(16,54)                                                      
AEDTE12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(16,69)                                                      
**********                                                                      
ASEL13  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AINVN13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=14,                                              C        
               POS=(17,3)                                                       
AIDTE13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(17,21)                                                      
ASTRN13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(17,33)                                                      
ADCNB13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(17,38)                                                      
ATYPE13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(17,43)                                                      
ASTAT13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(17,46)                                                      
AMLVL13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=1,                                               C        
               POS=(17,51)                                                      
AGAMT13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=12,                                              C        
               POS=(17,54)                                                      
AEDTE13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(17,69)                                                      
**********                                                                      
ASEL14  DFHMDF POS=(18,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AINVN14 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=14,                                              C        
               POS=(18,3)                                                       
AIDTE14 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(18,21)                                                      
ASTRN14 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(18,33)                                                      
ADCNB14 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=4,                                               C        
               POS=(18,38)                                                      
ATYPE14 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(18,43)                                                      
ASTAT14 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=2,                                               C        
               POS=(18,46)                                                      
AMLVL14 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=1,                                               C        
               POS=(18,51)                                                      
AGAMT14 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=12,                                              C        
               POS=(18,54)                                                      
AEDTE14 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=10,                                              C        
               POS=(18,69)                                                      
**********                                                                      
        DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=NEUTRAL,                                          C        
               LENGTH=24,                                              C        
               POS=(19,40),                                            C        
               INITIAL='NUMBER OF UPDATED ITEMS:'                               
AUPDIT  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               COLOR=BLUE,                                             C        
               LENGTH=7,                                               C        
               PICOUT='ZZZ,ZZ9',                                       C        
               POS=(19,66)                                                      
        DFHMSD TYPE=FINAL                                                       
**************                                                                  
**************                                                                  
        END                                                                     
