*          DATA SET APKM337    AT LEVEL 005 AS OF 11/07/95                      
*          DATA SET APKM337    AT LEVEL 004 AS OF 08/08/95              00001**4
*********************************************************************** 00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  APKM337                                            *   00005   
*        MAP     AP337A                                             *   00006   
*        PROGRAM APKCS337                                           *   00007   
*        TRANSID A337                                               *   00008   
*        SYSTEM  CICS ARCH - ACCOUNTS PAYABLE VENDOR PROGRAM CTL    *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
        PRINT NOGEN                                                     00012   
APKM337 DFHMSD TYPE=&SYSPARM,                                          X00013**3
               LANG=COBOL,                                             X00014   
               MODE=INOUT,                                             X00015   
               STORAGE=AUTO,                                           X00016   
               TIOAPFX=YES,                                            X00017   
               TERM=3270-2                                              00018   
AP337A  DFHMDI LINE=2,COLUMN=1,                                        X00019   
               SIZE=(19,80),                                           X00020   
               CTRL=(FREEKB),                                          X00021   
               MAPATTS=(COLOR,HILIGHT),                                X00022   
               DSATTS=(COLOR,HILIGHT)                                   00023   
*********************************************************************** 00024   
        DFHMDF POS=(4,3),LENGTH=32,ATTRB=(ASKIP,BRT),                  X00025**2
               INITIAL='VENDOR NUMBER..................:'               00026   
AVNDNBR DFHMDF POS=(4,36),LENGTH=10,ATTRB=ASKIP,COLOR=BLUE              00027**4
*********************************************************************** 00028   
        DFHMDF POS=(5,3),LENGTH=32,ATTRB=(ASKIP,BRT),                  X00029**2
               INITIAL='VENDOR NAME....................:'               00030**2
AVNDNME DFHMDF POS=(5,36),LENGTH=30,ATTRB=ASKIP,COLOR=BLUE              00031**4
*********************************************************************** 00032**2
        DFHMDF POS=(6,3),LENGTH=32,ATTRB=(ASKIP,BRT),                  X00033**2
               INITIAL='DEPARTMENT.....................:'               00034**2
AVNDDPT DFHMDF POS=(6,36),LENGTH=3,ATTRB=ASKIP,COLOR=BLUE               00035**4
*********************************************************************** 00036**2
        DFHMDF POS=(8,3),LENGTH=32,ATTRB=(ASKIP,BRT),                  X00037**2
               INITIAL='REQUIRES MANUAL RECONCILIATION?:'               00038**2
AMNRCSW DFHMDF POS=(8,36),LENGTH=1,ATTRB=UNPROT,HILIGHT=UNDERLINE       00039**2
        DFHMDF POS=(8,38),LENGTH=1,ATTRB=ASKIP                          00040**2
*********************************************************************** 00041**2
        DFHMDF POS=(10,3),LENGTH=32,ATTRB=(ASKIP,BRT),                 X00042**2
               INITIAL='STARTING DATE..................:'               00043**2
ASTDTE  DFHMDF POS=(10,36),LENGTH=10,ATTRB=ASKIP,COLOR=BLUE             00044**4
*********************************************************************** 00045**2
        DFHMDF POS=(11,3),LENGTH=32,ATTRB=(ASKIP,BRT),                 X00046**5
               INITIAL='ENDING DATE....................:'               00047**2
AENDDTE DFHMDF POS=(11,36),LENGTH=10,ATTRB=ASKIP,COLOR=BLUE             00048**5
*********************************************************************** 00049**2
        DFHMSD TYPE=FINAL                                               00050   
        PRINT NOGEN                                                     00051   
        END                                                             00052   
