        PRINT  NOGEN                                                    00002   
APKM361 DFHMSD TYPE=DSECT,                                             C00003   
               LANG=COBOL,                                             C00004   
               MODE=INOUT,                                             C00005   
               STORAGE=AUTO,                                           C00006   
               TERM=3270-2,                                            C00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
AP361A  DFHMDI LINE=2,COLUMN=1,                                        C00010**5
               SIZE=(19,80),                                           C00011**5
               CTRL=(FREEKB),                                          C00012   
               MAPATTS=(COLOR,HILIGHT),                                C00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
**************                                                          00015   
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00016**4
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00017**3
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00018**7
               COLOR=GREEN,                                            C00019   
               HILIGHT=UNDERLINE,                                      C00020   
               PICOUT='ZZZZ9'                                           00021   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='TO'                                             00024   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00025**3
               COLOR=BLUE,                                             C00026   
               PICOUT='ZZZZ9'                                           00027   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00028**3
               COLOR=NEUTRAL,                                          C00029   
               INITIAL='OF'                                             00030   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00031**3
               COLOR=BLUE,                                             C00032   
               PICOUT='ZZZZ9'                                           00033   
*                                                                       00034   
        DFHMDF POS=(04,01),LENGTH=03,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='SEL'                                            00037   
        DFHMDF POS=(04,06),LENGTH=03,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='ACT'                                            00037   
        DFHMDF POS=(04,10),LENGTH=10,ATTRB=(PROT,NORM),                C00038**8
               COLOR=NEUTRAL,                                          C00039   
               INITIAL='DOC NUMBER'                                     00040   
        DFHMDF POS=(04,27),LENGTH=06,ATTRB=(PROT,NORM),                C00041**8
               COLOR=NEUTRAL,                                          C00042   
               INITIAL='PO NBR'                                         00043   
        DFHMDF POS=(04,37),LENGTH=06,ATTRB=(PROT,NORM),                C00044**8
               COLOR=NEUTRAL,                                          C00045   
               INITIAL='VENDOR'                                         00046   
        DFHMDF POS=(04,49),LENGTH=02,ATTRB=(PROT,NORM),                C00047   
               COLOR=NEUTRAL,                                          C00048   
               INITIAL='TR'                                             00049   
        DFHMDF POS=(04,52),LENGTH=03,ATTRB=(PROT,NORM),                C00050   
               COLOR=NEUTRAL,                                          C00051   
               INITIAL='TYP'                                            00052   
        DFHMDF POS=(04,57),LENGTH=09,ATTRB=(PROT,NORM),                C00044**8
               COLOR=NEUTRAL,                                          C00045   
               INITIAL='  NET AMT'                                      00046   
        DFHMDF POS=(04,70),LENGTH=08,ATTRB=(PROT,NORM),                C00047   
               COLOR=NEUTRAL,                                          C00048   
               INITIAL='ENT DATE'                                       00049   
*                                                                       00053   
ASEL01  DFHMDF POS=(05,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(05,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AACT01  DFHMDF POS=(05,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
ADOCN01 DFHMDF POS=(05,10),LENGTH=16,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
APONU01 DFHMDF POS=(05,27),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
AVEND01 DFHMDF POS=(05,37),LENGTH=11,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
ATRCD01 DFHMDF POS=(05,49),LENGTH=02,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00065   
ATTYP01 DFHMDF POS=(05,52),LENGTH=02,ATTRB=(ASKIP,NORM),               C00066   
               COLOR=BLUE                                               00067   
ANTAM01 DFHMDF POS=(05,55),LENGTH=14,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZ,ZZZ,ZZZ.99'                       00061   
AENDT01 DFHMDF POS=(05,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
*                                                                       00068   
ASEL02  DFHMDF POS=(06,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(06,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AACT02  DFHMDF POS=(06,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
ADOCN02 DFHMDF POS=(06,10),LENGTH=16,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
APONU02 DFHMDF POS=(06,27),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
AVEND02 DFHMDF POS=(06,37),LENGTH=11,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
ATRCD02 DFHMDF POS=(06,49),LENGTH=02,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00065   
ATTYP02 DFHMDF POS=(06,52),LENGTH=02,ATTRB=(ASKIP,NORM),               C00066   
               COLOR=BLUE                                               00067   
ANTAM02 DFHMDF POS=(06,55),LENGTH=14,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZ,ZZZ,ZZZ.99'                       00061   
AENDT02 DFHMDF POS=(06,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
*                                                                               
ASEL03  DFHMDF POS=(07,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(07,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AACT03  DFHMDF POS=(07,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
ADOCN03 DFHMDF POS=(07,10),LENGTH=16,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
APONU03 DFHMDF POS=(07,27),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
AVEND03 DFHMDF POS=(07,37),LENGTH=11,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
ATRCD03 DFHMDF POS=(07,49),LENGTH=02,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00065   
ATTYP03 DFHMDF POS=(07,52),LENGTH=02,ATTRB=(ASKIP,NORM),               C00066   
               COLOR=BLUE                                               00067   
ANTAM03 DFHMDF POS=(07,55),LENGTH=14,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZ,ZZZ,ZZZ.99'                       00061   
AENDT03 DFHMDF POS=(07,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
*                                                                               
ASEL04  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(08,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AACT04  DFHMDF POS=(08,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
ADOCN04 DFHMDF POS=(08,10),LENGTH=16,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
APONU04 DFHMDF POS=(08,27),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
AVEND04 DFHMDF POS=(08,37),LENGTH=11,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
ATRCD04 DFHMDF POS=(08,49),LENGTH=02,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00065   
ATTYP04 DFHMDF POS=(08,52),LENGTH=02,ATTRB=(ASKIP,NORM),               C00066   
               COLOR=BLUE                                               00067   
ANTAM04 DFHMDF POS=(08,55),LENGTH=14,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZ,ZZZ,ZZZ.99'                       00061   
AENDT04 DFHMDF POS=(08,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
*                                                                       00263   
ASEL05  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(09,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AACT05  DFHMDF POS=(09,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
ADOCN05 DFHMDF POS=(09,10),LENGTH=16,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
APONU05 DFHMDF POS=(09,27),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
AVEND05 DFHMDF POS=(09,37),LENGTH=11,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
ATRCD05 DFHMDF POS=(09,49),LENGTH=02,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00065   
ATTYP05 DFHMDF POS=(09,52),LENGTH=02,ATTRB=(ASKIP,NORM),               C00066   
               COLOR=BLUE                                               00067   
ANTAM05 DFHMDF POS=(09,55),LENGTH=14,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZ,ZZZ,ZZZ.99'                       00061   
AENDT05 DFHMDF POS=(09,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
*                                                                               
ASEL06  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(10,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AACT06  DFHMDF POS=(10,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
ADOCN06 DFHMDF POS=(10,10),LENGTH=16,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
APONU06 DFHMDF POS=(10,27),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
AVEND06 DFHMDF POS=(10,37),LENGTH=11,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
ATRCD06 DFHMDF POS=(10,49),LENGTH=02,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00065   
ATTYP06 DFHMDF POS=(10,52),LENGTH=02,ATTRB=(ASKIP,NORM),               C00066   
               COLOR=BLUE                                               00067   
ANTAM06 DFHMDF POS=(10,55),LENGTH=14,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZ,ZZZ,ZZZ.99'                       00061   
AENDT06 DFHMDF POS=(10,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
*                                                                               
ASEL07  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(11,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AACT07  DFHMDF POS=(11,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
ADOCN07 DFHMDF POS=(11,10),LENGTH=16,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
APONU07 DFHMDF POS=(11,27),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
AVEND07 DFHMDF POS=(11,37),LENGTH=11,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
ATRCD07 DFHMDF POS=(11,49),LENGTH=02,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00065   
ATTYP07 DFHMDF POS=(11,52),LENGTH=02,ATTRB=(ASKIP,NORM),               C00066   
               COLOR=BLUE                                               00067   
ANTAM07 DFHMDF POS=(11,55),LENGTH=14,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZ,ZZZ,ZZZ.99'                       00061   
AENDT07 DFHMDF POS=(11,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
*                                                                               
ASEL08  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(12,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AACT08  DFHMDF POS=(12,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
ADOCN08 DFHMDF POS=(12,10),LENGTH=16,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
APONU08 DFHMDF POS=(12,27),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
AVEND08 DFHMDF POS=(12,37),LENGTH=11,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
ATRCD08 DFHMDF POS=(12,49),LENGTH=02,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00065   
ATTYP08 DFHMDF POS=(12,52),LENGTH=02,ATTRB=(ASKIP,NORM),               C00066   
               COLOR=BLUE                                               00067   
ANTAM08 DFHMDF POS=(12,55),LENGTH=14,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZ,ZZZ,ZZZ.99'                       00061   
AENDT08 DFHMDF POS=(12,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
*                                                                               
ASEL09  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(13,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AACT09  DFHMDF POS=(13,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
ADOCN09 DFHMDF POS=(13,10),LENGTH=16,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
APONU09 DFHMDF POS=(13,27),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
AVEND09 DFHMDF POS=(13,37),LENGTH=11,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
ATRCD09 DFHMDF POS=(13,49),LENGTH=02,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00065   
ATTYP09 DFHMDF POS=(13,52),LENGTH=02,ATTRB=(ASKIP,NORM),               C00066   
               COLOR=BLUE                                               00067   
ANTAM09 DFHMDF POS=(13,55),LENGTH=14,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZ,ZZZ,ZZZ.99'                       00061   
AENDT09 DFHMDF POS=(13,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
*                                                                               
ASEL10  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(14,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AACT10  DFHMDF POS=(14,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
ADOCN10 DFHMDF POS=(14,10),LENGTH=16,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
APONU10 DFHMDF POS=(14,27),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
AVEND10 DFHMDF POS=(14,37),LENGTH=11,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
ATRCD10 DFHMDF POS=(14,49),LENGTH=02,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00065   
ATTYP10 DFHMDF POS=(14,52),LENGTH=02,ATTRB=(ASKIP,NORM),               C00066   
               COLOR=BLUE                                               00067   
ANTAM10 DFHMDF POS=(14,55),LENGTH=14,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZ,ZZZ,ZZZ.99'                       00061   
AENDT10 DFHMDF POS=(14,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
*                                                                               
ASEL11  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(15,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AACT11  DFHMDF POS=(15,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
ADOCN11 DFHMDF POS=(15,10),LENGTH=16,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
APONU11 DFHMDF POS=(15,27),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
AVEND11 DFHMDF POS=(15,37),LENGTH=11,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
ATRCD11 DFHMDF POS=(15,49),LENGTH=02,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00065   
ATTYP11 DFHMDF POS=(15,52),LENGTH=02,ATTRB=(ASKIP,NORM),               C00066   
               COLOR=BLUE                                               00067   
ANTAM11 DFHMDF POS=(15,55),LENGTH=14,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZ,ZZZ,ZZZ.99'                       00061   
AENDT11 DFHMDF POS=(15,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
*                                                                               
ASEL12  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(16,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AACT12  DFHMDF POS=(16,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
ADOCN12 DFHMDF POS=(16,10),LENGTH=16,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
APONU12 DFHMDF POS=(16,27),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
AVEND12 DFHMDF POS=(16,37),LENGTH=11,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
ATRCD12 DFHMDF POS=(16,49),LENGTH=02,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00065   
ATTYP12 DFHMDF POS=(16,52),LENGTH=02,ATTRB=(ASKIP,NORM),               C00066   
               COLOR=BLUE                                               00067   
ANTAM12 DFHMDF POS=(16,55),LENGTH=14,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZ,ZZZ,ZZZ.99'                       00061   
AENDT12 DFHMDF POS=(16,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
*                                                                               
ASEL13  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(17,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AACT13  DFHMDF POS=(17,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
ADOCN13 DFHMDF POS=(17,10),LENGTH=16,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
APONU13 DFHMDF POS=(17,27),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
AVEND13 DFHMDF POS=(17,37),LENGTH=11,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
ATRCD13 DFHMDF POS=(17,49),LENGTH=02,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00065   
ATTYP13 DFHMDF POS=(17,52),LENGTH=02,ATTRB=(ASKIP,NORM),               C00066   
               COLOR=BLUE                                               00067   
ANTAM13 DFHMDF POS=(17,55),LENGTH=14,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZ,ZZZ,ZZZ.99'                       00061   
AENDT13 DFHMDF POS=(17,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
*                                                                               
ASEL14  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(18,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AACT14  DFHMDF POS=(18,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
ADOCN14 DFHMDF POS=(18,10),LENGTH=16,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
APONU14 DFHMDF POS=(18,27),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
AVEND14 DFHMDF POS=(18,37),LENGTH=11,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
ATRCD14 DFHMDF POS=(18,49),LENGTH=02,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00065   
ATTYP14 DFHMDF POS=(18,52),LENGTH=02,ATTRB=(ASKIP,NORM),               C00066   
               COLOR=BLUE                                               00067   
ANTAM14 DFHMDF POS=(18,55),LENGTH=14,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZ,ZZZ,ZZZ.99'                       00061   
AENDT14 DFHMDF POS=(18,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
*                                                                               
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00264   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00265   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00266   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00267   
**************                                                          00268   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
