*          DATA SET APKM320    AT LEVEL 001 AS OF 01/12/95                      
*          DATA SET APKM320    AT LEVEL 006 AS OF 05/31/94              00001   
  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  APKM320                                            *   00005   
*        MAP     AP320A                                             *   00006   
*        PROGRAM APKCS320                                           *   00007   
*        TRANSID A320 - INVOICE SELECTION CRITERIA SPEC             *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
APKM320 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
AP320A  DFHMDI LINE=2,COLUMN=1,                                        X00016   
               SIZE=(19,80),                                           X00017   
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='ENTER ONE OR MORE OF THE FOLLOWING FIELDS AND PX00022   
               RESS A FUNCTION KEY',                                   X00023   
               LENGTH=66,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(03,04)                                              00026   
*                                                                       00027   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028   
               INITIAL='P/O NUMBER ....:',                             X00029   
               LENGTH=16,                                              X00030   
               COLOR=NEUTRAL,                                          X00031   
               POS=(06,04)                                              00032   
APONUM  DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00033   
               LENGTH=9,                                               X00034   
               COLOR=GREEN,                                            X00035   
               HILIGHT=UNDERLINE,                                      X00036   
               POS=(06,21),                                            X00037   
               PICOUT='ZZZZZZZZZ'                                       00038   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               LENGTH=1,                                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               POS=(06,31)                                              00042   
*                                                                       00043   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00044   
               INITIAL='VENDOR NUMBER :',                              X00045   
               LENGTH=15,                                              X00046   
               COLOR=NEUTRAL,                                          X00047   
               POS=(06,49)                                              00048   
AVNDNUM DFHMDF ATTRB=(UNPROT,NORM),                                    X00049   
               LENGTH=9,                                               X00050   
               COLOR=GREEN,                                            X00051   
               HILIGHT=UNDERLINE,                                      X00052   
               POS=(06,65)                                              00053   
        DFHMDF ATTRB=(ASKIP),                                          X00054   
               LENGTH=1,                                               X00055   
               COLOR=NEUTRAL,                                          X00056   
               POS=(06,75)                                              00057   
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00059   
               INITIAL='INVOICE NUMBER :',                             X00060   
               LENGTH=16,                                              X00061   
               COLOR=NEUTRAL,                                          X00062   
               POS=(08,04)                                              00063   
AINVNUM DFHMDF ATTRB=(UNPROT,NORM),                                    X00064   
               LENGTH=22,                                              X00065   
               COLOR=GREEN,                                            X00066   
               HILIGHT=UNDERLINE,                                      X00067   
               POS=(08,21)                                              00068   
        DFHMDF ATTRB=(ASKIP),                                          X00069   
               LENGTH=1,                                               X00070   
               COLOR=NEUTRAL,                                          X00071   
               POS=(08,44)                                              00072   
*                                                                       00073   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00074   
               INITIAL='STORE NUMBER ..:',                             X00075   
               LENGTH=16,                                              X00076   
               COLOR=NEUTRAL,                                          X00077   
               POS=(10,04)                                              00078   
ASTRNUM DFHMDF ATTRB=(UNPROT,NORM),                                    X00079   
               LENGTH=4,                                               X00080   
               COLOR=GREEN,                                            X00081   
               HILIGHT=UNDERLINE,                                      X00082   
               POS=(10,21)                                              00083   
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(10,26)                                              00087   
*                                                                       00043   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00044   
               INITIAL='DC NUMBER ....:',                              X00045   
               LENGTH=15,                                              X00046   
               COLOR=NEUTRAL,                                          X00047   
               POS=(10,49)                                              00048   
ADCNUM  DFHMDF ATTRB=(UNPROT,NORM),                                    X00049   
               LENGTH=5,                                               X00050   
               COLOR=GREEN,                                            X00051   
               HILIGHT=UNDERLINE,                                      X00052   
               POS=(10,65)                                              00053   
        DFHMDF ATTRB=(ASKIP),                                          X00054   
               LENGTH=1,                                               X00055   
               COLOR=NEUTRAL,                                          X00056   
               POS=(10,71)                                              00057   
*                                                                       00088   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00089   
               INITIAL='INVOICE STATUS :',                             X00090   
               LENGTH=16,                                              X00091   
               COLOR=NEUTRAL,                                          X00092   
               POS=(12,04)                                              00093   
AINVSTA DFHMDF ATTRB=(UNPROT,NORM),                                    X00094   
               LENGTH=2,                                               X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               POS=(12,21)                                              00098   
        DFHMDF ATTRB=(ASKIP),                                          X00099   
               LENGTH=1,                                               X00100   
               COLOR=NEUTRAL,                                          X00101   
               POS=(12,24)                                              00102   
*                                                                       00103   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00104   
               INITIAL='SELECTION DATE :',                             X00105   
               LENGTH=16,                                              X00106   
               COLOR=NEUTRAL,                                          X00107   
               POS=(14,04)                                              00108   
ASELMM  DFHMDF ATTRB=(UNPROT,NORM),                                    X00109   
               LENGTH=2,                                               X00110   
               COLOR=GREEN,                                            X00111   
               HILIGHT=UNDERLINE,                                      X00112   
               POS=(14,21)                                              00113   
ASELDD  DFHMDF ATTRB=(UNPROT,NORM),                                    X00114   
               LENGTH=2,                                               X00115   
               COLOR=GREEN,                                            X00116   
               HILIGHT=UNDERLINE,                                      X00117   
               POS=(14,24)                                              00118   
ASELYY  DFHMDF ATTRB=(UNPROT,NORM),                                    X00119   
               LENGTH=2,                                               X00120   
               COLOR=GREEN,                                            X00121   
               HILIGHT=UNDERLINE,                                      X00122   
               POS=(14,27)                                              00123   
        DFHMDF ATTRB=(ASKIP),                                          X00124   
               POS=(14,30),                                            X00125   
               INITIAL=' ',                                            X00126   
               LENGTH=1                                                 00127   
*                                                                       00088   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00089   
               INITIAL='INVOICE TYPE ..:',                             X00090   
               LENGTH=16,                                              X00091   
               COLOR=NEUTRAL,                                          X00092   
               POS=(16,04)                                              00093   
AINVTYP DFHMDF ATTRB=(UNPROT,NORM),                                    X00094   
               LENGTH=2,                                               X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               POS=(16,21)                                              00098   
        DFHMDF ATTRB=(ASKIP),                                          X00099   
               LENGTH=1,                                               X00100   
               COLOR=NEUTRAL,                                          X00101   
               POS=(16,24)                                              00102   
*                                                                       00088   
        DFHMSD TYPE=FINAL                                               00128   
        END                                                             00129   
