*          DATA SET APKM329    AT LEVEL 007 AS OF 06/27/94                      
*          DATA SET APKM329A1  AT LEVEL 014 AS OF 06/20/94              00001**3
  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  APKM329                                            *   00005**3
*        MAP     AP329A                                             *   00006**3
*        PROGRAM APKCS329                                           *   00007**3
*        TRANSID A329                                               *   00008**3
*        SYSTEM  CICS ARCH - ACCOUNTS PAYABLE ITEM ENTRY            *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
APKM329 DFHMSD TYPE=DSECT,                                             X00012**3
               LANG=COBOL,                                             X00013   
               MODE=INOUT,                                             X00014   
               STORAGE=AUTO,                                           X00015   
               TIOAPFX=YES,                                            X00016   
               TERM=3270-2                                              00017   
AP329A  DFHMDI LINE=2,COLUMN=1,                                        X00018**3
               SIZE=(19,80),                                           X00019   
               CTRL=(FREEKB),                                          X00020   
               MAPATTS=(COLOR,HILIGHT),                                X00021   
               DSATTS=(COLOR,HILIGHT)                                   00022   
         DFHMDF ATTRB=(PROT),                                          X00023   
               INITIAL='INVOICE NBR:',                                 X00024   
               COLOR=NEUTRAL,                                          X00025   
               LENGTH=12,                                              X00026   
               POS=(02,01)                                              00027   
AINVNBR  DFHMDF ATTRB=(ASKIP),                                         X00028   
               COLOR=BLUE,                                             X00029   
               LENGTH=22,                                              X00030   
               POS=(02,15)                                              00031   
         DFHMDF ATTRB=(PROT),                                          X00032   
               INITIAL='PO NBR:',                                      X00033   
               COLOR=NEUTRAL,                                          X00034   
               LENGTH=7,                                               X00035   
               POS=(02,38)                                              00036   
APONUM   DFHMDF ATTRB=(PROT),                                          X00037   
               COLOR=BLUE,                                             X00038   
               LENGTH=9,                                               X00039   
               POS=(02,46)                                              00040   
         DFHMDF ATTRB=(PROT),                                          X00041   
               INITIAL='VENDOR:',                                      X00042   
               COLOR=NEUTRAL,                                          X00043   
               LENGTH=07,                                              X00044   
               POS=(02,57)                                              00045   
ADUNNBR  DFHMDF ATTRB=(PROT),                                          X00046   
               COLOR=BLUE,                                             X00047   
               LENGTH=9,                                               X00048   
               POS=(02,65)                                              00049   
*********************************************************************** 00050   
         DFHMDF ATTRB=(PROT),                                          X00051   
               INITIAL='INVOICE LNE:',                                 X00052   
               COLOR=NEUTRAL,                                          X00053   
               LENGTH=12,                                              X00054   
               POS=(03,01)                                              00055   
AINVLNE  DFHMDF ATTRB=(ASKIP),                                         X00056   
               COLOR=BLUE,                                             X00057   
               LENGTH=22,                                              X00058   
               POS=(03,15)                                              00059   
         DFHMDF ATTRB=(PROT),                                          X00060   
               INITIAL='PO LNE:',                                      X00061   
               COLOR=NEUTRAL,                                          X00062   
               LENGTH=7,                                               X00063   
               POS=(03,38)                                              00064   
APOLNE   DFHMDF ATTRB=(PROT),                                          X00065   
               COLOR=BLUE,                                             X00066   
               LENGTH=4,                                               X00067**7
               POS=(03,46)                                              00068   
         DFHMDF ATTRB=(ASKIP),POS=(03,51),LENGTH=01                     00069**7
         DFHMDF ATTRB=(PROT),                                          X00070   
               INITIAL='DEPT..:',                                      X00071   
               COLOR=NEUTRAL,                                          X00072   
               LENGTH=07,                                              X00073   
               POS=(03,57)                                              00074   
ADPTNBR  DFHMDF ATTRB=(PROT),                                          X00075   
               COLOR=BLUE,                                             X00076   
               LENGTH=9,                                               X00077   
               POS=(03,65)                                              00078   
**********************************************************************  00079   
         DFHMDF ATTRB=(PROT),                                          X00080   
               INITIAL='NUMBER OF PIECES..:',                          X00081   
               COLOR=NEUTRAL,                                          X00082   
               LENGTH=19,                                              X00083   
               POS=(05,1)                                               00084   
ANBRPCS  DFHMDF ATTRB=(UNPROT),                                        X00085   
               COLOR=GREEN,                                            X00086   
               HILIGHT=UNDERLINE,                                      X00087   
               LENGTH=07,                                              X00088   
               POS=(05,22)                                              00089   
         DFHMDF ATTRB=(ASKIP),POS=(05,30),LENGTH=01                     00090   
         DFHMDF ATTRB=(PROT),                                          X00091   
               INITIAL='UOM:',                                         X00092   
               COLOR=NEUTRAL,                                          X00093   
               LENGTH=04,                                              X00094   
               POS=(05,32)                                              00095   
AUOM     DFHMDF ATTRB=(UNPROT),                                        X00096   
               COLOR=GREEN,                                            X00097   
               HILIGHT=UNDERLINE,                                      X00098   
               LENGTH=02,                                              X00099   
               POS=(05,37)                                              00100   
         DFHMDF ATTRB=(ASKIP),POS=(05,40),LENGTH=01                     00101   
**********************************************************************  00102   
         DFHMDF ATTRB=(PROT),                                          X00103   
               INITIAL='ORIGINAL UNIT COST:',                          X00104   
               COLOR=NEUTRAL,                                          X00105   
               LENGTH=19,                                              X00106   
               POS=(06,1)                                               00107   
AUNTCST  DFHMDF ATTRB=(UNPROT),                                        X00108   
               COLOR=GREEN,                                            X00109   
               HILIGHT=UNDERLINE,                                      X00110   
               LENGTH=10,                                              X00111   
               POS=(06,22)                                              00112   
         DFHMDF ATTRB=(ASKIP),POS=(06,33),LENGTH=01                     00113   
**********************************************************************  00114   
         DFHMDF ATTRB=(PROT),                                          X00115   
               INITIAL='USE PO UNIT COST FOR PAYMENT?.....:',          X00116   
               COLOR=NEUTRAL,                                          X00117   
               LENGTH=35,                                              X00118   
               POS=(07,01)                                              00119   
APAYIND  DFHMDF ATTRB=(PROT),                                          X00120**3
               COLOR=BLUE,                                             X00121**3
               LENGTH=1,                                               X00122   
               POS=(07,37)                                              00123   
         DFHMDF ATTRB=(ASKIP),POS=(07,39),LENGTH=01                     00124   
**********************************************************************  00254   
         DFHMSD TYPE=FINAL                                              00255   
         END                                                            00256   
