*          DATA SET APKM336    AT LEVEL 002 AS OF 08/16/95                      
*          DATA SET APKM336    AT LEVEL 001 AS OF 01/12/95              00001   
  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  APKM336                                            *   00005   
*        MAP     AP336A                                             *   00006   
*        PROGRAM APKCS336                                           *   00007   
*        TRANSID A336 - VENDOR SELECTION CRITERIA SPEC             *    00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
APKM336 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
AP336A  DFHMDI LINE=2,COLUMN=1,                                        X00016   
               SIZE=(19,80),                                           X00017   
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='ENTER ONE OR MORE OF THE FOLLOWING FIELDS AND PX00022   
               RESS A FUNCTION KEY',                                   X00023   
               LENGTH=66,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(03,04)                                              00026   
*                                                                       00027   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028   
               INITIAL='VENDOR NUMBER:',                               X00029   
               LENGTH=14,                                              X00030   
               COLOR=NEUTRAL,                                          X00031   
               POS=(06,04)                                              00032   
AVNDNUM DFHMDF ATTRB=(UNPROT,NORM),                                    X00033   
               LENGTH=9,                                               X00034   
               COLOR=GREEN,                                            X00035   
               HILIGHT=UNDERLINE,                                      X00036   
               POS=(06,19)                                              00037   
        DFHMDF ATTRB=(ASKIP),                                          X00038   
               LENGTH=1,                                               X00039   
               COLOR=NEUTRAL,                                          X00040   
               POS=(06,29)                                              00041**2
*                                                                       00042   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00043   
               INITIAL='DEPARTMENT...:',                               X00044   
               LENGTH=14,                                              X00045   
               COLOR=NEUTRAL,                                          X00046   
               POS=(08,04)                                              00047   
ADPTNUM DFHMDF ATTRB=(UNPROT,NORM),                                    X00048   
               LENGTH=03,                                              X00049   
               COLOR=GREEN,                                            X00050   
               HILIGHT=UNDERLINE,                                      X00051   
               POS=(08,19)                                              00052   
        DFHMDF ATTRB=(ASKIP),                                          X00053   
               LENGTH=1,                                               X00054   
               COLOR=NEUTRAL,                                          X00055   
               POS=(08,23)                                              00056   
*                                                                       00057   
        DFHMSD TYPE=FINAL                                               00058   
        END                                                             00059   
