*          DATA SET APKM366    AT LEVEL 003 AS OF 06/28/07              00003   
*          DATA SET APKM366    AT LEVEL 002 AS OF 09/04/98              00003   
  PRINT  NOGEN                                                          00004   
*-------------------------------------------------------------------*   00005   
*                                                                   *   00006   
*        MAPSET  APKM366                                            *   00007   
*        MAP     AP366A                                             *   00008   
*        PROGRAM APKCS366                                           *   00009   
*        TRANSID A366                                               *   00010   
*        SYSTEM  CICS ARCH - ADJUSTMENT JOURNAL TRANSFER ADD        *   00011   
*  ANY NEW FIELDS ADDED TO THIS MAP MUST BE REFERRED TO IN PGM      *           
*                                                                   *   00012   
*-------------------------------------------------------------------*   00013   
APKM366 DFHMSD TYPE=DSECT,                                             X00014   
               LANG=COBOL,                                             X00015   
               MODE=INOUT,                                             X00016   
               STORAGE=AUTO,                                           X00017   
               TIOAPFX=YES,                                            X00018   
               TERM=3270-2                                              00019   
AP366A  DFHMDI LINE=2,COLUMN=1,                                        X00020   
               SIZE=(19,80),                                           X00021   
               CTRL=(FREEKB),                                          X00022   
               MAPATTS=(COLOR,HILIGHT),                                X00023   
               DSATTS=(COLOR,HILIGHT)                                   00024   
*********************************************************************   00025   
*********************************************************************   00039   
         DFHMDF ATTRB=(PROT),                                          X00040   
               INITIAL='DOC NUMBER...:',                               X00041   
               COLOR=NEUTRAL,                                          X00042   
               LENGTH=14,                                              X00043   
               POS=(03,06)                                              00044   
ADOCNUM  DFHMDF ATTRB=(UNPROT),                                        X00045   
               COLOR=GREEN,                                            X00046   
               HILIGHT=UNDERLINE,                                      X00047   
               LENGTH=16,                                              X00048   
               POS=(03,21)                                              00049   
         DFHMDF ATTRB=(ASKIP),                                         X00050   
               LENGTH=1,                                               X00051   
               POS=(03,38)                                              00052   
         DFHMDF ATTRB=(PROT),                                          X00040   
               INITIAL='DOC DATE.....:',                               X00041   
               COLOR=NEUTRAL,                                          X00042   
               LENGTH=14,                                              X00043   
               POS=(04,06)                                              00044   
ADOCMM   DFHMDF ATTRB=(UNPROT),                                        X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               LENGTH=02,                                              X00084   
               POS=(04,21)                                              00085   
ADOCDD   DFHMDF ATTRB=(UNPROT),                                        X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               LENGTH=02,                                              X00084   
               POS=(04,24)                                              00085   
ADOCYY   DFHMDF ATTRB=(UNPROT),                                        X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               LENGTH=02,                                              X00084   
               POS=(04,27)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00050   
               LENGTH=1,                                               X00051   
               POS=(04,30)                                              00052   
         DFHMDF ATTRB=(PROT),                                          X00053   
               INITIAL='TOTAL COST...:',                               X00054   
               COLOR=NEUTRAL,                                          X00055   
               LENGTH=14,                                              X00056   
               POS=(05,06)                                              00057   
AGRCOST  DFHMDF ATTRB=(UNPROT),                                        X00058   
               COLOR=GREEN,                                            X00059   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=13,                                              X00060   
               POS=(05,21)                                              00061   
         DFHMDF ATTRB=(ASKIP),                                         X00050   
               LENGTH=1,                                               X00051   
               POS=(05,35)                                              00052   
*********************************************************************   00062   
         DFHMDF ATTRB=(PROT),                                          X00053   
               INITIAL='TOTAL RETAIL.:',                               X00054   
               COLOR=NEUTRAL,                                          X00055   
               LENGTH=14,                                              X00056   
               POS=(07,06)                                              00057   
ARETAMT  DFHMDF ATTRB=(UNPROT),                                        X00058   
               COLOR=GREEN,                                            X00059   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=13,                                              X00060   
               POS=(07,21)                                              00061   
         DFHMDF ATTRB=(ASKIP),                                         X00050   
               LENGTH=1,                                               X00051   
               POS=(07,35)                                              00052   
         DFHMDF ATTRB=(PROT),                                          X00026   
               INITIAL='VENDOR.......:',                               X00027   
               COLOR=NEUTRAL,                                          X00028   
               LENGTH=14,                                              X00029   
               POS=(09,06)                                              00030   
AVENDNO  DFHMDF ATTRB=(ASKIP),                                         X00031   
               COLOR=BLUE,                                             X00032   
               HILIGHT=OFF,                                            X00033   
               LENGTH=10,                                              X00034   
               POS=(09,21)                                              00035   
         DFHMDF ATTRB=(ASKIP),                                         X00036   
               LENGTH=1,                                               X00037   
               POS=(09,32)                                              00038   
AVENDNM  DFHMDF ATTRB=(ASKIP),                                         X00068   
               COLOR=BLUE,                                             X00069   
               HILIGHT=OFF,                                            X00070   
               LENGTH=30,                                              X00071   
               POS=(09,34)                                              00072   
         DFHMDF ATTRB=(PROT),                                          X00076   
               INITIAL='FROM:',                                        X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=05,                                              X00079   
               POS=(11,06)                                              00080   
         DFHMDF ATTRB=(PROT),                                          X00076   
               INITIAL='TO EXPENSE:',                                  X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=11,                                              X00079   
               POS=(14,06)                                              00080   
         DFHMDF ATTRB=(PROT),                                          X00076   
               INITIAL='TO MERCHANDISE:',                              X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=15,                                              X00079   
               POS=(17,06)                                              00080   
         DFHMDF ATTRB=(PROT),                                          X00076   
               INITIAL='DEPARTMENT.:',                                 X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=12,                                              X00079   
               POS=(12,08)                                              00080   
ADEPT    DFHMDF ATTRB=(UNPROT),                                        X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               LENGTH=3,                                               X00084   
               POS=(12,21)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               LENGTH=1,                                               X00087   
               POS=(12,25)                                              00088   
         DFHMDF ATTRB=(PROT),                                          X00076   
               INITIAL='ACCT NO....:',                                 X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=12,                                              X00079   
               POS=(15,08)                                              00080   
AACCNO   DFHMDF ATTRB=(UNPROT),                                        X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               LENGTH=7,                                               X00084   
               POS=(15,21)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               LENGTH=1,                                               X00087   
               POS=(15,29)                                              00088   
         DFHMDF ATTRB=(PROT),                                          X00076   
               INITIAL='DEPARTMENT.:',                                 X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=12,                                              X00079   
               POS=(18,08)                                              00080   
ATODEPT  DFHMDF ATTRB=(UNPROT),                                        X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               LENGTH=3,                                               X00084   
               POS=(18,21)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               LENGTH=1,                                               X00087   
               POS=(18,25)                                              00088   
         DFHMDF ATTRB=(PROT),                                          X00076   
               INITIAL='CLASS:',                                       X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=06,                                              X00079   
               POS=(12,30)                                              00080   
ACLASS   DFHMDF ATTRB=(UNPROT),                                        X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               LENGTH=2,                                               X00084   
               POS=(12,37)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               LENGTH=1,                                               X00087   
               POS=(12,40)                                              00088   
         DFHMDF ATTRB=(PROT),                                          X00076   
               INITIAL='STORE:',                                       X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=06,                                              X00079   
               POS=(15,30)                                              00080   
ATOESTR  DFHMDF ATTRB=(UNPROT),                                        X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               LENGTH=4,                                               X00084   
               POS=(15,37)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               LENGTH=1,                                               X00087   
               POS=(15,42)                                              00088   
         DFHMDF ATTRB=(PROT),                                          X00076   
               INITIAL='CLASS:',                                       X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=06,                                              X00079   
               POS=(18,30)                                              00080   
ATOCLS   DFHMDF ATTRB=(UNPROT),                                        X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               LENGTH=2,                                               X00084   
               POS=(18,37)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               LENGTH=1,                                               X00087   
               POS=(18,40)                                              00088   
         DFHMDF ATTRB=(PROT),                                          X00076   
               INITIAL='UPC:',                                         X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=04,                                              X00079   
               POS=(12,42)                                              00080   
AUPC     DFHMDF ATTRB=(UNPROT),                                        X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               LENGTH=17,                                              X00084   
               POS=(12,47)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               LENGTH=1,                                               X00087   
               POS=(12,65)                                              00088   
         DFHMDF ATTRB=(PROT),                                          X00076   
               INITIAL='UPC:',                                         X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=04,                                              X00079   
               POS=(18,42)                                              00080   
ATOUPC   DFHMDF ATTRB=(UNPROT),                                        X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               LENGTH=17,                                              X00084   
               POS=(18,47)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               LENGTH=1,                                               X00087   
               POS=(18,65)                                              00088   
         DFHMDF ATTRB=(PROT),                                          X00076   
               INITIAL='STORE:',                                       X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=06,                                              X00079   
               POS=(12,66)                                              00080   
AFRSTR   DFHMDF ATTRB=(UNPROT),                                        X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               LENGTH=4,                                               X00084   
               POS=(12,73)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               LENGTH=1,                                               X00087   
               POS=(12,78)                                              00088   
         DFHMSD TYPE=FINAL                                              00489   
         END                                                            00490   
