*          DATA SET APKM323    AT LEVEL 009 AS OF 09/19/95                      
*          DATA SET APKM323    AT LEVEL 002 AS OF 09/20/94              00001   
*          DATA SET APKM323    AT LEVEL 032 AS OF 08/18/94              00002   
*          DATA SET APKM323A1  AT LEVEL 002 AS OF 06/01/94              00003   
  PRINT  NOGEN                                                          00004   
*-------------------------------------------------------------------*   00005   
*                                                                   *   00006   
*        MAPSET  APKM323                                            *   00007   
*        MAP     AP323A                                             *   00008   
*        PROGRAM APKCS323                                           *   00009   
*        TRANSID A323                                               *   00010   
*        SYSTEM  CICS ARCH - ACCOUNTS PAYABLE INVOICE UPDATE/DELETE *   00011   
*  ANY NEW FIELDS ADDED TO THIS MAP MUST BE REFERRED TO IN PGM      *           
*   PARAGRAPH 3201-                                                 *           
*                                                                   *   00012   
*-------------------------------------------------------------------*   00013   
APKM323 DFHMSD TYPE=DSECT,                                             X00014   
               LANG=COBOL,                                             X00015   
               MODE=INOUT,                                             X00016   
               STORAGE=AUTO,                                           X00017   
               TIOAPFX=YES,                                            X00018   
               TERM=3270-2                                              00019   
AP323A  DFHMDI LINE=2,COLUMN=1,                                        X00020   
               SIZE=(19,80),                                           X00021   
               CTRL=(FREEKB),                                          X00022   
               MAPATTS=(COLOR,HILIGHT),                                X00023   
               DSATTS=(COLOR,HILIGHT)                                   00024   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 01                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT),                                          X00040   
               INITIAL='INVOICE NUMBER..:',                            X00041   
               COLOR=NEUTRAL,                                          X00042   
               LENGTH=17,                                              X00043   
               POS=(01,01)                                              00044   
AINVNBR  DFHMDF ATTRB=(ASKIP),                                         X00045   
               COLOR=GREEN,                                            X00046   
               HILIGHT=UNDERLINE,                                      X00047   
               LENGTH=22,                                              X00048   
               POS=(01,19)                                              00049   
         DFHMDF ATTRB=(ASKIP),                                         X00050   
               LENGTH=1,                                               X00051   
               POS=(01,42)                                              00052   
         DFHMDF ATTRB=(PROT),                                          X00053   
               INITIAL='STATUS:',                                      X00054   
               COLOR=NEUTRAL,                                          X00055   
               LENGTH=7,                                               X00056   
               POS=(01,60)                                              00057   
ASTATUS  DFHMDF ATTRB=(PROT),                                          X00058   
               COLOR=BLUE,                                             X00059   
               LENGTH=11,                                              X00060   
               POS=(01,68)                                              00061   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 02                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT),                                          X00026   
               INITIAL='P/O NUMBER......:',                            X00027   
               COLOR=NEUTRAL,                                          X00028   
               LENGTH=17,                                              X00029   
               POS=(02,1)                                               00030   
APONUM   DFHMDF ATTRB=(UNPROT),                                        X00031   
               COLOR=GREEN,                                            X00032   
               HILIGHT=UNDERLINE,                                      X00033   
               LENGTH=9,                                               X00034   
               POS=(02,19)                                              00035   
         DFHMDF ATTRB=(ASKIP),                                         X00036   
               LENGTH=1,                                               X00037   
               POS=(02,29)                                              00038   
         DFHMDF ATTRB=(PROT),                                          X00063   
               INITIAL='REMIT VEND NBR:',                              X00064   
               COLOR=NEUTRAL,                                          X00065   
               LENGTH=15,                                              X00066   
               POS=(02,33)                                              00067   
ADUNNBR  DFHMDF ATTRB=(UNPROT),                                        X00068   
               COLOR=GREEN,                                            X00069   
               HILIGHT=UNDERLINE,                                      X00070   
               LENGTH=9,                                               X00071   
               POS=(02,49)                                              00072   
         DFHMDF ATTRB=(ASKIP),                                         X00073   
               LENGTH=1,                                               X00074   
               POS=(02,59)                                              00075   
         DFHMDF ATTRB=(PROT),                                          X00076   
               INITIAL='HOLD?:',                                       X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=6,                                               X00079   
               POS=(02,61)                                              00080   
AHLDIND  DFHMDF ATTRB=(UNPROT),                                        X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               LENGTH=1,                                               X00084   
               POS=(02,68)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               LENGTH=1,                                               X00087   
               POS=(02,70)                                              00088   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 03                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='INVOICE DATE....:',                            X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=17,                                              X00093   
               POS=(03,1)                                               00094   
AINVMM   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=2,                                               X00098   
               POS=(03,19)                                              00099   
AINVDD   DFHMDF ATTRB=(UNPROT),                                        X00100   
               COLOR=GREEN,                                            X00101   
               HILIGHT=UNDERLINE,                                      X00102   
               LENGTH=2,                                               X00103   
               POS=(03,22)                                              00104   
AINVYY   DFHMDF ATTRB=(UNPROT),                                        X00105   
               COLOR=GREEN,                                            X00106   
               HILIGHT=UNDERLINE,                                      X00107   
               LENGTH=2,                                               X00108   
               POS=(03,25)                                              00109   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(03,28)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00113   
               INITIAL='NAME.:',                                       X00114   
               COLOR=NEUTRAL,                                          X00115   
               LENGTH=06,                                              X00116   
               POS=(03,33)                                              00117   
ANAME    DFHMDF ATTRB=(ASKIP),                                         X00118   
               COLOR=BLUE,                                             X00119   
               LENGTH=40,                                              X00120   
               POS=(03,40)                                              00121   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 04                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT),                                          X00136   
               INITIAL='ADDR1:',                                       X00137   
               COLOR=NEUTRAL,                                          X00138   
               LENGTH=06,                                              X00139   
               POS=(04,33)                                              00140   
AADDR1   DFHMDF ATTRB=(ASKIP),                                         X00141   
               COLOR=BLUE,                                             X00142   
               LENGTH=40,                                              X00143   
               POS=(04,40)                                              00144   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 05                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT),                                          X00146   
               INITIAL='STORE NUMBER....:',                            X00147   
               COLOR=NEUTRAL,                                          X00148   
               LENGTH=17,                                              X00149   
               POS=(05,1)                                               00150   
ASTRNBR  DFHMDF ATTRB=(UNPROT),                                        X00151   
               COLOR=GREEN,                                            X00152   
               HILIGHT=UNDERLINE,                                      X00153   
               LENGTH=4,                                               X00154   
               POS=(05,19)                                              00155   
         DFHMDF ATTRB=(ASKIP),                                         X00156   
               LENGTH=1,                                               X00157   
               POS=(05,24)                                              00158   
         DFHMDF ATTRB=(PROT),                                          X00159   
               INITIAL='ADDR2:',                                       X00160   
               COLOR=NEUTRAL,                                          X00161   
               LENGTH=06,                                              X00162   
               POS=(05,33)                                              00163   
AADDR2   DFHMDF ATTRB=(ASKIP),                                         X00164   
               COLOR=BLUE,                                             X00165   
               LENGTH=40,                                              X00166   
               POS=(05,40)                                              00167   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 06                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT),                                          X00169   
               INITIAL='DEPARTMENT......:',                            X00170   
               COLOR=NEUTRAL,                                          X00171   
               LENGTH=17,                                              X00172   
               POS=(06,01)                                              00173   
ADPTNBR  DFHMDF ATTRB=(ASKIP),                                         X00174   
               COLOR=BLUE,                                             X00175   
               LENGTH=03,                                              X00176   
               POS=(06,19)                                              00177   
         DFHMDF ATTRB=(PROT),                                          X00178   
               INITIAL='CITY.:',                                       X00179   
               COLOR=NEUTRAL,                                          X00180   
               LENGTH=06,                                              X00181   
               POS=(06,33)                                              00182   
ACITY    DFHMDF ATTRB=(ASKIP),                                         X00183   
               COLOR=BLUE,                                             X00184   
               LENGTH=15,                                              X00185   
               POS=(06,40)                                              00186   
         DFHMDF ATTRB=(PROT),                                          X00187   
               INITIAL='ST:',                                          X00188   
               COLOR=NEUTRAL,                                          X00189   
               LENGTH=03,                                              X00190   
               POS=(06,56)                                              00191   
ASTATE   DFHMDF ATTRB=(ASKIP),                                         X00192   
               COLOR=BLUE,                                             X00193   
               LENGTH=2,                                               X00194   
               POS=(06,60)                                              00195   
         DFHMDF ATTRB=(PROT),                                          X00196   
               INITIAL='ZIP:',                                         X00197   
               COLOR=NEUTRAL,                                          X00198   
               LENGTH=04,                                              X00199   
               POS=(06,63)                                              00200   
AZIP     DFHMDF ATTRB=(ASKIP),                                         X00201   
               COLOR=BLUE,                                             X00202   
               LENGTH=12,                                              X00203   
               POS=(06,68)                                              00204   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 07                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT),                                          X00196   
               INITIAL='DC NUMBER.......:',                            X00197   
               COLOR=NEUTRAL,                                          X00198   
               LENGTH=17,                                              X00199   
               POS=(07,1)                                               00200   
ADCNBR   DFHMDF ATTRB=(PROT),                                          X00201   
               COLOR=BLUE,                                             X00202   
               LENGTH=4,                                               X00203   
               POS=(07,19)                                              00204   
         DFHMDF ATTRB=(ASKIP),                                         X00156   
               LENGTH=1,                                               X00157   
               POS=(07,24)                                              00158   
         DFHMDF ATTRB=(PROT),                                          X00196   
               INITIAL='MATCH LEVEL CODE:',                            X00197   
               COLOR=NEUTRAL,                                          X00198   
               LENGTH=17,                                              X00199   
               POS=(07,33)                                              00200   
AMTCHCD  DFHMDF ATTRB=(PROT),                                          X00201   
               COLOR=BLUE,                                             X00202   
               LENGTH=1,                                               X00203   
               POS=(07,51)                                              00204   
         DFHMDF ATTRB=(ASKIP),                                         X00201   
               LENGTH=1,                                               X00203   
               POS=(07,53)                                              00204   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 08                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT),                                          X00206   
               INITIAL='MDSE COST TOTAL.:',                            X00207   
               COLOR=NEUTRAL,                                          X00208   
               LENGTH=17,                                              X00209   
               POS=(08,1)                                               00210   
ATOTCST  DFHMDF ATTRB=(UNPROT),                                        X00211   
               COLOR=GREEN,                                            X00212   
               HILIGHT=UNDERLINE,                                      X00213   
               LENGTH=11,                                              X00214   
               POS=(08,19)                                              00215   
         DFHMDF ATTRB=(ASKIP),                                         X00216   
               LENGTH=1,                                               X00217   
               POS=(08,31)                                              00218   
         DFHMDF ATTRB=(PROT),                                          X00219   
               INITIAL='+ PAY TERMS',                                  X00220   
               COLOR=NEUTRAL,                                          X00221   
               LENGTH=11,                                              X00222   
               POS=(08,33)                                              00223   
         DFHMDF ATTRB=(PROT),                                          X00224   
               INITIAL='---------------------------------+',           X00225   
               COLOR=NEUTRAL,                                          X00226   
               LENGTH=34,                                              X00227   
               POS=(08,45)                                              00228   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 09                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT),                                          X00230   
               INITIAL='TOT INVOICE AMT.:',                            X00231   
               COLOR=NEUTRAL,                                          X00232   
               LENGTH=17,                                              X00233   
               POS=(09,1)                                               00234   
ANETCST  DFHMDF ATTRB=(PROT),                                          X00235   
               COLOR=GREEN,                                            X00236   
               HILIGHT=UNDERLINE,                                      X00237   
               LENGTH=11,                                              X00238   
               POS=(09,19)                                              00239   
         DFHMDF ATTRB=(ASKIP),                                         X00240   
               LENGTH=1,                                               X00241   
               POS=(09,31)                                              00242   
         DFHMDF ATTRB=(PROT),                                          X00243   
               INITIAL='| SEL',                                        X00244   
               COLOR=NEUTRAL,                                          X00245   
               LENGTH=5,                                               X00246   
               POS=(09,33)                                              00247   
         DFHMDF ATTRB=(PROT),                                          X00248   
               INITIAL='PCT  DAYS EOM  EX DAYS SPLIT? |',              X00249   
               COLOR=NEUTRAL,                                          X00250   
               LENGTH=31,                                              X00251   
               POS=(09,48)                                              00252   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 10                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT),                                          X00254   
               INITIAL='TOTAL INV PIECES:',                            X00255   
               COLOR=NEUTRAL,                                          X00256   
               LENGTH=17,                                              X00257   
               POS=(10,1)                                               00258   
ATOTINV  DFHMDF ATTRB=(UNPROT),                                        X00259   
               COLOR=GREEN,                                            X00260   
               HILIGHT=UNDERLINE,                                      X00261   
               LENGTH=9,                                               X00262   
               POS=(10,21)                                              00263   
         DFHMDF ATTRB=(ASKIP),                                         X00264   
               LENGTH=1,                                               X00265   
               POS=(10,31)                                              00266   
         DFHMDF ATTRB=(PROT),                                          X00267   
               INITIAL='|',                                            X00268   
               COLOR=NEUTRAL,                                          X00269   
               LENGTH=1,                                               X00270   
               POS=(10,33)                                              00271   
APOSEL   DFHMDF ATTRB=(UNPROT),                                        X00272   
               COLOR=GREEN,                                            X00273   
               HILIGHT=UNDERLINE,                                      X00274   
               LENGTH=1,                                               X00275   
               POS=(10,36)                                              00276   
         DFHMDF ATTRB=(ASKIP),                                         X00277   
               LENGTH=1,                                               X00278   
               POS=(10,38)                                              00279   
         DFHMDF ATTRB=(PROT),                                          X00280   
               INITIAL='P/O.:',                                        X00281   
               COLOR=NEUTRAL,                                          X00282   
               LENGTH=5,                                               X00283   
               POS=(10,41)                                              00284   
APOPCT   DFHMDF ATTRB=(ASKIP),                                         X00285   
               COLOR=BLUE,                                             X00286   
               LENGTH=5,                                               X00287   
               POS=(10,47)                                              00288   
APODAY   DFHMDF ATTRB=(ASKIP),                                         X00289   
               COLOR=BLUE,                                             X00290   
               LENGTH=3,                                               X00291   
               POS=(10,53)                                              00292   
APOEOM   DFHMDF ATTRB=(ASKIP),                                         X00293   
               COLOR=BLUE,                                             X00294   
               LENGTH=1,                                               X00295   
               POS=(10,59)                                              00296   
APOEXT   DFHMDF ATTRB=(ASKIP),                                         X00297   
               COLOR=BLUE,                                             X00298   
               LENGTH=3,                                               X00299   
               POS=(10,65)                                              00300   
         DFHMDF ATTRB=(PROT),                                          X00301   
               INITIAL='|',                                            X00302   
               COLOR=NEUTRAL,                                          X00303   
               LENGTH=1,                                               X00304   
               POS=(10,78)                                              00305   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 11                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
AITMCAP  DFHMDF ATTRB=(ASKIP),                                         X00307   
               INITIAL='SUM OF ITEM COST:',                            X00308   
               COLOR=NEUTRAL,                                          X00309   
               LENGTH=17,                                              X00310   
               POS=(11,1)                                               00311   
AITMSUM  DFHMDF ATTRB=(ASKIP),                                         X00312   
               COLOR=BLUE,                                             X00313   
               LENGTH=11,                                              X00314   
               POS=(11,19)                                              00315   
         DFHMDF ATTRB=(PROT),                                          X00316   
               INITIAL='|',                                            X00317   
               COLOR=NEUTRAL,                                          X00318   
               LENGTH=1,                                               X00319   
               POS=(11,33)                                              00320   
AINSEL   DFHMDF ATTRB=(UNPROT),                                        X00321   
               COLOR=GREEN,                                            X00322   
               HILIGHT=UNDERLINE,                                      X00323   
               LENGTH=1,                                               X00324   
               POS=(11,36)                                              00325   
         DFHMDF ATTRB=(ASKIP),                                         X00326   
               LENGTH=1,                                               X00327   
               POS=(11,38)                                              00328   
         DFHMDF ATTRB=(PROT),                                          X00329   
               INITIAL='INVC:',                                        X00330   
               COLOR=NEUTRAL,                                          X00331   
               LENGTH=5,                                               X00332   
               POS=(11,41)                                              00333   
AINPCT   DFHMDF ATTRB=(UNPROT),                                        X00334   
               COLOR=GREEN,                                            X00335   
               HILIGHT=UNDERLINE,                                      X00336   
               LENGTH=5,                                               X00337   
               POS=(11,47)                                              00338   
AINDAY   DFHMDF ATTRB=(UNPROT),                                        X00339   
               COLOR=GREEN,                                            X00340   
               HILIGHT=UNDERLINE,                                      X00341   
               LENGTH=3,                                               X00342   
               POS=(11,53)                                              00343   
         DFHMDF ATTRB=(ASKIP),                                         X00344   
               LENGTH=1,                                               X00345   
               POS=(11,57)                                              00346   
AINEOM   DFHMDF ATTRB=(UNPROT),                                        X00347   
               COLOR=GREEN,                                            X00348   
               HILIGHT=UNDERLINE,                                      X00349   
               LENGTH=1,                                               X00350   
               POS=(11,59)                                              00351   
         DFHMDF ATTRB=(ASKIP),                                         X00352   
               LENGTH=1,                                               X00353   
               POS=(11,61)                                              00354   
AINEXT   DFHMDF ATTRB=(UNPROT),                                        X00355   
               COLOR=GREEN,                                            X00356   
               HILIGHT=UNDERLINE,                                      X00357   
               LENGTH=3,                                               X00358   
               POS=(11,65)                                              00359   
         DFHMDF ATTRB=(ASKIP),                                         X00360   
               LENGTH=1,                                               X00361   
               POS=(11,69)                                              00362   
ASPLIT   DFHMDF ATTRB=(UNPROT),                                        X00363   
               COLOR=GREEN,                                            X00364   
               HILIGHT=UNDERLINE,                                      X00365   
               LENGTH=1,                                               X00366   
               POS=(11,73)                                              00367   
         DFHMDF ATTRB=(ASKIP),                                         X00368   
               LENGTH=1,                                               X00369   
               POS=(11,75)                                              00370   
         DFHMDF ATTRB=(PROT),                                          X00371   
               INITIAL='|',                                            X00372   
               COLOR=NEUTRAL,                                          X00373   
               LENGTH=1,                                               X00374   
               POS=(11,78)                                              00375   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 12                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT),                                          X00377**6
               INITIAL='CARTON COUNT....:',                            X00378**6
               COLOR=NEUTRAL,                                          X00379**6
               LENGTH=17,                                              X00380**6
               POS=(12,1)                                               00381**6
ACARTCT  DFHMDF ATTRB=(UNPROT),                                        X00382**6
               COLOR=GREEN,                                            X00383**6
               HILIGHT=UNDERLINE,                                      X00384**6
               LENGTH=5,                                               X00385**6
               POS=(12,19)                                              00386**6
         DFHMDF ATTRB=(ASKIP),                                         X00387**9
               LENGTH=1,                                               X00388**9
               POS=(12,25)                                              00389**9
         DFHMDF ATTRB=(PROT),                                          X00377**6
               INITIAL='|',                                            X00378**6
               COLOR=NEUTRAL,                                          X00379**6
               LENGTH=1,                                               X00380**6
               POS=(12,33)                                              00381**6
         DFHMDF ATTRB=(PROT),                                          X00377**6
               INITIAL='DUE DT SRC:',                                  X00378**6
               COLOR=NEUTRAL,                                          X00379**6
               LENGTH=11,                                              X00380**6
               POS=(12,35)                                              00381**6
ADUESRC  DFHMDF ATTRB=(PROT),                                          X00382**6
               COLOR=BLUE,                                             X00383**6
               LENGTH=9,                                               X00385**6
               POS=(12,47)                                              00386**6
         DFHMDF ATTRB=(PROT),                                          X00377**6
               INITIAL='CALC DUEDT:',                                  X00378**6
               COLOR=NEUTRAL,                                          X00379**6
               LENGTH=11,                                              X00380**6
               POS=(12,57)                                              00381**6
ACALCMM  DFHMDF ATTRB=(PROT),                                          X00382**6
               COLOR=BLUE,                                             X00383**6
               LENGTH=2,                                               X00385**6
               POS=(12,69)                                              00386**6
ACALCDD  DFHMDF ATTRB=(PROT),                                          X00382**6
               COLOR=BLUE,                                             X00383**6
               LENGTH=2,                                               X00385**6
               POS=(12,72)                                              00386**6
ACALCYY  DFHMDF ATTRB=(PROT),                                          X00382**6
               COLOR=BLUE,                                             X00383**6
               LENGTH=2,                                               X00385**6
               POS=(12,75)                                              00386**6
         DFHMDF ATTRB=(PROT),                                          X00377**6
               INITIAL='|',                                            X00378**6
               COLOR=NEUTRAL,                                          X00379**6
               LENGTH=1,                                               X00380**6
               POS=(12,78)                                              00381**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 13                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT),                                          X00395**2
               INITIAL='INVOICE TYPE....:',                            X00396**2
               COLOR=NEUTRAL,                                          X00397**2
               LENGTH=17,                                              X00398**2
               POS=(13,1)                                               00399**6
AINVTYP  DFHMDF ATTRB=(PROT),                                          X00400**2
               COLOR=BLUE,                                             X00401**2
               LENGTH=11,                                              X00402**2
               POS=(13,19)                                              00403**6
ABOXBOT  DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=46,                                              X        
               POS=(13,33)                                                      
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 14                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT),                                          X00430   
               INITIAL='ENTRY METHOD....:',                            X00431   
               COLOR=NEUTRAL,                                          X00432   
               LENGTH=17,                                              X00433   
               POS=(14,1)                                               00434**6
AENTMTH  DFHMDF ATTRB=(PROT),                                          X00435   
               COLOR=BLUE,                                             X00436   
               LENGTH=02,                                              X00437   
               POS=(14,19)                                              00438**6
         DFHMDF ATTRB=(PROT),                                          X00404   
               INITIAL='FREIGHT COMP%.:',                              X00405   
               COLOR=NEUTRAL,                                          X00406   
               LENGTH=15,                                              X00407   
               POS=(14,33)                                              00408**6
ACMPFRT  DFHMDF ATTRB=(UNPROT),                                        X00409   
               COLOR=GREEN,                                            X00410   
               HILIGHT=UNDERLINE,                                      X00411   
               PICOUT='ZZ9',                                           X00412   
               LENGTH=3,                                               X00413   
               POS=(14,49)                                              00414**8
         DFHMDF ATTRB=(ASKIP),                                         X00050   
               LENGTH=1,                                               X00051   
               POS=(14,53)                                              00052   
         DFHMDF ATTRB=(PROT),                                          X00415   
               INITIAL='VEND%:',                                       X00416   
               COLOR=NEUTRAL,                                          X00417   
               LENGTH=6,                                               X00418   
               POS=(14,56)                                              00419**6
AVNDFRT  DFHMDF ATTRB=(UNPROT),                                        X00420   
               COLOR=GREEN,                                            X00421   
               HILIGHT=UNDERLINE,                                      X00422   
               PICOUT='ZZ9',                                           X00423   
               LENGTH=3,                                               X00424   
               POS=(14,63)                                              00425**6
         DFHMDF ATTRB=(ASKIP),                                         X00426   
               POS=(14,67),                                            X00427**6
               LENGTH=1                                                 00428   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 15                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT),                                          X00453   
               INITIAL='ALLW/CHARGES?...:',                            X00454   
               COLOR=NEUTRAL,                                          X00455   
               LENGTH=17,                                              X00456   
               POS=(15,1)                                               00457**6
AALLWCH  DFHMDF ATTRB=(PROT),                                          X00458   
               COLOR=BLUE,                                             X00459   
               LENGTH=01,                                              X00460   
               POS=(15,19)                                              00461**6
ABOLLBL  DFHMDF ATTRB=(PROT),                                          X00439   
               INITIAL='BILL OF LADING:',                              X00440   
               COLOR=NEUTRAL,                                          X00441   
               LENGTH=15,                                              X00442   
               POS=(15,33)                                              00443**6
ABOLNBR  DFHMDF ATTRB=(UNPROT),                                        X00444   
               COLOR=GREEN,                                            X00445   
               HILIGHT=UNDERLINE,                                      X00446   
               LENGTH=30,                                              X00447   
               POS=(15,49)                                              00448**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 16                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
         DFHMDF ATTRB=(PROT),                                          X00453   
               INITIAL='IMPORT SOURCE...:',                            X00454   
               COLOR=NEUTRAL,                                          X00455   
               LENGTH=17,                                              X00456   
               POS=(16,1)                                               00457**6
ACHRGCD  DFHMDF ATTRB=(PROT),                                          X00458   
               COLOR=BLUE,                                             X00459   
               LENGTH=03,                                              X00460   
               POS=(16,19)                                              00461**6
         DFHMDF ATTRB=(ASKIP),                                         X00449   
               LENGTH=1,                                               X00450   
               POS=(16,23)                                              00451**6
ACNTNRAP DFHMDF ATTRB=(PROT),                                          X00472   
               INITIAL='CONTAINER ID..:',                              X00473   
               COLOR=NEUTRAL,                                          X00474   
               LENGTH=15,                                              X00475   
               POS=(16,33)                                              00476**6
ACNTNR   DFHMDF ATTRB=(UNPROT),                                        X00477   
               COLOR=GREEN,                                            X00478   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=12,                                              X00479   
               POS=(16,49)                                              00480**6
         DFHMDF ATTRB=(ASKIP),                                         X00449   
               LENGTH=1,                                               X00450   
               POS=(16,62)                                              00451**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 17                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
AENTRYAP DFHMDF ATTRB=(PROT),                                          X00481   
               INITIAL='ENTRY NUMBER..:',                              X00482   
               COLOR=NEUTRAL,                                          X00483   
               LENGTH=15,                                              X00484**6
               POS=(17,33)                                                      
AENTRY   DFHMDF ATTRB=(UNPROT),                                        X00477   
               COLOR=GREEN,                                            X00478   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=16,                                              X00479   
               POS=(17,49)                                              00480**6
         DFHMDF ATTRB=(ASKIP),                                         X00449   
               LENGTH=1,                                               X00450   
               POS=(17,66)                                              00451**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 18                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
AREFNCAP DFHMDF ATTRB=(PROT),                                          X00481   
               INITIAL='REFERENCE NBR.:',                              X00482   
               COLOR=NEUTRAL,                                          X00483   
               LENGTH=15,                                              X00484**6
               POS=(18,33)                                                      
AREFNBR  DFHMDF ATTRB=(UNPROT),                                        X00477   
               COLOR=GREEN,                                            X00478   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=15,                                              X00479   
               POS=(18,49)                                              00480**6
         DFHMDF ATTRB=(ASKIP),                                         X00449   
               LENGTH=1,                                               X00450   
               POS=(18,65)                                              00451**6
         DFHMSD TYPE=FINAL                                              00489   
         END                                                            00490   
