*********************************************************************** 00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  APKM338                                            *   00005   
*        MAP     AP338A                                             *   00006   
*        PROGRAM APKCS338                                           *   00007   
*        TRANSID A338                                               *   00008   
*        SYSTEM  CICS ARCH - ACCOUNTS PAYABLE VENDOR TOLERANCE CTL  *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
        PRINT NOGEN                                                     00012   
APKM338 DFHMSD TYPE=&SYSPARM,                                          X00013**3
               LANG=COBOL,                                             X00014   
               MODE=INOUT,                                             X00015   
               STORAGE=AUTO,                                           X00016   
               TIOAPFX=YES,                                            X00017   
               TERM=3270-2                                              00018   
AP338A  DFHMDI LINE=2,COLUMN=1,                                        X00019   
               SIZE=(19,80),                                           X00020   
               CTRL=(FREEKB),                                          X00021   
               MAPATTS=(COLOR,HILIGHT),                                X00022   
               DSATTS=(COLOR,HILIGHT)                                   00023   
*********************************************************************** 00024   
        DFHMDF POS=(4,3),LENGTH=14,ATTRB=(ASKIP,BRT),                  X00025**2
               INITIAL='VENDOR NUMBER:'                                 00026   
AVNDNBR DFHMDF POS=(4,18),LENGTH=10,ATTRB=ASKIP,COLOR=BLUE              00027**4
*********************************************************************** 00028   
        DFHMDF POS=(5,3),LENGTH=14,ATTRB=(ASKIP,BRT),                  X00029**2
               INITIAL='VENDOR NAME..:'                                 00030**2
AVNDNME DFHMDF POS=(5,18),LENGTH=30,ATTRB=ASKIP,COLOR=BLUE              00031**4
*********************************************************************** 00032**2
        DFHMDF POS=(7,3),LENGTH=14,ATTRB=(ASKIP,BRT),                  X00012   
               INITIAL='STATUS.......:'                                 00013   
AVARIND DFHMDF POS=(7,18),LENGTH=01,ATTRB=UNPROT,HILIGHT=UNDERLINE      00014**3
        DFHMDF POS=(7,20),LENGTH=1,ATTRB=ASKIP                          00016**3
*********************************************************************** 00032**2
AINDSC1 DFHMDF POS=(7,22),LENGTH=50,ATTRB=ASKIP,COLOR=BLUE              00014**3
*********************************************************************** 00032**2
AINDSC2 DFHMDF POS=(8,22),LENGTH=50,ATTRB=ASKIP,COLOR=BLUE              00014**3
*********************************************************************** 00032**2
        DFHMDF POS=(10,3),LENGTH=31,ATTRB=(ASKIP,BRT),                 X0000    
               INITIAL='---- OVER/SHORT TOLERANCES ----'                00010   
*********************************************************************** 00011   
        DFHMDF POS=(11,3),LENGTH=40,ATTRB=(ASKIP,BRT),                 X00012   
               INITIAL='PCT OF DOLLAR VARIANCE WITHIN TOLERANCE:'       00013   
AVARPCT DFHMDF POS=(11,47),LENGTH=06,ATTRB=UNPROT,HILIGHT=UNDERLINE,   X00014**3
               PICOUT='ZZ9.99'                                          0015    
        DFHMDF POS=(11,54),LENGTH=1,ATTRB=ASKIP                         00016**3
*********************************************************************** 00017   
        DFHMDF POS=(12,03),LENGTH=40,ATTRB=(ASKIP,BRT),                X00018   
               INITIAL='DOLLAR LIMIT FOR MATCHED REPORTING.....:'       00019   
ADLRLIM DFHMDF POS=(12,45),LENGTH=7,ATTRB=UNPROT,HILIGHT=UNDERLINE,    X00020   
               PICOUT='ZZZ9.99'                                         00021   
        DFHMDF POS=(12,53),LENGTH=1,ATTRB=ASKIP                         00022   
*********************************************************************** 00047**2
        DFHMSD TYPE=FINAL                                               00048   
        PRINT NOGEN                                                     00049   
        END                                                             00050   
