*          DATA SET APKM326    AT LEVEL 003 AS OF 06/07/94                      
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  APKM326                                            *   00004   
*        MAP     AP326A                                             *   00005   
*        PROGRAM APKCS326                                           *   00006   
*        TRANSID A326 - ITEM SELECTION LIST                         *   00007   
*                                                                   *   00008   
*-------------------------------------------------------------------*   00009   
APKM326 DFHMSD TYPE=MAP,                                               X00010   
               MODE=INOUT,                                             X00011   
               LANG=COBOL,                                             X00012   
               TIOAPFX=YES,                                            X00013   
               CTRL=(FREEKB)                                            00014   
AP326A  DFHMDI LINE=2,COLUMN=1,                                        X00015   
               SIZE=(19,80),                                           X00016   
               MAPATTS=(COLOR,HILIGHT),                                X00017   
               DSATTS=(COLOR,HILIGHT)                                   00018   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00019   
*                                                                       00020   
*     SCREEN LINE 01                                                    00021   
*                                                                       00022   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00023   
         DFHMDF ATTRB=(PROT,BRT),                                      X00024   
               INITIAL='ITEMS',                                        X00025   
               COLOR=NEUTRAL,                                          X00026   
               LENGTH=5,                                               X00027   
               POS=(01,44)                                              00028   
****************************************                                00029   
*  VARIABLE = LIST-FIRST-ITEM      N006                                 00030   
****************************************                                00031   
ASTRTIT  DFHMDF ATTRB=(UNPROT,FSET,NUM),                               X00032   
               JUSTIFY=(LEFT,BLANK),                                   X00033   
               PICOUT='ZZZ,ZZ9',                                       X00034   
               LENGTH=7,                                               X00035   
               COLOR=GREEN,                                            X00036   
               HILIGHT=UNDERLINE,                                      X00037   
               POS=(01,50)                                              00038   
         DFHMDF ATTRB=(PROT,BRT),                                      X00039   
               INITIAL='TO',                                           X00040   
               LENGTH=2,                                               X00041   
               COLOR=NEUTRAL,                                          X00042   
               POS=(01,58)                                              00043   
****************************************                                00044   
*  VARIABLE = LIST-LAST-ITEM      N006                                  00045   
****************************************                                00046   
AENDIT   DFHMDF ATTRB=(PROT),                                          X00047   
               PICOUT='ZZZ,ZZ9',                                       X00048   
               LENGTH=7,                                               X00049   
               COLOR=BLUE,                                             X00050   
               POS=(01,61)                                              00051   
         DFHMDF ATTRB=(PROT,BRT),                                      X00052   
               INITIAL='OF',                                           X00053   
               LENGTH=2,                                               X00054   
               COLOR=NEUTRAL,                                          X00055   
               POS=(01,69)                                              00056   
****************************************                                00057   
*  VARIABLE = LIST-TOTAL-ITEMS      N006                                00058   
****************************************                                00059   
ATOTIT   DFHMDF ATTRB=(PROT),                                          X00060   
               PICOUT='ZZZ,ZZ9',                                       X00061   
               LENGTH=7,                                               X00062   
               COLOR=BLUE,                                             X00063   
               POS=(01,72)                                              00064   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00065   
*                                                                       00066   
*     SCREEN LINE 02                                                    00067   
*                                                                       00068   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00069   
         DFHMDF ATTRB=(PROT,BRT),                                      X00070   
               INITIAL='INVOICE NBR:',                                 X00071   
               LENGTH=12,                                              X00072**2
               COLOR=NEUTRAL,                                          X00073   
               POS=(02,1)                                               00074   
AINVNBR  DFHMDF ATTRB=(ASKIP,NORM),                                    X00075   
               LENGTH=22,                                              X00076   
               COLOR=BLUE,                                             X00077   
               POS=(02,14)                                              00078   
         DFHMDF ATTRB=(PROT,BRT),                                      X00079   
               INITIAL='PO NBR:',                                      X00080   
               LENGTH=7,                                               X00081   
               COLOR=NEUTRAL,                                          X00082   
               POS=(02,40)                                              00083   
APONBR   DFHMDF ATTRB=(ASKIP,NORM),                                    X00084   
               LENGTH=9,                                               X00085   
               COLOR=BLUE,                                             X00086   
               POS=(02,48)                                              00087   
         DFHMDF ATTRB=(PROT,BRT),                                      X00088   
               INITIAL='VENDOR:',                                      X00089   
               LENGTH=7,                                               X00090   
               COLOR=NEUTRAL,                                          X00091   
               POS=(02,61)                                              00092   
AVENDOR  DFHMDF ATTRB=(ASKIP,NORM),                                    X00093   
               LENGTH=10,                                              X00094   
               COLOR=BLUE,                                             X00095   
               POS=(02,69)                                              00096   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00097   
*                                                                       00098   
*     SCREEN LINE 04                                                    00099   
*                                                                       00100   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00101   
         DFHMDF ATTRB=(PROT,BRT),                                      X00102   
               INITIAL='PO',                                           X00103   
               LENGTH=2,                                               X00104   
               POS=(04,5)                                               00105   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00106   
*                                                                       00107   
*     SCREEN LINE 05                                                    00108   
*                                                                       00109   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00110   
         DFHMDF ATTRB=(PROT,BRT),                                      X00111   
               INITIAL='SEL',                                          X00112   
               LENGTH=3,                                               X00113   
               POS=(05,1)                                               00114   
         DFHMDF ATTRB=(PROT,BRT),                                      X00115   
               INITIAL='LINE',                                         X00116   
               LENGTH=4,                                               X00117   
               POS=(05,5)                                               00118   
         DFHMDF ATTRB=(PROT,BRT),                                      X00119   
               INITIAL='SKU / UPC',                                    X00120   
               LENGTH=9,                                               X00121   
               POS=(05,10)                                              00122   
         DFHMDF ATTRB=(PROT,BRT),                                      X00123   
               INITIAL='VENDOR STYLE / DESC',                          X00124   
               LENGTH=19,                                              X00125   
               POS=(05,28)                                              00126   
         DFHMDF ATTRB=(PROT,BRT),                                      X00127   
               INITIAL='COLOR',                                        X00128   
               LENGTH=5,                                               X00129   
               POS=(05,54)                                              00130   
         DFHMDF ATTRB=(PROT,BRT),                                      X00131   
               INITIAL='SIZE',                                         X00132   
               LENGTH=4,                                               X00133   
               POS=(05,65)                                              00134   
         DFHMDF ATTRB=(PROT,BRT),                                      X00135   
               INITIAL='RCVD QTY',                                     X00136   
               LENGTH=8,                                               X00137   
               POS=(05,71)                                              00138   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00139   
*                                                                       00140   
*     SCREEN LINE 06                                                    00141   
*                                                                       00142   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00143   
ASEL01   DFHMDF ATTRB=(UNPROT,FSET),                                   X00144   
               LENGTH=1,                                               X00145   
               COLOR=GREEN,                                            X00146   
               HILIGHT=UNDERLINE,                                      X00147   
               POS=(06,3)                                               00148**3
APOLN01  DFHMDF ATTRB=(PROT,BRT),                                      X00149   
               LENGTH=4,                                               X00150   
               COLOR=BLUE,                                             X00151   
               POS=(06,5)                                               00152   
ASKU01   DFHMDF ATTRB=(PROT,BRT),                                      X00153   
               LENGTH=8,                                               X00154   
               COLOR=BLUE,                                             X00155   
               POS=(06,10)                                              00156   
ASTYL01  DFHMDF ATTRB=(PROT,BRT),                                      X00165   
               LENGTH=20,                                              X00166   
               COLOR=BLUE,                                             X00167   
               POS=(06,28)                                              00168   
ACOLC01  DFHMDF ATTRB=(PROT,BRT),                                      X00169   
               LENGTH=3,                                               X00170   
               COLOR=BLUE,                                             X00171   
               POS=(06,54)                                              00172   
ASIZC01  DFHMDF ATTRB=(PROT,BRT),                                      X00173   
               LENGTH=5,                                               X00174   
               COLOR=BLUE,                                             X00175   
               POS=(06,65)                                              00176   
ARQTY01  DFHMDF ATTRB=(PROT,BRT),                                      X00177   
               LENGTH=7,                                               X00178   
               COLOR=BLUE,                                             X00179   
               POS=(06,72)                                              00180   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00181   
*                                                                       00182   
*     SCREEN LINE 07                                                    00183   
*                                                                       00184   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00185   
AUPC01   DFHMDF ATTRB=(PROT,BRT),                                      X00186   
               LENGTH=16,                                              X00187   
               COLOR=BLUE,                                             X00188   
               POS=(07,10)                                              00189   
AVDSC01  DFHMDF ATTRB=(PROT,BRT),                                      X00190   
               LENGTH=24,                                              X00191   
               COLOR=BLUE,                                             X00192   
               POS=(07,28)                                              00193   
ACOLR01  DFHMDF ATTRB=(PROT,BRT),                                      X00194   
               LENGTH=10,                                              X00195   
               COLOR=BLUE,                                             X00196   
               POS=(07,54)                                              00197   
ASIZE01  DFHMDF ATTRB=(PROT,BRT),                                      X00198   
               LENGTH=10,                                              X00199   
               COLOR=BLUE,                                             X00200   
               POS=(07,65)                                              00201   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00202**3
*                                                                       00203**3
*     SCREEN LINE 08                                                    00204**3
*                                                                       00205**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00206**3
ASEL02   DFHMDF ATTRB=(UNPROT,FSET),                                   X00207**3
               LENGTH=1,                                               X00208**3
               COLOR=GREEN,                                            X00209**3
               HILIGHT=UNDERLINE,                                      X00210**3
               POS=(08,3)                                               00211**3
APOLN02  DFHMDF ATTRB=(PROT,BRT),                                      X00212**3
               LENGTH=4,                                               X00213**3
               COLOR=BLUE,                                             X00214**3
               POS=(08,5)                                               00215**3
ASKU02   DFHMDF ATTRB=(PROT,BRT),                                      X00216**3
               LENGTH=8,                                               X00217**3
               COLOR=BLUE,                                             X00218**3
               POS=(08,10)                                              00219**3
ASTYL02  DFHMDF ATTRB=(PROT,BRT),                                      X00228**3
               LENGTH=20,                                              X00229**3
               COLOR=BLUE,                                             X00230**3
               POS=(08,28)                                              00231**3
ACOLC02  DFHMDF ATTRB=(PROT,BRT),                                      X00232**3
               LENGTH=3,                                               X00233**3
               COLOR=BLUE,                                             X00234**3
               POS=(08,54)                                              00235**3
ASIZC02  DFHMDF ATTRB=(PROT,BRT),                                      X00236**3
               LENGTH=5,                                               X00237**3
               COLOR=BLUE,                                             X00238**3
               POS=(08,65)                                              00239**3
ARQTY02  DFHMDF ATTRB=(PROT,BRT),                                      X00240**3
               LENGTH=7,                                               X00241**3
               COLOR=BLUE,                                             X00242**3
               POS=(08,72)                                              00243**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00244**3
*                                                                       00245**3
*     SCREEN LINE 09                                                    00246**3
*                                                                       00247**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00248**3
AUPC02   DFHMDF ATTRB=(PROT,BRT),                                      X00249**3
               LENGTH=16,                                              X00250**3
               COLOR=BLUE,                                             X00251**3
               POS=(09,10)                                              00252**3
AVDSC02  DFHMDF ATTRB=(PROT,BRT),                                      X00253**3
               LENGTH=24,                                              X00254**3
               COLOR=BLUE,                                             X00255**3
               POS=(09,28)                                              00256**3
ACOLR02  DFHMDF ATTRB=(PROT,BRT),                                      X00257**3
               LENGTH=10,                                              X00258**3
               COLOR=BLUE,                                             X00259**3
               POS=(09,54)                                              00260**3
ASIZE02  DFHMDF ATTRB=(PROT,BRT),                                      X00261**3
               LENGTH=10,                                              X00262**3
               COLOR=BLUE,                                             X00263**3
               POS=(09,65)                                              00264**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00265**3
*                                                                       00266**3
*     SCREEN LINE 10                                                    00267**3
*                                                                       00268**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00269**3
ASEL03   DFHMDF ATTRB=(UNPROT,FSET),                                   X00270**3
               LENGTH=1,                                               X00271**3
               COLOR=GREEN,                                            X00272**3
               HILIGHT=UNDERLINE,                                      X00273**3
               POS=(10,3)                                               00274**3
APOLN03  DFHMDF ATTRB=(PROT,BRT),                                      X00275**3
               LENGTH=4,                                               X00276**3
               COLOR=BLUE,                                             X00277**3
               POS=(10,5)                                               00278**3
ASKU03   DFHMDF ATTRB=(PROT,BRT),                                      X00279**3
               LENGTH=8,                                               X00280**3
               COLOR=BLUE,                                             X00281**3
               POS=(10,10)                                              00282**3
ASTYL03  DFHMDF ATTRB=(PROT,BRT),                                      X00291**3
               LENGTH=20,                                              X00292**3
               COLOR=BLUE,                                             X00293**3
               POS=(10,28)                                              00294**3
ACOLC03  DFHMDF ATTRB=(PROT,BRT),                                      X00295**3
               LENGTH=3,                                               X00296**3
               COLOR=BLUE,                                             X00297**3
               POS=(10,54)                                              00298**3
ASIZC03  DFHMDF ATTRB=(PROT,BRT),                                      X00299**3
               LENGTH=5,                                               X00300**3
               COLOR=BLUE,                                             X00301**3
               POS=(10,65)                                              00302**3
ARQTY03  DFHMDF ATTRB=(PROT,BRT),                                      X00303**3
               LENGTH=7,                                               X00304**3
               COLOR=BLUE,                                             X00305**3
               POS=(10,72)                                              00306**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00307**3
*                                                                       00308**3
*     SCREEN LINE 11                                                    00309**3
*                                                                       00310**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00311**3
AUPC03   DFHMDF ATTRB=(PROT,BRT),                                      X00312**3
               LENGTH=16,                                              X00313**3
               COLOR=BLUE,                                             X00314**3
               POS=(11,10)                                              00315**3
AVDSC03  DFHMDF ATTRB=(PROT,BRT),                                      X00316**3
               LENGTH=24,                                              X00317**3
               COLOR=BLUE,                                             X00318**3
               POS=(11,28)                                              00319**3
ACOLR03  DFHMDF ATTRB=(PROT,BRT),                                      X00320**3
               LENGTH=10,                                              X00321**3
               COLOR=BLUE,                                             X00322**3
               POS=(11,54)                                              00323**3
ASIZE03  DFHMDF ATTRB=(PROT,BRT),                                      X00324**3
               LENGTH=10,                                              X00325**3
               COLOR=BLUE,                                             X00326**3
               POS=(11,65)                                              00327**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00328**3
*                                                                       00329**3
*     SCREEN LINE 12                                                    00330**3
*                                                                       00331**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00332**3
ASEL04   DFHMDF ATTRB=(UNPROT,FSET),                                   X00333**3
               LENGTH=1,                                               X00334**3
               COLOR=GREEN,                                            X00335**3
               HILIGHT=UNDERLINE,                                      X00336**3
               POS=(12,3)                                               00337**3
APOLN04  DFHMDF ATTRB=(PROT,BRT),                                      X00338**3
               LENGTH=4,                                               X00339**3
               COLOR=BLUE,                                             X00340**3
               POS=(12,5)                                               00341**3
ASKU04   DFHMDF ATTRB=(PROT,BRT),                                      X00342**3
               LENGTH=8,                                               X00343**3
               COLOR=BLUE,                                             X00344**3
               POS=(12,10)                                              00345**3
ASTYL04  DFHMDF ATTRB=(PROT,BRT),                                      X00354**3
               LENGTH=20,                                              X00355**3
               COLOR=BLUE,                                             X00356**3
               POS=(12,28)                                              00357**3
ACOLC04  DFHMDF ATTRB=(PROT,BRT),                                      X00358**3
               LENGTH=3,                                               X00359**3
               COLOR=BLUE,                                             X00360**3
               POS=(12,54)                                              00361**3
ASIZC04  DFHMDF ATTRB=(PROT,BRT),                                      X00362**3
               LENGTH=5,                                               X00363**3
               COLOR=BLUE,                                             X00364**3
               POS=(12,65)                                              00365**3
ARQTY04  DFHMDF ATTRB=(PROT,BRT),                                      X00366**3
               LENGTH=7,                                               X00367**3
               COLOR=BLUE,                                             X00368**3
               POS=(12,72)                                              00369**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00370**3
*                                                                       00371**3
*     SCREEN LINE 13                                                    00372**3
*                                                                       00373**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00374**3
AUPC04   DFHMDF ATTRB=(PROT,BRT),                                      X00375**3
               LENGTH=16,                                              X00376**3
               COLOR=BLUE,                                             X00377**3
               POS=(13,10)                                              00378**3
AVDSC04  DFHMDF ATTRB=(PROT,BRT),                                      X00379**3
               LENGTH=24,                                              X00380**3
               COLOR=BLUE,                                             X00381**3
               POS=(13,28)                                              00382**3
ACOLR04  DFHMDF ATTRB=(PROT,BRT),                                      X00383**3
               LENGTH=10,                                              X00384**3
               COLOR=BLUE,                                             X00385**3
               POS=(13,54)                                              00386**3
ASIZE04  DFHMDF ATTRB=(PROT,BRT),                                      X00387**3
               LENGTH=10,                                              X00388**3
               COLOR=BLUE,                                             X00389**3
               POS=(13,65)                                              00390**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00391**3
*                                                                       00392**3
*     SCREEN LINE 14                                                    00393**3
*                                                                       00394**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00395**3
ASEL05   DFHMDF ATTRB=(UNPROT,FSET),                                   X00396**3
               LENGTH=1,                                               X00397**3
               COLOR=GREEN,                                            X00398**3
               HILIGHT=UNDERLINE,                                      X00399**3
               POS=(14,3)                                               00400**3
APOLN05  DFHMDF ATTRB=(PROT,BRT),                                      X00401**3
               LENGTH=4,                                               X00402**3
               COLOR=BLUE,                                             X00403**3
               POS=(14,5)                                               00404**3
ASKU05   DFHMDF ATTRB=(PROT,BRT),                                      X00405**3
               LENGTH=8,                                               X00406**3
               COLOR=BLUE,                                             X00407**3
               POS=(14,10)                                              00408**3
ASTYL05  DFHMDF ATTRB=(PROT,BRT),                                      X00417**3
               LENGTH=20,                                              X00418**3
               COLOR=BLUE,                                             X00419**3
               POS=(14,28)                                              00420**3
ACOLC05  DFHMDF ATTRB=(PROT,BRT),                                      X00421**3
               LENGTH=3,                                               X00422**3
               COLOR=BLUE,                                             X00423**3
               POS=(14,54)                                              00424**3
ASIZC05  DFHMDF ATTRB=(PROT,BRT),                                      X00425**3
               LENGTH=5,                                               X00426**3
               COLOR=BLUE,                                             X00427**3
               POS=(14,65)                                              00428**3
ARQTY05  DFHMDF ATTRB=(PROT,BRT),                                      X00429**3
               LENGTH=7,                                               X00430**3
               COLOR=BLUE,                                             X00431**3
               POS=(14,72)                                              00432**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00433**3
*                                                                       00434**3
*     SCREEN LINE 15                                                    00435**3
*                                                                       00436**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00437**3
AUPC05   DFHMDF ATTRB=(PROT,BRT),                                      X00438**3
               LENGTH=16,                                              X00439**3
               COLOR=BLUE,                                             X00440**3
               POS=(15,10)                                              00441**3
AVDSC05  DFHMDF ATTRB=(PROT,BRT),                                      X00442**3
               LENGTH=24,                                              X00443**3
               COLOR=BLUE,                                             X00444**3
               POS=(15,28)                                              00445**3
ACOLR05  DFHMDF ATTRB=(PROT,BRT),                                      X00446**3
               LENGTH=10,                                              X00447**3
               COLOR=BLUE,                                             X00448**3
               POS=(15,54)                                              00449**3
ASIZE05  DFHMDF ATTRB=(PROT,BRT),                                      X00450**3
               LENGTH=10,                                              X00451**3
               COLOR=BLUE,                                             X00452**3
               POS=(15,65)                                              00453**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00454**3
*                                                                       00455**3
*     SCREEN LINE 16                                                    00456**3
*                                                                       00457**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00458**3
ASEL06   DFHMDF ATTRB=(UNPROT,FSET),                                   X00459**3
               LENGTH=1,                                               X00460**3
               COLOR=GREEN,                                            X00461**3
               HILIGHT=UNDERLINE,                                      X00462**3
               POS=(16,3)                                               00463**3
APOLN06  DFHMDF ATTRB=(PROT,BRT),                                      X00464**3
               LENGTH=4,                                               X00465**3
               COLOR=BLUE,                                             X00466**3
               POS=(16,5)                                               00467**3
ASKU06   DFHMDF ATTRB=(PROT,BRT),                                      X00468**3
               LENGTH=8,                                               X00469**3
               COLOR=BLUE,                                             X00470**3
               POS=(16,10)                                              00471**3
ASTYL06  DFHMDF ATTRB=(PROT,BRT),                                      X00480**3
               LENGTH=20,                                              X00481**3
               COLOR=BLUE,                                             X00482**3
               POS=(16,28)                                              00483**3
ACOLC06  DFHMDF ATTRB=(PROT,BRT),                                      X00484**3
               LENGTH=3,                                               X00485**3
               COLOR=BLUE,                                             X00486**3
               POS=(16,54)                                              00487**3
ASIZC06  DFHMDF ATTRB=(PROT,BRT),                                      X00488**3
               LENGTH=5,                                               X00489**3
               COLOR=BLUE,                                             X00490**3
               POS=(16,65)                                              00491**3
ARQTY06  DFHMDF ATTRB=(PROT,BRT),                                      X00492**3
               LENGTH=7,                                               X00493**3
               COLOR=BLUE,                                             X00494**3
               POS=(16,72)                                              00495**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00496**3
*                                                                       00497**3
*     SCREEN LINE 17                                                    00498**3
*                                                                       00499**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                               00500**3
AUPC06   DFHMDF ATTRB=(PROT,BRT),                                      X00501**3
               LENGTH=16,                                              X00502**3
               COLOR=BLUE,                                             X00503**3
               POS=(17,10)                                              00504**3
AVDSC06  DFHMDF ATTRB=(PROT,BRT),                                      X00505**3
               LENGTH=24,                                              X00506**3
               COLOR=BLUE,                                             X00507**3
               POS=(17,28)                                              00508**3
ACOLR06  DFHMDF ATTRB=(PROT,BRT),                                      X00509**3
               LENGTH=10,                                              X00510**3
               COLOR=BLUE,                                             X00511**3
               POS=(17,54)                                              00512**3
ASIZE06  DFHMDF ATTRB=(PROT,BRT),                                      X00513**3
               LENGTH=10,                                              X00514**3
               COLOR=BLUE,                                             X00515**3
               POS=(17,65)                                              00516**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00517   
*                                                                       00518   
*  SCREEN LINE 19                                                       00519   
*                                                                       00520   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00521   
         DFHMDF ATTRB=(PROT,BRT),                                      X00522   
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00523   
               LENGTH=25,                                              X00524   
               COLOR=NEUTRAL,                                          X00525   
               POS=(19,45)                                              00526   
****************************************                                00527   
*  VARIABLE = LIST-SELECTED-ITEMS      N006                             00528   
****************************************                                00529   
ASELIT   DFHMDF ATTRB=(PROT),                                          X00530   
               PICOUT='ZZZ,ZZ9',                                       X00531   
               LENGTH=7,                                               X00532   
               COLOR=BLUE,                                             X00533   
               POS=(19,72)                                              00534   
         DFHMSD TYPE=FINAL                                              00535   
         END                                                            00536   
