  PRINT  NOGEN                                                          00004   
*-------------------------------------------------------------------*   00005   
*                                                                   *   00006   
*        MAPSET  APKM364                                            *   00007   
*        MAP     AP364A                                             *   00008   
*        PROGRAM APKCS364                                           *   00009   
*        TRANSID A364                                               *   00010   
*        SYSTEM  CICS ARCH - ADJUSTMENT JOURNAL INSERT              *   00011   
*  ANY NEW FIELDS ADDED TO THIS MAP MUST BE REFERRED TO IN PGM      *           
*                                                                   *   00012   
*-------------------------------------------------------------------*   00013   
APKM364 DFHMSD TYPE=DSECT,                                             X00014   
               LANG=COBOL,                                             X00015   
               MODE=INOUT,                                             X00016   
               STORAGE=AUTO,                                           X00017   
               TIOAPFX=YES,                                            X00018   
               TERM=3270-2                                              00019   
AP364A  DFHMDI LINE=2,COLUMN=1,                                        X00020   
               SIZE=(19,80),                                           X00021   
               CTRL=(FREEKB),                                          X00022   
               MAPATTS=(COLOR,HILIGHT),                                X00023   
               DSATTS=(COLOR,HILIGHT)                                   00024   
*********************************************************************   00039   
         DFHMDF ATTRB=(PROT),                                          X00040   
               INITIAL='TRANS CD.....:',                               X00041   
               COLOR=NEUTRAL,                                          X00042   
               LENGTH=14,                                              X00043   
               POS=(01,02)                                              00044   
ATRANCD  DFHMDF ATTRB=(UNPROT),                                        X00045   
               COLOR=GREEN,                                            X00046   
               HILIGHT=UNDERLINE,                                      X00047   
               LENGTH=02,                                              X00048   
               POS=(01,17)                                              00049   
         DFHMDF ATTRB=(ASKIP),                                         X00050   
               LENGTH=1,                                               X00051   
               POS=(01,20)                                              00052   
         DFHMDF ATTRB=(PROT),                                          X00053   
               INITIAL='DOC NO.......:',                               X00054   
               COLOR=NEUTRAL,                                          X00055   
               LENGTH=14,                                              X00056   
               POS=(02,02)                                              00057   
ADOCNUM  DFHMDF ATTRB=(UNPROT),                                        X00058   
               COLOR=GREEN,                                            X00059   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=16,                                              X00060   
               POS=(02,17)                                              00061   
         DFHMDF ATTRB=(ASKIP),                                         X00050   
               LENGTH=1,                                               X00051   
               POS=(02,34)                                              00052   
*********************************************************************   00062   
         DFHMDF ATTRB=(PROT),                                          X00053   
               INITIAL='VENDOR.....:',                                 X00054   
               COLOR=NEUTRAL,                                          X00055   
               LENGTH=12,                                              X00056   
               POS=(02,44)                                              00057   
AVENDNO  DFHMDF ATTRB=(UNPROT),                                        X00058   
               COLOR=GREEN,                                            X00059   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=10,                                              X00060   
               POS=(02,57)                                              00061   
         DFHMDF ATTRB=(ASKIP),                                         X00050   
               LENGTH=1,                                               X00051   
               POS=(02,68)                                              00052   
         DFHMDF ATTRB=(PROT),                                          X00026   
               INITIAL='P/O NUMBER...:',                               X00027   
               COLOR=NEUTRAL,                                          X00028   
               LENGTH=14,                                              X00029   
               POS=(03,02)                                              00030   
APONUM   DFHMDF ATTRB=(UNPROT),                                        X00031   
               COLOR=GREEN,                                            X00032   
               HILIGHT=UNDERLINE,                                      X00033   
               LENGTH=9,                                               X00034   
               POS=(03,17)                                              00035   
         DFHMDF ATTRB=(ASKIP),                                         X00036   
               LENGTH=1,                                               X00037   
               POS=(03,27)                                              00038   
AVENDNM  DFHMDF ATTRB=(ASKIP),                                         X00068   
               COLOR=BLUE,                                             X00069   
               HILIGHT=OFF,                                            X00070   
               LENGTH=25,                                              X00071   
               POS=(03,44)                                              00072   
         DFHMDF ATTRB=(PROT),                                          X00076   
               INITIAL='WI/BARCODE...:',                               X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=14,                                              X00079   
               POS=(04,02)                                              00080   
ABARCD   DFHMDF ATTRB=(UNPROT),                                        X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               LENGTH=9,                                               X00084   
               POS=(04,17)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               LENGTH=1,                                               X00087   
               POS=(04,27)                                              00088   
*********************************************************************   00229   
         DFHMDF ATTRB=(PROT),                                          X00224   
               INITIAL='+ OFFSET ---------------------------+',        X00225   
               COLOR=NEUTRAL,                                          X00226   
               LENGTH=37,                                              X00227   
               POS=(04,42)                                              00228   
*********************************************************************   00089   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='STORE........:',                               X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=14,                                              X00093   
               POS=(05,02)                                              00094   
ASTRNM   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=4,                                               X00098   
               POS=(05,17)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(05,22)                                              00112   
*********************************************************************   00306   
         DFHMDF ATTRB=(PROT),                                          X00243   
               INITIAL='| TRANS CD..:',                                X00244   
               COLOR=NEUTRAL,                                          X00245   
               LENGTH=13,                                              X00246   
               POS=(05,42)                                              00247   
AOFFTRN  DFHMDF ATTRB=(ASKIP),                                         X00045   
               COLOR=BLUE,                                             X00046   
               HILIGHT=OFF,                                            X00047   
               LENGTH=02,                                              X00048   
               POS=(05,56)                                              00112   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(05,59)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00301   
               INITIAL='BYPASS(Y/N):',                                 X00302   
               COLOR=NEUTRAL,                                          X00303   
               LENGTH=12,                                              X00304   
               POS=(05,61)                                              00305   
AOFFBYP  DFHMDF ATTRB=(UNPROT),                                        X00045   
               COLOR=GREEN,                                            X00046   
               HILIGHT=UNDERLINE,                                      X00047   
               LENGTH=01,                                              X00048   
               POS=(05,74)                                              00112   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(05,76)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00301   
               INITIAL='|',                                            X00302   
               COLOR=NEUTRAL,                                          X00303   
               LENGTH=01,                                              X00304   
               POS=(05,78)                                              00305   
*********************************************************************   00306   
         DFHMDF ATTRB=(PROT),                                          X00113   
               INITIAL='DOC DATE.....:',                               X00114   
               COLOR=NEUTRAL,                                          X00115   
               LENGTH=14,                                              X00116   
               POS=(06,02)                                              00117   
ADOCMM   DFHMDF ATTRB=(UNPROT),                                        X00118   
               COLOR=GREEN,                                            X00119   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=2,                                               X00120   
               POS=(06,17)                                              00121   
ADOCDD   DFHMDF ATTRB=(UNPROT),                                        X00118   
               COLOR=GREEN,                                            X00119   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=2,                                               X00120   
               POS=(06,20)                                              00121   
ADOCYY   DFHMDF ATTRB=(UNPROT),                                        X00118   
               COLOR=GREEN,                                            X00119   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=2,                                               X00120   
               POS=(06,23)                                              00121   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(06,26)                                              00112   
*********************************************************************   00306   
         DFHMDF ATTRB=(PROT),                                          X00243   
               INITIAL='| ACCOUNT NO:',                                X00244   
               COLOR=NEUTRAL,                                          X00245   
               LENGTH=13,                                              X00246   
               POS=(06,42)                                              00247   
AOFFACT  DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=6,                                               X00098   
               POS=(06,56)                                              00112   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(06,63)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00301   
               INITIAL='             |',                               X00302   
               COLOR=NEUTRAL,                                          X00303   
               LENGTH=14,                                              X00304   
               POS=(06,65)                                              00305   
*********************************************************************   00306   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='DEPT.........:',                               X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=14,                                              X00093   
               POS=(07,02)                                              00094   
ADEPT    DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=3,                                               X00098   
               POS=(07,17)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(07,21)                                              00112   
*********************************************************************   00229   
         DFHMDF ATTRB=(PROT),                                          X00390   
               INITIAL='+-----------------------------------+',        X00225   
               COLOR=NEUTRAL,                                          X00391   
               LENGTH=37,                                              X00392   
               POS=(07,42)                                              00393   
*********************************************************************   00229   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='ACCOUNT NO...:',                               X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=14,                                              X00093   
               POS=(08,02)                                              00094   
AACCNO   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=6,                                               X00098   
               POS=(08,17)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(08,24)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='VENDOR AUTH:',                                 X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=12,                                              X00093   
               POS=(08,44)                                              00094   
AVENDA   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=10,                                              X00098   
               POS=(08,57)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(08,68)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='GROSS COST...:',                               X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=14,                                              X00093   
               POS=(09,02)                                              00094   
AGRCST   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=13,                                              X00098   
               POS=(09,17)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(09,31)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='RETAIL.....:',                                 X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=12,                                              X00093   
               POS=(09,44)                                              00094   
ARETCST  DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=13,                                              X00098   
               POS=(09,57)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(09,71)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='FREIGHT AMT..:',                               X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=14,                                              X00093   
               POS=(10,02)                                              00094   
AFRAMT   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=13,                                              X00098   
               POS=(10,17)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(10,31)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='MISC CHG...:',                                 X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=12,                                              X00093   
               POS=(10,44)                                              00094   
AMISC    DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=13,                                              X00098   
               POS=(10,57)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(10,71)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='DISC PCT.....:',                               X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=14,                                              X00093   
               POS=(11,02)                                              00094   
ADISCPC  DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=6,                                               X00098   
               POS=(11,17)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(11,24)                                              00112   
ADISCAM  DFHMDF ATTRB=(ASKIP),                                         X00068   
               COLOR=BLUE,                                             X00069   
               HILIGHT=OFF,                                            X00070   
               LENGTH=9,                                               X00071   
               POS=(11,31)                                              00072   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='MOS PCT....:',                                 X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=12,                                              X00093   
               POS=(11,44)                                              00094   
AMOSPC   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=6,                                               X00098   
               POS=(11,57)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(11,64)                                              00112   
AMOSAM   DFHMDF ATTRB=(ASKIP),                                         X00068   
               COLOR=BLUE,                                             X00069   
               HILIGHT=OFF,                                            X00070   
               LENGTH=9,                                               X00071   
               POS=(11,66)                                              00072   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='NEW STORE PCT:',                               X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=14,                                              X00093   
               POS=(12,02)                                              00094   
ANSTRPC  DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=6,                                               X00098   
               POS=(12,17)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(12,24)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='AMT:',                                         X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=4,                                               X00093   
               POS=(12,26)                                              00094   
ANSTRAM  DFHMDF ATTRB=(UNPROT),                                        X00068   
               COLOR=GREEN,                                            X00069   
               HILIGHT=UNDERLINE,                                      X00070   
               LENGTH=9,                                               X00071   
               POS=(12,31)                                              00072   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(12,41)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='HOLD STATUS:',                                 X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=12,                                              X00093   
               POS=(12,44)                                              00094   
AHOLD    DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=1,                                               X00098   
               POS=(12,57)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(12,59)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='TRADE PCT....:',                               X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=14,                                              X00093   
               POS=(13,02)                                              00094   
ATRADPC  DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=6,                                               X00098   
               POS=(13,17)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(13,24)                                              00112   
ATRADAM  DFHMDF ATTRB=(ASKIP),                                         X00068   
               COLOR=BLUE,                                             X00069   
               HILIGHT=OFF,                                            X00070   
               LENGTH=9,                                               X00071   
               POS=(13,31)                                              00072   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(13,41)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='NET COST.....:',                               X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=14,                                              X00093   
               POS=(14,02)                                              00094   
ANETCST  DFHMDF ATTRB=(ASKIP),                                         X00095   
               COLOR=BLUE,                                             X00096   
               HILIGHT=OFF,                                            X00097   
               LENGTH=13,                                              X00098   
               POS=(14,17)                                              00099   
*********************************************************************   00229   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='DUE DATE.....:',                               X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=14,                                              X00093   
               POS=(15,02)                                              00094   
ADUEMM   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=2,                                               X00098   
               POS=(15,17)                                              00099   
ADUEDD   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=2,                                               X00098   
               POS=(15,20)                                              00099   
ADUEYY   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=2,                                               X00098   
               POS=(15,23)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00096   
               LENGTH=1,                                               X00097   
               POS=(15,26)                                              00098   
LABEL    DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='APPL MTH...:',                                 X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=12,                                              X00093   
               POS=(15,51)                                              00094   
AAPLMTH  DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=1,                                               X00098   
               POS=(15,64)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(15,66)                                              00112   
*********************************************************************   00229   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='REASON 1.....:',                               X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=14,                                              X00093   
               POS=(16,02)                                              00094   
AREAS1   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=50,                                              X00098   
               POS=(16,17)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(16,68)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='REASON 2.....:',                               X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=14,                                              X00093   
               POS=(17,02)                                              00094   
AREAS2   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=50,                                              X00098   
               POS=(17,17)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00110   
               LENGTH=1,                                               X00111   
               POS=(17,68)                                              00112   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='STORE',                                        X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=5,                                               X00093   
               POS=(18,02)                                              00094   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='CLS',                                          X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=3,                                               X00093   
               POS=(18,09)                                              00094   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='SKU',                                          X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=3,                                               X00093   
               POS=(18,16)                                              00094   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='COST',                                         X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=4,                                               X00093   
               POS=(18,30)                                              00094   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='RETAIL',                                       X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=6,                                               X00093   
               POS=(18,44)                                              00094   
         DFHMDF ATTRB=(PROT),                                          X00090   
               INITIAL='NET',                                          X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=3,                                               X00093   
               POS=(18,58)                                              00094   
ASTR01   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=4,                                               X00098   
               POS=(19,02)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00050   
               LENGTH=1,                                               X00051   
               POS=(19,07)                                              00052   
ACLS01   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=2,                                               X00098   
               POS=(19,09)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00050   
               LENGTH=1,                                               X00051   
               POS=(19,12)                                              00052   
ASKU01   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=8,                                               X00098   
               POS=(19,14)                                              00099   
         DFHMDF ATTRB=(ASKIP),                                         X00050   
               LENGTH=1,                                               X00051   
               POS=(19,23)                                              00052   
ACST01   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=13,                                              X00098   
               POS=(19,25)                                              00099   
ARET01   DFHMDF ATTRB=(UNPROT),                                        X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               LENGTH=13,                                              X00098   
               POS=(19,39)                                              00099   
ANET01   DFHMDF ATTRB=(ASKIP),                                         X00095   
               COLOR=BLUE,                                             X00096   
               HILIGHT=OFF,                                            X00097   
               LENGTH=13,                                              X00098   
               POS=(19,53)                                              00099   
         DFHMDF POS=(19,67),                                           X        
               LENGTH=1,                                               X        
               ATTRB=(PROT,DRK)                                                 
         DFHMSD TYPE=FINAL                                              00489   
         END                                                            00490   
