*          DATA SET APKM334    AT LEVEL 004 AS OF 03/10/95                      
*          DATA SET APKM334    AT LEVEL 031 AS OF 08/30/94              00001   
*          DATA SET APKM334A1  AT LEVEL 014 AS OF 06/07/94              00002   
*          DATA SET APKM334    AT LEVEL 012 AS OF 05/16/94              00003   
*********************************************************************** 00004   
        PRINT NOGEN                                                     00005   
APKM334 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES               00006   
AP334A  DFHMDI SIZE=(19,80),CTRL=(FREEKB,FRSET),LINE=2,COLUMN=1,       X00007   
               MAPATTS=(COLOR,HILIGHT),DSATTS=(COLOR,HILIGHT)           00008   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 02                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00010   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00011   
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00012   
               COLOR=GREEN,                                            X00013   
               HILIGHT=UNDERLINE,                                      X00014   
               PICOUT='ZZZZ9'                                           00015   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00016   
               COLOR=NEUTRAL,                                          X00017   
               INITIAL='TO'                                             00018   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00019   
               COLOR=BLUE,                                             X00020   
               PICOUT='ZZZZ9'                                           00021   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00022   
               COLOR=NEUTRAL,                                          X00023   
               INITIAL='OF'                                             00024   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=BLUE,                                             X00026   
               PICOUT='ZZZZ9'                                           00027   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 04                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
        DFHMDF POS=(4,1),LENGTH=07,ATTRB=(ASKIP,BRT),                  X00029**2
               INITIAL='PO NBR:'                                        00030   
APONBR  DFHMDF POS=(4,09),LENGTH=09,ATTRB=ASKIP,COLOR=BLUE,            X00031**2
               PICOUT='ZZZZZZZZ9'                                       00032   
        DFHMDF POS=(4,45),LENGTH=21,ATTRB=(ASKIP,BRT),                 X00034**3
               INITIAL='UNMATCHED TOTAL COST:'                          00035**3
AUNMTOT DFHMDF POS=(4,67),LENGTH=13,ATTRB=(ASKIP,NORM),                X00036**3
               COLOR=BLUE,PICOUT='ZZZZZZZZZ9.99'                        00037**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 05                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
        DFHMDF POS=(5,1),LENGTH=07,ATTRB=(ASKIP,BRT),                  X00039**3
               INITIAL='VENDOR:'                                        00040**3
AVENDR  DFHMDF POS=(5,09),LENGTH=20,ATTRB=ASKIP,COLOR=BLUE              00041**3
        DFHMDF POS=(5,47),LENGTH=19,ATTRB=(ASKIP,BRT),                 X00043**3
               INITIAL='MATCHED TOTAL COST:'                            00044**3
AMATTOT DFHMDF POS=(5,67),LENGTH=13,ATTRB=(ASKIP,NORM),                X00045**3
               COLOR=BLUE,PICOUT='ZZZZZZZZZ9.99'                        00046**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 06                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
        DFHMDF POS=(6,03),LENGTH=05,ATTRB=(ASKIP,BRT),                 X00048**3
               INITIAL='DEPT:'                                          00049   
ADEPT   DFHMDF POS=(6,09),LENGTH=3,ATTRB=ASKIP,COLOR=BLUE               00050**3
        DFHMDF POS=(6,43),LENGTH=23,ATTRB=(ASKIP,BRT),                 X00052**3
               INITIAL='JOURNALIZED TOTAL COST:'                        00053**3
AJRNTOT DFHMDF POS=(6,67),LENGTH=13,ATTRB=(ASKIP,NORM),                X00054**3
               COLOR=BLUE,PICOUT='ZZZZZZZZZ9.99'                        00055**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 08                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
        DFHMDF POS=(08,01),LENGTH=04,ATTRB=(ASKIP,BRT),                X00057**3
               INITIAL=' STR'                                           00058**3
        DFHMDF POS=(08,06),LENGTH=04,ATTRB=(ASKIP,BRT),                X00059**3
               INITIAL='POLN'                                           00060**3
        DFHMDF POS=(08,14),LENGTH=02,ATTRB=(ASKIP,BRT),                X00061**3
               INITIAL='DC'                                             00062**3
        DFHMDF POS=(08,35),LENGTH=03,ATTRB=(ASKIP,BRT),                X00063**3
               INITIAL='QTY'                                            00064   
        DFHMDF POS=(08,39),LENGTH=09,ATTRB=(ASKIP,BRT),                X00065**3
               INITIAL='UNIT COST'                                      00066   
        DFHMDF POS=(08,52),LENGTH=09,ATTRB=(ASKIP,BRT),                X00067**3
               INITIAL='EXTD COST'                                      00068**3
        DFHMDF POS=(08,63),LENGTH=07,ATTRB=(ASKIP,BRT),                X00069**4
               INITIAL='CREATED'                                        00070**4
        DFHMDF POS=(08,73),LENGTH=06,ATTRB=(ASKIP,BRT),                X00071**3
               INITIAL='STATUS'                                         00072   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 09                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASTR01  DFHMDF POS=(09,01),LENGTH=04,ATTRB=(ASKIP,NORM),               X00074**3
               COLOR=BLUE                                               00075   
APOLN01 DFHMDF POS=(09,06),LENGTH=04,ATTRB=(ASKIP,NORM),               X00076**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00077   
ADC01   DFHMDF POS=(09,11),LENGTH=05,ATTRB=(ASKIP,NORM),               X00078**3
               COLOR=BLUE                                               00079**3
AQTY01  DFHMDF POS=(09,32),LENGTH=06,ATTRB=(ASKIP,NORM),               X00080**3
               COLOR=BLUE,PICOUT='ZZZZZ9'                               00081   
ACST01  DFHMDF POS=(09,40),LENGTH=08,ATTRB=(ASKIP,NORM),               X00082**3
               COLOR=BLUE,PICOUT='ZZZZ9.99'                             00083   
AEXC01  DFHMDF POS=(09,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00084**3
               COLOR=BLUE,PICOUT='ZZZZZZZ9.99'                          00085   
ACRDT01 DFHMDF POS=(09,63),LENGTH=08,ATTRB=(ASKIP,NORM),               X00086**4
               COLOR=BLUE                                               00087   
ASTS01  DFHMDF POS=(09,73),LENGTH=07,ATTRB=(ASKIP,NORM),               X00088**3
               COLOR=BLUE                                               00089   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 10                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASTR02  DFHMDF POS=(10,01),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091**3
               COLOR=BLUE                                               00092**3
APOLN02 DFHMDF POS=(10,06),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00094**3
ADC02   DFHMDF POS=(10,11),LENGTH=05,ATTRB=(ASKIP,NORM),               X00095**3
               COLOR=BLUE                                               00096**3
AQTY02  DFHMDF POS=(10,32),LENGTH=06,ATTRB=(ASKIP,NORM),               X00097**3
               COLOR=BLUE,PICOUT='ZZZZZ9'                               00098**3
ACST02  DFHMDF POS=(10,40),LENGTH=08,ATTRB=(ASKIP,NORM),               X00099**3
               COLOR=BLUE,PICOUT='ZZZZ9.99'                             00100**3
AEXC02  DFHMDF POS=(10,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00101**3
               COLOR=BLUE,PICOUT='ZZZZZZZ9.99'                          00102**3
ACRDT02 DFHMDF POS=(10,63),LENGTH=08,ATTRB=(ASKIP,NORM),               X00103**4
               COLOR=BLUE                                               00104**3
ASTS02  DFHMDF POS=(10,73),LENGTH=07,ATTRB=(ASKIP,NORM),               X00105**3
               COLOR=BLUE                                               00106**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 11                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASTR03  DFHMDF POS=(11,01),LENGTH=04,ATTRB=(ASKIP,NORM),               X00108**3
               COLOR=BLUE                                               00109**3
APOLN03 DFHMDF POS=(11,06),LENGTH=04,ATTRB=(ASKIP,NORM),               X00110**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00111**3
ADC03   DFHMDF POS=(11,11),LENGTH=05,ATTRB=(ASKIP,NORM),               X00112**3
               COLOR=BLUE                                               00113**3
AQTY03  DFHMDF POS=(11,32),LENGTH=06,ATTRB=(ASKIP,NORM),               X00114**3
               COLOR=BLUE,PICOUT='ZZZZZ9'                               00115**3
ACST03  DFHMDF POS=(11,40),LENGTH=08,ATTRB=(ASKIP,NORM),               X00116**3
               COLOR=BLUE,PICOUT='ZZZZ9.99'                             00117**3
AEXC03  DFHMDF POS=(11,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00118**3
               COLOR=BLUE,PICOUT='ZZZZZZZ9.99'                          00119**3
ACRDT03 DFHMDF POS=(11,63),LENGTH=08,ATTRB=(ASKIP,NORM),               X00120**4
               COLOR=BLUE                                               00121**3
ASTS03  DFHMDF POS=(11,73),LENGTH=07,ATTRB=(ASKIP,NORM),               X00122**3
               COLOR=BLUE                                               00123**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 12                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASTR04  DFHMDF POS=(12,01),LENGTH=04,ATTRB=(ASKIP,NORM),               X00125**3
               COLOR=BLUE                                               00126**3
APOLN04 DFHMDF POS=(12,06),LENGTH=04,ATTRB=(ASKIP,NORM),               X00127**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00128**3
ADC04   DFHMDF POS=(12,11),LENGTH=05,ATTRB=(ASKIP,NORM),               X00129**3
               COLOR=BLUE                                               00130**3
AQTY04  DFHMDF POS=(12,32),LENGTH=06,ATTRB=(ASKIP,NORM),               X00131**3
               COLOR=BLUE,PICOUT='ZZZZZ9'                               00132**3
ACST04  DFHMDF POS=(12,40),LENGTH=08,ATTRB=(ASKIP,NORM),               X00133**3
               COLOR=BLUE,PICOUT='ZZZZ9.99'                             00134**3
AEXC04  DFHMDF POS=(12,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00135**3
               COLOR=BLUE,PICOUT='ZZZZZZZ9.99'                          00136**3
ACRDT04 DFHMDF POS=(12,63),LENGTH=08,ATTRB=(ASKIP,NORM),               X00137**4
               COLOR=BLUE                                               00138**3
ASTS04  DFHMDF POS=(12,73),LENGTH=07,ATTRB=(ASKIP,NORM),               X00139**3
               COLOR=BLUE                                               00140**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 13                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASTR05  DFHMDF POS=(13,01),LENGTH=04,ATTRB=(ASKIP,NORM),               X00142**3
               COLOR=BLUE                                               00143**3
APOLN05 DFHMDF POS=(13,06),LENGTH=04,ATTRB=(ASKIP,NORM),               X00144**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00145**3
ADC05   DFHMDF POS=(13,11),LENGTH=05,ATTRB=(ASKIP,NORM),               X00146**3
               COLOR=BLUE                                               00147**3
AQTY05  DFHMDF POS=(13,32),LENGTH=06,ATTRB=(ASKIP,NORM),               X00148**3
               COLOR=BLUE,PICOUT='ZZZZZ9'                               00149**3
ACST05  DFHMDF POS=(13,40),LENGTH=08,ATTRB=(ASKIP,NORM),               X00150**3
               COLOR=BLUE,PICOUT='ZZZZ9.99'                             00151**3
AEXC05  DFHMDF POS=(13,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00152**3
               COLOR=BLUE,PICOUT='ZZZZZZZ9.99'                          00153**3
ACRDT05 DFHMDF POS=(13,63),LENGTH=08,ATTRB=(ASKIP,NORM),               X00154**4
               COLOR=BLUE                                               00155**3
ASTS05  DFHMDF POS=(13,73),LENGTH=07,ATTRB=(ASKIP,NORM),               X00156**3
               COLOR=BLUE                                               00157**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 14                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASTR06  DFHMDF POS=(14,01),LENGTH=04,ATTRB=(ASKIP,NORM),               X00159**3
               COLOR=BLUE                                               00160**3
APOLN06 DFHMDF POS=(14,06),LENGTH=04,ATTRB=(ASKIP,NORM),               X00161**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00162**3
ADC06   DFHMDF POS=(14,11),LENGTH=05,ATTRB=(ASKIP,NORM),               X00163**3
               COLOR=BLUE                                               00164**3
AQTY06  DFHMDF POS=(14,32),LENGTH=06,ATTRB=(ASKIP,NORM),               X00165**3
               COLOR=BLUE,PICOUT='ZZZZZ9'                               00166**3
ACST06  DFHMDF POS=(14,40),LENGTH=08,ATTRB=(ASKIP,NORM),               X00167**3
               COLOR=BLUE,PICOUT='ZZZZ9.99'                             00168**3
AEXC06  DFHMDF POS=(14,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00169**3
               COLOR=BLUE,PICOUT='ZZZZZZZ9.99'                          00170**3
ACRDT06 DFHMDF POS=(14,63),LENGTH=08,ATTRB=(ASKIP,NORM),               X00171**4
               COLOR=BLUE                                               00172**3
ASTS06  DFHMDF POS=(14,73),LENGTH=07,ATTRB=(ASKIP,NORM),               X00173**3
               COLOR=BLUE                                               00174**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 15                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASTR07  DFHMDF POS=(15,01),LENGTH=04,ATTRB=(ASKIP,NORM),               X00176**3
               COLOR=BLUE                                               00177**3
APOLN07 DFHMDF POS=(15,06),LENGTH=04,ATTRB=(ASKIP,NORM),               X00178**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00179**3
ADC07   DFHMDF POS=(15,11),LENGTH=05,ATTRB=(ASKIP,NORM),               X00180**3
               COLOR=BLUE                                               00181**3
AQTY07  DFHMDF POS=(15,32),LENGTH=06,ATTRB=(ASKIP,NORM),               X00182**3
               COLOR=BLUE,PICOUT='ZZZZZ9'                               00183**3
ACST07  DFHMDF POS=(15,40),LENGTH=08,ATTRB=(ASKIP,NORM),               X00184**3
               COLOR=BLUE,PICOUT='ZZZZ9.99'                             00185**3
AEXC07  DFHMDF POS=(15,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00186**3
               COLOR=BLUE,PICOUT='ZZZZZZZ9.99'                          00187**3
ACRDT07 DFHMDF POS=(15,63),LENGTH=08,ATTRB=(ASKIP,NORM),               X00188**4
               COLOR=BLUE                                               00189**3
ASTS07  DFHMDF POS=(15,73),LENGTH=07,ATTRB=(ASKIP,NORM),               X00190**3
               COLOR=BLUE                                               00191**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 16                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASTR08  DFHMDF POS=(16,01),LENGTH=04,ATTRB=(ASKIP,NORM),               X00193**3
               COLOR=BLUE                                               00194**3
APOLN08 DFHMDF POS=(16,06),LENGTH=04,ATTRB=(ASKIP,NORM),               X00195**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00196**3
ADC08   DFHMDF POS=(16,11),LENGTH=05,ATTRB=(ASKIP,NORM),               X00197**3
               COLOR=BLUE                                               00198**3
AQTY08  DFHMDF POS=(16,32),LENGTH=06,ATTRB=(ASKIP,NORM),               X00199**3
               COLOR=BLUE,PICOUT='ZZZZZ9'                               00200**3
ACST08  DFHMDF POS=(16,40),LENGTH=08,ATTRB=(ASKIP,NORM),               X00201**3
               COLOR=BLUE,PICOUT='ZZZZ9.99'                             00202**3
AEXC08  DFHMDF POS=(16,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00203**3
               COLOR=BLUE,PICOUT='ZZZZZZZ9.99'                          00204**3
ACRDT08 DFHMDF POS=(16,63),LENGTH=08,ATTRB=(ASKIP,NORM),               X00205**4
               COLOR=BLUE                                               00206**3
ASTS08  DFHMDF POS=(16,73),LENGTH=07,ATTRB=(ASKIP,NORM),               X00207**3
               COLOR=BLUE                                               00208**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 17                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASTR09  DFHMDF POS=(17,01),LENGTH=04,ATTRB=(ASKIP,NORM),               X00210**3
               COLOR=BLUE                                               00211**3
APOLN09 DFHMDF POS=(17,06),LENGTH=04,ATTRB=(ASKIP,NORM),               X00212**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00213**3
ADC09   DFHMDF POS=(17,11),LENGTH=05,ATTRB=(ASKIP,NORM),               X00214**3
               COLOR=BLUE                                               00215**3
AQTY09  DFHMDF POS=(17,32),LENGTH=06,ATTRB=(ASKIP,NORM),               X00216**3
               COLOR=BLUE,PICOUT='ZZZZZ9'                               00217**3
ACST09  DFHMDF POS=(17,40),LENGTH=08,ATTRB=(ASKIP,NORM),               X00218**3
               COLOR=BLUE,PICOUT='ZZZZ9.99'                             00219**3
AEXC09  DFHMDF POS=(17,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00220**3
               COLOR=BLUE,PICOUT='ZZZZZZZ9.99'                          00221**3
ACRDT09 DFHMDF POS=(17,63),LENGTH=08,ATTRB=(ASKIP,NORM),               X00222**4
               COLOR=BLUE                                               00223**3
ASTS09  DFHMDF POS=(17,73),LENGTH=07,ATTRB=(ASKIP,NORM),               X00224**3
               COLOR=BLUE                                               00225**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00021*10
* SCREEN LINE 18                                                    *   00023*10
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*   00025*10
ASTR10  DFHMDF POS=(18,01),LENGTH=04,ATTRB=(ASKIP,NORM),               X00227**3
               COLOR=BLUE                                               00228**3
APOLN10 DFHMDF POS=(18,06),LENGTH=04,ATTRB=(ASKIP,NORM),               X00229**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00230**3
ADC10   DFHMDF POS=(18,11),LENGTH=05,ATTRB=(ASKIP,NORM),               X00231**3
               COLOR=BLUE                                               00232**3
AQTY10  DFHMDF POS=(18,32),LENGTH=06,ATTRB=(ASKIP,NORM),               X00233**3
               COLOR=BLUE,PICOUT='ZZZZZ9'                               00234**3
ACST10  DFHMDF POS=(18,40),LENGTH=08,ATTRB=(ASKIP,NORM),               X00235**3
               COLOR=BLUE,PICOUT='ZZZZ9.99'                             00236**3
AEXC10  DFHMDF POS=(18,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00237**3
               COLOR=BLUE,PICOUT='ZZZZZZZ9.99'                          00238**3
ACRDT10 DFHMDF POS=(18,63),LENGTH=08,ATTRB=(ASKIP,NORM),               X00239**4
               COLOR=BLUE                                               00240**3
ASTS10  DFHMDF POS=(18,73),LENGTH=07,ATTRB=(ASKIP,NORM),               X00241**3
               COLOR=BLUE                                               00242**3
*********************************************************************** 00243**3
        DFHMSD TYPE=FINAL                                               00244   
        PRINT NOGEN                                                     00245   
        END                                                             00246   
