*  RESERVED FOR IMPORT EXPENSE INVOICE UPDATE PROGRAM                           
*     THIS WAS COPIED FROM APKM340 BY C KUNSTMANN 4/28/97               00001**3
*     THIS WILL BE USED TO SET THE STATUS TO BATCH-MATCH 'BM'           00001**3
*                                                                       00001**3
        PRINT  NOGEN                                                    00002**3
APKM340 DFHMSD TYPE=DSECT,                                             C00003**3
               LANG=COBOL,                                             C00004**3
               MODE=INOUT,                                             C00005**3
               STORAGE=AUTO,                                           C00006**3
               TERM=3270-2,                                            C00007**3
               TIOAPFX=YES                                              00008**3
**************                                                          00009**3
AP340A  DFHMDI LINE=2,COLUMN=1,                                        C00010**3
               SIZE=(19,80),                                           C00011**3
               CTRL=(FREEKB),                                          C00012**3
               MAPATTS=(COLOR,HILIGHT),                                C00013**3
               DSATTS=(COLOR,HILIGHT)                                   00014**3
**********                                                              00034**3
        DFHMDF POS=(01,04),LENGTH=07,ATTRB=(PROT,NORM),                C00035**3
               COLOR=NEUTRAL,                                          C00036**3
               INITIAL='PO NBR:'                                        00037**3
APONBR  DFHMDF POS=(01,12),LENGTH=09,ATTRB=(NUM,ASKIP,NORM),           C00018**3
               COLOR=BLUE,                                             C00019**3
               PICOUT='ZZZZZZZZ9'                                       00021**3
        DFHMDF POS=(01,25),LENGTH=09,ATTRB=(PROT,NORM),                C00038**3
               COLOR=NEUTRAL,                                          C00039**3
               INITIAL='VEND NBR:'                                      00040**3
AVNDNBR DFHMDF POS=(01,35),LENGTH=09,ATTRB=(ASKIP,NORM),               C00018**3
               COLOR=BLUE                                               00019**3
        DFHMDF POS=(01,48),LENGTH=05,ATTRB=(PROT,NORM),                C00041**3
               COLOR=NEUTRAL,                                          C00042**3
               INITIAL='NAME:'                                          00043**3
AVNDNME DFHMDF POS=(01,54),LENGTH=20,ATTRB=(ASKIP,NORM),               C00018**3
               COLOR=BLUE                                               00019**3
**********                                                                      
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00016**3
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00017**3
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00018**3
               COLOR=GREEN,                                            C00019**3
               HILIGHT=UNDERLINE,                                      C00020**3
               PICOUT='ZZZZ9' ASTRTITO                                  00021**3
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00022**3
               COLOR=NEUTRAL,                                          C00023**3
               INITIAL='TO'                                             00024**3
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00025**3
               COLOR=BLUE,                                             C00026**3
               PICOUT='ZZZZ9'                                           00027**3
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00028**3
               COLOR=NEUTRAL,                                          C00029**3
               INITIAL='OF'                                             00030**3
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00031**3
               COLOR=BLUE,                                             C00032**3
               PICOUT='ZZZZ9'                                           00033**3
**********                                                              00034**3
        DFHMDF POS=(04,03),LENGTH=14,ATTRB=(PROT,NORM),                C00038**3
               COLOR=NEUTRAL,                                          C00039**3
               INITIAL='INVOICE NUMBER'                                 00040**3
        DFHMDF POS=(04,20),LENGTH=12,ATTRB=(PROT,NORM),                C00041**3
               COLOR=NEUTRAL,                                          C00042**3
               INITIAL='INVOICE DATE'                                   00043**3
        DFHMDF POS=(04,34),LENGTH=03,ATTRB=(PROT,NORM),                C00050**3
               COLOR=NEUTRAL,                                          C00051**3
               INITIAL='STR'                                            00052**3
        DFHMDF POS=(04,40),LENGTH=02,ATTRB=(PROT,NORM),                C00056**3
               COLOR=NEUTRAL,                                          C00057**3
               INITIAL='TY'                                             00058**3
        DFHMDF POS=(04,45),LENGTH=02,ATTRB=(PROT,NORM),                C00056**3
               COLOR=NEUTRAL,                                          C00057**3
               INITIAL='EN'                                             00058**3
        DFHMDF POS=(04,50),LENGTH=02,ATTRB=(PROT,NORM),                C00035**3
               COLOR=NEUTRAL,                                          C00036**3
               INITIAL='ST'                                             00037**3
        DFHMDF POS=(04,56),LENGTH=09,ATTRB=(PROT,NORM),                C00065**3
               COLOR=NEUTRAL,                                          C00066**3
               INITIAL='GROSS AMT'                                      00067**3
        DFHMDF POS=(04,69),LENGTH=10,ATTRB=(PROT,NORM),                C00068**4
               COLOR=NEUTRAL,                                          C00069**3
               INITIAL='ENTRY DATE'                                     00070**3
**********                                                              00034**3
AINVN01 DFHMDF POS=(05,03),LENGTH=14,ATTRB=(ASKIP,NORM),               C00077**3
               COLOR=BLUE                                               00078**3
AIDTE01 DFHMDF POS=(05,21),LENGTH=10,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ASTRN01 DFHMDF POS=(05,33),LENGTH=04,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086**3
ATYPE01 DFHMDF POS=(05,40),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
AENTR01 DFHMDF POS=(05,45),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
ASTAT01 DFHMDF POS=(05,50),LENGTH=02,ATTRB=(ASKIP,NORM),               C00075**3
               COLOR=BLUE                                               00076**3
AGAMT01 DFHMDF POS=(05,54),LENGTH=12,ATTRB=(ASKIP,NORM),               C00095**3
               COLOR=BLUE                                               00096**3
AEDTE01 DFHMDF POS=(05,69),LENGTH=10,ATTRB=(ASKIP,NORM),               C00097**4
               COLOR=BLUE                                               00098**3
**********                                                              00034**3
AINVN02 DFHMDF POS=(06,03),LENGTH=14,ATTRB=(ASKIP,NORM),               C00077**3
               COLOR=BLUE                                               00078**3
AIDTE02 DFHMDF POS=(06,21),LENGTH=10,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ASTRN02 DFHMDF POS=(06,33),LENGTH=04,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086**3
ATYPE02 DFHMDF POS=(06,40),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
AENTR02 DFHMDF POS=(06,45),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
ASTAT02 DFHMDF POS=(06,50),LENGTH=02,ATTRB=(ASKIP,NORM),               C00075**3
               COLOR=BLUE                                               00076**3
AGAMT02 DFHMDF POS=(06,54),LENGTH=12,ATTRB=(ASKIP,NORM),               C00095**3
               COLOR=BLUE                                               00096**3
AEDTE02 DFHMDF POS=(06,69),LENGTH=10,ATTRB=(ASKIP,NORM),               C00097**4
               COLOR=BLUE                                               00098**3
**********                                                              00034**3
AINVN03 DFHMDF POS=(07,03),LENGTH=14,ATTRB=(ASKIP,NORM),               C00077**3
               COLOR=BLUE                                               00078**3
AIDTE03 DFHMDF POS=(07,21),LENGTH=10,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ASTRN03 DFHMDF POS=(07,33),LENGTH=04,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086**3
ATYPE03 DFHMDF POS=(07,40),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
AENTR03 DFHMDF POS=(07,45),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
ASTAT03 DFHMDF POS=(07,50),LENGTH=02,ATTRB=(ASKIP,NORM),               C00075**3
               COLOR=BLUE                                               00076**3
AGAMT03 DFHMDF POS=(07,54),LENGTH=12,ATTRB=(ASKIP,NORM),               C00095**3
               COLOR=BLUE                                               00096**3
AEDTE03 DFHMDF POS=(07,69),LENGTH=10,ATTRB=(ASKIP,NORM),               C00097**4
               COLOR=BLUE                                               00098**3
**********                                                              00034**3
AINVN04 DFHMDF POS=(08,03),LENGTH=14,ATTRB=(ASKIP,NORM),               C00077**3
               COLOR=BLUE                                               00078**3
AIDTE04 DFHMDF POS=(08,21),LENGTH=10,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ASTRN04 DFHMDF POS=(08,33),LENGTH=04,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086**3
ATYPE04 DFHMDF POS=(08,40),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
AENTR04 DFHMDF POS=(08,45),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
ASTAT04 DFHMDF POS=(08,50),LENGTH=02,ATTRB=(ASKIP,NORM),               C00075**3
               COLOR=BLUE                                               00076**3
AGAMT04 DFHMDF POS=(08,54),LENGTH=12,ATTRB=(ASKIP,NORM),               C00095**3
               COLOR=BLUE                                               00096**3
AEDTE04 DFHMDF POS=(08,69),LENGTH=10,ATTRB=(ASKIP,NORM),               C00097**4
               COLOR=BLUE                                               00098**3
**********                                                              00034**3
AINVN05 DFHMDF POS=(09,03),LENGTH=14,ATTRB=(ASKIP,NORM),               C00077**3
               COLOR=BLUE                                               00078**3
AIDTE05 DFHMDF POS=(09,21),LENGTH=10,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ASTRN05 DFHMDF POS=(09,33),LENGTH=04,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086**3
ATYPE05 DFHMDF POS=(09,40),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
AENTR05 DFHMDF POS=(09,45),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
ASTAT05 DFHMDF POS=(09,50),LENGTH=02,ATTRB=(ASKIP,NORM),               C00075**3
               COLOR=BLUE                                               00076**3
AGAMT05 DFHMDF POS=(09,54),LENGTH=12,ATTRB=(ASKIP,NORM),               C00095**3
               COLOR=BLUE                                               00096**3
AEDTE05 DFHMDF POS=(09,69),LENGTH=10,ATTRB=(ASKIP,NORM),               C00097**4
               COLOR=BLUE                                               00098**3
**********                                                              00034**3
AINVN06 DFHMDF POS=(10,03),LENGTH=14,ATTRB=(ASKIP,NORM),               C00077**3
               COLOR=BLUE                                               00078**3
AIDTE06 DFHMDF POS=(10,21),LENGTH=10,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ASTRN06 DFHMDF POS=(10,33),LENGTH=04,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086**3
ATYPE06 DFHMDF POS=(10,40),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
AENTR06 DFHMDF POS=(10,45),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
ASTAT06 DFHMDF POS=(10,50),LENGTH=02,ATTRB=(ASKIP,NORM),               C00075**3
               COLOR=BLUE                                               00076**3
AGAMT06 DFHMDF POS=(10,54),LENGTH=12,ATTRB=(ASKIP,NORM),               C00095**3
               COLOR=BLUE                                               00096**3
AEDTE06 DFHMDF POS=(10,69),LENGTH=10,ATTRB=(ASKIP,NORM),               C00097**4
               COLOR=BLUE                                               00098**3
**********                                                              00034**3
AINVN07 DFHMDF POS=(11,03),LENGTH=14,ATTRB=(ASKIP,NORM),               C00077**3
               COLOR=BLUE                                               00078**3
AIDTE07 DFHMDF POS=(11,21),LENGTH=10,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ASTRN07 DFHMDF POS=(11,33),LENGTH=04,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086**3
ATYPE07 DFHMDF POS=(11,40),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
AENTR07 DFHMDF POS=(11,45),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
ASTAT07 DFHMDF POS=(11,50),LENGTH=02,ATTRB=(ASKIP,NORM),               C00075**3
               COLOR=BLUE                                               00076**3
AGAMT07 DFHMDF POS=(11,54),LENGTH=12,ATTRB=(ASKIP,NORM),               C00095**3
               COLOR=BLUE                                               00096**3
AEDTE07 DFHMDF POS=(11,69),LENGTH=10,ATTRB=(ASKIP,NORM),               C00097**4
               COLOR=BLUE                                               00098**3
**********                                                              00034**3
AINVN08 DFHMDF POS=(12,03),LENGTH=14,ATTRB=(ASKIP,NORM),               C00077**3
               COLOR=BLUE                                               00078**3
AIDTE08 DFHMDF POS=(12,21),LENGTH=10,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ASTRN08 DFHMDF POS=(12,33),LENGTH=04,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086**3
ATYPE08 DFHMDF POS=(12,40),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
AENTR08 DFHMDF POS=(12,45),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
ASTAT08 DFHMDF POS=(12,50),LENGTH=02,ATTRB=(ASKIP,NORM),               C00075**3
               COLOR=BLUE                                               00076**3
AGAMT08 DFHMDF POS=(12,54),LENGTH=12,ATTRB=(ASKIP,NORM),               C00095**3
               COLOR=BLUE                                               00096**3
AEDTE08 DFHMDF POS=(12,69),LENGTH=10,ATTRB=(ASKIP,NORM),               C00097**4
               COLOR=BLUE                                               00098**3
**********                                                              00034**3
AINVN09 DFHMDF POS=(13,03),LENGTH=14,ATTRB=(ASKIP,NORM),               C00077**3
               COLOR=BLUE                                               00078**3
AIDTE09 DFHMDF POS=(13,21),LENGTH=10,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ASTRN09 DFHMDF POS=(13,33),LENGTH=04,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086**3
ATYPE09 DFHMDF POS=(13,40),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
AENTR09 DFHMDF POS=(13,45),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
ASTAT09 DFHMDF POS=(13,50),LENGTH=02,ATTRB=(ASKIP,NORM),               C00075**3
               COLOR=BLUE                                               00076**3
AGAMT09 DFHMDF POS=(13,54),LENGTH=12,ATTRB=(ASKIP,NORM),               C00095**3
               COLOR=BLUE                                               00096**3
AEDTE09 DFHMDF POS=(13,69),LENGTH=10,ATTRB=(ASKIP,NORM),               C00097**4
               COLOR=BLUE                                               00098**3
**********                                                              00034**3
AINVN10 DFHMDF POS=(14,03),LENGTH=14,ATTRB=(ASKIP,NORM),               C00077**3
               COLOR=BLUE                                               00078**3
AIDTE10 DFHMDF POS=(14,21),LENGTH=10,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ASTRN10 DFHMDF POS=(14,33),LENGTH=04,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086**3
ATYPE10 DFHMDF POS=(14,40),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
AENTR10 DFHMDF POS=(14,45),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
ASTAT10 DFHMDF POS=(14,50),LENGTH=02,ATTRB=(ASKIP,NORM),               C00075**3
               COLOR=BLUE                                               00076**3
AGAMT10 DFHMDF POS=(14,54),LENGTH=12,ATTRB=(ASKIP,NORM),               C00095**3
               COLOR=BLUE                                               00096**3
AEDTE10 DFHMDF POS=(14,69),LENGTH=10,ATTRB=(ASKIP,NORM),               C00097**4
               COLOR=BLUE                                               00098**3
**********                                                              00034**3
AINVN11 DFHMDF POS=(15,03),LENGTH=14,ATTRB=(ASKIP,NORM),               C00077**3
               COLOR=BLUE                                               00078**3
AIDTE11 DFHMDF POS=(15,21),LENGTH=10,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ASTRN11 DFHMDF POS=(15,33),LENGTH=04,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086**3
ATYPE11 DFHMDF POS=(15,40),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
AENTR11 DFHMDF POS=(15,45),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
ASTAT11 DFHMDF POS=(15,50),LENGTH=02,ATTRB=(ASKIP,NORM),               C00075**3
               COLOR=BLUE                                               00076**3
AGAMT11 DFHMDF POS=(15,54),LENGTH=12,ATTRB=(ASKIP,NORM),               C00095**3
               COLOR=BLUE                                               00096**3
AEDTE11 DFHMDF POS=(15,69),LENGTH=10,ATTRB=(ASKIP,NORM),               C00097**4
               COLOR=BLUE                                               00098**3
**********                                                              00034**3
AINVN12 DFHMDF POS=(16,03),LENGTH=14,ATTRB=(ASKIP,NORM),               C00077**3
               COLOR=BLUE                                               00078**3
AIDTE12 DFHMDF POS=(16,21),LENGTH=10,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ASTRN12 DFHMDF POS=(16,33),LENGTH=04,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086**3
ATYPE12 DFHMDF POS=(16,40),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
AENTR12 DFHMDF POS=(16,45),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
ASTAT12 DFHMDF POS=(16,50),LENGTH=02,ATTRB=(ASKIP,NORM),               C00075**3
               COLOR=BLUE                                               00076**3
AGAMT12 DFHMDF POS=(16,54),LENGTH=12,ATTRB=(ASKIP,NORM),               C00095**3
               COLOR=BLUE                                               00096**3
AEDTE12 DFHMDF POS=(16,69),LENGTH=10,ATTRB=(ASKIP,NORM),               C00097**4
               COLOR=BLUE                                               00098**3
**********                                                              00034**3
AINVN13 DFHMDF POS=(17,03),LENGTH=14,ATTRB=(ASKIP,NORM),               C00077**3
               COLOR=BLUE                                               00078**3
AIDTE13 DFHMDF POS=(17,21),LENGTH=10,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ASTRN13 DFHMDF POS=(17,33),LENGTH=04,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086**3
ATYPE13 DFHMDF POS=(17,40),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
AENTR13 DFHMDF POS=(17,45),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
ASTAT13 DFHMDF POS=(17,50),LENGTH=02,ATTRB=(ASKIP,NORM),               C00075**3
               COLOR=BLUE                                               00076**3
AGAMT13 DFHMDF POS=(17,54),LENGTH=12,ATTRB=(ASKIP,NORM),               C00095**3
               COLOR=BLUE                                               00096**3
AEDTE13 DFHMDF POS=(17,69),LENGTH=10,ATTRB=(ASKIP,NORM),               C00097**4
               COLOR=BLUE                                               00098**3
**********                                                              00034**3
AINVN14 DFHMDF POS=(18,03),LENGTH=14,ATTRB=(ASKIP,NORM),               C00077**3
               COLOR=BLUE                                               00078**3
AIDTE14 DFHMDF POS=(18,21),LENGTH=10,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ASTRN14 DFHMDF POS=(18,33),LENGTH=04,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086**3
ATYPE14 DFHMDF POS=(18,40),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
AENTR14 DFHMDF POS=(18,45),LENGTH=02,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
ASTAT14 DFHMDF POS=(18,50),LENGTH=02,ATTRB=(ASKIP,NORM),               C00075**3
               COLOR=BLUE                                               00076**3
AGAMT14 DFHMDF POS=(18,54),LENGTH=12,ATTRB=(ASKIP,NORM),               C00095**3
               COLOR=BLUE                                               00096**3
AEDTE14 DFHMDF POS=(18,69),LENGTH=10,ATTRB=(ASKIP,NORM),               C00097**4
               COLOR=BLUE                                               00098**3
**********                                                              00034**3
        DFHMDF POS=(19,40),LENGTH=24,ATTRB=(ASKIP,NORM),               C00465**3
               COLOR=NEUTRAL,INITIAL='NUMBER OF UPDATED ITEMS:'         00466**3
AUPDIT  DFHMDF POS=(19,66),LENGTH=07,ATTRB=(ASKIP,NORM),               C00467**3
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00468**3
**************                                                          00469**3
        DFHMSD TYPE=FINAL                                               00470**3
**************                                                          00471**3
        END                                                             00472**3
