000100 IDENTIFICATION DIVISION.                                         00010019
000200 PROGRAM-ID.  APKRP180.                                           00020019
000300 AUTHOR.  CAROLYN GIFFORD.                                        00030019
000400 DATE-WRITTEN.  AUGUST 1999.                                      00040019
000500 DATE-COMPILED.                                                   00050019
000600*************************************************************     00060019
000700*    COBOL 2                                                *     00070019
000800*                                                           *     00080019
000900*    UNJOURNALIZED RECEIPT BY VERIFIED DATE REPORT          *     00090020
001000*                                                           *     00100019
001100*   INPUT:                                                  *     00110020
001200*  1) INTRANSIT-FILE                      (APRD042)         *     00120020
001300*                                                           *     00130020
001400*   OUTPUT:                                                 *     00140020
001500*  1) REPORT-FILE                         (DPWS132O)        *     00150020
001600*                                                           *     00160020
001700*************************************************************     00170019
001800* CHANGE LOG:                                               *     00180019
001900*                                                           *     00190019
002000*   01/23/02      BY:  MIKE BESKE                WR # 23005 *     00200019
002100*   INCREASED THE SIZE OF PV-HOLD-REC-SEQ-NBR TO MATCH THE  *     00210019
002200*   SAME INCREASE TO AP042-REC-SEQ-NBR.                     *     00220019
002300*                                                           *     00230019
002400* 02/04/2003                                                *     00240020
002500*    CHANGE MADE: ARKPO PHASE3 PROJECT.                     *     00250020
002600*    UPDATED THE PROGRAM TITLE TO MATCH THE SPEC PROGRAM    *     00260020
002700*    TITLE. UPDATED THE FILE NAMES IN THE PROGRAM COMMENT   *     00270020
002800*    BLOCK. INCREASED THE SIZE OF THE DL-PO-NBR TO Z(9).    *     00280020
002900*    INCREASED THE W/S PO NBR FIELD FROM 7 TO 9 BYTES.      *     00290020
003000*    MODIFIED THE PRINT HEADING FOR PO NBR TO LINE UP BASED *     00300020
003100*    ON THE INCREASED SIZE FOR THE PO NBR.                  *     00310020
003200* MADE BY:  MIKE BESKE                          WR#: 23500  *     00320020
003210*                                                           *     00321023
003220* 03/31/2004                                                *     00322023
003230*    CHANGE MADE: INCREASED THE W/S STORE FIELDS FROM 3 TO  *     00323023
003240*    4 CHARS.                                               *     00324023
003250* MADE BY:  MIKE BESKE                          WR#: 25805  *     00325023
003210*                                                           *     00326024
003220* 09/07/2021                                                *     00327024
003230*    CHANGE MADE: RECOMPILE FOR NEW VERSION OF APRD042      *     00328024
003250* MADE BY:  JEAN KURK                       CHG0260549      *     00329124
003300*************************************************************     00330019
003400 ENVIRONMENT DIVISION.                                            00340019
003500*************************************************************     00350019
003600 CONFIGURATION SECTION.                                           00360019
003700 INPUT-OUTPUT SECTION.                                            00370019
003800 FILE-CONTROL.                                                    00380019
003900     SELECT INTRANSIT-FILE ASSIGN TO UT-S-INP01.                  00390019
004000                                                                  00400019
004100     SELECT REPORT-FILE ASSIGN    TO UT-S-RPT01.                  00410019
004200                                                                  00420019
004300 DATA DIVISION.                                                   00430019
004400 FILE SECTION.                                                    00440019
004500 FD  INTRANSIT-FILE RECORDING MODE IS F                           00450019
004600                                 LABEL RECORDS ARE STANDARD       00460019
004700                                 BLOCK CONTAINS 0 RECORDS         00470019
004800                                 DATA RECORD IS REPORT-RECORD.    00480019
004900 01  INTRANSIT-RECORD            PIC X(120).                      00490019
005000                                                                  00500019
005100 FD  REPORT-FILE                 RECORDING MODE IS F              00510019
005200                                 LABEL RECORDS ARE STANDARD       00520019
005300                                 BLOCK CONTAINS 0 RECORDS         00530019
005400                                 DATA RECORD IS REPORT-RECORD.    00540019
005500 01  REPORT-RECORD               PIC X(132).                      00550019
005600                                                                  00560019
005700                                                                  00570019
005800*************************************************************     00580019
005900 WORKING-STORAGE SECTION.                                         00590019
006000                                                                  00600019
006100 01  PV-PROGRAM-SWITCHES.                                         00610019
006200     05  PV-PROGRAM-NAME         PIC X(08)     VALUE 'APKRP180'.  00620019
006300     05  PV-CURRENT-PARAGRAPH    PIC  X(35).                      00630019
006400     05  PV-CURRENT-DATE.                                         00640019
006500         10  PV-CURRENT-YEAR     PIC  9(02)  VALUE ZEROS.         00650019
006600         10  PV-CURRENT-MONTH    PIC  9(02)  VALUE ZEROS.         00660019
006700         10  PV-CURRENT-DAY      PIC  9(02)  VALUE ZEROS.         00670019
006800     05  PV-CURRENT-TIME.                                         00680019
006900         10  PV-CURRENT-HOUR     PIC  9(02)  VALUE ZEROS.         00690019
007000         10  PV-CURRENT-MINUTE   PIC  9(02)  VALUE ZEROS.         00700019
007100         10  FILLER              PIC  9(02)  VALUE ZEROS.         00710019
007200     05  PV-PREV-VRF-DT.                                          00720019
007300         10 PV-PREV-VRF-CYM      PIC  X(07) VALUE SPACES.         00730019
007400         10 FILLER               PIC  X(01) VALUE SPACES.         00740019
007500         10 PV-PREV-VRF-DD       PIC  X(02) VALUE SPACES.         00750019
007600     05  PV-VRF-DTE.                                              00760019
007700         10 PV-VRF-DT-CC          PIC  X(02).                     00770019
007800         10 PV-VRF-DT-YY          PIC  X(02).                     00780019
007900         10 FILLER                PIC  X(01).                     00790019
008000         10 PV-VRF-DT-MM          PIC  X(02).                     00800019
008100         10 FILLER                PIC  X(01).                     00810019
008200         10 PV-VRF-DT-DD          PIC  X(02).                     00820019
008300     05  PV-VRF-DTE2 REDEFINES PV-VRF-DTE.                        00830019
008400         10 PV-VRF-DT2-CYM        PIC  X(07).                     00840019
008500         10 FILLER                PIC  X(01).                     00850019
008600         10 PV-VRF-DT2-DD         PIC  X(02).                     00860019
008700     05  PV-VRF-DT-MDY.                                           00870019
008800         10 PV-VRF-MDY-MM         PIC  X(02).                     00880019
008900         10 FILLER                PIC  X(01) VALUE '/'.           00890019
009000         10 PV-VRF-MDY-DD         PIC  X(02).                     00900019
009100         10 FILLER                PIC  X(01) VALUE '/'.           00910019
009200         10 PV-VRF-MDY-YY         PIC  X(02).                     00920019
009300     05  PV-HOLD-STR-NBR          PIC  9(04)  VALUE ZEROES.       00930022
009400     05  PV-HOLD-DMM-NBR         PIC  9(03)  VALUE ZEROES.        00940019
009500     05  PV-HOLD-DEPT-NBR        PIC  9(03)  VALUE ZEROES.        00950019
009600     05  PV-HOLD-CL-NBR          PIC  9(03)  VALUE ZEROES.        00960019
009700     05  PV-HOLD-PO-NBR          PIC  9(09)  VALUE ZEROES.        00970020
009800     05  PV-HOLD-REC-SEQ-NBR     PIC  9(09)  VALUE ZEROES.        00980019
009900     05  PV-HOLD-VRFD-DTE        PIC  X(10)  VALUE ZEROES.        00990019
010000     05  PV-HOLD-REC-DTE         PIC  X(10)  VALUE ZEROES.        01000019
010100     05  PV-HOLD-ENT-NM-DESC     PIC  X(30)  VALUE SPACES.        01010019
010200     05  PV-HOLD-RTL-AMT         PIC  S9(09)V99 VALUE ZEROES.     01020019
010300     05  PV-HOLD-COST-AMT        PIC  S9(09)V99 VALUE ZEROES.     01030019
010400                                                                  01040019
010500 01  PC-PROGRAM-COUNTERS.                                         01050019
010600     05  PC-LINE-COUNT           PIC S9(03)    VALUE ZEROES       01060019
010700                                               COMP-3.            01070019
010800     05  PC-MAX-LINES            PIC S9(03)  VALUE +60            01080019
010900                                             COMP-3.              01090019
011000     05  PC-PAGE-COUNT           PIC S9(06)    VALUE ZEROES       01100019
011100                                               COMP-3.            01110019
011200     05  PC-DATA-RECS-READ       PIC 9(10)    VALUE ZEROES.       01120019
011300                                                                  01130019
011400 01  SW-PROGRAM-SWITCHES.                                         01140019
011500     05  SW-END-OF-INTRANSIT-DATA       PIC  X(01)  VALUE 'N'.    01150019
011600         88 END-OF-INTRANSIT-DATA                   VALUE 'Y'.    01160019
011700     05  SW-STORE-FLAG                  PIC X(01)   VALUE 'N'.    01170019
011800         88  STORE-FLAG                             VALUE 'Y'.    01180019
011900         88  NOT-STORE-FLAG                         VALUE 'N'.    01190019
012000                                                                  01200019
012100 01  MTH-TOTALS.                                                  01210019
012200     05  MTH-TOT-RETAIL      PIC S9(11)V99 COMP-3 VALUE ZEROES.   01220019
012300     05  MTH-TOT-COST        PIC S9(11)V99 COMP-3 VALUE ZEROES.   01230019
012400                                                                  01240019
012500 01  GRAND-TOTALS.                                                01250019
012600     05  GR-TOT-RETAIL       PIC S9(13)V99 COMP-3 VALUE ZEROES.   01260019
012700     05  GR-TOT-COST         PIC S9(13)V99 COMP-3 VALUE ZEROES.   01270019
012800                                                                  01280019
012900 01  REPORT1-HEADER-1.                                            01290019
013000     05  FILLER               PIC X(46)   VALUE SPACES.           01300019
013100     05  FILLER               PIC X(41)   VALUE                   01310019
013200     'UNJOURNALIZED RECEIPTS - BY VERIFIED DATE'.                 01320019
013300     05  FILLER               PIC X(46)   VALUE SPACES.           01330019
013400                                                                  01340019
013500 01  REPORT1-HEADER-2.                                            01350019
013600     05  FILLER               PIC X(28)   VALUE SPACES.           01360019
013700     05  FILLER               PIC X(8)    VALUE 'RCVR SEQ'.       01370019
013800     05  FILLER               PIC X(68)   VALUE SPACES.           01380019
013900     05  FILLER               PIC X(6)    VALUE 'RETAIL'.         01390019
014000     05  FILLER               PIC X(23)   VALUE SPACES.           01400019
014100                                                                  01410019
014200 01  REPORT1-HEADER-3.                                            01420019
014300     05  FILLER               PIC X(7)    VALUE SPACES.           01430019
014400     05  FILLER               PIC X(4)    VALUE 'DATE'.           01440019
014500     05  FILLER               PIC X(8)    VALUE SPACES.           01450020
014600     05  FILLER               PIC X(4)    VALUE 'PO #'.           01460019
014700     05  FILLER               PIC X(6)    VALUE SPACES.           01470020
014800     05  FILLER               PIC X(6)    VALUE 'NUMBER'.         01480019
014900     05  FILLER               PIC X(6)    VALUE SPACES.           01490019
015000     05  FILLER               PIC X(3)    VALUE 'DIV'.            01500019
015100     05  FILLER               PIC X(6)    VALUE SPACES.           01510019
015200     05  FILLER               PIC X(4)    VALUE 'DEPT'.           01520019
015300     05  FILLER               PIC X(10)   VALUE SPACES.           01530019
015400     05  FILLER               PIC X(11)   VALUE 'VENDOR NAME'.    01540019
015500     05  FILLER               PIC X(10)   VALUE SPACES.           01550019
015600     05  FILLER               PIC X(5)    VALUE 'CLASS'.          01560019
015700     05  FILLER               PIC X(2)    VALUE SPACES.           01570019
015800     05  FILLER               PIC X(5)    VALUE 'STORE'.          01580019
015900     05  FILLER               PIC X(7)    VALUE SPACES.           01590019
016000     05  FILLER               PIC X(6)    VALUE 'AMOUNT'.         01600019
016100     05  FILLER               PIC X(12)   VALUE SPACES.           01610019
016200     05  FILLER               PIC X(4)    VALUE 'COST'.           01620019
016300     05  FILLER               PIC X(7)    VALUE SPACES.           01630019
016400                                                                  01640019
016500 01  REPORT1-DETAIL.                                              01650019
016600     05  FILLER               PIC X(5)    VALUE SPACES.           01660019
016700     05  RPT1-KEYREC-DATE     PIC X(8).                           01670019
016800     05  FILLER               PIC X(3)    VALUE SPACES.           01680020
016900     05  RPT1-PO-NBR          PIC Z(9)    VALUE ZERO.             01690021
017000     05  FILLER               PIC X(5)    VALUE SPACES.           01700019
017100     05  RPT1-KEYREC-NUMBER   PIC 9(3).                           01710019
017200     05  FILLER               PIC X(8)    VALUE SPACES.           01720019
017300     05  RPT1-DIVISION        PIC X(3).                           01730019
017400     05  FILLER               PIC X(7)    VALUE SPACES.           01740019
017500     05  RPT1-DEPT            PIC 9(3).                           01750019
017600     05  FILLER               PIC X(3)    VALUE SPACES.           01760019
017700     05  RPT1-VENDOR-NAME     PIC X(25).                          01770019
017800     05  FILLER               PIC X(4)    VALUE SPACES.           01780019
017900     05  RPT1-CLASS           PIC X(3).                           01790019
018000     05  FILLER               PIC X(3)    VALUE SPACES.           01800022
018100     05  RPT1-STORE           PIC X(4).                           01810022
018200     05  FILLER               PIC X(4)    VALUE SPACES.           01820019
018300     05  RPT1-RETAIL          PIC ZZZ,ZZZ,ZZ9.                    01830019
018400     05  FILLER               PIC X(3)    VALUE SPACES.           01840019
018500     05  RPT1-COST            PIC ZZZ,ZZZ,ZZZ.99.                 01850019
018600     05  FILLER               PIC X(4)    VALUE SPACES.           01860019
018700                                                                  01870019
018800 01  REPORT1-TOTAL.                                               01880019
018900     05  FILLER               PIC X(13)   VALUE SPACES.           01890019
019000     05  FILLER               PIC X(13)   VALUE 'MONTHLY TOTAL'.  01900019
019100     05  FILLER               PIC X(74)   VALUE SPACES.           01910019
019200     05  RPT1-RETAIL-TOTAL    PIC ZZZ,ZZZ,ZZ9.                    01920019
019300     05  FILLER               PIC X(3)    VALUE SPACES.           01930019
019400     05  RPT1-COST-TOTAL      PIC ZZZ,ZZZ,ZZZ.99.                 01940019
019500     05  FILLER               PIC X(4)    VALUE SPACES.           01950019
019600                                                                  01960019
019700 01  GRAND-TOTAL-LINE.                                            01970019
019800     05  FILLER               PIC X(13)   VALUE SPACES.           01980019
019900     05  FILLER               PIC X(11)   VALUE 'GRAND TOTAL'.    01990019
020000     05  FILLER               PIC X(73)   VALUE SPACES.           02000019
020100     05  GRAND-RETAIL-TOTAL   PIC ZZ,ZZZ,ZZZ,ZZ9.                 02010019
020200*    05  FILLER               PIC X(3)    VALUE SPACES.           02020019
020300     05  GRAND-COST-TOTAL     PIC ZZ,ZZZ,ZZZ,ZZZ.99.              02030019
020400     05  FILLER               PIC X(4)    VALUE SPACES.           02040019
020500                                                                  02050019
020600***** REPORT LAYOUT                                               02060019
020700     COPY DPWS132O.                                               02070019
020800                                                                  02080019
020900***** INPUT FILE LAYOUT                                           02090019
021000     COPY APRD042.                                                02100019
021100                                                                  02110019
021200 PROCEDURE DIVISION.                                              02120019
021300 A100-MAINLINE.                                                   02130019
021400     PERFORM B100-INITIALIZATION.                                 02140019
021500                                                                  02150019
021600     PERFORM B200-PROCESS-VENDOR-DATA                             02160019
021700             UNTIL END-OF-INTRANSIT-DATA.                         02170019
021800                                                                  02180019
021900     PERFORM W400-WRITE-GRAND-TOTALS.                             02190019
022000                                                                  02200019
022100     PERFORM B300-TERMINATION.                                    02210019
022200                                                                  02220019
022300     GOBACK.                                                      02230019
022400                                                                  02240019
022500******************************************************************02250019
022600** OPEN INPUT FILE, INITIALIZE VARIABLES, AND DO A PRIMING READ **02260019
022700** ON THE INTRANSIT DATA FILE.                                  **02270019
022800******************************************************************02280019
022900 B100-INITIALIZATION.                                             02290019
023000     OPEN INPUT  INTRANSIT-FILE                                   02300019
023100          OUTPUT REPORT-FILE.                                     02310019
023200                                                                  02320019
023300     INITIALIZE AP042-EXTRACT-FILE                                02330019
023400                PV-PREV-VRF-DT.                                   02340019
023500                                                                  02350019
023600     SET NOT-STORE-FLAG TO TRUE.                                  02360019
023700     MOVE 'N' TO SW-END-OF-INTRANSIT-DATA.                        02370019
023800                                                                  02380019
023900     ACCEPT PV-CURRENT-DATE FROM DATE.                            02390019
024000     MOVE PV-CURRENT-MONTH            TO DP132O-RUN-MONTH.        02400019
024100     MOVE PV-CURRENT-DAY              TO DP132O-RUN-DAY.          02410019
024200     MOVE PV-CURRENT-YEAR             TO DP132O-RUN-YEAR.         02420019
024300                                                                  02430019
024400     ACCEPT PV-CURRENT-TIME FROM TIME.                            02440019
024500     MOVE PV-CURRENT-HOUR             TO DP132O-RUN-HOUR.         02450019
024600     MOVE PV-CURRENT-MINUTE           TO DP132O-RUN-MINUTE.       02460019
024700     MOVE PV-PROGRAM-NAME             TO DP132O-PROGRAM-NAME.     02470019
024800     MOVE 1                           TO DP132O-REPORT-NUMBER.    02480019
024900                                                                  02490019
025000     PERFORM W100-WRITE-REPORT-HEADINGS.                          02500019
025100                                                                  02510019
025200     PERFORM R100-READ-INTRANSIT-FILE.                            02520019
025300                                                                  02530019
025400     IF NOT END-OF-INTRANSIT-DATA                                 02540019
025500       PERFORM C200-MOVE-TO-HOLD-FIELDS                           02550019
025600       PERFORM C300-ADD-TO-TOTALS                                 02560019
025700       IF PV-PREV-VRF-DT = SPACES                                 02570019
025800          MOVE PV-HOLD-VRFD-DTE   TO  PV-PREV-VRF-DT.             02580019
025900                                                                  02590019
026000 B200-PROCESS-VENDOR-DATA.                                        02600019
026100                                                                  02610019
026200     PERFORM R100-READ-INTRANSIT-FILE.                            02620019
026300                                                                  02630019
026400     IF NOT END-OF-INTRANSIT-DATA                                 02640019
026500        MOVE AP042-VRFD-DTE TO PV-VRF-DTE.                        02650019
026600                                                                  02660019
026700     IF END-OF-INTRANSIT-DATA                                     02670019
026800        ADD MTH-TOT-RETAIL   TO GR-TOT-RETAIL                     02680019
026900        ADD MTH-TOT-COST     TO GR-TOT-COST                       02690019
027000        MOVE MTH-TOT-RETAIL  TO RPT1-RETAIL-TOTAL                 02700019
027100        MOVE MTH-TOT-COST    TO RPT1-COST-TOTAL                   02710019
027200        PERFORM C100-MOVES-TO-DETAIL                              02720019
027300        PERFORM W200-WRITE-REPORT-DETAIL                          02730019
027400        PERFORM W300-WRITE-MONTHLY-TOTALS                         02740019
027500     ELSE                                                         02750019
027600     IF PV-PREV-VRF-CYM NOT = PV-VRF-DT2-CYM                      02760019
027700        ADD MTH-TOT-RETAIL   TO GR-TOT-RETAIL                     02770019
027800        ADD MTH-TOT-COST     TO GR-TOT-COST                       02780019
027900        MOVE MTH-TOT-RETAIL  TO RPT1-RETAIL-TOTAL                 02790019
028000        MOVE MTH-TOT-COST    TO RPT1-COST-TOTAL                   02800019
028100        PERFORM C100-MOVES-TO-DETAIL                              02810019
028200        PERFORM W200-WRITE-REPORT-DETAIL                          02820019
028300        PERFORM W300-WRITE-MONTHLY-TOTALS                         02830019
028400        INITIALIZE MTH-TOTALS                                     02840019
028500                   PV-HOLD-RTL-AMT                                02850019
028600                   PV-HOLD-COST-AMT                               02860019
028700        SET NOT-STORE-FLAG            TO TRUE                     02870019
028800        PERFORM C200-MOVE-TO-HOLD-FIELDS                          02880019
028900        PERFORM C300-ADD-TO-TOTALS                                02890019
029000        MOVE PV-HOLD-VRFD-DTE TO PV-PREV-VRF-DT                   02900019
029100      ELSE                                                        02910019
029200       IF AP042-PO-NBR  NOT = PV-HOLD-PO-NBR OR                   02920019
029300          AP042-REC-SEQ-NBR NOT = PV-HOLD-REC-SEQ-NBR OR          02930019
029400          AP042-VRFD-DTE NOT = PV-HOLD-VRFD-DTE                   02940019
029500                                                                  02950019
029600* MOVE AND PRINT PREVIOUS DETAIL                                  02960019
029700          PERFORM C100-MOVES-TO-DETAIL                            02970019
029800          PERFORM W200-WRITE-REPORT-DETAIL                        02980019
029900          INITIALIZE PV-HOLD-RTL-AMT                              02990019
030000                     PV-HOLD-COST-AMT                             03000019
030100          SET NOT-STORE-FLAG       TO TRUE                        03010019
030200                                                                  03020019
030300* MOVE AND ADD FOR CURRENT RECORD                                 03030019
030400          PERFORM C200-MOVE-TO-HOLD-FIELDS                        03040019
030500          PERFORM C300-ADD-TO-TOTALS                              03050019
030600       ELSE                                                       03060019
030700          PERFORM C300-ADD-TO-TOTALS                              03070019
030800          SET STORE-FLAG                TO TRUE.                  03080019
030900                                                                  03090019
031000******************************************************************03100019
031100**  CLOSE THE OUTPUT FILES.                                     **03110019
031200******************************************************************03120019
031300 B300-TERMINATION.                                                03130019
031400                                                                  03140019
031500     DISPLAY '**** PROGRAM APKRP180 COMPLETED NORMALLY **'.       03150019
031600     DISPLAY ' INTRANSIT RECS READ   =  ' PC-DATA-RECS-READ.      03160019
031700                                                                  03170019
031800     CLOSE INTRANSIT-FILE                                         03180019
031900           REPORT-FILE.                                           03190019
032000                                                                  03200019
032100 C100-MOVES-TO-DETAIL.                                            03210019
032200     MOVE PV-HOLD-ENT-NM-DESC       TO RPT1-VENDOR-NAME.          03220019
032300     MOVE PV-HOLD-DMM-NBR           TO RPT1-DIVISION.             03230019
032400     MOVE PV-HOLD-DEPT-NBR          TO RPT1-DEPT.                 03240019
032500     MOVE PV-HOLD-CL-NBR            TO RPT1-CLASS.                03250019
032600     MOVE PV-HOLD-PO-NBR            TO RPT1-PO-NBR.               03260020
032700                                                                  03270019
032800     IF STORE-FLAG                                                03280019
032900        MOVE '0000'                 TO RPT1-STORE                 03290022
033000     ELSE                                                         03300019
033100        MOVE PV-HOLD-STR-NBR        TO RPT1-STORE.                03310019
033200                                                                  03320019
033300     MOVE PV-HOLD-REC-SEQ-NBR       TO RPT1-KEYREC-NUMBER.        03330019
033400     MOVE PV-HOLD-VRFD-DTE          TO PV-VRF-DTE.                03340019
033500     MOVE PV-VRF-DT-YY              TO PV-VRF-MDY-YY.             03350019
033600     MOVE PV-VRF-DT-MM              TO PV-VRF-MDY-MM.             03360019
033700     MOVE PV-VRF-DT-DD              TO PV-VRF-MDY-DD.             03370019
033800     MOVE PV-VRF-DT-MDY             TO RPT1-KEYREC-DATE.          03380019
033900                                                                  03390019
034000     MOVE PV-HOLD-RTL-AMT           TO RPT1-RETAIL.               03400019
034100     MOVE PV-HOLD-COST-AMT          TO RPT1-COST.                 03410019
034200                                                                  03420019
034300 C200-MOVE-TO-HOLD-FIELDS.                                        03430019
034400     MOVE AP042-STR-NBR             TO PV-HOLD-STR-NBR.           03440019
034500     MOVE AP042-DMM-NBR             TO PV-HOLD-DMM-NBR.           03450019
034600     MOVE AP042-DEPT-NBR            TO PV-HOLD-DEPT-NBR.          03460019
034700     MOVE AP042-CL-NBR              TO PV-HOLD-CL-NBR.            03470019
034800     MOVE AP042-PO-NBR              TO PV-HOLD-PO-NBR.            03480019
034900     MOVE AP042-REC-SEQ-NBR         TO PV-HOLD-REC-SEQ-NBR.       03490019
035000     MOVE AP042-VRFD-DTE            TO PV-HOLD-VRFD-DTE.          03500019
035100     MOVE AP042-REC-DTE             TO PV-HOLD-REC-DTE.           03510019
035200     MOVE AP042-ENT-NM-DESC         TO PV-HOLD-ENT-NM-DESC.       03520019
035300                                                                  03530019
035400 C300-ADD-TO-TOTALS.                                              03540019
035500     ADD AP042-CALCD-VRFD-RTL-AMT   TO PV-HOLD-RTL-AMT            03550019
035600                                       MTH-TOT-RETAIL.            03560019
035700     ADD AP042-CALCD-VRFD-COST-AMT  TO PV-HOLD-COST-AMT           03570019
035800                                       MTH-TOT-COST.              03580019
035900                                                                  03590019
036000 R100-READ-INTRANSIT-FILE.                                        03600019
036100     INITIALIZE AP042-EXTRACT-FILE.                               03610019
036200                                                                  03620019
036300     READ INTRANSIT-FILE INTO AP042-EXTRACT-FILE                  03630019
036400        AT END                                                    03640019
036500        SET END-OF-INTRANSIT-DATA TO TRUE.                        03650019
036600                                                                  03660019
036700     IF NOT END-OF-INTRANSIT-DATA                                 03670019
036800        ADD 1 TO PC-DATA-RECS-READ.                               03680019
036900                                                                  03690019
037000******************************************************************03700019
037100**               WRITE REPORT HEADINGS                          **03710019
037200******************************************************************03720019
037300 W100-WRITE-REPORT-HEADINGS.                                      03730019
037400                                                                  03740019
037500     ADD 1                            TO PC-PAGE-COUNT.           03750019
037600     MOVE PC-PAGE-COUNT               TO DP132O-PAGE-NUMBER.      03760019
037700                                                                  03770019
037800     WRITE REPORT-RECORD                                          03780019
037900           FROM DP132O-STANDRD-HEADER-132-COLS AFTER PAGE.        03790019
038000     WRITE REPORT-RECORD FROM REPORT1-HEADER-1 AFTER 1.           03800019
038100                                                                  03810019
038200     WRITE REPORT-RECORD       FROM REPORT1-HEADER-2 AFTER 2.     03820019
038300                                                                  03830019
038400     WRITE REPORT-RECORD       FROM REPORT1-HEADER-3 AFTER 1.     03840019
038500                                                                  03850019
038600     MOVE SPACES TO REPORT-RECORD.                                03860019
038700     WRITE REPORT-RECORD AFTER 1.                                 03870019
038800     MOVE 5  TO PC-LINE-COUNT.                                    03880019
038900                                                                  03890019
039000 W200-WRITE-REPORT-DETAIL.                                        03900019
039100     IF PC-LINE-COUNT > PC-MAX-LINES                              03910019
039200         PERFORM W100-WRITE-REPORT-HEADINGS                       03920019
039300     END-IF.                                                      03930019
039400                                                                  03940019
039500     WRITE REPORT-RECORD FROM REPORT1-DETAIL AFTER 1.             03950019
039600                                                                  03960019
039700     ADD 1 TO PC-LINE-COUNT.                                      03970019
039800                                                                  03980019
039900     INITIALIZE REPORT1-DETAIL.                                   03990019
040000                                                                  04000019
040100 W300-WRITE-MONTHLY-TOTALS.                                       04010019
040200     IF PC-LINE-COUNT > PC-MAX-LINES                              04020019
040300         PERFORM W100-WRITE-REPORT-HEADINGS                       04030019
040400     END-IF.                                                      04040019
040500                                                                  04050019
040600     WRITE REPORT-RECORD FROM REPORT1-TOTAL AFTER 2.              04060019
040700                                                                  04070019
040800     MOVE SPACES TO REPORT-RECORD.                                04080019
040900     WRITE REPORT-RECORD AFTER 1.                                 04090019
041000                                                                  04100019
041100     ADD 3 TO PC-LINE-COUNT.                                      04110019
041200                                                                  04120019
041300     INITIALIZE REPORT1-TOTAL.                                    04130019
041400                                                                  04140019
041500 W400-WRITE-GRAND-TOTALS.                                         04150019
041600     IF PC-LINE-COUNT > PC-MAX-LINES                              04160019
041700         PERFORM W100-WRITE-REPORT-HEADINGS                       04170019
041800     END-IF.                                                      04180019
041900                                                                  04190019
042000     MOVE GR-TOT-RETAIL TO GRAND-RETAIL-TOTAL.                    04200019
042100     MOVE GR-TOT-COST   TO GRAND-COST-TOTAL.                      04210019
042200                                                                  04220019
042300     WRITE REPORT-RECORD FROM GRAND-TOTAL-LINE AFTER 2.           04230019
042400                                                                  04240019
042500     ADD 2 TO PC-LINE-COUNT.                                      04250019
042600                                                                  04260019
042700     INITIALIZE GRAND-TOTAL-LINE.                                 04270019
