000100*-----------------------*                                         00010000
000200 IDENTIFICATION DIVISION.                                         00020000
000300*-----------------------*                                         00030000
000400                                                                  00040023
000500 PROGRAM-ID.     APKRP215.                                        00050024
000600                                                                  00060024
000700 AUTHOR.         W A EHMKE     KOHLS.                             00070024
000800                                                                  00080024
000900 DATE-WRITTEN.   JULY  2000.                                      00090024
001000                                                                  00100024
001100 DATE-COMPILED.                                                   00110024
001200*---------------------------------------------------------------* 00120024
001300*              IMPORT PO AGING REPORT                           * 00130024
001400*                                                               * 00140024
001500*                                                               * 00150024
001600* THIS PROGRAM WILL CREATE A REPORT OF IMPORT VENDORS WITH THE  * 00160024
001700* NUMBER OF OPEN PURCHAS ORDERS IN THE SYSTEM, CLASSIFIED INTO  * 00170024
001800* 2 SETS OF AGING CATEGORIES. THE AGING CATEGORIES ARE BASED ON * 00180024
001900* VERIFIED RECEIPT DATE AND OTB PERIOD, AND THE NUMBER OF PO'S  * 00190024
002000* IN EACH CATEGORY FOR EACH VENDOR WILL HAVE ALREADY BEEN       * 00200024
002100* CALCULATED IN PROGRAM APKUT214.  THIS PROGRAM WILL SIMPLY     * 00210024
002200* FORMAT THE REPORTING OF THIS DATA AND CALCULATE TOTALS FOR ALL* 00220024
002300* VENDORS.                                                      * 00230024
002400*---------------------------------------------------------------* 00240024
002500*                                                               * 00250024
002600* INPUT:                                                        * 00260024
002700*                                                               * 00270024
002800*  1. PO AGING REPORT FILE                 (APRD037)            * 00280024
002900*                                                               * 00290024
003000* OUTPUT:                                                       * 00300024
003100*                                                               * 00310024
003200*  1. IMPORT PURCHASE ORDERS W / VERIFIED RECEIPTS AGE BY       * 00320024
003300*     RECEIPT DATE AND OTB PERIOD.                              * 00330024
003400*                                                               * 00340024
003500*---------------------------------------------------------------* 00350024
003600* CHANGE LOG:                                                   * 00360024
003700* 07/11/00   INITIAL VERSION.                       WR 20876 II * 00370024
003800*                                                               * 00380024
003900* DATE  01/21/2005                                              * 00390024
004000*     CHANGE MADE: CHANGED 'COLBY' TO 'LI & FUNG' IN THE FIELD  * 00400024
004100*            T1-TOTAL1-NONE-COLBY-VERIFIED.  LI & FUNG IS THE   * 00410024
004200*            PARENT COMPANY OF COLBY.  ALSO CHANGED THE DISPLAYS* 00420024
004300*            IN B400-END-OF-PROGRAM TO LI & FUNG.  PLUS, CHANGED* 00430027
004400*            ALL VARIABLES WITH 'COLBY' IN THEM TO 'LIFUNG'.    * 00440027
004500*     MADE BY: MIKE BESKE              WR/IR #: WR28114         * 00450024
004600*---------------------------------------------------------------* 00460024
004700                                                                  00470024
004800     EJECT                                                        00480024
004900                                                                  00490024
005000 ENVIRONMENT DIVISION.                                            00500024
005100                                                                  00510024
005200 CONFIGURATION SECTION.                                           00520024
005300                                                                  00530024
005400 SOURCE-COMPUTER.    IBM-3090.                                    00540024
005500 OBJECT-COMPUTER.    IBM-3090.                                    00550024
005600                                                                  00560024
005700 INPUT-OUTPUT SECTION.                                            00570024
005800                                                                  00580024
005900 FILE-CONTROL.                                                    00590024
006000                                                                  00600024
006100     SELECT IMPORT-PO-AGING-REPORT-FILE ASSIGN TO UT-S-INP01.     00610024
006200                                                                  00620024
006300     SELECT IMPORT-PO-AGING-REPORT      ASSIGN TO UT-S-RPT01.     00630024
006400                                                                  00640024
006500     EJECT                                                        00650024
006600                                                                  00660024
006700 DATA DIVISION.                                                   00670024
006800                                                                  00680024
006900 FILE SECTION.                                                    00690024
007000                                                                  00700024
007100                                                                  00710024
007200 FD  IMPORT-PO-AGING-REPORT-FILE                                  00720024
007300     RECORDING MODE IS F                                          00730024
007400     LABEL RECORDS ARE STANDARD                                   00740024
007500     RECORD CONTAINS 100 CHARACTERS                               00750024
007600     BLOCK CONTAINS 0 RECORDS                                     00760024
007700     DATA RECORD IS IMPORT-PO-AGING-REPORT-FILE.                  00770024
007800                                                                  00780024
007900 01  IMPORT-PO-AGING-REPORT-RECORD                                00790024
008000                                        PIC  X(100).              00800024
008100                                                                  00810024
008200                                                                  00820024
008300 FD  IMPORT-PO-AGING-REPORT                                       00830024
008400     RECORDING MODE IS F                                          00840024
008500     LABEL RECORDS ARE STANDARD                                   00850024
008600     RECORD CONTAINS 200 CHARACTERS                               00860024
008700     BLOCK CONTAINS 0 RECORDS                                     00870024
008800     DATA RECORD IS IMPORT-PO-AGING-LINE.                         00880024
008900                                                                  00890024
009000 01  IMPORT-PO-AGING-LINE               PIC  X(200).              00900024
009100                                                                  00910024
009200     EJECT                                                        00920024
009300                                                                  00930024
009400 WORKING-STORAGE SECTION.                                         00940024
009500                                                                  00950024
009600 01  PROGRAM-CONSTANTS.                                           00960024
009700     05  PC-PROGRAM-NAME                PIC  X(08)                00970024
009800                                               VALUE 'APKRP215'.  00980024
009900                                                                  00990024
010000 01  PV-READ-COUNTERS.                                            01000024
010100     05  PV-READ-ALL-CNT                PIC  9(08)  VALUE ZEROES. 01010024
010200     05  PV-READ-BASIS-CNT              PIC  9(08)  VALUE ZEROES. 01020024
010300     05  PV-READ-LIFUNG-CNT             PIC  9(08)  VALUE ZEROES. 01030025
010400     05  PV-READ-NON-LIFUNG-CNT         PIC  9(08)  VALUE ZEROES. 01040025
010500                                                                  01050024
010600 01  PV-REPORT-CONTROLS.                                          01060024
010700     05  PV-REPORT-REC                  PIC  X(132) VALUE SPACES. 01070024
010800     05  PV-LINE-SKIP                   PIC S999    VALUE ZEROES. 01080024
010900     05  PV-LINES-PER-PAGE              PIC S999    VALUE +0.     01090024
011000     05  PC-LINES-PER-PAGE-MAX          PIC S999    VALUE +60.    01100024
011100     05  PV-PAGE-COUNT                  PIC S9(05)  VALUE ZEROES. 01110024
011200                                                                  01120024
011300 01  PROGRAM-SWITCHES.                                            01130024
011400                                                                  01140024
011500     05  PS-PO-AGING-EOF-SWT            PIC  X      VALUE ' '.    01150024
011600         88  PS-AGING-EOF-YES                       VALUE 'Y'.    01160024
011700         88  PS-AGING-EOF-NO                        VALUE 'N'.    01170024
011800                                                                  01180024
011900     05  PS-PO-NO-RECORD-SWT            PIC  X      VALUE ' '.    01190024
012000         88  PS-NO-RECORD-YES                       VALUE 'Y'.    01200024
012100         88  PS-NO-RECORD-NO                        VALUE 'N'.    01210024
012200                                                                  01220024
012300 01  PROGRAM-VARIABLES.                                           01230024
012400                                                                  01240024
012500     05  PV-CURRENT-DATE.                                         01250024
012600         10  PV-CURRENT-CENTURY         PIC  9(02)  VALUE ZEROS.  01260024
012700         10  PV-CURRENT-YEAR            PIC  9(02)  VALUE ZEROS.  01270024
012800         10  PV-CURRENT-MONTH           PIC  9(02)  VALUE ZEROS.  01280024
012900         10  PV-CURRENT-DAY             PIC  9(02)  VALUE ZEROS.  01290024
013000                                                                  01300024
013100     05  PV-CURRENT-TIME.                                         01310024
013200         10  PV-CURRENT-HOUR            PIC  9(02)  VALUE ZEROES. 01320024
013300         10  PV-CURRENT-MINUTE          PIC  9(02)  VALUE ZEROES. 01330024
013400         10  FILLER                     PIC  9(02)  VALUE ZEROES. 01340024
013500                                                                  01350024
013600     05  PV-HOLD-VND-NBR                PIC  X(09)  VALUE SPACES. 01360024
013700     05  PV-HOLD-VND-NME                PIC  X(30)  VALUE SPACES. 01370024
013800                                                                  01380024
013900     EJECT                                                        01390024
014000                                                                  01400024
014100****************************************************************  01410000
014200*     TOTAL  LINE COUNTERS FOR COLBY VERIFIED ACCOUNTS         *  01420000
014300****************************************************************  01430000
014400                                                                  01440000
014500 01  PV-VER-TAMTS-LIFUNG          COMP-3.                         01450025
014600                                                                  01460024
014700     05  PV-VER-TAMTS-LIFUNG-0014       PIC S9(05)  VALUE ZEROES. 01470025
014800     05  PV-VER-TAMTS-LIFUNG-1530       PIC S9(05)  VALUE ZEROES. 01480025
014900     05  PV-VER-TAMTS-LIFUNG-3160       PIC S9(05)  VALUE ZEROES. 01490025
015000     05  PV-VER-TAMTS-LIFUNG-6190       PIC S9(05)  VALUE ZEROES. 01500025
015100     05  PV-VER-TAMTS-LIFUNG-90120      PIC S9(05)  VALUE ZEROES. 01510025
015200     05  PV-VER-TAMTS-LIFUNG-00120      PIC S9(05)  VALUE ZEROES. 01520025
015300                                                                  01530024
015400****************************************************************  01540000
015500*     TOTAL  LINE COUNTERS FOR COLBY AGING OTB  PERIODS.          01550024
015600****************************************************************  01560000
015700                                                                  01570024
015800 01  PV-OTB-TDTE-LIFUNG          COMP-3.                          01580025
015900                                                                  01590024
016000     05  PV-OTB-TDTE-LIFUNG-FUTURE      PIC  S9(05) VALUE ZEROES. 01600025
016100     05  PV-OTB-TDTE-LIFUNG-CURRENT     PIC  S9(05) VALUE ZEROES. 01610025
016200     05  PV-OTB-TDTE-LIFUNG-PERIOD-1    PIC  S9(05) VALUE ZEROES. 01620025
016300     05  PV-OTB-TDTE-LIFUNG-PERIOD-2    PIC  S9(05) VALUE ZEROES. 01630025
016400     05  PV-OTB-TDTE-LIFUNG-PERIOD-3    PIC  S9(05) VALUE ZEROES. 01640025
016500     05  PV-OTB-TDTE-LIFUNG-PERIOD-4    PIC  S9(05) VALUE ZEROES. 01650025
016600                                                                  01660024
016700     EJECT                                                        01670024
016800                                                                  01680024
016900****************************************************************  01690024
017000*     TOTAL  LINE COUNTERS FOR NON-COLBY VERIFIED ACCOUNTS        01700024
017100****************************************************************  01710024
017200                                                                  01720024
017300 01  PV-VER-TAMTS-NONLIFUNG      COMP-3.                          01730025
017400                                                                  01740024
017500     05  PV-VER-TAMTS-NONLIFUNG-0014   PIC S9(05)  VALUE ZEROES.  01750025
017600     05  PV-VER-TAMTS-NONLIFUNG-1530   PIC S9(05)  VALUE ZEROES.  01760025
017700     05  PV-VER-TAMTS-NONLIFUNG-3160   PIC S9(05)  VALUE ZEROES.  01770025
017800     05  PV-VER-TAMTS-NONLIFUNG-6190   PIC S9(05)  VALUE ZEROES.  01780025
017900     05  PV-VER-TAMTS-NONLIFUNG-90120  PIC S9(05)  VALUE ZEROES.  01790025
018000     05  PV-VER-TAMTS-NONLIFUNG-00120  PIC S9(05)  VALUE ZEROES.  01800025
018100                                                                  01810024
018200****************************************************************  01820000
018300*     TOTAL  LINE COUNTERS FOR NON-COLBY AGING OTB  PERIODS.      01830024
018400****************************************************************  01840000
018500                                                                  01850024
018600                                                                  01860024
018700 01  PV-OTB-TDTE-NONLIFUNG       COMP-3.                          01870025
018800                                                                  01880024
018900     05  PV-OTB-TDTE-NONLIFUNG-FUTURE   PIC  S9(05) VALUE ZEROES. 01890025
019000     05  PV-OTB-TDTE-NONLIFUNG-CURRENT  PIC  S9(05) VALUE ZEROES. 01900025
019100     05  PV-OTB-TDTE-NONLIFUNG-PERIOD-1 PIC S9(05) VALUE ZEROES.  01910025
019200     05  PV-OTB-TDTE-NONLIFUNG-PERIOD-2 PIC S9(05) VALUE ZEROES.  01920025
019300     05  PV-OTB-TDTE-NONLIFUNG-PERIOD-3 PIC S9(05) VALUE ZEROES.  01930025
019400     05  PV-OTB-TDTE-NONLIFUNG-PERIOD-4 PIC S9(05) VALUE ZEROES.  01940025
019500                                                                  01950024
019600     EJECT                                                        01960024
019700                                                                  01970024
019800****************************************************************  01980024
019900*     TOTAL  LINE COUNTERS FOR ALL VERIFIED ACCOUNTS              01990024
020000****************************************************************  02000024
020100                                                                  02010024
020200 01  PV-VER-TAMTS-ALL-ACCOUNTS    COMP-3.                         02020024
020300                                                                  02030024
020400     05  PV-VER-TAMTS-ALL-ACCTS-0014    PIC S9(05)  VALUE ZEROES. 02040024
020500     05  PV-VER-TAMTS-ALL-ACCTS-1530    PIC S9(05)  VALUE ZEROES. 02050024
020600     05  PV-VER-TAMTS-ALL-ACCTS-3160    PIC S9(05)  VALUE ZEROES. 02060024
020700     05  PV-VER-TAMTS-ALL-ACCTS-6190    PIC S9(05)  VALUE ZEROES. 02070024
020800     05  PV-VER-TAMTS-ALL-ACCTS-90120   PIC S9(05)  VALUE ZEROES. 02080024
020900     05  PV-VER-TAMTS-ALL-ACCTS-00120   PIC S9(05)  VALUE ZEROES. 02090024
021000                                                                  02100024
021100****************************************************************  02110000
021200*     TOTAL  LINE COUNTERS FOR ALL AGING OTB  PERIODS.            02120024
021300****************************************************************  02130000
021400                                                                  02140024
021500 01  PV-OTB-TDTE-ALL-PERIODS      COMP-3.                         02150024
021600                                                                  02160024
021700     05  PV-OTB-TDTE-ALL-FUTURE         PIC  S9(05) VALUE ZEROES. 02170024
021800     05  PV-OTB-TDTE-ALL-CURRENT        PIC  S9(05) VALUE ZEROES. 02180024
021900     05  PV-OTB-TDTE-ALL-PERIOD-1       PIC  S9(05) VALUE ZEROES. 02190024
022000     05  PV-OTB-TDTE-ALL-PERIOD-2       PIC  S9(05) VALUE ZEROES. 02200024
022100     05  PV-OTB-TDTE-ALL-PERIOD-3       PIC  S9(05) VALUE ZEROES. 02210024
022200     05  PV-OTB-TDTE-ALL-PERIOD-4       PIC  S9(05) VALUE ZEROES. 02220024
022300                                                                  02230024
022400     EJECT                                                        02240024
022500                                                                  02250024
022600 01  PV-OTB-DATE-PERIOD.                                          02260024
022700     05  PV-OTB-PERIOD-DATE             PIC  9(04)  VALUE ZEROES. 02270024
022800     05  PV-OTB-PERIOD-PERIOD           PIC  9(02)  VALUE ZEROES. 02280024
022900 01  PV-OTB-DATE-PERIOD-CHAR     REDEFINES PV-OTB-DATE-PERIOD     02290024
023000                                        PIC  9(06).               02300024
023100                                                                  02310024
023200     EJECT                                                        02320024
023300                                                                  02330024
023400****************************************************************  02340024
023500*    STANDARD        PERIOD DATA TABLE                         *  02350024
023600****************************************************************  02360024
023700                                                                  02370024
023800 01  PT-PERIOD-TABLE-NAMES.                                       02380024
023900     05  FILLER                       PIC X(09) VALUE 'JANUARY  '.02390024
024000     05  FILLER                       PIC X(09) VALUE 'FEBRUARY '.02400024
024100     05  FILLER                       PIC X(09) VALUE 'MARCH    '.02410024
024200     05  FILLER                       PIC X(09) VALUE 'APRIL    '.02420024
024300     05  FILLER                       PIC X(09) VALUE 'MAY      '.02430024
024400     05  FILLER                       PIC X(09) VALUE 'JUNE     '.02440024
024500     05  FILLER                       PIC X(09) VALUE 'JULY     '.02450024
024600     05  FILLER                       PIC X(09) VALUE 'AUGUST   '.02460024
024700     05  FILLER                       PIC X(09) VALUE 'SEPTEMBER'.02470024
024800     05  FILLER                       PIC X(09) VALUE 'OCTOBER  '.02480024
024900     05  FILLER                       PIC X(09) VALUE 'NOVEMBER '.02490024
025000     05  FILLER                       PIC X(09) VALUE 'DECEMBER '.02500024
025100                                                                  02510024
025200 01  PT-PERIOD-TBL                                                02520024
025300                       REDEFINES PT-PERIOD-TABLE-NAMES.           02530024
025400                                                                  02540024
025500     05  PT-PERIOD-ENTRY         OCCURS  12                       02550024
025600                                     INDEXED BY PERIOD-IDX.       02560024
025700         10  PT-PERIOD-FULL-PRD-NAME.                             02570024
025800             20  PT-PERIOD-PRD-ABBRV-3  PIC X(3).                 02580024
025900             20  FILLER                 PIC X(6).                 02590024
026000                                                                  02600024
026100     EJECT                                                        02610000
026200                                                                  02620000
026300*----------------------------------------------------------------*02630000
026400*  INPUT RECORD LAYOUT                                            02640000
026500*----------------------------------------------------------------*02650000
026600                                                                  02660000
026700     COPY APRD037.                                                02670000
026800                                                                  02680000
026900     EJECT                                                        02690000
027000                                                                  02700000
027100*----------------------------------------------------------------*02710000
027200*  STANDARD HEADER LAYOUT                                         02720000
027300*----------------------------------------------------------------*02730000
027400                                                                  02740000
027500     COPY DPWS200O.                                               02750023
027600                                                                  02760000
027700     EJECT                                                        02770000
027800                                                                  02780000
027900*----------------------------------------------------------------*02790000
028000*  HEADER PRINT REPORT LAYOUT                                     02800024
028100*----------------------------------------------------------------*02810000
028200                                                                  02820024
028300 01  H2-HEADER2.                                                  02830024
028400     05  FILLER                         PIC  X(60)  VALUE SPACE.  02840024
028500     05  H2-TITLE                       PIC  X(45)  VALUE         02850024
028600         'IMPORT PURCHASE ORDERS W / VERIFIED RECEIPTS '.         02860024
028700     05  FILLER                         PIC  X(35)  VALUE         02870024
028800         'AGED BY RECEIPT DATE AND OTB PERIOD'.                   02880024
028900     05  FILLER                         PIC  X(60)  VALUE SPACE.  02890024
029000                                                                  02900024
029100     EJECT                                                        02910024
029200                                                                  02920024
029300 01  H3-HEADER3.                                                  02930024
029400     05  FILLER                         PIC  X(14)  VALUE SPACES. 02940024
029500     05  FILLER                         PIC  X(11)  VALUE         02950024
029600             'VENDOR NAME'.                                       02960024
029700     05  FILLER                         PIC  X(11)  VALUE SPACES. 02970024
029800     05  FILLER                         PIC  X(08)  VALUE         02980024
029900             'VERIFIED'.                                          02990024
030000     05  FILLER                         PIC  X(12)  VALUE SPACES. 03000024
030100     05  FILLER                         PIC  X(09)  VALUE         03010024
030200             '0-14 DAYS'.                                         03020024
030300     05  FILLER                         PIC  X(14)  VALUE SPACE.  03030024
030400     05  FILLER                         PIC  X(10)  VALUE         03040024
030500             '15-30 DAYS'.                                        03050024
030600     05  FILLER                         PIC  X(14)  VALUE SPACES. 03060024
030700     05  FILLER                         PIC  X(10)  VALUE         03070024
030800             '31-60 DAYS'.                                        03080024
030900     05  FILLER                         PIC  X(15)  VALUE SPACES. 03090024
031000     05  FILLER                         PIC  X(10)  VALUE         03100024
031100             '61-90 DAYS'.                                        03110024
031200     05  FILLER                         PIC  X(14)  VALUE SPACES. 03120024
031300     05  FILLER                         PIC  X(11)  VALUE         03130024
031400             '91-120 DAYS'.                                       03140024
031500     05  FILLER                         PIC  X(15)  VALUE SPACE.  03150024
031600     05  FILLER                         PIC  X(09)  VALUE         03160024
031700             '>120 DAYS'.                                         03170024
031800     05  FILLER                         PIC  X(13)  VALUE SPACE.  03180024
031900                                                                  03190024
032000     EJECT                                                        03200024
032100                                                                  03210024
032200 01  H4-HEADER4.                                                  03220024
032300     05  FILLER                         PIC  X(36)  VALUE SPACES. 03230024
032400     05  FILLER                         PIC  X(17)  VALUE         03240024
032500             'OTB        FUTURE'.                                 03250024
032600     05  FILLER                         PIC  X(15)  VALUE SPACES. 03260024
032700     05  H4-CURRENT-PERIOD              PIC  X(03)  VALUE SPACES. 03270024
032800     05  FILLER                         PIC  X(01)  VALUE SPACE.  03280024
032900     05  H4-YR-CURRENT                  PIC  9(04)  VALUE ZEROES. 03290024
033000     05  FILLER                         PIC  X(16)  VALUE SPACES. 03300024
033100     05  H4-PERIOD-1                    PIC  X(03)  VALUE SPACES. 03310024
033200     05  FILLER                         PIC  X(01)  VALUE SPACE.  03320024
033300     05  H4-YR-1                        PIC  9(04)  VALUE ZEROES. 03330024
033400     05  FILLER                         PIC  X(16)  VALUE SPACES. 03340024
033500     05  H4-PERIOD-2                    PIC  X(03)  VALUE SPACES. 03350024
033600     05  FILLER                         PIC  X(01)  VALUE SPACE.  03360024
033700     05  H4-YR-2                        PIC  9(04)  VALUE ZEROES. 03370024
033800     05  FILLER                         PIC  X(16)  VALUE SPACES. 03380024
033900     05  H4-PERIOD-3                    PIC  X(03)  VALUE SPACES. 03390024
034000     05  FILLER                         PIC  X(01)  VALUE SPACE.  03400024
034100     05  H4-YR-3                        PIC  9(04)  VALUE ZEROES. 03410024
034200     05  FILLER                         PIC  X(17)  VALUE SPACES. 03420024
034300     05  FILLER                         PIC  X(01)  VALUE '<'.    03430024
034400     05  H4-PERIOD-4                    PIC  X(03)  VALUE SPACES. 03440024
034500     05  FILLER                         PIC  X(01)  VALUE SPACE.  03450024
034600     05  H4-YR-4                        PIC  9(04)  VALUE ZEROES. 03460024
034700     05  FILLER                         PIC  X(26)  VALUE SPACES. 03470024
034800                                                                  03480024
034900     EJECT                                                        03490024
035000                                                                  03500024
035100*----------------------------------------------------------------*03510024
035200*  DETAIL PRINT AGING REPORT LAYOUT  DETAIL LINE VERIFIED         03520024
035300*----------------------------------------------------------------*03530024
035400                                                                  03540024
035500 01  D1-DETAIL1-VERIFIED.                                         03550024
035600     05  FILLER                         PIC  X(14)  VALUE SPACES. 03560024
035700     05  D1-VND-NME                     PIC  X(30)  VALUE SPACES. 03570024
035800     05  FILLER                         PIC  X(15)  VALUE SPACE.  03580024
035900     05  D1-VER-AMT-0014                PIC  ZZ,ZZ9 VALUE ZEROES. 03590024
036000     05  FILLER                         PIC  X(18)  VALUE SPACE.  03600024
036100     05  D1-VER-AMT-1530                PIC  ZZ,ZZ9 VALUE ZEROES. 03610024
036200     05  FILLER                         PIC  X(18)  VALUE SPACE.  03620024
036300     05  D1-VER-AMT-3160                PIC  ZZ,ZZ9 VALUE ZEROES. 03630024
036400     05  FILLER                         PIC  X(19)  VALUE SPACES. 03640024
036500     05  D1-VER-AMT-6190                PIC  ZZ,ZZ9 VALUE ZEROES. 03650024
036600     05  FILLER                         PIC  X(19)  VALUE SPACES. 03660024
036700     05  D1-VER-AMT-90120               PIC  ZZ,ZZ9 VALUE ZEROES. 03670024
036800     05  FILLER                         PIC  X(18)  VALUE SPACES. 03680024
036900     05  D1-VER-AMT-00120               PIC  ZZ,ZZ9 VALUE ZEROES. 03690024
037000     05  FILLER                         PIC  X(13)  VALUE SPACES. 03700024
037100                                                                  03710024
037200     EJECT                                                        03720024
037300                                                                  03730024
037400*----------------------------------------------------------------*03740024
037500*  DETAIL PRINT AGING REPORT LAYOUT  DETAIL LINE OTB - PERIOD     03750024
037600*----------------------------------------------------------------*03760024
037700                                                                  03770024
037800 01  D2-DETAIL2-OTB.                                              03780024
037900     05  FILLER                         PIC  X(47)  VALUE SPACES. 03790024
038000     05  D2-OTB-DTE-FUTURE              PIC  ZZ,ZZ9 VALUE ZEROES. 03800024
038100     05  FILLER                         PIC  X(17)  VALUE SPACE.  03810024
038200     05  D2-OTB-DTE-CURRENT             PIC  ZZ,ZZ9 VALUE ZEROES. 03820024
038300     05  FILLER                         PIC  X(18)  VALUE SPACE.  03830024
038400     05  D2-OTB-DTE-PERIOD-1            PIC  ZZ,ZZ9 VALUE ZEROES. 03840024
038500     05  FILLER                         PIC  X(18)  VALUE SPACE.  03850024
038600     05  D2-OTB-DTE-PERIOD-2            PIC  ZZ,ZZ9 VALUE ZEROES. 03860024
038700     05  FILLER                         PIC  X(18)  VALUE SPACES. 03870024
038800     05  D2-OTB-DTE-PERIOD-3            PIC  ZZ,ZZ9 VALUE ZEROES. 03880024
038900     05  FILLER                         PIC  X(20)  VALUE SPACES. 03890024
039000     05  D2-OTB-DTE-PERIOD-4            PIC  ZZ,ZZ9 VALUE ZEROES. 03900024
039100     05  FILLER                         PIC  X(26)  VALUE SPACES. 03910024
039200                                                                  03920024
039300     EJECT                                                        03930024
039400                                                                  03940024
039500*----------------------------------------------------------------*03950024
039600*  TOTAL  PRINT REPORT LAYOUT NONE COLBY VERIFIED TOTALS          03960024
039700*----------------------------------------------------------------*03970024
039800                                                                  03980024
039900 01  T1-TOTAL1-NONE-LIFUNG-VERIFIED.                              03990025
040000     05  FILLER                         PIC  X(14)  VALUE SPACES. 04000024
040100     05  FILLER                         PIC  X(27)  VALUE         04010024
040200             'NON-LI & FUNG VENDOR TOTALS'.                       04020024
040300     05  FILLER                         PIC  X(18)  VALUE SPACES. 04030024
040400     05  T1-VER-AMT-0014                PIC  ZZ,ZZ9 VALUE ZEROES. 04040024
040500     05  FILLER                         PIC  X(18)  VALUE SPACE.  04050024
040600     05  T1-VER-AMT-1530                PIC  ZZ,ZZ9 VALUE ZEROES. 04060024
040700     05  FILLER                         PIC  X(18)  VALUE SPACE.  04070024
040800     05  T1-VER-AMT-3160                PIC  ZZ,ZZ9 VALUE ZEROES. 04080024
040900     05  FILLER                         PIC  X(19)  VALUE SPACES. 04090024
041000     05  T1-VER-AMT-6190                PIC  ZZ,ZZ9 VALUE ZEROES. 04100024
041100     05  FILLER                         PIC  X(19)  VALUE SPACES. 04110024
041200     05  T1-VER-AMT-90120               PIC  ZZ,ZZ9 VALUE ZEROES. 04120024
041300     05  FILLER                         PIC  X(18)  VALUE SPACES. 04130024
041400     05  T1-VER-AMT-00120               PIC  ZZ,ZZ9 VALUE ZEROES. 04140024
041500     05  FILLER                         PIC  X(13)  VALUE SPACES. 04150024
041600                                                                  04160024
041700*----------------------------------------------------------------*04170024
041800*  TOTAL  PRINT REPORT LAYOUT NONE COLBY OTB AGING PERIODS TOTALS 04180025
041900*----------------------------------------------------------------*04190024
042000                                                                  04200024
042100 01  T2-TOTAL2-NONE-LIFUNG-OTB.                                   04210025
042200     05  FILLER                         PIC  X(47)  VALUE SPACES. 04220024
042300     05  T2-OTB-DTE-FUTURE              PIC  ZZ,ZZ9 VALUE ZEROES. 04230024
042400     05  FILLER                         PIC  X(17)  VALUE SPACE.  04240024
042500     05  T2-OTB-DTE-CURRENT             PIC  ZZ,ZZ9 VALUE ZEROES. 04250024
042600     05  FILLER                         PIC  X(18)  VALUE SPACE.  04260024
042700     05  T2-OTB-DTE-PERIOD-1            PIC  ZZ,ZZ9 VALUE ZEROES. 04270024
042800     05  FILLER                         PIC  X(18)  VALUE SPACE.  04280024
042900     05  T2-OTB-DTE-PERIOD-2            PIC  ZZ,ZZ9 VALUE ZEROES. 04290024
043000     05  FILLER                         PIC  X(18)  VALUE SPACES. 04300024
043100     05  T2-OTB-DTE-PERIOD-3            PIC  ZZ,ZZ9 VALUE ZEROES. 04310024
043200     05  FILLER                         PIC  X(20)  VALUE SPACES. 04320024
043300     05  T2-OTB-DTE-PERIOD-4            PIC  ZZ,ZZ9 VALUE ZEROES. 04330024
043400     05  FILLER                         PIC  X(26)  VALUE SPACES. 04340024
043500                                                                  04350024
043600     EJECT                                                        04360024
043700                                                                  04370024
043800*----------------------------------------------------------------*04380024
043900*  TOTAL  PRINT REPORT LAYOUT ALL VERIFIED TOTALS                 04390024
044000*----------------------------------------------------------------*04400024
044100                                                                  04410024
044200 01  T3-TOTAL3-ALL-VERIFIED.                                      04420024
044300     05  FILLER                         PIC  X(14)  VALUE SPACES. 04430024
044400     05  FILLER                         PIC  X(17)  VALUE         04440024
044500             'ALL VENDOR TOTALS'.                                 04450024
044600     05  FILLER                         PIC  X(28)  VALUE SPACES. 04460024
044700     05  T3-VER-AMT-0014                PIC  ZZ,ZZ9 VALUE ZEROES. 04470024
044800     05  FILLER                         PIC  X(18)  VALUE SPACE.  04480024
044900     05  T3-VER-AMT-1530                PIC  ZZ,ZZ9 VALUE ZEROES. 04490024
045000     05  FILLER                         PIC  X(18)  VALUE SPACE.  04500024
045100     05  T3-VER-AMT-3160                PIC  ZZ,ZZ9 VALUE ZEROES. 04510024
045200     05  FILLER                         PIC  X(19)  VALUE SPACES. 04520024
045300     05  T3-VER-AMT-6190                PIC  ZZ,ZZ9 VALUE ZEROES. 04530024
045400     05  FILLER                         PIC  X(19)  VALUE SPACES. 04540024
045500     05  T3-VER-AMT-90120               PIC  ZZ,ZZ9 VALUE ZEROES. 04550024
045600     05  FILLER                         PIC  X(18)  VALUE SPACES. 04560024
045700     05  T3-VER-AMT-00120               PIC  ZZ,ZZ9 VALUE ZEROES. 04570024
045800     05  FILLER                         PIC  X(13)  VALUE SPACES. 04580024
045900                                                                  04590024
046000*----------------------------------------------------------------*04600024
046100*  TOTAL  PRINT REPORT LAYOUT ALL OTB AGING PERIODS TOTALS        04610024
046200*----------------------------------------------------------------*04620024
046300                                                                  04630024
046400 01  T4-TOTAL4-ALL-OTB.                                           04640024
046500     05  FILLER                         PIC  X(47)  VALUE SPACES. 04650024
046600     05  T4-OTB-DTE-FUTURE              PIC  ZZ,ZZ9 VALUE ZEROES. 04660024
046700     05  FILLER                         PIC  X(17)  VALUE SPACE.  04670024
046800     05  T4-OTB-DTE-CURRENT             PIC  ZZ,ZZ9 VALUE ZEROES. 04680024
046900     05  FILLER                         PIC  X(18)  VALUE SPACE.  04690024
047000     05  T4-OTB-DTE-PERIOD-1            PIC  ZZ,ZZ9 VALUE ZEROES. 04700024
047100     05  FILLER                         PIC  X(18)  VALUE SPACE.  04710024
047200     05  T4-OTB-DTE-PERIOD-2            PIC  ZZ,ZZ9 VALUE ZEROES. 04720024
047300     05  FILLER                         PIC  X(18)  VALUE SPACES. 04730024
047400     05  T4-OTB-DTE-PERIOD-3            PIC  ZZ,ZZ9 VALUE ZEROES. 04740024
047500     05  FILLER                         PIC  X(20)  VALUE SPACES. 04750024
047600     05  T4-OTB-DTE-PERIOD-4            PIC  ZZ,ZZ9 VALUE ZEROES. 04760024
047700     05  FILLER                         PIC  X(26)  VALUE SPACES. 04770024
047800                                                                  04780024
047900     EJECT                                                        04790024
048000                                                                  04800024
048100 01  END-OF-REPORT.                                               04810024
048200     05  FILLER                         PIC  X(87)  VALUE SPACES. 04820024
048300     05  FILLER                         PIC  X(25)  VALUE         04830024
048400         'E N D   O F   R E P O R T'.                             04840024
048500     05  FILLER                         PIC  X(88)  VALUE SPACES. 04850024
048600                                                                  04860024
048700                                                                  04870024
048800 01  UNDER-SCORE-LINE.                                            04880024
048900     05  FILLER                         PIC  X(200) VALUE ALL '_'.04890024
049000                                                                  04900024
049100     EJECT                                                        04910024
049200                                                                  04920024
049300*----------------------------------------------------------------*04930024
049400*  ABEND DATA AREAS                                               04940024
049500*----------------------------------------------------------------*04950024
049600                                                                  04960024
049700 01  ABEND-CODE                         PIC S9(4)   VALUE ZEROES  04970024
049800                                        COMP        SYNC.         04980024
049900                                                                  04990024
050000     88  AC-ANY-ERROR                               VALUE +4001   05000024
050100                                                    THRU  +4019.  05010024
050200                                                                  05020024
050300     88  AC-INVALID-KEY-WRITE                       VALUE +4001.  05030024
050400     88  AC-INVALID-KEY-READ                        VALUE +4002.  05040024
050500     88  AC-INVALID-CONTROL-CARD                    VALUE +4003.  05050024
050600     88  AC-TABLE-OVERFLOW                          VALUE +4004.  05060024
050700     88  AC-OPEN-FILE-ERROR                         VALUE +4005.  05070024
050800     88  AC-CLOSE-FILE-ERROR                        VALUE +4006.  05080024
050900     88  AC-SEQUENCE-ERROR                          VALUE +4007.  05090024
051000     88  AC-INVALID-DATA                            VALUE +4008.  05100024
051100     88  AC-INVALID-KEYPUNCH                        VALUE +4009.  05110024
051200     88  AC-INTERNAL-SORT-ERROR                     VALUE +4012.  05120024
051300     88  AC-DB2-ERROR                               VALUE +4013.  05130024
051400     88  AC-DATE-ERROR                              VALUE +4019.  05140024
051500                                                                  05150024
051600                                                                  05160024
051700 01  ABEND-AREAS.                                                 05170024
051800     05  AA-ABEND-LIT                   PIC  X(40)  VALUE         05180024
051900             '*****       ABEND'.                                 05190024
052000     05  AA-PROGRAM-LIT                 PIC  X(40)  VALUE         05200024
052100             '*****   PROGRAM: APKRP215'.                         05210024
052200     05  AA-PARAGRAPH-LIT.                                        05220024
052300         10  FILLER                     PIC  X(17)  VALUE         05230024
052400             '***** PARAGRAPH: '.                                 05240024
052500         10  AA-PARAGRAPH-NAME          PIC  X(35)  VALUE SPACES. 05250024
052600     05  AA-MESSAGE-LINE-1.                                       05260024
052700         10  FILLER                     PIC  X(06)  VALUE '*****'.05270024
052800         10  AA-MESSAGE-1               PIC  X(80)  VALUE SPACES. 05280024
052900     05  AA-MESSAGE-LINE-2.                                       05290024
053000         10  FILLER                     PIC  X(06)  VALUE '*****'.05300024
053100         10  AA-MESSAGE-2               PIC  X(80)  VALUE SPACES. 05310024
053200                                                                  05320024
053300     EJECT                                                        05330024
053400                                                                  05340024
053500 PROCEDURE DIVISION.                                              05350024
053600                                                                  05360024
053700 A100-MAIN.                                                       05370000
053800                                                                  05380000
053900     PERFORM B100-INITIALIZE.                                     05390000
054000                                                                  05400000
054100     PERFORM B200-PROCESS-AGING-REPORT-FILE                       05410000
054200         UNTIL PS-AGING-EOF-YES                                   05420000
054300                                                                  05430000
054400     IF PV-READ-ALL-CNT > ZEROES                                  05440024
054500         PERFORM B300-GRAND-TOTALS                                05450024
054600     END-IF.                                                      05460000
054700                                                                  05470000
054800     PERFORM B400-END-OF-PROGRAM.                                 05480000
054900                                                                  05490000
055000     GOBACK.                                                      05500000
055100                                                                  05510000
055200     EJECT                                                        05520000
055300                                                                  05530000
055400                                                                  05540000
055500 B100-INITIALIZE.                                                 05550000
055600                                                                  05560000
055700*----------------------------------------------------------------*05570000
055800*    INITIALIZATION PROCESSING                                   *05580000
055900*                                                                *05590000
056000*    - INTIALIZE LAYOUTS.                                        *05600000
056100*    - OPEN FILES.                                               *05610000
056200*    - FORMAT PAGE HEADINGS.                                     *05620000
056300*    - READ INPUT FILE. (PRIMARY READ)                            05630024
056400*    - READ INPUT FILE. (SECONDAR READ FIRST REAL DETAIL RECORD)  05640024
056500*----------------------------------------------------------------*05650000
056600                                                                  05660000
056700     DISPLAY '**  APKRP215  (START RUN      )  **'.               05670000
056800                                                                  05680000
056900     OPEN INPUT  IMPORT-PO-AGING-REPORT-FILE                      05690000
057000          OUTPUT IMPORT-PO-AGING-REPORT.                          05700000
057100                                                                  05710000
057200     INITIALIZE         PV-VER-TAMTS-LIFUNG                       05720025
057300                        PV-OTB-TDTE-LIFUNG                        05730025
057400                        PV-VER-TAMTS-NONLIFUNG                    05740025
057500                        PV-OTB-TDTE-NONLIFUNG                     05750025
057600                        PV-VER-TAMTS-ALL-ACCOUNTS                 05760024
057700                        PV-OTB-TDTE-ALL-PERIODS                   05770024
057800                        PV-READ-COUNTERS.                         05780024
057900                                                                  05790024
058000*    FORMAT HEADING DATA                                          05800000
058100                                                                  05810000
058200     MOVE FUNCTION CURRENT-DATE      TO PV-CURRENT-DATE.          05820000
058300                                                                  05830000
058400     MOVE PV-CURRENT-YEAR            TO DP200O-RUN-YEAR.          05840023
058500     MOVE PV-CURRENT-MONTH           TO DP200O-RUN-MONTH.         05850023
058600     MOVE PV-CURRENT-DAY             TO DP200O-RUN-DAY.           05860023
058700                                                                  05870024
058800     ACCEPT PV-CURRENT-TIME FROM TIME.                            05880024
058900                                                                  05890024
059000     MOVE PV-CURRENT-HOUR            TO DP200O-RUN-HOUR.          05900024
059100     MOVE PV-CURRENT-MINUTE          TO DP200O-RUN-MINUTE.        05910024
059200     MOVE PC-PROGRAM-NAME            TO DP200O-PROGRAM-NAME.      05920024
059300                                                                  05930000
059400     MOVE 1                          TO DP200O-REPORT-NUMBER.     05940024
059500                                                                  05950024
059600     SET PS-AGING-EOF-NO TO TRUE.                                 05960024
059700     SET PS-NO-RECORD-NO TO TRUE.                                 05970024
059800                                                                  05980024
059900*    PERFORM INITIAL READ OF INPUT FILE FOR THE BASIS INFORMATION.05990024
060000                                                                  06000024
060100     PERFORM R100-READ-INPUT.                                     06010024
060200                                                                  06020024
060300     IF PS-AGING-EOF-YES                                          06030024
060400         DISPLAY ' NO RECORDS TO PROCESS. EMPTY INPUT DATASET'    06040024
060500         SET PS-NO-RECORD-YES TO TRUE                             06050024
060600     END-IF.                                                      06060024
060700                                                                  06070024
060800     IF PS-AGING-EOF-NO AND  NOT AP037-BASIS-INFO-RECORD          06080024
060900         MOVE 'B100-INITIALIZE' TO AA-PARAGRAPH-NAME              06090024
061000         MOVE 'FIRST RECORD READ NOT = TO '                       06100024
061100                                          TO AA-MESSAGE-1         06110024
061200         MOVE 'AP037-BASIS-INFO-RECORD'   TO AA-MESSAGE-2         06120024
061300         SET AC-INVALID-DATA   TO TRUE                            06130024
061400         PERFORM Z998-ABEND                                       06140024
061500     END-IF.                                                      06150024
061600                                                                  06160024
061700     PERFORM H100-BUILD-HEADING-LINE-4.                           06170024
061800                                                                  06180024
061900     PERFORM X100-WRITE-HEADINGS.                                 06190024
062000                                                                  06200024
062100*    PERFORM 2 ND. FILE READ FOR 1ST. VALID DETAIL RECORD.        06210024
062200                                                                  06220024
062300     PERFORM R100-READ-INPUT.                                     06230024
062400                                                                  06240024
062500     EJECT                                                        06250024
062600                                                                  06260024
062700*----------------------------------------------------------------*06270024
062800*    PROCESS THE IMPORT PO AGING REPORT DATA FILE                *06280024
062900*                                                                *06290024
063000*    - READ THE AGING EXTRACT FILE.                               06300024
063100*    - PROCESS THE COLBY RECORDS TYPE 2                           06310025
063200*    - PROCESS THE NON-COLBY RECORDS TYPE 3                       06320025
063300*    - GENERATE THE DETAIL PRINT LINES.                          *06330024
063400*                                                                *06340024
063500*----------------------------------------------------------------*06350024
063600                                                                  06360024
063700 B200-PROCESS-AGING-REPORT-FILE.                                  06370024
063800                                                                  06380024
063900                                                                  06390024
064000     EVALUATE TRUE                                                06400024
064100                                                                  06410024
064200         WHEN AP037-AGING-INFO-RECORD                             06420024
064300             PERFORM D100-BUILD-NC-VER-DTL-LINE-1                 06430024
064400             PERFORM D200-NC-VER-DETAIL-TOTALS                    06440024
064500             PERFORM D300-BUILD-NC-OTB-DTL-LINE-2                 06450024
064600             PERFORM D400-NC-OTB-DETAIL-TOTALS                    06460024
064700             PERFORM W100-PRINT-DETAIL-LINES                      06470024
064800                                                                  06480024
064900         WHEN AP037-LIFUNG-AGING-RECORD                           06490024
065000             PERFORM D500-BUILD-CB-VER-DTL-LINE-1                 06500024
065100             PERFORM D600-CB-VER-DETAIL-TOTALS                    06510024
065200             PERFORM D700-BUILD-CB-OTB-DTL-LINE-2                 06520024
065300             PERFORM D800-CB-OTB-DETAIL-TOTALS                    06530024
065400             PERFORM W100-PRINT-DETAIL-LINES                      06540024
065500                                                                  06550024
065600         WHEN OTHER                                               06560024
065700             MOVE 'B200-PROCESS-AGING-REPORT-FILE' TO             06570024
065800                                           AA-PARAGRAPH-NAME      06580024
065900             MOVE 'AP037-RECOED-TYPE-CDE INVALID '                06590024
066000                                           TO AA-MESSAGE-1        06600024
066100             MOVE 'AP037 RECORD TYPE CODE '   TO AA-MESSAGE-2     06610024
066200             DISPLAY AP037-RECORD-TYPE-CDE                        06620024
066300             SET AC-INVALID-DATA  TO TRUE                         06630024
066400             PERFORM Z998-ABEND                                   06640024
066500                                                                  06650024
066600     END-EVALUATE.                                                06660024
066700                                                                  06670024
066800*    READ THE OTP EXTRACT FILE                                    06680024
066900                                                                  06690024
067000     PERFORM R100-READ-INPUT.                                     06700024
067100                                                                  06710024
067200     EJECT                                                        06720024
067300                                                                  06730024
067400****************************************************************  06740024
067500*    GENERATE THE FINAL TOTAL LINES FOR THE REPORT             *  06750024
067600****************************************************************  06760024
067700                                                                  06770024
067800 B300-GRAND-TOTALS.                                               06780024
067900                                                                  06790024
068000     IF PV-LINES-PER-PAGE > 50                                    06800024
068100         PERFORM X100-WRITE-HEADINGS                              06810024
068200     END-IF.                                                      06820024
068300                                                                  06830024
068400     INITIALIZE T1-TOTAL1-NONE-LIFUNG-VERIFIED                    06840025
068500                T2-TOTAL2-NONE-LIFUNG-OTB                         06850025
068600                T3-TOTAL3-ALL-VERIFIED                            06860024
068700                T4-TOTAL4-ALL-OTB.                                06870024
068800                                                                  06880024
068900*    LOAD AND WRITE FINAL TOTAL NON-COLBY VERIFIED LINE           06890024
069000                                                                  06900024
069100     MOVE PV-VER-TAMTS-NONLIFUNG-0014 TO T1-VER-AMT-0014.         06910025
069200     MOVE PV-VER-TAMTS-NONLIFUNG-1530 TO T1-VER-AMT-1530.         06920025
069300     MOVE PV-VER-TAMTS-NONLIFUNG-3160 TO T1-VER-AMT-3160.         06930025
069400     MOVE PV-VER-TAMTS-NONLIFUNG-6190 TO T1-VER-AMT-6190.         06940025
069500     MOVE PV-VER-TAMTS-NONLIFUNG-90120 TO T1-VER-AMT-90120.       06950025
069600     MOVE PV-VER-TAMTS-NONLIFUNG-00120 TO T1-VER-AMT-00120.       06960025
069700                                                                  06970024
069800     WRITE IMPORT-PO-AGING-LINE                                   06980024
069900            FROM T1-TOTAL1-NONE-LIFUNG-VERIFIED                   06990025
070000                AFTER ADVANCING 3 LINES.                          07000024
070100                                                                  07010024
070200                                                                  07020024
070300*    LOAD AND WRITE FINAL TOTAL NON-COLBY OTB AGING PERIOD LINE   07030024
070400                                                                  07040024
070500     MOVE PV-OTB-TDTE-NONLIFUNG-FUTURE  TO T2-OTB-DTE-FUTURE.     07050025
070600     MOVE PV-OTB-TDTE-NONLIFUNG-CURRENT TO T2-OTB-DTE-CURRENT.    07060025
070700     MOVE PV-OTB-TDTE-NONLIFUNG-PERIOD-1 TO T2-OTB-DTE-PERIOD-1.  07070025
070800     MOVE PV-OTB-TDTE-NONLIFUNG-PERIOD-2 TO T2-OTB-DTE-PERIOD-2.  07080025
070900     MOVE PV-OTB-TDTE-NONLIFUNG-PERIOD-3 TO T2-OTB-DTE-PERIOD-3.  07090025
071000     MOVE PV-OTB-TDTE-NONLIFUNG-PERIOD-4 TO T2-OTB-DTE-PERIOD-4.  07100025
071100                                                                  07110024
071200     WRITE IMPORT-PO-AGING-LINE                                   07120024
071300            FROM T2-TOTAL2-NONE-LIFUNG-OTB                        07130025
071400                AFTER ADVANCING 1 LINES.                          07140024
071500                                                                  07150024
071600*    LOAD AND WRITE FINAL TOTAL ALL ACCTS VERIFIED LINE           07160024
071700                                                                  07170024
071800     MOVE PV-VER-TAMTS-ALL-ACCTS-0014  TO T3-VER-AMT-0014.        07180024
071900     MOVE PV-VER-TAMTS-ALL-ACCTS-1530  TO T3-VER-AMT-1530.        07190024
072000     MOVE PV-VER-TAMTS-ALL-ACCTS-3160  TO T3-VER-AMT-3160.        07200024
072100     MOVE PV-VER-TAMTS-ALL-ACCTS-6190  TO T3-VER-AMT-6190.        07210024
072200     MOVE PV-VER-TAMTS-ALL-ACCTS-90120 TO T3-VER-AMT-90120.       07220024
072300     MOVE PV-VER-TAMTS-ALL-ACCTS-00120 TO T3-VER-AMT-00120.       07230024
072400                                                                  07240024
072500     WRITE IMPORT-PO-AGING-LINE                                   07250024
072600            FROM T3-TOTAL3-ALL-VERIFIED                           07260024
072700                AFTER ADVANCING 3 LINES.                          07270024
072800                                                                  07280024
072900                                                                  07290024
073000*    LOAD AND WRITE FINAL TOTAL ALL OTB AGING PERIOD LINE         07300024
073100                                                                  07310024
073200     MOVE PV-OTB-TDTE-ALL-FUTURE   TO T4-OTB-DTE-FUTURE.          07320024
073300     MOVE PV-OTB-TDTE-ALL-CURRENT  TO T4-OTB-DTE-CURRENT.         07330024
073400     MOVE PV-OTB-TDTE-ALL-PERIOD-1 TO T4-OTB-DTE-PERIOD-1.        07340024
073500     MOVE PV-OTB-TDTE-ALL-PERIOD-2 TO T4-OTB-DTE-PERIOD-2.        07350024
073600     MOVE PV-OTB-TDTE-ALL-PERIOD-3 TO T4-OTB-DTE-PERIOD-3.        07360024
073700     MOVE PV-OTB-TDTE-ALL-PERIOD-4 TO T4-OTB-DTE-PERIOD-4.        07370024
073800                                                                  07380024
073900     WRITE IMPORT-PO-AGING-LINE                                   07390024
074000            FROM T4-TOTAL4-ALL-OTB                                07400024
074100                AFTER ADVANCING 1 LINES.                          07410024
074200                                                                  07420024
074300     EJECT                                                        07430024
074400                                                                  07440024
074500 B400-END-OF-PROGRAM.                                             07450000
074600                                                                  07460000
074700*----------------------------------------------------------------*07470000
074800*    END OF PROGRAM                                              *07480000
074900*                                                                *07490000
075000*    - DISPLAY END OF PROGRAM MESSAGES                           *07500000
075100*                                                                *07510000
075200*    - CLOSE THE FILES.                                          *07520000
075300*----------------------------------------------------------------*07530000
075400                                                                  07540000
075500     WRITE IMPORT-PO-AGING-LINE                                   07550024
075600           FROM END-OF-REPORT                                     07560024
075700                AFTER ADVANCING +6.                               07570024
075800                                                                  07580000
075900     DISPLAY '********************************************'.      07590024
076000     DISPLAY '*' .                                                07600024
076100     DISPLAY '** END OF APKRP215 PROCESSING **'.                  07610024
076200     DISPLAY '*' .                                                07620024
076300     DISPLAY '** BASIS RECORDS READ    = ' PV-READ-BASIS-CNT.     07630024
076400     DISPLAY '*' .                                                07640024
076500     DISPLAY '** LI & FUNG RECORDS READ     = '                   07650026
076600                                           PV-READ-LIFUNG-CNT.    07660026
076700     DISPLAY '*' .                                                07670024
076800     DISPLAY '** NON-LI & FUNG RECORDS READ = '                   07680024
076900                                           PV-READ-NON-LIFUNG-CNT.07690025
077000     DISPLAY '*' .                                                07700024
077100     DISPLAY '********************************************'.      07710024
077200                                                                  07720024
077300     CLOSE IMPORT-PO-AGING-REPORT-FILE                            07730000
077400           IMPORT-PO-AGING-REPORT.                                07740000
077500                                                                  07750000
077600     EJECT                                                        07760000
077700                                                                  07770000
077800 D100-BUILD-NC-VER-DTL-LINE-1.                                    07780024
077900                                                                  07790024
078000***************************************************************** 07800024
078100*    BUILD THE NON - COLBY VERIFIED DETAIL PRINT LINE.            07810024
078200***************************************************************** 07820024
078300                                                                  07830024
078400     INITIALIZE D1-DETAIL1-VERIFIED.                              07840024
078500                                                                  07850024
078600     MOVE AP037-VENDOR-NAME   TO  D1-VND-NME.                     07860024
078700                                                                  07870024
078800     MOVE AP037-UNDER-15-QTY   TO  D1-VER-AMT-0014.               07880024
078900     MOVE AP037-UNDER-30-QTY   TO  D1-VER-AMT-1530.               07890024
079000     MOVE AP037-UNDER-60-QTY   TO  D1-VER-AMT-3160.               07900024
079100     MOVE AP037-UNDER-90-QTY   TO  D1-VER-AMT-6190.               07910024
079200     MOVE AP037-UNDER-120-QTY  TO  D1-VER-AMT-90120.              07920024
079300     MOVE AP037-OVER-120-QTY   TO  D1-VER-AMT-00120.              07930024
079400                                                                  07940024
079500     EJECT                                                        07950024
079600                                                                  07960024
079700                                                                  07970024
079800 D200-NC-VER-DETAIL-TOTALS.                                       07980024
079900                                                                  07990024
080000***************************************************************** 08000024
080100*    ADD   THE NON - COLBY VERIFIED DETAIL TOTALS TO VER   TOTALS 08010024
080200*                                                AND ALL   TOTALS 08020024
080300***************************************************************** 08030024
080400                                                                  08040024
080500                                                                  08050024
080600     ADD  AP037-UNDER-15-QTY   TO  PV-VER-TAMTS-NONLIFUNG-0014    08060025
080700                                   PV-VER-TAMTS-ALL-ACCTS-0014.   08070024
080800                                                                  08080024
080900     ADD  AP037-UNDER-30-QTY   TO  PV-VER-TAMTS-NONLIFUNG-1530    08090025
081000                                   PV-VER-TAMTS-ALL-ACCTS-1530.   08100024
081100                                                                  08110024
081200     ADD  AP037-UNDER-60-QTY   TO  PV-VER-TAMTS-NONLIFUNG-3160    08120025
081300                                   PV-VER-TAMTS-ALL-ACCTS-3160.   08130024
081400                                                                  08140024
081500     ADD  AP037-UNDER-90-QTY   TO  PV-VER-TAMTS-NONLIFUNG-6190    08150025
081600                                   PV-VER-TAMTS-ALL-ACCTS-6190.   08160024
081700                                                                  08170024
081800     ADD  AP037-UNDER-120-QTY  TO  PV-VER-TAMTS-NONLIFUNG-90120   08180025
081900                                   PV-VER-TAMTS-ALL-ACCTS-90120.  08190024
082000                                                                  08200024
082100     ADD  AP037-OVER-120-QTY  TO   PV-VER-TAMTS-NONLIFUNG-00120   08210025
082200                                   PV-VER-TAMTS-ALL-ACCTS-00120.  08220024
082300                                                                  08230024
082400     EJECT                                                        08240024
082500                                                                  08250024
082600                                                                  08260024
082700 D300-BUILD-NC-OTB-DTL-LINE-2.                                    08270024
082800                                                                  08280024
082900***************************************************************** 08290024
083000*    BUILD THE NON - COLBY OTB AGING PERIOD DETAIL PRINT LINE.    08300024
083100***************************************************************** 08310024
083200                                                                  08320024
083300     INITIALIZE D2-DETAIL2-OTB.                                   08330024
083400                                                                  08340024
083500     MOVE AP037-OTB-FUTURE-QTY  TO  D2-OTB-DTE-FUTURE.            08350024
083600     MOVE AP037-OTB-CURRENT-QTY TO  D2-OTB-DTE-CURRENT.           08360024
083700     MOVE AP037-OTB-1MONTH-QTY  TO  D2-OTB-DTE-PERIOD-1.          08370024
083800     MOVE AP037-OTB-2MONTH-QTY  TO  D2-OTB-DTE-PERIOD-2.          08380024
083900     MOVE AP037-OTB-3MONTH-QTY  TO  D2-OTB-DTE-PERIOD-3.          08390024
084000     MOVE AP037-OTB-OVER3-QTY   TO  D2-OTB-DTE-PERIOD-4.          08400024
084100                                                                  08410024
084200     EJECT                                                        08420024
084300                                                                  08430024
084400                                                                  08440024
084500 D400-NC-OTB-DETAIL-TOTALS.                                       08450024
084600                                                                  08460024
084700***************************************************************** 08470024
084800*    ADD   THE NON - COLBY OTB AGING PERIOD DETAIL TOTALS TO      08480024
084900*                                                THE OTB TOTALS   08490024
085000*                                            AND ALL OTB TOTALS   08500024
085100***************************************************************** 08510024
085200                                                                  08520024
085300     ADD  AP037-OTB-FUTURE-QTY TO  PV-OTB-TDTE-NONLIFUNG-FUTURE   08530025
085400                                   PV-OTB-TDTE-ALL-FUTURE.        08540024
085500                                                                  08550024
085600     ADD  AP037-OTB-CURRENT-QTY TO PV-OTB-TDTE-NONLIFUNG-CURRENT  08560025
085700                                   PV-OTB-TDTE-ALL-CURRENT.       08570024
085800                                                                  08580024
085900     ADD  AP037-OTB-1MONTH-QTY TO  PV-OTB-TDTE-NONLIFUNG-PERIOD-1 08590025
086000                                   PV-OTB-TDTE-ALL-PERIOD-1.      08600024
086100                                                                  08610024
086200     ADD  AP037-OTB-2MONTH-QTY TO  PV-OTB-TDTE-NONLIFUNG-PERIOD-2 08620025
086300                                   PV-OTB-TDTE-ALL-PERIOD-2.      08630024
086400                                                                  08640024
086500     ADD  AP037-OTB-3MONTH-QTY TO  PV-OTB-TDTE-NONLIFUNG-PERIOD-3 08650025
086600                                   PV-OTB-TDTE-ALL-PERIOD-3.      08660024
086700                                                                  08670024
086800     ADD  AP037-OTB-OVER3-QTY TO   PV-OTB-TDTE-NONLIFUNG-PERIOD-4 08680025
086900                                   PV-OTB-TDTE-ALL-PERIOD-4.      08690024
087000                                                                  08700024
087100     EJECT                                                        08710024
087200                                                                  08720024
087300                                                                  08730024
087400 D500-BUILD-CB-VER-DTL-LINE-1.                                    08740024
087500                                                                  08750024
087600***************************************************************** 08760024
087700*    BUILD THE       COLBY VERIFIED DETAIL PRINT LINE.            08770024
087800***************************************************************** 08780024
087900                                                                  08790024
088000     INITIALIZE D1-DETAIL1-VERIFIED.                              08800024
088100                                                                  08810024
088200     MOVE AP037-VENDOR-NAME   TO  D1-VND-NME.                     08820024
088300                                                                  08830024
088400     MOVE AP037-UNDER-15-QTY   TO  D1-VER-AMT-0014.               08840024
088500     MOVE AP037-UNDER-30-QTY   TO  D1-VER-AMT-1530.               08850024
088600     MOVE AP037-UNDER-60-QTY   TO  D1-VER-AMT-3160.               08860024
088700     MOVE AP037-UNDER-90-QTY   TO  D1-VER-AMT-6190.               08870024
088800     MOVE AP037-UNDER-120-QTY  TO  D1-VER-AMT-90120.              08880024
088900     MOVE AP037-OVER-120-QTY   TO  D1-VER-AMT-00120.              08890024
089000                                                                  08900024
089100     EJECT                                                        08910024
089200                                                                  08920024
089300                                                                  08930024
089400 D600-CB-VER-DETAIL-TOTALS.                                       08940024
089500                                                                  08950024
089600***************************************************************** 08960024
089700*    ADD THE COLBY VERIFIED DETAIL TOTALS TO THE VERIFIED TOTALS  08970024
089800*                                        AND ALL VERIFIED TOTALS  08980024
089900***************************************************************** 08990024
090000                                                                  09000024
090100     ADD  AP037-UNDER-15-QTY   TO  PV-VER-TAMTS-LIFUNG-0014       09010025
090200                                   PV-VER-TAMTS-ALL-ACCTS-0014.   09020024
090300                                                                  09030024
090400     ADD  AP037-UNDER-30-QTY   TO  PV-VER-TAMTS-LIFUNG-1530       09040025
090500                                   PV-VER-TAMTS-ALL-ACCTS-1530.   09050024
090600                                                                  09060024
090700     ADD  AP037-UNDER-60-QTY   TO  PV-VER-TAMTS-LIFUNG-3160       09070025
090800                                   PV-VER-TAMTS-ALL-ACCTS-3160.   09080024
090900                                                                  09090024
091000     ADD  AP037-UNDER-90-QTY   TO  PV-VER-TAMTS-LIFUNG-6190       09100025
091100                                   PV-VER-TAMTS-ALL-ACCTS-6190.   09110024
091200                                                                  09120024
091300     ADD  AP037-UNDER-120-QTY  TO  PV-VER-TAMTS-LIFUNG-90120      09130025
091400                                   PV-VER-TAMTS-ALL-ACCTS-90120.  09140024
091500                                                                  09150024
091600     ADD  AP037-OVER-120-QTY  TO   PV-VER-TAMTS-LIFUNG-00120      09160025
091700                                   PV-VER-TAMTS-ALL-ACCTS-00120.  09170024
091800                                                                  09180024
091900     EJECT                                                        09190024
092000                                                                  09200024
092100 D700-BUILD-CB-OTB-DTL-LINE-2.                                    09210024
092200                                                                  09220024
092300***************************************************************** 09230024
092400*    BUILD THE       COLBY OTB AGING PERIOD     DETAIL PRINT LINE.09240024
092500***************************************************************** 09250024
092600                                                                  09260024
092700                                                                  09270024
092800     INITIALIZE D2-DETAIL2-OTB.                                   09280024
092900                                                                  09290024
093000     MOVE AP037-OTB-FUTURE-QTY  TO  D2-OTB-DTE-FUTURE.            09300024
093100     MOVE AP037-OTB-CURRENT-QTY TO  D2-OTB-DTE-CURRENT.           09310024
093200     MOVE AP037-OTB-1MONTH-QTY  TO  D2-OTB-DTE-PERIOD-1.          09320024
093300     MOVE AP037-OTB-2MONTH-QTY  TO  D2-OTB-DTE-PERIOD-2.          09330024
093400     MOVE AP037-OTB-3MONTH-QTY  TO  D2-OTB-DTE-PERIOD-3.          09340024
093500     MOVE AP037-OTB-OVER3-QTY   TO  D2-OTB-DTE-PERIOD-4.          09350024
093600                                                                  09360024
093700     EJECT                                                        09370024
093800                                                                  09380024
093900                                                                  09390024
094000 D800-CB-OTB-DETAIL-TOTALS.                                       09400024
094100                                                                  09410024
094200***************************************************************** 09420024
094300*  ADD THE COLBY OTB AGING PERIOD DETAIL TOTALS TO FINAL TOTALS   09430025
094400*                                                                 09440024
094500***************************************************************** 09450024
094600                                                                  09460024
094700     ADD  AP037-OTB-FUTURE-QTY TO  PV-OTB-TDTE-LIFUNG-FUTURE      09470025
094800                                   PV-OTB-TDTE-ALL-FUTURE.        09480024
094900                                                                  09490024
095000     ADD  AP037-OTB-CURRENT-QTY TO PV-OTB-TDTE-LIFUNG-CURRENT     09500025
095100                                   PV-OTB-TDTE-ALL-CURRENT.       09510024
095200                                                                  09520024
095300     ADD  AP037-OTB-1MONTH-QTY TO  PV-OTB-TDTE-LIFUNG-PERIOD-1    09530025
095400                                   PV-OTB-TDTE-ALL-PERIOD-1.      09540024
095500                                                                  09550024
095600     ADD  AP037-OTB-2MONTH-QTY TO  PV-OTB-TDTE-LIFUNG-PERIOD-2    09560025
095700                                   PV-OTB-TDTE-ALL-PERIOD-2.      09570024
095800                                                                  09580024
095900     ADD  AP037-OTB-3MONTH-QTY TO  PV-OTB-TDTE-LIFUNG-PERIOD-3    09590025
096000                                   PV-OTB-TDTE-ALL-PERIOD-3.      09600024
096100                                                                  09610024
096200     ADD  AP037-OTB-OVER3-QTY TO   PV-OTB-TDTE-LIFUNG-PERIOD-4    09620025
096300                                   PV-OTB-TDTE-ALL-PERIOD-4.      09630024
096400                                                                  09640024
096500     EJECT                                                        09650024
096600                                                                  09660024
096700                                                                  09670024
096800 H100-BUILD-HEADING-LINE-4.                                       09680024
096900                                                                  09690000
097000*----------------------------------------------------------------*09700024
097100* USE THE DATA FROM THE BASIS INFORMATION RECORD VALUE 1 TO      *09710024
097200*     FILL IN THE VALUES IN THE HEADING LINE 4.                  *09720024
097300*----------------------------------------------------------------*09730024
097400                                                                  09740024
097500     MOVE AP037-OTB-PERIOD-BASIS TO PV-OTB-DATE-PERIOD-CHAR.      09750024
097600                                                                  09760000
097700     SET PERIOD-IDX       TO PV-OTB-PERIOD-PERIOD.                09770024
097800                                                                  09780000
097900     MOVE PT-PERIOD-PRD-ABBRV-3 (PERIOD-IDX) TO H4-CURRENT-PERIOD.09790000
098000     MOVE PV-OTB-PERIOD-DATE TO H4-YR-CURRENT.                    09800000
098100                                                                  09810000
098200     MOVE AP037-OTB-MINUS1-PERIOD TO PV-OTB-DATE-PERIOD-CHAR.     09820024
098300                                                                  09830000
098400     SET PERIOD-IDX       TO PV-OTB-PERIOD-PERIOD.                09840024
098500                                                                  09850000
098600     MOVE PT-PERIOD-PRD-ABBRV-3 (PERIOD-IDX) TO H4-PERIOD-1.      09860000
098700     MOVE PV-OTB-PERIOD-DATE TO H4-YR-1.                          09870024
098800                                                                  09880024
098900     MOVE AP037-OTB-MINUS2-PERIOD TO PV-OTB-DATE-PERIOD-CHAR.     09890024
099000                                                                  09900000
099100     SET PERIOD-IDX       TO PV-OTB-PERIOD-PERIOD.                09910024
099200                                                                  09920000
099300     MOVE PT-PERIOD-PRD-ABBRV-3 (PERIOD-IDX) TO H4-PERIOD-2.      09930000
099400     MOVE PV-OTB-PERIOD-DATE TO H4-YR-2.                          09940024
099500                                                                  09950024
099600     MOVE AP037-OTB-MINUS3-PERIOD TO PV-OTB-DATE-PERIOD-CHAR.     09960024
099700                                                                  09970000
099800     SET PERIOD-IDX       TO PV-OTB-PERIOD-PERIOD.                09980024
099900                                                                  09990000
100000     MOVE PT-PERIOD-PRD-ABBRV-3 (PERIOD-IDX) TO H4-PERIOD-3.      10000000
100100     MOVE PV-OTB-PERIOD-DATE TO H4-YR-3.                          10010024
100200                                                                  10020024
100300     MOVE AP037-OTB-MINUS3-PERIOD TO PV-OTB-DATE-PERIOD-CHAR.     10030024
100400                                                                  10040000
100500     SET PERIOD-IDX       TO PV-OTB-PERIOD-PERIOD.                10050024
100600                                                                  10060000
100700     MOVE PT-PERIOD-PRD-ABBRV-3 (PERIOD-IDX) TO H4-PERIOD-4.      10070000
100800     MOVE PV-OTB-PERIOD-DATE TO H4-YR-4.                          10080024
100900                                                                  10090024
101000     EJECT                                                        10100019
101100                                                                  10110000
101200 R100-READ-INPUT.                                                 10120024
101300                                                                  10130024
101400*----------------------------------------------------------------*10140024
101500*    READ PO IMPORT AGING  EXTRACT FILE.                          10150024
101600*----------------------------------------------------------------*10160024
101700                                                                  10170024
101800     READ IMPORT-PO-AGING-REPORT-FILE INTO                        10180024
101900                          AP037-IMPORT-AGE-FILE                   10190024
102000         AT END                                                   10200024
102100             SET PS-AGING-EOF-YES TO TRUE                         10210024
102200     END-READ.                                                    10220024
102300                                                                  10230024
102400     IF PS-AGING-EOF-NO                                           10240024
102500         ADD 1   TO PV-READ-ALL-CNT                               10250024
102600         IF AP037-BASIS-INFO-RECORD                               10260024
102700             ADD 1   TO PV-READ-BASIS-CNT                         10270024
102800         END-IF                                                   10280024
102900         IF AP037-LIFUNG-AGING-RECORD                             10290024
103000             ADD 1   TO PV-READ-LIFUNG-CNT                        10300025
103100         END-IF                                                   10310024
103200         IF AP037-AGING-INFO-RECORD                               10320024
103300             ADD 1   TO PV-READ-NON-LIFUNG-CNT                    10330025
103400         END-IF                                                   10340024
103500     END-IF.                                                      10350024
103600                                                                  10360024
103700     EJECT                                                        10370024
103800                                                                  10380024
103900                                                                  10390024
104000 W100-PRINT-DETAIL-LINES.                                         10400024
104100                                                                  10410024
104200*----------------------------------------------------------------*10420024
104300*    PRINTS A SET OF 3 VENDOR DETAIL LINES.                       10430024
104400*----------------------------------------------------------------*10440024
104500                                                                  10450024
104600     IF PV-LINES-PER-PAGE > PC-LINES-PER-PAGE-MAX                 10460024
104700         PERFORM X100-WRITE-HEADINGS                              10470024
104800     END-IF.                                                      10480024
104900                                                                  10490024
105000     WRITE IMPORT-PO-AGING-LINE                                   10500024
105100         FROM D1-DETAIL1-VERIFIED                                 10510024
105200             AFTER ADVANCING 2 LINES.                             10520024
105300                                                                  10530024
105400     ADD +2                      TO PV-LINES-PER-PAGE.            10540024
105500                                                                  10550024
105600     WRITE IMPORT-PO-AGING-LINE                                   10560024
105700         FROM D2-DETAIL2-OTB                                      10570024
105800             AFTER ADVANCING 1 LINES.                             10580024
105900                                                                  10590024
106000     ADD +1                      TO PV-LINES-PER-PAGE.            10600024
106100                                                                  10610024
106200     WRITE IMPORT-PO-AGING-LINE                                   10620024
106300         FROM UNDER-SCORE-LINE                                    10630024
106400             AFTER ADVANCING 1 LINES.                             10640024
106500                                                                  10650024
106600     ADD +1                      TO PV-LINES-PER-PAGE.            10660024
106700                                                                  10670024
106800     EJECT                                                        10680024
106900                                                                  10690024
107000                                                                  10700024
107100 X100-WRITE-HEADINGS.                                             10710024
107200                                                                  10720024
107300*----------------------------------------------------------------*10730024
107400*    WRITE PAGE HEADING LINES.                                   *10740024
107500*----------------------------------------------------------------*10750024
107600                                                                  10760024
107700     INITIALIZE                     PV-LINES-PER-PAGE.            10770024
107800                                                                  10780024
107900     ADD +1                      TO PV-PAGE-COUNT.                10790024
108000                                                                  10800024
108100     MOVE PV-PAGE-COUNT          TO DP200O-PAGE-NUMBER.           10810024
108200                                                                  10820024
108300* HEADING LINE 1 (STANDARD  200 CHARACTER)                        10830024
108400                                                                  10840024
108500     WRITE IMPORT-PO-AGING-LINE                                   10850024
108600         FROM DP200O-STANDRD-HEADER-200-COLS                      10860024
108700             AFTER ADVANCING PAGE.                                10870024
108800                                                                  10880024
108900     ADD +1                      TO PV-LINES-PER-PAGE.            10890024
109000                                                                  10900024
109100     WRITE IMPORT-PO-AGING-LINE                                   10910024
109200         FROM H2-HEADER2                                          10920024
109300             AFTER ADVANCING +2 LINES.                            10930024
109400                                                                  10940024
109500     ADD +2                      TO PV-LINES-PER-PAGE.            10950024
109600                                                                  10960024
109700     WRITE IMPORT-PO-AGING-LINE                                   10970024
109800         FROM H3-HEADER3                                          10980024
109900             AFTER ADVANCING +4 LINES.                            10990024
110000                                                                  11000024
110100     ADD +4                      TO PV-LINES-PER-PAGE.            11010024
110200                                                                  11020024
110300     WRITE IMPORT-PO-AGING-LINE                                   11030024
110400         FROM H4-HEADER4                                          11040024
110500             AFTER ADVANCING +1 LINES.                            11050024
110600                                                                  11060024
110700     ADD +1                      TO PV-LINES-PER-PAGE.            11070024
110800                                                                  11080024
110900     MOVE SPACES                 TO IMPORT-PO-AGING-LINE.         11090024
111000                                                                  11100024
111100     WRITE IMPORT-PO-AGING-LINE                                   11110024
111200             AFTER ADVANCING +1 LINES.                            11120024
111300                                                                  11130024
111400     ADD +1                      TO PV-LINES-PER-PAGE.            11140024
111500                                                                  11150024
111600     EJECT                                                        11160024
111700                                                                  11170024
111800                                                                  11180024
111900 Z998-ABEND.                                                      11190024
112000                                                                  11200024
112100*----------------------------------------------------------------*11210024
112200*    ABEND ROUTINE                                               *11220024
112300*----------------------------------------------------------------*11230024
112400                                                                  11240024
112500     DISPLAY AA-ABEND-LIT.                                        11250024
112600     DISPLAY AA-PROGRAM-LIT.                                      11260024
112700     DISPLAY AA-PARAGRAPH-LIT.                                    11270024
112800     DISPLAY AA-MESSAGE-LINE-1.                                   11280024
112900     DISPLAY AA-MESSAGE-LINE-2.                                   11290024
113000                                                                  11300024
113100     CALL 'ILBOABN0' USING ABEND-CODE.                            11310024
113200                                                                  11320024
113300*                                                                 11330024
113400******************************************************************11340024
