000100 IDENTIFICATION DIVISION.                                         00010026
000200 PROGRAM-ID.     APKRP088.                                        00020027
000300 AUTHOR.         MIKE BESKE.                                      00030026
000400 DATE-WRITTEN.   NOVEMBER 2002.                                   00040026
000500 DATE-COMPILED.                                                   00050026
000600*************************************************************     00060026
000700*    COBOL 2                                                *     00070026
000800*                                                           *     00080026
000900*    NIR AGING REPORT FOR POS EXCEEDING $5000 AND 90 DAYS   *     00090042
001000*                                                           *     00100026
001100*   PROGRAM OVERVIEW:                                       *     00110026
001200*                                                           *     00120026
001300*   THIS PROGRAM CREATES THE REPORT SHOWING AGED NON-       *     00130039
001400*   INVOICED RECEIPTS IN THREE DIFFERENT AGE BUCKETS.  EACH *     00140039
001500*   DETAIL RECORD ON THE REPORT IS A TOTAL GROUPED BY DEPT, *     00150039
001600*   VENDOR NAME AND PO NUMBER.  THE ORDER OF THE RECORDS    *     00160039
001700*   ON THE REPORT OF IS TOTAL RETAIL COST IN DESCENDING     *     00170039
001800*   ORDER, VENDOR NAME AND PO NUMBER.                       *     00180039
001900*                                                           *     00190026
002000*   INPUT:                                                  *     00200026
002100*  1. AGED-NIR-FILE                          (APRD071)      *     00210042
002200*                                                           *     00220026
002300*   OUTPUT:                                                 *     00230026
002400*  1. REPT-FILE                              (DPWS200O)     *     00240042
002500*                                                           *     00250039
002600*************************************************************     00260026
002700*   CHANGES:                                                *     00270026
002800*                                                           *     00280042
002900* 02/04/2003                                                *     00290042
003000*   CHANGE MADE: ARKPO PHASE 3 PROJECT.                     *     00300042
003100* INCREASED THE SIZE OF THE INPUT FILE TO 150 BYTES. INCRE- *     00310042
003200* ASED THE WS PO NUMBER FIELDS TO 9 BYTES. REALIGNED THE    *     00320042
003300* PRINT DETAIL AND HEADERS TO HANDLE THE LARGER PO NUMBER.  *     00330042
003400* MADE BY: MIKE BESKE              WR/IR #: WR23500         *     00340042
003500*                                                           *     00350026
040200* DATE  03/15/2004                                              * 00351044
040300*     CHANGE MADE: CHANGED HEADING FROM GREATER THAN 90 DAYS TO * 00352044
040400*     GREATER THAN 60 DAYS. SORT INPUT FILE INTO THIS PROGRAM   * 00353044
040500*     CHANGED TO INCLUDE RECORDS WITH VALUES IN RETAIL AND COST * 00354044
040600*     GREATER THAN ZERO.                                        * 00355044
040800*     MADE BY: ROLLIN KRING            WR/IR #: WR26710         * 00357044
003600*************************************************************     00360026
003700/                                                                 00370026
003800 ENVIRONMENT DIVISION.                                            00380026
003900 CONFIGURATION SECTION.                                           00390026
004000 INPUT-OUTPUT SECTION.                                            00400026
004100 FILE-CONTROL.                                                    00410026
004200                                                                  00420026
004300     SELECT AGED-NIR-FILE        ASSIGN TO UT-S-INP01.            00430039
004400     SELECT REPT-FILE            ASSIGN TO UT-S-RPT01.            00440039
004500                                                                  00450026
004600 DATA DIVISION.                                                   00460026
004700 FILE SECTION.                                                    00470026
004800 FD  AGED-NIR-FILE                                                00480039
004900     RECORDING MODE IS F                                          00490026
005000     LABEL RECORDS ARE STANDARD                                   00500026
005100     BLOCK CONTAINS 0 RECORDS                                     00510026
005200     DATA RECORD IS AGED-NIR-RECORD.                              00520039
005300 01  AGED-NIR-RECORD             PIC  X(150).                     00530042
005400                                                                  00540026
005500 FD  REPT-FILE                                                    00550039
005600     RECORDING MODE IS F                                          00560026
005700     LABEL RECORDS ARE STANDARD                                   00570026
005800     BLOCK CONTAINS 0 RECORDS                                     00580026
005900     DATA RECORD IS REPT-RECORD.                                  00590039
006000 01  REPT-RECORD                 PIC  X(200).                     00600039
006100                                                                  00610026
006200 EJECT                                                            00620026
006300 WORKING-STORAGE SECTION.                                         00630026
006400                                                                  00640026
006500 01  PROGRAM-CONSTANTS.                                           00650026
006600     05  PC-MAX-LINES            PIC S9(05)   COMP-3  VALUE +75.  00660041
006700                                                                  00670026
006800 01  PROGRAM-WORKAREA.                                            00680026
006900     05  FILLER                  PIC  X(30)           VALUE       00690026
007000         '** BEGINING OF APKRP088 W/S **'.                        00700027
007100                                                                  00710026
007200     05  PV-CURRENT-PARAGRAPH    PIC  X(30)           VALUE SPACE.00720026
007300     05  PV-PROGRAM-NAME         PIC  X(08)           VALUE       00730026
007400                                                       'APKRP088'.00740040
007500     05  INPUT-COUNT             PIC 9(09)            VALUE  0.   00750029
007600     05  OUTPUT-COUNT            PIC 9(09)            VALUE  0.   00760029
007700                                                                  00770026
007800     05  PV-YYYY-MM-DD.                                           00780026
007900         10  PV-CHECK-DATE       PIC X(10) VALUE SPACES.          00790026
008000                                                                  00800026
008100     05  PV-CURRENT-DATE.                                         00810026
008200         10  PV-CURRENT-YEAR     PIC  9(02)           VALUE 0.    00820026
008300         10  PV-CURRENT-MONTH    PIC  9(02)           VALUE 0.    00830026
008400         10  PV-CURRENT-DAY      PIC  9(02)           VALUE 0.    00840026
008500                                                                  00850026
008600     05  PV-CURRENT-JULIAN.                                       00860026
008700         10 PV-CURRENT-JUL-YY    PIC  9(02) VALUE 0.              00870026
008800         10 PV-CURRENT-JUL-DDD   PIC  9(03) VALUE 0.              00880026
008900     05  PV-CURRENT-JULIAN-CCYYDDD.                               00890026
009000         10 PV-CURRENT-JUL-CC    PIC  9(02) VALUE 0.              00900026
009100         10 PV-CURRENT-JUL-YYDDD PIC  9(05) VALUE 0.              00910026
009200                                                                  00920026
009300                                                                  00930026
009400     05  PV-CURRENT-TIME.                                         00940026
009500         10  PV-CURRENT-HOUR     PIC  9(02)           VALUE 0.    00950026
009600         10  PV-CURRENT-MINUTE   PIC  9(02)           VALUE 0.    00960026
009700         10  FILLER              PIC  9(02)           VALUE 0.    00970026
009800                                                                  00980026
009900 01  PRINT-FIELDS.                                                00990026
010000     05  PV-LINE-COUNT           PIC S9(05)   COMP-3  VALUE +0.   01000026
010100     05  PV-PAGE-COUNT           PIC S9(05)   COMP-3  VALUE +0.   01010026
010200                                                                  01020026
010300 01  PROGRAM-SWITCHES-SUBS.                                       01030026
010400     05  PV-EOF-SW               PIC  X(01)           VALUE 'N'.  01040026
010500         88  EOF                 VALUE 'Y'.                       01050026
010600     05  PV-DATE-SW              PIC  X(01)           VALUE 'N'.  01060026
010700         88  VALID-DATE          VALUE 'Y'.                       01070026
010800         88  NOT-VALID-DATE      VALUE 'N'.                       01080026
010900 EJECT                                                            01090026
011000*  INPUT RECORD AREA                                              01100026
011100                                                                  01110026
011200     COPY APRD071.                                                01120028
011300                                                                  01130026
011400 EJECT                                                            01140026
011500*  PRINT AREA                                                     01150026
011600                                                                  01160026
011700     COPY DPWS200O.                                               01170033
011800                                                                  01180026
011900 01  HDR-LINE2.                                                   01190026
012000     05  FILLER                  PIC  X(68)   VALUE SPACES.       01200033
012100     05  FILLER                  PIC  X(41)   VALUE               01210035
012200         'NON-INVOICED RECEIPTS AGING OVER $5000 & '.             01220033
012300     05  FILLER                  PIC  X(24)   VALUE               01230035
012400         'GREATER THAN 60 DAYS OLD'.                              01240044
012500     05  FILLER                  PIC  X(67)   VALUE SPACES.       01250038
012600                                                                  01260026
012700 01  HDR-LINE4.                                                   01270026
012800     05  FILLER                  PIC  X(38)    VALUE              01280031
012900         '                               VENDOR '.                01290031
013000     05  FILLER                  PIC  X(30)    VALUE              01300042
013100         '   DEPT   PO     OPEN         '.                        01310042
013200     05  FILLER                  PIC  X(28)    VALUE              01320026
013300         '         TOTAL              '.                          01330037
013400     05  FILLER                  PIC  X(28)    VALUE              01340026
013500         '         OVER 180 DAYS      '.                          01350036
013600     05  FILLER                  PIC  X(28)    VALUE              01360026
013700         '          121 - 180 DAYS    '.                          01370036
013800     05  FILLER                  PIC  X(28)    VALUE              01380036
013900         '             91 - 120 DAYS  '.                          01390036
014000     05  FILLER                  PIC  X(20)    VALUE              01400042
014100         '                    '.                                  01410042
014200                                                                  01420026
014300 01  HDR-LINE5.                                                   01430026
014400     05  FILLER                  PIC  X(38)    VALUE              01440031
014500         'VENDOR NAME                    NUMBER '.                01450031
014600     05  FILLER                  PIC  X(30)    VALUE              01460042
014700         '   NBR    NBR    TO BUY       '.                        01470042
014800     05  FILLER                  PIC  X(28)    VALUE              01480026
014900         '    COST        RETAIL      '.                          01490030
015000     05  FILLER                  PIC  X(28)    VALUE              01500026
015100         '      COST        RETAIL    '.                          01510030
015200     05  FILLER                  PIC  X(28)    VALUE              01520026
015300         '        COST        RETAIL  '.                          01530026
015400     05  FILLER                  PIC  X(28)    VALUE              01540033
015500         '          COST        RETAIL'.                          01550033
015600     05  FILLER                  PIC  X(20)    VALUE              01560042
015700         '                    '.                                  01570042
015800                                                                  01580026
015900 01  DETAIL-LINE.                                                 01590026
016000     05  DL-VENDOR-NAME          PIC  X(30)    VALUE SPACES.      01600028
016100     05  FILLER                  PIC  X(01)    VALUE SPACES.      01610028
016200     05  DL-VENDOR-NBR           PIC  X(09)    VALUE SPACES.      01620028
016300     05  FILLER                  PIC  X(01)    VALUE SPACES.      01630028
016400     05  DL-DEPARTMENT           PIC  9(03)    VALUE ZERO.        01640029
016500     05  FILLER                  PIC  X(01)    VALUE SPACES.      01650028
016600     05  DL-PO-NBR               PIC  Z(09)    VALUE ZERO.        01660042
016700     05  FILLER                  PIC  X(01)    VALUE SPACES.      01670028
016800     05  DL-OTB-PER-NBR          PIC  X(06)    VALUE SPACES.      01680028
016900     05  FILLER                  PIC  X(03)    VALUE SPACES.      01690028
017000     05  DL-COST-TOTAL           PIC  ZZZZZZZZZ.99-               01700033
017100                                               BLANK WHEN ZERO.   01710028
017200     05  FILLER                  PIC  X(02)    VALUE SPACES.      01720028
017300     05  DL-RETAIL-TOTAL         PIC  ZZZZZZZZZ.99-               01730033
017400                                               BLANK WHEN ZERO.   01740028
017500     05  FILLER                  PIC  X(02)    VALUE '  '.        01750028
017600     05  DL-COST-181             PIC  ZZZZZZZZZ.99-               01760033
017700                                               BLANK WHEN ZERO.   01770028
017800     05  FILLER                  PIC  X(02)    VALUE SPACES.      01780028
017900     05  DL-RETAIL-181           PIC  ZZZZZZZZZ.99-               01790033
018000                                               BLANK WHEN ZERO.   01800028
018100     05  FILLER                  PIC  X(02)    VALUE '  '.        01810028
018200     05  DL-COST-121             PIC  ZZZZZZZZZ.99-               01820033
018300                                               BLANK WHEN ZERO.   01830028
018400     05  FILLER                  PIC  X(02)    VALUE SPACES.      01840028
018500     05  DL-RETAIL-121           PIC  ZZZZZZZZZ.99-               01850033
018600                                               BLANK WHEN ZERO.   01860033
018700     05  FILLER                  PIC  X(02)    VALUE '  '.        01870033
018800     05  DL-COST-91              PIC  ZZZZZZZZZ.99-               01880033
018900                                               BLANK WHEN ZERO.   01890033
019000     05  FILLER                  PIC  X(02)    VALUE SPACES.      01900033
019100     05  DL-RETAIL-91            PIC  ZZZZZZZZZ.99-               01910033
019200                                               BLANK WHEN ZERO.   01920028
019300     05  FILLER                  PIC  X(18)    VALUE SPACES.      01930042
019400                                                                  01940028
019500 01  EOR-END-OF-REPORT.                                           01950028
019600     05  FILLER                  PIC  X(87)  VALUE SPACES.        01960033
019700     05  FILLER                  PIC  X(26)  VALUE                01970028
019800         '*****  END OF REPORT *****'.                            01980028
019900     05  FILLER                  PIC  X(87)  VALUE SPACES.        01990033
020000                                                                  02000028
020100*** GREGORIAN/JULIAN DATE CONVERSION                              02010028
020200     COPY DPWS500.                                                02020028
020300                                                                  02030028
020400 EJECT                                                            02040028
020500*----------------------------------------------------------------*02050028
020600*  ABEND DATA AREAS                                              *02060028
020700*----------------------------------------------------------------*02070028
020800 01  ABEND-CODE                  PIC S9(04)  VALUE ZEROS          02080028
020900                                             COMP SYNC.           02090028
021000     88  AC-BAD-DATA                         VALUE +4003.         02100028
021100     88  AC-DATE-ERROR                       VALUE +4019.         02110028
021200                                                                  02120028
021300                                                                  02130028
021400 01  ABEND-AREAS.                                                 02140028
021500     05  AA-ABEND-LIT            PIC  X(40)  VALUE                02150028
021600             '*****       ABEND'.                                 02160028
021700     05  AA-PROGRAM-LIT          PIC  X(40)  VALUE                02170028
021800             '*****   PROGRAM: APKRP088'.                         02180028
021900     05  AA-PARAGRAPH-LIT.                                        02190028
022000         10  FILLER              PIC  X(17)  VALUE                02200028
022100             '***** PARAGRAPH: '.                                 02210028
022200         10  AA-PARAGRAPH-NAME   PIC  X(35)  VALUE SPACES.        02220028
022300     05  AA-MESSAGE-LINE.                                         02230028
022400         10  FILLER              PIC  X(06)  VALUE '*****'.       02240028
022500         10  AA-MESSAGE          PIC  X(127) VALUE SPACES.        02250028
022600                                                                  02260028
022700 01  FILLER                      PIC  X(25)  VALUE                02270028
022800     '** END OF APKRP088 W/S **'.                                 02280028
022900                                                                  02290028
023000 EJECT                                                            02300028
023100 PROCEDURE DIVISION.                                              02310028
023200                                                                  02320028
023300***************************************************************** 02330028
023400*  MAIN DRIVER PARAGRAPH                                          02340040
023500***************************************************************** 02350028
023600 A100-MAIN.                                                       02360039
023700                                                                  02370028
023800     MOVE 'A100-MAIN'            TO   PV-CURRENT-PARAGRAPH.       02380039
023900                                                                  02390028
024000     PERFORM B100-BEGIN-PROGRAM.                                  02400039
024100                                                                  02410028
024200     PERFORM B200-PROCESS-DATA UNTIL EOF.                         02420039
024300                                                                  02430028
024400     PERFORM B300-END-PROGRAM.                                    02440039
024500                                                                  02450028
024600     GOBACK.                                                      02460028
024700                                                                  02470028
024800 EJECT                                                            02480028
024900***************************************************************** 02490028
025000*  PROGRAM INITIALIZATION.                                        02500040
025100***************************************************************** 02510028
025200 B100-BEGIN-PROGRAM.                                              02520039
025300                                                                  02530028
025400     MOVE 'B100-BEGIN-PROGRAM'   TO   PV-CURRENT-PARAGRAPH.       02540039
025500                                                                  02550028
025600     OPEN INPUT  AGED-NIR-FILE                                    02560039
025700          OUTPUT REPT-FILE.                                       02570039
025800                                                                  02580028
025900     ACCEPT PV-CURRENT-JULIAN    FROM DAY.                        02590028
026000     MOVE PV-CURRENT-JULIAN    TO PV-CURRENT-JUL-YYDDD.           02600028
026100     IF PV-CURRENT-JUL-YY > 80                                    02610028
026200        MOVE 19 TO PV-CURRENT-JUL-CC                              02620028
026300     ELSE                                                         02630028
026400        MOVE 20 TO PV-CURRENT-JUL-CC.                             02640028
026500                                                                  02650028
026600     ACCEPT PV-CURRENT-DATE      FROM DATE.                       02660028
026700     MOVE PV-CURRENT-MONTH       TO   DP200O-RUN-MONTH.           02670033
026800     MOVE PV-CURRENT-DAY         TO   DP200O-RUN-DAY.             02680033
026900     MOVE PV-CURRENT-YEAR        TO   DP200O-RUN-YEAR.            02690033
027000                                                                  02700028
027100     ACCEPT PV-CURRENT-TIME      FROM TIME.                       02710028
027200     MOVE PV-CURRENT-HOUR        TO   DP200O-RUN-HOUR.            02720033
027300     MOVE PV-CURRENT-MINUTE      TO   DP200O-RUN-MINUTE.          02730033
027400                                                                  02740028
027500     MOVE PV-PROGRAM-NAME        TO   DP200O-PROGRAM-NAME.        02750033
027600     MOVE 1                      TO   DP200O-REPORT-NUMBER.       02760033
027700                                                                  02770028
027800     MOVE 99                     TO   PV-LINE-COUNT.              02780028
027900                                                                  02790028
028000     PERFORM R100-READ-AGED-NIR-FILE.                             02800039
028100                                                                  02810028
028200***************************************************************** 02820028
028300*  PROCESS EACH RECORD READ.                                      02830040
028400***************************************************************** 02840028
028500 B200-PROCESS-DATA.                                               02850039
028600                                                                  02860028
028700     MOVE 'B200-PROCESS-DATA'    TO   PV-CURRENT-PARAGRAPH.       02870039
028800                                                                  02880028
028900     PERFORM C100-PROCESS-DETAIL.                                 02890039
029000                                                                  02900028
029100     PERFORM R100-READ-AGED-NIR-FILE.                             02910039
029200                                                                  02920028
029300***************************************************************** 02930039
029400*  WRITE OUT THE END OF REPORT LINE.  CLOSE THE FILES.  DISPLAY   02940040
029500*  THE COUNTS.                                                    02950040
029600***************************************************************** 02960040
029700 B300-END-PROGRAM.                                                02970040
029800                                                                  02980040
029900     MOVE 'B300-END-PROGRAM'     TO   PV-CURRENT-PARAGRAPH.       02990040
030000                                                                  03000040
030100     WRITE REPT-RECORD FROM EOR-END-OF-REPORT                     03010040
030200           AFTER ADVANCING 2 LINES.                               03020040
030300                                                                  03030040
030400     CLOSE  AGED-NIR-FILE                                         03040040
030500            REPT-FILE.                                            03050040
030600                                                                  03060040
030700     DISPLAY '***** APKRP088 COUNTS *****'.                       03070040
030800     DISPLAY 'RECORDS READ    = ' INPUT-COUNT.                    03080040
030900     DISPLAY 'RECORDS WRITTEN = ' OUTPUT-COUNT.                   03090040
031000     DISPLAY '***************************'.                       03100040
031100                                                                  03110040
031200***************************************************************** 03120040
031300*  MOVE THE INPUT RECORD FIELDS TO THE PRINT DETAIL LINE.  WRITE  03130040
031400*  THE DETAIL RECORD TO THE PRINT FILE.                           03140040
031500***************************************************************** 03150040
031600 C100-PROCESS-DETAIL.                                             03160040
031700                                                                  03170040
031800     MOVE AP071-ENT-NM-DESC      TO  DL-VENDOR-NAME.              03180040
031900     IF AP071-ENT-NM-DESC = SPACES                                03190040
032000        MOVE 'UNKNOWN VENDOR'    TO   DL-VENDOR-NAME              03200040
032100     ELSE                                                         03210040
032200        MOVE AP071-ENT-NM-DESC   TO   DL-VENDOR-NAME              03220040
032300     END-IF.                                                      03230040
032400     MOVE AP071-VND-NBR          TO  DL-VENDOR-NBR.               03240040
032500     MOVE AP071-DEPT-NBR         TO  DL-DEPARTMENT.               03250040
032600     MOVE AP071-PO-NBR           TO  DL-PO-NBR.                   03260040
032700     MOVE AP071-OTB-PER-NBR      TO  DL-OTB-PER-NBR.              03270040
032800     MOVE AP071-TOTAL-COST       TO  DL-COST-TOTAL.               03280040
032900     MOVE AP071-TOTAL-RETAIL     TO  DL-RETAIL-TOTAL.             03290040
033000     MOVE AP071-COST-181         TO  DL-COST-181.                 03300040
033100     MOVE AP071-RETAIL-181       TO  DL-RETAIL-181.               03310040
033200     MOVE AP071-COST-121         TO  DL-COST-121.                 03320040
033300     MOVE AP071-RETAIL-121       TO  DL-RETAIL-121.               03330040
033400     MOVE AP071-COST-91          TO  DL-COST-91.                  03340040
033500     MOVE AP071-RETAIL-91        TO  DL-RETAIL-91.                03350040
033600                                                                  03360040
033700     IF PV-LINE-COUNT > PC-MAX-LINES                              03370040
033800        PERFORM H100-WRITE-HEADING                                03380040
033900     END-IF.                                                      03390040
034000                                                                  03400040
034100     WRITE REPT-RECORD FROM DETAIL-LINE                           03410040
034200        AFTER ADVANCING 1 LINES.                                  03420040
034300     ADD +1            TO PV-LINE-COUNT                           03430040
034400                          OUTPUT-COUNT.                           03440040
034500                                                                  03450040
034600     INITIALIZE DETAIL-LINE.                                      03460040
034700                                                                  03470040
034800***************************************************************** 03480040
034900*  WRITE THE HEADINGS TO THE REPORT.                              03490040
035000***************************************************************** 03500040
035100 H100-WRITE-HEADING.                                              03510040
035200                                                                  03520040
035300     MOVE 'H100-WRITE-HEADING'   TO   PV-CURRENT-PARAGRAPH.       03530040
035400                                                                  03540040
035500                                                                  03550040
035600     ADD 1                       TO   PV-PAGE-COUNT.              03560040
035700     MOVE PV-PAGE-COUNT          TO   DP200O-PAGE-NUMBER.         03570040
035800                                                                  03580040
035900     MOVE 0                      TO   PV-LINE-COUNT.              03590040
036000                                                                  03600040
036100     WRITE REPT-RECORD FROM DP200O-STANDRD-HEADER-200-COLS        03610040
036200           AFTER ADVANCING PAGE.                                  03620040
036300                                                                  03630040
036400     WRITE REPT-RECORD FROM HDR-LINE2                             03640040
036500           AFTER ADVANCING 1 LINES.                               03650040
036600                                                                  03660040
036700     MOVE SPACES TO REPT-RECORD.                                  03670040
036800     WRITE REPT-RECORD   AFTER ADVANCING 1 LINES.                 03680040
036900                                                                  03690040
037000     WRITE REPT-RECORD FROM HDR-LINE4                             03700040
037100           AFTER ADVANCING 1 LINES.                               03710040
037200                                                                  03720040
037300     WRITE REPT-RECORD FROM HDR-LINE5                             03730040
037400           AFTER ADVANCING 1 LINES.                               03740040
037500                                                                  03750040
037600     MOVE SPACES TO REPT-RECORD.                                  03760040
037700     WRITE REPT-RECORD   AFTER ADVANCING 1 LINES.                 03770040
037800                                                                  03780040
037900     MOVE 6                      TO   PV-LINE-COUNT.              03790040
038000                                                                  03800040
038100***************************************************************** 03810040
038200*  READ THE INPUT FILE.                                           03820040
038300***************************************************************** 03830040
038400 R100-READ-AGED-NIR-FILE.                                         03840040
038500                                                                  03850040
038600     MOVE 'R100-READ-AGED-NIR-FILE'                               03860040
038700                                 TO   PV-CURRENT-PARAGRAPH.       03870040
038800                                                                  03880040
038900     READ AGED-NIR-FILE          INTO AP071-RECORD                03890040
039000         AT END                                                   03900040
039100             SET EOF TO TRUE.                                     03910040
039200                                                                  03920040
039300     IF PV-EOF-SW = 'N'                                           03930040
039400        ADD 1 TO INPUT-COUNT                                      03940040
039500     END-IF.                                                      03950040
