000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.     APKUT341.                                        00020026
000300 AUTHOR.         MADHURA PETHE.                                   00030026
000400 DATE-WRITTEN.   01/01/2009.                                      00040026
000500 DATE-COMPILED.                                                   00050000
000600****************************************************************  00060022
000700* COBOL 2 WITH SQL                                             *  00070022
000710*--------------------------------------------------------------*  00071022
000800*  --- IMPORT PAY RELEASING PRODUCTIVITY REPORTING ---         *  00080026
000900*                                                              *  00090022
001000* THIS PROGRAM GATHERS INFORMATION REGARDING IMPORT PO'S AND   *  00100026
001100* PRODUCE THE IMPORT PAY RELEASING STATISTICS FILE. IT WILL    *  00110026
001200* BE USED BY AP TO TRACK PRODUCTIVITY BY AP IMPORTS ASSOCIATES.*  00120026
001300*                                                              *  00130026
001500*--------------------------------------------------------------*  00150022
001600* INPUT:                                                       *  00160022
001700*  1. RELEASED PO/STORES BKP FILE                  (TPOSTRR)   *  00170026
001710*  2. IMPORT AJ STATUS UPDATE FILE                 (APRD252)   *  00171050
001720*                                                              *  00172049
001800* DB2 TABLES:                                                  *  00180049
002100*  1. EXTERNAL ENTITY NAME                         (TENTNME)   *  00210052
002200*  2. PURCHASE ORDER HEADER TABLE                  (TPURCHS)   *  00220052
002800*                                                              *  00280022
002900* OUTPUT:                                                      *  00290022
003000*  1. IMPORT PAY RELEASING STATISTICS FILE         (APRD116)   *  00300026
003100*                                                              *  00310050
003500****************************************************************  00350022
003600* CHANGE LOG:                                                  *  00360058
003700*   DATE  03/16/2009                                           *  00370058
011000*       CHANGE MADE: INITIAL CREATION.                         *  01100058
011010*       MADE BY: MADHURA PETHE           WR/IR #: WR34353      *  01101058
011020*--------------------------------------------------------------*  01102058
011100                                                                  01110017
011200 ENVIRONMENT DIVISION.                                            01120017
011300 CONFIGURATION SECTION.                                           01130017
011400 SOURCE-COMPUTER.    IBM-3090.                                    01140017
011500 OBJECT-COMPUTER.    IBM-3090.                                    01150017
011600                                                                  01160017
011700 INPUT-OUTPUT SECTION.                                            01170017
011800 FILE-CONTROL.                                                    01180017
011900     SELECT TPOSTRR-BKP-FILE              ASSIGN TO UT-S-INP01.   01190045
012000     SELECT AJ-STATUS-FILE                ASSIGN TO UT-S-INP02.   01200045
012100     SELECT IMPORT-PAY-STAT-FILE          ASSIGN TO UT-S-OUT01.   01210045
012500                                                                  01250017
012600 DATA DIVISION.                                                   01260017
012700 FILE SECTION.                                                    01270017
012800                                                                  01280017
012900 FD  TPOSTRR-BKP-FILE                                             01290026
013000     RECORDING MODE IS F                                          01300017
013100     LABEL RECORDS ARE STANDARD                                   01310017
013200     DATA RECORD IS TPOSTRR-REC.                                  01320026
013300 01  TPOSTRR-REC.                                                 01330026
013400     05 FILLER                        PIC  X(060).                01340026
013500                                                                  01350017
013600 FD  AJ-STATUS-FILE                                               01360026
013700     RECORDING MODE IS F                                          01370017
013800     LABEL RECORDS ARE STANDARD                                   01380017
013900     DATA RECORD IS AJ-STATUS-REC.                                01390026
014000 01  AJ-STATUS-REC.                                               01400026
014100     05 FILLER                        PIC  X(080).                01410026
014200                                                                  01420017
014300 FD  IMPORT-PAY-STAT-FILE                                         01430032
014400     RECORDING MODE IS F                                          01440017
014500     LABEL RECORDS ARE STANDARD                                   01450017
014600     BLOCK CONTAINS 0 RECORDS                                     01460017
014700     DATA RECORD IS IMPORT-PAY-STAT-REC.                          01470032
014800 01  IMPORT-PAY-STAT-REC.                                         01480032
014900     05 FILLER                        PIC  X(50).                 01490030
017400                                                                  01740017
017500 WORKING-STORAGE SECTION.                                         01750017
017600                                                                  01760017
017700 01  PC-PROGRAM-CONSTANTS.                                        01770017
017800     05  FILLER                  PIC  X(30)  VALUE                01780017
017900         '** BEGINING OF APKUT341 W/S **'.                        01790026
018000                                                                  01800017
018100     05  PC-PROGRAM-NAME         PIC  X(08)  VALUE 'APKUT341'.    01810026
018200                                                                  01820017
018300 01  PV-PROGRAM-VARIABLES.                                        01830017
018400     05  PV-HOLD-PO-NBR          PIC S9(09)       VALUE ZEROS     01840034
018500                                                  COMP.           01850047
018510     05  PV-HOLD-PO-NBR-9        PIC  9(09)       VALUE ZEROS.    01851034
018600     05  PV-TPOSTRR-READ         PIC  9(07)       VALUE ZEROS.    01860032
018610     05  PV-AJ-STATUS-READ       PIC  9(07)       VALUE ZEROS.    01861032
018700     05  PV-IP-STAT-WRITTEN      PIC  9(07)       VALUE ZEROS.    01870032
018710     05  PV-NO-IMPORT            PIC  9(07)       VALUE ZEROS.    01871035
018720     05  PV-MANUAL-JRNL          PIC  9(07)       VALUE ZEROS.    01872036
018730     05  PV-AUTO-JRNL            PIC  9(07)       VALUE ZEROS.    01873036
018740     05  DISPLAY-TPOSTRR-READ    PIC  Z,ZZZ,ZZ9   VALUE ZEROS.    01874038
018760     05  DISPLAY-IP-STAT-WRITTEN PIC  Z,ZZZ,ZZ9   VALUE ZEROS.    01876038
018770     05  DISPLAY-NO-IMPORT       PIC  Z,ZZZ,ZZ9   VALUE ZEROS.    01877038
018780     05  DISPLAY-MANUAL-JRNL     PIC  Z,ZZZ,ZZ9   VALUE ZEROS.    01878038
018790     05  DISPLAY-AUTO-JRNL       PIC  Z,ZZZ,ZZ9   VALUE ZEROS.    01879038
018800                                                                  01880032
022200 01  PS-PROGRAM-SWITCHES.                                         02220017
022300     05  PS-END-OF-TPOSTRR-SW    PIC X(01)        VALUE 'N'.      02230029
022400         88  END-OF-TPOSTRR                       VALUE 'Y'.      02240029
022500     05  PS-END-OF-AJ-STATUS-SW  PIC X(01)        VALUE 'N'.      02250030
022600         88  END-OF-AJ-STATUS                     VALUE 'Y'.      02260030
023810     05  PS-IMPORT-PO-SW         PIC X(01)        VALUE 'N'.      02381032
023820         88  IMPORT-PO-TRUE                       VALUE 'Y'.      02382029
024000*--------------------------------------------------------------*  02400022
024100* COMMUNICATIONS AREA2 FOR DB2                                 *  02410022
024200*--------------------------------------------------------------*  02420022
024300     COPY SQLCA2.                                                 02430017
024400                                                                  02440017
024500     EXEC SQL                                                     02450017
024600          INCLUDE SQLCA                                           02460017
024700     END-EXEC.                                                    02470017
027700*--------------------------------------------------------------*  02770022
027800* RELEASED PO/STORE TABLE                                      *  02780032
027900*--------------------------------------------------------------*  02790022
028000     EXEC SQL                                                     02800017
028100          INCLUDE TPOSTRR                                         02810032
028200     END-EXEC.                                                    02820017
028300                                                                  02830017
028310*--------------------------------------------------------------*  02831032
028320* EXTERNAL ENTERPRISE NAME TABLE                               *  02832032
028330*--------------------------------------------------------------*  02833032
028340     EXEC SQL                                                     02834032
028350          INCLUDE TENTNME                                         02835032
028360     END-EXEC.                                                    02836032
028370                                                                  02837032
028400*--------------------------------------------------------------*  02840022
028500* PURCHASE ORDER TABLE                                         *  02850022
028600*--------------------------------------------------------------*  02860022
028700     EXEC SQL                                                     02870017
028800          INCLUDE TPURCHS                                         02880017
028900     END-EXEC.                                                    02890017
034100                                                                  03410017
034200*--------------------------------------------------------------*  03420022
034300* IMPORT AUTO JOURNALIZATION STATUS UPDATE RECORD LAYOUT       *  03430047
034400*--------------------------------------------------------------*  03440022
034500     COPY APRD252.                                                03450026
034600                                                                  03460017
034700*--------------------------------------------------------------*  03470022
034800* IMPORT PAY RELEASE STATISTICS RECORD LAYOUT                  *  03480026
034900*--------------------------------------------------------------*  03490022
035000     COPY APRD116.                                                03500026
035100                                                                  03510017
036200*--------------------------------------------------------------*  03620022
036300* ABEND DATA AREAS                                             *  03630022
036400*--------------------------------------------------------------*  03640022
036500 01  ABEND-CODE                  PIC S9(04)  VALUE ZEROS          03650017
036600                                             COMP SYNC.           03660017
036700     88  AC-BAD-DATA                         VALUE +4003.         03670017
036800     88  AC-DB2-ERROR                        VALUE +4013.         03680017
036900     88  AC-DATE-ERROR                       VALUE +4019.         03690017
037000                                                                  03700017
037100 01  ABEND-AREAS.                                                 03710017
037200     05  AA-ABEND-LIT            PIC  X(40)  VALUE                03720017
037300             '*****       ABEND'.                                 03730017
037400     05  AA-PROGRAM-LIT          PIC  X(40)  VALUE                03740017
037500             '*****   PROGRAM: APKUT341'.                         03750041
037600     05  AA-PARAGRAPH-LIT.                                        03760017
037700         10  FILLER              PIC  X(17)  VALUE                03770017
037800             '***** PARAGRAPH: '.                                 03780017
037900         10  AA-PARAGRAPH-NAME   PIC  X(35)  VALUE SPACES.        03790017
038000     05  AA-MESSAGE-LINE.                                         03800017
038100         10  FILLER              PIC  X(06)  VALUE '*****'.       03810017
038200         10  AA-MESSAGE          PIC  X(127) VALUE SPACES.        03820017
038300     05  AA-DB2-ERROR-LIT        PIC  X(40)  VALUE                03830017
038400             '*****    DB2 ERROR'.                                03840017
038500     05  AA-DB2-OPERATION-LIT.                                    03850017
038600         10  FILLER              PIC  X(17)  VALUE                03860017
038700             '***** OPERATION: '.                                 03870017
038800         10  AA-DB2-OPERATION.                                    03880017
038900             15  AA-DB2-OP-1     PIC  X(25)  VALUE SPACES.        03890017
039000             15  AA-DB2-OP-2     PIC  X(25)  VALUE SPACES.        03900017
039100     05  AA-DB2-TABLE-1          PIC  X(08)  VALUE SPACES.        03910017
039200     05  AA-DB2-TABLE-2          PIC  X(08)  VALUE SPACES.        03920017
039300     05  AA-DB2-TABLE-3          PIC  X(08)  VALUE SPACES.        03930017
039400     05  AA-DB2-TABLE-4          PIC  X(08)  VALUE SPACES.        03940017
039410                                                                  03941023
039500*--------------------------------------------------------------*  03950022
039510* SQLCA FORMATTED MESSAGE AREA                                 *  03951022
039520*--------------------------------------------------------------*  03952022
039600     COPY DPWS004.                                                03960017
039610                                                                  03961022
039700 01  FILLER                      PIC  X(25)  VALUE                03970017
039800     '** END OF APKUT341 W/S **'.                                 03980026
039900                                                                  03990017
039910*--------------------------*                                      03991022
040000 PROCEDURE DIVISION.                                              04000017
040010*--------------------------*                                      04001022
040100 A100-MAIN.                                                       04010017
040200                                                                  04020017
040300     PERFORM B100-HOUSEKEEPING.                                   04030017
040500                                                                  04050050
040600     PERFORM B200-PROCESS-POS                                     04060050
040700             UNTIL END-OF-TPOSTRR.                                04070050
040800                                                                  04080050
041000     PERFORM B300-END-PROGRAM.                                    04100017
041100                                                                  04110050
041200     GOBACK.                                                      04120017
041300                                                                  04130017
041500*--------------------------------------------------------------*  04150022
041600* INITIALIZATION PROCESS AND INITIAL READS FOR BOTH INPUTS.    *  04160022
041700*--------------------------------------------------------------*  04170022
041710 B100-HOUSEKEEPING.                                               04171022
041800                                                                  04180017
041900     OPEN INPUT  TPOSTRR-BKP-FILE                                 04190046
042000                 AJ-STATUS-FILE                                   04200046
042200          OUTPUT IMPORT-PAY-STAT-FILE.                            04220046
042700                                                                  04270017
042800     INITIALIZE DCLTENTNME                                        04280026
043200                DCLTPURCHS                                        04320050
043300                DCLTPOSTRR.                                       04330050
043600                                                                  04360017
043700* INITIAL READ OF RELEASED PO/STORES BKP FILE.                    04370026
043800*                                                                 04380017
043900     PERFORM R100-READ-TPOSTRR.                                   04390026
044000     IF END-OF-TPOSTRR                                            04400026
044100        DISPLAY 'RELEASED PO/STORES BKP FILE(TPOSTRR) IS EMPTY'   04410047
044300     END-IF.                                                      04430017
045400                                                                  04540017
045600*--------------------------------------------------------------*  04560022
045700* CONTROLS THE PROCESSING OF EACH PO:                          *  04570022
045800*                                                              *  04580022
045900*  - GETS VENDOR NAME, OPEN TO BUY PERIOD, JOURNALIZATION      *  04590026
046000*    STATUS FOR EVERY PO BEING PROCESSED.                      *  04600026
046100*  - ALL PAY-RELEASE DATA FOR THIS PO IS WRITTEN TO THE IMPORT *  04610056
046200*    PAY RELEASE STATISTICS FILE.                              *  04620026
046900*--------------------------------------------------------------*  04690022
046901 B200-PROCESS-POS.                                                04690122
046910                                                                  04691022
047300     MOVE POSTRR-PO-NBR          TO PV-HOLD-PO-NBR                04730034
047310                                    PV-HOLD-PO-NBR-9              04731034
047400     MOVE 'N'                    TO PS-IMPORT-PO-SW.              04740029
047500                                                                  04750051
048200     PERFORM S100-GET-VENDOR-DATA.                                04820017
048700                                                                  04870017
048800     IF IMPORT-PO-TRUE                                            04880029
049000        PERFORM R200-READ-AJ-STATUS                               04900030
049100           UNTIL AP252-PO-NBR  >=  PV-HOLD-PO-NBR-9               04910052
049200              OR END-OF-AJ-STATUS                                 04920052
049300                                                                  04930017
054110        PERFORM C100-BUILD-IP-STAT-REC                            05411032
054120                                                                  05412032
054130        PERFORM W100-WRITE-IP-STAT-REC                            05413032
054150     ELSE                                                         05415035
054160        ADD 1 TO PV-NO-IMPORT                                     05416035
054410     END-IF.                                                      05441029
054500                                                                  05450017
054600     PERFORM R100-READ-TPOSTRR.                                   05460030
054700*--------------------------------------------------------------*  05470022
054800* ENDING PROCESSING: DISPLAYS COUNTS, AND CLOSES FILES.        *  05480022
054900*--------------------------------------------------------------*  05490022
054910 B300-END-PROGRAM.                                                05491022
055000                                                                  05500017
055010     MOVE PV-TPOSTRR-READ      TO DISPLAY-TPOSTRR-READ.           05501038
055020     MOVE PV-NO-IMPORT         TO DISPLAY-NO-IMPORT.              05502038
055030     MOVE PV-IP-STAT-WRITTEN   TO DISPLAY-IP-STAT-WRITTEN.        05503039
055040     MOVE PV-MANUAL-JRNL       TO DISPLAY-MANUAL-JRNL.            05504038
055050     MOVE PV-AUTO-JRNL         TO DISPLAY-AUTO-JRNL.              05505038
055060                                                                  05506038
055100     DISPLAY 'TOTAL RELEASED POS DURING THE PAST WEEK     = '     05510037
055300             DISPLAY-TPOSTRR-READ.                                05530038
055301     DISPLAY 'TOTAL NO-IMPORT POS DURING THE PAST WEEK    = '     05530137
055302             DISPLAY-NO-IMPORT.                                   05530238
055400     DISPLAY 'TOTAL IMPORT PAY-RELEASE STAT RECS WRITTEN  = '     05540037
055800             DISPLAY-IP-STAT-WRITTEN.                             05580038
055810     DISPLAY '      TOTAL MANUALLY JOURNALIZED POS        = '     05581037
055811             DISPLAY-MANUAL-JRNL.                                 05581138
055812     DISPLAY '      TOTAL AUTO JOURNALIZED POS            = '     05581237
055820             DISPLAY-AUTO-JRNL.                                   05582038
055900     CLOSE TPOSTRR-BKP-FILE                                       05590029
056000           AJ-STATUS-FILE                                         05600029
056200           IMPORT-PAY-STAT-FILE.                                  05620032
056600                                                                  05660017
056700*--------------------------------------------------------------*  05670032
056800* BUILD RECORD TO PRODUCE IMPORT PAY-RELEASE STAT FILE         *  05680032
056900*--------------------------------------------------------------*  05690032
057000 C100-BUILD-IP-STAT-REC.                                          05700032
057100                                                                  05710032
057110     INITIALIZE AP116-RECORD.                                     05711032
057120                                                                  05712032
057130     MOVE ','                  TO AP116-COMMA1                    05713032
057140                                  AP116-COMMA2                    05714032
057150                                  AP116-COMMA3                    05715032
057160                                  AP116-COMMA4                    05716032
057170                                                                  05717032
057200     IF AP252-PO-NBR  = PV-HOLD-PO-NBR-9                          05720050
057300        SET AP116-AUTO-JRNL    TO TRUE                            05730057
057310        ADD 1    TO PV-AUTO-JRNL                                  05731050
057500     ELSE                                                         05750032
057600        SET AP116-MANUAL-JRNL  TO TRUE                            05760057
057610        ADD 1    TO PV-MANUAL-JRNL                                05761050
057700     END-IF.                                                      05770032
057710                                                                  05771032
057800     MOVE PV-HOLD-PO-NBR-9     TO AP116-PO-NBR.                   05780034
057900     MOVE PURCHS-OTB-PER-NBR   TO AP116-OTB-PER-NBR.              05790032
058000     MOVE ENTNME-ENT-NAME-DESC TO AP116-ENT-NAME-DESC.            05800032
058010     INSPECT AP116-ENT-NAME-DESC CONVERTING ',' TO ' '.           05801055
058100                                                                  05810032
074100*--------------------------------------------------------------*  07410022
074200* READ THE RELEASED PO/STORE BACKUP FILE                       *  07420027
074300*--------------------------------------------------------------*  07430022
074310 R100-READ-TPOSTRR.                                               07431027
074400                                                                  07440019
074500     MOVE 'R100-READ-TPOSTRR'  TO AA-PARAGRAPH-NAME.              07450027
074600                                                                  07460050
074800     READ TPOSTRR-BKP-FILE INTO DCLTPOSTRR                        07480050
074900          AT END  SET END-OF-TPOSTRR TO TRUE.                     07490027
075000                                                                  07500050
075100     IF NOT END-OF-TPOSTRR                                        07510027
075200        ADD 1 TO PV-TPOSTRR-READ.                                 07520027
075300                                                                  07530019
075500*--------------------------------------------------------------*  07550022
075600* READ THE AUTO JOURNALIZATION STATUS FILE                     *  07560027
075700*--------------------------------------------------------------*  07570022
075710 R200-READ-AJ-STATUS.                                             07571030
075800                                                                  07580019
075900     MOVE 'R200-READ-AJ-STATUS'   TO AA-PARAGRAPH-NAME.           07590030
076000                                                                  07600019
076200     READ AJ-STATUS-FILE INTO AP252-RECORD                        07620050
076300       AT END SET END-OF-AJ-STATUS TO TRUE.                       07630050
076400                                                                  07640019
076500     IF END-OF-AJ-STATUS                                          07650050
076600        MOVE 999999999            TO AP252-PO-NBR                 07660054
076610     ELSE                                                         07661050
076700        ADD 1                     TO PV-AJ-STATUS-READ            07670050
076710     END-IF.                                                      07671050
076800                                                                  07680019
081800*--------------------------------------------------------------*  08180022
081900* RETRIEVES VENDOR DATA FOR PO BEING PROCESSED.                *  08190022
082000*--------------------------------------------------------------*  08200022
082010 S100-GET-VENDOR-DATA.                                            08201022
082100                                                                  08210019
082200     EXEC SQL                                                     08220019
082300         SELECT  NM.ENT_NAME_DESC                                 08230028
082500                ,PR.OTB_PER_NBR                                   08250019
082700         INTO    :ENTNME-ENT-NAME-DESC                            08270027
082900                ,:PURCHS-OTB-PER-NBR                              08290019
083100         FROM    TPURCHS PR                                       08310019
083300                ,TENTNME NM                                       08330019
083400         WHERE   PR.PO_NBR   = :PV-HOLD-PO-NBR                    08340019
083500           AND   PR.ENT_ID   = NM.ENT_ID                          08350028
083700           AND   PR.PO_TYP_CDE IN ('IM','IE','IF')                08370027
083800           AND   PR.VER_STATUS_CDE = 'A'                          08380028
083810           AND   NM.TYPE_CDE = '01'                               08381028
083900     END-EXEC.                                                    08390019
084000                                                                  08400019
084100     EVALUATE TRUE                                                08410019
084200         WHEN SQLCODE = ZERO                                      08420019
084300             SET IMPORT-PO-TRUE TO TRUE                           08430029
084400                                                                  08440019
084500         WHEN SQLCODE = +100                                      08450019
084600             CONTINUE                                             08460029
085100                                                                  08510019
085200         WHEN OTHER                                               08520029
085400             MOVE 'S100-GET-VENDOR-DATA'                          08540019
085500                                 TO AA-PARAGRAPH-NAME             08550019
085600             MOVE 'UNSUCCESSFUL SELECT'                           08560019
085700                                 TO AA-DB2-OPERATION              08570019
085800             MOVE 'TPURCHS'               TO AA-DB2-TABLE-1       08580019
085900             MOVE 'TENTENT'               TO AA-DB2-TABLE-2       08590027
086000             INITIALIZE                      AA-DB2-TABLE-3       08600027
086100                                             AA-DB2-TABLE-4       08610027
086200             PERFORM Z998-DB2-ABEND                               08620019
086300     END-EVALUATE.                                                08630019
086400                                                                  08640019
100700*--------------------------------------------------------------*  10070022
100800* WRITE THE IMPORT PAY-RELEASE STATISTICS RECORD.              *  10080027
100900*--------------------------------------------------------------*  10090022
100910 W100-WRITE-IP-STAT-REC.                                          10091032
101000                                                                  10100019
101100     WRITE IMPORT-PAY-STAT-REC FROM AP116-RECORD.                 10110032
101200     ADD 1 TO PV-IP-STAT-WRITTEN.                                 10120032
101300                                                                  10130019
109400*--------------------------------------------------------------*  10940022
109500* ABEND ROUTINE FOR DB2 ERRORS                                 *  10950022
109600*--------------------------------------------------------------*  10960022
109610 Z998-DB2-ABEND.                                                  10961022
109700                                                                  10970019
109800     CLOSE TPOSTRR-BKP-FILE                                       10980028
109900           AJ-STATUS-FILE                                         10990028
110100           IMPORT-PAY-STAT-FILE.                                  11010032
110400                                                                  11040019
110500     DISPLAY AA-ABEND-LIT.                                        11050019
110600     DISPLAY AA-DB2-ERROR-LIT.                                    11060019
110700     DISPLAY AA-PROGRAM-LIT.                                      11070019
110800     DISPLAY AA-PARAGRAPH-LIT.                                    11080019
110900     DISPLAY AA-DB2-OPERATION-LIT.                                11090019
111000     DISPLAY AA-DB2-TABLE-1.                                      11100019
111100     DISPLAY AA-DB2-TABLE-2.                                      11110019
111200     DISPLAY AA-DB2-TABLE-3.                                      11120019
111300     DISPLAY AA-DB2-TABLE-4.                                      11130019
111400     DISPLAY '*****                PO = ' PV-HOLD-PO-NBR-9.       11140034
111700     SET AC-DB2-ERROR TO TRUE.                                    11170019
111800                                                                  11180019
111900     COPY DPPD004.                                                11190019
112000                                                                  11200019
112100     CALL 'ILBOABN0' USING ABEND-CODE.                            11210019
112200                                                                  11220019
