000100*-----------------------*                                         00010000
000200 IDENTIFICATION DIVISION.                                         00020000
000300*-----------------------*                                         00030000
000400 PROGRAM-ID.    APKUT002.                                         00040000
000500 AUTHOR.        NANCY EILBES.                                     00050000
000600 DATE-WRITTEN.  SEPTEMBER 2019.                                   00060000
000700                                                                  00070000
000800*---------------------------------------------------------------* 00080000
000900*    COBOL II WITH SQL                                          * 00090000
001000*                                                               * 00100000
001100*     --- REFORMAT VERIFIED RECEIPTS POST FILE ---              * 00110000
001200*                                                               * 00120000
001300*    THE PURPOSE OF THIS PROGRAM IS TO CONVERT THE VERIFIED     * 00130000
001310*    RECEIPTS RECORDS TO A NEW FORMAT, AND CREATE A SEPARATE    * 00131000
001320*    RECORD FOR THE LOAD PORTION OF THE VERIFIED RECEIPTS THAT  * 00132000
001330*    CONTAIN A DOMESTIC PRIVATE LABEL LOAD AMOUNT.  THIS        * 00133000
001340*    SEPARATE RECORD WILL ALLOW THE LOAD AMOUNT TO BE POSTED TO * 00134000
001350*    A SEPARATE GL ACCOUNT.                                     * 00135000
001360*---------------------------------------------------------------* 00136000
001370* DB2 TABLES:                                                   * 00137000
001380*  1. PURCHASE ORDER HEADER            (TPURCHS)                * 00138000
001390*                                                               * 00139000
001400* INPUT:                                                        * 00140000
001500*  1. STORE EXTRACT FILE, SUMMED BY    (STOREEXT)               * 00150000
001600*     PO AND LOCATION.                                          * 00160000
001700*                                                               * 00170000
001800* OUTPUT:                                                       * 00180000
001900*  1. GL VERIFIED RECEIPT POST FILE.   (APRD006)                * 00190000
002000*                                                               * 00200000
002100*---------------------------------------------------------------* 00210000
002200*   CHANGES:                                                    * 00220000
002300*    DATE  02/04/2008                                           * 00230000
002400*        CHANGE MADE: INITIAL IMPLEMENTATION.                   * 00240000
002500*        MADE BY: CHRISTINE TWIEHAUS      WR/IR #: WR32664      * 00250000
002600*                                                               * 00260000
002700*    DATE  02/11/2008                                           * 00270000
002800*        CHANGE MADE: ADDED STANDARD SQL MESSAGE DISPLAYS SO    * 00280000
002900*        SUPPORT PERSON COULD DETERMINE THE CAUSE OF THE ABEND. * 00290000
003000*        MADE BY: NANCY EILBES            WR/IR #: P000255227   * 00300000
003100*                                                               * 00310000
003200*    DATE  06/27/2008                                           * 00320000
003300*    CHANGE MADE: MODIFIED LOGIC THAT WAS CONTROLLING WHETHER TO* 00330000
003400*    CREATE A LOAD RECORD TO COMPARE EXTENDED COST AND 1ST COST * 00340000
003500*    AS UNEQUAL RATHER THAN EXTENDED COST GREATER THAN 1ST COST.* 00350000
003600*    IN THE CASE OF AN ADJUSTMENT WITH NEGATIVE AMOUNTS, THE    * 00360000
003700*    EXTENDED COST WAS LESS THAN THE FIRST COST SO NO LOAD WAS  * 00370000
003800*    CREATED, EVEN THOUGH IT SHOULD HAVE BEEN.                  * 00380000
003900*    MADE BY: NANCY EILBES            WR/IR #: INC000000417637  * 00390000
004000*                                                               * 00400000
004100*DATE  08/26/2014                                                *00410000
004200*    CHANGE MADE: MODIFIED LOGIC IN B200-PROCESS-RECEIPTS THAT   *00420000
004300*    USES PO TYPE TO DETERMINE WHICH COST FIELD TO USE TO REMOVE *00430000
004400*    PO TYPE CD FROM THE PATH USING UNIT COST SO IT WILL NOW USE *00440000
004500*    FIRST COST.  THIS CHANGE WILL CORRECT A BALANCING ISSUE THAT*00450000
004600*    HAS BEEN OCCURRING SINCE RMS13 WENT LIVE WITH ITS DIFFERENT *00460000
004700*    RULES ON MAINTAINING UNIT COST.                             *00470000
004800*    MADE BY: NANCY EILBES            WR/IR #: CHG0090736        *00480000
004900*                                                                *00490000
004910*DATE  10/07/2019                                                *00491000
004920*    CHANGE MADE: RENAMED GLKUT015 TO APKUT002.  COPYBOOK        *00492000
004930*    GLRD005 WAS RENAMED APRD006.  ALL LOGIC REMAINED THE SAME.  *00493000
004980*    MADE BY: NANCY EILBES            WR/IR #: CHG0233628        *00498000
004990*                                                                *00499000
004991*DATE  10/06/2021                                                *00499105
004992*    CHANGE MADE: MODIFIED LOGIC IN B200-PROCESS-RECEIPTS TO     *00499204
004993*    INCLUDE EXCLUSIVE BRAND POS (PURCHS-DERVD-LBL-TYP-CDE = 'E')*00499304
004994*    IN THE LOGIC TO CREATE THE PD LOAD RECORDS.                 *00499404
004996*    MADE BY: NANCY EILBES            WR/IR #: CHG0262261        *00499605
005000*                                                                *00500000
005100*----------------------------------------------------------------*00510000
005200                                                                  00520000
005300 ENVIRONMENT DIVISION.                                            00530000
005400 CONFIGURATION SECTION.                                           00540000
005500 SOURCE-COMPUTER. IBM-3090.                                       00550000
005600 OBJECT-COMPUTER. IBM-3090.                                       00560000
005700                                                                  00570000
005800*                                                                 00580000
005900 INPUT-OUTPUT SECTION.                                            00590000
006000 FILE-CONTROL.                                                    00600000
006100*                                                                 00610000
006200     SELECT PO-STORE-FILE        ASSIGN TO UT-S-INP01.            00620000
006300     SELECT RECEIPT-REFORM-FILE  ASSIGN TO UT-S-OUT01.            00630000
006400*                                                                 00640000
006500 DATA DIVISION.                                                   00650000
006600 FILE SECTION.                                                    00660000
006700*                                                                 00670000
006800*                                                                 00680000
006900 FD  PO-STORE-FILE                                                00690000
007000     RECORDING MODE IS F                                          00700000
007100     BLOCK CONTAINS 0 CHARACTERS                                  00710000
007200     LABEL RECORDS ARE STANDARD                                   00720000
007300     DATA RECORD IS PO-STORE-RECORD.                              00730000
007400*                                                                 00740000
007500 01  PO-STORE-RECORD           PIC X(300).                        00750000
007600*                                                                 00760000
007700 FD  RECEIPT-REFORM-FILE                                          00770000
007800     RECORDING MODE IS F                                          00780000
007900     BLOCK CONTAINS 0 CHARACTERS                                  00790000
008000     LABEL RECORDS ARE STANDARD                                   00800000
008100     DATA RECORD IS RECEIPTS-RECORD.                              00810000
008200*                                                                 00820000
008300 01  RECEIPTS-RECORD           PIC X(050).                        00830000
008400*                                                                 00840000
008500 WORKING-STORAGE SECTION.                                         00850000
008600                                                                  00860000
008700 01  PV-PROGRAM-VARIABLES.                                        00870000
008800     05  FILLER                PIC X(30)   VALUE                  00880000
008900         '** BEGINING OF APKUT002 W/S **'.                        00890000
009000                                                                  00900000
009100     05  PV-PO-NBR             PIC S9(9)   VALUE ZEROS            00910000
009200                                           COMP.                  00920000
009300     05  PV-PO-BEING-PROCESSED PIC  9(09)  VALUE ZEROS.           00930000
009400     05  PV-PO-COUNT-OUT-VE    PIC  9(9)   VALUE ZEROS.           00940000
009500     05  PV-PO-COUNT-OUT-LD    PIC  9(9)   VALUE ZEROS.           00950000
009600     05  PV-PO-COUNT-IN        PIC  9(9)   VALUE ZEROS.           00960000
009700                                                                  00970000
009800 01  PS-PROGRAM-SWITCHES.                                         00980000
009900     05  PS-OUT-OF-POS-SW      PIC  X(01)  VALUE ' '.             00990000
010000         88  OUT-OF-POS                    VALUE 'Y'.             01000000
010100         88  MORE-POS                      VALUE ' '.             01010000
010200                                                                  01020000
010300*---------------------------------------------------------------- 01030000
010400*    STORE EXTRACT FILE                                           01040000
010500*---------------------------------------------------------------- 01050000
010600     COPY  STOREEXT.                                              01060000
010700                                                                  01070000
010800*---------------------------------------------------------------- 01080000
010900*    GL VERIFIED RECEIPTS POST FILE                               01090000
011000*---------------------------------------------------------------- 01100000
011100     COPY  APRD006.                                               01110000
011200                                                                  01120000
011300*---------------------------------------------------------------- 01130000
011400*  WORKING STORAGE AREA FOR DPPD004                               01140000
011500*---------------------------------------------------------------- 01150000
011600     COPY DPWS004.                                                01160000
011700                                                                  01170000
011800*---------------------------------------------------------------- 01180000
011900*    TPURCHS DCLGEN                                               01190000
012000*---------------------------------------------------------------- 01200000
012100     EXEC SQL                                                     01210000
012200         INCLUDE TPURCHS                                          01220000
012300     END-EXEC.                                                    01230000
012400                                                                  01240000
012500*---------------------------------------------------------------- 01250000
012600*    SQL COMMUNICATIONS AREA DCLGEN                               01260000
012700*---------------------------------------------------------------- 01270000
012800     EXEC SQL                                                     01280000
012900         INCLUDE SQLCA                                            01290000
013000     END-EXEC.                                                    01300000
013100                                                                  01310000
013200*----------------------------------------------------------------*01320000
013300*  ABEND DATA AREAS                                              *01330000
013400*----------------------------------------------------------------*01340000
013500 01  ABEND-CODE                  PIC S9(04)  VALUE ZEROS          01350000
013600                                             COMP SYNC.           01360000
013700     88  AC-INVALID-DATA                     VALUE +4008.         01370000
013800     88  AC-DB2-ERROR                        VALUE +4013.         01380000
013900     88  AC-NO-INVOICES-ERROR                VALUE +4020.         01390000
014000                                                                  01400000
014100                                                                  01410000
014200 01  ABEND-AREAS.                                                 01420000
014300     05  AA-ABEND-LIT            PIC  X(40)  VALUE                01430000
014400             '*****       ABEND'.                                 01440000
014500     05  AA-PROGRAM-LIT          PIC  X(40)  VALUE                01450000
014600             '*****   PROGRAM: APKUT002'.                         01460000
014700     05  AA-PARAGRAPH-LIT.                                        01470000
014800         10  FILLER              PIC  X(17)  VALUE                01480000
014900             '***** PARAGRAPH: '.                                 01490000
015000         10  AA-PARAGRAPH-NAME   PIC  X(35)  VALUE SPACES.        01500000
015100     05  AA-MESSAGE-LINE.                                         01510000
015200         10  FILLER              PIC  X(06)  VALUE '*****'.       01520000
015300         10  AA-MESSAGE          PIC  X(127) VALUE SPACES.        01530000
015400     05  AA-DB2-ERROR-LIT        PIC  X(40)  VALUE                01540000
015500             '*****    DB2 ERROR'.                                01550000
015600     05  AA-DB2-OPERATION-LIT.                                    01560000
015700         10  FILLER              PIC  X(17)  VALUE                01570000
015800             '***** OPERATION: '.                                 01580000
015900         10  AA-DB2-OPERATION.                                    01590000
016000             15  AA-DB2-OP-1     PIC  X(50)  VALUE SPACES.        01600000
016100             15  AA-DB2-OP-2     PIC  X(25)  VALUE SPACES.        01610000
016200     05  AA-DB2-TABLE-1          PIC  X(08)  VALUE SPACES.        01620000
016300                                                                  01630000
016400 01  FILLER                      PIC  X(25)  VALUE                01640000
016500     '** END OF APKUT002 W/S **'.                                 01650000
016600                                                                  01660000
016700 PROCEDURE DIVISION.                                              01670000
016800                                                                  01680000
016900 A100-MAIN.                                                       01690000
017000                                                                  01700000
017100     PERFORM B100-INITIALIZE.                                     01710000
017200                                                                  01720000
017300     PERFORM B200-PROCESS-RECEIPTS                                01730000
017400       UNTIL OUT-OF-POS.                                          01740000
017500                                                                  01750000
017600     PERFORM B300-END-PROGRAM.                                    01760000
017700                                                                  01770000
017800     GOBACK.                                                      01780000
017900                                                                  01790000
018000*----------------------------------------------------------------*01800000
018100*    INITIALIZATION PROCESSING                                   *01810000
018200*    CALLED FROM A100-MAIN                                       *01820000
018300*----------------------------------------------------------------*01830000
018400 B100-INITIALIZE.                                                 01840000
018500                                                                  01850000
018600     OPEN INPUT  PO-STORE-FILE.                                   01860000
018700     OPEN OUTPUT RECEIPT-REFORM-FILE.                             01870000
018800                                                                  01880000
018900     INITIALIZE  DCLTPURCHS                                       01890000
019000                 PS-PROGRAM-SWITCHES.                             01900000
019100                                                                  01910000
019200     PERFORM R100-READ-EXTRACT-REC.                               01920000
019300                                                                  01930000
019400*----------------------------------------------------------------*01940000
019500*    FORMATS THE OUTPUT RECORD(*) AND WRITES THEM.               *01950000
019600*    CALLED FROM A100-MAIN                                       *01960000
019700*----------------------------------------------------------------*01970000
019800 B200-PROCESS-RECEIPTS.                                           01980000
019900                                                                  01990000
020000     INITIALIZE AP006-VERIFIED-RECEIPT-FILE.                      02000000
020100                                                                  02010000
020200     IF SE-PO NOT    = PV-PO-BEING-PROCESSED                      02020000
020300         MOVE SE-PO TO PV-PO-BEING-PROCESSED                      02030000
020400                       PV-PO-NBR                                  02040000
020500         PERFORM R900-GET-PO-INFO.                                02050000
020600                                                                  02060000
020700     MOVE 'VE'       TO AP006-AMT-TYP-CDE.                        02070000
020800     MOVE SE-LOC-NBR TO AP006-LOC-NBR.                            02080000
020900     MOVE SE-PO      TO AP006-PO-NBR.                             02090000
021000                                                                  02100000
021100     IF  PURCHS-PO-TYP-CDE = ('IM' OR 'IE' OR 'IF')               02110000
021200         MOVE SE-COST-EXTENSION     TO AP006-COST-AMT             02120000
021300         PERFORM W200-WRITE-RECEIPTS-SUM                          02130000
021400         ADD 1 TO PV-PO-COUNT-OUT-VE                              02140000
021500     ELSE                                                         02150000
021600         MOVE SE-1ST-COST-EXTENSION TO AP006-COST-AMT             02160000
021700         PERFORM W200-WRITE-RECEIPTS-SUM                          02170000
021800         ADD 1 TO PV-PO-COUNT-OUT-VE                              02180000
021900**       IF  PURCHS-OTB-PER-NBR       > '200801'                  02190004
022000         IF (PURCHS-DERVD-LBL-TYP-CDE = 'P'                       02200004
022010         OR  PURCHS-DERVD-LBL-TYP-CDE = 'E')                      02201004
022100         AND SE-COST-EXTENSION    NOT = SE-1ST-COST-EXTENSION     02210000
022200             MOVE 'LD'      TO AP006-AMT-TYP-CDE                  02220000
022300             COMPUTE AP006-COST-AMT =                             02230000
022400                 SE-COST-EXTENSION - SE-1ST-COST-EXTENSION        02240000
022500             PERFORM W200-WRITE-RECEIPTS-SUM                      02250000
022600             ADD 1 TO PV-PO-COUNT-OUT-LD                          02260000
022700         END-IF                                                   02270000
022800     END-IF.                                                      02280000
022900                                                                  02290000
023000     PERFORM R100-READ-EXTRACT-REC.                               02300000
023100                                                                  02310000
023200*----------------------------------------------------------------*02320000
023300*    ENDING PROCESSING: DISPLAYS COUNT OF POS AND CLOSES FILES.  *02330000
023400*    CALLED FROM A100-MAIN                                       *02340000
023500*----------------------------------------------------------------*02350000
023600 B300-END-PROGRAM.                                                02360000
023700                                                                  02370000
023800     DISPLAY '************************************************'.  02380000
023810     DISPLAY '     PROGRAM APKUT002 COMPLETES SUCCESSFULLY'.      02381000
023900     DISPLAY '     NBR OF POS READ     = ' PV-PO-COUNT-IN.        02390000
024000     DISPLAY '     NBR OF VE RECS RECS = ' PV-PO-COUNT-OUT-VE.    02400000
024100     DISPLAY '     NBR OF LD RECS RECS = ' PV-PO-COUNT-OUT-LD.    02410000
024200     DISPLAY '************************************************'.  02420000
024300                                                                  02430000
024400     CLOSE PO-STORE-FILE                                          02440000
024500           RECEIPT-REFORM-FILE.                                   02450000
024600                                                                  02460000
024700*----------------------------------------------------------------*02470000
024800*    RETRIEVES THE PURCHASE ORDERS TO BE PROCESSED.              *02480000
024900*    CALLED FROM B100-INITIALIZE AND B200-PROCESS-RECEIPTS       *02490000
025000*----------------------------------------------------------------*02500000
025100 R100-READ-EXTRACT-REC.                                           02510000
025200                                                                  02520000
025300     READ PO-STORE-FILE        INTO STORE-EXTRACT-LINE            02530000
025400         AT END SET OUT-OF-POS TO TRUE.                           02540000
025500                                                                  02550000
025600     IF MORE-POS                                                  02560000
025700        ADD 1 TO PV-PO-COUNT-IN                                   02570000
025800     END-IF.                                                      02580000
025900                                                                  02590000
026000*----------------------------------------------------------------*02600000
026100*    RETRIEVE PO TYPE INFORMATION.                                02610000
026200*    CALLED FROM C100-PROCESS-INPUT-POS                          *02620000
026300*----------------------------------------------------------------*02630000
026400 R900-GET-PO-INFO.                                                02640000
026500                                                                  02650000
026600     EXEC SQL                                                     02660000
026700         SELECT  OTB_PER_NBR                                      02670000
026800                ,PO_TYP_CDE                                       02680000
026900                ,DERVD_LBL_TYP_CDE                                02690000
027000           INTO :PURCHS-OTB-PER-NBR                               02700000
027100               ,:PURCHS-PO-TYP-CDE                                02710000
027200               ,:PURCHS-DERVD-LBL-TYP-CDE                         02720000
027300           FROM  TPURCHS                                          02730000
027400          WHERE  VER_STATUS_CDE = 'A'                             02740000
027500            AND  PO_NBR         = :PV-PO-NBR                      02750000
027600     END-EXEC.                                                    02760000
027700                                                                  02770000
027800     EVALUATE TRUE                                                02780000
027900         WHEN SQLCODE = ZERO                                      02790000
028000              CONTINUE                                            02800000
028100         WHEN SQLWARN0 NOT = SPACES                               02810000
028200         WHEN SQLCODE  NOT = ZERO                                 02820000
028300             MOVE 'R900-GET-PO-INFO'     TO AA-PARAGRAPH-NAME     02830000
028400             MOVE 'UNSUCCESSFUL SELECT ' TO AA-DB2-OP-1           02840000
028500             MOVE 'TPURCHS'              TO AA-DB2-TABLE-1        02850000
028600             PERFORM Z998-DB2-ABEND                               02860000
028700     END-EVALUATE.                                                02870000
028800                                                                  02880000
028900*----------------------------------------------------------------*02890000
029000*    WRITES THE PO/STORE RECEIPTS SUM RECORDS.                   *02900000
029100*    CALLED FROM C100-PROCESS-INPUT-POS                          *02910000
029200*----------------------------------------------------------------*02920000
029300 W200-WRITE-RECEIPTS-SUM.                                         02930000
029400                                                                  02940000
029500     WRITE RECEIPTS-RECORD FROM AP006-VERIFIED-RECEIPT-FILE.      02950000
029600                                                                  02960000
029700*----------------------------------------------------------------*02970000
029800*    ABEND ROUTINE FOR DB2 ERRORS                                *02980000
029900*    CALLED FROM R900-GET-PO-INFO                                *02990000
030000*----------------------------------------------------------------*03000000
030100 Z998-DB2-ABEND.                                                  03010000
030200                                                                  03020000
030300     DISPLAY 'PO BEING PROCESSED    = ' PV-PO-BEING-PROCESSED.    03030000
030400     DISPLAY AA-ABEND-LIT.                                        03040000
030500     DISPLAY AA-DB2-ERROR-LIT.                                    03050000
030600     DISPLAY AA-PROGRAM-LIT.                                      03060000
030700     DISPLAY AA-PARAGRAPH-LIT.                                    03070000
030800     DISPLAY AA-DB2-OPERATION-LIT.                                03080000
030900     DISPLAY AA-DB2-TABLE-1.                                      03090000
031000     SET AC-DB2-ERROR TO TRUE.                                    03100000
031100                                                                  03110000
031200     COPY DPPD004.                                                03120000
031300                                                                  03130000
031400     CALL 'ILBOABN0' USING ABEND-CODE.                            03140000
031500                                                                  03150000
