000100 IDENTIFICATION DIVISION.                                         00010002
000200 PROGRAM-ID.     APKUT222.                                        00020002
000300 AUTHOR.         ROBIN BERNOSKI.                                  00030002
000400 DATE-WRITTEN.   10/20/2000.                                      00040002
000500 DATE-COMPILED.                                                   00050002
000600***************************************************************** 00060002
000700*  COBOL 2 WITH SQL                                             * 00070002
000800*                                                               * 00080002
000900*  EXTRACT LI & FUNG MERCHANDISE AND COMMISSION INVOICES ENTERED* 00090026
001000*  DURING THE WEEK                                              * 00100002
001100*                                                               * 00110002
001200*  CREATE FILE OF ALL LI & FUNG INVOICES ENTERED DURING THE PAST* 00120026
001300*  WEEK AND FORMAT THEM INTO AN OUTPUT FILE THAT CAN BE         * 00130002
001400*  TRANSFERRED TO THE SERVER.                                   * 00140002
001500*                                                               * 00150002
001600* OUTPUT LAYOUT:                                                * 00160002
001700*     APRD017                                                   * 00170002
001800*                                                               * 00180002
001900***************************************************************** 00190002
002000*---------------------------------------------------------------* 00200002
002100* CHANGE LOG:                                                   * 00210002
002200*                                                               * 00220002
002300* DATE  06/15/01                                                * 00230023
002400*     ADDED LOGIC TO WRITE ONE INITIALIZED RECORD AS THE FIRST  * 00240023
002500*     RECORD OF THE OUTPUT FILE.  THIS WAS NECESSARY BECAUSE    * 00250023
002600*     SOMETIMES THE FILE COULD NOT BE OPENED IN EXCEL DUE TO    * 00260023
002700*     A 'SYLK' ERROR THAT ONLY OCCURRED WHEN THE FIRST TWO      * 00270023
002800*     POSITIONS OF THE FIRST RECORD CONTAINED THE VALUE 'ID'.   * 00280023
002900*     SOMETIMES THE INVOICE NUMBERS START WITH 'ID', SO THE     * 00290023
003000*     INITIALIZED RECORD WILL PREVENT THIS ERROR.               * 00300023
003100*     MADE BY: NANCY EILBES            WR/IR #: 20704           * 00310023
003200*                                                               * 00320024
003300*     06/17/2002                                                * 00330024
003400*        ARK PO PROJECT PHASE 1.  RECOMPILE FROM PRODUCTION.    * 00340024
003500*     MADE BY: KEVIN CATLIN                    WR# 23500        * 00350024
003600*                                                               * 00360024
003700*     06/18/2002                                                * 00370025
003800*        REMOVED TABLE TPAYREQ - COLUMN REFERENCES REPLACED     * 00380025
003900*        WITH CORRESPONDING TINVOIC COLUMNS.                    * 00390025
004000*     MADE BY: NANCY EILBES                    WR# 23500        * 00400025
004100*                                                               * 00410026
004200* DATE  01/24/2005                                              * 00420026
004300*     CHANGE MADE: RENAMED ALL REFERENCES OF 'COLBY' TO 'LI &   * 00430026
004400*     FUNG'.  LI & FUNG IS THE PARENT COMPANY OF COLBY.         * 00440026
004500*     MADE BY: MIKE BESKE              WR/IR #: WR28114         * 00450027
004600*                                                               * 00460025
004700*---------------------------------------------------------------* 00470002
004800                                                                  00480002
004900 ENVIRONMENT DIVISION.                                            00490002
005000 CONFIGURATION SECTION.                                           00500002
005100 SOURCE-COMPUTER.    IBM-3090.                                    00510002
005200 OBJECT-COMPUTER.    IBM-3090.                                    00520002
005300                                                                  00530002
005400 INPUT-OUTPUT SECTION.                                            00540002
005500 FILE-CONTROL.                                                    00550002
005600     SELECT LIFUNG-INVC-FILE            ASSIGN TO UT-S-OUT01.     00560026
005700                                                                  00570002
005800 DATA DIVISION.                                                   00580002
005900 FILE SECTION.                                                    00590002
006000                                                                  00600002
006100 FD  LIFUNG-INVC-FILE                                             00610026
006200     RECORDING MODE IS F                                          00620002
006300     LABEL RECORDS ARE STANDARD                                   00630002
006400     DATA RECORD IS RECYC-VCHR-REC.                               00640002
006500 01  LIFUNG-INVC-REC             PIC  X(64).                      00650026
006600                                                                  00660002
006700 WORKING-STORAGE SECTION.                                         00670002
006800                                                                  00680002
006900 01  PV-PROGRAM-VARIABLES.                                        00690002
007000     05  FILLER                    PIC  X(31)  VALUE              00700002
007100         '** BEGINNING OF APKUT222 W/S **'.                       00710002
007200     05  PV-PROGRAM-NAME           PIC  X(08)  VALUE 'APKUT222'.  00720002
007300     05  PV-CURRENT-DATE.                                         00730002
007400         10  PV-CURRENT-YEAR     PIC  9(02)  VALUE ZEROS.         00740002
007500         10  PV-CURRENT-MONTH    PIC  9(02)  VALUE ZEROS.         00750002
007600         10  PV-CURRENT-DAY      PIC  9(02)  VALUE ZEROS.         00760002
007700     05  PV-CURRENT-TIME.                                         00770002
007800         10  PV-CURRENT-HOUR     PIC  9(02)  VALUE ZEROS.         00780002
007900         10  PV-CURRENT-MINUTE   PIC  9(02)  VALUE ZEROS.         00790002
008000         10  FILLER              PIC  9(02)  VALUE ZEROS.         00800002
008100     05  PV-START-DATE           PIC  X(10)  VALUE SPACE.         00810022
008200     05  PV-END-DATE             PIC  X(10)  VALUE SPACE.         00820002
008300                                                                  00830022
008400 01  PC-COUNTERS.                                                 00840022
008500     05  PC-MAX-LINES              PIC S9(03)  VALUE +60          00850022
008600                                               COMP-3.            00860022
008700     05  PC-LINE-COUNT             PIC S9(03)  VALUE +99          00870022
008800                                               COMP-3.            00880022
008900     05  PC-PAGE-COUNT             PIC S9(05)  VALUE ZEROS        00890022
009000                                               COMP-3.            00900022
009100     05  PC-COUNT-LIFUNG-INVC-READ PIC  9(07)  VALUE ZEROS.       00910026
009200     05  PC-COUNT-INV-WRITTEN      PIC  9(07)  VALUE ZEROS.       00920022
009300                                                                  00930022
009400 01  PS-PROGRAM-SWITCHES.                                         00940022
009500     05  PS-END-OF-LIFUNG-SW     PIC X(01)        VALUE 'N'.      00950026
009600         88  MORE-LIFUNG-CSR                      VALUE 'N'.      00960026
009700         88  END-OF-LIFUNG-CSR                    VALUE 'Y'.      00970026
009800                                                                  00980022
009900*----------------------------------------------------------------*00990022
010000*  COMMUNICATIONS AREA2 FOR DB2                                  *01000022
010100*----------------------------------------------------------------*01010022
010200     COPY SQLCA2.                                                 01020022
010300                                                                  01030022
010400     EXEC SQL                                                     01040022
010500          INCLUDE SQLCA                                           01050022
010600     END-EXEC.                                                    01060022
010700                                                                  01070022
010800*----------------------------------------------------------------*01080022
010900*  AP CONTROL TABLE                                              *01090022
011000*----------------------------------------------------------------*01100022
011100     EXEC SQL                                                     01110022
011200          INCLUDE TAPCNTL                                         01120022
011300     END-EXEC.                                                    01130022
011400                                                                  01140022
011500*----------------------------------------------------------------*01150022
011600*  INVOICE TABLE                                                 *01160022
011700*----------------------------------------------------------------*01170022
011800     EXEC SQL                                                     01180022
011900          INCLUDE TINVOIC                                         01190022
012000     END-EXEC.                                                    01200022
012100                                                                  01210022
012200*----------------------------------------------------------------*01220022
012300*   LIFUNG_CSR SELECTS ALL INVOICES ENTERED THROUGHOUT THE PAST  *01230026
012400*   WEEK BASED UPON THE START AND END DATES.                     *01240022
012500*----------------------------------------------------------------*01250022
012600     EXEC SQL                                                     01260022
012700       DECLARE LIFUNG_CSR CURSOR FOR                              01270026
012800         SELECT INVC_ID                                           01280025
012900               ,CRE_DTE                                           01290025
013000               ,INVC_TYP_CDE                                      01300025
013100               ,GRO_COST_AMT                                      01310025
013200               ,INVC_NET_COST_AMT                                 01320025
013300         FROM   TINVOIC IV                                        01330022
013400         WHERE  RMIT_VND_ID   = '009206194'                       01340025
013500           AND  ENTR_MTHD_CDE IN ('ED','EE')                      01350025
013600           AND  CRE_DTE       BETWEEN :PV-START-DATE AND          01360029
013700                                      :PV-END-DATE                01370029
013800     END-EXEC.                                                    01380022
013900                                                                  01390022
014000*----------------------------------------------------------------*01400022
014100*  RECORD LAYOUT FOR LIFUNG INVOICE FILE (OUTPUT)                *01410026
014200*----------------------------------------------------------------*01420022
014300     COPY APRD017.                                                01430022
014400                                                                  01440022
014500*----------------------------------------------------------------*01450022
014600*  ABEND DATA AREAS                                              *01460022
014700*----------------------------------------------------------------*01470022
014800 01  ABEND-CODE                  PIC S9(04)  VALUE ZEROS          01480022
014900                                             COMP SYNC.           01490022
015000     88  AC-BAD-DATA                         VALUE +4003.         01500022
015100     88  AC-DB2-ERROR                        VALUE +4013.         01510022
015200                                                                  01520022
015300 01  ABEND-AREAS.                                                 01530022
015400     05  AA-ABEND-LIT            PIC  X(40)  VALUE                01540022
015500             '*****       ABEND'.                                 01550022
015600     05  AA-PROGRAM-LIT          PIC  X(40)  VALUE                01560022
015700             '*****   PROGRAM: APKUT222'.                         01570022
015800     05  AA-PARAGRAPH-LIT.                                        01580022
015900         10  FILLER              PIC  X(17)  VALUE                01590022
016000             '***** PARAGRAPH: '.                                 01600022
016100         10  AA-PARAGRAPH-NAME   PIC  X(35)  VALUE SPACES.        01610022
016200     05  AA-MESSAGE-LINE.                                         01620022
016300         10  FILLER              PIC  X(06)  VALUE '*****'.       01630022
016400         10  AA-MESSAGE          PIC  X(127) VALUE SPACES.        01640022
016500     05  AA-DB2-ERROR-LIT        PIC  X(40)  VALUE                01650022
016600             '*****    DB2 ERROR'.                                01660022
016700     05  AA-DB2-OPERATION-LIT.                                    01670022
016800         10  FILLER              PIC  X(17)  VALUE                01680022
016900             '***** OPERATION: '.                                 01690022
017000         10  AA-DB2-OPERATION.                                    01700022
017100             15  AA-DB2-OP-1     PIC  X(25)  VALUE SPACES.        01710022
017200             15  AA-DB2-OP-2     PIC  X(25)  VALUE SPACES.        01720022
017300     05  AA-DB2-TABLE-1          PIC  X(08)  VALUE SPACES.        01730022
017400     05  AA-DB2-TABLE-2          PIC  X(08)  VALUE SPACES.        01740022
017500     05  AA-DB2-TABLE-3          PIC  X(08)  VALUE SPACES.        01750022
017600                                                                  01760022
017700     COPY DPWS004.                                                01770022
017800 01  FILLER                      PIC  X(25)  VALUE                01780022
017900     '** END OF APKUT222 W/S **'.                                 01790022
018000                                                                  01800022
018100 PROCEDURE DIVISION.                                              01810022
018200 A100-MAIN.                                                       01820022
018300     PERFORM B100-INITIALIZATION.                                 01830022
018400                                                                  01840022
018500     PERFORM B200-PROCESS-LIFUNG-INV                              01850026
018600       UNTIL END-OF-LIFUNG-CSR.                                   01860026
018700                                                                  01870022
018800     PERFORM B300-END-PROGRAM.                                    01880022
018900                                                                  01890022
019000     GOBACK.                                                      01900022
019100                                                                  01910022
019200 B100-INITIALIZATION.                                             01920022
019300*----------------------------------------------------------------*01930022
019400*    OPEN OUTPUT FILE AND PERFORM INITIALIZATION.                *01940022
019500*----------------------------------------------------------------*01950022
019600     OPEN OUTPUT LIFUNG-INVC-FILE.                                01960026
019700                                                                  01970022
019800     INITIALIZE DCLTINVOIC                                        01980022
019900                AP017-LIFUNG-INVOICE-RECORD.                      01990026
020000                                                                  02000022
020100     PERFORM S100-GET-DATES.                                      02010022
020200                                                                  02020022
020300** THIS INITIAL WRITE PUTS A RECORD OF INITIALIZED VALUES AS THE  02030023
020400** FIRST RECORD ON THE FILE.                                      02040023
020500     MOVE ',' TO DELIMIT-01  DELIMIT-02                           02050023
020600                 DELIMIT-03  DELIMIT-04.                          02060023
020700     PERFORM W100-WRITE-LIFUNG-INVC-REC.                          02070026
020800                                                                  02080023
020900     PERFORM Y100-OPEN-LIFUNG-CSR.                                02090026
021000                                                                  02100022
021100     PERFORM R100-FETCH-LIFUNG-INVC.                              02110026
021200     IF END-OF-LIFUNG-CSR                                         02120026
021300         DISPLAY '***  APKUT222  ***'                             02130022
021400         DISPLAY 'FIRST FETCH OF LI & FUNG CURSOR   '             02140026
021500         DISPLAY 'NO LI & FUNG INVOICES FOUND         '           02150026
021600         DISPLAY ' '                                              02160022
021700     END-IF.                                                      02170022
021800                                                                  02180022
021900 B200-PROCESS-LIFUNG-INV.                                         02190026
022000*----------------------------------------------------------------*02200022
022100*    CREATING OUTPUT FILE BY MOVING FIELDS FETCHED INTO THEIR    *02210022
022200*    CORRESPONDING COPYBOOK FIELDS.                              *02220022
022300*----------------------------------------------------------------*02230022
022400     INITIALIZE AP017-LIFUNG-INVOICE-RECORD.                      02240026
022500                                                                  02250022
022600     MOVE INVOIC-INVC-ID           TO AP017-INVC-ID.              02260022
022700     MOVE ','                      TO DELIMIT-01.                 02270022
022800     MOVE INVOIC-INVC-TYP-CDE      TO AP017-INVC-TYP-CDE.         02280022
022900     MOVE ','                      TO DELIMIT-02.                 02290022
023000     MOVE INVOIC-CRE-DTE           TO AP017-ENTR-DTE.             02300025
023100     MOVE ','                      TO DELIMIT-03.                 02310022
023200     MOVE INVOIC-GRO-COST-AMT      TO AP017-GROSS-COST-AMT.       02320022
023300     MOVE ','                      TO DELIMIT-04.                 02330022
023400     MOVE INVOIC-INVC-NET-COST-AMT TO AP017-NET-COST-AMT.         02340022
023500                                                                  02350022
023600     PERFORM W100-WRITE-LIFUNG-INVC-REC.                          02360026
023700                                                                  02370022
023800     PERFORM R100-FETCH-LIFUNG-INVC.                              02380026
023900                                                                  02390022
024000 B300-END-PROGRAM.                                                02400022
024100*----------------------------------------------------------------*02410022
024200*    ENDING PROCESSING: DISPLAYS COUNTS, AND CLOSES FILES.       *02420022
024300*----------------------------------------------------------------*02430022
024400     CLOSE LIFUNG-INVC-FILE.                                      02440026
024500                                                                  02450022
024600     DISPLAY '       '                                            02460022
024700     DISPLAY '**********************************'                 02470022
024800     DISPLAY '** APKUT222 SUMMARY **'.                            02480022
024900     DISPLAY 'START DATE = ' PV-START-DATE                        02490022
025000     DISPLAY 'END DATE   = ' PV-END-DATE                          02500022
025100     DISPLAY 'LI & FUNG INVC FETCHED = '                          02510026
025200                                       PC-COUNT-LIFUNG-INVC-READ. 02520026
025300     DISPLAY 'TOTAL RECORDS WRITTEN  = '                          02530026
025400                                       PC-COUNT-INV-WRITTEN.      02540026
025500     DISPLAY '**********************************'                 02550026
025600     DISPLAY '       '                                            02560026
025700                                                                  02570026
025800     PERFORM Y200-CLOSE-LIFUNG-CSR.                               02580026
025900                                                                  02590026
026000 R100-FETCH-LIFUNG-INVC.                                          02600026
026100*----------------------------------------------------------------*02610026
026200*  RETRIEVES THE LIFUNG_CSR DATA                                 *02620026
026300*----------------------------------------------------------------*02630026
026400     EXEC SQL                                                     02640026
026500         FETCH   LIFUNG_CSR                                       02650026
026600          INTO  :INVOIC-INVC-ID                                   02660026
026700               ,:INVOIC-CRE-DTE                                   02670026
026800               ,:INVOIC-INVC-TYP-CDE                              02680026
026900               ,:INVOIC-GRO-COST-AMT                              02690026
027000               ,:INVOIC-INVC-NET-COST-AMT                         02700026
027100     END-EXEC.                                                    02710026
027200                                                                  02720026
027300     EVALUATE TRUE                                                02730026
027400         WHEN SQLCODE = ZERO                                      02740026
027500             ADD 1 TO PC-COUNT-LIFUNG-INVC-READ                   02750026
027600         WHEN SQLCODE = +100                                      02760026
027700             SET END-OF-LIFUNG-CSR TO TRUE                        02770026
027800                                                                  02780026
027900         WHEN SQLWARN0 NOT = SPACES                               02790026
028000         WHEN SQLCODE  NOT = ZERO                                 02800026
028100             MOVE 'R100-FETCH-LIFUNG-INVC'                        02810026
028200                                        TO AA-PARAGRAPH-NAME      02820026
028300             MOVE 'UNSUCCESSFUL FETCH WITH LIFUNG_CSR'            02830026
028400                                        TO AA-DB2-OPERATION       02840026
028500             MOVE 'TINVOIC'             TO AA-DB2-TABLE-1         02850026
028600             PERFORM Z998-DB2-ABEND                               02860026
028700     END-EVALUATE.                                                02870026
028800                                                                  02880026
028900 S100-GET-DATES.                                                  02890026
029000*----------------------------------------------------------------*02900026
029100*    SELECT THE BTCH-PRCS-DTE BY BOTH SUBTRACTING FIVE DAYS AND  *02910026
029200*    ADDING ONE DAY IN ORDER TO DETERMINE THE START AND END      *02920026
029300*    DATES RESPECTIVELY.                                         *02930026
029400*----------------------------------------------------------------*02940026
029500                                                                  02950026
029600         EXEC SQL                                                 02960026
029700             SELECT  (BTCH_PRC_DTE - 5 DAYS)                      02970026
029800                    ,(BTCH_PRC_DTE + 1 DAYS)                      02980026
029900               INTO  :PV-START-DATE                               02990026
030000                    ,:PV-END-DATE                                 03000026
030100               FROM  TAPCNTL                                      03010026
030200         END-EXEC.                                                03020026
030300                                                                  03030026
030400         EVALUATE TRUE                                            03040026
030500           WHEN SQLCODE = ZERO                                    03050026
030600             CONTINUE                                             03060026
030700           WHEN SQLWARN0 NOT = SPACES                             03070026
030800           WHEN SQLCODE NOT  = ZERO                               03080026
030900             MOVE 'S100-GET-DATES'                                03090026
031000                                 TO AA-PARAGRAPH-NAME             03100026
031100             MOVE 'UNSUCCESSFUL SELECT'                           03110026
031200                                 TO AA-DB2-OPERATION              03120026
031300             MOVE 'TAPCNTL'      TO AA-DB2-TABLE-1                03130026
031400             MOVE SPACES         TO AA-DB2-TABLE-2                03140026
031500                                    AA-DB2-TABLE-3                03150026
031600             PERFORM Z998-DB2-ABEND                               03160026
031700         END-EVALUATE.                                            03170026
031800                                                                  03180026
031900 W100-WRITE-LIFUNG-INVC-REC.                                      03190026
032000*----------------------------------------------------------------*03200026
032100*    WRITE THE CONTROL UPDATE REJECT RECORDS TO THE FILE         *03210026
032200*----------------------------------------------------------------*03220026
032300                                                                  03230026
032400     WRITE LIFUNG-INVC-REC FROM AP017-LIFUNG-INVOICE-RECORD.      03240026
032500                                                                  03250026
032600     ADD 1 TO PC-COUNT-INV-WRITTEN.                               03260026
032700                                                                  03270026
032800     INITIALIZE AP017-LIFUNG-INVOICE-RECORD.                      03280026
032900                                                                  03290026
033000 Y100-OPEN-LIFUNG-CSR.                                            03300026
033100*---------------------------------------------------------------- 03310026
033200*    OPEN RECYCLE_CSR CURSOR.                                     03320026
033300*---------------------------------------------------------------- 03330026
033400                                                                  03340026
033500     EXEC SQL                                                     03350026
033600         OPEN LIFUNG_CSR                                          03360026
033700     END-EXEC.                                                    03370026
033800                                                                  03380026
033900     EVALUATE TRUE                                                03390026
034000         WHEN SQLCODE = ZERO                                      03400026
034100             CONTINUE                                             03410026
034200         WHEN SQLWARN0 NOT = SPACES                               03420026
034300         WHEN SQLCODE  NOT = ZERO                                 03430026
034400             MOVE 'Y100-OPEN-LIFUNG-CSR'                          03440026
034500                                 TO AA-PARAGRAPH-NAME             03450026
034600             MOVE 'UNSUCCESSFUL OPEN ON LIFUNG_CSR'               03460026
034700                                 TO AA-DB2-OPERATION              03470026
034800             MOVE 'TINVOIC'      TO AA-DB2-TABLE-1                03480026
034900             MOVE SPACES         TO AA-MESSAGE                    03490026
035000             PERFORM Z998-DB2-ABEND                               03500026
035100     END-EVALUATE.                                                03510026
035200                                                                  03520026
035300 Y200-CLOSE-LIFUNG-CSR.                                           03530026
035400*---------------------------------------------------------------- 03540026
035500*    CLOSE THE LIFUNG_CSR CURSOR.                               * 03550026
035600*---------------------------------------------------------------- 03560026
035700                                                                  03570026
035800     EXEC SQL                                                     03580026
035900         CLOSE LIFUNG_CSR                                         03590026
036000     END-EXEC.                                                    03600026
036100                                                                  03610026
036200     EVALUATE TRUE                                                03620026
036300         WHEN SQLCODE = ZERO                                      03630026
036400              CONTINUE                                            03640026
036500                                                                  03650026
036600         WHEN SQLWARN0 NOT = SPACES                               03660026
036700         WHEN SQLCODE  NOT = ZERO                                 03670026
036800             MOVE 'Y200-CLOSE-LIFUNG-CSR'                         03680026
036900                                 TO AA-PARAGRAPH-NAME             03690026
037000             MOVE 'UNSUCCESSFUL CLOSE ON LIFUNG_CSR'              03700026
037100                                 TO AA-DB2-OPERATION              03710026
037200             MOVE 'TINVOIC'      TO AA-DB2-TABLE-1                03720026
037300             MOVE SPACES         TO AA-MESSAGE                    03730026
037400             PERFORM Z998-DB2-ABEND                               03740026
037500     END-EVALUATE.                                                03750026
037600                                                                  03760026
037700 Z998-DB2-ABEND.                                                  03770026
037800*----------------------------------------------------------------*03780026
037900*    ABEND ROUTINE FOR DB2 ERRORS                                *03790026
038000*----------------------------------------------------------------*03800026
038100     CLOSE LIFUNG-INVC-FILE.                                      03810026
038200                                                                  03820026
038300     DISPLAY AA-ABEND-LIT.                                        03830026
038400     DISPLAY AA-DB2-ERROR-LIT.                                    03840026
038500     DISPLAY AA-PROGRAM-LIT.                                      03850026
038600     DISPLAY AA-PARAGRAPH-LIT.                                    03860026
038700     DISPLAY AA-DB2-OPERATION-LIT.                                03870026
038800     DISPLAY AA-DB2-TABLE-1.                                      03880026
038900     DISPLAY AA-DB2-TABLE-2.                                      03890026
039000     DISPLAY AA-DB2-TABLE-3.                                      03900026
039100     SET AC-DB2-ERROR TO TRUE.                                    03910026
039200                                                                  03920026
039300     COPY DPPD004.                                                03930026
039400                                                                  03940026
039500     CALL 'ILBOABN0' USING ABEND-CODE.                            03950026
039600                                                                  03960026
