000100 IDENTIFICATION DIVISION.                                         00010038
000200 PROGRAM-ID.     APKUT045.                                        00020038
000300 AUTHOR.         PAM VOLK.                                        00030038
000400 DATE-WRITTEN.   02/03/1997.                                      00040038
000500 DATE-COMPILED.                                                   00050038
000600*************************************************************     00060038
000700*    COBOL 2                                                *     00070038
000800*                                                           *     00080038
000900* SUMMARIZE UNJOURNALIZED RECEIPTS BY FISCAL PERIOD         *     00090038
001000*                                                           *     00100038
001100*  --- PURPOSE IS TO:                                       *     00110038
001200*    CREATE A SUMMARIZED UNJOURNALIZED AND NI RECEIPT       *     00120038
001300*    FILE BY FISCAL PERIOD                                  *     00130038
001400*  --- DESCRIPTION OF FLOW:                                 *     00140038
001500*    READ IN THE UNJLZD RECEIPT FILE AND DETERMINE          *     00150038
001600*    WHAT FISCAL PERIOD EACH RECEIPT BELONGS IN.  ACCUMULATE*     00160038
001700*    THE RETAIL AMOUNT (CALCRTL), COST AMOUNT (CALCOST)     *     00170038
001800*    AND THE ITEM QUANTITY (POEQTYV) BY FISCAL PERIOD.      *     00180038
001900*                                                           *     00190038
002000* INPUT:                                                    *     00200038
002100*  1. UNJRNLZD-FILE                       (APRD042)         *     00210038
002200*                                                           *     00220038
002300* OUTPUT:                                                   *     00230038
002400*  1. RECEIPT-SUM-FILE                    (APRD030)         *     00240038
002500*                                                           *     00250038
002600*************************************************************     00260038
002700*-----------------------------------------------------------------00270038
002800* CHANGE LOG:                                                     00280038
002900*                                                                 00290038
003000* 02/03/97  INITIAL VERSION                                       00300038
003100*           BY:  PDVOLK                       WR/PIT 3803         00310038
003200*                                                                 00320038
003300* 02/03/98   ROBIN BERNOSKI                  WR/IR #: WR5703      00330038
003400*            - MODIFIED THE MANNER IN WHICH THE STANDARD DATE     00340038
003500*              ROUTINE, DPKUT500, IS TO BE CALLED WITHIN A        00350038
003600*              PROGRAM SO THAT THE CALL IS DYNAMIC.               00360038
003700*                                                                 00370038
003800* 08/05/99   ROBIN BERNOSKI                  WR/IR #: WR6041      00380038
003900*            - Y2K.   REPLACED THE INTRANEX COPYBOOK WITH THE     00390038
004000*              APRD042 COPYBOOK.                                  00400038
004100*                                                                 00410038
004200* 12/08/1999 JILL JUEL                   WR/IR #: WR6041          00420038
004300*            - MODIFIED THE CHECK ON THE DATE ROUTINE TO          00430038
004400*              CONFORM WITH Y2K STANDARDS BY ADDING               00440038
004500*              DPG54-WARNING-ERROR.                               00450038
004600*                                                                 00460038
004700*                                                                 00470038
004800* 01/31/2000 ROBIN BERNOSKI              WR/IR #: PM00340207      00480038
004900*            - MODIFIED THE PROGRAM TO CHANGE PV-FP-YEAR TO       00490038
005000*              A FOUR DIGIT FIELD AND MOVED PIECES OF IT TO       00500038
005100*              THE OUTPUT FILE IN ORDER TO CORRECTLY POPULATE     00510038
005200*              TO CENTURY AND YEAR FIELDS.                        00520038
005300*                                                                 00530038
005400* 02/06/2003                                                      00540038
005500*    CHANGE MADE: ARKPO PHASE3 PROJECT.                           00550038
005600*    ADDED THE PGM TITLE TO MATCH THE SPEC TITLE.                 00560038
005700*    UPDATED PGM COMMENT BLOCK WITH THE FILENAMES. RECOMPILED     00570038
005800*    THE PROGRAM TO PICK UP THE MODIFIED COPYBOOK.                00580038
005900* MADE BY:  MIKE BESKE                          WR#: 23500        00590038
006000*                                                                 00600039
006100* 05/21/2004  CHANGED MADE: STORE CONSTRAINTS PROJECT             00610039
006200*             RECOMPILED THIS PROGRAM TO PICK UP THE APRD042      00620039
006300*             COPYBOOK MODIFICATIONS.                             00630039
006400*             MADE BY: MIKE BESKE             WR/IR #:25805       00640039
006000*                                                                 00641040
006100* 09/09/2021  CHANGED MADE: RECOMPILE FOR NEW COPY OF APRD042     00642040
006400*             MADE BY: JEAN KURK              CHG0260549          00645040
006500*---------------------------------------------------------------  00650038
006600   EJECT                                                          00660038
006700 ENVIRONMENT DIVISION.                                            00670038
006800 CONFIGURATION SECTION.                                           00680038
006900 SOURCE-COMPUTER.    IBM-3090.                                    00690038
007000 OBJECT-COMPUTER.    IBM-3090.                                    00700038
007100                                                                  00710038
007200 INPUT-OUTPUT SECTION.                                            00720038
007300 FILE-CONTROL.                                                    00730038
007400     SELECT UNJRNLZD-FILE        ASSIGN TO UT-S-INP01.            00740038
007500     SELECT RECEIPT-SUM-FILE     ASSIGN TO UT-S-OUT01.            00750038
007600                                                                  00760038
007700 EJECT                                                            00770038
007800 DATA DIVISION.                                                   00780038
007900 FILE SECTION.                                                    00790038
008000                                                                  00800038
008100 FD  UNJRNLZD-FILE                                                00810038
008200     RECORDING MODE IS F                                          00820038
008300     LABEL RECORDS ARE STANDARD                                   00830038
008400     BLOCK CONTAINS 0 RECORDS                                     00840038
008500     DATA RECORD IS UNJRNLZD-REC.                                 00850038
008600 01  UNJRNLZD-REC.                                                00860038
008700     05  FILLER                       PIC  X(120).                00870038
008800                                                                  00880038
008900                                                                  00890038
009000 FD  RECEIPT-SUM-FILE                                             00900038
009100     RECORDING MODE IS F                                          00910038
009200     LABEL RECORDS ARE STANDARD                                   00920038
009300     BLOCK CONTAINS 0 RECORDS                                     00930038
009400     DATA RECORD IS APRD030-REC.                                  00940038
009500 01  APRD030-REC.                                                 00950038
009600     05  FILLER                       PIC  X(70).                 00960038
009700                                                                  00970038
009800 EJECT                                                            00980038
009900 WORKING-STORAGE SECTION.                                         00990038
010000                                                                  01000038
010100 01  PV-PROGRAM-VARIABLES.                                        01010038
010200     05  FILLER                         PIC  X(30)  VALUE         01020038
010300         '** BEGINING OF APKUT045 W/S **'.                        01030038
010400                                                                  01040038
010500                                                                  01050038
010600 01  PC-PROGRAM-CONSTANTS.                                        01060038
010700     05  PC-PROGRAM-NAME            PIC  X(08)  VALUE 'APKUT045'. 01070038
010800                                                                  01080038
010900 01  PS-PROGRAM-SWITCHES.                                         01090038
011000     05  PS-OUT-OF-UNJRNLZD-SW      PIC X(01) VALUE 'M'.          01100038
011100         88  OUT-OF-UNJRNLZD                  VALUE 'O'.          01110038
011200         88  MORE-UNJRNLZD                    VALUE 'M'.          01120038
011300 EJECT                                                            01130038
011400 01  PA-RECORD-COUNTS.                                            01140038
011500     05  PA-IN-COUNT-DISP          PIC Z9(09)    VALUE ZEROS.     01150038
011600     05  PA-SUM-OUT-DISP           PIC Z9(09)    VALUE ZEROS.     01160038
011700                                                                  01170038
011800     05  PA-UNJRNLZD-IN-COUNT      PIC S9(09)    VALUE ZEROS.     01180038
011900     05  PA-SUM-OUT-COUNT          PIC S9(09)    VALUE ZEROS.     01190038
012000                                                                  01200038
012100 01  PA-ACCUM-TOTALS.                                             01210038
012200     05  PA-RCV-ACCUM-RETAIL       PIC S9(11)V99 VALUE ZEROS.     01220038
012300     05  PA-RCV-ACCUM-COST         PIC S9(11)V99 VALUE ZEROS.     01230038
012400     05  PA-RCV-ACCUM-QTY          PIC S9(09)    VALUE ZEROS.     01240038
012500     05  PA-NIR-ACCUM-RETAIL       PIC S9(11)V99 VALUE ZEROS.     01250038
012600     05  PA-NIR-ACCUM-COST         PIC S9(11)V99 VALUE ZEROS.     01260038
012700     05  PA-NIR-ACCUM-QTY          PIC S9(09)    VALUE ZEROS.     01270038
012800     05  PA-TOT-ACCUM-RETAIL       PIC S9(11)V99 VALUE ZEROS.     01280038
012900     05  PA-TOT-ACCUM-COST         PIC S9(11)V99 VALUE ZEROS.     01290038
013000     05  PA-TOT-ACCUM-QTY          PIC S9(09)    VALUE ZEROS.     01300038
013100                                                                  01310038
013200 01  PV-WORK-FIELDS.                                              01320038
013300     05  PV-INT-MKDATE9S           PIC  9(06)    VALUE ZEROS.     01330038
013400     05  PV-INT-MKDATE9 REDEFINES PV-INT-MKDATE9S.                01340038
013500         10  PV-INT-MKDT-MM        PIC  9(02).                    01350038
013600         10  PV-INT-MKDT-DD        PIC  9(02).                    01360038
013700         10  PV-INT-MKDT-YY        PIC  9(02).                    01370038
013800     05  PV-MKDATE-WITH-CC.                                       01380038
013900         10  PV-MKDT-CC            PIC  9(02)    VALUE ZEROS.     01390038
014000         10  PV-MKDT-YY            PIC  9(02)    VALUE ZEROS.     01400038
014100         10  PV-MKDT-MM            PIC  9(02)    VALUE ZEROS.     01410038
014200         10  PV-MKDT-DD            PIC  9(02)    VALUE ZEROS.     01420038
014300     05  PV-FIRST-FP-DATE.                                        01430038
014400         10  PV-FIRST-PER-CCYY     PIC  9(04)    VALUE ZEROS.     01440038
014500         10  FILLER                PIC  X(01)    VALUE '-'.       01450038
014600         10  PV-FIRST-PER-MM       PIC  9(02)    VALUE ZEROS.     01460038
014700         10  FILLER                PIC  X(01)    VALUE '-'.       01470038
014800         10  PV-FIRST-PER-DD       PIC  9(02)    VALUE ZEROS.     01480038
014900     05  PV-FP-YEAR                PIC  9(04)    VALUE ZEROS.     01490038
015000     05  PV-FP-NBR                 PIC  9(02)    VALUE ZEROS.     01500038
015100                                                                  01510038
015200 EJECT                                                            01520038
015300*---------------------------------------------------------------  01530038
015400*  UNJOURNALIZED RECEIPT EXTRACT RECORD - INTRANSIT               01540038
015500*---------------------------------------------------------------  01550038
015600     COPY APRD042.                                                01560038
015700 EJECT                                                            01570038
015800*----------------------------------------------------------------*01580038
015900* WORKING STORAGE FOR DATE ROUTINE                                01590038
016000*----------------------------------------------------------------*01600038
016100     COPY DPWS500.                                                01610038
016200 EJECT                                                            01620038
016300*---------------------------------------------------------------  01630038
016400*  ABEND DATA AREAS                                               01640038
016500*---------------------------------------------------------------  01650038
016600 01  ABEND-CODE                  PIC S9(04)  VALUE ZEROS          01660038
016700                                             COMP SYNC.           01670038
016800     88  AC-DATE-ERROR                       VALUE +4019.         01680038
016900                                                                  01690038
017000 01  ABEND-AREAS.                                                 01700038
017100     05  AA-ABEND-LIT            PIC  X(40)  VALUE                01710038
017200             '*****       ABEND'.                                 01720038
017300     05  AA-PROGRAM-LIT          PIC  X(40)  VALUE                01730038
017400             '*****   PROGRAM: APKUT045'.                         01740038
017500     05  AA-PARAGRAPH-LIT.                                        01750038
017600         10  FILLER              PIC  X(17)  VALUE                01760038
017700             '***** PARAGRAPH: '.                                 01770038
017800         10  AA-PARAGRAPH-NAME   PIC  X(35)  VALUE SPACES.        01780038
017900     05  AA-MESSAGE-LINE.                                         01790038
018000         10  FILLER              PIC  X(06)  VALUE '*****'.       01800038
018100         10  AA-MESSAGE          PIC  X(127) VALUE SPACES.        01810038
018200                                                                  01820038
018300     COPY DPWS004.                                                01830038
018400                                                                  01840038
018500     COPY APRD030.                                                01850038
018600                                                                  01860038
018700 01  FILLER                      PIC  X(25)  VALUE                01870038
018800     '** END OF APKUT045 W/S **'.                                 01880038
018900 EJECT                                                            01890038
019000 PROCEDURE DIVISION.                                              01900038
019100 A100-MAIN.                                                       01910038
019200     PERFORM B100-INITIALIZE.                                     01920038
019300                                                                  01930038
019400     PERFORM B200-PROCESS-UNJRNLZD                                01940038
019500         UNTIL OUT-OF-UNJRNLZD.                                   01950038
019600                                                                  01960038
019700     PERFORM B300-END-PROGRAM.                                    01970038
019800                                                                  01980038
019900     GOBACK.                                                      01990038
020000 EJECT                                                            02000038
020100*---------------------------------------------------------------  02010038
020200*    INITIALIZATION PROCESSING                                    02020038
020300*    -INITIAL READ                                                02030038
020400*---------------------------------------------------------------  02040038
020500 B100-INITIALIZE.                                                 02050038
020600                                                                  02060038
020700     OPEN INPUT  UNJRNLZD-FILE                                    02070038
020800         OUTPUT  RECEIPT-SUM-FILE.                                02080038
020900                                                                  02090038
021000     MOVE ZERO TO        PA-UNJRNLZD-IN-COUNT                     02100038
021100                         PA-SUM-OUT-COUNT.                        02110038
021200*---------------------------------------------------------------  02120038
021300* THE FIRST READ SHOULD ALWAYS RETURN A RECORD.  IT WOULD HAVE    02130038
021400* TO BE AN EXCEPTIONAL SITUATION IF THERE WERE NO UNJRNLZD        02140038
021500*---------------------------------------------------------------  02150038
021600                                                                  02160038
021700     PERFORM R100-READ-UNJRNLZD.                                  02170038
021800                                                                  02180038
021900     IF OUT-OF-UNJRNLZD                                           02190038
022000         DISPLAY '*****************************************'      02200038
022100         DISPLAY 'B100-INITIALIZE'                                02210038
022200         DISPLAY 'EMPTY UNJRNLZD FILE'                            02220038
022300         DISPLAY 'EMPTY UNJRNLZD FILE'                            02230038
022400         DISPLAY 'EMPTY UNJRNLZD FILE'                            02240038
022500     ELSE                                                         02250038
022600         PERFORM C100-DETERMINE-FISCAL-PERIOD                     02260038
022700     END-IF.                                                      02270038
022800                                                                  02280038
022900     MOVE ZERO            TO  PA-RCV-ACCUM-RETAIL                 02290038
023000                              PA-RCV-ACCUM-COST                   02300038
023100                              PA-RCV-ACCUM-QTY                    02310038
023200                              PA-NIR-ACCUM-RETAIL                 02320038
023300                              PA-NIR-ACCUM-COST                   02330038
023400                              PA-NIR-ACCUM-QTY.                   02340038
023500                                                                  02350038
023600 EJECT                                                            02360038
023700                                                                  02370038
023800*---------------------------------------------------------------  02380038
023900*   -REFORMAT THE DATE                                            02390038
024000*   -DETERMINE THE FISCAL PERIOD                                  02400038
024100*   -ACCUM THE FIELDS BY FISCAL PERIOD                            02410038
024200*   -WRITE OUT THE SUMMED RECORD                                  02420038
024300*---------------------------------------------------------------  02430038
024400 B200-PROCESS-UNJRNLZD.                                           02440038
024500                                                                  02450038
024600     PERFORM WITH TEST BEFORE                                     02460038
024700         UNTIL AP042-VRFD-DTE < PV-FIRST-FP-DATE                  02470038
024800         OR OUT-OF-UNJRNLZD                                       02480038
024900                                                                  02490038
025000         IF  AP042-ORIG-RCVR                                      02500038
025100             ADD  AP042-CALCD-VRFD-RTL-AMT TO PA-RCV-ACCUM-RETAIL 02510038
025200             ADD  AP042-CALCD-VRFD-COST-AMT TO PA-RCV-ACCUM-COST  02520038
025300             ADD  AP042-PO-VRFD-QTY         TO PA-RCV-ACCUM-QTY   02530038
025400         ELSE                                                     02540038
025500             ADD  AP042-CALCD-VRFD-RTL-AMT TO PA-NIR-ACCUM-RETAIL 02550038
025600             ADD  AP042-CALCD-VRFD-COST-AMT TO PA-NIR-ACCUM-COST  02560038
025700             ADD  AP042-PO-VRFD-QTY         TO PA-NIR-ACCUM-QTY   02570038
025800         END-IF                                                   02580038
025900                                                                  02590038
026000         ADD  AP042-CALCD-VRFD-RTL-AMT  TO PA-TOT-ACCUM-RETAIL    02600038
026100         ADD  AP042-CALCD-VRFD-COST-AMT TO PA-TOT-ACCUM-COST      02610038
026200         ADD  AP042-PO-VRFD-QTY         TO PA-TOT-ACCUM-QTY       02620038
026300                                                                  02630038
026400         PERFORM R100-READ-UNJRNLZD                               02640038
026500                                                                  02650038
026600     END-PERFORM.                                                 02660038
026700                                                                  02670038
026800     PERFORM C300-CREATE-OUT-RECORD.                              02680038
026900     MOVE ZERO          TO PA-RCV-ACCUM-RETAIL                    02690038
027000                           PA-RCV-ACCUM-COST                      02700038
027100                           PA-RCV-ACCUM-QTY                       02710038
027200                           PA-NIR-ACCUM-RETAIL                    02720038
027300                           PA-NIR-ACCUM-COST                      02730038
027400                           PA-NIR-ACCUM-QTY                       02740038
027500                           PA-TOT-ACCUM-RETAIL                    02750038
027600                           PA-TOT-ACCUM-COST                      02760038
027700                           PA-TOT-ACCUM-QTY.                      02770038
027800                                                                  02780038
027900     IF OUT-OF-UNJRNLZD                                           02790038
028000         CONTINUE                                                 02800038
028100     ELSE                                                         02810038
028200         PERFORM C100-DETERMINE-FISCAL-PERIOD                     02820038
028300     END-IF.                                                      02830038
028400                                                                  02840038
028500*---------------------------------------------------------------  02850038
028600*    ENDING PROCESSING: DISPLAYS COUNT OF POS AND CLOSES FILES.   02860038
028700*---------------------------------------------------------------  02870038
028800 B300-END-PROGRAM.                                                02880038
028900                                                                  02890038
029000     CLOSE  UNJRNLZD-FILE                                         02900038
029100            RECEIPT-SUM-FILE.                                     02910038
029200                                                                  02920038
029300     MOVE PA-UNJRNLZD-IN-COUNT   TO PA-IN-COUNT-DISP.             02930038
029400     MOVE PA-SUM-OUT-COUNT       TO PA-SUM-OUT-DISP.              02940038
029500                                                                  02950038
029600     DISPLAY '*****   RECORD COUNTS FROM APKUT045    ******'.     02960038
029700     DISPLAY '---------------------------------------------'.     02970038
029800     DISPLAY 'UNJRNLZD READ         = ' PA-IN-COUNT-DISP.         02980038
029900     DISPLAY '                                             '.     02990038
030000     DISPLAY 'SUMMED RECS OUT       = ' PA-SUM-OUT-DISP.          03000038
030100     DISPLAY '---------------------------------------------'.     03010038
030200                                                                  03020038
030300 EJECT                                                            03030038
030400                                                                  03040038
030500*---------------------------------------------------------------  03050038
030600* FIND THE FIRST DAY OF PERIOD IN WHICH THE INT-MKDATE            03060038
030700* DATE FALLS.  USE THE DATE ROUTINE TO GIVE THE PERIOD AND YEAR.  03070038
030800*---------------------------------------------------------------- 03080038
030900*                                                                 03090038
031000 C100-DETERMINE-FISCAL-PERIOD.                                    03100038
031100                                                                  03110038
031200     INITIALIZE DPG51, DPG52, DPG53, DPG54, DPG55, DPG56.         03120038
031300                                                                  03130038
031400     SET DPG51-FISCAL-454-CALENDAR                                03140038
031500         DPG51-DO-NOT-INCR-DECR-DATE                              03150038
031600         DPG52-LK-DTE-ISO-FMT       TO TRUE.                      03160038
031700     MOVE AP042-VRFD-DTE            TO DPG52-LK-DATE-INPUT.       03170038
031800                                                                  03180038
031900     CALL DP500-KOHLS-CALENDAR-ROUTINE                            03190038
032000         USING DPG51 DPG52 DPG53 DPG54 DPG55 DPG56.               03200038
032100                                                                  03210038
032200     IF (DPG54-SEVERE-ERROR OR                                    03220038
032300         DPG54-WARNING-ERROR)                                     03230038
032400         MOVE 'C100-DETERMINE-FISC' TO AA-PARAGRAPH-NAME          03240038
032500         MOVE 'BAD DATE CALCULATION' TO AA-MESSAGE                03250038
032600         SET AC-DATE-ERROR          TO TRUE                       03260038
032700         PERFORM Z999-ABEND                                       03270038
032800     ELSE                                                         03280038
032900         MOVE DPG56-FIRST-FP-DB2-ISO-FMT-YR TO  PV-FIRST-PER-CCYY 03290038
033000         MOVE DPG56-FIRST-FP-DB2-ISO-FMT-MO TO  PV-FIRST-PER-MM   03300038
033100         MOVE DPG56-FIRST-FP-DB2-ISO-FMT-DY TO  PV-FIRST-PER-DD   03310038
033200         MOVE DPG56-FISCAL-YEAR-CCYY        TO  PV-FP-YEAR        03320038
033300         MOVE DPG56-FISCAL-PERIOD-NBR       TO  PV-FP-NBR         03330038
033400     END-IF.                                                      03340038
033500                                                                  03350038
033600                                                                  03360038
033700*---------------------------------------------------------------- 03370038
033800* BUILD THE COPYBOOK RECORD APRD030                               03380038
033900*                                                                 03390038
034000*---------------------------------------------------------------- 03400038
034100*                                                                 03410038
034200 C300-CREATE-OUT-RECORD.                                          03420038
034300                                                                  03430038
034400     MOVE PV-FP-YEAR(1:2)         TO  AP030-FISCAL-CENTURY.       03440038
034500     MOVE PV-FP-YEAR(3:2)       TO  AP030-FISCAL-YEAR.            03450038
034600     MOVE PV-FP-NBR             TO  AP030-FISCAL-PERIOD.          03460038
034700                                                                  03470038
034800     MOVE PA-RCV-ACCUM-COST     TO  AP030-RCV-COST-TOTAL.         03480038
034900     MOVE PA-RCV-ACCUM-RETAIL   TO  AP030-RCV-RETAIL-TOTAL.       03490038
035000     MOVE PA-RCV-ACCUM-QTY      TO  AP030-RCV-ITEM-QTY.           03500038
035100     MOVE PA-NIR-ACCUM-COST     TO  AP030-NIR-COST-TOTAL.         03510038
035200     MOVE PA-NIR-ACCUM-RETAIL   TO  AP030-NIR-RETAIL-TOTAL.       03520038
035300     MOVE PA-NIR-ACCUM-QTY      TO  AP030-NIR-ITEM-QTY.           03530038
035400     MOVE PA-TOT-ACCUM-COST     TO  AP030-TOTAL-COST.             03540038
035500     MOVE PA-TOT-ACCUM-RETAIL   TO  AP030-TOTAL-RETAIL.           03550038
035600     MOVE PA-TOT-ACCUM-QTY      TO  AP030-TOTAL-ITEM-QTY.         03560038
035700                                                                  03570038
035800     WRITE APRD030-REC FROM AP030-UNJ-NI-RCPT-SUMMARY.            03580038
035900     ADD 1 TO PA-SUM-OUT-COUNT.                                   03590038
036000                                                                  03600038
036100 EJECT                                                            03610038
036200                                                                  03620038
036300                                                                  03630038
036400****************************************************************  03640038
036500*  I/O  SECTION                                                   03650038
036600****************************************************************  03660038
036700                                                                  03670038
036800*---------------------------------------------------------------  03680038
036900*    READS THE UNJRNLZD FILE   (RECEIVERS)                        03690038
037000*---------------------------------------------------------------  03700038
037100 R100-READ-UNJRNLZD.                                              03710038
037200                                                                  03720038
037300     READ UNJRNLZD-FILE                                           03730038
037400         INTO AP042-EXTRACT-FILE                                  03740038
037500         AT END SET OUT-OF-UNJRNLZD TO TRUE.                      03750038
037600                                                                  03760038
037700     IF MORE-UNJRNLZD                                             03770038
037800         ADD 1 TO PA-UNJRNLZD-IN-COUNT                            03780038
037900     END-IF.                                                      03790038
038000                                                                  03800038
038100*---------------------------------------------------------------  03810038
038200*    ABEND ROUTINE                                                03820038
038300*---------------------------------------------------------------  03830038
038400 Z999-ABEND.                                                      03840038
038500                                                                  03850038
038600     CLOSE  UNJRNLZD-FILE                                         03860038
038700            RECEIPT-SUM-FILE.                                     03870038
038800                                                                  03880038
038900     DISPLAY AA-ABEND-LIT.                                        03890038
039000     DISPLAY AA-PROGRAM-LIT.                                      03900038
039100     DISPLAY AA-PARAGRAPH-LIT.                                    03910038
039200     DISPLAY AA-MESSAGE-LINE.                                     03920038
039300     CALL 'ILBOABN0' USING ABEND-CODE.                            03930038
