000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.      APKUT502.                                       00020000
000300 AUTHOR.          JEAN KURK.                                      00030000
000400 INSTALLATION.    KOHLS DEPARTMENT STORES.                        00040000
000500 DATE-WRITTEN.    MARCH 2022.                                     00050000
000600*----------------------------------------------------------------*00060000
000700*   REMOVE INVOICES FROM THE RECYCLE FILE                        *00070000
000800*----------------------------------------------------------------*00080000
001100* THIS PROGRAM READS AN INPUT FILE FROM AN EXCEL TEMPLATE THAT   *00090000
001200* THE BUSINESS PROVIDES.  THE FILE CONTAINS A PO AND INVOICE     *00100000
001300* FOR EACH RECORD TO BE PROCESSED, WITH A MAX OF UP TO 1500 PER  *00110013
001400* FILE.  THE FILE IS MFTD TO THE MAINFRAME AND COMPARED TO THE   *00120000
001500* RECYCLE FILE.  FOR EACH PO/INVOICE FOUND ON THE RECYCLE FILE,  *00130000
001510* THE RECORD WILL BE REMOVED FROM THE FILE.  THE FIRST RECORD    *00140008
001510* ON THE FILE IS A HEADER RECORD - IT WILL BE BYPASSED.          *00141008
001513* AN EMAIL WILL BE PROVIDED WITH THE DETAILS FOR EACH PO/INVOICE *00150000
001520* IN THE FILE.                                                   *00160000
001530*----------------------------------------------------------------*00170000
001600* INPUT FILES:                                                   *00180000
001700*  1. CURRENT RECYCLE FILE                      (APRD056)        *00190000
001700*  1. INPUT FILE                                (APRD160)        *00200000
001800*                                                                *00210000
001900* OUTPUT FILES:                                                  *00220000
002000*  1. UPDATED RECYCLE FILE                      (APRD056)        *00230000
002100*  2. PROCESSING DETAIL REPORT                                   *00240002
002200*----------------------------------------------------------------*00250000
002300* CHANGE LOG:                                                    *00260000
002400*                                                                *00270000
002410* DATE  05/02/2022                                               *00280010
002420*     CHANGE MADE: INITIAL IMPLEMENTATION.                       *00290000
002424*     MADE BY: JEAN KURK               WR/IR #: CHG0268113       *00300000
002425*                                                                *00310000
002410* DATE  05/12/2022                                               *00311012
002420*     CHANGE MADE: INCREASE LIMIT FROM 50 TO 1500                *00312012
002424*     MADE BY: JEAN KURK               WR/IR #: CHG0269969       *00313017
002425*                                                                *00314012
002447******************************************************************00320000
002448                                                                  00330000
002449 ENVIRONMENT DIVISION.                                            00340000
002450 INPUT-OUTPUT SECTION.                                            00350000
002460 FILE-CONTROL.                                                    00360000
002470     SELECT RECYCLE-IN-FILE        ASSIGN TO INP01.               00370000
002470     SELECT INPUT-IN-FILE          ASSIGN TO INP02.               00380000
002480     SELECT RECYCLE-OUT-FILE       ASSIGN TO OUT01.               00390000
002490     SELECT DETAIL-REPORT          ASSIGN TO OUT02.               00400000
002500                                                                  00410000
002600 DATA DIVISION.                                                   00420000
002700 FILE SECTION.                                                    00430000
002800                                                                  00440000
002900 FD  RECYCLE-IN-FILE                                              00450000
003200     LABEL RECORDS ARE STANDARD                                   00460000
003210     RECORDING MODE IS F                                          00470000
003220     RECORD CONTAINS 370 CHARACTERS                               00480000
003300     BLOCK CONTAINS 0 RECORDS.                                    00490000
003600 01  RECYCLE-IN-RECORD          PIC X(370).                       00500000
003700                                                                  00510000
002900 FD  INPUT-IN-FILE                                                00520000
003200     LABEL RECORDS ARE STANDARD                                   00530000
003210     RECORDING MODE IS F                                          00540000
003220     RECORD CONTAINS 80 CHARACTERS                                00550003
003300     BLOCK CONTAINS 0 RECORDS.                                    00560000
003600 01  INPUT-IN-RECORD            PIC X(80).                        00570000
003700                                                                  00580000
003800 FD  RECYCLE-OUT-FILE                                             00590000
003810     LABEL RECORDS ARE STANDARD                                   00600000
003900     RECORDING MODE F                                             00610000
004100     BLOCK CONTAINS 0 RECORDS.                                    00620000
004200 01  RECYCLE-OUT-RECORD         PIC X(370).                       00630000
004300                                                                  00640000
004310 FD  DETAIL-REPORT                                                00650000
004320     LABEL RECORDS ARE STANDARD                                   00660000
004330     RECORDING MODE F                                             00670000
004340     BLOCK CONTAINS 0 RECORDS.                                    00680000
004350 01  DETAIL-RECORD              PIC X(80).                        00690000
004400                                                                  00700000
004400                                                                  00710000
004500 WORKING-STORAGE SECTION.                                         00720000
137000*--------------------------------------------------------------*  00730000
137100* RECYCLED EDI INVOICE INPUT LAYOUT                            *  00740000
137200*--------------------------------------------------------------*  00750000
137300 01  FILLER                         PIC X(35)  VALUE              00760000
137400     'BEGINNING OF AP056 INPUT FILE    **'.                       00770000
137500 01  AP056-EDI-IN-FILE.                                           00780000
137600     COPY APRD056.                                                00790000
137700                                                                  00800000
004640*----------------------------------------------------------------*00810000
004650* RECORD LAYOUT FOR INPUT PO/INVC FILE OF INVOICES TO BE DELETED *00820000
004660*----------------------------------------------------------------*00830000
004670     COPY APRD160.                                                00840000
004680                                                                  00850000
004640*----------------------------------------------------------------*00860000
004650* RECORD LAYOUT FOR DETAIL MESSAGES                              *00870000
004660*----------------------------------------------------------------*00880000
004670 01  DETAIL-RECORD-OUT.                                           00890000
005000     05  DTL-PO-NBR                 PIC X(09).                    00900000
005000     05  DTL-FILLER1                PIC X(02).                    00910000
005000     05  DTL-INVC-ID                PIC X(22).                    00920000
005000     05  DTL-FILLER2                PIC X(02).                    00930000
005000     05  DTL-MESSAGE                PIC X(45).                    00940000
004670 01  DETAIL-RECORD-LONG REDEFINES DETAIL-RECORD-OUT               00941004
005000                                    PIC X(80).                    00942004
004680                                                                  00950000
004900 01  PROGRAM-CONSTANTS.                                           00960000
005000     05  PC-PROGRAM-NAME            PIC X(08)   VALUE 'APKUT502'. 00970000
005364     05  PC-NOT-FOUND-MSG           PIC X(45)                     00980000
005365         VALUE 'PO/INV NOT FOUND ON RECYCLE FILE'.                00990000
005364     05  PC-INVC-REMOVED-MSG        PIC X(45)                     01000000
005365         VALUE 'PO/INV RECORD REMOVED FROM RECYCLE FILE'.         01010005
005364     05  PC-FILE-TOO-LARGE-MSG      PIC X(45)                     01020000
005365         VALUE 'PO/INV BYPASSED - TOO MANY RECORDS ON FILE  '.    01030000
013700     05  MAX-IDX1                   PIC 9(04)   VALUE 1500.       01031014
005400                                                                  01040000
005500 01  PV-PO-INVC-TABLE.                                            01050001
013800     05  PO-INVC-TBL    OCCURS 1500 TIMES                         01071013
013900                        INDEXED BY IDX1.                          01080000
014100         10  TBL-PO-NBR             PIC X(09)   VALUE SPACES.     01090000
014200         10  TBL-INVC-ID            PIC X(22)   VALUE SPACES.     01100000
014200         10  TBL-DELETE-CD          PIC X(01)   VALUE SPACES.     01110000
006310                                                                  01120000
006400 01  PROGRAM-COUNTERS.                                            01130000
006410     05  PC-REC-INPUT-CNT           PIC 9(09)  VALUE ZERO.        01140000
006410     05  PC-REC-BYPASS-CNT          PIC 9(09)  VALUE ZERO.        01141015
006410     05  PC-REC-RECYCLE-IN-CNT      PIC 9(09)  VALUE ZERO.        01150000
006420     05  PC-REC-RECYCLE-OUT-CNT     PIC 9(09)  VALUE ZERO.        01160000
006410     05  PC-DETAIL-OUT-CNT          PIC 9(09)  VALUE ZERO.        01170000
006410     05  PC-CALC-CNT                PIC 9(09)  VALUE ZERO.        01171006
007100                                                                  01180000
007200 01  PROGRAM-SWITCHES.                                            01190000
007423     05  PS-EOF-INPUT-SW             PIC X(01)  VALUE 'N'.        01200000
007424         88 PS-EOF-INPUT-YES                    VALUE 'Y'.        01210000
007425         88 PS-EOF-INPUT-NO                     VALUE 'N'.        01220000
007423     05  PS-EOF-RECYCLE-SW           PIC X(01)  VALUE 'N'.        01230000
007424         88 PS-EOF-RECYCLE-YES                  VALUE 'Y'.        01240000
007425         88 PS-EOF-RECYCLE-NO                   VALUE 'N'.        01250000
007423     05  PS-PO-INVC-FOUND-SW         PIC X(01)  VALUE 'N'.        01260000
007424         88 PS-PO-INVC-FND-YES                  VALUE 'Y'.        01270000
007425         88 PS-PO-INVC-FND-NO                   VALUE 'N'.        01280000
007507                                                                  01290000
011200 01  ABEND-CODE                      PIC S9(04) VALUE ZEROS       01300000
011300                                                COMP SYNC.        01310000
011400     88  AC-NO-RECYCLE-FILE                     VALUE +4001.      01320000
011400     88  AC-NO-INPUT-FILE                       VALUE +4002.      01321009
011500                                                                  01330000
095200 01  AA-ABEND-FIELDS.                                             01340000
095300     05  AA-ABEND-LIT                PIC X(40)                    01350000
095300                 VALUE '******  ABEND  ******'.                   01360000
095300     05  AA-PROGRAM-LIT              PIC X(40)                    01370000
095300                 VALUE '******  PROGRAM APKUT502'.                01380000
012500     05  AA-PARAGRAPH-LIT.                                        01390000
012600         10  FILLER                  PIC  X(17)  VALUE            01400000
012700             '***** PARAGRAPH: '.                                 01410000
012800         10  AA-PARAGRAPH-NAME       PIC  X(35)  VALUE SPACES.    01420000
012900     05  AA-MESSAGE-LINE.                                         01430000
013000         10  FILLER                  PIC  X(06)  VALUE '*****'.   01440000
013100         10  AA-MESSAGE-1            PIC  X(127) VALUE SPACES.    01450000
017700                                                                  01460000
017700                                                                  01470000
017800*----------------------------------------------------------------*01480000
018400 PROCEDURE DIVISION.                                              01490000
018500*----------------------------------------------------------------*01500000
018600 A100-PROGRAM-MAINLINE.                                           01510000
018700                                                                  01520000
018800     PERFORM B100-INITIALIZATION.                                 01530000
019000     PERFORM B200-PROCESS-RECYCLE-FILE                            01540000
019100       UNTIL PS-EOF-RECYCLE-YES.                                  01550000
019300     PERFORM B300-END-OF-JOB.                                     01560000
019500     GOBACK.                                                      01570000
019600                                                                  01580000
019600                                                                  01590000
019700*----------------------------------------------------------------*01600000
019800* INITIALIZATION PROCESSING                                      *01610000
020100*----------------------------------------------------------------*01620000
020300 B100-INITIALIZATION.                                             01630000
020400                                                                  01640000
020500     OPEN INPUT  RECYCLE-IN-FILE                                  01650000
020500                 INPUT-IN-FILE                                    01660000
020600          OUTPUT RECYCLE-OUT-FILE                                 01670000
020610                 DETAIL-REPORT.                                   01680000
021610                                                                  01681005
021610     MOVE 'INPUT RECEIVED TO DELETE ENTRIES FROM RECYCLE FILE'    01682005
021610                                    TO DETAIL-RECORD-LONG.        01683005
021610     PERFORM W200-WRITE-DETAIL-MESSAGES.                          01684005
021610     MOVE SPACES                    TO DETAIL-RECORD-OUT.         01685005
021610     PERFORM W200-WRITE-DETAIL-MESSAGES.                          01686005
020700                                                                  01690000
020800     INITIALIZE PV-PO-INVC-TABLE.                                 01700001
020810     SET IDX1 TO 1.                                               01710000
020900                                                                  01720000
020900* INPUT FILE IS PROVIDED BY ACCOUNTS PAYABLE.  IT CONTAINS THE    01721008
020900* PO/INVC TO BE REMOVED FROM THE RECYCLE FILE.  THE FIRST RECORD  01722008
020900* IS A HEADER RECORD AND IT IS BYPASSED.                          01723008
021300     PERFORM R100-READ-INPUT-FILE.                                01730000
021300     IF PS-EOF-INPUT-YES                                          01730109
021310         SET AC-NO-INPUT-FILE       TO TRUE                       01730209
021310         MOVE 'B100-INITIALIZATION' TO AA-PARAGRAPH-NAME          01730309
021310         MOVE 'NO INPUT FILE PROVIDED'                            01730409
021310                                    TO AA-MESSAGE-1               01730509
021310         PERFORM Z998-ABEND                                       01730609
021300     END-IF.                                                      01730709
021300     PERFORM R100-READ-INPUT-FILE.                                01731008
021300                                                                  01732008
020900* IF EOF AT THIS POINT, THEN THERE WAS ONLY A HEADER RECORD ON    01732108
020900* THE FILE AND NO DATA RECORDS                                    01732208
021300     IF PS-EOF-INPUT-YES                                          01733008
021610         MOVE 'NO PO/INVOICE ON FILE - JUST A HEADER RECORD'      01733108
021610                                    TO DETAIL-RECORD-LONG         01733208
021610         PERFORM W200-WRITE-DETAIL-MESSAGES                       01733308
021610         SET PS-EOF-RECYCLE-YES     TO TRUE                       01733408
021300     ELSE                                                         01739008
021300         PERFORM T100-LOAD-TABLE                                  01740008
021300             UNTIL PS-EOF-INPUT-YES                               01750008
021300                                                                  01760000
021300         PERFORM R200-READ-RECYCLE-FILE                           01770008
021300         IF PS-EOF-RECYCLE-YES                                    01780008
021310             SET AC-NO-RECYCLE-FILE     TO TRUE                   01790008
021310             MOVE 'B100-INITIALIZATION' TO AA-PARAGRAPH-NAME      01800008
021310             MOVE 'NO RECYCLE FILE PROVIDED'                      01810008
021310                                    TO AA-MESSAGE-1               01820000
021310             PERFORM Z998-ABEND                                   01830008
021300         END-IF                                                   01840008
021300     END-IF.                                                      01850008
021610                                                                  01855004
021610                                                                  01860000
021700*---------------------------------------------------------------* 01870000
021800* READ THE RECORDS FROM THE RECYCLE FILE                        * 01880000
021800* CHECK TO SEE IF THE PO/INVOICE IS IN THE TABLE                * 01890000
021800* IF PO/INVC FOUND IN TABLE, DO NOT WRITE TO THE OUTPUT FILE    * 01900000
022000*---------------------------------------------------------------* 01910000
022200 B200-PROCESS-RECYCLE-FILE.                                       01920000
022300                                                                  01930000
022360     PERFORM T200-CHECK-TABLE.                                    01940000
022370                                                                  01950000
022380     IF PS-PO-INVC-FND-YES                                        01960000
050000         MOVE AP056-KOHLS-PO-NBR        TO DTL-PO-NBR             01970000
050000         MOVE AP056-VENDOR-INVOICE-NBR  TO DTL-INVC-ID            01980000
050000         MOVE PC-INVC-REMOVED-MSG       TO DTL-MESSAGE            01990000
022820         PERFORM W200-WRITE-DETAIL-MESSAGES                       02000000
022810     ELSE                                                         02010000
022820         PERFORM W100-WRITE-RECYCLE-REC                           02020000
023000     END-IF.                                                      02030000
023000                                                                  02040000
023100     PERFORM R200-READ-RECYCLE-FILE.                              02050000
023200                                                                  02060000
023300                                                                  02070000
023500*---------------------------------------------------------------* 02080000
023600* END OF PROGRAM PROCESSING                                     * 02090000
023600* CHECK FOR ANY PO/INVC THAT WAS NOT REMOVED FROM RECYCLE FILE  * 02091000
023600* DISPLAY COUNTS                                                * 02092000
023800*---------------------------------------------------------------* 02100000
024000 B300-END-OF-JOB.                                                 02110000
024100                                                                  02120000
024200     PERFORM T300-VALIDATE-TABLE                                  02130000
022360         VARYING IDX1 FROM 1 BY 1                                 02140000
022360         UNTIL IDX1 > MAX-IDX1                                    02141000
022360         OR TBL-PO-NBR (IDX1) = SPACES.                           02142000
024390                                                                  02270000
024400     CLOSE RECYCLE-IN-FILE                                        02280000
024400           INPUT-IN-FILE                                          02290000
024500           RECYCLE-OUT-FILE                                       02300000
024510           DETAIL-REPORT.                                         02310000
024600                                                                  02320000
024700     DISPLAY '****  APKUT502'.                                    02330007
024700     DISPLAY '    '.                                              02330107
024700** SUBTRACT 1 FROM INPUT RECORD COUNT FOR HEADER RECORD           02330216
024700     SUBTRACT 1 FROM PC-REC-INPUT-CNT.                            02330316
024700     DISPLAY 'INPUT RECORDS PROCESSED = ' PC-REC-INPUT-CNT.       02330416
024700     DISPLAY 'INPUT RECORDS BYPASSED  = ' PC-REC-BYPASS-CNT.      02330516
024700     DISPLAY 'RECYCLE RECORDS INPUT   = ' PC-REC-RECYCLE-IN-CNT.  02331000
024700     DISPLAY 'RECYCLE RECORDS OUTPUT  = ' PC-REC-RECYCLE-OUT-CNT. 02332000
024700     COMPUTE PC-CALC-CNT = PC-REC-RECYCLE-IN-CNT -                02332106
024700                           PC-REC-RECYCLE-OUT-CNT.                02332206
024700     DISPLAY 'RECYCLE RECORDS DELETED = ' PC-CALC-CNT.            02332306
024700     DISPLAY 'DETAIL MESSAGES OUTPUT  = ' PC-DETAIL-OUT-CNT.      02333001
024900                                                                  02370000
024900                                                                  02380000
502396*---------------------------------------------------------------- 02390000
502398*   LOAD THE INPUT PO/INVOICE RECORDS INTO A TABLE                02400000
502399*   THE RECYCLE FILE WILL BE COMPARED TO THE RECORDS IN THIS      02410000
502400*   TABLE.  ANY RECORDS THAT MATCH WILL BE DELETED FROM THE FILE  02420000
502401*---------------------------------------------------------------- 02430000
502402 T100-LOAD-TABLE.                                                 02440000
502403                                                                  02450000
502409     IF IDX1 > MAX-IDX1                                           02460000
050000         MOVE AP160-PO-NBR              TO DTL-PO-NBR             02470000
050000         MOVE AP160-INVOICE-ID          TO DTL-INVC-ID            02480000
050000         MOVE PC-FILE-TOO-LARGE-MSG     TO DTL-MESSAGE            02490000
022820         PERFORM W200-WRITE-DETAIL-MESSAGES                       02500000
022820         ADD 1                          TO PC-REC-BYPASS-CNT      02501015
502414     ELSE                                                         02510000
502474           MOVE AP160-PO-NBR         TO TBL-PO-NBR (IDX1)         02520000
502474           MOVE AP160-INVOICE-ID     TO TBL-INVC-ID (IDX1)        02530000
502474           SET IDX1                  UP BY 1                      02540000
502414     END-IF.                                                      02550000
502474                                                                  02560000
502474     PERFORM R100-READ-INPUT-FILE.                                02570000
502474                                                                  02580000
502474                                                                  02590000
502396*---------------------------------------------------------------- 02600000
502398*   COMPARE THE PO/INVOICE FROM THE RECYCLE FILE TO THE VALUES    02610000
502399*   IN THE TABLE.  IF FOUND, SET A SWITCH                         02620000
502401*---------------------------------------------------------------- 02630000
502402 T200-CHECK-TABLE.                                                02640000
502403                                                                  02650000
502403     SET PS-PO-INVC-FND-NO         TO TRUE.                       02660000
502403                                                                  02670000
502360     SET IDX1                      TO 1.                          02680000
502403                                                                  02690000
502370     SEARCH PO-INVC-TBL                                           02700001
502380         VARYING IDX1                                             02710000
502392             WHEN AP056-KOHLS-PO-NBR = TBL-PO-NBR (IDX1)          02720000
502392              AND AP056-VENDOR-INVOICE-NBR = TBL-INVC-ID (IDX1)   02730000
502393            MOVE 'Y'                TO TBL-DELETE-CD (IDX1)       02740001
502393            SET PS-PO-INVC-FND-YES  TO TRUE                       02750000
502394     END-SEARCH.                                                  02760000
502395                                                                  02770000
502474                                                                  02780000
502396*---------------------------------------------------------------- 02783000
502398*   CHECK TO SEE IF THERE ARE ANY PO/INVC THAT WAS NOT FOUND ON   02784000
502399*   THE RECYCLE FILE                                              02785000
502401*---------------------------------------------------------------- 02786000
502402 T300-VALIDATE-TABLE.                                             02787000
502403                                                                  02788000
502403     IF TBL-DELETE-CD (IDX1) NOT = 'Y'                            02789000
050000         MOVE TBL-PO-NBR (IDX1)         TO DTL-PO-NBR             02789100
050000         MOVE TBL-INVC-ID (IDX1)        TO DTL-INVC-ID            02789200
050000         MOVE PC-NOT-FOUND-MSG          TO DTL-MESSAGE            02789300
022820         PERFORM W200-WRITE-DETAIL-MESSAGES                       02789400
502403     END-IF.                                                      02789500
502474                                                                  02790200
502474                                                                  02791000
029989*----------------------------------------------------------------*02800000
029990* READS THE FILE OF PO/INVC RECORDS TO BE DELETED FROM RECYCLE   *02810000
029991*----------------------------------------------------------------*02820000
029992 R100-READ-INPUT-FILE.                                            02830000
029993                                                                  02840000
029994     READ INPUT-IN-FILE INTO AP160-INPUT-RECORD                   02850000
029995       AT END                                                     02860000
029996          SET PS-EOF-INPUT-YES    TO TRUE                         02870000
030000       NOT AT END                                                 02880000
030200        ADD 1                     TO PC-REC-INPUT-CNT             02890000
030300     END-READ.                                                    02900000
030301                                                                  02910000
030301                                                                  02920000
029989*----------------------------------------------------------------*02930000
029990* READS THE RECYCLE FILE                                         *02940000
029991*----------------------------------------------------------------*02950000
029992 R200-READ-RECYCLE-FILE.                                          02960000
029993                                                                  02970000
029994     READ RECYCLE-IN-FILE INTO AP056-EDI-IN-FILE                  02980000
029995       AT END                                                     02990000
029996          SET PS-EOF-RECYCLE-YES  TO TRUE                         03000000
030000       NOT AT END                                                 03010000
030200        ADD 1                     TO PC-REC-RECYCLE-IN-CNT        03020000
030300     END-READ.                                                    03030000
030301                                                                  03040000
030400                                                                  03050000
040000*----------------------------------------------------------------*03060000
040100* WRITES THE REMAINING RECORDS TO THE RECYCLE FILE               *03070000
040200*----------------------------------------------------------------*03080000
040300 W100-WRITE-RECYCLE-REC.                                          03090000
040400                                                                  03100000
040500     WRITE RECYCLE-OUT-RECORD FROM AP056-EDI-IN-FILE.             03110000
040600     ADD 1                        TO PC-REC-RECYCLE-OUT-CNT.      03120000
040700                                                                  03130000
040700                                                                  03140000
049300*----------------------------------------------------------------*03150000
049500* WRITE DETAIL MESSAGES TO INDICATE IF THE PO/INVC WAS DELETED   *03160000
049500* OR BYPASSED BY THE PROCESS                                     *03170000
049600*----------------------------------------------------------------*03180000
049800 W200-WRITE-DETAIL-MESSAGES.                                      03190000
049900                                                                  03200000
050000     WRITE DETAIL-RECORD FROM DETAIL-RECORD-OUT.                  03210000
050200     ADD 1                          TO PC-DETAIL-OUT-CNT.         03220000
050300                                                                  03230000
050300                                                                  03240000
050500*----------------------------------------------------------------*03250000
050600* ABEND ROUTINE                                                  *03260000
050800*----------------------------------------------------------------*03270000
050900 Z998-ABEND.                                                      03280000
051000                                                                  03290000
051100     DISPLAY AA-ABEND-LIT.                                        03300000
051200     DISPLAY AA-PROGRAM-LIT.                                      03310000
051300     DISPLAY AA-PARAGRAPH-LIT.                                    03320000
051400     DISPLAY AA-MESSAGE-LINE.                                     03330000
051600                                                                  03340000
051700     CALL 'ILBOABN0' USING ABEND-CODE.                            03360000
