000100*-----------------------*                                         00010002
000200 IDENTIFICATION DIVISION.                                         00020002
000300*-----------------------*                                         00030002
000400 PROGRAM-ID.    APKUT117.                                         00040002
000500 AUTHOR.        NANCY EILBES.                                     00050002
000600 DATE-WRITTEN.  JANUARY 2004.                                     00060002
000700                                                                  00070002
000800*---------------------------------------------------------------* 00080002
000900*                        COBOL 2 WITH SQL                       * 00090002
001000*                                                               * 00100002
001100*    BUILD CONTROL CARDS TO EXTRACT AP TRAN CODES FOR INVENTORY * 00110002
001200*                                                               * 00120002
001300*    THE PURPOSE OF THIS PROGRAM IS TO SELECT ALL OF THE AP     * 00130002
001400*    TRANCODES FROM THE TTRNCDE TABLE WHICH ALLOW A RETAIL      * 00140002
001500*    AMOUNT TO BE ENTERED.  THE CONTROL CARD WILL BE USED TO    * 00150002
001600*    COPY TRANSACTIONS WITH THOSE TRANCODES FROM THE DAILY      * 00160002
001700*    ACTIVITY FILE FOR USE IN THE INVENTORY CONTROL REPORTING.  * 00170002
001800*    TRANSACTIONS THAT ALLOW RETAIL ARE THE ONLY ADJUSTMENTS    * 00180002
001810*    THAT ARE OF INTEREST DURING INVENTORY, SINCE INVENTORY IS  * 00181002
001820*    RETAIL BASED.                                              * 00182002
001900*                                                               * 00190002
002000*---------------------------------------------------------------* 00200002
002100*                                                               * 00210002
002200* DB2 TABLES:                                                   * 00220002
002300*  1. AP TRANCODE MASTER TABLE         (TTRNCDE)                * 00230002
002400*                                                               * 00240002
002500* OUTPUT:                                                       * 00250002
002600*  1. APRD045-CONTROL-CARD-FILE                                 * 00260002
002800*                                                               * 00280002
002900*---------------------------------------------------------------* 00290002
003000*  CHANGES:                                                     * 00300002
003100*                                                               * 00310002
003200*  DATE  01/02/2003                                             * 00320002
003300*       CHANGES MADE: INITIAL VERSION.                          * 00330002
003600*  MADE BY: NANCY EILBES                WR/IR#: WR 25421        * 00360002
003700*                                                               * 00370002
004200*---------------------------------------------------------------* 00420002
004300 EJECT                                                            00430002
004400                                                                  00440002
004500 ENVIRONMENT DIVISION.                                            00450002
004600 CONFIGURATION SECTION.                                           00460002
004700 SOURCE-COMPUTER. IBM-3090.                                       00470002
004800 OBJECT-COMPUTER. IBM-3090.                                       00480002
004900                                                                  00490002
005000*                                                                 00500002
005100 INPUT-OUTPUT SECTION.                                            00510002
005200 FILE-CONTROL.                                                    00520002
005300                                                                  00530002
005500     SELECT APRD045-CONTROL-CARD-FILE      ASSIGN TO UT-S-OUT01.  00550002
005700                                                                  00570002
005800 DATA DIVISION.                                                   00580002
005900 FILE SECTION.                                                    00590002
006000                                                                  00600002
006200 FD  APRD045-CONTROL-CARD-FILE                                    00620002
006300     RECORDING MODE IS F                                          00630002
006400     BLOCK CONTAINS 0 CHARACTERS                                  00640002
006500     LABEL RECORDS ARE STANDARD                                   00650002
006700     DATA RECORD IS APRD045-CONTROL-RECORD.                       00670003
006800                                                                  00680002
007000 01  APRD045-CONTROL-RECORD       PIC X(80).                      00700003
007100                                                                  00710002
008000 EJECT                                                            00800002
008100 WORKING-STORAGE SECTION.                                         00810002
008200                                                                  00820002
008300 01  PC-PROGRAM-CONSTANTS.                                        00830002
008800     05  PC-APRD045-SORT-FLD1    PIC  X(80)  VALUE                00880002
008900         '  SORT FIELDS=(36,2,CH,A,                AP TRAN CODE'. 00890002
008910     05  PC-APRD045-SORT-FLD2    PIC  X(80)  VALUE                00891002
008920         '               296,5,CH,A,               STORE NUMBER'. 00892002
008930     05  PC-APRD045-SORT-FLD3    PIC  X(80)  VALUE                00893002
008940         '               48,3,CH,A)                DEPT NUMBER '. 00894002
011800                                                                  01180002
011900 01  PV-PROGRAM-VARIABLES.                                        01190002
012000     05  PV-CURRENT-PARAGRAPH    PIC  X(35).                      01200002
012100     05  PV-NULL-IND             PIC S9(4)     VALUE ZERO         01210002
012200                                               COMP SYNC.         01220002
012300     05  PV-TRAN-CDE-COUNT       PIC S9(9)     VALUE ZEROS        01230002
012400                                               COMP.              01240002
012500     05  PV-AP045-COUNT          PIC S9(9)     VALUE ZEROS        01250002
012600                                               COMP.              01260002
013000     05  PV-SORT-INCLUDE.                                         01300002
013100         10  FILLER                PIC X(28)   VALUE              01310002
013200             '  INCLUDE COND=(36,2,CH,EQ,C'.                      01320002
013300         10  FILLER                PIC X(01)   VALUE QUOTE.       01330002
013400         10  PV-TRAN-CDE           PIC X(02)   VALUE SPACES.      01340002
013500         10  FILLER                PIC X(01)   VALUE QUOTE.       01350002
013600         10  FILLER                PIC X(01)   VALUE ','.         01360002
013700     05  PV-SORT-INCLUDE-OR.                                      01370002
013800         10  FILLER                PIC X(28)   VALUE              01380002
013900             '             OR,36,2,CH,EQ,C'.                      01390002
014000         10  FILLER                PIC X(01)   VALUE QUOTE.       01400002
014100         10  PV-OR-TRAN-CDE        PIC X(02)   VALUE SPACES.      01410004
014200         10  FILLER                PIC X(01)   VALUE QUOTE.       01420002
014300         10  FILLER                PIC X(01)   VALUE ','.         01430002
014400     05  PV-SORT-INCLUDE-OR-END.                                  01440002
014500         10  FILLER                PIC X(28)   VALUE              01450002
014600             '             OR,36,2,CH,EQ,C'.                      01460002
014700         10  FILLER                PIC X(01)   VALUE QUOTE.       01470002
014800         10  PV-OR-END-TRAN-CDE    PIC X(02)   VALUE SPACES.      01480002
014900         10  FILLER                PIC X(01)   VALUE QUOTE.       01490002
015000         10  FILLER                PIC X(02)   VALUE ')'.         01500002
015100                                                                  01510002
017300                                                                  01730002
017400 01  PS-PROGRAM-SWITCHES.                                         01740002
017500     05  PS-TRAN-CDE-SW            PIC X(01) VALUE ' '.           01750002
017600         88  PS-END-TRAN-CDE                 VALUE 'Y'.           01760002
017700         88  PS-MORE-TRAN-CDE                VALUE ' '.           01770002
018100                                                                  01810002
019700*---------------------------------------------------------------- 01970002
019800*    TTRNCDE DCLGEN                                               01980002
019900*---------------------------------------------------------------- 01990002
020000     EXEC SQL                                                     02000002
020100         INCLUDE TTRNCDE                                          02010002
020200     END-EXEC.                                                    02020002
020300                                                                  02030002
020400*---------------------------------------------------------------- 02040002
020500*    SQL COMMUNICATIONS AREA DCLGEN                               02050002
020600*---------------------------------------------------------------- 02060002
020700     EXEC SQL                                                     02070002
020800         INCLUDE SQLCA                                            02080002
020900     END-EXEC.                                                    02090002
021000                                                                  02100002
021400*---------------------------------------------------------------- 02140002
021500* TRAN_CDE_CSR RETRIEVES ALL ACCOUNT NUMBERS THAT ARE TO BE IN-   02150002
021600* CLUDED IN THE ACTIVITY AND BALANCE REPORT.                      02160002
021700*---------------------------------------------------------------- 02170002
021800     EXEC SQL                                                     02180002
021900       DECLARE TRAN_CDE_CSR CURSOR FOR                            02190002
022000         SELECT DISTINCT AP_TRN_CDE                               02200002
022100           FROM TTRNCDE                                           02210002
022200          WHERE CURRENT DATE BETWEEN EFF_STRT_DTE AND EFF_END_DTE 02220002
022210            AND RTL_PRCCTL_CDE IN ('A','R')                       02221002
022211            AND ML_PSTG_IND = 'Y'                                 02221102
022212       ORDER BY AP_TRN_CDE                                        02221203
022220     END-EXEC.                                                    02222002
022230                                                                  02223002
022240*---------------------------------------------------------------- 02224002
022250*  ABEND DATA AREAS                                               02225002
022260*---------------------------------------------------------------- 02226002
022270 01  ABEND-CODE                  PIC S9(04)  VALUE ZEROS          02227002
022280                                             COMP SYNC.           02228002
022290     88  AC-BAD-DATA                         VALUE +4003.         02229002
022300     88  AC-DB2-ERROR                        VALUE +4013.         02230002
022400                                                                  02240002
022500 01  ABEND-AREAS.                                                 02250002
022600     05  AA-ABEND-LIT            PIC  X(40)  VALUE                02260002
022700             '*****       ABEND'.                                 02270002
022800     05  AA-PROGRAM-LIT          PIC  X(40)  VALUE                02280002
022900             '*****   PROGRAM: APKUT117'.                         02290002
023000     05  AA-PARAGRAPH-LIT.                                        02300002
023100         10  FILLER              PIC  X(17)  VALUE                02310002
023200             '***** PARAGRAPH: '.                                 02320002
023300         10  AA-PARAGRAPH-NAME   PIC  X(35)  VALUE SPACES.        02330002
023400     05  AA-MESSAGE-LINE.                                         02340002
023500         10  FILLER              PIC  X(06)  VALUE '*****'.       02350002
023600         10  AA-MESSAGE.                                          02360002
023700             15 AA-MESS-1        PIC  X(30)  VALUE SPACES.        02370002
023800             15 AA-MESS-2        PIC  X(97)  VALUE SPACES.        02380002
023900     05  AA-DB2-ERROR-LIT        PIC  X(40)  VALUE                02390002
024000             '*****    DB2 ERROR'.                                02400002
024100     05  AA-DB2-OPERATION-LIT.                                    02410002
024200         10  FILLER              PIC  X(17)  VALUE                02420002
024300             '***** OPERATION: '.                                 02430002
024400         10  AA-DB2-OPERATION.                                    02440002
024500             15  AA-DB2-OP-1     PIC  X(25)  VALUE SPACES.        02450002
024600             15  AA-DB2-OP-2     PIC  X(25)  VALUE SPACES.        02460002
024700     05  AA-DB2-TABLE-1          PIC  X(08)  VALUE SPACES.        02470002
024800     05  AA-DB2-TABLE-2          PIC  X(08)  VALUE SPACES.        02480002
024900     05  AA-DB2-TABLE-3          PIC  X(08)  VALUE SPACES.        02490002
025000     05  AA-DB2-TABLE-4          PIC  X(08)  VALUE SPACES.        02500002
025100                                                                  02510002
025200                                                                  02520002
025300*---------------------------------------------------------------- 02530002
025400*  SQLCA FORMATTED MESSAGE AREA                                   02540002
025500*---------------------------------------------------------------- 02550002
025600     COPY DPWS004.                                                02560002
025700*                                                                 02570002
025800                                                                  02580002
025900 01  FILLER                      PIC  X(35)  VALUE                02590002
026000     '**** END OF W/S ** APKUT117 ****'.                          02600002
026100 EJECT                                                            02610002
026200 PROCEDURE DIVISION.                                              02620002
026300                                                                  02630002
026400     PERFORM A100-MAINLINE.                                       02640002
026500     GOBACK.                                                      02650002
026600                                                                  02660002
026700 EJECT                                                            02670002
026800 A100-MAINLINE.                                                   02680002
026900                                                                  02690002
027000     MOVE 'A100-MAINLINE' TO PV-CURRENT-PARAGRAPH.                02700002
027100                                                                  02710002
027200     PERFORM B100-INITIALIZE.                                     02720002
027300                                                                  02730002
027400     PERFORM B200-PROCESS-TRAN-CODES.                             02740003
027600                                                                  02760002
027700     PERFORM B300-END-OF-PROGRAM.                                 02770002
027800                                                                  02780002
027900 EJECT                                                            02790002
028000*---------------------------------------------------------------- 02800002
028100*    INITIALIZATION PROCESSING.                                   02810002
028200*---------------------------------------------------------------- 02820002
028300 B100-INITIALIZE.                                                 02830002
028400                                                                  02840002
028500     MOVE 'B100-INITIALIZE' TO PV-CURRENT-PARAGRAPH.              02850002
028600                                                                  02860002
029200     OPEN OUTPUT APRD045-CONTROL-CARD-FILE.                       02920002
029400                                                                  02940002
029500     INITIALIZE DCLTTRNCDE.                                       02950002
029900                                                                  02990002
030000     PERFORM X100-OPEN-TRAN-CODE-CSR.                             03000002
030100                                                                  03010002
030200     PERFORM R200-FETCH-TRAN-CDE.                                 03020002
030300                                                                  03030002
030400     IF PS-END-TRAN-CDE                                           03040002
030500        MOVE 'B100-INITIALIZE'    TO AA-PARAGRAPH-NAME            03050002
030600        MOVE 'NO AP TRAN CODES FOR BUILDING CNTL CARDS'           03060002
030700                                  TO AA-MESSAGE                   03070002
030800        SET AC-BAD-DATA           TO TRUE                         03080002
030900        PERFORM Z999-ABEND                                        03090002
031000     END-IF.                                                      03100002
031100                                                                  03110002
031200 EJECT                                                            03120002
031300*---------------------------------------------------------------- 03130002
031400*    CONTROLS THE PROCESSING OF THE AP TRAN CODES THAT CAN HAVE   03140002
031500*    A RETAIL COMPONENT.  FOR EVERY TRANCODE FETCHED, AN INCLUDE  03150002
031600*    CONDITION IS BUILT.                                          03160002
031900*---------------------------------------------------------------- 03190002
032000 B200-PROCESS-TRAN-CODES.                                         03200002
032100                                                                  03210002
032200     MOVE 'B200-PROCESS-TRAN-CODES' TO  PV-CURRENT-PARAGRAPH.     03220003
032400                                                                  03240002
032500     MOVE SPACES                  TO APRD045-CONTROL-RECORD.      03250003
032600     MOVE PC-APRD045-SORT-FLD1    TO APRD045-CONTROL-RECORD.      03260003
032700     PERFORM W100-WRITE-AP045-CONTROL-CARD.                       03270003
032710                                                                  03271003
032800     MOVE SPACES                  TO APRD045-CONTROL-RECORD.      03280003
032900     MOVE PC-APRD045-SORT-FLD2    TO APRD045-CONTROL-RECORD.      03290003
032920     PERFORM W100-WRITE-AP045-CONTROL-CARD.                       03292003
032921                                                                  03292103
032922     MOVE SPACES                  TO APRD045-CONTROL-RECORD.      03292203
032930     MOVE PC-APRD045-SORT-FLD3    TO APRD045-CONTROL-RECORD.      03293003
032950     PERFORM W100-WRITE-AP045-CONTROL-CARD.                       03295003
032951                                                                  03295103
032960     MOVE SPACES                  TO APRD045-CONTROL-RECORD.      03296003
032970     MOVE TRNCDE-AP-TRN-CDE       TO PV-TRAN-CDE.                 03297003
032990     MOVE PV-SORT-INCLUDE         TO APRD045-CONTROL-RECORD.      03299003
032991     PERFORM W100-WRITE-AP045-CONTROL-CARD.                       03299103
032992                                                                  03299203
032993     PERFORM R200-FETCH-TRAN-CDE.                                 03299303
032994                                                                  03299403
032995     PERFORM UNTIL PS-END-TRAN-CDE                                03299503
032996        MOVE SPACES             TO APRD045-CONTROL-RECORD         03299603
032997        MOVE TRNCDE-AP-TRN-CDE  TO PV-OR-TRAN-CDE                 03299703
032998        MOVE PV-SORT-INCLUDE-OR TO APRD045-CONTROL-RECORD         03299803
032999        PERFORM W100-WRITE-AP045-CONTROL-CARD                     03299903
033000                                                                  03300003
033400        PERFORM R200-FETCH-TRAN-CDE                               03340003
033410     END-PERFORM.                                                 03341003
033500                                                                  03350002
033600 EJECT                                                            03360002
033700*---------------------------------------------------------------- 03370002
033800*    END OF PROGRAM.                                              03380002
033900*---------------------------------------------------------------- 03390002
034000 B300-END-OF-PROGRAM.                                             03400002
034100                                                                  03410002
034300     MOVE SPACES                  TO APRD045-CONTROL-RECORD.      03430003
034310     MOVE TRNCDE-AP-TRN-CDE       TO PV-OR-END-TRAN-CDE.          03431003
034320     MOVE PV-SORT-INCLUDE-OR-END  TO APRD045-CONTROL-RECORD.      03432003
034330     PERFORM W100-WRITE-AP045-CONTROL-CARD.                       03433003
034400                                                                  03440002
034500     DISPLAY '** COUNTS FOR APKUT117 **'.                         03450002
034600     DISPLAY 'NBR OF AP TRAN CODES FETCHED  = ' PV-TRAN-CDE-COUNT.03460002
034700     DISPLAY 'NBR OF AP045 CARDS CREATED    = ' PV-AP045-COUNT.   03470002
035000                                                                  03500002
035100     PERFORM Y100-CLOSE-TRAN-CDE-CSR.                             03510002
035200                                                                  03520002
035300     CLOSE APRD045-CONTROL-CARD-FILE.                             03530002
035500                                                                  03550002
035600 EJECT                                                            03560002
044700                                                                  04470002
046300 EJECT                                                            04630002
046400*---------------------------------------------------------------- 04640002
046500*    RETRIEVES THE GL ACCOUNT NUMBER FROM THE ACCOUNT TYPE TABLE. 04650002
046600*---------------------------------------------------------------- 04660002
046700 R200-FETCH-TRAN-CDE.                                             04670002
046800                                                                  04680002
046900     MOVE 'R200-FETCH-TRAN-CDE' TO PV-CURRENT-PARAGRAPH.          04690002
047000                                                                  04700002
047100     EXEC SQL                                                     04710002
047200         FETCH TRAN_CDE_CSR                                       04720002
047300         INTO  :TRNCDE-AP-TRN-CDE                                 04730002
047400     END-EXEC.                                                    04740002
047500                                                                  04750002
047600     EVALUATE TRUE                                                04760002
047700         WHEN SQLCODE = ZERO                                      04770002
047800              ADD 1 TO PV-TRAN-CDE-COUNT                          04780002
048000         WHEN SQLCODE = +100                                      04800002
048100              SET PS-END-TRAN-CDE TO TRUE                         04810002
048200         WHEN SQLWARN0 NOT = SPACES                               04820002
048300         WHEN SQLCODE  NOT = ZERO                                 04830002
048400             MOVE PV-CURRENT-PARAGRAPH                            04840002
048500                                 TO AA-PARAGRAPH-NAME             04850002
048600             MOVE                                                 04860002
048700               'UNSUCCESSFUL FETCH WITH TRAN_CDE_CSR'             04870002
048800                                 TO AA-DB2-OPERATION              04880002
048900             MOVE 'TTRNCDE'      TO AA-DB2-TABLE-1                04890002
049000             MOVE SPACES         TO AA-DB2-TABLE-2                04900002
049100                                    AA-DB2-TABLE-3                04910002
049200             PERFORM Z998-DB2-ABEND                               04920002
049300     END-EVALUATE.                                                04930002
049400                                                                  04940002
049500 EJECT                                                            04950002
049600*---------------------------------------------------------------- 04960002
049700*    WRITES THE APRD045 SORT CONTROL CARD.                        04970002
049800*---------------------------------------------------------------- 04980002
049900 W100-WRITE-AP045-CONTROL-CARD.                                   04990002
050000                                                                  05000002
050100     MOVE 'W100-WRITE-AP045-CONTROL-CARD' TO                      05010002
050200           PV-CURRENT-PARAGRAPH.                                  05020002
050300                                                                  05030002
050400     WRITE APRD045-CONTROL-RECORD.                                05040003
050500     ADD +1 TO PV-AP045-COUNT.                                    05050002
050600                                                                  05060002
051900 EJECT                                                            05190002
052000*---------------------------------------------------------------- 05200002
052100*    OPENS THE ACCOUNT TYPE CURSOR.                               05210002
052200*---------------------------------------------------------------- 05220002
052300 X100-OPEN-TRAN-CODE-CSR.                                         05230002
052400                                                                  05240002
052500     MOVE 'X100-OPEN-TRAN-CODE-CSR' TO PV-CURRENT-PARAGRAPH.      05250002
052600                                                                  05260002
052700     EXEC SQL                                                     05270002
052800         OPEN TRAN_CDE_CSR                                        05280002
052900     END-EXEC.                                                    05290002
053000                                                                  05300002
053100     EVALUATE TRUE                                                05310002
053200         WHEN SQLCODE = ZERO                                      05320002
053300              CONTINUE                                            05330002
053400                                                                  05340002
053500         WHEN SQLWARN0 NOT = SPACES                               05350002
053600         WHEN SQLCODE  NOT = ZERO                                 05360002
053700             MOVE PV-CURRENT-PARAGRAPH                            05370002
053800                                 TO AA-PARAGRAPH-NAME             05380002
053900             MOVE 'UNSUCCESSFUL OPEN ON TRAN_CDE_CSR'             05390002
054000                                 TO AA-DB2-OPERATION              05400002
054100             MOVE 'TTRNCDE'      TO AA-DB2-TABLE-1                05410002
054200             MOVE SPACES         TO AA-DB2-TABLE-2                05420002
054300                                    AA-DB2-TABLE-3                05430002
054400             PERFORM Z998-DB2-ABEND                               05440002
054500     END-EVALUATE.                                                05450002
054600                                                                  05460002
054700 EJECT                                                            05470002
054800*---------------------------------------------------------------- 05480002
054900*    CLOSES THE ACCOUNT TYPE CURSOR.                              05490002
055000*---------------------------------------------------------------- 05500002
055100 Y100-CLOSE-TRAN-CDE-CSR.                                         05510002
055200                                                                  05520002
055300     MOVE 'Y100-CLOSE-TRAN-CODE-CSR' TO PV-CURRENT-PARAGRAPH.     05530002
055400                                                                  05540002
055500     EXEC SQL                                                     05550002
055600         CLOSE TRAN_CDE_CSR                                       05560002
055700     END-EXEC.                                                    05570002
055800                                                                  05580002
055900     EVALUATE TRUE                                                05590002
056000         WHEN SQLCODE = ZERO                                      05600002
056100              CONTINUE                                            05610002
056200                                                                  05620002
056300         WHEN SQLWARN0 NOT = SPACES                               05630002
056400         WHEN SQLCODE  NOT = ZERO                                 05640002
056500             MOVE PV-CURRENT-PARAGRAPH                            05650002
056600                                 TO AA-PARAGRAPH-NAME             05660002
056700             MOVE 'UNSUCCESSFUL CLOSE ON TRAN_CDE_CSR'            05670002
056800                                 TO AA-DB2-OPERATION              05680002
056900             MOVE 'TTRNCDE'      TO AA-DB2-TABLE-1                05690002
057000             MOVE SPACES         TO AA-DB2-TABLE-2                05700002
057100                                    AA-DB2-TABLE-3                05710002
057200             PERFORM Z998-DB2-ABEND                               05720002
057300     END-EVALUATE.                                                05730002
057400                                                                  05740002
057500 EJECT                                                            05750002
057600*---------------------------------------------------------------- 05760002
057700*    ABEND ROUTINE FOR DB2 ERRORS.                                05770002
057800*---------------------------------------------------------------- 05780002
057900 Z998-DB2-ABEND.                                                  05790002
058000                                                                  05800002
058300     DISPLAY AA-ABEND-LIT.                                        05830002
058400     DISPLAY AA-MESSAGE-LINE.                                     05840002
058500     DISPLAY AA-DB2-ERROR-LIT.                                    05850002
058600     DISPLAY AA-PROGRAM-LIT.                                      05860002
058700     DISPLAY AA-PARAGRAPH-LIT.                                    05870002
058800     DISPLAY AA-DB2-OPERATION-LIT.                                05880002
058900     DISPLAY AA-DB2-TABLE-1.                                      05890002
059000     DISPLAY AA-DB2-TABLE-2.                                      05900002
059100     DISPLAY AA-DB2-TABLE-3.                                      05910002
059200     SET AC-DB2-ERROR TO TRUE.                                    05920002
059300                                                                  05930002
059400     COPY DPPD004.                                                05940002
059500                                                                  05950002
059600     CALL 'ILBOABN0' USING ABEND-CODE.                            05960002
059700                                                                  05970002
059800 EJECT                                                            05980002
059900*----------------------------------------------------------------*05990002
060000*    ABEND ROUTINE.                                              *06000002
060100*----------------------------------------------------------------*06010002
060200 Z999-ABEND.                                                      06020002
060300                                                                  06030002
060600     DISPLAY AA-ABEND-LIT.                                        06060002
060700     DISPLAY AA-PROGRAM-LIT.                                      06070002
060800     DISPLAY AA-PARAGRAPH-LIT.                                    06080002
060900     DISPLAY AA-MESSAGE-LINE.                                     06090002
061000     CALL 'ILBOABN0' USING ABEND-CODE.                            06100002
