000100******************************************************************00010002
000200*    AP REMITTANCE EXTRACT RECORD LAYOUT                         *00020004
000300*                                                                *00030002
000400*    APKUT154 - CREATED                                          *00040002
000500*    APKRP186 - CREATED                                          *00050002
000600*    APKUT217                                                    *00060007
000610*                                                                *00061007
000700*   RECORD FORMAT IS SEQUENTIAL                                  *00070002
000800*          LENGTH = 385                                          *00080002
000900******************************************************************00090002
001000*  CHANGE LOG:                                                   *00100002
001100*                                                                *00110002
001110* DATE  06/23/2008                                               *00111009
001120*     CHANGE MADE: EXPANDED PAYMENT-ID-REF FROM 10 TO 30.        *00112009
001121*       ADDED SCF-TRD-IND AND SCF-TRD-DTE.                       *00112109
001130*     MADE BY: SCOTT KRUSCHKA          WR/IR #: WR34510          *00113009
001150*                                                                *00115009
001200******************************************************************00120002
001300 01  AP002-REMIT-EXTRACT-RECORD.                                  00130002
001400     05  AP002-REMIT-VENDOR                 PIC X(10).            00140002
001500     05  AP002-PAYMENT-ID-REF               PIC X(30).            00150006
001600     05  AP002-PO-NBR                       PIC 9(9).             00160003
001700     05  AP002-INVOICE-ID                   PIC X(16).            00170002
001800     05  AP002-RECORD-TYP-CDE               PIC X(2).             00180002
001900         88  REMIT-LINE-RECORD                  VALUE '01'.       00190002
002000         88  REMIT-COMMENT-RECORD               VALUE '02'.       00200002
002100         88  MEMO-LINE-RECORD                   VALUE '03'.       00210002
002200         88  DISCOUNT-LINE-RECORD               VALUE '04'.       00220002
002300         88  DISCOUNT-COMMENT-RECORD            VALUE '05'.       00230002
002400     05  AP002-ORIGIN.                                            00240002
002500         10  AP002-ORIGIN-CDE               PIC X.                00250002
002600         10  AP002-AP-TRN-CDE               PIC X(2).             00260002
002700     05  AP002-PAY-CYCLE                    PIC X(6).             00270002
002800     05  AP002-PAY-CYCLE-SEQ-NBR            PIC 9(8).             00280002
002900     05  AP002-PYMT-DTE                     PIC X(10).            00290002
003000     05  AP002-PYMT-DTE-RDF REDEFINES AP002-PYMT-DTE.             00300002
003100         10  AP002-PYMT-CC                  PIC X(02).            00310002
003200         10  AP002-PYMT-YY                  PIC X(02).            00320002
003300         10  AP002-PYMT-DTE-DASH1           PIC X(01).            00330002
003400         10  AP002-PYMT-MM                  PIC X(02).            00340002
003500         10  AP002-PYMT-DTE-DASH1           PIC X(01).            00350002
003600         10  AP002-PYMT-DD                  PIC X(02).            00360002
003700     05  AP002-PYMNT-AMT                    PIC S9(9)V99  COMP-3. 00370002
003800     05  AP002-VCHR-VENDOR-ID               PIC X(10).            00380002
003810     05  AP002-SCF-TRD-IND                  PIC X(01).            00381008
003820     05  AP002-SCF-TRD-DTE                  PIC X(10).            00382008
003900     05  AP002-FILLER-1                     PIC X(24).            00390008
004000     05  AP002-VOUCHER-AREA.                                      00400002
004100         10  AP002-VCHR-VENDOR-NME          PIC X(40).            00410002
004200         10  AP002-DEPT-NBR                 PIC X(3).             00420002
004300         10  AP002-LOC-ID                   PIC 9(4).             00430002
004400         10  AP002-DOC-DTE                  PIC X(10).            00440002
004500         10  AP002-DOC-DTE-RDF REDEFINES AP002-DOC-DTE.           00450002
004600             15  AP002-DOC-CC               PIC X(2).             00460002
004700             15  AP002-DOC-YY               PIC X(2).             00470002
004800             15  AP002-DOC-DTE-DASH1        PIC X.                00480002
004900             15  AP002-DOC-MM               PIC X(2).             00490002
005000             15  AP002-DOC-DTE-DASH2        PIC X.                00500002
005100             15  AP002-DOC-DD               PIC X(2).             00510002
005200         10  AP002-NET-AMT                  PIC S9(7)V99 COMP-3.  00520002
005300         10  AP002-GROSS-AMT                PIC S9(7)V99 COMP-3.  00530002
005400         10  AP002-DISCOUNT-AMT             PIC S9(7)V99 COMP-3.  00540002
005500         10  AP002-FILLER-2                 PIC X(168).           00550002
005600     05  AP002-COMMENT-AREA REDEFINES AP002-VOUCHER-AREA.         00560002
005700         10  AP002-COMMENT-LINE1            PIC X(80).            00570002
005800         10  AP002-COMMENT-LINE2            PIC X(80).            00580002
005900         10  AP002-COMMENT-LINE3            PIC X(80).            00590002
006000     05  AP002-MEMO-INFORMATION REDEFINES AP002-VOUCHER-AREA.     00600002
006100         10  AP002-MEMO-SKU-UPC-NBR         PIC X(15).            00610005
006200         10  AP002-MEMO-INV-QTY             PIC 9(8).             00620002
006300         10  AP002-MEMO-RCV-QTY             PIC 9(8).             00630002
006400         10  AP002-MEMO-INVC-COST-AMT       PIC S9(7)V99 COMP-3.  00640002
006500         10  AP002-MEMO-ORD-COST-AMT        PIC S9(7)V99 COMP-3.  00650002
006600         10  AP002-MEMO-VEND-STYL-NBR       PIC X(20).            00660002
006700         10  AP002-FILLER-3                 PIC X(179).           00670005
