000100******************************************************************00010002
000200**  THIS IS THE RECORD LAYOUT FOR INVOICE ACTUAL AND ESTIMATE   **00020002
000300**  TOTAL COST FILE FOR IMPORT PURCHASE ORDERS.                 **00030002
000400**                                                              **00040002
000500**  APKUT058 - CREATED                                          **00050002
000600**  APKUT049 - USED                                             **00060002
000700**                                                              **00070002
000800**  RECORD FORMAT:  SEQUENTIAL                                  **00080002
000900**                  LRECL = 150                                 **00090002
001000**                                                              **00100002
001010**  02/04/2008 IYN  WR32664 - PRIVATE LABEL ACCOUNTING          **00101008
001011**                   ADDED NEW FIELD: AP062-LOAD-TYP-CDE        **00101103
001020**                                                              **00102003
001100******************************************************************00110002
001200 01  AP062-RECORD.                                                00120002
001300     05  AP062-VENDOR-NAME             PIC X(30).                 00130002
001400     05  AP062-VENDOR-NBR              PIC X(09).                 00140002
001500     05  AP062-PO-NBR                  PIC 9(09).                 00150002
001600     05  AP062-FIRST-INVC-DTE          PIC X(10).                 00160002
001700     05  FILLER REDEFINES AP062-FIRST-INVC-DTE.                   00170002
001800         10  AP062-FIRST-INVC-CC       PIC X(2).                  00180002
001900         10  AP062-FIRST-INVC-YY       PIC X(2).                  00190002
002000         10  FILLER                    PIC X(1).                  00200002
002100         10  AP062-FIRST-INVC-MM       PIC X(2).                  00210002
002200         10  FILLER                    PIC X(1).                  00220002
002300         10  AP062-FIRST-INVC-DD       PIC X(2).                  00230002
002400     05  AP062-INV-1ST-COST-AMT        PIC S9(09)V99 COMP-3.      00240002
002500     05  AP062-INV-TOT-COST-AMT        PIC S9(09)V99 COMP-3.      00250002
002600     05  AP062-INV-UNT-QTY             PIC S9(09)    COMP-3.      00260002
002700     05  AP062-EST-1ST-COST-AMT        PIC S9(09)V99 COMP-3.      00270002
002800     05  AP062-EST-TOT-COST-AMT        PIC S9(09)V99 COMP-3.      00280002
002900     05  AP062-EST-UNT-QTY             PIC S9(09)    COMP-3.      00290002
003000     05  AP062-PO-1ST-COST-AMT         PIC S9(09)V99 COMP-3.      00300002
003100     05  AP062-PO-TOT-COST-AMT         PIC S9(09)V99 COMP-3.      00310002
003200     05  AP062-PO-UNT-QTY              PIC S9(09)    COMP-3.      00320002
003300     05  AP062-INV-NET-COST-AMT        PIC S9(09)V99 COMP-3.      00330002
003400     05  AP062-1ST-COST-LOAD-PCT       PIC S9V9999   COMP-3.      00340002
003410     05  AP062-LOAD-TYP-CDE            PIC X.                     00341003
003420         88  AP062-LIFUNG-LOAD            VALUE 'L'.              00342006
003430         88  AP062-PRIVATE-LABEL-LOAD     VALUE 'P'.              00343004
003440         88  AP062-NO-LOAD-TO-APPLY       VALUE 'N'.              00344004
003500     05  FILLER                        PIC X(31).                 00350003
