000100*----------------------------------------------------------------*00010003
000200*   RECORD LAYOUT FOR THE BATCH MATCH INVOICE EXTRACT FILE       *00020003
000300*                                                                *00030003
000400*   CREATED IN APKUT020                                          *00040003
000500*   USED IN APKUT022, APKUT023, APKUT040, APKUP250               *00050003
000600*                                                                *00060003
000700*   RECORD FORMAT IS SEQUENTIAL                                  *00070003
000800*          LENGTH = 175                                          *00080003
000900*                                                                *00090004
001000* DATE  10/20/2006                                               *00100004
001100*     CHANGE MADE: MATCH BY DC PROJECT - ADDED AP060-DC-NBR,     *00110004
001200*     AP060-MTCH-LVL-CDE & AP060-MTCH-LOC-NBR TO END OF COPYBOOK.*00120004
001300*     MADE BY: MIKE BESKE              WR/IR #: WR21578          *00130004
001400*                                                                *00140004
001000* DATE  03/26/2021                                               *00141006
001100*     CHANGE MADE: ADD SEPHORA INDICATORS                        *00142006
001300*     MADE BY: JEAN KURK                                         *00144006
001400*                                                                *00145006
001500*----------------------------------------------------------------*00150004
001600 01  AP060-INVOICE-EXTRACT.                                       00160004
001700     05  AP060-VENDOR-DATA.                                       00170004
001800         10  AP060-VENDOR-NUMBER PIC  X(09)  VALUE SPACES.        00180004
001900         10  AP060-VENDOR-NAME   PIC  X(30)  VALUE SPACES.        00190004
002000     05  AP060-PO-NBR            PIC  9(09)  VALUE ZEROS.         00200004
002100     05  AP060-STR-NBR           PIC  9(04)  VALUE ZEROS.         00210004
002200     05  AP060-INVOICE-NUMBER    PIC  X(22)  VALUE SPACES.        00220004
002300     05  AP060-INVOICE-TYPE      PIC  X(02)  VALUE SPACES.        00230004
002400         88  AP060-MERCHANDISE-INVOICE       VALUE 'MI'.          00240004
002500         88  AP060-REMAINDER-INVOICE         VALUE 'RI'.          00250004
002600         88  AP060-EXPENSE-INVOICE           VALUE 'EI'.          00260004
002700         88  AP060-WRITEOFF-INVOICE          VALUE 'WO'.          00270004
002800     05  AP060-INVOICE-STATUS    PIC  X(02)  VALUE SPACES.        00280004
002900     05  AP060-INVOICE-DATE.                                      00290004
003000         10 AP060-INVOICE-CENT   PIC  9(02)  VALUE ZEROS.         00300004
003100         10 AP060-INVOICE-YEAR   PIC  9(02)  VALUE ZEROS.         00310004
003200         10 FILLER               PIC  X(01)  VALUE SPACES.        00320004
003300         10 AP060-INVOICE-MONTH  PIC  9(02)  VALUE ZEROS.         00330004
003400         10 FILLER               PIC  X(01)  VALUE SPACES.        00340004
003500         10 AP060-INVOICE-DAY    PIC  9(02)  VALUE ZEROS.         00350004
003600     05  AP060-ENTRY-METHOD      PIC  X(02)  VALUE SPACES.        00360004
003700         88  AP060-EDI-ENTRY                 VALUE 'ED'.          00370004
003800         88  AP060-MANUAL-ENTRY              VALUE 'MN'.          00380004
003900     05  AP060-GROSS-COST-AMT    PIC S9(09)V99 COMP-3             00390004
004000                                             VALUE ZEROS.         00400004
004100     05  AP060-TOT-INVOICE-QTY   PIC S9(09)    COMP               00410004
004200                                             VALUE ZEROS.         00420004
004300     05  AP060-PAYT-REQ-SEQ-NBR  PIC S9(09)    COMP               00430004
004400                                             VALUE ZEROS.         00440004
004500     05  AP060-ENTRY-DATE.                                        00450004
004600         10 AP060-ENTRY-CENT     PIC  9(02)  VALUE ZEROS.         00460004
004700         10 AP060-ENTRY-YEAR     PIC  9(02)  VALUE ZEROS.         00470004
004800         10 FILLER               PIC  X(01)  VALUE SPACE.         00480004
004900         10 AP060-ENTRY-MONTH    PIC  9(02)  VALUE ZEROS.         00490004
005000         10 FILLER               PIC  X(01)  VALUE SPACE.         00500004
005100         10 AP060-ENTRY-DAY      PIC  9(02)  VALUE ZEROS.         00510004
005200     05  AP060-DTL-ENTR-IND      PIC  X(01)  VALUE SPACES.        00520004
005300     05  AP060-DUE-DATE.                                          00530004
005400         10 AP060-DUE-CENT       PIC  9(02)  VALUE ZEROS.         00540004
005500         10 AP060-DUE-YEAR       PIC  9(02)  VALUE ZEROS.         00550004
005600         10 AP060-DUE-MONTH      PIC  9(02)  VALUE ZEROS.         00560004
005700         10 AP060-DUE-DAY        PIC  9(02)  VALUE ZEROS.         00570004
005800     05  AP060-CUTOFF-DATE.                                       00580004
005900         10 AP060-CUTOFF-CENT    PIC  9(02)  VALUE ZEROS.         00590004
006000         10 AP060-CUTOFF-YEAR    PIC  9(02)  VALUE ZEROS.         00600004
006100         10 AP060-CUTOFF-MONTH   PIC  9(02)  VALUE ZEROS.         00610004
006200         10 AP060-CUTOFF-DAY     PIC  9(02)  VALUE ZEROS.         00620004
006300     05  AP060-TERMS-SEL-CDE     PIC  X(01)  VALUE SPACE.         00630004
006400         88  AP060-INVOICE-TERMS             VALUE 'I'.           00640004
006500         88  AP060-PO-TERMS                  VALUE 'P'.           00650004
006600     05  AP060-TERMS-DISC-PCT    PIC SV9(04) COMP-3               00660004
006700                                             VALUE ZEROS.         00670004
006800     05  AP060-TERMS-DUE-DAY-QTY PIC  9(03)  VALUE ZEROS.         00680004
006900     05  AP060-TERMS-EXT-DAY-QTY PIC  9(03)  VALUE ZEROS.         00690004
007000     05  AP060-EOM-INDICATOR     PIC  X(02)  VALUE SPACES.        00700004
007100     05  AP060-PAYMENT-DUE-SW    PIC  X(01)  VALUE SPACES.        00710004
007200         88  AP060-PAYMENT-DUE               VALUE 'Y'.           00720004
007300         88  AP060-PAYMENT-NOT-DUE           VALUE ' '.           00730004
007400     05  AP060-DUE-DTE-SRC-CDE   PIC  X(01)  VALUE SPACES.        00740004
007500         88  AP060-SRC-INVOICE               VALUE 'I'.           00750004
007600         88  AP060-SRC-RECEIVER              VALUE 'R'.           00760004
007700         88  AP060-SRC-EXCEPTION             VALUE 'X'.           00770004
007800     05  AP060-CRE-PRC-CDE       PIC  X(01)  VALUE SPACES.        00780004
007900         88  AP060-BATCH-MATCH               VALUE 'B'.           00790004
008000         88  AP060-AUTO-RECON                VALUE 'A'.           00800004
008100         88  AP060-EXPENSE                   VALUE 'E'.           00810004
008200     05  AP060-ENT-ID            PIC  S9(9)  COMP                 00820004
008300                                             VALUE ZEROS.         00830004
008400     05  AP060-PO-TYP-CDE        PIC  X(02)  VALUE SPACES.        00840004
008500     05  AP060-NET-COST-AMT      PIC S9(9)V99 COMP-3.             00850004
008600     05  AP060-DC-NBR            PIC  9(05)  VALUE ZEROS.         00860004
008700     05  AP060-MTCH-LVL-CDE      PIC  X(01)  VALUE SPACES.        00870004
008800         88  AP060-MTCH-LVL-STR              VALUE 'S'.           00880004
008900         88  AP060-MTCH-LVL-DC               VALUE 'D'.           00890004
009000         88  AP060-MTCH-LVL-BULK             VALUE 'P'.           00900004
009100     05  AP060-MTCH-LOC-NBR      PIC  9(05)  VALUE ZEROS.         00910004
008700     05  AP060-SEPHORA-VND-IND   PIC  X(01)  VALUE SPACES.        00911005
008800         88  AP060-SEPHORA-VND-YES           VALUE 'Y'.           00912005
008900         88  AP060-SEPHORA-VND-NO            VALUE 'N'.           00913005
008700     05  AP060-SEPHORA-DPT-IND   PIC  X(01)  VALUE SPACES.        00914005
008800         88  AP060-SEPHORA-DPT-YES           VALUE 'Y'.           00915005
008900         88  AP060-SEPHORA-DPT-NO            VALUE 'N'.           00916005
009200     05  FILLER                  PIC  X(04)  VALUE SPACES.        00920005
