000100*----------------------------------------------------------------*        
000200*   SUMMARY OF UNJOURNALIZED RECEIPTS BY FISCAL PERIOD           *        
000300*   RECORD LENGTH = 70                                           *        
000400*----------------------------------------------------------------*        
000500 01  AP030-UNJ-NI-RCPT-SUMMARY.                                           
000600     05  AP030-FISCAL-CENTURY         PIC  9(02).                         
000600     05  AP030-FISCAL-YEAR            PIC  9(02).                         
000600     05  AP030-FISCAL-PERIOD          PIC  9(02).                         
000600     05  AP030-RCV-RETAIL-TOTAL       PIC S9(11)V99 COMP-3.               
000600     05  AP030-RCV-COST-TOTAL         PIC S9(11)V99 COMP-3.               
000600     05  AP030-RCV-ITEM-QTY           PIC S9(07)    COMP-3.               
000600     05  AP030-NIR-RETAIL-TOTAL       PIC S9(11)V99 COMP-3.               
000600     05  AP030-NIR-COST-TOTAL         PIC S9(11)V99 COMP-3.               
000600     05  AP030-NIR-ITEM-QTY           PIC S9(07)    COMP-3.               
000600     05  AP030-TOTAL-RETAIL           PIC S9(11)V99 COMP-3.               
000600     05  AP030-TOTAL-COST             PIC S9(11)V99 COMP-3.               
000600     05  AP030-TOTAL-ITEM-QTY         PIC S9(07)    COMP-3.               
000900     05  FILLER                       PIC  X(10).                         
