000100*----------------------------------------------------------------*00010015
000200*   MISSED ALLOWANCE REPORT RECORD LAYOUT                        *00020015
000300*                                                                *00030015
000400*   RECORD FORMAT IS SEQUENTIAL                                  *00040015
000500*          LENGTH IS 200                                         *00050015
000600*----------------------------------------------------------------*00060015
000700 01  AP090-RECORD.                                                00070015
000800     05  AP090-RECORD-KEY.                                        00080015
000900         10  AP090-VENDOR-NBR                PIC 9(09).           00090015
000910         10  AP090-VENDOR-NAME               PIC X(30).           00091015
001000         10  AP090-DEPT-NBR                  PIC X(03).           00100015
001100         10  AP090-PO-NBR                    PIC 9(09).           00110015
001200         10  AP090-RECORD-TYPE               PIC X(01).           00120015
001300             88  AP090-VNDAGR-DATA                     VALUE 'A'. 00130015
001400             88  AP090-RECEIVER-DATA                   VALUE 'B'. 00140015
001500             88  AP090-INVOICE-DATA                    VALUE 'C'. 00150015
001700         10  AP090-DETAIL-SORT-CDE           PIC X(1).            00170015
001800             88  AP090-CURRENT-PERIOD                  VALUE 'A'. 00180015
001900             88  AP090-PREVIOUS-PERIOD                 VALUE 'B'. 00190015
002000             88  AP090-UNMATCHED                       VALUE 'C'. 00200015
002010         10  AP090-INVC-RECORD-TYPE          PIC X(01).           00201016
002020             88  AP090-INVOICE-HEADER                  VALUE 'A'. 00202016
002030             88  AP090-ALLOWANCE-DATA                  VALUE 'B'. 00203016
002100         10  FILLER                          PIC X(11).           00210016
002200     05  AP090-AGRMNT-RECORD.                                     00220015
002400         10  AP090-EFFECTIVE-DATE            PIC X(10).           00240015
002500         10  AP090-ALLOW-TYP-CDE             PIC X(03).           00250015
002600         10  AP090-ALLOW-PERCENT             PIC 9V9999.          00260015
002700         10  FILLER                          PIC X(37).           00270015
002800     05  AP090-RECVR-RECORD      REDEFINES AP090-AGRMNT-RECORD.   00280015
002900         10  AP090-RECVR-SEQ-NBR             PIC 9(09).           00290015
003000         10  AP090-RECVR-QTY                 PIC 9(07).           00300015
003100         10  AP090-RECVR-AMT                 PIC 9(09)V99  COMP-3.00310015
003200         10  AP090-RECVR-VERFYD-DTE          PIC X(10).           00320015
003300         10  FILLER                          PIC X(23).           00330015
003400     05  AP090-INVOICE-RECORD    REDEFINES AP090-AGRMNT-RECORD.   00340015
003500         10  AP090-INVC-NBR                  PIC X(22).           00350015
003600         10  AP090-INVC-DATE                 PIC X(10).           00360015
003700         10  AP090-INVC-QTY                  PIC 9(07).           00370015
003800         10  AP090-INVC-GRO-COST-AMT         PIC 9(09)V99  COMP-3.00380015
003900         10  AP090-INVC-ALW-IND              PIC X(01).           00390015
004000             88  AP090-ALLOWANCES-EXIST                VALUE 'Y'. 00400015
004100             88  AP090-NO-ALLOWANCES-EXIST             VALUE 'N'. 00410015
004200         10  FILLER                          PIC X(09).           00420015
004300     05  AP090-ALLOWANCE-RECORD  REDEFINES AP090-AGRMNT-RECORD.   00430015
004400         10  AP090-ALW-INVC-NBR              PIC X(22).           00440015
004500         10  AP090-ALW-CDE                   PIC X(03).           00450015
004600             88  AP090-NEW-STORE-DISCOUNT             VALUE 'NSD'.00460015
004700             88  AP090-TRADE-DISCOUNT                 VALUE 'TRD'.00470015
004800             88  AP090-MOS-ALLOWANCE                  VALUE 'MOS'.00480015
004900             88  AP090-BROADCAST-ALLOWANCE            VALUE 'ADV'.00490015
005000             88  AP090-COOP-ALLOWANCE                 VALUE 'COP'.00500015
005100             88  AP090-PROFIT-ASST-ALLOWANCE          VALUE 'ALW'.00510015
005200             88  AP090-BRIDAL-ALLOWANCE               VALUE 'BRD'.00520015
005300         10  AP090-ALW-PCNT                  PIC 9V9999.          00530015
005400         10  AP090-ALW-AMT                   PIC 9(09)V99  COMP-3.00540015
005500         10  FILLER                          PIC X(19).           00550015
