000100******************************************************************00010009
000200**  RECONCILIATION RESULTS SUMMARY REPORT RECORD LAYOUT         **00020010
000300**                                                              **00030009
000400**  OUTPUT FROM  :  APKUT028                                    **00040009
000500**  INPUT TO     :  APKRP269                                    **00050009
000600**                                                              **00060009
000700**  RECORD LENGTH:  275                                         **00070009
000800**  RECORD FORMAT:  SEQUENTIAL                                  **00080009
000900**  SORT SEQUENCE:  GMM#, DMM#, BUYER#, DEPT#, VENDOR NAME, PO# **00090009
001000**                                                              **00100009
001100******************************************************************00110009
001200 01  AP269-RECORD.                                                00120009
001300     05  AP269-GMM-NBR                   PIC X(02).               00130009
001400     05  AP269-GMM-NAME                  PIC X(25).               00140009
001500     05  AP269-DMM-NBR                   PIC X(02).               00150009
001600     05  AP269-DMM-NAME                  PIC X(25).               00160009
001700     05  AP269-BUYER-NBR                 PIC X(03).               00170009
001800     05  AP269-BUYER-NAME                PIC X(25).               00180009
001900     05  AP269-DEPT-NBR                  PIC X(03).               00190009
002000     05  AP269-DEPT-NAME                 PIC X(25).               00200009
002100     05  AP269-VENDOR-NBR                PIC 9(09).               00210009
002200     05  AP269-VENDOR-NAME               PIC X(30).               00220009
002300     05  AP269-PO-NBR                    PIC 9(09).               00230010
002400     05  AP269-PAID-INVC-COST            PIC 9(11)V99  COMP-3.    00240009
002500     05  AP269-JRNLD-RCV-COST            PIC 9(11)V99  COMP-3.    00250009
002600     05  AP269-OPEN-INVC-COST            PIC 9(11)V99  COMP-3.    00260009
002700     05  AP269-OPEN-SHORT-COST           PIC 9(11)V99  COMP-3.    00270009
002800     05  AP269-OPEN-OVER-COST            PIC 9(11)V99  COMP-3.    00280009
002900     05  AP269-TR-CDE-12-COST            PIC 9(11)V99  COMP-3.    00290009
003000     05  AP269-TR-CDE-76-COST            PIC 9(11)V99  COMP-3.    00300009
003100     05  AP269-TR-CDE-10-COST            PIC 9(11)V99  COMP-3.    00310009
003200     05  AP269-TR-CDE-16-COST            PIC 9(11)V99  COMP-3.    00320009
003300     05  AP269-TR-CDE-36-COST            PIC 9(11)V99  COMP-3.    00330009
003400     05  AP269-TR-CDE-37-COST            PIC 9(11)V99  COMP-3.    00340009
003500     05  FILLER                          PIC X(40).               00350010
