000100******************************************************************        
000200**  BATCH MATCH RECEIVING TOTAL RECORD LAYOUT                   **        
000300**                                                              **        
000400**  APKUT021 - CREATED                                          **        
000500**  APKUP250 - USED                                             **        
000600**                                                              **        
000700**  RECORD FORMAT:  SEQUENTIAL                                  **        
000800**                  LRECL = 35                                  **        
000900**                                                              **        
001000******************************************************************        
001100 01  AP020-RECORD.                                                        
001200     05  AP020-KEY.                                                       
001300         10  AP020-PO-NBR                  PIC 9(09).                     
001400         10  AP020-STR-NBR                 PIC 9(04).                     
001500         10  AP020-RECV-TOT-COST-AMT       PIC S9(09)V99  COMP-3.         
001600         10  FILLER                        PIC X(16).                     
