000100*----------------------------------------------------------------*00010000
000200*  RECORD LAYOUT FOR THE ACCOUNTS PAYABLE PAYMENT HOLD TEXT FILE *00020000
000300*                                                                *00030000
000400*   CREATED IN APKUT059                                          *00040000
000500*                                                                *00050000
000600*   RECORD FORMAT IS SEQUENTIAL                                  *00060000
000700*          LENGTH = 26                                           *00070000
000800*----------------------------------------------------------------*00080000
000900 01  AP007-TEXT-FILE.                                             00090000
001100     05  AP007-INVC-NBR                  PIC X(16).               00110000
001110     05  AP007-VND-NBR                   PIC X(9).                00111001
001200     05  AP007-PAYMENT-HOLD              PIC X(1).                00120000
