000100*----------------------------------------------------------------*00010001
000200*  RECORD LAYOUT FOR THE ADJUSTMENT JOURNAL MERCHANDISE EXTRACT  *00020001
000300*                                                                *00030001
000400*   APKUP137 - CREATED                                           *00040001
000500*   APKUT138, APKRP140 - USED                                    *00050001
000600*                                                                *00060001
000700*   RECORD FORMAT IS SEQUENTIAL                                  *00070001
000800*      LENGTH = 250                                              *00080001
000900*----------------------------------------------------------------*00090001
001000 01  AP046-EXTRACT-FILE.                                          00100001
001200     05  AP046-DMA-NBR                   PIC X(2).                        
002700     05  AP046-DEPT-NBR                  PIC X(3).                        
007400     05  AP046-MAJ-CL-NBR                PIC X(2).                        
007400     05  AP046-CL-NBR                    PIC X(2).                        
007500     05  AP046-SKU-NBR                   PIC 9(8).                        
001200     05  AP046-VND-NBR                   PIC X(9).                        
002600     05  AP046-PO-NBR                    PIC X(9).                        
007300     05  AP046-HDR-STR-NBR               PIC 9(5).                        
007300     05  AP046-STR-NBR                   PIC 9(5).                        
001300     05  AP046-DOC-NBR                   PIC X(16).                       
001400     05  AP046-DOC-DTE                   PIC X(10).                       
001500     05  FILLER REDEFINES AP046-DOC-DTE.                                  
001600         10  AP046-DOC-CC                PIC X(2).                        
001700         10  AP046-DOC-YY                PIC X(2).                        
001800         10  FILLER                      PIC X(1).                        
001900         10  AP046-DOC-MM                PIC X(2).                        
002000         10  FILLER                      PIC X(1).                        
002100         10  AP046-DOC-DD                PIC X(2).                        
002900     05  AP046-AP-TRN-CDE                PIC X(2).                        
005600     05  AP046-TRN-SHRT-DESC             PIC X(18).                       
005600     05  AP046-ENT-NME-DESC              PIC X(30).                       
003300     05  AP046-PSTG-TYP-CDE              PIC X(2).                        
003400         88  AP046-CREDIT                    VALUE 'CR'.                  
003400         88  AP046-CHARGE                    VALUE 'CH'.                  
003800     05  AP046-PSTG-FYR-NBR              PIC X(4).                        
003800     05  AP046-PSTG-FMN-NBR              PIC X(2).                        
003800     05  AP046-PSTG-FWK-NBR              PIC X(2).                        
004500     05  AP046-INV-CUTOFF-DTE            PIC X(10).                       
004600     05  FILLER REDEFINES AP046-INV-CUTOFF-DTE.                           
004700         10  AP046-INV-CUTOFF-CC         PIC X(2).                        
004800         10  AP046-INV-CUTOFF-YY         PIC X(2).                        
004900         10  FILLER                      PIC X(1).                        
005000         10  AP046-INV-CUTOFF-MM         PIC X(2).                        
005100         10  FILLER                      PIC X(1).                        
005200         10  AP046-INV-CUTOFF-DD         PIC X(2).                        
007600     05  AP046-RETL-AMT                  PIC S9(11)V99 COMP-3.            
007700     05  AP046-GRO-COST-AMT              PIC S9(11)V99 COMP-3.            
007800     05  AP046-FRGT-AMT                  PIC S9(11)V99 COMP-3.            
007900     05  AP046-MISC-CHRG-AMT             PIC S9(11)V99 COMP-3.            
008000     05  AP046-NET-COST-AMT              PIC S9(11)V99 COMP-3.            
008100     05  AP046-DISC-AMT                  PIC S9(11)V99 COMP-3.            
001400     05  AP046-ENTR-DTE                  PIC X(10).                       
001500     05  FILLER REDEFINES AP046-ENTR-DTE.                                 
001600         10  AP046-ENTR-CC               PIC X(2).                        
001700         10  AP046-ENTR-YY               PIC X(2).                        
001800         10  FILLER                      PIC X(1).                        
001900         10  AP046-ENTR-MM               PIC X(2).                        
002000         10  FILLER                      PIC X(1).                        
002100         10  AP046-ENTR-DD               PIC X(2).                        
008500     05  FILLER                          PIC X(57).               00890001
