000010*----------------------------------------------------------------*00001000
000020*   RECORD LAYOUT FOR THE ADJUSTMENT INTERFACE EXCEPTION REPORT  *00002000
000030*                                                                *00003000
000040*   RECORD FORMAT IS SEQUENTIAL                                  *00004000
000050*          LENGTH = 154                                          *00005006
000060*----------------------------------------------------------------*00006000
000100 01  AP122-ADJ-INTERFACE-EXCEPTIONS.                              00010000
000300     05  AP122-VND-NBR             PIC X(09)    VALUE SPACES.     00030002
000500     05  AP122-DOC-NBR             PIC X(16)    VALUE SPACES.     00050002
000700     05  AP122-DOC-DTE             PIC X(10)    VALUE SPACES.     00070002
000900     05  AP122-AP-TRN-CDE          PIC X(02)    VALUE SPACES.     00090002
000900     05  AP122-PO-NBR              PIC X(09)    VALUE ZEROES.     00100005
000900     05  AP122-NET-COST            PIC S9(7)V99 COMP-3            00101004
000900                                                VALUE ZEROES.     00101104
000900     05  AP122-NET-RETAIL          PIC S9(7)V99 COMP-3            00102004
000900                                                VALUE ZEROES.     00103004
001100     05  AP122-ERROR-TYP-CDE       PIC X        VALUE SPACES.     00110002
001110         88 AP122-WARNING                       VALUE 'W'.        00111001
001120         88 AP122-REJECTION                     VALUE 'R'.        00112001
001200     05  AP122-ERROR-FIELD         PIC X(25)    VALUE SPACES.     00120002
001300     05  AP122-ERROR-VALUE         PIC X(22)    VALUE SPACES.     00130002
001500     05  AP122-ERROR-MESSAGE       PIC X(50)    VALUE SPACES.     00150002
