000100*----------------------------------------------------------------*00010000
000200*   RECORD LAYOUT FOR THE LI & FUNG INVOICE FTP FILE             *00020002
000300*                                                                *00030000
000400*   RECORD FORMAT IS SEQUENTIAL                                  *00040000
000500*          LENGTH =  64                                          *00050001
000600*----------------------------------------------------------------*00060000
000700 01  AP017-LIFUNG-INVOICE-RECORD.                                 00070002
000800     05  AP017-INVC-ID                   PIC X(22).               00080000
000900     05  DELIMIT-01                      PIC X(01).               00090002
001000     05  AP017-INVC-TYP-CDE              PIC X(02).               00100000
001100     05  DELIMIT-02                      PIC X(01).               00110000
001200     05  AP017-ENTR-DTE                  PIC X(10).               00120000
001300     05  DELIMIT-03                      PIC X(01).               00130000
001400     05  AP017-GROSS-COST-AMT            PIC ---------9.99.       00140001
001500     05  DELIMIT-04                      PIC X(01).               00150000
001600     05  AP017-NET-COST-AMT              PIC ---------9.99.       00160001
