000100*----------------------------------------------------------------*00010000
000200*   PRIVATE LABEL UNJOURNALIZED RECEIPTS EXTRACT                 *00020001
000300*                                                                *00031001
000400*   RECORD FORMAT IS SEQUENTIAL                                  *00040000
000500*          LENGTH = 160                                          *00050001
000600*----------------------------------------------------------------*00060000
000700 01  AP075-EXTRACT-FILE.                                          00070002
000800     05  AP075-VND-NBR                   PIC X(09).               00080002
000900     05  AP075-ENT-NM-DESC               PIC X(30).               00090002
001000     05  AP075-DMM-NBR                   PIC 9(03).               00100002
001100     05  AP075-DEPT-NBR                  PIC 9(03).               00110002
001200     05  AP075-CL-NBR                    PIC 9(03).               00120002
001300     05  AP075-PO-NBR                    PIC 9(09).               00130002
001400     05  AP075-STR-NBR                   PIC X(04).               00140002
001500     05  AP075-SKU-NBR                   PIC 9(08).               00150002
001700     05  AP075-AP-VERIFY-ITM-QTY         PIC S9(06) COMP-3.       00170002
001800     05  AP075-EXTD-1ST-COST-AMT         PIC S9(08)V999 COMP-3.   00180002
002000     05  AP075-EXTD-UNIT-COST-AMT        PIC S9(08)V999 COMP-3.   00200002
002400     05  AP075-VRFD-DTE                  PIC X(10).               00240002
002900     05  AP075-REC-SEQ-NBR               PIC 9(09).               00290002
003000     05  AP075-PO-TYP-CDE                PIC X(02).               00300002
003100     05  AP075-DERVD-LBL-TYP-CDE         PIC X(01).               00310003
003200     05  FILLER                          PIC X(53).               00320003
