000100*----------------------------------------------------------------*        
000200*  RECORD LAYOUT FOR THE IMAGING DATABASE DELETION FILE          *        
000300*                                                                *        
000400*   APKUP512 - CREATED                                           *        
000500*   APKRP522 - USED                                              *        
000600*                                                                *        
000700*   RECORD FORMAT IS SEQUENTIAL                                  *        
000800*      LENGTH = 200                                              *        
000900*----------------------------------------------------------------*        
001000 01  AP512-APIMAG-DEL-REC.                                                
001100     05  AP512-RECORD-KEY.                                                
001101         10  AP512-SRC-PGM                   PIC X(8).                    
001102         10  AP512-DEL-DTE.                                               
001103             15  AP512-DEL-CC                PIC X(2).                    
001104             15  AP512-DEL-YY                PIC X(2).                    
001105             15  FILLER                      PIC X(1).                    
001106             15  AP512-DEL-MM                PIC X(2).                    
001107             15  FILLER                      PIC X(1).                    
001108             15  AP512-DEL-DD                PIC X(2).                    
001110         10  AP512-DEL-NBR                   PIC 9(3).                    
001111         10  AP512-DEL-TYP                   PIC 9(2).                    
001112             88  AP512-KEYS-DEL                  VALUE 1.                 
001113             88  AP512-SCAN-DEL                  VALUE 2.                 
001180         10  AP512-SORT-DTE.                                              
001190             15  AP512-SORT-CC               PIC X(2).                    
001191             15  AP512-SORT-YY               PIC X(2).                    
001192             15  FILLER                      PIC X(1).                    
001193             15  AP512-SORT-MM               PIC X(2).                    
001194             15  FILLER                      PIC X(1).                    
001195             15  AP512-SORT-DD               PIC X(2).                    
001200         10  AP512-BRCDE-NBR                 PIC X(9).                    
001300     05  AP512-KEYS-DATA.                                                 
001400         10  AP512-ENTR-DTE.                                              
001500             15  AP512-ENTR-CC           PIC X(2).                        
001600             15  AP512-ENTR-YY           PIC X(2).                        
001700             15  FILLER                  PIC X(1).                        
001800             15  AP512-ENTR-MM           PIC X(2).                        
001900             15  FILLER                  PIC X(1).                        
002000             15  AP512-ENTR-DD           PIC X(2).                        
002800         10  AP512-PO-NBR                PIC X(9).                        
002900         10  AP512-DEPT-NBR              PIC X(3).                        
003000         10  AP512-VND-NBR               PIC X(9).                        
003100         10  AP512-VND-NM                PIC X(30).                       
003200         10  AP512-DOC-NBR               PIC X(16).                       
003300         10  AP512-DOC-DTE.                                               
003500             15  AP512-DOC-CC            PIC X(2).                        
003600             15  AP512-DOC-YY            PIC X(2).                        
003700             15  FILLER                  PIC X(1).                        
003800             15  AP512-DOC-MM            PIC X(2).                        
003900             15  FILLER                  PIC X(1).                        
004000             15  AP512-DOC-DD            PIC X(2).                        
004100         10  AP512-DOC-TYP-CDE           PIC X(2).                        
004200         10  AP512-AP-TRN-CDE            PIC X(2).                        
004210         10  AP512-SRC-CDE               PIC X(3).                        
004211             88  AP512-SRC-KEYED             VALUE 'INV', 'ADJ',          
004212                                                   'PSV'.                 
004213             88  AP512-SRC-SCANNED           VALUE 'SCN', 'MAN'.          
004214             88  AP510-SRC-INDEXING          VALUE 'IDX', 'EXP'.          
004220             88  AP512-INVOICE-DB            VALUE 'INV'.                 
004230             88  AP512-ADJRNL-DB             VALUE 'ADJ'.                 
004240             88  AP512-PS-VOUCHER-DB         VALUE 'PSV'.                 
004241             88  AP512-SCANNED-DOC           VALUE 'SCN'.                 
004242             88  AP512-MAN-KEY-DOC           VALUE 'MAN'.                 
004244             88  AP512-INDEXED-DOC           VALUE 'IDX'.                 
004245             88  AP512-EXPORTED-DOC          VALUE 'EXP'.                 
004250         10  AP512-PAYT-REQ-SEQ-NBR      PIC S9(9) COMP.                  
004300         10  AP512-VOUCHER-NBR           PIC X(8).                        
004400         10  AP512-BUSINESS-UNIT         PIC X(5).                        
004410         10  FILLER                      PIC X(47).                       
004500     05  AP512-SCAN-DATA REDEFINES AP512-KEYS-DATA.                       
004600         10  AP512-SCN-DTE.                                               
004700             15  AP512-SCN-CC            PIC X(2).                        
004800             15  AP512-SCN-YY            PIC X(2).                        
004900             15  FILLER                  PIC X(1).                        
004910             15  AP512-SCN-MM            PIC X(2).                        
004920             15  FILLER                  PIC X(1).                        
004930             15  AP512-SCN-DD            PIC X(2).                        
004940         10  AP512-DOC-BTCH-NM           PIC X(20).                       
004950         10  AP512-UMTCH-SCN-CNT         PIC 9(4).                        
005000         10  FILLER                      PIC X(124).                      
