000100******************************************************************        
000200**  THIS IS THE RECORD LAYOUT FOR RECEIVING ACTUAL AND ESTIMATE **        
000300**  VARIANCE FILE FOR IMPORT PURCHASE ORDERS.                   **        
000400**                                                              **        
000500**  APKUT057 - CREATED                                          **        
000700**  APKUT049 - USED                                             **        
000800**                                                              **        
000900**  RECORD FORMAT:  SEQUENTIAL                                  **        
001000**                  LRECL = 80                                  **        
001100**                                                              **        
001200******************************************************************        
001300 01  AP034-RECORD.                                                        
001400     05  AP034-PO-NBR                  PIC 9(09).                         
001401     05  AP034-PO-LNE-NBR              PIC 9(09).                         
001402     05  AP034-ALW-CHRG-CDE            PIC X(03).                         
002900     05  AP034-REC-ELC-COST-AMT        PIC S9(09)V99 COMP-3.              
003100     05  AP034-REC-UNT-QTY             PIC S9(09)    COMP-3.              
003101     05  AP034-EST-ELC-COST-AMT        PIC S9(09)V99 COMP-3.              
003102     05  AP034-EST-UNT-QTY             PIC S9(09)    COMP-3.              
003103     05  AP034-VAR-ELC-COST-AMT        PIC S9(09)V99 COMP-3.              
003104     05  AP034-VAR-UNT-QTY             PIC S9(09)    COMP-3.              
003105     05  AP034-AP-PRC-CDE              PIC X(01).                         
003400     05  AP034-FOB-CDE                 PIC X(03).                         
003500     05  FILLER                        PIC X(22).                         
