000100******************************************************************09/27/95
000200**  THIS IS THE RECORD LAYOUT FOR THE RECEIVING TABLES STATUS   **APRD254 
000300**  UPDATE FILE  (PKMO.AP.RECEIV.UPDATE)                        **   LV006
000400**                                                              **APRD254 
000500**  RECORD FORMAT:  SEQUENTIAL, LRECL=72                        **APRD254 
000600******************************************************************APRD254 
000700 01  AP254-RECORD.                                                APRD254 
000800     05  AP254-RECORD-TYPE                   PIC  9(01).          APRD254 
000900         88  AP254-TRECDIS-UPDATE            VALUE 1.                CL**5
001000         88  AP254-TRECEIV-UPDATE            VALUE 2.                CL**5
001100         88  AP254-TNINREC-UPDATE            VALUE 3.             APRD254 
001200     05  AP254-RECORD-KEY                    PIC  X(46).          APRD254 
001300     05  AP254-TRECDIS-KEY       REDEFINES AP254-RECORD-KEY.      APRD254 
001400         10  AP254-RD-PURCHASE-ORDER         PIC S9(09) COMP.     APRD254 
001500         10  AP254-RD-PO-LNE-NBR             PIC S9(09) COMP.     APRD254 
001600         10  AP254-RD-REC-SEQ-NBR            PIC S9(09) COMP.     APRD254 
001700         10  AP254-RD-OPER-UNIT-ID           PIC S9(04) COMP.     APRD254 
001800         10  AP254-RD-FACILITY-ID            PIC S9(04) COMP.     APRD254 
001900         10  AP254-RD-STORE-NBR              PIC S9(04) COMP.     APRD254 
002000         10  AP254-RD-STORE-FCLTY-ID         PIC S9(04) COMP.     APRD254 
002100         10  AP254-RD-CRE-TMST               PIC  X(26).          APRD254 
002200     05  AP254-TRECEIV-KEY       REDEFINES AP254-RECORD-KEY.      APRD254 
002300         10  AP254-RC-PURCHASE-ORDER         PIC S9(09) COMP.     APRD254 
002400         10  AP254-RC-RECVR-SEQ-NBR          PIC S9(09) COMP.     APRD254 
002500         10  AP254-RC-CRE-TMST               PIC  X(26).          APRD254 
002600         10  FILLER                          PIC  X(12).          APRD254 
002700     05  AP254-TNINREC-KEY-DATA  REDEFINES AP254-RECORD-KEY.      APRD254 
002800         10  AP254-NR-PURCHASE-ORDER         PIC S9(09) COMP.     APRD254 
002900         10  AP254-NR-PO-LNE-NBR             PIC S9(09) COMP.     APRD254 
003000         10  AP254-NR-NINVC-SEQ-NBR          PIC S9(09) COMP.     APRD254 
003100         10  FILLER                          PIC  X(34).             CL**3
003200     05  AP254-RC-PO-TYPE                    PIC  X.              APRD254 
003300         88  AP254-BULK-PO                        VALUE 'B'.      APRD254 
003400         88  AP254-STORE-PO                       VALUE 'S'.      APRD254 
003410         88  AP254-DC-PO                          VALUE 'D'.      APRD254 
003500     05  AP254-AP-PRC-DTE                    PIC  X(10).          APRD254 
003510     05  AP254-AP-PRC-CDE                    PIC  X(01).          APRD254 
003520         88  AP254-UNJRNLZD                     VALUE ' '.                
003530         88  AP254-MATCHED                      VALUE 'M'.                
003540         88  AP254-JRNLZD                       VALUE 'J'.                
003550         88  AP254-WRT-OFF                      VALUE 'W'.                
003600*          USED FOR TRECDIS AND TRECEIV UPDATES                      CL**4
003700     05  FILLER                              PIC  X(13).          APRD254 
