000100******************************************************************00010032
000200*  THIS IS THE COPYBOOK FOR THE TRANS INTERNATIONAL FREIGHT FILE *00020032
000300*                                                                *00030039
000400*  USED IN: APKRP282, TRANS INTERNATION FREIGHT REPORT           *00040032
000500*           APKUP130, FORMAT FREIGHT TRANSACTIONS...             *00050032
000600*           APKUT001, TRANS INTERNATIONAL FREIGHT FTP PROGRAM    *00060032
000700*                                                                *00070032
000800*  LRECL 273                                                     *00080039
000900*                                                                *00090032
001000*  NOTE: ANY CHANGES TO THIS COPYBOOK SHOULD ALSO BE MADE IN     *00100032
001100*        APRD025, THE TRANS INTERNATIONAL FTP FREIGHT FILE.      *00110032
001200*                                                                *00120032
001300******************************************************************00130032
001400*  CHANGE RECORD:                                                *00140032
001500*                                                                *00150032
001600*  05/01/2001  KEVIN CATLIN                       WR# 22119      *00160032
001700*    ADDED SHIP DATE AND DELIVERY DATE (BOTH 8 BYTES) TO THE     *00170032
001800*    FREIGHT-RECORD.  ADDED 16 BYTES TO FILLER IN TOTAL-RECORD.  *00180032
001900*                                                                *00190032
002000*  03/06/2003  KEVIN CATLIN                       WR# 24278      *00200032
002100*    ADDED NEW FIELD FOR CARRIER AUTHORIZATION NUMBER WITH A     *00210032
002200*    PICTURE OF X(12).  EXPANDED PO-NBR BY 2 BYTES TO A TOTAL OF *00220032
002300*    9 BYTES.  ADDED AP023-RECV-UNT-QTY FIELD (PACKED DECIMAL, 9 *00230032
002400*    BYTES).  ADDED 17 BYTES TO FILLER IN TOTAL-RECORD.          *00240032
002500*                                                                *00250032
002600*  05/06/2004  MIKE BESKE                         WR# 25805      *00260037
002700*    INCREASED THE LENGTH OF AP023-FR-STORE-NBR FROM X(03) TO    *00270036
002800*    X(04).  THE TRAILING ONE BYTE IS LEFT IN BECAUSE IT REPRE-  *00280036
002900*    SENTS A CONTROL CHARACTER (CARRIAGE RETURN?).  ELIMINATION  *00290036
003000*    OF THAT ONE BYTE HAS CAUSED FTP PROCESSING PROBLEMS IN THE  *00300038
003100*    PAST.                                                       *00310038
003200*                                                                *00320036
003210*  01/11/2011  ROLF NOHE                          WR# 38804      *00321042
003220*    ADDED AP023-FR-TRIP-ID FOR IMPORT REPLENISHMENT PROJECT.    *00322039
003230*    THIS ALSO REQUIRED THAT THE RECORD LENGTH FOR THIS COPYBOOK *00323040
003240*    BE INCREASED, FROM 264 TO 273.                              *00324040
003270*                                                                *00327039
003300******************************************************************00330032
003400 01  AP023-FREIGHT-RECORD.                                        00340032
003500     05  AP023-FREIGHT-DETAIL.                                    00350032
003600         10  AP023-FR-PRODBILL.                                   00360032
003700             15 AP023-FR-PB-FRST10          PIC  X(10).           00370032
003800             15 FILLER                      PIC  X(05).           00380032
003900         10  AP023-FR-PRO-DATE              PIC  X(08).           00390032
004000         10  FILLER REDEFINES AP023-FR-PRO-DATE.                  00400032
004100             15  AP023-FR-PRO-DATE-CC       PIC  X(02).           00410032
004200             15  AP023-FR-PRO-DATE-YY       PIC  X(02).           00420032
004300             15  AP023-FR-PRO-DATE-MM       PIC  X(02).           00430032
004400             15  AP023-FR-PRO-DATE-DD       PIC  X(02).           00440032
004500         10  AP023-FR-CARRIER-NAME          PIC  X(30).           00450032
004600         10  AP023-FR-SCAC-CODE             PIC  X(05).           00460032
004700         10  AP023-FR-BOL-NO                PIC  X(10).           00470032
004800         10  AP023-FR-CORR-AMT              PIC  S9(05)V99 COMP-3.00480032
004900         10  AP023-FR-AMT-PAID              PIC  S9(05)V99 COMP-3.00490032
005000         10  AP023-FR-VEND-NAME             PIC  X(10).           00500032
005100         10  AP023-FR-ORIG-ZIP              PIC  X(06).           00510032
005200         10  AP023-FR-ORIG                  PIC  X(20).           00520032
005300         10  FILLER REDEFINES AP023-FR-ORIG.                      00530032
005400             15 AP023-FR-ORIG-STATE         PIC  X(02).           00540032
005500             15 FILLER                      PIC  X(01).           00550032
005600             15 AP023-FR-ORIG-CITY          PIC  X(17).           00560032
005700         10  AP023-FR-DEST-ZIP              PIC  X(06).           00570032
005800         10  AP023-FR-DEST                  PIC  X(20).           00580032
005900         10  FILLER REDEFINES AP023-FR-DEST.                      00590032
006000             15 AP023-FR-DEST-STATE         PIC  X(02).           00600032
006100             15 FILLER                      PIC  X(01).           00610032
006200             15 AP023-FR-DEST-CITY          PIC  X(17).           00620032
006300         10  AP023-FR-PIECES                PIC  S9(05)V99 COMP-3.00630032
006400         10  AP023-FR-WEIGHT                PIC  S9(05)V99 COMP-3.00640032
006500         10  AP023-FR-RECVD-DATE            PIC  X(08).           00650032
006600         10  FILLER REDEFINES AP023-FR-RECVD-DATE.                00660032
006700             15  AP023-FR-RECVD-DATE-CC     PIC  X(02).           00670032
006800             15  AP023-FR-RECVD-DATE-YY     PIC  X(02).           00680032
006900             15  AP023-FR-RECVD-DATE-MM     PIC  X(02).           00690032
007000             15  AP023-FR-RECVD-DATE-DD     PIC  X(02).           00700032
007100         10  AP023-FR-DEPT                  PIC  X(03).           00710032
007200         10  AP023-FR-CLASSNO               PIC  X(02).           00720032
007300         10  AP023-FR-KEYREC                PIC  X(08).           00730032
007400         10  AP023-FR-PO-NBR                PIC  X(09).           00740032
007500         10  AP023-FR-P-C-T                 PIC  X(01).           00750032
007600         10  AP023-REC-SEQ-NBR              PIC S9(07)    COMP-3. 00760032
007700         10  AP023-FR-STORE-NBR             PIC  X(04).           00770034
007800         10  AP023-FR-ENTRY-DATE            PIC  X(08).           00780032
007900         10  FILLER REDEFINES AP023-FR-ENTRY-DATE.                00790032
008000             15  AP023-FR-ENTRY-DATE-CC     PIC  X(02).           00800032
008100             15  AP023-FR-ENTRY-DATE-YY     PIC  X(02).           00810032
008200             15  AP023-FR-ENTRY-DATE-MM     PIC  X(02).           00820032
008300             15  AP023-FR-ENTRY-DATE-DD     PIC  X(02).           00830032
008400         10  AP023-FR-CHECK-NBR             PIC  X(07).           00840032
008500         10  AP023-FR-BANK-NBR              PIC  X(02).           00850032
008600         10  AP023-FR-CHECK-DATE            PIC  X(08).           00860032
008700         10  FILLER REDEFINES AP023-FR-CHECK-DATE.                00870032
008800             15  AP023-FR-CHECK-DATE-CC     PIC  X(02).           00880032
008900             15  AP023-FR-CHECK-DATE-YY     PIC  X(02).           00890032
009000             15  AP023-FR-CHECK-DATE-MM     PIC  X(02).           00900032
009100             15  AP023-FR-CHECK-DATE-DD     PIC  X(02).           00910032
009200         10  AP023-FR-ENTRY-CODE            PIC  X(01).           00920032
009300         10  AP023-FR-AUDITOR               PIC  X(03).           00930032
009400         10  AP023-FR-TRANS-MODE            PIC  X(01).           00940032
009500         10  AP023-FR-BATCH-NO              PIC  X(09).           00950032
009600         10  AP023-FR-OPER1                 PIC  X(03).           00960032
009700         10  AP023-FR-OPER2                 PIC  X(03).           00970032
009800         10  AP023-FR-SHIP-DATE             PIC  X(08).           00980032
009900         10  FILLER REDEFINES AP023-FR-SHIP-DATE.                 00990032
010000             15  AP023-FR-SHIP-DATE-CC      PIC  X(02).           01000032
010100             15  AP023-FR-SHIP-DATE-YY      PIC  X(02).           01010032
010200             15  AP023-FR-SHIP-DATE-MM      PIC  X(02).           01020032
010300             15  AP023-FR-SHIP-DATE-DD      PIC  X(02).           01030032
010400         10  AP023-FR-DELIV-DATE            PIC  X(08).           01040032
010500         10  FILLER REDEFINES AP023-FR-DELIV-DATE.                01050032
010600             15  AP023-FR-DELIV-DATE-CC     PIC  X(02).           01060032
010700             15  AP023-FR-DELIV-DATE-YY     PIC  X(02).           01070032
010800             15  AP023-FR-DELIV-DATE-MM     PIC  X(02).           01080032
010900             15  AP023-FR-DELIV-DATE-DD     PIC  X(02).           01090032
011000         10  AP023-CARRIER-AUTH-NBR         PIC  X(12).           01100032
011100         10  AP023-RECV-UNT-QTY             PIC S9(09)    COMP-3. 01110032
011110         10  AP023-FR-TRIP-ID               PIC  X(09).           01111039
011200         10  FILLER                         PIC  X(01).           01120035
011300     05  AP023-TOTAL-RECORD   REDEFINES AP023-FREIGHT-DETAIL.     01130032
011400         10  AP023-TOTAL-INDICATOR          PIC  X(15).           01140032
011500         10  AP023-HASH-COUNT               PIC S9(07)    COMP-3. 01150032
011600         10  AP023-HASH-TOTAL               PIC S9(07)V99 COMP-3. 01160032
011700         10  FILLER                         PIC X(249).           01170039
