000100*---------------------------------------------------------------* 00010000
000200* RECORD LAYOUT FOR THE EDI IMPORT LANDED COST INVOICE FILE     * 00020000
000300*                                                               * 00030000
000400* IMPORT EXPENSE INVOICES THAT WILL BE EDITED FOR POSSIBLE      * 00040000
000500* INTERFACE INTO THE AP MERCHANDISE INVOICING SYSTEM TO RECORD  * 00050000
000600* ACTUAL IMPORT COSTS BY PURCHASE ORDER.                        * 00060000
000700*                                                               * 00070000
000800* RECORD FORMAT IS SEQUENTIAL.                                  * 00080000
000900*        LENGTH = 200                                           * 00090000
001000*                                                               * 00100000
001100* NOTE:  ANY CHANGES TO THIS COPYBOOK MUST ALSO BE MADE TO      * 00110000
001200*        COPYBOOK APWS015.                                      * 00120000
001300*---------------------------------------------------------------* 00130000
001400                                                                  00140000
001500 01  AP015-EDI-IMPORT-INVOICE.                                    00150000
001600     05  AP015-KEY.                                               00160000
001700         10  AP015-VNDR-INVC-KEY.                                 00170000
001800             15  AP015-VENDOR-NBR        PIC X(09).               00180000
001900             15  AP015-INVOICE-NBR       PIC X(22).               00190000
002000         10  AP015-RECORD-TYP-CDE        PIC X(02).               00200000
002100             88  AP015-210-INTRCHG-HDR       VALUE '01'.          00210000
002200             88  AP015-210-INVOICE-HDR       VALUE '02'.          00220000
002300             88  AP015-210-REF-ID            VALUE '03'.          00230000
002400             88  AP015-210-CHARGES           VALUE '04'.          00240000
002500         10  AP015-EDI-SEQ-NBR           PIC X(05).               00250000
002600         10  AP015-PO-NBR                PIC 9(09).               00260000
002610         10  AP015-RECYCLE-COUNT         PIC 9(02).               00261001
002700         10  FILLER                      PIC X(26).               00270001
002800     05  AP015-DATA-AREA                 PIC X(125).              00280000
002900     05  AP015-INTRCHG-DATA         REDEFINES  AP015-DATA-AREA.   00290000
003000         10  AP015-SENDER-ID-QUAL        PIC X(02).               00300000
003100         10  AP015-SENDER-ID             PIC X(15).               00310000
003200         10  AP015-INTRCHG-CNTL-NBR      PIC 9(09).               00320000
003300         10  AP015-GS-CNTL-NBR           PIC 9(09).               00330000
003400         10  AP015-TS-CNTL-NBR           PIC X(09).               00340000
003500         10  AP015-EDI-TMST-KEY          PIC X(26).               00350000
003600         10  AP015-EDI-SESSION-NBR       PIC X(6).                00360000
003700         10  FILLER                      PIC X(49).               00370000
003800                                                                  00380000
003900     05  AP015-INVOICE-DATA REDEFINES AP015-DATA-AREA.            00390000
004000         10  AP015-INVC-DTE.                                      00400000
004100             15  AP015-INVC-DTE-CC       PIC 9(02).               00410000
004200             15  AP015-INVC-DTE-YY       PIC 9(02).               00420000
004300             15  AP015-INVC-DTE-MM       PIC 9(02).               00430000
004400             15  AP015-INVC-DTE-DD       PIC 9(02).               00440000
004500         10  AP015-NET-INVC-AMT          PIC 9(9)V99.             00450000
004600         10  AP015-SCAC-CDE              PIC X(4).                00460000
004700         10  AP015-TERMS-TYP-CDE         PIC X(02).               00470000
004800             88  AP015-VALID-TERMS-TYP       VALUES '01', '05'.   00480000
004900         10  AP015-TERMS-BASIS-DTE-CDE   PIC X(02).               00490000
005000             88  AP015-VALID-BASIS-DTE       VALUE '03'.          00500000
005100         10  AP015-NET-DAYS-DUE          PIC 9(03).               00510000
005200         10  AP015-PO-QTY                PIC 9(15).               00520000
005300         10  AP015-PO-WEIGHT             PIC 9(10).               00530000
005310         10  AP015-PO-UOM-CDE            PIC X(2).                00531000
005320             88  AP015-PO-UOM-PIECE          VALUE 'PC'.          00532000
005330             88  AP015-PO-UOM-CARTON         VALUE 'CT'.          00533000
005340             88  AP015-VALID-PO-UOM          VALUE 'CT', 'PC'.    00534000
005350         10  FILLER                      PIC X(68).               00535000
005360                                                                  00536001
005370     05  AP015-REFERENCE-ID REDEFINES AP015-DATA-AREA.            00537001
005380         10  AP015-REF-ID-QUAL           PIC X(03).               00538001
005390             88  AP015-ENTRY-NBR             VALUE '6B '.         00539001
005400             88  AP015-CONTAINER-ID          VALUE '98 '.         00540001
005500             88  AP015-BOL-NBR               VALUE 'BM '.         00550001
005600             88  AP015-CUSTOMER-REF          VALUE 'CR '.         00560001
005700         10  AP015-REFERENCE-ID-NBR      PIC X(30).               00570001
005800         10  FILLER                      PIC X(92).               00580001
005900                                                                  00590001
006000     05  AP015-CHARGES REDEFINES  AP015-DATA-AREA.                00600001
006010         10  AP015-CHARGE-AMT            PIC 9(09)V99.            00601001
006020         10  AP015-CHARGE-CDE            PIC X(03).               00602001
006030             88  AP015-VALID-CHRG-CDES       VALUE 'DDF', 'DRA',  00603001
006040                                            'MIS', 'DUT', 'DUP',  00604001
006050                                            'ENT', 'OAF', 'OCF',  00605001
006060                                            'ROY', 'LCC', 'CTX',  00606001
006061                                            'BSS',                00606101
006062                                            'REE', '690', '405'.  00606201
006063         10  FILLER                      PIC X(111).              00606301
006064                                                                  00606401
