000100*----------------------------------------------------------------*00010005
000200*  RECORD LAYOUT FOR THE MONTHLY DEPT FREIGHT TOTALS FTP FILE    *00020005
000300*                                                                *00030005
000400*   APKUT096 - CREATED                                           *00040005
000500*                                                                *00050005
000600*   RECORD FORMAT IS SEQUENTIAL                                  *00060005
000700*      LENGTH = 28                                               *00070005
000800*----------------------------------------------------------------*00080005
000900 01  AP072-ADJUST-FILE.                                           00090005
001000     05  AP072-DEPT-NBR               PIC ZZ9.                    00100005
001100     05  AP072-FILLER1                PIC X     VALUE SPACE.      00110005
001200     05  AP072-PSTG-FMN-NBR           PIC 99.                     00120005
001300     05  AP072-FILLER2                PIC X     VALUE SPACE.      00130005
001400     05  AP072-PSTG-FWK-NBR           PIC 99.                     00140005
001500     05  AP072-FILLER3                PIC X     VALUE SPACE.      00150005
001600     05  AP072-FTP-AMT                PIC ZZ,ZZZ,ZZZ,ZZZ.99-.     00160006
