      ******************************************************************        
      * PO EXTRACT FILE LAYOUT FOR SPECIAL INSTRUCTIONS.               *        
      * THIS LAYOUT CONTAINS FIELDS EXTRACTED FROM THE FOLLOWING DB2   *        
      * TABLES:  TPOINST AND TINSTCD                                   *        
      *                                                                *        
      * LRECL = 200                                                    *        
      ******************************************************************        
       01  AP403-SPECIAL-INSTRUCTIONS.                                          
           05  AP403-PO-NBR                  PIC 9(9).                          
           05  AP403-DUN-NBR                 PIC X(9).                          
           05  AP403-VND-NAME                PIC X(30).                         
           05  AP403-RECIP-CDE               PIC X(2).                          
           05  AP403-SPECIAL-INSTR           PIC X(150).                        
