000100***************************************************************** 00010000
000200* RECORD LAYOUT FOR THE EDI 210 SURCHARGE REPORT FILE           * 00020008
000300*                                                               * 00030000
000400* RECORD FORMAT IS SEQUENTIAL.                                  * 00040000
000500*        LENGTH = 270                                           * 00050016
000600***************************************************************** 00060000
000700                                                                  00070000
000800 01  AP079-SURCHG-RPT-RECORD.                                     00080002
002200     05  AP079-CONTNR-PU-DTE             PIC X(10).               00090005
002200     05  AP079-CONTAINER-ID              PIC X(12).               00100005
000900     05  AP079-VENDOR-NBR                PIC X(9).                00110001
000900     05  AP079-VENDOR-NAME               PIC X(20).               00120006
001100     05  AP079-PO-NBR                    PIC 9(09).               00130006
001000     05  AP079-INVOICE-NBR               PIC X(22).               00140001
001000     05  AP079-DECON-SCAC-ID             PIC X(04).               00150013
001000     05  AP079-PEND-RVW                  PIC X(01).               00151017
002200     05  FILLER                          PIC X(23).               00160017
003100     05  AP079-CHARGES            OCCURS 20 TIMES                 00170001
003200                                  INDEXED BY AP079-IDX.           00180014
003300         10  AP079-CHARGE-AMT            PIC S9(07)V99 COMP-3.    00190011
003400         10  AP079-CHARGE-CDE            PIC X(03).               00200001
004200                                                                  00210000
