000010*--------------------------------------------------------------*  00010000
000020*    RECORD LAYOUT FOR THE VENDOR WEEKLY MATCH STATISTICS FILE    00020000
000020*    RECORD LENGTH IS 100                                         00030001
000060*--------------------------------------------------------------*  00060000
000070                                                                  00070000
002100 01  AP444-VENDOR-RECORD.                                         00071000
000080     05  AP444-VENDOR-NBR                PIC  X(9).               00080001
000080     05  AP444-VENDOR-NAME               PIC  X(50).              00090001
000080     05  AP444-PO-NBR                    PIC  9(09).              00091002
000080     05  AP444-PAYT-RLSE-USR-ID          PIC  X(8).               00100001
000080     05  AP444-MTCH-LVL-CDE              PIC  X(1).               00110001
000080     05  AP444-STATUS-CDE                PIC  X(1).               00120001
000080     05  AP444-CRE-PRC-CDE               PIC  X(1).               00130001
000080     05  AP444-TOLR-ADJ-AMT              PIC  S9(9)V9(2) COMP-3.  00140001
000080     05  FILLER                          PIC  X(15).              00150002
