000100******************************************************************00010000
000200* INVOICE EXTRACT FILE LAYOUT FOR YEARLY CONTINGENCY AUDIT.      *00020000
000300* THIS LAYOUT CONTAINS FIELDS EXTRACTED FROM THE FOLLOWING DB2   *00030000
000400* TABLES:  TINVOIC, TPAYREQ, TALCHRG.                            *00040000
000500******************************************************************00050000
000600 01  AP410-INVOICE-EXTRACT-RECORD.                                00060000
000700     05  AP410-INVC-ID                 PIC X(22).                 00070000
000800     05  AP410-PO-NBR                  PIC 9(9).                  00080000
000900     05  AP410-STR-NBR                 PIC 9(4).                  00090000
001000     05  AP410-DEPT                    PIC X(3).                  00100000
001100     05  AP410-DUNS-NO                 PIC X(9).                  00110000
001200     05  AP410-INVC-TYP-CDE            PIC X(2).                  00120000
001300         88  MDSE-INVOICE                  VALUE 'MI'.            00130000
001400         88  REMAINDER-INVOICE             VALUE 'RI'.            00140000
001500     05  AP410-STATUS-CDE              PIC X(2).                  00150000
001600         88  INVOICE-PAID                  VALUE 'PD'.            00160000
001700         88  OPEN-TO-PAY                   VALUE 'OP'.            00170000
001800     05  AP410-INVC-DTE                PIC X(10).                 00180000
001900     05  AP410-ENTR-DTE                PIC X(10).                 00190000
002000     05  AP410-HOLD-IND                PIC X(1).                  00200000
002100     05  AP410-ENTR-MTHD-CDE           PIC X(2).                  00210000
002200         88  SOURCE-EDI                    VALUE 'ED'.            00220000
002300         88  SOURCE-MANUAL                 VALUE 'MN'.            00230000
002400     05  AP410-PAYT-RLSE-TMST          PIC X(26).                 00240000
002500     05  AP410-PAYT-DTE                PIC X(10).                 00250000
002600     05  AP410-GRO-COST-AMT            PIC S9(8)V9(2) COMP-3.     00260000
002700     05  AP410-BAR-CDE                 PIC X(9).                  00270000
002800     05  AP410-SPLIT-TERMS-IND         PIC X(1).                  00280000
002900     05  AP410-REMIT-TO-DUN-NBR        PIC X(9).                  00290000
003000     05  AP410-BOL-ID                  PIC X(16).                 00300000
003100     05  AP410-VEND-FRGT-PCT           PIC S9(1)V9(4) COMP-3.     00310000
003200     05  AP410-KOHLS-FRGT-PCT          PIC S9(1)V9(4) COMP-3.     00320000
003300     05  AP410-TERM-TYP-CDE            PIC X(2).                  00330000
003400     05  AP410-DISC-PCT                PIC SV9(4) COMP-3.         00340000
003500     05  AP410-DISC-DUE-DAY-QTY        PIC S9(5) COMP-3.          00350000
003600     05  AP410-NET-DUE-DAY-QTY         PIC S9(5) COMP-3.          00360000
003700     05  AP410-EXTD-DAYS-QTY           PIC S9(5) COMP-3.          00370000
003800     05  AP410-ALW-CHRG-TABLE OCCURS 12 TIMES                     00380001
003900                                INDEXED BY ALW-INDX.              00390000
004000         10  AP410-ALW-CHRG-SEQ-NBR    PIC S9(4) COMP.            00400000
004100         10  AP410-ALW-CHRG-TYP-CDE    PIC X(1).                  00410000
004200         10  AP410-ALW-CHRG-CDE        PIC X(3).                  00420000
004300         10  AP410-ALW-CHRG-SER-CDE    PIC X(10).                 00430000
004400         10  AP410-ALW-CHRG-PCT        PIC SV9(4) COMP-3.         00440000
004500         10  AP410-ALW-CHRG-AMT        PIC S9(8)V9(2) COMP-3.     00450000
004600     05  AP410-PAYT-REQ-SEQ-NBR        PIC S9(09).                00460000
004700     05  AP410-AP-PRC-CDE              PIC X(1).                  00470000
004800     05  AP410-AP-PRC-DTE              PIC X(10).                 00480000
004810     05  AP410-DC-NBR                  PIC 9(5).                  00481002
004820     05  AP410-MTCH-LVL-CDE            PIC X.                     00482003
004900     05  FILLER                        PIC X(25).                 00490002
