000100*----------------------------------------------------------------*00010004
000200*   RECORD LAYOUT FOR THE BATCH MATCH INVOICE EXCEPTION FILE     *00020001
000300*   RECORD LENGTH = 100                                          *00030006
000400*----------------------------------------------------------------*00040004
000420*  CHANGE LOG:                                                  **00042014
000430*                                                               **00043014
000440*  DATE 01/02/2007                                              **00044014
000450*     CHANGE MADE: MATCH BY DC -- ADDED THE FIELDS              **00045016
000460*     AP059-DC-NBR AND AP059-MTCH-LVL-CDE; ADJUSTED THE FILLER  **00046016
000461*     VALUE ACCORDINGLY.                                        **00046116
000470*  MADE BY: ROLF NOHE                    WR/IR #: WR21578       **00047014
000471*                                                               **00047117
000472*  DATE 03/12/2007                                              **00047217
000473*     CHANGE MADE: MATCH BY DC -- ADDED THE ERROR CODE          **00047317
000474*     AP059-MTCH-LVL-ERROR TO THE AP059-REASON-CODE SECTION.    **00047417
000476*  MADE BY: KRYSTEN LEARY                WR/IR #: WR21578       **00047617
000477*----------------------------------------------------------------*00047714
000500 01  AP059-ERROR-RECORD.                                          00050004
000600     05  AP059-VENDOR-DATA.                                       00060004
000700         10  AP059-VENDOR-NUMBER PIC  X(09)    VALUE SPACES.      00070004
000800         10  AP059-VENDOR-NAME   PIC  X(30)    VALUE SPACES.      00080004
000900     05  AP059-PO-NBR            PIC  9(09)    VALUE ZEROS.       00090004
001000     05  AP059-STR-NBR           PIC  9(04)    VALUE ZEROS.       00100004
001100     05  AP059-INVOICE-ID        PIC  X(22)    VALUE SPACES.      00110004
001200     05  AP059-ENTER-USERID      PIC  X(08)    VALUE SPACES.      00120004
001300     05  AP059-REASON-CODE       PIC  9(03)    VALUE ZEROS.       00130004
001400         88  AP059-INVOICED-BY-ERROR           VALUE 1.           00140004
001500         88  AP059-INVOICE-OB-STATUS           VALUE 2.           00150004
001600         88  AP059-INVOICE-IB-STATUS           VALUE 3.           00160008
001700         88  AP059-NO-INV-TERMS                VALUE 4.           00170004
001800         88  AP059-NO-PO-TERMS                 VALUE 5.           00180004
001900         88  AP059-INVOICE-TBL-OVER-LIMIT      VALUE 6.           00190004
001910         88  AP059-INVOICE-WITH-ZERO-COST      VALUE 7.           00191007
001920         88  AP059-IMPORT-NOT-VALID            VALUE 8.           00192011
001921         88  AP059-MTCH-LVL-INVALID            VALUE 9.           00192118
001930     05  AP059-DC-NBR            PIC  9(05)    VALUE ZEROS.       00193013
001940     05  AP059-MTCH-LVL-CDE      PIC  X(01)    VALUE ZEROS.       00194015
002000     05  FILLER                  PIC  X(09)    VALUE SPACES.      00200015
