000010***************************************************************** 00001001
000020* APRD412 STORE DETAIL RECORDS.                                 * 00002007
000021*  09/11/2008  MICHELE RINDFLEISCH     WR/IR #: INC000000501631 * 00002105
000030***************************************************************** 00003001
000100 01  APRD412-STORE-DETAIL-LINE.                                   00010007
000200     05  AP412-DEPT                  PIC  9(03).                  00020007
000300     05  AP412-VENDOR-NAME-DUNNS     PIC  X(25).                  00030007
000400     05  AP412-VENDOR-NO-DUNNS       PIC  X(09).                  00040007
000500     05  AP412-COST-EXTENSION        PIC  S9(07)V99.              00050007
000600     05  AP412-RETAIL-EXTENSION      PIC  S9(07)V99.              00060007
000700     05  AP412-PO-TYP-CDE            PIC  X(02).                  00070007
000800     05  AP412-1ST-COST-EXTENSION    PIC  S9(07)V99.              00080007
000900     05  FILLER                      PIC  X(14).                  00090000
