000100******************************************************************00010000
000200**  MONTHLY UNJOURNALIZED RECEIPT RECORD LAYOUT                 **00020003
000300**                                                              **00030000
000400**  APKUT113 - CREATED                                          **00040000
000500**  APKRP114 - USED                                             **00050000
000600**                                                              **00060000
000700**  RECORD FORMAT:  SEQUENTIAL                                  **00070000
000800******************************************************************00080000
000900 01  AP113-RECORD.                                                00090000
001000     05  AP113-UNJ-DATE.                                          00100003
001100         10  AP113-CCYY.                                          00110003
001200             15  AP113-CC                  PIC 9(02).             00120003
001300             15  AP113-YY                  PIC 9(02).             00130003
001400         10  AP113-MM                      PIC 9(02).             00140003
001500     05  AP113-DEPT                        PIC X(03).             00150003
001600     05  AP113-VENDOR-NAME                 PIC X(30).             00160000
001700     05  AP113-VENDOR-NUMBER               PIC X(09).             00170000
001800     05  AP113-PO-NBR                      PIC 9(09).             00180003
001900     05  AP113-VER-EXCEPTION-AMT           PIC S9(09)V99 COMP-3.  00190000
002000     05  AP113-PO-COST                     PIC S9(09)V99 COMP-3.  00200003
002100     05  AP113-VERIFIED-COST               PIC S9(09)V99 COMP-3.  00210003
002200     05  AP113-UNJRNLZD-NIR                PIC S9(09)V99 COMP-3.  00220003
002300     05  AP113-UNJRNLZD-RECEIVER           PIC S9(09)V99 COMP-3.  00230003
002400     05  AP113-OTB-PER-NBR                 PIC X(06).             00240003
002500     05  FILLER                            PIC X(06).             00250003
