000100******************************************************************00010010
000200* PO EXTRACT FILE LAYOUT FOR YEARLY CONTINGENCY AUDIT.           *00020010
000300* THIS LAYOUT CONTAINS FIELDS EXTRACTED FROM THE FOLLOWING DB2   *00030010
000400* TABLES:  TPURCHS, TPLNSHP, TPOAGMT, TPAYTRM, TPURITM, TRECDIS, *00040010
000500*          TRECITM, TEXTENT                                      *00050010
000600******************************************************************00060010
000700 01  AP400-PO-EXTRACT-RECORD.                                     00070010
000800     05  AP400-PO-NBR                  PIC 9(9).                  00080010
000900     05  AP400-DEPT-NBR                PIC X(3).                  00090010
001000     05  AP400-DUN-NBR                 PIC X(9).                  00100010
001100     05  AP400-VER-NBR                 PIC 9(9).                  00110010
001200     05  AP400-STATUS-CDE              PIC X(2).                  00120010
001300     05  AP400-PO-TYP-CDE              PIC X(2).                  00130010
001400     05  AP400-EDI-IND                 PIC X(1).                  00140010
001500     05  AP400-TOT-VAL-COST-AMT        PIC S9(8)V9(2).            00150010
001600     05  AP400-TOT-VAL-RTL-AMT         PIC S9(8)V9(2).            00160010
001700     05  AP400-TOT-MU-PCT              PIC S9(3)V9(2).            00170010
001800     05  AP400-TOT-UNT-QTY             PIC 9(9).                  00180010
001900     05  AP400-TOT-SKUS-QTY            PIC 9(4).                  00190010
002000     05  AP400-OTB-PER-NBR             PIC X(6).                  00200010
002100     05  AP400-NEW-STR-PO-IND          PIC X(1).                  00210010
002200     05  AP400-DIR-STR-IND             PIC X(1).                  00220010
002300     05  AP400-LAST-UPD-DTE            PIC X(10).                 00230010
002400     05  AP400-ORD-DTE                 PIC X(10).                 00240010
002500     05  AP400-RLSE-DTE                PIC X(10).                 00250010
002600     05  AP400-DONT-SHIP-BEF-DTE       PIC X(10).                 00260010
002700     05  AP400-CAN-IFNOT-SHIP-DTE      PIC X(10).                 00270010
002800     05  AP400-EXT-CAN-DTE             PIC X(10).                 00280010
002900     05  AP400-SHIPT-POINT-TXT         PIC X(20).                 00290010
003000     05  AP400-FOB-POINT-TXT           PIC X(20).                 00300010
003100     05  AP400-LATE-SHIPT-IND          PIC  X(1).                 00310010
003200     05  AP400-EARLY-SHIPT-IND         PIC  X(1).                 00320010
003300     05  AP400-PARTIAL-SHIPT-IND       PIC  X(1).                 00330010
003400     05  AP400-BCKORDS-PERMTD-IND      PIC  X(1).                 00340010
003500     05  AP400-FRGT-PAYT-CDE           PIC  X(1).                 00350010
003600     05  AP400-VEND-FRGT-PCT           PIC SV9(4).                00360010
003700     05  AP400-KOHLS-FRGT-PCT          PIC SV9(4).                00370010
003800     05  AP400-EDI-PROMO-TXT           PIC X(30).                 00380010
003900     05  AP400-DISC-DOL-AMT            PIC S9(6)V9(2).            00390010
004000     05  AP400-DISC-PCT                PIC SV9(4).                00400010
004100     05  AP400-DISC-PAY-DAY-QTY        PIC S9(4).                 00410010
004200     05  AP400-DISCOUNT-DAYS-QTY       PIC S9(4).                 00420010
004300     05  AP400-DISCOUNT-PCT            PIC SV9(4).                00430010
004400     05  AP400-DUE-DAY-QTY             PIC S9(4).                 00440010
004500     05  AP400-OTHER-TXT               PIC X(25).                 00450010
004600     05  AP400-DUE-DAY-FR-DTE-TXT      PIC X(17).                 00460010
004700     05  AP400-PACK-BY-STORE-IND       PIC X(1).                  00470010
004800     05  AP400-PRETICKET-IND           PIC X(1).                  00480010
004900     05  AP400-SPECIAL-INSTR OCCURS 3 TIMES                       00490010
005000                                INDEXED BY INSTRUC-INDX.          00500010
005100         10  AP400-INSTR-DESC          PIC X(150).                00510010
005200     05  AP400-AD-EVNT-DTE             PIC X(10).                 00520010
005300     05  AP400-MOS-DISC-PCT            PIC SV9(4).                00530010
005400     05  AP400-TRD-DISC-PCT            PIC SV9(4).                00540010
005500     05  AP400-ADV-DISC-PCT            PIC SV9(4).                00550010
005600     05  AP400-NW-STR-DISC-PCT         PIC SV9(4).                00560010
005700     05  AP400-COOP-OFF-INVC-PCT       PIC SV9(4).                00570012
005800     05  AP400-PRFT-ASST-ADCOOP-PCT    PIC SV9(4).                00580012
005900     05  AP400-BRIDAL-OFF-INVC-PCT     PIC SV9(4).                00590012
006100     05  AP400-FILLER                  PIC X(16).                 00600016
