000100*----------------------------------------------------------------*00010000
000200* RECORD LAYOUT FOR THE DUTY FEE REJECTION/REPORT FILE           *00020000
000300*                                                                *00030000
000400* RECORD FORMAT IS SEQUENTIAL.                                   *00040000
000500*        LENGTH = 118                                            *00050010
000600*----------------------------------------------------------------*00060000
000700                                                                  00070000
000800 01  AP158-REJECT-DUTY-INVOICE.                                   00080009
001000     05  AP158-PO-NBR                PIC 9(09).                   00100008
001100     05  AP158-INVOICE-NBR           PIC X(22).                   00110008
001110     05  AP158-BROKER-REF-NBR        PIC X(15).                   00111008
001200     05  AP158-VENDOR-NBR            PIC X(09).                   00120008
001300     05  AP158-ENTRY-NBR             PIC X(16).                   00130008
001900     05  AP158-INVC-DTE.                                          00190008
002000         10  AP158-INVC-DTE-CC       PIC 9(02).                   00200008
002100         10  AP158-INVC-DTE-YY       PIC 9(02).                   00210008
002200         10  AP158-INVC-DTE-MM       PIC 9(02).                   00220008
002300         10  AP158-INVC-DTE-DD       PIC 9(02).                   00230008
002400     05  AP158-TOTAL-DUTY-AMT        PIC S9(9)V99 COMP-3.         00240008
002500     05  AP158-CHARGE-CDE            PIC X(03).                   00250008
002600                                                                  00260006
002700     05  AP158-ERROR-CODE-AREA.                                   00270006
002800         10  AP158-ERR-TABLE  OCCURS 15 TIMES                     00280007
002900                              INDEXED BY AP158-IDX.               00290008
003000             15  AP158-ERR-CDE       PIC 9(02).                   00300008
003100                                                                  00310006
