000100*----------------------------------------------------------------*        
000200*  RECORD LAYOUT FOR THE DAILY KEYED DOCUMENT EXTRACT FILE       *        
000300*                                                                *        
000400*   APKUT144, APKUT145, APKUT500, APKUT178 - CREATED             *        
000500*   APKRP146, APKUP510 - USED                                    *        
000600*                                                                *        
000700*   RECORD FORMAT IS SEQUENTIAL                                  *        
000800*      LENGTH = 250                                              *        
000900*----------------------------------------------------------------*        
001000 01  AP070-EXTRACT-FILE.                                                  
001100     05  AP070-ENTR-ID                   PIC X(8).                        
001200     05  AP070-ORIGIN.                                                    
001300         10  AP070-ORGN-CDE              PIC X(1).                        
001400         10  AP070-AP-TRN-CDE            PIC X(2).                        
001500     05  AP070-ENTR-TMST                 PIC X(26).                       
001600     05  FILLER REDEFINES AP070-ENTR-TMST.                                
001700         10  AP070-ENTR-DTE.                                              
001710             15  AP070-ENTR-CC           PIC X(2).                        
001800             15  AP070-ENTR-YY           PIC X(2).                        
001900             15  FILLER                  PIC X(1).                        
002000             15  AP070-ENTR-MM           PIC X(2).                        
002100             15  FILLER                  PIC X(1).                        
002200             15  AP070-ENTR-DD           PIC X(2).                        
002300         10  FILLER                      PIC X(1).                        
002400         10  AP070-ENTR-TIME             PIC X(15).                       
002500     05  AP070-PO-NBR                    PIC X(9).                        
002600     05  AP070-DOC-NBR                   PIC X(16).                       
002700     05  AP070-DOC-DTE                   PIC X(10).                       
002800     05  FILLER REDEFINES AP070-DOC-DTE.                                  
002900         10  AP070-DOC-CC                PIC X(2).                        
003000         10  AP070-DOC-YY                PIC X(2).                        
003100         10  FILLER                      PIC X(1).                        
003200         10  AP070-DOC-MM                PIC X(2).                        
003300         10  FILLER                      PIC X(1).                        
003400         10  AP070-DOC-DD                PIC X(2).                        
003500     05  AP070-DEPT-NBR                  PIC X(3).                        
003600     05  AP070-GL-ACCT-NBR               PIC X(6).                        
003700     05  AP070-VND-NBR                   PIC X(9).                        
003800     05  AP070-ENT-NME-DESC              PIC X(30).                       
003900     05  AP070-PSTG-TYP-CDE              PIC X(2).                        
004000     05  AP070-GRO-COST-AMT              PIC S9(11)V99 COMP-3.            
004100     05  AP070-FRGT-AMT                  PIC S9(11)V99 COMP-3.            
004200     05  AP070-MISC-CHRG-AMT             PIC S9(11)V99 COMP-3.            
004300     05  AP070-NET-COST-AMT              PIC S9(11)V99 COMP-3.            
004400     05  AP070-TOTAL-DISC-AMT            PIC S9(11)V99 COMP-3.            
004600     05  FILLER                          PIC X(14).                       
004700     05  AP070-RETL-AMT                  PIC S9(11)V99 COMP-3.            
004800     05  AP070-BRCDE-NBR                 PIC X(9).                        
004900     05  AP070-VOUCHER-NBR               PIC X(8).                        
005000     05  AP070-BUSINESS-UNIT             PIC X(5).                        
005100     05  AP070-PAYT-REQ-SEQ-NBR          PIC S9(9) COMP.                  
005200     05  AP070-SRC-CDE                   PIC X(3).                        
005300         88 SRC-KEYED                        VALUE 'INV', 'ADJ',          
005301                                                   'PSV', 'CEX'.          
005302         88 SRC-SCANNED                      VALUE 'SCN', 'MAN'.          
005310         88 INVOICE-DB                       VALUE 'INV'.                 
005400         88 ADJRNL-DB                        VALUE 'ADJ'.                 
005500         88 PS-VOUCHER-DB                    VALUE 'PSV'.                 
005600         88 CAP-EXP-TRANS                    VALUE 'CEX'.                 
005611         88 SCANNED-DOC                      VALUE 'SCN'.                 
005620         88 MAN-KEY-DOC                      VALUE 'MAN'.                 
005700     05  AP070-IMAGING-KEYS-IND          PIC X(1).                        
005800         88 USE-TO-BUILD-KEYS                VALUE 'Y'.                   
005900         88 BYPASS-FOR-BUILD-KEYS            VALUE 'N'.                   
006000     05  AP070-PS-PO-ID                  PIC X(10).                       
006000     05  FILLER                          PIC X(32).                       
