000100******************************************************************00010000
000200**  PO/STORE RECEIVING SUMMARY RECORD LAYOUT                    **00020001
000300**  FILE.                                                       **00030000
000400**                                                              **00040000
000500**  APKUT105 - CREATED                                          **00050000
000600**  APKUP254 - USED                                             **00060000
000700**                                                              **00070000
000800**  RECORD FORMAT:  SEQUENTIAL                                  **00080000
000900**                  LRECL = 20                                  **00090000
001000**                                                              **00100000
001100******************************************************************00110000
001200 01  AP101-RECORD.                                                00120000
001300     05  AP101-KEY.                                               00130000
001400         10  AP101-PO-NBR                  PIC 9(09).             00140001
001500         10  AP101-STORE-NUMBER            PIC 9(04).             00150000
001600     05  AP101-RECEIPTS-SUM-DATA.                                 00160000
001700         10  AP101-TOTAL-REC-COST          PIC S9(09)V99  COMP-3. 00170000
001800         10  FILLER                        PIC X(01).             00180001
