000100******************************************************************00020001
000200**  THIS IS THE RECORD LAYOUT FOR INVOICE ACTUAL AND ESTIMATED  **00030001
000300**  LANDED COST COMPONENT FILE FOR IMPORT PURCHASE ORDERS.      **00040001
000400**                                                              **00050001
000500**  APKUT058 - CREATED                                          **00060001
000600**  APKUT049 - USED                                             **00070001
000700**                                                              **00080001
000800**  RECORD FORMAT:  SEQUENTIAL                                  **00090001
000900**                  LRECL = 120                                 **00100001
001000**                                                              **00110001
001100******************************************************************00120001
001200 01  AP063-RECORD.                                                00130001
001300     05  AP063-VENDOR-NAME               PIC X(30).               00140001
001400     05  AP063-VENDOR-NBR                PIC X(09).               00150001
001500     05  AP063-PO-NBR                    PIC 9(09).               00160001
001600     05  AP063-INVC-ID                   PIC X(22).               00170001
001700     05  AP063-ALW-CHRG-CDE              PIC X(03).               00180001
001800     05  AP063-INV-CHRG-AMT              PIC S9(11)V99 COMP-3.    00190001
001900     05  AP063-INVC-DTE                  PIC X(10).               00200001
002000     05  FILLER REDEFINES AP063-INVC-DTE.                         00210001
002100         10  AP063-INVC-CC               PIC X(2).                00220001
002200         10  AP063-INVC-YY               PIC X(2).                00230001
002300         10  FILLER                      PIC X(1).                00240001
002400         10  AP063-INVC-MM               PIC X(2).                00250001
002500         10  FILLER                      PIC X(1).                00260001
002600         10  AP063-INVC-DD               PIC X(2).                00270001
002700     05  AP063-INCL-IN-ALC-IND           PIC X(01).               00280001
002800     05  FILLER                          PIC X(03).               00290001
002900     05  AP063-GL-ACCT-NBR               PIC X(07).               00300001
003000     05  AP063-ENTR-DTE                  PIC X(10).               00310001
003100     05  FILLER REDEFINES AP063-ENTR-DTE.                         00320001
003200         10  AP063-ENTR-CC               PIC X(2).                00330001
003300         10  AP063-ENTR-YY               PIC X(2).                00340001
003400         10  FILLER                      PIC X(1).                00350001
003500         10  AP063-ENTR-MM               PIC X(2).                00360001
003600         10  FILLER                      PIC X(1).                00370001
003700         10  AP063-ENTR-DD               PIC X(2).                00380001
003800     05  FILLER                          PIC X(09).               00390001
