000001 01  MEMO-RECORD.                                                 00000100
000010     05 MEMO-VENDOR-ID         PIC X(10).                         00001000
000100     05 MEMO-INVOICE-ID        PIC X(16).                         00010000
