000100*----------------------------------------------------------------*00010000
000200*   RECORD LAYOUT FOR THE ACCOUNTS PAYABLE TRANSACTION FILE      *00020000
000300*                                                                *00030000
000400*   APKUT047, APKUP135, APKCS353 - CREATED                       *00040000
000500*   APKUT145, APKUT154 - USED                                    *00050000
000600*                                                                *00060000
000700*   RECORD FORMAT IS SEQUENTIAL                                  *00070000
000800*          LENGTH = 500                                          *00080000
000900*----------------------------------------------------------------*00090000
001000* CHANGES:                                                       *00100000
001100*    9/21/2006                                                   *00110000
001200*       ADDED FIELD AP040-SEPARATE-CHCK TO THE LAYOUT.           *00120000
001300*    MADE BY: KRYSTEN LEARY                     WR#: 31177       *00130000
001400*                                                                *00140000
001500*    3/22/2007                                                   *00150000
001600*       ADDED FIELDS AP040-WTHD-SETID, AP040-WTHD-SW, AND        *00160000
001700*       AP040-WTHD-CD TO THE LAYOUT AND ADJUSTED THE FILLER      *00170000
001800*       VALUE ACCORDINGLY.                                       *00180000
001900*    MADE BY: KRYSTEN LEARY                     WR#: 32060       *00190000
002000*    11/07/2011                                                  *00200000
002100*       ADDED THE NEW FIELD AP040-ACT-CDE AND ADJUSTED THE FILLER*00210000
002200*       TO KEEP THE FILE LENGTH UNCHANGED.                       *00220000
002300*    MADE BY: ANOOP BABU                        WR#: WR37038     *00230000
002310*    03/28/2019                                                  *00231000
002320*       ADDED NEW FIELDS AP040-COOP-DISC-AMT, AP040-ALW-DISC-AMT,*00232000
002330*       AP040-MSC-DISC-AMT FOR ORACLE ERP/KFS PROJECT.           *00233000
002340*    MADE BY: NANCY EILBES                      WR#: CHG0220043  *00234000
002341*    04/03/2020                                                  *00234102
002342*       ADDED REDEFINES OF BAR-CODE FIELD TO REUSE THAT SPACE    *00234202
002343*       FOR THE PO TYPE CODE.                                    *00234302
002344*    MADE BY: NANCY EILBES                      WR#: CHG0242385  *00234403
002350*----------------------------------------------------------------*00235000
002360 01  AP040-TRANSACTION-FILE.                                      00236000
002370     05  AP040-VND-NBR                   PIC X(9).                00237000
002380     05  AP040-DOC-NBR                   PIC X(16).               00238000
002390     05  AP040-DOC-DTE                   PIC X(10).               00239000
002400     05  FILLER REDEFINES AP040-DOC-DTE.                          00240000
002500         10  AP040-DOC-CC                PIC X(2).                00250000
002600         10  AP040-DOC-YY                PIC X(2).                00260000
002700         10  FILLER                      PIC X(1).                00270000
002800         10  AP040-DOC-MM                PIC X(2).                00280000
002900         10  FILLER                      PIC X(1).                00290000
003000         10  AP040-DOC-DD                PIC X(2).                00300000
003100     05  AP040-AP-TRN-CDE                PIC X(2).                00310000
003200     05  FILLER                          PIC X(1).                00320000
003300     05  AP040-PO-NBR                    PIC X(9).                00330000
003400     05  AP040-DEPT-NBR                  PIC X(3).                00340000
003500     05  AP040-GL-ACCT-NBR               PIC X(6).                00350000
003600     05  AP040-PSTG-TYP-CDE              PIC X(2).                00360000
003700         88  AP040-CREDIT                    VALUE 'CR'.          00370000
003800         88  AP040-CHARGE                    VALUE 'CH'.          00380000
003900     05  AP040-TRN-TYP-CDE               PIC X(3).                00390000
004000         88  AP040-MERCHANDISE               VALUE 'MDS'.         00400000
004100         88  AP040-EXPENSE                   VALUE 'EXP'.         00410000
004200     05  AP040-ENTR-TMST.                                         00420000
004300         10  AP040-ENTR-DTE                  PIC X(10).           00430000
004400         10  AP040-ENTR-TME                  PIC X(16).           00440000
004500     05  AP040-ENTR-ID                   PIC X(8).                00450000
004600     05  AP040-ORGN-CDE                  PIC X(1).                00460000
004700         88  AP040-ORGN-MDSE                 VALUE 'M'.           00470000
004800         88  AP040-ORGN-CAPEX                VALUE 'C'.           00480000
004900         88  AP040-ORGN-IMPORT               VALUE 'I'.           00490000
005000         88  AP040-ORGN-ADJUST               VALUE 'A'.           00500000
005100         88  AP040-ORGN-FREIGHT              VALUE 'F'.           00510000
005200         88  AP040-ORGN-PREPAID              VALUE 'P'.           00520000
005300         88  AP040-ORGN-EXPENSE              VALUE 'E'.           00530000
005400         88  AP040-ORGN-PAYROLL              VALUE 'H'.           00540000
005500         88  AP040-ORGN-TELECOMM             VALUE 'T'.           00550000
005600         88  AP040-ORGN-RENT                 VALUE 'R'.           00560000
005700         88  AP040-ORGN-USBNK-TRVL           VALUE 'U'.           00570000
005800     05  AP040-INV-CUTOFF-DTE            PIC X(10).               00580000
005900     05  FILLER REDEFINES AP040-INV-CUTOFF-DTE.                   00590000
006000         10  AP040-INV-CUTOFF-CC         PIC X(2).                00600000
006100         10  AP040-INV-CUTOFF-YY         PIC X(2).                00610000
006200         10  FILLER                      PIC X(1).                00620000
006300         10  AP040-INV-CUTOFF-MM         PIC X(2).                00630000
006400         10  FILLER                      PIC X(1).                00640000
006500         10  AP040-INV-CUTOFF-DD         PIC X(2).                00650000
006600     05  AP040-BAR-CDE                   PIC X(9).                00660000
006610     05  FILLER REDEFINES AP040-BAR-CDE.                          00661001
006620         10  AP040-PO-TYP-CDE            PIC X(2).                00662000
006630         10  FILLER                      PIC X(7).                00663000
006700     05  AP040-PS-BTCH-NBR.                                       00670000
006800         10  AP040-PS-BTCH-DTE           PIC X(10).               00680000
006900         10  AP040-PS-BTCH-SRC-CDE       PIC X(3).                00690000
007000         10  AP040-PS-BTCH-SEQ-NBR       PIC X(2).                00700000
007100     05  AP040-ENT-ID                    PIC 9(9).                00710000
007200     05  AP040-ENT-NME-DESC              PIC X(30).               00720000
007300     05  AP040-RSN-TXT.                                           00730000
007400         10  AP040-RSN-1ST-LNE-TXT       PIC X(50).               00740000
007500         10  AP040-RSN-2ND-LNE-TXT       PIC X(50).               00750000
007600     05  AP040-TERM-DISC-PCT             PIC S9V9999  COMP-3.     00760000
007700     05  AP040-NW-STR-DISC-PCT           PIC S9V9999  COMP-3.     00770000
007800     05  AP040-TRD-DISC-PCT              PIC S9V9999  COMP-3.     00780000
007900     05  AP040-PSTG-FYR-NBR              PIC X(4).                00790000
008000     05  AP040-PSTG-FMN-NBR              PIC X(2).                00800000
008100     05  AP040-PSTG-FWK-NBR              PIC X(2).                00810000
008200     05  AP040-MOS-DISC-PCT              PIC S9V9999  COMP-3.     00820000
008300     05  AP040-ADV-DISC-PCT              PIC S9V9999  COMP-3.     00830000
008400     05  FILLER                          PIC X(03).               00840000
008500     05  AP040-STR-NBR                   PIC 9(5).                00850000
008600     05  AP040-GRO-COST-AMT              PIC S9(9)V99 COMP-3.     00860000
008700     05  AP040-RETL-AMT                  PIC S9(9)V99 COMP-3.     00870000
008800     05  AP040-FRGT-AMT                  PIC S9(9)V99 COMP-3.     00880000
008900     05  AP040-MISC-CHRG-AMT             PIC S9(9)V99 COMP-3.     00890000
009000     05  AP040-NET-COST-AMT              PIC S9(9)V99 COMP-3.     00900000
009100     05  AP040-TERM-DISC-AMT             PIC S9(9)V99 COMP-3.     00910000
009200     05  AP040-NW-STR-DISC-AMT           PIC S9(9)V99 COMP-3.     00920000
009300     05  AP040-TRD-DISC-AMT              PIC S9(9)V99 COMP-3.     00930000
009400     05  AP040-MOS-DISC-AMT              PIC S9(9)V99 COMP-3.     00940000
009500     05  AP040-ADV-DISC-AMT              PIC S9(9)V99 COMP-3.     00950000
009600     05  FILLER                          PIC X(07).               00960000
009700     05  AP040-PYMT-DUE-DTE              PIC X(10).               00970000
009800     05  FILLER REDEFINES AP040-PYMT-DUE-DTE.                     00980000
009900         10  AP040-PYMT-DUE-CC           PIC X(2).                00990000
010000         10  AP040-PYMT-DUE-YY           PIC X(2).                01000000
010100         10  FILLER                      PIC X(1).                01010000
010200         10  AP040-PYMT-DUE-MM           PIC X(2).                01020000
010300         10  FILLER                      PIC X(1).                01030000
010400         10  AP040-PYMT-DUE-DD           PIC X(2).                01040000
010500     05  AP040-ADJRNL-PS-PSTG-IND        PIC X(1).                01050000
010600     05  AP040-AUTH-NBR                  PIC X(10).               01060000
010700     05  AP040-AUTO-OTP-PSTG-IND         PIC X(01).               01070000
010800     05  AP040-AP-PSTG-IND               PIC X(1).                01080000
010900         88  AP040-POST-TO-PS-AP             VALUE 'Y'.           01090000
011000         88  AP040-DO-NOT-POST-TO-PS-AP      VALUE 'N'.           01100000
011100     05  AP040-SALES-TAX-AMT             PIC S9(9)V99 COMP-3.     01110000
011200     05  AP040-DOC-HLD-CDE               PIC X(1).                01120000
011300         88  AP040-VND-HLD                   VALUE 'V'.           01130000
011400         88  AP040-DOC-HLD                   VALUE 'D'.           01140000
011500         88  AP040-NOT-ON-HLD                VALUE 'N'.           01150000
011600     05  AP040-DEPTID                    PIC X(10).               01160000
011700     05  AP040-PRD-CDE                   PIC X(06).               01170000
011800     05  AP040-PROJ-ID                   PIC X(15).               01180000
011900     05  AP040-SEPARATE-CHCK             PIC X(01).               01190000
012000     05  AP040-WTHD-SETID                PIC X(05).               01200000
012100     05  AP040-WTHD-SW                   PIC X(01).               01210000
012200     05  AP040-WTHD-CD                   PIC X(05).               01220000
012300     05  AP040-ACT-CDE                   PIC X(06).               01230000
012400     05  AP040-COOP-DISC-PCT             PIC S9V9999  COMP-3.     01240000
012500     05  AP040-ALW-DISC-PCT              PIC S9V9999  COMP-3.     01250000
012600     05  AP040-MSC-DISC-PCT              PIC S9V9999  COMP-3.     01260000
012700     05  AP040-COOP-DISC-AMT             PIC S9(9)V99 COMP-3.     01270000
012800     05  AP040-ALW-DISC-AMT              PIC S9(9)V99 COMP-3.     01280000
012900     05  AP040-MSC-DISC-AMT              PIC S9(9)V99 COMP-3.     01290000
013000     05  FILLER                          PIC X(27).               01300000
