000100*----------------------------------------------------------------*00010002
000200* IMPORT OCEAN/AIR FREIGHT INVOICE EXCEPTIONS RECORD LAYOUT.     *00020003
000211*                                                                *00021102
000212* RECORD FORMAT IS FIXED WIDTH.                                  *00021202
000213*        LENGTH = 105                                            *00021302
000214*----------------------------------------------------------------*00021402
000215 01  AP129-FRGT-INV-REJECT-RECORD.                                00021502
000240     05  AP129-VND-NBR                 PIC X(9).                  00024002
000250     05  AP129-PO-NBR                  PIC 9(9).                  00025002
000260     05  AP129-INVC-ID                 PIC X(22).                 00026002
000270     05  AP129-INVC-DTE                PIC X(10).                 00027002
000280     05  AP129-NET-COST-AMT            PIC ---------.99.          00028002
000290     05  AP129-IMPRT-BOL-ID            PIC X(30).                 00029002
000300     05  AP129-CONTAINER-NBR           PIC X(12).                 00030002
000400     05  AP129-TALCHRG-FIELDS          OCCURS 20 TIMES            00040002
000410                                       INDEXED BY CHRG-IDX.       00041002
000800         10  AP129-CHRG-CDE            PIC X(3).                  00080002
001100         10  AP129-CHRG-AMT            PIC ---------.99.          00110002
001300     05  AP129-CONTROL-FIELDS.                                    00130002
001400         10  AP129-CNTL-RECD-COUNT     PIC 9(9).                  00140002
001500         10  AP129-CNTL-NET-COST-AMT   PIC ------------.99.       00150002
001510         10  AP129-CALC-RECD-COUNT     PIC 9(9).                  00151002
001520         10  AP129-CALC-NET-COST-AMT   PIC ------------.99.       00152002
001700     05  AP129-ERROR-CODE-AREA.                                   00170002
001800         10  AP129-ERR-TABLE      OCCURS 20 TIMES                 00180002
001900                                  INDEXED BY AP129-IDX.           00190002
002000             15  AP129-ERR-CDE           PIC 9(02).               00200002
