000100******************************************************************00010002
000200**  THIS IS THE RECORD LAYOUT FOR BATCH MATCH TOTAL BY RECEIVER **00020002
000300**  FILE.                                                       **00030002
000400**                                                              **00040002
000500**   CREATED: APKUT021                                          **00050006
000600**   USED: APKUT022, APKUT023, APKUT040, APKUT042               **00060006
000700**         APKUT265, APKUP039, APKUP250                         **00070006
000800**                                                              **00080002
000900**  RECORD FORMAT:  SEQUENTIAL                                  **00090002
001000**                  LRECL = 90                                  **00100002
001100**                                                              **00110002
001200**DATE  10/20/2006                                              **00120004
001300**    CHANGE MADE: MATCH BY DC PROJECT - ADDED AP021-DC-NBR     **00130004
001400**    TO END OF COPYBOOK.  REMOVED THE LAST 1 BYTE OF FILLER    **00140006
001500**    AT THE END OF THE COPYBOOK BECAUSE THIS WAS ACTUALLY      **00150006
001600**    MAKING THE LENGTH 91, NOT 90.  REVIEWED ALL OF THE JCL    **00160006
001700**    AND PROGRAMS THAT SUPPORT DATASETS USING THIS COPYBOOK.   **00170006
001800**    ALL INSTANCES USE 90 AS A LENGTH.  ONLY ONE PROGRAM USING **00180006
001900**    THIS COPYBOOK HAD A DIFFERENT LENGTH THAN 90 - APKUP039   **00190006
002000**    HAD A LENGTH OF 92.  THIS PROGRAM WILL BE CORRECTED TO    **00200006
002100**    USE 90.                                                   **00210006
002200**    MADE BY: MIKE BESKE              WR/IR #: WR21578         **00220006
002300**                                                              **00230006
002400******************************************************************00240006
002500 01  AP021-RECORD.                                                00250006
002600     10  AP021-VENDOR-NAME             PIC X(30).                 00260006
002700     10  AP021-VENDOR-NBR              PIC X(09).                 00270006
002800     10  AP021-PO-NBR                  PIC 9(09).                 00280006
002900     10  AP021-STR-NBR                 PIC 9(04).                 00290006
003000     10  AP021-REC-SEQ-NBR             PIC 9(09).                 00300006
003100     10  AP021-REC-DATE.                                          00310006
003200         15  AP021-REC-DATE-CC         PIC 9(02).                 00320006
003300         15  AP021-REC-DATE-YY         PIC 9(02).                 00330006
003400         15  FILLER                    PIC X(01).                 00340006
003500         15  AP021-REC-DATE-MM         PIC 9(02).                 00350006
003600         15  FILLER                    PIC X(01).                 00360006
003700         15  AP021-REC-DATE-DD         PIC 9(02).                 00370006
003800     10  AP021-REC-TOT-COST-AMT        PIC S9(10)V999 COMP-3.     00380006
003900     10  AP021-REC-TOT-QTY             PIC S9(09)     COMP-3.     00390006
004000     10  AP021-REC-TYPE-CODE           PIC X(02).                 00400006
004100         88  AP021-TYP-NIR                 VALUE 'NR'.            00410006
004200         88  AP021-TYP-RCV                 VALUE 'RV'.            00420006
004300     10  AP021-DC-NBR                  PIC 9(05).                 00430006
