000100******************************************************************00010000
000200**  THIS IS THE RECORD LAYOUT FOR THE CWT_INVC_ALW_CHRG EDW     **00020002
000300**  TABLE                                                       **00030002
000400**                                                              **00040002
000500**  COPYBOOK APRD205                                            **00050004
000600**  USED IN APKUT314                                            **00060004
000700**                                                              **00070000
000800**  RECORD FORMAT:  SEQUENTIAL, LRECL=034                       **00080001
000900******************************************************************00090000
001000**   CHANGE LOG:                                                **00100000
001100**                                                              **00110000
001200**                                                              **00120000
001300**                                                              **00130000
001400******************************************************************00140000
001500 01  AP205-RECORD.                                                00150003
001600     05  AP205-INVC-ALW-CHRG-CDE      PIC  X(03).                 00160003
001700     05  AP205-INVC-ALW-CHRG-TYP-CDE  PIC  X(01).                 00170003
001800     05  AP205-INVC-ALW-CHRG-DESC     PIC  X(30).                 00180003
