000100*----------------------------------------------------------------*00010000
000200*   EXTRACT LAYOUT FOR INTERMEDIARY PROGRAM IN THE PRODUCT       *00020000
000300*   DOWNLOAD FOR TRANSSOLUTION FREIGHT CLAIM                     *00030000
000400*   RECORD FORMAT IS SEQUENTIAL                                  *00040000
000500*          LENGTH = 50                                           *00050000
000600*----------------------------------------------------------------*00060000
000700 01  AP381-CLAIM-NEED-RECORD.                                     00070000
000800     05  AP381-RMS-STYL-ID               PIC S9(08)V    COMP-3.   00080000
000900     05  AP381-057-UNIT-COST             PIC 9(7)V9(3)  COMP-3.   00090000
001000     05  AP381-INTR-UPC-ID               PIC S9(9)      COMP.     00100000
001100     05  FILLER                          PIC X(35).               00110001
