000100*----------------------------------------------------------------*00010001
000200*   RECORD LAYOUT FOR THE JOURNALIZED IMPORT EXCEPTION RPT FILE  *00020002
000300*                                                                *00030001
000400*   APKUT196 - CREATED                                           *00040001
000500*   APKRP182 - USED                                              *00050001
000600*                                                                *00060001
000700*   RECORD FORMAT IS SEQUENTIAL, LRECL=125                       *00070001
000800*                                                                *00080001
000810*----------------------------------------------------------------*00081001
000850 01  AP080-IMPORT-EXCEPT-RPT-RECORD.                              00085002
001100     05  AP080-VENDOR-NAME               PIC X(30).               00110001
001200     05  AP080-PO-NBR                    PIC X(9).                00120001
002100     05  AP080-DEPT-NBR                  PIC X(03).               00210001
002230     05  AP080-VENDOR-NBR                PIC X(9).                00223001
002250     05  AP080-1ST-INVC-DTE              PIC X(10).               00225001
002290     05  AP080-RCV-UNT-QTY               PIC S9(9)     COMP-3.    00229001
002300     05  AP080-INV-UNT-QTY               PIC S9(9)     COMP-3.    00230001
002400     05  AP080-QTY-DIFFERENCE            PIC S9(9)     COMP-3.    00240001
003000     05  AP080-RCV-COST-AMT              PIC S9(11)V99 COMP-3.    00300001
003100     05  AP080-INV-COST-AMT              PIC S9(11)V99 COMP-3.    00310001
003110     05  AP080-COST-DIFFERENCE           PIC S9(11)V99 COMP-3.    00311001
004300     05  FILLER                          PIC X(28).               00430001
