000100*----------------------------------------------------------------*00010000
000200*   RECORD LAYOUT FOR THE EXPEDITORS DUTY FEE FOR GROUPED PO'S   *00020010
000300*                                                                *00030000
000400*   RECORD FORMAT IS SEQUENTIAL                                  *00040000
000500*          LENGTH = 181                                          *00050017
000600*----------------------------------------------------------------*00060000
000700 01  AP155-DUTY-TEXT-RECORD.                                      00070019
000710     05  AP155-BRANCH                        PIC X(3).            00071017
000711     05  FILLER                              PIC X(1).            00071118
000712*      RIGHT JUSTIFIED, ZERO FILLED.                              00071218
000713     05  AP155-PO-NBR                        PIC 9(9).            00071318
000714     05  FILLER                              PIC X(1).            00071418
000715*      LEFT JUSTIFIED, SPACE FILLED.                              00071518
000716     05  AP155-INVOICE-NBR                   PIC X(22).           00071618
000717     05  FILLER                              PIC X(1).            00071718
000718*      LEFT JUSTIFIED, SPACE FILLED.                              00071818
000900     05  AP155-BROKER-REF-NBR                PIC X(15).           00090008
000910     05  FILLER                              PIC X(1).            00091018
000920*      LEFT JUSTIFY, SPACE FILLED, 231- SHOULD BE AT THE BEGINNING00092018
000930     05  AP155-ENTRY-NBR                     PIC X(16).           00093008
000940     05  FILLER                              PIC X(1).            00094002
000950*      LEFT JUSTIFY, SPACE FILLLED                                00095010
000960     05  AP155-STATEMENT-NBR                 PIC X(15).           00096008
000970     05  FILLER                              PIC X(1).            00097002
000980*      CCYYMMDD                                                   00098020
001000     05  AP155-STATEMENT-DTE                 PIC X(08).           00100017
001010     05  FILLER                              PIC X(1).            00101002
001011*      CCYYMMDD, USE AS THE INVOICE DATE                          00101120
001020     05  AP155-CUSTOMS-PAID-DTE              PIC X(08).           00102017
001100     05  FILLER                              PIC X(1).            00110000
001101*      OUR INVOICE & DUTY AMOUNT                                  00110110
001102*      SUM OF THE DUTY, MPF, HMF, FEES, AND TOTAL TAX             00110210
001110     05  AP155-TOTAL-DUTY-AMT                PIC ZZZZZZZZZ.99.    00111014
004000     05  FILLER                              PIC X(1).            00400000
004001     05  AP155-DUTY-AMT                      PIC ZZZZZZZZZ.99.    00400110
004006     05  FILLER                              PIC X(1).            00400606
004040     05  AP155-MPF-AMT                       PIC ZZZZZZZZZ.99.    00404010
004060     05  FILLER                              PIC X(1).            00406004
004100     05  AP155-HMF-AMT                       PIC ZZZZZZZZZ.99.    00410010
004200     05  FILLER                              PIC X(1).            00420004
004210     05  AP155-FEES                          PIC ZZZZZZZZZ.99.    00421010
004230     05  FILLER                              PIC X(1).            00423004
004300     05  AP155-TOTAL-TAX-AMT                 PIC ZZZZZZZZZ.99.    00430010
