000100******************************************************************        
000200**  THIS IS THE RECORD LAYOUT FOR RECEIVNG AND PO EXTRACT FOR   **        
000300**  IMPORT PURCHASE ORDERS FILE.                                **        
000400**                                                              **        
000500**  APKUP039 - CREATED                                          **        
000600**  APKUP057 - USED                                             **        
000700**                                                              **        
000800**  RECORD FORMAT:  SEQUENTIAL                                  **        
000900**                  LRECL = 100                                 **        
001000**                                                              **        
001100******************************************************************        
001200 01  AP032-RECORD.                                                        
001300     05  AP032-PO-NBR                  PIC 9(09).                         
001400     05  AP032-PO-LNE-NBR              PIC 9(09).                         
001500     05  AP032-PO-TYP-CDE              PIC X(02).                         
001600         88  AP032-IMPORT-PO               VALUE 'IM'.                    
001700     05  AP032-REC-SEQ-NBR             PIC 9(09).                         
001800     05  AP032-STR-NBR                 PIC 9(04).                         
001900     05  AP032-REC-RVRSL-IND           PIC X(01).                         
002000     05  AP032-VERFYD-DATE.                                               
002100         10  AP032-VERFYD-DATE-CC      PIC 9(02).                         
002200         10  AP032-VERFYD-DATE-YY      PIC 9(02).                         
002300         10  FILLER                    PIC X(01).                         
002400         10  AP032-VERFYD-DATE-MM      PIC 9(02).                         
002500         10  FILLER                    PIC X(01).                         
002600         10  AP032-VERFYD-DATE-DD      PIC 9(02).                         
002700     05  AP032-REC-ELC-COST-AMT        PIC S9(04)V999 COMP-3.             
002800     05  AP032-REC-1ST-COST-AMT        PIC S9(04)V999 COMP-3.             
002900     05  AP032-REC-UNT-QTY             PIC S9(09)     COMP-3.             
003000     05  AP032-DEPT-NBR                PIC X(03).                         
003000     05  AP032-CL-NBR                  PIC X(02).                         
003100     05  FILLER                        PIC X(38).                         
