000100*----------------------------------------------------------------*00010014
000200* RECORD LAYOUT FOR THE EDI IMPORT INVOICE REJECTION/REPORT FILE *00020014
000300*                                                                *00030014
000400* RECORD FORMAT IS SEQUENTIAL.                                   *00040014
000500*        LENGTH = 750                                            *00050027
000600*----------------------------------------------------------------*00060014
000700                                                                  00070000
000800 01  AP018-REJECT-IMPORT-INVOICE.                                 00080001
000900     05  AP018-KEY.                                               00090000
001000         10  AP018-PO-NBR                PIC 9(09).               00100000
001100         10  AP018-INVOICE-NBR           PIC X(22).               00110000
001200         10  AP018-VENDOR-NBR            PIC X(9).                00120000
001300         10  AP018-EDI-SEQ-NBR           PIC X(05).               00130000
001400                                                                  00140000
001500     05  AP018-INTRCHG-DATA.                                      00150000
001600         10  AP018-INTRCHG-CNTL-NBR      PIC 9(09).               00160000
001700                                                                  00170000
001800     05  AP018-INVOICE-DATA.                                      00180000
001900         10  AP018-INVC-DTE.                                      00190003
002000             15  AP018-INVC-DTE-CC       PIC 9(02).               00200003
002100             15  AP018-INVC-DTE-YY       PIC 9(02).               00210003
002200             15  AP018-INVC-DTE-MM       PIC 9(02).               00220003
002300             15  AP018-INVC-DTE-DD       PIC 9(02).               00230003
002400         10  AP018-NET-INVC-AMT          PIC S9(9)V99 COMP-3.     00240000
002500         10  AP018-SCAC-CDE              PIC X(4).                00250000
002600         10  AP018-VENDOR-NAME           PIC X(30).               00260000
002700         10  AP018-PO-QTY                PIC 9(15).               00270015
002800         10  AP018-PO-WEIGHT             PIC 9(10).               00280000
002900         10  AP018-TOTAL-WEIGHT          PIC 9(08)V99.            00290027
003000         10  AP018-TOTAL-VOLUME          PIC 9(06)V99.            00300028
003100         10  AP018-FOB                   PIC X(03).               00310028
003200         10  AP018-POE                   PIC X(03).               00320028
003300         10  AP018-PO-UOM-CDE            PIC X(2).                00330028
003400             88  AP018-PO-UOM-PIECE          VALUE 'PC'.          00340028
003500             88  AP018-PO-UOM-CARTON         VALUE 'CT'.          00350028
003600             88  AP018-VALID-PO-UOM          VALUE 'CT', 'PC'.    00360028
003700                                                                  00370000
003800     05  AP018-REFERENCE-ID.                                      00380035
003900         10  AP018-REF-ID-QUAL           PIC X(02).               00390000
004000             88  AP018-ENTRY-NBR             VALUE '6B'.          00400000
004100             88  AP018-BOL-NBR               VALUE 'BM'.          00410000
004200             88  AP018-CONTAINER-ID          VALUE '98'.          00420007
004300             88  AP018-CUSTOMER-REF          VALUE 'CR'.          00430013
004400         10  AP018-REFERENCE-ID-NBR      PIC X(30).               00440000
004500                                                                  00450000
004600     05  AP018-CHARGES            OCCURS 20 TIMES                 00460000
004700                                  INDEXED BY CHRG-IDX.            00470011
004800         10  AP018-CHARGE-AMT            PIC S9(09)V99 COMP-3.    00480003
004900         10  AP018-CHARGE-CDE            PIC X(03).               00490003
005000         10  AP018-RATE-AMT              PIC S9(09)V99 COMP-3.    00500028
005100         10  AP018-DB-RATE-AMT           PIC S9(07)V99 COMP-3.    00510030
005110         10  AP018-PYMT-MTHD             PIC X(01).               00511030
005200                                                                  00520000
005300     05  AP018-REPORT-DATA-AREA.                                  00530000
005400         10  AP018-REPORT-CDE            PIC X(1).                00540006
005500             88  AP018-REJECT-REPORT         VALUE 'R'.           00550006
005600             88  AP018-PENDING-REPORT        VALUE 'P'.           00560006
005700         10  AP018-PO-TYP-CDE            PIC X(2).                00570006
005800         10  AP018-PRTNR-TYP-CDE         PIC X(2).                00580006
005900         10  AP018-TOTAL-CHRG-AMT        PIC S9(9)V99 COMP-3.     00590006
006000         10  AP018-CHRG-COUNT            PIC 9(3).                00600006
006100         10  AP018-INVALID-RECD-TYP-CDE  PIC X(2).                00610006
006200         10  AP018-TOTAL-DRAYAGE-AMT     PIC S9(9)V99 COMP-3.     00620008
006300         10  AP018-TOTAL-DECONSOL-AMT    PIC S9(9)V99 COMP-3.     00630008
006400         10  AP018-CALCD-DDF-AMT         PIC S9(5)V99 COMP-3.     00640028
006500         10  AP018-DECON-SCAC-CDE        PIC X(04).               00650019
006510         10  AP018-ENTRY-NUMBER          PIC X(16).               00651037
006520         10  AP018-BROKER-REF-NBR        PIC X(15).               00652037
006600         10  FILLER                      PIC X(18).               00660032
006700                                                                  00670000
006800     05  AP018-ERROR-CODE-AREA.                                   00680000
006900         10  AP018-ERR-TABLE      OCCURS 30 TIMES                 00690000
007000                                  INDEXED BY AP018-IDX.           00700012
007100             15  AP018-ERR-CDE           PIC 9(02).               00710003
007200                                                                  00720000
