000100******************************************************************00010000
000200*   THIS COPYBOOK WILL BE USED FOR JOURNALIZED RECEIPTS          *00020000
000300*   INTEGRATION TO THE GENERAL LEDGER SYSTEM.                    *00030000
000400*                                                                *00040001
000500*    APKUT004 - CREATED                                          *00050001
000700*                                                                *00070001
000710*   RECORD FORMAT IS SEQUENTIAL                                  *00071001
000720*          LENGTH = 500                                          *00072001
000800******************************************************************00080000
001000 01  AP012-GL-INTERFACE-TRN.                                      00100000
001100     05  AP012-BUSINESS-UNIT           PIC X(05).                 00110000
001200     05  AP012-ACCOUNT                 PIC X(10).                 00120000
001300     05  AP012-DEPTID                  PIC X(10).                 00130000
001400     05  AP012-PRODUCT                 PIC X(06).                 00140000
001500     05  AP012-FORCE-SUSPENSE-IND      PIC X(01).                 00150000
001600         88  AP012-FORCE-SUSPENSE          VALUE 'Y'.             00160000
001700         88  AP012-DONT-FORCE-SUSPENSE     VALUE 'N'.             00170000
001800     05  AP012-LOCATION                PIC X(04).                 00180000
001900     05  AP012-TRN-EFF-CYMD.                                      00190000
002000         10 AP012-TRN-EFF-CC           PIC X(02).                 00200000
002100         10 AP012-TRN-EFF-YY           PIC X(02).                 00210000
002200         10 AP012-TRN-EFF-MM           PIC X(02).                 00220000
002300         10 AP012-TRN-EFF-DD           PIC X(02).                 00230000
002400     05  AP012-MONETARY-DR-CR-CDE      PIC X(01).                 00240000
002500         88 AP012-MONETARY-AMT-DR          VALUE 'D'.             00250000
002600         88 AP012-MONETARY-AMT-CR          VALUE 'C'.             00260000
002700     05  AP012-MONETARY-AMT            PIC 9(23)V999.             00270000
002800     05  AP012-STAT-DR-CR-CDE          PIC X(01).                 00280000
002900         88 AP012-STAT-AMT-DR              VALUE 'D'.             00290000
003000         88 AP012-STAT-AMT-CR              VALUE 'C'.             00300000
003100     05  AP012-STATISTICAL-AMT         PIC 9(13)V99.              00310000
003200     05  AP012-STATISTICAL-CDE         PIC X(03).                 00320000
003300     05  AP012-JRNL-LINE-DESC          PIC X(30).                 00330000
003400     05  AP012-JRNL-LN-REF             PIC X(10).                 00340000
003500     05  AP012-EXPENSE-TYPE-CDE        PIC X(03).                 00350000
003600     05  FILLER                        PIC X(47).                 00360000
003700                                                                  00370000
