000100******************************************************************        
000200**  THIS IS THE RECORD LAYOUT FOR IMPORT ACCOUNT ACTIVITY AND   **        
000300**  BALANCE REPORT FILE.                                        **        
000400**                                                              **        
000500**  APKUT072, APKUT073 - CREATED                                **        
000700**  APKUP074 - USED                                             **        
000800**                                                              **        
000900**  RECORD FORMAT:  SEQUENTIAL                                  **        
001000**                  LRECL = 100                                 **        
001100**                                                              **        
001200******************************************************************        
001300 01  AP068-RECORD.                                                        
           05  AP068-PO-ACCT.                                                   
               10  AP068-PO-NBR                PIC 9(09).                       
               10  AP068-GL-ACCT-NBR           PIC X(07).                       
002900     05  AP068-DR-ACTVTY-AMT             PIC S9(11)V99 COMP-3.            
002900     05  AP068-CR-ACTVTY-AMT             PIC S9(11)V99 COMP-3.            
002900     05  AP068-AGE-30-DAY-AMT            PIC S9(09)V99 COMP-3.            
002900     05  AP068-AGE-60-DAY-AMT            PIC S9(09)V99 COMP-3.            
002900     05  AP068-AGE-90-DAY-AMT            PIC S9(09)V99 COMP-3.            
002900     05  AP068-AGE-120-DAY-AMT           PIC S9(09)V99 COMP-3.            
002900     05  AP068-AGE-OVER120-AMT           PIC S9(09)V99 COMP-3.            
002400     05  AP068-PERIOD-END-DTE            PIC X(10).                       
002500     05  FILLER REDEFINES AP068-PERIOD-END-DTE.                           
002600         10  AP068-PER-END-CC            PIC X(2).                        
002700         10  AP068-PER-END-YY            PIC X(2).                        
002800         10  FILLER                      PIC X(1).                        
002900         10  AP068-PER-END-MM            PIC X(2).                        
003000         10  FILLER                      PIC X(1).                        
003100         10  AP068-PER-END-DD            PIC X(2).                        
003500     05  FILLER                          PIC X(30).                       
