000100******************************************************************00010000
000200**  POS REQUIRING MANUAL RECONCILIATION REPORT RECORD LAYOUT    **00020001
000300**                                                              **00030000
000400**  APKUP230 - CREATED                                          **00040000
000500**  APKRP270 - USED TO CREATE REPORTS                           **00050000
000600**                                                              **00060000
000700**  RECORD FORMAT:  SEQUENTIAL                                  **00070000
000800**                  LRECL = 105                                 **00080011
000900**                                                              **00090000
001000**  THERE WILL BE ONE PO-HEADER FOR EACH PO/STORE ON THIS FILE  **00100000
001100**  PO-HEADER RECORD IDENTIFIED BY LOW-VALUES IN AP270-HEADER.  **00110002
001210**--------------------------------------------------------------**00121003
001220**  CHANGE LOG:                                                 **00122003
001230**                                                              **00123003
001240**  DATE 03/11/2007                                             **00124006
001241**     CHANGE MADE: MATCH BY DC -- EDITED THE AP270-HEADER      **00124103
001242**     AREA BY ADDING THE FIELDS AP270-DC-NBR AND               **00124203
001243**     AP270-MTCH-LVL-CDE.                                      **00124303
001244**  DATE 04/14/2021                                             **00124409
001245**     CHANGE MADE: ADD SEPHORA FLAG TO KEY                     **00124509
001246**  DATE 01/03/2024                                             **00124612
001247**     CHANGE MADE: ADD RECEIVER INCOMPLETE FLAG, LRECL TO 105  **00124712
001300******************************************************************00130000
001400 01  AP270-RECORD.                                                00140000
001500     05  AP270-KEY.                                               00150000
001600         10  AP270-REPORT                  PIC 9(02).             00160000
001700             88  MASTER                    VALUE 01.              00170000
001800             88  WORKING                   VALUE 02.              00180000
001900         10  AP270-VENDOR.                                        00190000
002000             15  AP270-VENDOR-NAME         PIC X(30).             00200000
002100             15  AP270-VENDOR-NUMBER       PIC X(09).             00210000
002200         10  AP270-PO-NBR                  PIC 9(09).             00220001
002300         10  AP270-HEADER.                                        00230000
002400             15  AP270-ENTRY-DATE.                                00240000
002500                 20  AP270-ENTRY-YEAR      PIC 9(02).             00250000
002600                 20  AP270-ENTRY-MONTH     PIC 9(02).             00260000
002700                 20  AP270-ENTRY-DAY       PIC 9(02).             00270000
002800             15  AP270-INVOICE-NUMBER      PIC X(22).             00280000
002900             15  AP270-STORE-NUMBER        PIC 9(04).             00290000
002910             15  AP270-DC-NBR              PIC 9(05).             00291003
002920             15  AP270-MTCH-LVL-CDE        PIC X(01).             00292003
003000         10  AP270-REASON-CODE         PIC X(02).                 00300000
003100             88  AP270-MANUAL-VEND-DEPT    VALUE '01'.            00310000
003200             88  AP270-TOO-MANY-RECEIV     VALUE '02'.            00320000
003300             88  AP270-TOO-MANY-RECDIS     VALUE '03'.            00330000
003400             88  AP270-TOO-MANY-NINREC     VALUE '04'.            00340000
003500             88  AP270-TOO-MANY-INVOIC     VALUE '05'.            00350000
003600             88  AP270-RCV-ZERO-COST       VALUE '06'.            00360000
003700             88  AP270-OVER-SHORT          VALUE '07'.            00370000
003800             88  AP270-MULT-INVC-COST      VALUE '08'.            00380000
003900             88  AP270-COST-DIF-OVER-LIMIT VALUE '09'.            00390000
004000             88  AP270-TOO-MANY-PRCCLM     VALUE '10'.            00400000
004100             88  AP270-NO-INVOICE-DETAIL   VALUE '11'.            00410000
004200             88  AP270-REMAINDER-IN-OUT    VALUE '12'.            00420000
004210         10  AP270-SEPHORA             PIC X.                     00421007
004220             88  AP270-SEPHORA-VND         VALUE 'Y'.             00422008
004230             88  AP270-NOT-SEPHORA-VND     VALUE 'N'.             00423008
004300     05  AP270-DATA.                                              00430000
004400         10  AP270-INVOICE-ENTRY-METHOD    PIC X(02).             00440000
004500         10  AP270-GROSS-INVOICE-AMT       PIC S9(09)V99  COMP-3. 00450000
004600         10  AP270-FIRST-TIME-RC           PIC X(01).             00460000
004610         10  AP270-RCV-INCOMP-IND          PIC X(01).             00461010
004700         10  FILLER                        PIC X(04).             00470011
004800     05  AP270-DATA-HEADER REDEFINES AP270-DATA.                  00480001
004900         10  AP270-INVOICE-COUNT           PIC S9(05)    COMP-3.  00490000
005000         10  FILLER                        PIC X(11).             00500011
