000100*----------------------------------------------------------------*00010003
000200*   RECORD LAYOUT FOR THE AP MEMO INPUT FILE                     *00020003
000300*                                                                *00030003
000400*   RECORD FORMAT IS SEQUENTIAL                                  *00040003
000500*          LENGTH = 157                                          *00050003
000600*----------------------------------------------------------------*00060003
000700 01  AP130-INPUT-FILE.                                            00061003
000800     10 AP130-VENDOR-ID               PIC   X(10).                00062003
000900     10 AP130-INVOICE-ID              PIC   X(22).                00063003
001000     10 AP130-KC-SKU-NBR              PIC   X(8).                 00064003
001100     10 AP130-DEPTID                  PIC   X(10).                00065003
001200     10 AP130-KC-PO-NBR               PIC  S9(9) COMP.            00066003
001300     10 AP130-KC-VS-NBR               PIC   X(20).                00067003
001400     10 AP130-KC-INVC-QTY             PIC  S9(9) COMP.            00068003
001500     10 AP130-KC-RCVD-QTY             PIC  S9(9) COMP.            00069003
001600     10 AP130-KC-INVC-COST-AMT        PIC  S9(9)V9(2) COMP-3.     00069103
001700     10 AP130-KC-ORD-COST-AMT         PIC  S9(9)V9(2) COMP-3.     00069203
001800     10 AP130-KC-TOT-COST-AMT         PIC  S9(9)V9(2) COMP-3.     00069303
001900     10 AP130-ORIGIN                  PIC   X(3).                 00069403
002000     10 AP130-KC-CRE-DTE              PIC   X(10).                00069503
002100     10 AP130-KC-AP-MEMO-TMST         PIC   X(26).                00069603
002200     10 AP130-UPC-ID                  PIC   X(18).                00069703
