000100*----------------------------------------------------------------*00010001
000200*   RECORD LAYOUT FOR THE COLLECT PROGRAM FTP CHARGEBACK FILE    *00020001
000300*                                                                *00030001
000400*   APKUT128  CREATED                                            *00040008
000600*                                                                *00060001
000700*   RECORD FORMAT IS SEQUENTIAL                                  *00070001
000800*          LENGTH = 207                                          *00080002
000900*----------------------------------------------------------------*00090001
001000 01  AP065-CHARGEBACK-RECORD.                                     00100001
001100     05  AP065-VENDOR-NBR                PIC X(09).               00110001
001100     05  AP065-SPACE1                    PIC X(01).               00120001
001200     05  AP065-VENDOR-NAME               PIC X(30).               00130001
001100     05  AP065-SPACE2                    PIC X(01).               00140001
001200     05  AP065-DOCUMENT-NBR              PIC X(16).               00150001
001100     05  AP065-SPACE3                    PIC X(01).               00160001
001300     05  AP065-DOCUMENT-DTE              PIC X(10).               00170001
001100     05  AP065-SPACE4                    PIC X(01).               00180001
006400     05  AP065-AP-TRAN-CDE               PIC X(02).               00190001
001100     05  AP065-SPACE5                    PIC X(01).               00200001
006720     05  AP065-PO-NBR                    PIC X(09).               00210001
001100     05  AP065-SPACE6                    PIC X(01).               00220001
006780     05  AP065-DEPT-NBR                  PIC X(03).               00230001
001100     05  AP065-SPACE7                    PIC X(01).               00240001
006780     05  AP065-CLASS-NBR                 PIC X(02).               00250001
001100     05  AP065-SPACE8                    PIC X(01).               00260001
008100     05  AP065-REASON-DESC               PIC X(100).              00270001
001100     05  AP065-SPACE9                    PIC X(01).               00280001
008100     05  AP065-STORE-NBR                 PIC X(05).               00290006
001100     05  AP065-SPACE10                   PIC X(01).               00300001
008100     05  AP065-FREIGHT-AMT               PIC -------9.99.         00310003
