      ******************************************************************        
      **  THIS IS THE LAYOUT FOR THE MERGER OF TMIITEM AND TPREQIT    **        
      **  UNLOAD FILES.                                               **        
      **                                                              **        
      **  RECORD LENGTH:  33 BYTES                                    **        
      ******************************************************************        
       01  AP406-TMIITEM-TPREQIT-RECORD.                                        
           05 AP406-PAYT-REQ-SEQ-NBR        PIC  S9(9) COMP.                    
           05 AP406-PAYT-REQ-LNE-NBR        PIC  S9(9) COMP.                    
           05 AP406-UNT-COST-SEL-CDE        PIC   X(1).                         
           05 AP406-PO-NBR                  PIC  S9(9) COMP.                    
           05 AP406-VER-NBR                 PIC  S9(9) COMP.                    
           05 AP406-PO-LNE-NBR              PIC  S9(9) COMP.                    
           05 AP406-PAY-REQ-LNE-QTY         PIC  S9(9) COMP.                    
           05 AP406-QTY-UNT-OF-MSMT         PIC   X(2).                         
           05 AP406-UNT-COST-AMT            PIC  S9(7)V9(3) COMP-3.             
                                                                                
