000100******************************************************************00010000
000200**  OPEN INVOICE AGING REPORT RECORD LAYOUT                     **00020002
000300**                                                              **00030000
000400**  RECORD FORMAT:  SEQUENTIAL                                  **00040000
000500**  RECORD LENGTH:  100                                         **00050000
000600******************************************************************00060000
000700 01  AP262-INPUT-RECORD.                                          00070000
000800     05  AP262-RECORD-KEY.                                        00080002
001000         10  AP262-VENDOR-NUMBER             PIC 9(09).           00100000
001100         10  AP262-PO-NBR                    PIC 9(09).           00110002
001200         10  AP262-INVOICE-NUMBER            PIC X(22).           00120000
001300     05  AP262-DETAIL-RECORD.                                     00130000
001400         10  AP262-VENDOR-NAME               PIC X(15).           00140000
001500         10  AP262-RCV-INCOM-IND             PIC X(01).           00150005
001600         10  FILLER                          PIC X(01).           00160005
001800         10  AP262-INVOICE-TYPE              PIC X(02).           00180000
001900         10  AP262-DUE-DATE                  PIC X(10).           00190001
002000         10  AP262-GROSS-INVOICE-AMT         PIC 9(09)V99  COMP-3.00200000
002100         10  AP262-DAYS-DELINQUENT           PIC 9(05)     COMP-3.00210000
002200         10  AP262-INVOICE-STATUS            PIC X(02).           00220000
002300         10  AP262-PAYT-REQ-SEQ-NBR          PIC S9(09) COMP.     00230000
002310         10  AP262-MTCH-LVL-CDE              PIC X(01).           00231003
002320         10  AP262-SEPHORA-IND               PIC X(01).           00232004
002330             88  AP262-IS-SEPHORA               VALUE 'Y'.        00233005
002340             88  AP262-IS-NOT-SEPHORA           VALUE 'N'.        00234005
002350     05  FILLER                              PIC X(14).           00235005
