000100*----------------------------------------------------------------*        
000200* RECORD LAYOUT FOR THE ADJUSTMENT JOURNAL GENERAL LEDGER EXTRACT*        
000300*                                                                *        
000400*   APKUP137 - CREATED                                           *        
000500*   APKUT139 - USED                                              *        
000600*                                                                *        
000700*   RECORD FORMAT IS SEQUENTIAL                                  *        
000800*          LENGTH = 170                                          *        
000900*----------------------------------------------------------------*        
001000 01  AP047-GL-EXTRACT-FILE.                                               
001100     05  AP047-GL-ACCT-NBR               PIC X(6).                        
001200     05  AP047-STR-NBR                   PIC 9(5).                        
001300     05  AP047-VND-NBR                   PIC X(9).                        
001400     05  AP047-DOC-NBR                   PIC X(16).                       
001500     05  AP047-DOC-DTE                   PIC X(10).                       
001600     05  FILLER REDEFINES AP047-DOC-DTE.                                  
001700         15  AP047-DOC-CC                PIC X(2).                        
001800         15  AP047-DOC-YY                PIC X(2).                        
001900         15  FILLER                      PIC X(1).                        
002000         15  AP047-DOC-MM                PIC X(2).                        
002100         15  FILLER                      PIC X(1).                        
002200         15  AP047-DOC-DD                PIC X(2).                        
002300     05  AP047-AP-TRN-CDE                PIC X(2).                        
002400     05  AP047-PSTG-TYP-CDE              PIC X(2).                        
002500         88  AP047-CREDIT                    VALUE 'CR'.                  
002600         88  AP047-CHARGE                    VALUE 'CH'.                  
002700     05  AP047-TRN-TYP-CDE               PIC X(3).                        
002800         88  AP047-MERCHANDISE               VALUE 'MDS'.                 
002900         88  AP047-EXPENSE                   VALUE 'EXP'.                 
003000     05  AP047-PSTG-FYR-NBR              PIC X(4).                        
003100     05  AP047-PSTG-FMN-NBR              PIC X(2).                        
003200     05  AP047-PSTG-FWK-NBR              PIC X(2).                        
003300     05  AP047-PSTG-DTE                  PIC X(10).                       
003400     05  FILLER REDEFINES AP047-PSTG-DTE.                                 
003500         15  AP047-PSTG-CC               PIC X(2).                        
003600         15  AP047-PSTG-YY               PIC X(2).                        
003700         15  FILLER                      PIC X(1).                        
003800         15  AP047-PSTG-MM               PIC X(2).                        
003900         15  FILLER                      PIC X(1).                        
004000         15  AP047-PSTG-DD               PIC X(2).                        
004100     05  AP047-ENT-NME-DESC              PIC X(30).                       
004200     05  AP047-GRO-COST-AMT              PIC S9(11)V99 COMP-3.            
004300     05  AP047-FRGT-AMT                  PIC S9(11)V99 COMP-3.            
004400     05  AP047-MISC-CHRG-AMT             PIC S9(11)V99 COMP-3.            
004500     05  AP047-NET-COST-AMT              PIC S9(11)V99 COMP-3.            
004600     05  AP047-DISC-AMT                  PIC S9(11)V99 COMP-3.            
004610     05  AP047-OFFSET-ACCT-NBR           PIC X(6).                        
004611         88  OFFSET-AP-TRADE                 VALUE '20118 '.              
004612         88  OFFSET-AP-CLEARING              VALUE '20115 '.              
004620     05  FILLER                          PIC X(28).                       
