000100******************************************************************00010001
000200**  THIS IS THE RECORD LAYOUT FOR IMPORT ELC ERROR RECORDS.     **00020002
000400**                                                              **00040001
000500**  APKUT058 - CREATED                                          **00050001
000700**  APKUT057 - USED                                             **00060001
000710**  APKRP062 - USED                                             **00070001
000800**                                                              **00080001
000900**  RECORD FORMAT:  SEQUENTIAL                                  **00090001
001000**                  LRECL = 80                                  **00100001
001100**                                                              **00110001
001200******************************************************************00120001
001300 01  AP035-RECORD.                                                00130001
001400     05  AP035-VENDOR-NAME             PIC X(30).                 00140001
001401     05  AP035-PO-NBR                  PIC 9(09).                 00150001
001402     05  AP035-PO-LNE-NBR              PIC 9(09).                 00160001
002900     05  AP035-ERROR-CDE               PIC X(02).                 00170001
003000         88  AP035-NO-ELC-FOR-PO           VALUE '01'.            00180001
003100         88  AP035-NO-ELC-FOR-LINE         VALUE '02'.            00190001
003200         88  AP035-NO-ELC-FOR-ALC          VALUE '03'.            00200001
003500     05  FILLER                        PIC X(30).                 00210001
