000100******************************************************************00010000
000200**  THIS IS THE RECORD LAYOUT FOR THE CWT_AP_TRN_CDE EDW TABLE  **00020003
000300**                                                              **00030000
000400**  COPYBOOK APRD209                                            **00040006
000500**  USED IN APKUT314                                            **00050006
000600**                                                              **00060000
000700**  RECORD FORMAT:  SEQUENTIAL, LRECL=058                       **00070001
000800******************************************************************00080000
000900**   CHANGE LOG:                                                **00090000
001000**                                                              **00100000
001100**                                                              **00110000
001200**                                                              **00120000
001300******************************************************************00130000
001400 01  AP209-RECORD.                                                00140005
001500     05  AP209-AP-TRN-CDE           PIC  X(02).                   00150005
001600     05  AP209-AP-TRN-SHRT-DESC     PIC  X(18).                   00160005
001700     05  AP209-AP-TRN-DESC          PIC  X(35).                   00170005
001800     05  AP209-AP-TRN-TYP-CDE       PIC  X(03).                   00180005
