000100******************************************************************00010000
000200*   COPYBOOK FOR THE TADJRNL DELETE FILE                         *00020000
000300*                                                                *00030000
000400*   LENGTH = 50                                                 * 00040000
000500******************************************************************00050000
000900 01  AP560-TADJRNL-RECORD.                                        00060000
001000     05  AP560-PSTG-FYR-NBR      PIC X(4).                        00070000
001000     05  AP560-PSTG-FMN-NBR      PIC X(2).                        00071000
001000     05  AP560-VND-NBR           PIC X(9).                        00072000
001000     05  AP560-DOC-NBR           PIC X(16).                       00073000
001000     05  AP560-DOC-DTE           PIC X(10).                       00074000
001000     05  AP560-AP-TRN-CDE        PIC X(2).                        00075000
002600     05  FILLER                  PIC X(7).                        00076000
