000010*--------------------------------------------------------------*  00001011
000020* RECORD LAYOUT FOR THE RECYCLED EDI INVOICES FILE             *  00002011
000030* LRECL = 350                                                  *  00003018
000060*                                                              *  00006011
000070* NOTE: IF THIS COPY BOOK IS CHANGED, ALSO CHANGE APRD050,     *  00007011
000080*       APRD051, AND APRD052 IF NECESSARY.                     *  00008011
000090*--------------------------------------------------------------*  00009011
000091* CHANGE LOG:                                                  *  00009111
000092*                                                              *  00009211
000093* DATE 03/11/2007                                              *  00009317
000094*    CHANGE MADE: MATCH BY DC -- ADDED THE FIELD               *  00009411
000095*    AP056-SORT-MTCH-LVL AND REMOVED THE FIELD                 *  00009514
000096*    AP056-SORT-STORE TO THE AP056-KEY AREA AND ADJUSTED THE   *  00009614
000097*    FILLER VALUE ACCORDINGLY.                                 *  00009714
000098*                                                              *  00010020
000099* DATE  10/17/2014                                             *  00011020
000100*     CHANGE MADE: PO EXTENDED DIGIT CHANGES.                  *  00012020
000200*       EXTENDED PO# FROM 7 TO 9                               *  00013020
000300*     MADE BY: COGNIZANT               WR/IR #: CHG0094517     *  00014020
000301*                                                              *  00015020
000302*--------------------------------------------------------------*  00020011
000800                                                                  00080000
000900     05  AP056-RECYCLE-KEY.                                       00090000
001000         10  AP056-CR-DATE.                                       00100000
001100             15  AP056-CR-CC             PIC 9(02).               00110000
001200             15  AP056-CR-JULIAN         PIC 9(05).               00120000
001300         10  AP056-RECYCLE-CNT           PIC 9(02).               00130000
001400         10  AP056-FILLER                PIC X(11).               00140000
001500     05  AP056-KEY.                                               00150000
001600         10  AP056-KOHLS-PO-NBR          PIC  9(09).              00160020
001700         10  AP056-VENDOR-INVOICE-NBR    PIC  X(22).              00170000
001800         10  AP056-RECORD-TYPE-IND       PIC  X(02).              00180000
001900              88 AP056-INV-INTRCHG                  VALUE '01'.   00190000
002000              88 AP056-INV-INVOICE-DATA             VALUE '02'.   00200000
002100              88 AP056-INV-REMIT-TO                 VALUE '03'.   00210000
002200              88 AP056-INV-TERMS                    VALUE '04'.   00220000
002300              88 AP056-INV-ALLW-CHGS                VALUE '05'.   00230000
002400              88 AP056-INV-SUMMARY                  VALUE '06'.   00240000
002500              88 AP056-INV-DETAILS                  VALUE '07'.   00250000
002600         10  FILLER                      PIC  X(01).              00260000
002700         10  AP056-EDI-SEQ-NBR           PIC  X(05).              00270000
002800         10  AP056-SORT-MTCH-LVL         PIC  X(01).              00280017
002810         10  AP056-SORT-LOC              PIC  9(05).              00281018
002820         10  FILLER                      PIC  X(05).              00290020
003000     05  AP056-DATA-AREA                 PIC X(300).              00300000
003100                                                                  00310000
003200     05  AP056-INTRCHG-DATA         REDEFINES  AP056-DATA-AREA.   00320000
003300         10  AP056-EDI-SENDER-ID-QUAL    PIC  X(02).              00330000
003400         10  AP056-EDI-SENDER-ID         PIC  X(15).              00340000
003500         10  AP056-INTRCHG-DATE.                                  00350000
003600             15  AP056-INTERCHG-DTE-YY   PIC  9(02).              00360000
003700             15  AP056-INTERCHG-DTE-MM   PIC  9(02).              00370000
003800             15  AP056-INTERCHG-DTE-DD   PIC  9(02).              00380000
003900         10  AP056-INTRCHG-TIME.                                  00390000
004000             15  AP056-INTERCHG-TME-HH   PIC  9(02).              00400000
004100             15  AP056-INTERCHG-TME-MM   PIC  9(02).              00410000
004200         10  AP056-INTRCHG-CNTL-NBR      PIC  9(09).              00420000
004300         10  AP056-GS-CNTL-NBR           PIC  9(09).              00430000
004400         10  AP056-TS-CNTL-NBR           PIC  X(09).              00440000
004500         10  AP056-PROD-TEST-IND         PIC  X(01).              00450000
004600             88 AP056-PROD-DATA                     VALUE 'P'.    00460000
004700             88 AP056-TEST-DATA                     VALUE 'T'.    00470000
004800         10  AP056-ENT-ID-DESC           PIC X(030).              00480000
004900         10  AP056-EXTENT-DUN-NBR        PIC 9(09).               00490000
005000         10  FILLER                      PIC X(35).               00500000
005100         10  AP056-EDI-TMST-KEY          PIC X(26).               00510000
005200         10  AP056-EDI-SESSION-NBR       PIC X(6).                00520000
005300         10  FILLER                      PIC X(139).              00530000
005400                                                                  00540000
005500     05  AP056-INVOICE-DATA         REDEFINES  AP056-DATA-AREA.   00550000
005600         10  AP056-CONSOLIDATED-INV-IND  PIC  X(01).              00560000
005700             88  AP056-CONSOLIDATED      VALUE 'Y'.               00570000
005800             88  AP056-DETAIL            VALUE 'N'.               00580000
005900         10  AP056-KOHLS-STORE-NBR1      PIC  X(05).              00590007
006000         10  AP056-KOHLS-STORE-NBR2      PIC  X(05).              00600007
006100         10  AP056-INVOICE-DATE.                                  00610000
006200             15  AP056-INV-DTE-YY        PIC  9(02).              00620000
006300             15  AP056-INV-DTE-MM        PIC  9(02).              00630000
006400             15  AP056-INV-DTE-DD        PIC  9(02).              00640000
006500         10  AP056-DATE-SHIPPED.                                  00650000
006600             15  AP056-SHPD-DTE-YY       PIC  9(02).              00660000
006700             15  AP056-SHPD-DTE-MM       PIC  9(02).              00670000
006800             15  AP056-SHPD-DTE-DD       PIC  9(02).              00680000
006900         10  AP056-EFFECTIVE-DATE.                                00690000
007000             15  AP056-EFF-DTE-YY        PIC  9(02).              00700000
007100             15  AP056-EFF-DTE-MM        PIC  9(02).              00710000
007200             15  AP056-EFF-DTE-DD        PIC  9(02).              00720000
007300         10  AP056-LADING-CARRIER-NBR    PIC  X(16).              00730000
007400         10  FILLER                      PIC X(255).              00740007
007500                                                                  00750000
007600     05  AP056-REMIT-INSTRUCTIONS   REDEFINES  AP056-DATA-AREA.   00760000
007700         10  AP056-REMIT-VNDR-DUNS-NBR   PIC  9(09).              00770000
007800         10  AP056-REMIT-VNDR-DUNS-SFX   PIC  X(04).              00780000
007900         10  AP056-REMIT-TO-NAME         PIC  X(35).              00790000
008000         10  AP056-REMIT-TO-ADDR-1       PIC  X(35).              00800000
008100         10  AP056-REMIT-TO-ADDR-2       PIC  X(35).              00810000
008200         10  AP056-REMIT-TO-CITY         PIC  X(19).              00820000
008300         10  AP056-REMIT-TO-STATE        PIC  X(02).              00830000
008400         10  AP056-REMIT-TO-ZIP.                                  00840000
008500             15  AP056-REMIT-TO-ZIP-5    PIC  9(05).              00850000
008600             15  FILLER                  PIC  X(01).              00860000
008700             15  AP056-REMIT-TO-ZIP-4    PIC  9(04).              00870000
008800         10  FILLER                      PIC X(151).              00880000
008900                                                                  00890000
009000     05  AP056-TERMS-DATA           REDEFINES  AP056-DATA-AREA.   00900000
009100         10  AP056-TERMS-TYPE-CODE       PIC  X(02).              00910000
009200             88  AP056-BASIC             VALUE '01'.              00920000
009300             88  AP056-EOM               VALUE '02'.              00930000
009400             88  AP056-FIXED-DATE        VALUE '03'.              00940000
009500             88  AP056-DEF-INSTALL       VALUE '04'.              00950000
009600             88  AP056-NO-DISC           VALUE '05'.              00960000
009700             88  AP056-MIXED             VALUE '06'.              00970000
009800             88  AP056-EXTENDED          VALUE '07'.              00980000
009900             88  AP056-BASIC-DISC        VALUE '08'.              00990000
010000             88  AP056-PROXIMO           VALUE '09'.              01000000
010100             88  AP056-INSTANT           VALUE '10'.              01010000
010200             88  AP056-ELECTIVE          VALUE '11'.              01020000
010300             88  AP056-10-DAYS-EOM       VALUE '12'.              01030000
010400             88  AP056-PREV-AGREED       VALUE '13'.              01040000
010500             88  AP056-MUTUAL-DEFIN      VALUE '14'.              01050000
010600         10  AP056-TRMS-BASIS-DTE-CODE   PIC  X(02).              01060000
010700             88  AP056-SHIP-DATE         VALUE '01'.              01070000
010800             88  AP056-DELIV-DATE        VALUE '02'.              01080000
010900             88  AP056-INVC-DATE         VALUE '03'.              01090000
011000             88  AP056-EFFECT-DATE       VALUE '07'.              01100000
011100         10  AP056-DISCOUNT.                                      01110000
011200             20  AP056-DISC-PCT          PIC S9(03)V9(02).        01120000
011300             20  AP056-DISC-DUE-DATE.                             01130000
011400                 25  AP056-DISC-DUE-DTE-YY  PIC 9(02).            01140000
011500                 25  AP056-DISC-DUE-DTE-MM  PIC 9(02).            01150000
011600                 25  AP056-DISC-DUE-DTE-DD  PIC 9(02).            01160000
011700             20  AP056-DISC-DAYS-DUE     PIC  9(03).              01170000
011800             20  AP056-DISC-AMT          PIC S9(06)V9(02).        01180000
011900         10  AP056-NET-DUE-DATE.                                  01190000
012000             15  AP056-NET-DUE-DTE-YY    PIC  9(02).              01200000
012100             15  AP056-NET-DUE-DTE-MM    PIC  9(02).              01210000
012200             15  AP056-NET-DUE-DTE-DD    PIC  9(02).              01220000
012300         10  AP056-NET-DEFRD-DAYS-DUE    PIC  9(03).              01230000
012400         10  AP056-DEFERRED-DETAILS.                              01240000
012500             20  AP056-PCT-PAYABLE       PIC S9(03)V9(02).        01250000
012600             20  AP056-DEFERRED-DUE-DATE.                         01260000
012700                 25  AP056-DEF-DUE-DTE-YY   PIC  9(02).           01270000
012800                 25  AP056-DEF-DUE-DTE-MM   PIC  9(02).           01280000
012900                 25  AP056-DEF-DUE-DTE-DD   PIC  9(02).           01290000
013000             20  AP056-DEFERRED-AMT      PIC S9(06)V9(02).        01300000
013100         10  AP056-TERMS-DSCRPNCY-SW     PIC  X(01).              01310000
013200             88  AP056-TERMS-DSCRPNCY-FOUND   VALUE 'Y'.          01320000
013300         10  AP056-TERMS-DSCRPNCY-VENDOR PIC  X(30).              01330000
013400         10  AP056-TERMS-SEL-CDE         PIC  X(01).              01340000
013500             88  AP056-SEL-PO-TERMS      VALUE 'P'.               01350000
013600             88  AP056-SEL-INVC-TERMS    VALUE 'I'.               01360000
013700         10  AP056-TERMS-SRC-CDE         PIC  X(01).              01370000
013800             88  AP056-SRC-PO            VALUE 'P'.               01380000
013900             88  AP056-SRC-INVC          VALUE 'I'.               01390000
014000             88  AP056-SRC-CMP           VALUE 'C'.               01400000
014100         10  AP056-TERMS-SEQ-NBR         PIC  9(04).              01410000
014200         10  AP056-TERMS-EXTD-DAYS-QTY   PIC  9(04).              01420000
014300         10  FILLER                      PIC  X(205).             01430000
014400                                                                  01440000
014500     05  AP056-ALLOWANCES-CHARGES   REDEFINES  AP056-DATA-AREA.   01450000
014600         10  AP056-ALLW-CHG-TYPE         PIC  X(01).              01460000
014700             88  AP056-NO-ALLW-CHGS      VALUE 'N'.               01470000
014800             88  AP056-ALLOWANCE         VALUE 'A'.               01480000
014900             88  AP056-CHARGE            VALUE 'C'.               01490000
015000         10  AP056-ALLW-CHRG-CODE        PIC  X(03).              01500000
015100             88  AP056-VALID-ALLW-CDES  VALUE '275', 'DSC',       01510000
015200                                       'TTD', 'CAC', 'NSD',       01520000
015300                                       'NAB', 'FFA', 'TAL',       01530000
015400                                       'VAB', 'RCA', 'WSA',       01540000
015500                                       'DDA', 'AAA', 'EEA',       01550000
015600                                       'UUM', 'PAH', 'PAI',       01560000
015700                                       'DAS', 'TTV', 'COP'.       01570010
015800             88  AP056-VALID-CHRG-CDES  VALUE '400', 'FFC',       01580000
015900                                       'PAB', 'SAB', 'PST',       01590000
016000                                       'UUC', 'MRK', '445',       01600000
016100                                       'INS', 'MSG', 'SST',       01610000
016200                                       'TTL', 'TTS', 'SCG',       01620000
016300                                       'HHB', 'LAE', 'PPN',       01630000
016400                                       '690', 'MSC', 'HGR',       01640008
016410                                       'CDG', 'CDH'.              01641009
016500         10  AP056-SPEC-SRVC-CODE        PIC  X(10).              01650000
016600             88  AP056-FREE-GOODS       VALUE 'FG        '.       01660000
016700             88  AP056-TICKETING-SRVC   VALUE 'TC        '.       01670000
016800             88  AP056-DELIVERY-SRVC    VALUE 'DL        '.       01680000
016900             88  AP056-MUTL-DEFN-SRVC   VALUE 'ZZ        '.       01690000
017000             88  AP056-HANGER-CHRG      VALUE 'HA        '.       01700000
017100         10  AP056-ALLW-CHRG-MTHD        PIC  X(02).              01710000
017200             88  AP056-OFF-INVOICE      VALUE '02'.               01720000
017300             88  AP056-CHRG-CUSTOM      VALUE '06'.               01730000
017400         10  AP056-ALLW-CHRG-TOTAL       PIC  S9(08)V9(02).       01740000
017500         10  AP056-ALLW-CHRG-PCT         PIC S9(03)V9(02).        01750000
017600         10  AP056-ALLW-CHRG-PCT-QUAL    PIC  X(01).              01760000
017700             88  AP056-DISCOUNT-GROSS   VALUE '3'.                01770000
017800         10  AP056-ALLW-SOURCE           PIC X(01).               01780000
017900             88  AP056-KOHLS-PO-ADD     VALUE 'P'.                01790000
017910             88  AP056-VENDOR-SENT      VALUE 'V'.                01791019
018000         10  FILLER                      PIC X(267).              01800000
018100                                                                  01810000
018200     05  AP056-SUMMARY-AREA         REDEFINES  AP056-DATA-AREA.   01820000
018300         10  AP056-QUANTITY-SHIPPED      PIC S9(08)V9(02).        01830000
018400         10  AP056-SHIP-UNIT-MEASURE     PIC  X(02).              01840000
018500             88  AP056-SHIP-MSR-CASE      VALUE 'CA'.             01850000
018600             88  AP056-SHIP-MSR-CONTAINER VALUE 'CH'.             01860000
018700             88  AP056-SHIP-MSR-CARTON    VALUE 'CT'.             01870000
018800             88  AP056-SHIP-MSR-EACH      VALUE 'EA'.             01880000
018900         10  AP056-GROSS-INVOICE-AMT     PIC S9(08)V9(02).        01890000
019000         10  AP056-AMT-SBJ-DISCOUNT      PIC S9(08)V9(02).        01900000
019100         10  AP056-DISCOUNT-AMT          PIC S9(08)V9(02).        01910000
019200         10  AP056-DISCOUNTED-AMT-DUE    PIC S9(08)V9(02).        01920000
019300         10  FILLER                      PIC X(248).              01930000
019400                                                                  01940000
019500     05  AP056-DETAILS-AREA         REDEFINES  AP056-DATA-AREA.   01950000
019600         10  AP056-DETAIL-ITEM-IDS.                               01960000
019700             15  AP056-ID-QUALIFIER          PIC  X(02).          01970000
019800                 88  AP056-EAN                VALUE 'EN'.         01980000
019900                 88  AP056-UPC                VALUE 'UP'.         01990000
020000             15  AP056-EAN-UPC               PIC  X(13).          02000000
020100             15  FILLER                 REDEFINES AP056-EAN-UPC.  02010000
020200                 20  AP056-EAN-CODE          PIC  X(13).          02020000
020300             15  FILLER                 REDEFINES AP056-EAN-UPC.  02030000
020400                 20  AP056-UPC-CODE          PIC  X(12).          02040000
020500                 20  FILLER                  PIC  X(01).          02050000
020600             15  AP056-KOHLS-SKU             PIC  9(08).          02060001
020700             15  AP056-VENDOR-STYLE          PIC  X(20).          02070000
020800         10  AP056-ITEM-DESCRIPTION.                              02080000
020900             15  AP056-VENDOR-STYLE-DSCRPT   PIC  X(25).          02090000
021000             15  AP056-NRMA-COLOR-CODE       PIC  X(03).          02100000
021100             15  AP056-VENDOR-COLOR-DSCRPT   PIC  X(25).          02110000
021200             15  AP056-NRMA-SIZE-CODE        PIC  X(05).          02120000
021300             15  AP056-VENDOR-SIZE-DSCRPT    PIC  X(25).          02130000
021400         10  AP056-IT1-UNIT-MEASURE      PIC  X(02).              02140000
021500             88  AP056-IT1-MSR-EACH       VALUE 'EA'.             02150000
021600             88  AP056-IT1-MSR-PACK       VALUE 'PK'.             02160000
021700             88  AP056-IT1-MSR-PAIR       VALUE 'PR'.             02170000
021800             88  AP056-IT1-MSR-SET        VALUE 'ST'.             02180000
021900             88  AP056-IT1-MSR-PK-HDR     VALUE 'AS'.             02190002
022000             88  AP056-IT1-MSR-PK-ITEM    VALUE 'PI'.             02200002
022100         10  AP056-QUANTITY-INVOICED     PIC S9(06)V9(02).        02210000
022200         10  AP056-WHOLSALE-UNIT-COST    PIC S9(07)V9(03).        02220000
022300         10  FILLER                      PIC X(60).               02230002
022400         10  AP056-PK-ITEM-SUMD-COST     PIC S9(07)V9(03).        02240004
022500         10  AP056-NO-DTL-SENT-IND       PIC X(01).               02250004
022600         10  AP056-DTL-SENT-NOT-BLNC-IND PIC X(01).               02260004
022700         10  AP056-UPC-CANT-EXPLODE-IND  PIC X(01).               02270004
022800         10  FILLER                      PIC X(81).               02280004
022900                                                                  02290000
023000     05  AP056-PACK-ITEM-AREA       REDEFINES  AP056-DATA-AREA.   02300000
023100         10  AP056-PKITEM-LINE-NBR       PIC  X(20).              02310000
023200         10  AP056-PKITEM-REL-CDE        PIC  X(01).              02320000
023300         10  AP056-PKITEM-QTY            PIC S9(07).              02330000
023400         10  AP056-PKITEM-UOM-CDE        PIC  X(02).              02340000
023500             88  AP056-PKITEM-EACH            VALUE 'EA'.         02350000
023600         10  AP056-PKITEM-COST           PIC S9(07)V9(04).        02360000
023700         10  AP056-PKITEM-ID-TABLE  OCCURS 10 TIMES               02370000
023800                                    INDEXED BY AP056-PKITEM-IDX.  02380000
023900             15  AP056-PKITEM-ID-TYP-CDE     PIC X(02).           02390000
024000                 88  AP056-PKITEM-EAN            VALUE 'EN'.      02400000
024100                 88  AP056-PKITEM-UPC            VALUE 'UP'.      02410000
024200                 88  AP056-PKITEM-STYLE          VALUE 'VA'.      02420000
024300                 88  AP056-PKITEM-SKU            VALUE 'CB'.      02430000
024400                 88  AP056-PKITEM-COLOR          VALUE 'BO'.      02440000
024500                 88  AP056-PKITEM-SIZE           VALUE 'IZ'.      02450000
024600                 88  AP056-PKITEM-IMP-COLOR      VALUE 'CM'.      02460000
024700                 88  AP056-PKITEM-IMP-SIZE       VALUE 'SM'.      02470000
024800                 88  AP056-PKITEM-BOX-ID         VALUE 'IN'.      02480000
024900             15  AP056-PKITEM-ID             PIC  X(20).          02490000
025000             15  FILLER                 REDEFINES AP056-PKITEM-ID.02500000
025100                 20  AP056-PKITEM-EAN-NBR    PIC  X(13).          02510000
025200                 20  FILLER                  PIC  X(07).          02520000
025300             15  FILLER                 REDEFINES AP056-PKITEM-ID.02530000
025400                 20  AP056-PKITEM-UPC-NBR    PIC  X(12).          02540000
025500                 20  FILLER                  PIC  X(08).          02550000
025600             15  FILLER                 REDEFINES AP056-PKITEM-ID.02560000
025700                 20  AP056-PKITEM-VND-STYLE  PIC  X(20).          02570000
025800             15  FILLER                 REDEFINES AP056-PKITEM-ID.02580000
025900                 20  AP056-PKITEM-COLOR-CDE  PIC  X(03).          02590000
026000                 20  FILLER                  PIC  X(17).          02600000
026100             15  FILLER                 REDEFINES AP056-PKITEM-ID.02610000
026200                 20  AP056-PKITEM-SIZE-CDE   PIC  X(05).          02620000
026300                 20  FILLER                  PIC  X(15).          02630000
026400             15  FILLER                 REDEFINES AP056-PKITEM-ID.02640006
026500                 20  AP056-PKITEM-SKU-NBR    PIC  X(08).          02650005
026600                 20  FILLER                  PIC  X(12).          02660005
026700         10  FILLER                      PIC X(39).               02670000
026800                                                                  02680000
026900     05  AP056-PKITEM-DESC-AREA     REDEFINES  AP056-DATA-AREA.   02690000
027000         10  AP056-PKITEM-DESC-CDE       PIC X(03).               02700000
027100             88  AP056-PKITEM-VS-DESC        VALUE '08'.          02710000
027200             88  AP056-PKITEM-CL-DESC        VALUE '73'.          02720000
027300             88  AP056-PKITEM-SZ-DESC        VALUE '74'.          02730000
027400         10  AP056-PKITEM-DESC           PIC X(25).               02740000
027500         10  FILLER                      PIC X(272).              02750000
