000100*----------------------------------------------------------------*00010002
000200*   RECORD LAYOUT FOR THE ACCOUNTS PAYABLE IMPORT PO REPORT FILE *00020002
000300*                                                                *00030002
000400*   APKUT049 - CREATED                                           *00040002
000500*   APKUT080 - USED                                              *00050002
000600*                                                                *00060002
000700*   RECORD FORMAT IS SEQUENTIAL, LRECL=175                       *00070002
000800*----------------------------------------------------------------*00080002
000900 01  AP031-IMPORT-REPORT-FILE.                                    00090002
001000     05  AP031-REPORT-TYP-CDE            PIC X(1).                00100002
001100         88  AP031-RCVING-RPT                VALUE 'R'.           00110002
001200         88  AP031-NO-RCV-RPT                VALUE 'N'.           00120002
001300         88  AP031-POSTING-RPT               VALUE 'P'.           00130002
001400     05  AP031-SORT-KEY.                                          00140002
001500         10  AP031-VENDOR-NAME           PIC X(30).               00150002
001600         10  AP031-PO-NBR                PIC X(9).                00160002
001700         10  AP031-RECORD-TYP-CDE        PIC X(1).                00170002
001800             88  AP031-PO-INFO               VALUE '1'.           00180002
001900             88  AP031-RCV-TOT-INFO          VALUE '2'.           00190002
002000             88  AP031-INV-TOT-INFO          VALUE '3'.           00200002
002100             88  AP031-INV-INFO              VALUE '4'.           00210002
002200             88  AP031-PPD-INFO              VALUE '5'.           00220002
002300             88  AP031-ELC-INFO              VALUE '6'.           00230002
002400             88  AP031-RCV-VAR-INFO          VALUE '7'.           00240002
002500     05  AP031-VENDOR-NBR                PIC X(9).                00250002
002600     05  AP031-TOTAL-QTY                 PIC S9(9)     COMP-3.    00260002
002700     05  AP031-ACT-COST-AMT              PIC S9(11)V99 COMP-3.    00270002
002800     05  AP031-EST-COST-AMT              PIC S9(11)V99 COMP-3.    00280002
002900     05  AP031-VAR-COST-AMT              PIC S9(11)V99 COMP-3.    00290002
003000     05  AP031-IMPRT-CST-CDE             PIC X(3).                00300002
003100     05  AP031-IMPRT-CST-DESC            PIC X(30).               00310002
003200     05  AP031-IMPRT-RPT-DTE             PIC X(10).               00320002
003300     05  FILLER REDEFINES AP031-IMPRT-RPT-DTE.                    00330002
003400         10  AP031-IMPRT-RPT-CC          PIC X(2).                00340002
003500         10  AP031-IMPRT-RPT-YY          PIC X(2).                00350002
003600         10  FILLER                      PIC X(1).                00360002
003700         10  AP031-IMPRT-RPT-MM          PIC X(2).                00370002
003800         10  FILLER                      PIC X(1).                00380002
003900         10  AP031-IMPRT-RPT-DD          PIC X(2).                00390002
004000     05  AP031-HDR-DTL-CDE               PIC X(1).                00400002
004100         88  AP031-HEADER                    VALUE '1'.           00410002
004200         88  AP031-DETAIL                    VALUE '2'.           00420002
004300     05  AP031-FIRST-VERFYD-DTE          PIC X(10).               00430002
004400     05  AP031-FIRST-VERFYD-DATE REDEFINES AP031-FIRST-VERFYD-DTE.00440002
004500         10  AP031-VERFYD-DATE-CC        PIC 9(02).               00450002
004600         10  AP031-VERFYD-DATE-YY        PIC 9(02).               00460002
004700         10  FILLER                      PIC X(01).               00470002
004800         10  AP031-VERFYD-DATE-MM        PIC 9(02).               00480002
004900         10  FILLER                      PIC X(01).               00490002
005000         10  AP031-VERFYD-DATE-DD        PIC 9(02).               00500002
005100     05  AP031-DEPT-NBR                  PIC X(03).               00510002
005200     05  AP031-FOB-CDE                   PIC X(03).               00520002
005300     05  AP031-FISCAL-MONTH              PIC 9(02).               00530002
005400     05  AP031-FISCAL-YEAR               PIC 9(04).               00540002
005500     05  AP031-FISCAL-SEASON             PIC X(01).               00550002
005600         88  AP031-SPRING                    VALUE 'S'.           00560002
005700         88  AP031-FALL                      VALUE 'F'.           00570002
005800     05  AP031-PO-STATUS-CDE             PIC X(02).               00580002
005900     05  AP031-OTB-PER-NBR               PIC X(06).               00590002
006000     05  AP031-LAST-VERFYD-DTE           PIC X(10).               00600002
006100     05  AP031-LAST-VERFYD-DATE REDEFINES AP031-LAST-VERFYD-DTE.  00610002
006200         10  AP031-LAST-VERFYD-CC        PIC 9(02).               00620002
006300         10  AP031-LAST-VERFYD-YY        PIC 9(02).               00630002
006400         10  FILLER                      PIC X(01).               00640002
006500         10  AP031-LAST-VERFYD-MM        PIC 9(02).               00650002
006600         10  FILLER                      PIC X(01).               00660002
006700         10  AP031-LAST-VERFYD-DD        PIC 9(02).               00670002
006800     05  FILLER                          PIC X(14).               00680002
