000100******************************************************************00010009
000200**  RECONCILIATION RESULTS REPORT RECORD LAYOUT                 **00020009
000300**                                                              **00030009
000400**  RECORD FORMAT:  SEQUENTIAL                                  **00040009
000500**  RECORD KEY DESCRIPTION:                                     **00050009
000600**   ENTRY METHOD:  'E' EDI   'M' MANUAL                        **00060009
000700**  PURCHASE ORDER NUMBER ON INVOICE                            **00070009
000800**  STORE NUMBER ON INVOICE                                     **00080009
000900**  RECORD TYPE VALUES                                          **00090009
001000**               = 'A'  VENDOR RECORD                           **00100009
001100**               = 'B'  INVOICE RECORD                          **00110009
001200**               = 'C'  INVOICE ADJUSTMENT RECORD               **00120009
001300**               = 'D'  RECEIVER RECORD                         **00130009
001400**               = 'E'  RECEIVER ADJUSTMENT RECORD              **00140009
001500******************************************************************00150009
001600 01  AP263-RECORD.                                                00160009
001700     05  AP263-RECORD-KEY.                                        00170009
001800         10  AP263-DEPT-NBR                  PIC X(03).           00180009
001900         10  AP263-PO-NBR                    PIC 9(09).           00190009
002000         10  AP263-STR-NBR                   PIC 9(04).           00200009
002100         10  AP263-RECORD-TYPE               PIC X(01).           00210009
002200             88  VENDOR-RECORD                         VALUE 'A'. 00220009
002300             88  INVOICE-RECORD                        VALUE 'B'. 00230009
002400             88  INVOICE-ADJ-RECORD                    VALUE 'C'. 00240009
002500             88  RECEIVER-RECORD                       VALUE 'D'. 00250009
002600             88  RECEIVER-ADJ-RECORD                   VALUE 'E'. 00260009
002700         10  AP263-MTCH-LVL-CDE              PIC X(01).           00270009
002800         10  FILLER                          PIC X(12).           00280009
002900     05  AP263-VENDOR-RECORD.                                     00290009
003000         10  AP263-VENDOR-NAME               PIC X(30).           00300009
003100         10  AP263-VENDOR-NBR                PIC 9(09).           00310009
003200         10  AP263-REFERENCE-NBR             PIC X(10).           00320009
003300         10  AP263-POSTRR-CRE-PRC-CDE        PIC X(01).           00330009
003400         10  FILLER                          PIC X(40).           00340009
003500     05  AP263-INVOICE-RECORD    REDEFINES AP263-VENDOR-RECORD.   00350009
003600         10  AP263-INVOICE-NBR               PIC X(22).           00360009
003700         10  AP263-INVOICE-TYPE              PIC X(02).           00370009
003800         10  AP263-ENTRY-METHOD              PIC X(01).           00380009
003900             88  EDI-ENTRY                             VALUE 'E'. 00390009
004000             88  MANUAL-ENTRY                          VALUE 'M'. 00400009
004100         10  AP263-DUE-DATE.                                      00410009
004200             15  AP263-DUE-MONTH             PIC 9(02).           00420009
004300             15  AP263-DUE-DAY               PIC 9(02).           00430009
004400             15  AP263-DUE-YEAR              PIC 9(02).           00440009
004500         10  AP263-INVOICE-QTY               PIC 9(07).           00450009
004600         10  AP263-GROSS-INVOICE-AMT         PIC 9(09)V99  COMP-3.00460009
004700         10  AP263-TERMS-PCT                 PIC 9V9999    COMP-3.00470009
004800         10  AP263-ALW-IND                   PIC X(01).           00480009
004900             88  ALLOWANCES-EXIST                      VALUE 'Y'. 00490009
005000             88  NO-ALLOWANCES-EXIST                   VALUE 'N'. 00500009
005100         10  FILLER                          PIC X(42).           00510009
005200     05  AP263-RECVR-RECORD      REDEFINES AP263-VENDOR-RECORD.   00520009
005300******************************************************************00530009
005400****   NOTE: "INVOICE-BY-STORE" RECEIVER QUANTITY WILL REPRESENT *00540009
005500****         ONLY THE AMOUNT FROM THE VERIFIED STORE DISTRIBUTION*00550009
005600****         NOT THE TOTAL VERIFIED QUANTITY FOR THE RECEIVER.   *00560009
005700******************************************************************00570009
005800         10  AP263-RECVR-SEQ-NBR             PIC 9(09).           00580009
005900         10  AP263-RECVR-TYPE                PIC X(02).           00590009
006000         10  AP263-RECVR-QTY                 PIC 9(07).           00600009
006100         10  AP263-RECVR-AMT                 PIC 9(09)V99  COMP-3.00610009
006200         10  AP263-RECVR-STR-NBR             PIC 9(05)     COMP-3.00620009
006300         10  FILLER                          PIC X(63).           00630009
006400     05  AP263-ADJ-RECORD        REDEFINES AP263-VENDOR-RECORD.   00640009
006500         10  AP263-DOC-TYP                   PIC X(02).           00650009
006600             88  CREDIT-ADJ                            VALUE 'CM'.00660009
006700             88  DEBIT-ADJ                             VALUE 'DM'.00670009
006800         10  AP263-TRAN-CODE                 PIC 9(02).           00680009
006900         10  AP263-DOC-NBR                   PIC X(16).           00690009
007000         10  AP263-RELATED-INV-NBR           PIC X(22).           00700009
007100         10  AP263-PO-LINE-NBR               PIC X(04).           00710009
007200         10  AP263-UNIT-QTY                  PIC 9(07).           00720009
007300         10  AP263-UNIT-COST                 PIC 9(09)V99  COMP-3.00730009
007400         10  AP263-REC-COST                  PIC 9(09)V99  COMP-3.00740009
007500         10  AP263-EXTD-COST                 PIC 9(09)V99  COMP-3.00750009
007600         10  FILLER                          PIC X(19).           00760009
