000100*----------------------------------------------------------------*00010000
000200*   UNJOURNALIZED RECEIPT AGING FTP FILE RECORD LAYOUT           *00020003
000300*                                                                *00030000
000400*   RECORD FORMAT IS SEQUENTIAL                                  *00040000
000500*          LENGTH = 112                                          *00050003
000600*----------------------------------------------------------------*00060000
000700 01  AP004-INTR-AGING-TEXT-FILE.                                  00070002
000800     05  AP004-VND-NBR                   PIC X(09).               00080000
000900     05  AP004-ENT-NM-DESC               PIC X(30).               00090000
001000     05  AP004-PO-NBR                    PIC 9(09).               00100003
001100     05  AP004-REC-SEQ-NBR               PIC 9(03).               00110001
001200     05  AP004-REC-DTE                   PIC X(10).               00120000
001300     05  AP004-RTL-AMT                   PIC --------9.99.        00130000
001400     05  AP004-COST-AMT                  PIC --------9.99.        00140000
001500     05  AP004-DUE-DAYS                  PIC 9(03).               00150001
001600     05  AP004-EXTENDED-DAYS             PIC 9(03).               00160001
001700     05  AP004-EOM-IND                   PIC X(01).               00170000
001800     05  AP004-CALC-DUE-DTE              PIC X(10).               00180000
001900     05  AP004-CALC-OTP-DTE              PIC X(10).               00190000
