000100*----------------------------------------------------------------*00010001
000200*   NON-INVOICED RECEIPT AGING FILE RECORD LAYOUT                *00020005
000300*          FILE.                                                 *00030004
000400*                                                                *00040001
000500*   APKUT087 - CREATED                                           *00050004
000600*   APKRP088 - USED                                              *00060004
000700*                                                                *00070004
000800*   RECORD FORMAT IS SEQUENTIAL                                  *00080001
000900*          LENGTH = 150                                          *00090005
001000*----------------------------------------------------------------*00100001
001100 01  AP071-RECORD.                                                00110001
001200     05  AP071-VND-NBR           PIC X(09).                       00120001
001300     05  AP071-ENT-NM-DESC       PIC X(30).                       00130001
001400     05  AP071-PO-NBR            PIC 9(09).                       00140005
001500     05  AP071-DEPT-NBR          PIC 9(03).                       00150001
001600     05  AP071-OTB-PER-NBR       PIC X(06).                       00160001
001700     05  AP071-TOTAL-COST        PIC S9(09)V99 COMP-3.            00170001
001800     05  AP071-TOTAL-RETAIL      PIC S9(09)V99 COMP-3.            00180001
001900     05  AP071-COST-181          PIC S9(09)V99 COMP-3.            00190001
002000     05  AP071-RETAIL-181        PIC S9(09)V99 COMP-3.            00200001
002100     05  AP071-COST-121          PIC S9(09)V99 COMP-3.            00210001
002200     05  AP071-RETAIL-121        PIC S9(09)V99 COMP-3.            00220001
002300     05  AP071-COST-91           PIC S9(09)V99 COMP-3.            00230001
002400     05  AP071-RETAIL-91         PIC S9(09)V99 COMP-3.            00240001
002500     05  AP071-COST-61           PIC S9(09)V99 COMP-3.            00250002
002600     05  AP071-RETAIL-61         PIC S9(09)V99 COMP-3.            00260002
002700     05  AP071-COST-0            PIC S9(09)V99 COMP-3.            00270002
002800     05  AP071-RETAIL-0          PIC S9(09)V99 COMP-3.            00280002
002900     05  FILLER                  PIC X(21).                       00290005
