000100******************************************************************00010000
000200**  THIS IS THE RECORD LAYOUT FOR BATCH ADJUSTMENT LOAD ERRORS. **00020000
000400**                                                              **00030000
000500**  APKUP132 - CREATED                                          **00040000
000710**  APKRP133 - USED                                             **00050000
000800**                                                              **00060000
000900**  RECORD FORMAT:  SEQUENTIAL                                  **00070000
001000**                  LRECL = 80                                  **00080000
001100**                                                              **00090000
001200******************************************************************00100000
001300 01  AP041-RECORD.                                                00110001
001100     05  AP041-KEY-FIELDS.                                        00120005
001400         10  AP041-VENDOR-NBR          PIC X(9).                  00130004
001402         10  AP041-DOC-NBR             PIC X(16).                 00140004
001402         10  AP041-DOC-DTE             PIC X(10).                 00150004
001401         10  AP041-AP-TRN-CDE          PIC X(02).                 00160004
001400     05  AP041-VENDOR-NAME             PIC X(30).                 00170001
002900     05  AP041-ERROR-CDE               PIC X(02).                 00180001
003000         88  AP041-INVALID-AP-TRN-CDE      VALUE '01'.            00190001
003100         88  AP041-HDR-DTL-OUT-OF-BALANCE  VALUE '02'.            00200001
003100         88  AP041-DTLS-WITH-NO-HDR        VALUE '03'.            00210002
003100         88  AP041-HDRS-WITH-NO-DTL        VALUE '04'.            00220003
003100         88  AP041-INVALID-INPUT-DATA      VALUE '05'.            00230003
               88  AP041-DMA-NBR-NOT-FOUND       VALUE '06'.            00240006
002900     05  AP041-OB-FIELD-CDE            PIC X(02).                 00250001
003000         88  AP041-OB-NOT-FOUND            VALUE '  '.            00260003
003000         88  AP041-OB-MULT-AMTS            VALUE '00'.            00270003
003000         88  AP041-OB-GRO-COST-AMT         VALUE '01'.            00280003
003100         88  AP041-OB-RETL-AMT             VALUE '02'.            00290001
003100         88  AP041-OB-FRGT-AMT             VALUE '03'.            00300001
003100         88  AP041-OB-MISC-CHRG-AMT        VALUE '04'.            00310001
003100         88  AP041-OB-NET-COST-AMT         VALUE '05'.            00320001
003100         88  AP041-OB-TERM-DISC-AMT        VALUE '06'.            00330001
003100         88  AP041-OB-NW-STR-DISC-AMT      VALUE '07'.            00340001
003100         88  AP041-OB-TRD-DISC-AMT         VALUE '08'.            00350001
               88  AP041-OB-MOS-DISC-AMT         VALUE '09'.            00360007
003500     05  FILLER                        PIC X(29).                 00370000
