000100******************************************************************00010000
000200**  THIS IS THE RECORD LAYOUT FOR THE RECEIVING TABLES STATUS   **00020000
000300**  UPDATE FILE  (PKMO.AP.RECEIV.UPDATE)                        **00030000
000400**                                                              **00040000
000500**  RECORD FORMAT:  SEQUENTIAL, LRECL=100                       **00050000
000600******************************************************************00060000
000700** CHANGE LOG:                                                  **00070000
000800**                                                              **00080000
000900** DATE 03/11/2007                                              **00090000
001000**    CHANGE MADE: MATCH BY DC -- ADDED THE FIELD               **00100000
001100**    AP024-RC-DC-NBR AND ADJUSTED THE FILLER VALUE ACCORDINGLY.**00110000
001110** MADE BY: KRYSTEN LEARY                WR/IR #: WR21578       **00111000
001111**                                                              **00111101
001112** DATE 02/04/2008                                              **00111209
001113**    CHANGE MADE: ADDED THE FIELD AP024-DC-NBR. REMOVED        **00111308
001114**    AP024-RC-DC-NBR. AP024-DC-NBR WILL BE USED FOR BOTH       **00111408
001115*     TRECEIV AND TNINREC RECORDS.                              **00111508
001116** MADE BY: MICHELE RINDFLEISCH          WR/IR #: WR32664       **00111610
001120******************************************************************00112000
001130 01  AP024-RECORD.                                                00113000
001140     05  AP024-RECORD-TYPE                   PIC  9(01).          00114000
001150         88  AP024-TRECDIS-UPDATE            VALUE 1.             00115000
001160         88  AP024-TRECEIV-UPDATE            VALUE 2.             00116000
001170         88  AP024-TNINREC-UPDATE            VALUE 3.             00117000
001180     05  AP024-SRT-PURCHASE-ORDER            PIC  9(09).          00118000
001190     05  AP024-SRT-STORE-NBR                 PIC  9(04).          00119000
001200     05  AP024-RECORD-KEY                    PIC  X(46).          00120000
001300     05  AP024-TRECDIS-KEY       REDEFINES AP024-RECORD-KEY.      00130000
001400         10  AP024-RD-PURCHASE-ORDER         PIC S9(09) COMP.     00140000
001500         10  AP024-RD-PO-LNE-NBR             PIC S9(09) COMP.     00150000
001600         10  AP024-RD-REC-SEQ-NBR            PIC S9(09) COMP.     00160000
001700         10  AP024-RD-OPER-UNIT-ID           PIC S9(04) COMP.     00170000
001800         10  AP024-RD-FACILITY-ID            PIC S9(04) COMP.     00180000
001900         10  AP024-RD-STORE-NBR              PIC S9(04) COMP.     00190000
002000         10  AP024-RD-STORE-FCLTY-ID         PIC S9(04) COMP.     00200000
002100         10  AP024-RD-CRE-TMST               PIC  X(26).          00210000
002200     05  AP024-TRECEIV-KEY       REDEFINES AP024-RECORD-KEY.      00220000
002300         10  AP024-RC-PURCHASE-ORDER         PIC S9(09) COMP.     00230000
002400         10  AP024-RC-RECVR-SEQ-NBR          PIC S9(09) COMP.     00240000
002500         10  AP024-RC-CRE-TMST               PIC  X(26).          00250000
002700         10  FILLER                          PIC  X(12).          00270007
002800     05  AP024-TNINREC-KEY-DATA  REDEFINES AP024-RECORD-KEY.      00280000
002900         10  AP024-NR-PURCHASE-ORDER         PIC S9(09) COMP.     00290000
003000         10  AP024-NR-PO-LNE-NBR             PIC S9(09) COMP.     00300000
003100         10  AP024-NR-NINVC-SEQ-NBR          PIC S9(09) COMP.     00310000
003210         10  FILLER                          PIC  X(34).          00321005
003300     05  AP024-AP-PRC-DTE                    PIC  X(10).          00330000
003310     05  AP024-DC-NBR                        PIC  9(05).          00331006
003400*          USED FOR TRECDIS AND TRECEIV UPDATES                   00340000
003500     05  FILLER                              PIC  X(25).          00350005
