000100******************************************************************00010000
000200*   THIS IS THE RECORD LAYOUT FOR THE UNUSED NON-INVOICED        *00020000
000300*   RECEIPTS REPORT.                                             *00030000
000400*                                                                *00040000
000500*    APKUT442 - CREATED                                          *00050000
000510*    APKRP365 - PROCESSED                                        *00051000
000600*                                                                *00052000
000700*   RECORD FORMAT IS SEQUENTIAL                                  *00053000
000800*          LENGTH = 100                                          *00054001
000900******************************************************************00055000
001000*  CHANGE LOG:                                                   *00056000
001100*  08-26-2021 - CREATED                                          *00057000
001200*               JEAN KURK                   CHG0260549           *00058000
001300*                                                                *00059000
002000******************************************************************00150000
002100 01  APRD442-RECORD.                                              00160000
002200     05  AP442-SEPHORA-IND                  PIC X(01).            00170000
002200         88 AP442-IS-SEPHORA                    VALUE 'Y'.        00170102
002200         88 AP442-IS-NOT-SEPHORA                VALUE 'N'.        00170202
002200     05  AP442-DUN-NBR                      PIC X(09).            00171001
002300     05  AP442-VENDOR-NAME                  PIC X(30).            00180000
002400     05  AP442-DEPT-NBR                     PIC X(03).            00190001
002500     05  AP442-PO-NBR                       PIC 9(09).            00200001
002600     05  AP442-CREATE-DTE                   PIC X(26).            00210001
003500     05  AP442-GROSS-COST                   PIC S9(7)V9(3).       00300001
003500     05  FILLER                             PIC X(11).            00310001
