000100******************************************************************00010000
000200**  THIS IS THE RECORD LAYOUT FOR THE IMPORT PAY RELEASE        **00020016
000300**  STATISTICS FILE                                             **00030016
000310**                                                              **00031013
000400**  APKUT341 - CREATED                                          **00040016
000600**                                                              **00060000
000700**  RECORD FORMAT:  SEQUENTIAL, COMMA DELIMITED                 **00070016
000800**                  LRECL = 50                                  **00080016
000900**                                                              **00090000
001000******************************************************************00100000
001100 01 AP116-RECORD.                                                 00110016
001300     05  AP116-PO-NBR            PIC  X(09).                      00130016
001400     05  AP116-COMMA1            PIC  X(01).                      00140017
001500     05  AP116-ENT-NAME-DESC     PIC  X(30).                      00150018
001600     05  AP116-COMMA2            PIC  X(01).                      00160017
001700     05  AP116-OTB-PER-NBR       PIC  X(06).                      00170019
002000     05  AP116-COMMA3            PIC  X(01).                      00200017
002100     05  AP116-JOURNAL-TYP-CDE   PIC  X(01).                      00210016
002101         88  AP116-AUTO-JRNL          VALUE 'A'.                  00210121
002102         88  AP116-MANUAL-JRNL        VALUE 'M'.                  00210221
002110     05  AP116-COMMA4            PIC  X(01).                      00211017
