000100     EJECT                                                        00010004
000200***************************************************************** 00020004
000300*                        A P R D 2 5 2                          * 00030006
000400***************************************************************** 00040004
000500*  THIS COPYBOOK IS THE FILE LAYOUT FOR THE INVOICE STATUS      * 00050006
000600*  UPDATE FILE, OUTPUT FROM APKUP253, INPUT TO APKUP252.        * 00060004
000700***************************************************************** 00070004
000800 01  AP252-RECORD.                                                00080004
000900     05  AP252-PO-NBR                   PIC 9(09).                00090004
001000     05  AP252-INVOICE-ID               PIC X(22).                00100004
001100     05  AP252-NEW-STATUS-CDE           PIC X(02).                00110004
001200         88 AP252-OPEN-TO-PAY               VALUE 'OP'.           00120004
001300         88 AP252-PAID                      VALUE 'PD'.           00130004
001400         88 AP252-BATCH-MATCH               VALUE 'BM'.           00140004
001500         88 AP252-PENDING-JOURNALIZATION    VALUE 'PJ'.           00150004
001600     05  AP252-AP-PRC-CDE               PIC X(01).                00160004
001700     05  AP252-AP-PRC-DTE               PIC X(10).                00170004
001800     05  AP252-PAYT-DTE                 PIC X(10).                00180004
001900     05  FILLER                         PIC X(26).                00190005
