000100*----------------------------------------------------------------*00010000
000200*   RECORD LAYOUT FOR THE ADJUSTMENT JOURNAL TRANSACTION FILE    *00020000
000300*                                                                *00030000
000400*   APKUP050, APKUT065, APKUP130, APKUT131, APKUP254 - CREATED   *00040000
000500*   APKUT131, APKUP132 - USED                                    *00050000
000600*                                                                *00060000
000700*   RECORD FORMAT IS SEQUENTIAL                                  *00070000
000800*          LENGTH = 500                                          *00080000
000900*----------------------------------------------------------------*00090000
001000 01  AP045-TRANSACTION-FILE.                                      00100000
001100     05  AP045-KEY-FIELDS.                                        00110000
001200         10  AP045-KEY-DATA-FIELDS.                               00120000
001300             15  AP045-VND-NBR         PIC X(9).                  00130000
001400             15  AP045-DOC-NBR         PIC X(16).                 00140000
001500             15  AP045-DOC-DTE         PIC X(10).                 00150000
001600             15  FILLER REDEFINES AP045-DOC-DTE.                  00160000
001700                 20  AP045-DOC-CC      PIC X(2).                  00170000
001800                 20  AP045-DOC-YY      PIC X(2).                  00180000
001900                 20  FILLER            PIC X(1).                  00190000
002000                 20  AP045-DOC-MM      PIC X(2).                  00200000
002100                 20  FILLER            PIC X(1).                  00210000
002200                 20  AP045-DOC-DD      PIC X(2).                  00220000
002300             15  AP045-AP-TRN-CDE      PIC X(2).                  00230000
002400         10  AP045-RECD-TYP-CDE        PIC X(1).                  00240000
002500             88  AP045-HEADER-RECORD       VALUE '1'.             00250000
002600             88  AP045-DETAIL-RECORD       VALUE '2'.             00260000
002700             88  AP045-CONTROL-RECORD      VALUE '9'.             00270000
002800     05  AP045-COMMON-FIELDS.                                     00280000
002900         10  AP045-PO-NBR              PIC X(9).                  00290000
003000         10  AP045-DEPT-NBR            PIC X(3).                  00300000
003100         10  AP045-GL-ACCT-NBR         PIC X(6).                  00310000
003200         10  AP045-PSTG-TYP-CDE        PIC X(2).                  00320000
003300             88  AP045-CREDIT              VALUE 'CR'.            00330000
003400             88  AP045-CHARGE              VALUE 'CH'.            00340000
003500         10  AP045-TRN-TYP-CDE         PIC X(3).                  00350000
003600             88  AP045-MERCHANDISE         VALUE 'MDS'.           00360000
003700             88  AP045-EXPENSE             VALUE 'EXP'.           00370000
003800         10  AP045-ENTR-TMST.                                     00380000
003900             15  AP045-ENTR-DTE        PIC X(10).                 00390000
004000             15  AP045-ENTR-TME        PIC X(16).                 00400000
004100         10  AP045-ENTR-ID             PIC X(8).                  00410000
004200         10  AP045-ORGN-CDE            PIC X(1).                  00420000
004300             88  AP045-ORGN-VALID          VALUE 'M'              00430000
004301                                                 'C'              00430100
004302                                                 'I'              00430200
004303                                                 'A'              00430300
004304                                                 'F'.             00430400
004305             88  AP045-ORGN-MDSE           VALUE 'M'.             00430500
004306             88  AP045-ORGN-CAPEX          VALUE 'C'.             00430600
004307             88  AP045-ORGN-IMPORT         VALUE 'I'.             00430700
004308             88  AP045-ORGN-ADJUST         VALUE 'A'.             00430800
004309             88  AP045-ORGN-FREIGHT        VALUE 'F'.             00430900
004310         10  AP045-INV-CUTOFF-DTE      PIC X(10).                 00431000
004320         10  FILLER REDEFINES AP045-INV-CUTOFF-DTE.               00432000
004330             15  AP045-INV-CUTOFF-CC   PIC X(2).                  00433000
004340             15  AP045-INV-CUTOFF-YY   PIC X(2).                  00434000
004350             15  FILLER                PIC X(1).                  00435000
004360             15  AP045-INV-CUTOFF-MM   PIC X(2).                  00436000
004370             15  FILLER                PIC X(1).                  00437000
004380             15  AP045-INV-CUTOFF-DD   PIC X(2).                  00438000
004390         10  AP045-BAR-CDE             PIC X(9).                  00439000
004400         10  AP045-PS-BTCH-NBR.                                   00440000
004500             15  AP045-PS-BTCH-DTE     PIC X(10).                 00450000
004600             15  AP045-PS-BTCH-SRC-CDE PIC X(3).                  00460000
004700             15  AP045-PS-BTCH-SEQ-NBR PIC X(2).                  00470000
004800         10  AP045-ENT-ID              PIC 9(9).                  00480000
004900         10  AP045-ENT-NME-DESC        PIC X(30).                 00490000
005000         10  AP045-RSN-TXT.                                       00500000
005100             15  AP045-RSN-1ST-LNE-TXT PIC X(50).                 00510000
005200             15  AP045-RSN-2ND-LNE-TXT PIC X(50).                 00520000
005300         10  AP045-TERM-DISC-PCT       PIC S9V9999  COMP-3.       00530000
005400         10  AP045-NW-STR-DISC-PCT     PIC S9V9999  COMP-3.       00540000
005500         10  AP045-TRD-DISC-PCT        PIC S9V9999  COMP-3.       00550000
005600         10  AP045-PSTG-FYR-NBR        PIC X(4).                  00560000
005700         10  AP045-PSTG-FMN-NBR        PIC X(2).                  00570000
005800         10  AP045-PSTG-FWK-NBR        PIC X(2).                  00580000
005900         10  AP045-MOS-DISC-PCT        PIC S9V9999  COMP-3.       00590000
005910         10  AP045-ADV-DISC-PCT        PIC S9V9999  COMP-3.       00591003
006000         10  FILLER                    PIC X(03).                 00600003
006100     05  AP045-HEADER-FIELDS.                                     00610000
006200         10  AP045-HDR-STR-NBR         PIC 9(5).                  00620000
006300         10  AP045-TOT-GRO-COST-AMT    PIC S9(9)V99 COMP-3.       00630000
006400         10  AP045-TOT-RETL-AMT        PIC S9(9)V99 COMP-3.       00640000
006500         10  AP045-TOT-FRGT-AMT        PIC S9(9)V99 COMP-3.       00650000
006600         10  AP045-TOT-MISC-CHRG-AMT   PIC S9(9)V99 COMP-3.       00660000
006700         10  AP045-TOT-NET-COST-AMT    PIC S9(9)V99 COMP-3.       00670000
006800         10  AP045-TOT-TERM-DISC-AMT   PIC S9(9)V99 COMP-3.       00680000
006900         10  AP045-TOT-NW-STR-DISC-AMT PIC S9(9)V99 COMP-3.       00690000
007000         10  AP045-TOT-TRD-DISC-AMT    PIC S9(9)V99 COMP-3.       00700000
007100         10  AP045-TOT-MOS-DISC-AMT    PIC S9(9)V99 COMP-3.       00710000
007110         10  AP045-TOT-ADV-DISC-AMT    PIC S9(9)V99 COMP-3.       00711003
007200         10  FILLER                    PIC X(07).                 00720003
007300     05  AP045-DETAIL-FIELDS REDEFINES                            00730000
007400         AP045-HEADER-FIELDS.                                     00740000
007500         10  AP045-STR-NBR             PIC 9(5).                  00750000
007600         10  AP045-CL-NBR              PIC X(2).                  00760000
007700         10  FILLER                    PIC X(3).                  00770000
007800         10  AP045-GRO-COST-AMT        PIC S9(7)V99 COMP-3.       00780000
007900         10  AP045-RETL-AMT            PIC S9(7)V99 COMP-3.       00790000
008000         10  AP045-FRGT-AMT            PIC S9(7)V99 COMP-3.       00800000
008100         10  AP045-MISC-CHRG-AMT       PIC S9(7)V99 COMP-3.       00810000
008200         10  AP045-NET-COST-AMT        PIC S9(7)V99 COMP-3.       00820000
008300         10  AP045-DTL-TERM-DISC-AMT   PIC S9(7)V99 COMP-3.       00830000
008400         10  AP045-DTL-NW-STR-DISC-AMT PIC S9(7)V99 COMP-3.       00840000
008500         10  AP045-DTL-TRD-DISC-AMT    PIC S9(7)V99 COMP-3.       00850000
008600         10  AP045-DTL-MOS-DISC-AMT    PIC S9(7)V99 COMP-3.       00860000
008610         10  AP045-SKU-NBR             PIC 9(8).                  00861000
008700         10  FILLER                    PIC X(9).                  00870000
008800     05  AP045-CONTROL-FIELDS REDEFINES                           00880000
008900         AP045-HEADER-FIELDS.                                     00890000
009000         10  AP045-CTL-RECORD-COUNT    PIC S9(11)    COMP-3.      00900000
009100         10  AP045-CTL-GRO-COST-AMT    PIC S9(11)V99 COMP-3.      00910000
009200         10  AP045-CTL-RETL-AMT        PIC S9(11)V99 COMP-3.      00920000
009300         10  AP045-CTL-FRGT-AMT        PIC S9(11)V99 COMP-3.      00930000
009400         10  AP045-CTL-MISC-CHRG-AMT   PIC S9(11)V99 COMP-3.      00940000
009500         10  AP045-CTL-NET-COST-AMT    PIC S9(11)V99 COMP-3.      00950000
009600         10  AP045-CTL-TERM-DISC-AMT   PIC S9(11)V99 COMP-3.      00960000
009700         10  AP045-CTL-NW-STR-DISC-AMT PIC S9(11)V99 COMP-3.      00970000
009800         10  AP045-CTL-TRD-DISC-AMT    PIC S9(11)V99 COMP-3.      00980000
009900         10  AP045-CTL-MOS-DISC-AMT    PIC S9(11)V99 COMP-3.      00990000
010000         10  FILLER                    PIC X(03).                 01000000
010100     05  AP045-PYMT-DUE-DTE            PIC X(10).                 01010000
010200     05  FILLER REDEFINES AP045-PYMT-DUE-DTE.                     01020000
010300         10  AP045-PYMT-DUE-CC         PIC X(2).                  01030000
010400         10  AP045-PYMT-DUE-YY         PIC X(2).                  01040000
010500         10  FILLER                    PIC X(1).                  01050000
010600         10  AP045-PYMT-DUE-MM         PIC X(2).                  01060000
010700         10  FILLER                    PIC X(1).                  01070000
010800         10  AP045-PYMT-DUE-DD         PIC X(2).                  01080000
010810     05  FILLER                        PIC X(1).                  01081000
010820     05  AP045-AUTH-NBR                PIC X(10).                 01082000
010830     05  AP045-AUTO-OTP-PSTG-IND       PIC X(1).                  01083001
010840     05  AP045-AP-PSTG-IND             PIC X(1).                  01084001
010850         88  AP045-POST-TO-PS-AP             VALUE 'Y'.           01085001
010860         88  AP045-DO-NOT-POST-TO-PS-AP      VALUE 'N'.           01086001
010870     05  AP045-SALES-TAX-AMT           PIC S9(9)V99 COMP-3.       01087002
010880     05  AP045-DOC-HLD-CDE             PIC X(1).                  01088001
010890         88  AP045-VND-HLD                   VALUE 'V'.           01089001
010891         88  AP045-DOC-HLD                   VALUE 'D'.           01089101
010892         88  AP045-NOT-ON-HLD                VALUE 'N'.           01089201
010900     05  FILLER                        PIC X(103).                01090001
