000100******************************************************************00010000
000200*   THIS IS THE RECORD LAYOUT FOR THE LOAD FILE OF THE NEW       *00020000
000300*   SHIPPER INFORMATION FOR THE FREIGHT CLAIMS SYSTEMS.           00030000
000400*                                                                *00040002
000500*   USED BY: APKUT380                                            *00050003
000600*                                                                *00060000
000700*   RECORD FORMAT: SEQUENTIAL                                    *00070000
000800*   LENGTH = 411                                                 *00080000
000801*                                                                *00080100
000802*   CREATED: 03/11/20 BARB SCHULTZ                               *00080200
000803******************************************************************00080300
000804 01  AP380-NEW-SHIPPER-EXTRACT.                                   00080402
000805     05  AP380-CDE                          PIC X(09).            00080502
000806     05  AP380-COMMA1                       PIC X     VALUE ','.  00080602
000807     05  AP380-FULL-NAME                    PIC X(30).            00080702
000808     05  AP380-COMMA2                       PIC X     VALUE ','.  00080802
000809     05  AP380-EMAIL                        PIC X(60).            00080902
000810     05  AP380-COMMA3                       PIC X     VALUE ','.  00081002
000820     05  AP380-WEBSITE                      PIC X(60).            00082002
000830     05  AP380-COMMA4                       PIC X     VALUE ','.  00083002
000840     05  AP380-LOCATION                     PIC X(04).            00084002
000850     05  AP380-COMMA5                       PIC X     VALUE ','.  00085002
000860     05  AP380-CONTACT-NAME.                                      00086002
000870         10  AP380-CONTACT-NAME-FIRST       PIC X(15).            00087002
000880         10  AP380-CONTACT-NAME-LAST        PIC X(15).            00088002
000890     05  AP380-COMMA6                       PIC X     VALUE ','.  00089002
000900     05  AP380-CONTACT-EMAIL                PIC X(64).            00090002
001000     05  AP380-COMMA7                       PIC X     VALUE ','.  00100002
001100     05  AP380-VENDOR.                                            00110002
001200         10  AP380-VENDOR-FILLER            PIC X(02) VALUE 'V#'. 00120002
001300         10  AP380-VENDOR-NBR               PIC X(09).            00130002
001400     05  AP380-COMMA8                       PIC X     VALUE ','.  00140002
001500     05  AP380-ADDRESS-LINE2                PIC X(40).            00150002
001600     05  AP380-COMMA9                       PIC X     VALUE ','.  00160002
001700     05  AP380-CITY                         PIC X(30).            00170002
001800     05  AP380-COMMA10                      PIC X     VALUE ','.  00180002
001900     05  AP380-STATE                        PIC X(02).            00190002
002000     05  AP380-COMMA11                      PIC X     VALUE ','.  00200002
002100     05  AP380-ZIP-CDE                      PIC X(12).            00210002
002200     05  AP380-COMMA12                      PIC X     VALUE ','.  00220002
002300     05  AP380-OFFICE-NBR.                                        00230002
002400         10  AP380-OFFICE1-NBR              PIC X(18).            00240002
002500         10  AP380-OFFICE1-EXT-NBR          PIC X(04).            00250002
002600     05  AP380-COMMA13                      PIC X     VALUE ','.  00260002
002700     05  AP380-FAX-NBR                      PIC X(24).            00270002
