000100******************************************************************00010009
000200**  UNJOURNALIZED RECEIPT EXCEPTION FILE RECORD LAYOUT          **00020009
000300**  DATA FILE.                                                  **00030009
000400**                                                              **00040009
000500**  APKUT107 - CREATED                                          **00050009
000600**  APKRP108 - USED                                             **00060009
000610**  APKRD251 - USED                                             **00061010
000700**                                                              **00070009
000800**  RECORD FORMAT:  SEQUENTIAL                                  **00080009
000900**                  LRECL = 95                                  **00090010
001000**                                                              **00100009
001010**10/28/2005                                                    **00101011
001020**   CHANGE MADE: ADDED FIELD AP107-TOT-GROSS-COST WHICH        **00102009
001030**   INCREASED THE RECORD SIZE TO 95. NOTE THAT IT IS NOW USED  **00103009
001040**   IN THE NEW REPORTING PROGRAM: APKRP251.                    **00104009
001050**MADE BY:  MICHELE RINDFLEISCH                 WR#: 28546      **00105009
001100******************************************************************00110009
001200 01  AP107-RECORD.                                                00120009
001300     05  AP107-KEY.                                               00130009
001400         10  AP107-VER-EXCEPTION-AMT       PIC S9(09)V99 COMP-3.  00140009
001500         10  AP107-VENDOR-NAME             PIC X(30).             00150009
001600         10  AP107-PO-NBR                  PIC 9(09).             00160009
001700     05  AP107-VENDOR-NUMBER               PIC X(09).             00170009
001800     05  AP107-DEPT                        PIC X(03).             00180009
001900     05  AP107-PO-COST                     PIC S9(09)V99 COMP-3.  00190009
002000     05  AP107-VERIFIED-COST               PIC S9(09)V99 COMP-3.  00200009
002100     05  AP107-UNJRNLZD-NIR                PIC S9(09)V99 COMP-3.  00210009
002200     05  AP107-UNJRNLZD-RECEIVER           PIC S9(09)V99 COMP-3.  00220009
002300     05  AP107-OTB-PER-NBR                 PIC X(06).             00230009
002400     05  AP107-NEW-STR-PO-IND              PIC X(01).             00240009
002500     05  AP107-TOT-GROSS-COST              PIC S9(10)V99 COMP-3.  00250009
