      *****************************************************************         
      **  THIS IS THE LAYOUT FOR THE INVOICE DETAIL FILE.            **         
      **                                                             **         
      **  RECORD LENGTH: 220 BYTES                                   **         
      *****************************************************************         
       01  AP408-INVOICE-DETAIL-RECORD.                                         
           05  AP408-INVC-ID                 PIC X(22).                         
           05  AP408-PO-NBR                  PIC S9(09).                        
           05  AP408-VER-NBR                 PIC S9(09).                        
           05  AP408-PO-LNE-NBR              PIC S9(09).                        
           05  AP408-PAY-REQ-LNE-QTY         PIC S9(09).                        
           05  AP408-QTY-UNT-OF-MSMT         PIC  X(02).                        
           05  AP408-UNT-COST-AMT            PIC S9(07)V9(03) COMP-3.           
           05  AP408-UPC-EAN-QUAL-CDE        PIC  X(01).                        
           05  AP408-UPC-EAN-CDE             PIC  X(15).                        
           05  AP408-VEND-STYL-CDE           PIC  X(20).                        
           05  AP408-COLOR-CDE               PIC  X(04).                        
           05  AP408-COLOR-DESC              PIC  X(25).                        
           05  AP408-SIZE-CDE                PIC  X(05).                        
           05  AP408-SIZE-DESC               PIC  X(25).                        
           05  AP408-SKU-DESC                PIC  X(25).                        
           05  AP408-PAYT-REQ-SEQ-NBR        PIC S9(09) COMP.                   
           05  AP408-PAYT-REQ-LNE-NBR        PIC S9(09) COMP.                   
           05  AP408-FILLER                  PIC  X(26).                        
