00001 ******************************************************************11/22/95
00002 **  THIS IS THE RECORD LAYOUT FOR THE UNJOURNALIZED RECEIPTS    **APRD108 
00003 **  DATE FILE.                                                  **   LV003
00004 **                                                              **APRD108 
00005 **  APKUT106 - CREATED                                          **APRD108 
00006 **  APKRP108 - USED                                             **APRD108 
00007 **                                                              **APRD108 
00008 **  RECORD FORMAT:  SEQUENTIAL                                  **APRD108 
00009 **                  LRECL = 41                                  **APRD108 
00010 **                                                              **APRD108 
00011 ******************************************************************APRD108 
00012  01  AP108-RECORD.                                                APRD108 
00013      05  AP108-START-DATE-LABEL            PIC X(11)                 CL**3
00014                                            VALUE 'START DATE='.   APRD108 
00015      05  AP108-START-DATE                  PIC X(10)                 CL**3
00016                                            VALUE SPACES.             CL**2
00017      05  AP108-END-DATE-LABEL              PIC X(10)                 CL**3
00018                                            VALUE ' END DATE='.    APRD108 
00019      05  AP108-END-DATE                    PIC X(10)                 CL**3
00020                                            VALUE SPACES.             CL**2
