000100******************************************************************00010004
000200**  THIS IS THE RECORD LAYOUT FOR THE INVOICE UPDATE TABLE      **00020004
000300**  EXTRACT.                                                    **00030004
000400**                                                              **00040004
000500**   APKUT152 - CREATED                                         **00050004
000600**   APKUP063 - USED                                            **00060004
000700**                                                              **00070004
000800**  RECORD FORMAT IS SEQUENTIAL                                 **00080004
000900**         LENGHT = 75                                          **00090004
001000******************************************************************00100004
001100** CHANGE LOG:                                                  **00110004
001200**  JAN 1999   JILL JUEL                                        **00120004
001300**             INCREASED THE DOC-NBR TO 16                      **00130004
001400******************************************************************00140004
001500 01  AP066-RECORD.                                                00150004
001600     05  AP066-PO-NBR               PIC S9(09) COMP VALUE 0.      00160004
001700     05  AP066-DOC-NBR              PIC X(16)  VALUE SPACES.      00170004
001800     05  AP066-DOC-TYPE             PIC X(2)   VALUE SPACES.      00180004
001810     05  AP066-CHECK-NBR            PIC X(9)   VALUE SPACES.      00181004
001820     05  AP066-FILLER               PIC X(44)  VALUE SPACES.      00182004
