000100*----------------------------------------------------------------*00010000
000200*  RECORD LAYOUT FOR THE AP SHORTAGE/REPAYMENT ZERBAL TEXT FILE  *00020000
000300*                                                                *00030000
000400*   CREATED IN APKUT060                                          *00040000
000500*                                                                *00050000
000600*   RECORD FORMAT IS SEQUENTIAL                                  *00060000
000700*          LENGTH = 41                                           *00070001
000800*----------------------------------------------------------------*00080000
000900 01  AP005-TEXT-FILE.                                             00090000
001000     05  AP005-VND-NBR                   PIC X(9).                00100000
001100     05  AP005-INVC-NBR                  PIC X(16).               00110000
001400     05  AP005-CM-INVC-NBR               PIC X(16).               00140000
