000100*---------------------------------------------------------------* 00010001
000200*  RECORD LAYOUT FOR TEXT OUTPUT FILE FOR MARKDOWN ALLOWANCE    * 00020001
000300*  AGREEMENT REPORTS.                                           * 00030001
000400*---------------------------------------------------------------* 00040001
010920 01  AP082-TEXT-RECORD.                                           01092001
010930     05  AP082-DMA-NBR           PIC XX    VALUE SPACES.          01093001
010940     05  FILLER                  PIC X     VALUE SPACES.          01094000
010941     05  AP082-VENDOR-NAME       PIC X(30) VALUE SPACES.          01094101
010942     05  FILLER                  PIC X     VALUE SPACES.          01094200
010950     05  AP082-VENDOR-NBR        PIC X(09) VALUE SPACES.          01095001
010960     05  FILLER                  PIC X     VALUE SPACES.          01096000
010970     05  AP082-DEPT-NBR          PIC X(03) VALUE SPACES.          01097001
010980     05  FILLER                  PIC X     VALUE SPACES.          01098000
010990     05  AP082-GROSS-AMT         PIC -(12).99.                    01099001
010991     05  FILLER                  PIC X     VALUE SPACES.          01099100
010992     05  AP082-GROSS-RTV-AMT     PIC -(12).99.                    01099201
010993     05  FILLER                  PIC X     VALUE SPACES.          01099300
010994     05  AP082-GROSS-DSC-AMT     PIC -(12).99.                    01099401
010995     05  FILLER                  PIC X     VALUE SPACES.          01099500
010996     05  AP082-GROSS-RTV-DSC-AMT PIC -(12).99.                    01099601
010997     05  FILLER                  PIC X     VALUE SPACES.          01099700
010998     05  AP082-DISCOUNT-PCT      PIC ZZ9.99.                      01099801
010999     05  FILLER                  PIC X     VALUE SPACES.          01099900
011000     05  AP082-RTV-IND           PIC X(01).                       01100001
011001     05  FILLER                  PIC X     VALUE SPACES.          01100100
011002     05  AP082-DSC-IND           PIC X(01).                       01100201
011003     05  FILLER                  PIC X     VALUE SPACES.          01100300
011005     05  AP082-EARNED            PIC -(12).99.                    01100501
011006     05  FILLER                  PIC X     VALUE SPACES.          01100600
011008     05  AP082-ACTUAL-TAKEN      PIC -(12).99.                    01100801
011009     05  FILLER                  PIC X     VALUE SPACES.          01100900
011010     05  AP082-UNTAKEN-AMT       PIC -(12).99.                    01101001
