000100*----------------------------------------------------------------*00010000
000200*   UNJOURNALIZED RECEIPT EXTRACT RECORD LAYOUT                  *00020013
000300*                                                                *00030000
000400*   RECORD FORMAT IS SEQUENTIAL                                  *00040000
000500*          LENGTH = 120                                          *00050004
000600*----------------------------------------------------------------*00060000
000700 01  AP042-EXTRACT-FILE.                                          00070001
000800     05  AP042-VND-NBR                   PIC X(09).               00080005
000900     05  AP042-ENT-NM-DESC               PIC X(30).               00090004
001000     05  AP042-DMM-NBR                   PIC 9(03).               00100004
001100     05  AP042-DEPT-NBR                  PIC 9(03).               00110001
001200     05  AP042-CL-NBR                    PIC 9(03).               00120001
001300     05  AP042-PO-NBR                    PIC 9(09).               00130013
001400     05  AP042-STR-NBR                   PIC X(04).               00140015
001500     05  AP042-PO-LNE-NBR                PIC 9(03).               00150001
001600     05  FILLER                          PIC X(04).               00160019
001700     05  AP042-RCV-INCOM-IND             PIC X(01).               00170019
001710     05  AP042-PO-VRFD-QTY               PIC S9(06) COMP-3.       00171019
001800     05  AP042-CALCD-VRFD-RTL-AMT        PIC S9(09)V99 COMP-3.    00180006
001900*  RECDIS-AP-VERIFY-ITM-QTY * PURITM-UNT-RTL-PR-AMT               00190002
002000     05  AP042-CALCD-VRFD-COST-AMT       PIC S9(09)V99 COMP-3.    00200006
002100*  PURITM-UNT-COST-AMT * RECDIS-AP-VERIFY-ITM-QTY                 00210002
002200     05  AP042-REC-DTE                   PIC X(10).               00220001
002300*  REC-DTE PART OF REC-TMST FROM TRECEIV                          00230002
002400     05  AP042-VRFD-DTE                  PIC X(10).               00240001
002500*  VRFD-DTE PART OF VERFYD-TMST FROM TRECEIV                      00250002
002600     05  AP042-RCV-TYP-CDE               PIC X(01) VALUE ' '.     00260001
002700         88  AP042-NON-INVC                        VALUE 'N'.     00270001
002800         88  AP042-ORIG-RCVR                       VALUE 'R'.     00280001
002900     05  AP042-REC-SEQ-NBR               PIC 9(09).               00290011
003000     05  AP042-PO-TYP-CDE                PIC X(02).               00300009
003100*    05  AP042-COLBY-IND                 PIC X(01).               00310020
003110     05  AP042-IMPRT-PYMT-TYP            PIC X(01).               00311020
003120         88  AP042-OPEN-ACCT                       VALUE 'O'.     00312021
003130         88  AP042-LLC                             VALUE 'L'.     00313021
003140         88  AP042-LI-FUNG                         VALUE 'C'.     00314021
003150         88  AP042-INFOR-NEXUS                     VALUE 'I'.     00315021
003200     05  AP042-SEPHORA-IND               PIC X(01).               00320018
005500         88  AP042-IS-SEPHORA                      VALUE 'Y'.     00550018
005600         88  AP042-IS-NOT-SEPHORA                  VALUE 'N'.     00560018
005700     05  FILLER                          PIC X(01).               00570016
