000100******************************************************************00010001
000200**  FREIGHT/CHARGE ON INVOICE REPORT RECORD LAYOUT              **00020008
000300**                                                              **00030001
000400**  RECORD FORMAT:  SEQUENTIAL                                  **00040001
000500**  RECORD KEY DESCRIPTION:                                     **00050001
000600**    PURCHASE ORDER NUMBER ON INVOICE                          **00060001
000700**    RECORD TYPE VALUES                                        **00070001
000800**               = 'A'  VENDOR RECORD                           **00080001
000900**               = 'B'  INVOICE RECORD                          **00090001
001000**               = 'C'  RECEIVER RECORD                         **00100001
001100******************************************************************00110001
001200 01  AP267-INPUT-RECORD.                                          00120008
001300     05  AP267-RECORD-KEY.                                        00130008
001400         10  AP267-PO-NBR                    PIC 9(09).           00140008
001500         10  AP267-RECORD-TYPE               PIC X(01).           00150008
001600             88  VENDOR-RECORD                         VALUE 'A'. 00160001
001700             88  INVOICE-RECORD                        VALUE 'B'. 00170001
001800             88  RECEIVER-RECORD                       VALUE 'C'. 00180001
001900     05  FILLER                              PIC X(10).           00190008
002000     05  AP267-A-RECORD.                                          00200008
002100         10  AP267-VENDOR-NAME               PIC X(15).           00210008
002200         10  AP267-VENDOR-NUMBER             PIC 9(09).           00220008
002300         10  AP267-DEPT-NUMBER               PIC 9(03).           00230008
002400         10  FILLER                          PIC X(188).          00240010
002500     05  AP267-B-RECORD          REDEFINES AP267-A-RECORD.        00250008
002600         10  AP267-INVOICE-NUMBER            PIC X(22).           00260008
002700         10  AP267-INVOICE-DATE.                                  00270008
002800             15  AP267-INVC-MONTH            PIC 9(02).           00280008
002900             15  AP267-INVC-DAY              PIC 9(02).           00290008
003000             15  AP267-INVC-YEAR             PIC 9(02).           00300008
003100         10  AP267-STORE-NUMBER              PIC 9(04).           00310008
003200         10  AP267-CHARGE-CODE               PIC X(03).           00320008
003300         10  AP267-CHARGE-AMT                PIC 9(09)V99  COMP-3.00330008
003400         10  AP267-DC-NBR                    PIC 9(05).           00340009
003500         10  AP267-MTCH-LVL-CDE              PIC X(01).           00350009
003600         10  FILLER                          PIC X(168).          00360010
003700     05  AP267-C-RECORD          REDEFINES AP267-A-RECORD.        00370009
003800         10  AP267-RECVR-SEQ-NO              PIC 9(09).           00380009
003900         10  AP267-RECVR-CARTONS             PIC 9(05)     COMP-3.00390009
004000         10  AP267-RECVR-CLASS-TABLE.                             00400009
004100             15  FILLER              OCCURS 99 TIMES              00410009
004200                                     INDEXED BY CL-IDX.           00420009
004300                 20  AP267-RECVR-CLASS       PIC 9(03)     COMP-3.00430009
004400         10  AP267-OPER-UNT-ID               PIC 9(05).           00440010
004500     05  FILLER                              PIC X(20).           00450010
