000100*---------------------------------------------------------------* 00010000
000200*   WORKING STORAGE LAYOUT FOR EDITING THE EDI IMPORT INVOICES  * 00020000
000300*                                                               * 00030000
000400*  THIS COPYBOOK WILL BE USED IN THE EDIT PROGRAM, APKUT220, TO * 00040000
000500*  PROCESS THE INDIVIDUAL EDI RECORDS THAT MAKE UP THE IMPORT   * 00050000
000600*  INVOICE.  EACH RECORD WILL BE LOADED INTO AN ENTRY IN THIS   * 00060000
000700*  TABLE.  AS EDITS ARE PERFORMED ON EACH ENTRY, ERROR CODES    * 00070000
000800*  WILL BE LOADED INTO THE ERROR TABLE AT THE END OF THAT ENTRY.* 00080000
000900*                                                               * 00090000
001000*  NOTE THAT ANY CHANGES MADE TO APRD015 MUST ALSO BE MADE TO   * 00100000
001100*  THIS COPYBOOK.                                               * 00110000
001200*                                                               * 00120000
001300*---------------------------------------------------------------* 00130000
001400                                                                  00140000
001500   02  WS015-EDIT-INVOICES              OCCURS 30 TIMES           00150000
001600                                        INDEXED BY INV-IDX.       00160000
001700     05  WS015-KEY.                                               00170000
001800         10  WS015-VNDR-INVC-KEY.                                 00180000
001900             15  WS015-VENDOR-NBR        PIC X(09).               00190000
002000             15  WS015-INVOICE-NBR       PIC X(22).               00200000
002100         10  WS015-RECORD-TYP-IND        PIC X(02).               00210000
002200             88  WS015-210-INTRCHG-HDR       VALUE '01'.          00220000
002300             88  WS015-210-INVOICE-HDR       VALUE '02'.          00230000
002400             88  WS015-210-REF-ID            VALUE '03'.          00240000
002500             88  WS015-210-CHARGES           VALUE '04'.          00250000
002600         10  WS015-EDI-SEQ-NBR           PIC X(05).               00260000
002700         10  WS015-PO-NBR                PIC 9(09).               00270000
002710         10  WS015-RECYCLE-COUNT         PIC 9(02).               00271003
002800         10  FILLER                      PIC X(26).               00280001
002900     05  WS015-DATA-AREA                 PIC X(125).              00290000
003000     05  WS015-INTRCHG-DATA         REDEFINES  WS015-DATA-AREA.   00300000
003100         10  WS015-SENDER-ID-QUAL        PIC X(02).               00310000
003200         10  WS015-SENDER-ID             PIC X(15).               00320000
003300         10  WS015-INTRCHG-CNTL-NBR      PIC 9(09).               00330000
003400         10  WS015-GS-CNTL-NBR           PIC 9(09).               00340000
003500         10  WS015-TS-CNTL-NBR           PIC X(09).               00350000
003600         10  WS015-EDI-TMST-KEY          PIC X(26).               00360000
003700         10  WS015-EDI-SESSION-NBR       PIC X(6).                00370000
003800         10  FILLER                      PIC X(49).               00380000
003900                                                                  00390000
004000     05  WS015-INVOICE-DATA REDEFINES WS015-DATA-AREA.            00400000
004100         10  WS015-INVC-DATE.                                     00410000
004200             15  WS015-INVC-DTE-CC       PIC 9(02).               00420000
004300             15  WS015-INVC-DTE-YY       PIC 9(02).               00430000
004400             15  WS015-INVC-DTE-MM       PIC 9(02).               00440000
004500             15  WS015-INVC-DTE-DD       PIC 9(02).               00450000
004600         10  WS015-NET-INVC-AMT          PIC 9(9)V99.             00460000
004700         10  WS015-SCAC-CDE              PIC X(4).                00470000
004800         10  WS015-TERMS-TYP-CDE         PIC X(02).               00480000
004900             88  WS015-VALID-TERMS-TYP       VALUE '01', '05'.    00490000
005000         10  WS015-TERMS-BASIS-DTE-CDE   PIC X(02).               00500000
005100             88  WS015-VALID-BASIS-DTE       VALUE '03'.          00510000
005200         10  WS015-NET-DAYS-DUE          PIC 9(03).               00520000
005300         10  WS015-PO-QTY                PIC 9(15).               00530000
005400         10  WS015-PO-WEIGHT             PIC 9(10).               00540000
005410         10  WS015-PO-UOM-CDE            PIC X(2).                00541000
005420             88  WS015-PO-UOM-PIECE          VALUE 'PC'.          00542000
005430             88  WS015-PO-UOM-CARTON         VALUE 'CT'.          00543000
005440             88  WS015-VALID-PO-UOM          VALUE 'CT', 'PC'.    00544000
005450         10  FILLER                      PIC X(68).               00545000
005460                                                                  00546000
005470     05  WS015-REFERENCE-ID REDEFINES WS015-DATA-AREA.            00547000
005480         10  WS015-REF-ID-QUAL           PIC X(03).               00548000
005490             88  WS015-ENTRY-NBR             VALUE '6B '.         00549000
005500             88  WS015-CONTAINER-ID          VALUE '98 '.         00550000
005600             88  WS015-BOL-NBR               VALUE 'BM '.         00560000
005700             88  WS015-CUSTOMER-REF          VALUE 'CR '.         00570000
005800         10  WS015-REFERENCE-ID-NBR      PIC X(30).               00580000
005900         10  FILLER                      PIC X(92).               00590000
006000                                                                  00600000
006100     05  WS015-CHARGES REDEFINES  WS015-DATA-AREA.                00610000
006200         10  WS015-CHARGE-AMT            PIC 9(09)V99.            00620000
006300         10  WS015-CHARGE-CDE            PIC X(03).               00630000
006400             88  WS015-VALID-CHRG-CDES       VALUE 'DDF', 'DRA',  00640000
006500                                            'MIS', 'DUT', 'DUP',  00650000
006600                                            'ENT', 'OAF', 'OCF',  00660000
006700                                            'ROY', 'LCC', 'CTX',  00670000
006710                                            'BSS',                00671000
006800                                            'REE', '690', '405'.  00680000
006900         10  FILLER                      PIC X(111).              00690000
007000                                                                  00700000
007100     05  WS015-ERROR-CODE-AREA.                                   00710000
007200         10  WS015-ERR-TABLE          OCCURS 10 TIMES             00720000
007300                                      INDEXED BY ERR-IDX.         00730000
007400             15  WS015-ERR-CDE           PIC 9(02).               00740000
007500                                                                  00750000
