000100*---------------------------------------------------------------* 00010000
000900*     THIS COPYBOOK IS BEING USED FOR ALL ERROR MESSAGES IN     * 00011000
000200*     MBOL.  IT CONTAINS THE EDIT CODE VALUES AND THE           * 00020000
000300*     RELATED MESSAGES FOR THE EDI IMPORT LANDED COST           * 00030000
000400*     INVOICE FILE EDIT AND REPORT PROGRAMS.                    * 00040000
000500*                                                               * 00050000
000600*     IMPORTANT NOTE: WHEN A NEW ERROR CODE IS PUT INTO USE,    * 00060000
000700*     YOU MUST ADD THE VALUE TO THE APPROPRIATE 88 LEVEL UNDER  * 00070000
000800*     WS182-TARGET-REPORT-CD SO THE REJECTION REPORT PROGRAM    * 00080001
000900*     CAN DIRECT THE ERROR TO CORRECT VERSION OF THE REPORT.    * 00090000
001000*---------------------------------------------------------------* 00100000
001100                                                                  00110000
001200     05  WS182-ERROR-CODES         PIC 9(02) VALUE ZEROS.         00120001
001300         88  MULT-01-REC-ERR             VALUE 01.                00130000
001400         88  MULT-02-REC-ERR             VALUE 02.                00140000
001500         88  MISSING-01-REC-ERR          VALUE 03.                00150000
001600         88  MISSING-02-REC-ERR          VALUE 04.                00160000
001700         88  MISSING-03-REC-ERR          VALUE 05.                00170000
001800         88  MISSING-04-REC-ERR          VALUE 06.                00180000
001900         88  INVALID-REC-TYPE-ERR        VALUE 07.                00190000
002000         88  NO-PO-NBR-ERR               VALUE 08.                00200000
002100         88  INVALID-PO-NBR-ERR          VALUE 09.                00210000
002200         88  NON-IMPORT-PO-NBR-ERR       VALUE 10.                00220000
002300         88  NO-INV-NBR-ERR              VALUE 11.                00230000
002400         88  NO-VENDOR-NBR-ERR           VALUE 12.                00240000
002500         88  INVALID-VENDOR-NBR-ERR      VALUE 13.                00250000
002600         88  NO-INV-DATE-ERR             VALUE 14.                00260000
002700         88  INV-DATE-INVALID-ERR        VALUE 15.                00270000
006622         88  INVALID-INVC-QTY-CODE       VALUE 16.                00280000
006622         88  INVALID-INVC-VOLUME-CODE    VALUE 17.                00291005
006622         88  INVALID-INVC-WEIGHT-CODE    VALUE 18.                00300005
006622         88  INVALID-PO-VOLUME-CODE      VALUE 19.                00310005
003200         88  INVALID-REF-QUAL-ERR        VALUE 20.                00320000
003300         88  NO-REF-ID-NBR-ERR           VALUE 21.                00330000
003400         88  NO-ENTRY-NBR-ERR            VALUE 22.                00340000
003500         88  NO-BOL-ID-ERR               VALUE 23.                00350000
003600         88  OVER-5-REF-ERR              VALUE 24.                00360000
003700         88  INVALID-CHRG-CDE-ERR        VALUE 25.                00370000
003800         88  CHRG-AMT-GT-ZERO-ERR        VALUE 26.                00380000
006622         88  INVALID-PO-WEIGHT-CODE      VALUE 27.                00390005
006622         88  INVALID-PO-QTY-CODE         VALUE 28.                00400005
006622         88  OVER-10-CONTAINER-ERR       VALUE 29.                00410005
004200         88  DRAYAGE-PO-SENT-BY-OCEAN    VALUE 30.                00420011
004300         88  OVER-20-CHRGS-ERR           VALUE 31.                00430000
004400         88  NET-COST-NE-CHRG-SUM-ERR    VALUE 32.                00440000
004500         88  NET-COST-GT-ZERO-ERR        VALUE 33.                00450000
004600         88  DUPL-VND-INV-TRANS-ERR      VALUE 34.                00460002
004700         88  DUPL-PO-INV-TRANS-ERR       VALUE 35.                00470002
006622         88  OVER-99-PO-ERR              VALUE 36.                00480005
004900         88  DUPL-PO-INV-DB-ERR          VALUE 37.                00490002
005000         88  DUPL-VND-INV-ADJ-ERR        VALUE 38.                00500002
005100         88  CHRG-THRESHHOLD-EXCP        VALUE 39.                00510000
005200         88  MISC-CHRG-EXCP              VALUE 40.                00520000
006617         88  INVALID-MBOL                VALUE 41.                00530005
006616         88  INVALID-PO-VOLUME           VALUE 42.                00540005
006615         88  INVALID-PO-WEIGHT           VALUE 43.                00550005
005600         88  NO-CUSTOMER-REF-ERR         VALUE 44.                00560000
005700         88  INVALID-PO-QTY-UOM-ERR      VALUE 45.                00570000
006614         88  INVALID-PO-QTY              VALUE 46.                00580005
005900         88  INVALID-NBR-PO-FOR-AIR      VALUE 47.                00590010
006613         88  INVALID-TOTAL-VOLUME        VALUE 48.                00600005
006612         88  INVALID-TOTAL-WEIGHT        VALUE 49.                00610005
006611         88  INVALID-TOTAL-QTY           VALUE 50.                00620005
006610         88  INCORRECT-NBR-PO            VALUE 51.                00630005
006609         88  INVALID-NBR-OF-PO-ON-MBOL   VALUE 52.                00640005
006608         88  INVALID-PO-BROKER-ERR       VALUE 53.                00650005
006606         88  INVALID-PO-ENTRY-ERR        VALUE 54.                00651005
006605         88  INVALID-PO-BOL-ERR          VALUE 55.                00652005
006530         88  INVALID-DEPARTURE-DATE-ERR  VALUE 56.                00653000
004600         88  DUPL-INVOICE-ERR            VALUE 57.                00654005
006596         88  INVALID-POE                 VALUE 58.                00655005
006595         88  INVALID-FOB                 VALUE 59.                00659505
006623     05  WS182-ERROR-MSG-AREA.                                    00662801
006624         10  WS182-ERR-MSG1        PIC X(45) VALUE                00662901
006625             'MULTIPLE 01 RECORD TYPE NOT ALLOWED          '.     00663000
006630         10  WS182-ERR-MSG2        PIC X(45) VALUE                00663101
006640             'MULTIPLE 02 RECORD TYPE NOT ALLOWED          '.     00663200
006650         10  WS182-ERR-MSG3        PIC X(45) VALUE                00663301
006660             'RECORD TYPE 01 REQUIRED BUT NOT FOUND        '.     00663400
006670         10  WS182-ERR-MSG4        PIC X(45) VALUE                00663501
006680             'RECORD TYPE 02 REQUIRED BUT NOT FOUND        '.     00663600
006690         10  WS182-ERR-MSG5        PIC X(45) VALUE                00663701
006700             'RECORD TYPE 03 REQUIRED BUT NOT FOUND        '.     00663800
006800         10  WS182-ERR-MSG6        PIC X(45) VALUE                00663901
006900             'RECORD TYPE 04 REQUIRED BUT NOT FOUND        '.     00664000
007000         10  WS182-ERR-MSG7        PIC X(45) VALUE                00664101
007100             'INVALID RECORD TYPE                          '.     00664200
007200         10  WS182-ERR-MSG8        PIC X(45) VALUE                00664301
007300             'PO NUMBER REQUIRED                           '.     00664400
007400         10  WS182-ERR-MSG9        PIC X(45) VALUE                00664501
007500             'PO NBR IS NOT A VALID KOHLS PO               '.     00664600
007600         10  WS182-ERR-MSG10       PIC X(45) VALUE                00664701
007700             'PO NBR IS NOT A KOHLS IMPORT PO              '.     00664800
007800         10  WS182-ERR-MSG11       PIC X(45) VALUE                00664901
007900             'INVOICE NUMBER REQUIRED                      '.     00665000
008000         10  WS182-ERR-MSG12       PIC X(45) VALUE                00666001
008100             'VENDOR NUMBER IS REQUIRED                    '.     00667000
008200         10  WS182-ERR-MSG13       PIC X(45) VALUE                00668001
008300             'VENDOR NUMBER IS NOT A VALID KOHLS VENDOR    '.     00669000
008400         10  WS182-ERR-MSG14       PIC X(45) VALUE                00670001
008500             'INVOICE DATE IS REQUIRED                     '.     00680000
008600         10  WS182-ERR-MSG15       PIC X(45) VALUE                00690001
008700             'INVOICE DATE IS NOT VALID  YY/MM/DD          '.     00700000
008800         10  WS182-ERR-MSG16       PIC X(45) VALUE                00710001
008900             'INVALID INVOICE QTY CODE ERROR               '.     00720000
018757         10  WS182-ERR-MSG17       PIC X(45) VALUE                00730004
018758             'INVALID INVOICE VOLUME CODE ERROR            '.     00740004
018757         10  WS182-ERR-MSG18       PIC X(45) VALUE                00750004
018758             'INVALID INVOICE WEIGHT CODE ERROR            '.     00760004
018757         10  WS182-ERR-MSG19       PIC X(45) VALUE                00770004
018758             'INVALID PO VOLUME CODE                       '.     00780004
009600         10  WS182-ERR-MSG20       PIC X(45) VALUE                00790001
009700             'REFERENCE ID QUALIFIER IS NOT VALID          '.     00800000
009800         10  WS182-ERR-MSG21       PIC X(45) VALUE                00810001
009900             'REFERENCE ID NUMBER IS REQUIRED              '.     00820000
010000         10  WS182-ERR-MSG22       PIC X(45) VALUE                00830001
010100             'ENTRY NUMBER IS REQUIRED                     '.     00840000
010200         10  WS182-ERR-MSG23       PIC X(45) VALUE                00850001
010300             'BOL ID IS REQUIRED                           '.     00860000
010400         10  WS182-ERR-MSG24       PIC X(45) VALUE                00870001
010500             'TOO MANY REFERENCE ID SEGMENTS SENT          '.     00880000
010600         10  WS182-ERR-MSG25       PIC X(45) VALUE                00890001
010700             'CHARGE CODE IS NOT VALID                     '.     00900000
010800         10  WS182-ERR-MSG26       PIC X(45) VALUE                00910001
010900             'CHARGE AMOUNT MUST BE GREATER THAN ZERO      '.     00920000
018757         10  WS182-ERR-MSG27       PIC X(45) VALUE                00940004
018758             'INVALID PO WEIGHT CODE                       '.     00950004
018757         10  WS182-ERR-MSG28       PIC X(45) VALUE                00960004
018758             'INVALID PO QUANTITY CODE                     '.     00970004
018757         10  WS182-ERR-MSG29       PIC X(45) VALUE                00980004
018758             'TOO MANY CONTAINERS IN MBOL                  '.     00981004
011600         10  WS182-ERR-MSG30       PIC X(45) VALUE                00990001
011700             'DRAYAGE PO SENT BY OCEAN                     '.     01000011
011800         10  WS182-ERR-MSG31       PIC X(45) VALUE                01010001
011900             'TOO MANY RATES AND CHARGES SEGMENTS SENT     '.     01020000
012000         10  WS182-ERR-MSG32       PIC X(45) VALUE                01030001
012100             'SUM OF CHARGES NOT EQUAL INVOICE NET COST    '.     01040000
012200         10  WS182-ERR-MSG33       PIC X(45) VALUE                01050001
012300             'INVOICE NET COST MUST BE GREATER THAN ZERO   '.     01060000
012400         10  WS182-ERR-MSG34       PIC X(45) VALUE                01070001
012500             'VENDOR/INVOIC COMBO DUPLICATE IN TRANSMISSION'.     01080000
012600         10  WS182-ERR-MSG35       PIC X(45) VALUE                01090001
012700             'PO/INVOICE COMBO DUPLICATE IN TRANSMISSION   '.     01100000
018757         10  WS182-ERR-MSG36       PIC X(45) VALUE                01110004
018758             'TOO MANY PO SEGMENTS SENT                    '.     01120004
013000         10  WS182-ERR-MSG37       PIC X(45) VALUE                01130001
013100             'PO/INVOICE DUPLICATE ON INVOICE DATABASE     '.     01140000
013200         10  WS182-ERR-MSG38       PIC X(45) VALUE                01150001
013300             'VENDOR/INVOICE DUPLICATE ON ADJUSTMENT JOURNL'.     01160000
013400         10  WS182-ERR-MSG39       PIC X(45) VALUE                01170001
013500             'CHARGE EXCEEDS DEFINED THRESHHOLD            '.     01180000
013600         10  WS182-ERR-MSG40       PIC X(45) VALUE                01190001
013700             'INVOICE CONTAINS MISC CHARGES - REVIEW       '.     01200000
018747         10  WS182-ERR-MSG41       PIC X(45) VALUE                01210004
018748             'MBOL NOT FOUND                               '.     01220004
018745         10  WS182-ERR-MSG42       PIC X(45) VALUE                01230004
018746             'VOLUME ON PO IS INVALID                      '.     01240004
018743         10  WS182-ERR-MSG43       PIC X(45) VALUE                01250004
018744             'WEIGHT ON PO IS INVALID                      '.     01260004
014400         10  WS182-ERR-MSG44       PIC X(45) VALUE                01270001
014500             'NO FILE NBR (CUST REF) SENT BY CUSTOMS BROKER'.     01280012
014500*            'NO FILE NBR (CUSTOMER REF) SENT BY EXPEDITORS'.     01281012
014600         10  WS182-ERR-MSG45       PIC X(45) VALUE                01290001
014700             'INVALID PO QUANTITY UNIT OF MEASURE          '.     01300000
018741         10  WS182-ERR-MSG46       PIC X(45) VALUE                01310004
018742             'QTY ON PO IS INVALID                         '.     01320004
015000         10  WS182-ERR-MSG47       PIC X(45) VALUE                01330001
015100             'AIR FREIGHT CAN ONLY HAVE ONE PO             '.     01340009
018739         10  WS182-ERR-MSG48       PIC X(45) VALUE                01350004
018740             'TOTAL VOLUME DOES NOT EQUAL VOLUME ON ALL PO '.     01360004
018737         10  WS182-ERR-MSG49       PIC X(45) VALUE                01370004
018738             'TOTAL WEIGHT DOES NOT EQUAL WEIGHT ON ALL PO '.     01380004
018735         10  WS182-ERR-MSG50       PIC X(45) VALUE                01390004
018736             'TOTAL QTY NOT EQUAL TO QTY ON ALL PO IN MBOL '.     01400004
018733         10  WS182-ERR-MSG51       PIC X(45) VALUE                01410004
018734             'NBR OF PO DOES NOT MATCH HEADER              '.     01420004
018731         10  WS182-ERR-MSG52       PIC X(45) VALUE                01430004
018732             'NBR OF PO DOES NOT MATCH PROPRIETARY FILE    '.     01440004
018729         10  WS182-ERR-MSG53       PIC X(45) VALUE                01450004
018730             'PO/BROKER COMBINATION NOT FOUND              '.     01460004
018725         10  WS182-ERR-MSG54       PIC X(45) VALUE                01470004
018726             'PO/ENTRY NUMBER COMBINATION NOT FOUND        '.     01480004
018723         10  WS182-ERR-MSG55       PIC X(45) VALUE                01490004
018724             'PO/BILL OF LADING COMBINATION NOT FOUND      '.     01500004
016800         10  WS182-ERR-MSG56       PIC X(45) VALUE                01510001
016900             'DEPARTURE DATE IS INVALID                    '.     01520000
018704         10  WS182-ERR-MSG57       PIC X(45) VALUE                01530004
018705             'DUPLICATE INVOICE                            '.     01540004
018660         10  WS182-ERR-MSG58       PIC X(45) VALUE                01550004
018670             'INVALID POE CODE                             '.     01560004
018640         10  WS182-ERR-MSG59       PIC X(45) VALUE                01730004
018650             'INVALID FOB CODE                             '.     01740000
018759     05  WS182-ERROR-MSG-TABLE REDEFINES                          01875201
018760                       WS182-ERROR-MSG-AREA.                      01875301
018761         10  WS182-ERROR-MSG-DATA    OCCURS 59 TIMES              01875404
018770                                     INDEXED BY MSG-IDX.          01875500
018780             15  WS182-ERROR-MSG     PIC X(45).                   01875601
018790                                                                  01875700
018800     05  WS182-TARGET-REPORT-CD    PIC 9(02) VALUE ZEROS.         01875801
018900         88  AP-REJECT-REPORT            VALUES                   01875900
019000                                         09, 10, 13, 16, 17, 18,  01876004
019100                                         19, 22, 23, 27, 28, 29,  01876104
019200                                         30, 34, 35, 36, 37, 38,  01876211
019200                                         39, 40, 41, 42, 43, 44,  01876307
019300                                         46, 47, 48, 49, 50, 51,  01876408
019600                                         52, 53, 54, 55, 57, 58,  01876607
019600                                         59, 67, 68, 69.          01876707
019620         88  MIO-REJECT-REPORT           VALUES                   01877304
019630                                         01, 02, 03, 04, 05, 06,  01877404
019640                                         07, 08, 11, 12, 14, 15,  01877504
019650                                         16, 17, 18, 19, 20, 21,  01877604
019650                                         24, 25, 26, 27, 28, 29,  01877704
019660                                         31, 32, 33, 37, 38, 41,  01877804
019660                                         45, 51, 52, 56, 61, 62,  01877904
019670                                         65, 66.                  01878006
019690         88  AP-PENDING-REPORT           VALUES                   01879000
019700                                         30, 39, 40, 67, 68.      01880011
