000100     EJECT                                                        00010001
000200***************************************************************** 00020001
000300*                        A P W S 3 0 0                          * 00030001
000400***************************************************************** 00040001
000500*  THIS COPYBOOK CONTAINS THE COMMON DATA TO BE SHARED BY THE   * 00050001
000600*  MODULES IN THE ACCOUNTS PAYABLE SYSTEM:                      * 00060001
000700***************************************************************** 00070001
000800         10  AP300-INTER-APPL-COMMAREA REDEFINES                  00080001
000900             INTER-APPL-COMM-AREA.                                00090001
001000                                                                  00100001
001100             15  AP300-INTER-APPL-FORMAT-IND    PIC X(1).         00110001
001200                                                                  00120001
001300             15  AP300-KEY-DATA.                                  00130001
001400                 20  AP300-PO-NBR               PIC S9(09) COMP.  00140001
001500                 20  AP300-PO-LNE-NBR           PIC S9(09) COMP.  00150001
001600                 20  AP300-INVC-ID              PIC X(22).        00160001
001700                 20  AP300-PAYT-REQ-LNE-NBR     PIC S9(09) COMP.  00170001
001800                 20  AP300-REC-SEQ-NBR          PIC S9(09) COMP.  00180001
001900                 20  AP300-STORE-NBR            PIC S9(04) COMP.  00190001
002000                 20  AP300-PO-VER-NBR           PIC S9(09) COMP.  00200001
002100                 20  AP300-DEPT-NBR             PIC  X(03).       00210001
002200                 20  AP300-NET-INVC-AMT         PIC S9(11)V99     00220001
002300                                                          COMP-3. 00230001
002400                 20  AP300-INVC-TYP-CDE         PIC  X(02).       00240001
002500                 20  AP300-DC-NBR               PIC S9(04) COMP.  00250004
002501                 20  AP300-MTCH-LVL-IND         PIC  X(01).       00250103
002510                 20  FILLER                     PIC  X(63).       00251005
002600                                                                  00260001
002700             15  AP300-LIST-CRITERIA.                             00270001
002800                 20  AP300-DUN-NBR              PIC X(09).        00280001
002900                 20  AP300-INVC-STATUS          PIC X(02).        00290001
003000                 20  AP300-SELCTN-DTE           PIC X(10).        00300001
003100                                                                  00310001
003200             15  AP300-TS-SELECTION-DATA.                         00320001
003300                 20  AP300-SEL-QUEUE-NAME       PIC X(8).         00330001
003400*                    -- # OF INDIVIDUAL ITEMS:                    00340001
003500                 20  AP300-NUMBER-OF-SELECTED-ITEMS               00350001
003600                                                PIC S9(04) COMP.  00360001
003700*                    -- # OF TS QUEUE RECORDS:                    00370001
003800                 20  AP300-NUMBER-OF-TS-ITEMS   PIC S9(04) COMP.  00380001
003900             15  FILLER                         PIC X(44).        00390001
004000                                                                  00400001
