000100*----------------------------------------------------------------*02/07/96
000200*                         APWS354                                *APWS354 
000300*                                                                *   LV002
000400*   THIS IS THE TEMP-STORAGE QUEUE (RECORD LAYOUT) USED BY       *        
000500*   APKCS354 TO PASS SELECTED RECEIVER, PACKSLIP ROWS            *        
000600*                                                                *        
000700*----------------------------------------------------------------*        
000800                                                                          
000900 01  AP354-INVC-LIST-TS-RCRD.                                             
001000       05  AP354-SELECTED-ITEMS         PIC S9(05)  COMP-3                
001100                                                    VALUE ZERO.           
001200       05  AP354-MAX-ITEMS              PIC  9(02)  VALUE 8.         CL**2
001300       05  AP354-SELECTED-ITEM-ARRAY.                                     
001400           10  FILLER                   OCCURS 8 TIMES                    
001500                                        INDEXED BY AP354-IDX.             
001600               15  AP354-ITEM               PIC S9(09)  COMP-3.           
001700               15  AP354-TEMP-SELECTED-SW   PIC  X(01).                   
001800               15  AP354-SELECTED-SW        PIC  X(01).                   
001900                   88  AP354-SELECT              VALUE 'S'.               
002000                   88  AP354-DESELECT            VALUE ' '.               
002100               15  AP354-ACTION             PIC  X(01).                   
002200               15  AP354-STR-NBR            PIC  X(05).                   
002300               15  AP354-POLINE-NBR         PIC  X(04).                   
002400               15  AP354-ITM-POST-DLRS      PIC S9(07)V99                 
002500                                                COMP-3.                   
002600               15  AP354-FRT-POST-DLRS      PIC S9(07)V99                 
002700                                                COMP-3.                   
002800               15  AP354-FEE-POST-DLRS      PIC S9(07)V99                 
002900                                                COMP-3.                   
003000               15  AP354-TAX-POST-DLRS      PIC S9(07)V99                 
003100                                                COMP-3.                   
003200               15  AP354-DSC-POST-DLRS      PIC S9(07)V99                 
003300                                                COMP-3.                   
003400               15  AP354-GLACCT-NBR         PIC  X(07).                   
003500               15  AP354-ACCT-LOC           PIC  X(04).                   
