00001 ******************************************************************02/20/93
00002 **                        APWS361                               **APWS361 
00003 **                                                              **   LV009
00004 **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR THE       **   CL**5
00005 **  ADJUSTMENT JOURNAL ONLINE.                                  **   CL**2
00006 **  LENGTH:  200 BYTES                                          **APWS361 
00007 ******************************************************************APWS361 
00008          10  AP361-INTER-APPL-COMMAREA  REDEFINES                    CL**2
00009              INTER-APPL-COMM-AREA.                                APWS361 
                   15  AP361-INTER-APPL-FORMAT-IND    PIC X(01).                
                   15  AP361-KEY-DATA.                                          
                      20 AP361-VND-NBR                PIC X(09).                
                      20 AP361-PO-NUMB                PIC S9(09).               
                      20 AP361-ENT-DESC               PIC X(30).                
                      20 AP361-DOC-NO                 PIC X(16).                
                      20 AP361-DEPT                   PIC X(03).                
                      20 AP361-ACCT-NO                PIC X(07).                
                      20 AP361-TRN-CDE                PIC X(02).                
                      20 AP361-TRN-TYP                PIC X(02).                
                      20 AP361-STRT-DATE              PIC X(10).                
                      20 AP361-END-DATE               PIC X(10).                
                      20 AP361-DOC-DATE               PIC X(10).                
                   15  AP361-SELECTION-DATA.                                    
00011                 20 AP361-NUMBER-OF-SELECTED-ITEMS PIC S9(09)         CL**2
00012                                                        COMP-3.    APWS361 
00013                 20 AP361-NUMBER-OF-TS-ITEMS     PIC S9(05)           CL**8
00014                                                        COMP-3.       CL**8
00015                 20 AP361-SEL-QUEUE-NAME         PIC X(8).            CL**8
                      20 AP361-TS-QUEUE-NAME          PIC X(8).                 
00016              15  FILLER                         PIC X(067).          CL**9
