000100*----------------------------------------------------------------*00010009
000200*      THIS COPYBOOK IS A WORKING STORAGE AREA CONTAINING THE    *00020009
000300*      LINKAGE SECTION FOR CALLS TO DPKUP150                     *00030009
000310*----------------------------------------------------------------*00031009
000320* DATE 01/11/2011                                                *00032009
000330*  CHANGE MADE: IMPORT REPLENISHMENT PROJECT                     *00033009
000340*   ADDED THE FIELDS WS150-DC-NBR AND WS150-CL-NBR TO THE LAYOUT *00034009
000350*  MADE BY: KRYSTEN LEROY                 WR/IR#: WR38804        *00035009
000351*                                                                *00035112
000352* DATE 01/27/2011                                                *00035213
000353*  CHANGE MADE: IMPORT REPLENISHMENT PROJECT                     *00035312
000354*   REMOVED THE WS150-CL-NBR FIELD FROM THE LAYOUT AS IT WAS     *00035412
000355*   DETERMINED THAT INCLUDING CLASS IN THE PRORATION DOES NOT    *00035512
000356*   ADD EXTRA VALUE.                                             *00035612
000357*  MADE BY: KRYSTEN LEROY                 WR/IR#: INC1566554     *00035712
000360*----------------------------------------------------------------*00036009
000370 01  WS150-PRORATE-PARAMETERS.                                    00037009
000380     05  WS150-PO-NBR            PIC S9(09)  COMP.                00038009
000390     05  WS150-REC-SEQ-NBR       PIC S9(09)  COMP.                00039009
000400         88  WS150-PRORATE-TO-ALL-RCVRS      VALUE ZERO.          00040009
000500     05  WS150-STR-NBR           PIC S9(04)  COMP.                00050009
000600         88  WS150-PRORATE-TO-ALL-STORES     VALUE ZERO.          00060009
000700     05  WS150-DC-NBR            PIC S9(04)  COMP.                00070009
000800         88  WS150-PRORATE-TO-ALL-DCS        VALUE ZERO.          00080009
001030     05  WS150-PO-LNE-NBR        PIC S9(09)  COMP.                00103009
001040         88  WS150-PRORATE-TO-ALL-LINES      VALUE ZERO.          00104009
001050     05  WS150-PRORATE-BASIS     PIC  X(1).                       00105009
001060         88  WS150-BASE-ON-COST              VALUE 'C'.           00106009
001070         88  WS150-BASE-ON-RETAIL            VALUE 'R'.           00107009
001080         88  WS150-BASE-ON-QUANTITY          VALUE 'Q'.           00108009
001090     05  WS150-PRORATE-LEVEL     PIC  X(1).                       00109009
001100         88  WS150-MAJOR-CLASS               VALUE '1'.           00110009
001200         88  WS150-SUB-CLASS                 VALUE '2'.           00120009
001300         88  WS150-SKU                       VALUE '3'.           00130009
001400     05  WS150-RETURN-CODE       PIC  X(1).                       00140009
001500         88  WS150-SUCCESSFUL                VALUE '1'.           00150009
001600         88  WS150-ERRORS-FOUND              VALUE '2'.           00160009
