00001      EJECT                                                        06/08/94
00002 ***************************************************************** APWS301 
00003 *                        A P W S 3 0 1                          *    LV015
00004 ***************************************************************** APWS301 
00005 *  THIS COPYBOOK CONTAINS THE COMMON DATA TO BE SHARED BY THESE *    CL**2
00006 *  MODULES IN THE ACCOUNTS PAYABLE SYSTEM WHEN LIST INFORMATION *    CL*11
00007 *  IS PASSED.                                                   *    CL*11
00008 ***************************************************************** APWS301 
00009  01  AP301-INVC-LIST-TS-RCRD.                                        CL*10
00010      05  AP301-SELECTED-ITEMS               PIC S9(5) VALUE ZERO     CL*14
00011                                                  COMP-3.             CL*14
00012      05  AP301-MAX-ITEMS                    PIC 9(2)  VALUE 20.      CL*14
00013      05  AP301-SELECTED-ITEM-ARRAY.                                  CL*10
00014          10  FILLER                         OCCURS 20 TIMES          CL*10
00015                                             INDEXED BY AP301-IDX.    CL*10
00016                                                                      CL*10
00017              15  AP301-ITEM                 PIC S9(09) COMP-3.       CL*13
00018              15  AP301-ACTION-SW            PIC X(01).               CL*13
00019                  88  AP301-INQ                        VALUE 'I'.     CL*10
00020                  88  AP301-UPD                        VALUE 'U'.     CL*10
00021                  88  AP301-DEL                        VALUE 'D'.     CL*10
00022                  88  AP301-ERR                        VALUE 'E'.     CL*10
00023              15  AP301-PO-NBR               PIC S9(09) COMP.         CL*13
00024              15  AP301-INVC-ID              PIC X(22).               CL*10
00025              15  AP301-STORE-NBR            PIC S9(04) COMP.         CL*13
00026              15  AP301-PO-LNE-NBR           PIC S9(09) COMP.         CL*13
00027              15  AP301-PAYT-REQ-LNE-NBR     PIC S9(09) COMP.         CL*15
