      *----------------------------------------------------------------*        
      *      THIS COPYBOOK IS A WORKING STORAGE AREA CONTAINING THE    *        
      *      LINKAGE SECTION FOR CALLS TO DPKUP151                     *        
      *----------------------------------------------------------------*        
       01  WS364-DOC-NBR-PARAMETERS.                                            
           05  WS364-NEXT-DOC-NBR          PIC   X(16).                         
           05  WS364-VENDOR-NBR            PIC   X(09).                         
           05  WS364-SQLCODE               PIC  S9(09) COMP.                    
           05  WS364-ERROR-MESSAGE         PIC   X(79).                         
           05  WS364-RETURN-CODE           PIC   X(1).                          
               88  WS364-SUCCESSFUL-CALL                VALUE '1'.              
               88  WS364-ERRORS-FOUND                   VALUE '2'.              
           05  FILLER                      PIC   X(41).                         
