000100*-------------------------------------------------------------*   00010004
000200*    THIS COPYBOOK IS THE WORKING STORAGE FOR THE             *   00020005
000300*    ALLOWANCE/CHARGE CALCULATIONS (APPD052).                 *   00030005
000400*  NOTE:  IF THE VALUES OF FREIGHT CODES NEED TO CHANGE,      *   00040005
000500*         CHECK FOR CORRESPONDING CHANGES IN THE SELECTION    *   00050005
000600*         CRITERIA OF APPD053'S SQL CALLS.                    *   00060005
000700*                                                             *   00070013
000800*USED IN APKCS330 APKUP050 APKUP230 APKUP250 APKUP253 APKUT020*   00080014
000900*        APKUT064                                             *   00090017
001000* 09/25/2002 - MODIFIED ALL OF THE AMOUNT FIELDS FROM 9(7)V99 *   00100013
001100*              TO S9(9)V99 COMP-3.  THIS WAS DONE TO CORRECT  *   00110013
001200*              A DISCOUNT BALANCING ISSUE.  THIS ALSO BRINGS  *   00120013
001300*              THE AMOUNT FIELDS UP TO CURRENT STANDARD DEFNS.*   00130013
001400*              CHANGED BY: MIKE BESKE       WR# 22902         *   00140013
001500*                                                             *   00150013
001600* DATE  03/25/2003                                            *   00160017
001700*     CHANGE MADE: ADDED VENDOR 'CITIZEN WATCHES', VENDOR     *   00170017
001800*     NUMBER 078822863, TO APPD052-INS-VENDOR 88 LEVEL FIELD. *   00180017
001900*     MADE BY: KEVIN CATLIN            WR/IR #: WR24481       *   00190017
002000*                                                             *   00200018
002100* DATE  01/30/2004                                            *   00210018
002200*     CHANGE MADE: CREATED A NEW 88 LEVEL FOR INSURANCE CHARGE*   00220018
002300*     CODES 'INS' AND '445'. THIS 88 FIELD WILL BE REFERENCED *   00230018
002400*     IN APPD052 WHEN PROCESSING APPD052-DNP-MISC CHARGES.    *   00240018
002500*     TWO VENDORS (ANDEL JEWELRY '117498121' & CITIZEN WATCH  *   00250018
002600*     '078822863') ARE EXEMPT FROM THE NORMAL PROCESS OF      *   00260018
002700*     CHARGING BACK INSURANCE CHARGES.  CITIZEN WATCH WAS     *   00270018
002800*     NOT BEING PROCESSED CORRECTLY BECAUSE ONLY 'INS' WAS    *   00280019
002900*     BEING CHECKED, NOT '445'. CITIZEN WATCH HAS ONLY SENT   *   00290018
003000*     '445' CODES AS OF THIS CHANGE DATE. ANDEL JEWELRY HAS   *   00300018
003100*     ONLY SENT 'INS' CODES AS OF THIS CHANGE DATE.           *   00310018
003200*     MADE BY: MIKE BESKE              WR/IR #: P000628860    *   00320018
003201*                                                             *   00320120
003210* DATE  03/17/2005                                            *   00321020
003220*     CHANGE MADE: E-COMM DIRECT TO CONSUMER PROJECT          *   00322020
003230*     ADDED FIELDS APPRD052-CD-GIFT-WRAP-AMT AND              *   00323020
003240*     APPRD052-CD-HANDLING-AMT TO LAYOUT.  ALSO ADDED 88      *   00324020
003250*     LEVELS APPD052-CD-GIFT-WRAP AND APPD052-CD-HANDLING     *   00325020
003260*     UNDER APPD052-CHARGE-CODES.                             *   00326020
003293*     MADE BY: KRYSTEN LEARY           WR/IR #: WR28461       *   00329320
003294*                                                             *   00329421
003295* DATE  04/13/2005                                            *   00329522
003296*     CHANGE MADE: OFF-INVOICE CO-OP ADVERTISING ALLOWANCES   *   00329621
003297*     ADDED FIELDS APPD052-COOP-ADV-ALLOW-AMT,                *   00329721
003298*     APPD052-COOP-ADV-ALLOW, AND APPD052-COOP-ADV-ALLOW-PCT  *   00329821
003299*     TO LAYOUT.                                              *   00329921
003301*     MADE BY: KRYSTEN LEARY           WR/IR #: WR28651       *   00330121
003302* DATE  03/13/2006                                            *   00330227
003303*     CHANGE MADE: ADDED MISC DISCOUNT AND PERCENTAGE FIELDS, *   00330326
003304*     ALONG WITH PROFIT ASSISTANCE/ADD COOP.  ADDED TWO 88    *   00330426
003305*     LEVELS FOR CHARGE CODES APPD052-PRFT-ASST-COOP,         *   00330526
003306*     APPD052-TRADE-DISCOUNT                                  *   00330626
003307*     MADE BY: GREG WISIALOWSKI        WR/IR #: WR26790       *   00330727
003302* DATE  03/15/2024                                            *   00330829
003303*     CHANGE MADE: ADDED PEPSI - BOTTLE DEPOSIT & SUGAR TAX   *   00330929
003307*     MADE BY: JEAN KURK               WR/IR #: CHG0301938    *   00331029
003310*-------------------------------------------------------------*   00332021
003400                                                                  00340018
003500 01  APPD052-WS-AREA.                                             00350018
003600     05  APPD052-CONSTANTS.                                       00360018
003700         10  APPD052-ALLOWANCE          PIC X        VALUE 'A'.   00370018
003800         10  APPD052-CHARGE             PIC X        VALUE 'C'.   00380018
003900     05  APPD052-VARIABLES.                                       00390018
004000         10  APPD052-CHARGE-CODES       PIC X(03)    VALUE SPACES.00400018
004100             88  APPD052-NEW-STORE    VALUES 'NSD', 'NSA'.        00410018
004200             88  APPD052-MOS-DISCOUNT VALUES 'MOS'.               00420018
004300             88  APPD052-ADV-DISCOUNT VALUES 'ADV'.               00430018
004400             88  APPD052-FREIGHT      VALUES '400', 'FFC', 'PAB', 00440018
004500                                             'SAB', 'PST', 'UUC'. 00450018
004600             88  APPD052-DNP-MISC     VALUES '445', 'INS', 'MSG', 00460018
004700                                      'SST', 'TTL', 'TTS', 'HHB'. 00470018
004800             88  APPD052-INSURANCE-EXCEPTION                      00480018
004900                                      VALUES '445', 'INS'.        00490018
004910             88  APPD052-CD-GIFT-WRAP VALUES 'CDG'.               00491020
004920             88  APPD052-CD-HANDLING  VALUES 'CDH'.               00492020
004930             88  APPD052-COOP-ADV-ALLOW  VALUES 'COP'.            00493021
004940             88  APPD052-TRADE-DISCOUNT  VALUES 'TRD'.            00494025
004950             88  APPD052-PRFT-ASST-COOP  VALUES 'ALW'.            00495025
004950             88  APPD052-BOTTLE-DEPOSIT  VALUES 'HHB'.            00496029
004950             88  APPD052-SUGAR-TAX       VALUES 'TTS'.            00497029
005000         10  APPD052-CALC-AREA.                                   00500018
005100             15  APPD052-ALW-CHRG-AMT   PIC S9(9)V99 VALUE ZEROES 00510018
005200                                                        COMP-3.   00520018
005300             15  APPD052-ALW-CHRG-PCT   PIC 999V99   VALUE ZEROES.00530018
005400         10  APPD052-INVOICE-AMT-AREA.                            00540018
005500             15  APPD052-GROSS-INVOICE-COST                       00550018
005600                                        PIC S9(9)V99 VALUE ZEROES 00560018
005700                                                        COMP-3.   00570018
005800             15  APPD052-ALLOWANCE-AMT  PIC S9(9)V99 VALUE ZEROES 00580018
005900                                                        COMP-3.   00590018
006000             15  APPD052-NEW-STORE-AMT  PIC S9(9)V99 VALUE ZEROES 00600018
006100                                                        COMP-3.   00610018
006200             15  APPD052-TRADE-AMT      PIC S9(9)V99 VALUE ZEROES 00620018
006300                                                        COMP-3.   00630018
006400             15  APPD052-MOS-DISC-AMT   PIC S9(9)V99 VALUE ZEROES 00640018
006500                                                        COMP-3.   00650018
006600             15  APPD052-ADV-DISC-AMT   PIC S9(9)V99 VALUE ZEROES 00660018
006700                                                        COMP-3.   00670018
006710             15  APPD052-COOP-ADV-ALLOW-AMT                       00671024
006711                                      PIC S9(9)V99 VALUE ZEROES   00671124
006712                                                        COMP-3.   00671224
006716             15  APPD052-PRFT-ASST-COOP-AMT                       00671625
006717                                      PIC S9(9)V99 VALUE ZEROES   00671725
006718                                                        COMP-3.   00671825
006719             15  APPD052-MISC-DISC-AMT                            00671925
006720                                      PIC S9(9)V99 VALUE ZEROES   00672025
006730                                                        COMP-3.   00673025
006800         10  APPD052-CHARGES.                                     00680018
006900             15  APPD052-FREIGHT-CHARGES                          00690018
007000                                        PIC S9(9)V99 VALUE ZEROES 00700018
007100                                                        COMP-3.   00710018
007200             15  APPD052-DNP-CHARGES    PIC S9(9)V99 VALUE ZEROES 00720018
007300                                                        COMP-3.   00730018
007400             15  APPD052-MISC-CHARGES   PIC S9(9)V99 VALUE ZEROES 00740018
007500                                                        COMP-3.   00750018
007600             15  APPD052-VENDOR-FRT-AMT PIC S9(9)V99 VALUE ZEROES 00760018
007700                                                        COMP-3.   00770018
007710             15  APPD052-CD-GIFT-WRAP-AMT  PIC S9(9)V99           00771020
007720                                              VALUE ZEROES COMP-3.00772020
007730             15  APPD052-CD-HANDLING-AMT   PIC S9(9)V99           00773020
007740                                              VALUE ZEROES COMP-3.00774020
007730             15  APPD052-BOTTLE-DEP-AMT    PIC S9(9)V99           00775029
007740                                              VALUE ZEROES COMP-3.00776029
007800         10  APPD052-PERCENTS.                                    00780018
007900             15  APPD052-NEW-STORE-DISC-PCT                       00790018
008000                                        PIC 9(3)V99  VALUE ZEROES.00800018
008100             15  APPD052-TRADE-DISC-PCT PIC 9(3)V99  VALUE ZEROES.00810018
008200             15  APPD052-MOS-DISC-PCT   PIC 9(3)V99  VALUE ZEROES.00820018
008300             15  APPD052-ADV-DISC-PCT   PIC 9(3)V99  VALUE ZEROES.00830018
008400             15  APPD052-CALC-FRT-PCT   PIC 9V9(4)   VALUE ZEROES.00840018
008410             15  APPD052-COOP-ADV-ALLOW-PCT  PIC 9(3)V99          00841023
008420                                                 VALUE ZEROES.    00842023
008430             15  APPD052-PRFT-ASST-COOP-PCT  PIC 9(3)V99          00843025
008440                                                 VALUE ZEROES.    00844025
008450             15  APPD052-MISC-DISC-PCT       PIC 9(3)V99          00845025
008460                                                 VALUE ZEROES.    00846025
008500         10  APPD052-VENDOR-EXCEPTION   PIC X(09)    VALUE SPACES.00850018
008600             88  APPD052-INS-VENDOR     VALUES      '117498121',  00860018
008700                                                    '078822863'.  00870018
008600             88  APPD052-PEPSI          VALUES      '118441806'.  00880029
