00001 *----------------------------------------------------------------*01/02/96
00002 *                         APWS356                                *RCW00007
00003 *                                                                *   LV013
00004 *   THIS IS THE TEMP-STORAGE QUEUE (RECORD LAYOUT) USED BY       *RCW00007
00005 *   APKCS356.                                                     RCW00007
00006 *                                                                *RCW00007
00007 *----------------------------------------------------------------*RCW00007
00008                                                                   RCW00007
00009  01  AP356-SELECTED-LINES.                                        RCW00007
00010        05  AP356-SELECTED-ITEMS         PIC S9(05)  COMP-3        RCW00007
00011                                                     VALUE ZERO.   RCW00007
00012        05  AP356-MAX-ITEMS              PIC  9(03)  VALUE 20.     RCW00007
00013        05  AP356-SELECTED-ITEM-ARRAY.                             RCW00007
00014            10  FILLER                   OCCURS 20 TIMES              CL**9
00015                                         INDEXED BY AP356-IDX.     RCW00007
00016                15  AP356-ITEM           PIC S9(09)  COMP-3.       RCW00007
00017                15  AP356-ACTION-SW      PIC  X(03).                  CL*11
00018                    88  AP356-INQ                  VALUE 'INQ'.       CL*11
00022                    88  AP356-ERR                  VALUE 'ERR'.       CL*11
00033                15  AP356-PO-NBR               PIC S9(10) COMP-3.     CL**7
00035                15  AP356-INVC-NBR             PIC  X(22).            CL**2
