00001 *----------------------------------------------------------------*02/17/93
00002 *                         APWS362                                *APWS362 
00003 *                                                                *   LV007
00004 *   THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE *APWS362 
00005 *   MAINTENANCE PROGRAMS TO PASS THE ADJUSTMENT JOURNAL KEY.     *APWS362 
00006 *                                                                *APWS362 
00007 *----------------------------------------------------------------*APWS362 
00008                                                                   APWS362 
00009  01  AP362-ADJUSTMENT-SEL-REC.                                       CL**4
00010        05  AP362-SELECTED-ITEMS         PIC S9(05)  COMP-3           CL**2
00011                                                     VALUE ZERO.      CL**2
00012        05  AP362-MAX-ITEMS              PIC  9(02)  VALUE 20.        CL**2
00013        05  AP362-SELECTED-ITEM-ARRAY.                                CL**6
00014            10  FILLER                   OCCURS 20 TIMES              CL**6
00015                                         INDEXED BY AP362-IDX.        CL**2
00016                15  AP362-ITEM           PIC S9(09)  COMP-3.          CL**7
00017                15  AP362-ACTION-SW      PIC  X(01).                  CL**6
00018                    88  AP362-INQ                    VALUE 'I'.       CL**6
00019                    88  AP362-UPD                    VALUE 'U'.       CL**6
00020                    88  AP362-DEL                    VALUE 'D'.       CL**6
00021                    88  AP362-ERR                    VALUE 'E'.       CL**6
00023                15  AP362-VND-NBR    PIC  X(09).                      CL**6
                     15  AP362-DOC-NO     PIC  X(16).                           
                     15  AP362-TRN-CDE    PIC  X(02).                           
                     15  AP362-DOC-DTE    PIC  X(10).                           
