00001      EJECT                                                        11/01/95
00002 ***************************************************************** APWS302 
00003 *                        A P W S 3 0 2                          *    LV001
00004 ***************************************************************** APWS302 
00005 *  THIS COPYBOOK CONTAINS THE COMMON DATA TO BE SHARED FOR      * APWS302 
00006 *  VENDOR CONTROL SPECIFICATION IN THE AP SYSTEM:               * APWS302 
00007 ***************************************************************** APWS302 
00008          10  AP302-INTER-APPL-COMMAREA REDEFINES                  APWS302 
00009              INTER-APPL-COMM-AREA.                                APWS302 
00010                                                                   APWS302 
00011              15  AP302-INTER-APPL-FORMAT-IND    PIC X(1).         APWS302 
00012                                                                   APWS302 
00013              15  AP302-KEY-DATA.                                  APWS302 
00014                  20  AP302-DUN-NBR              PIC X(09).        APWS302 
00015                  20  AP302-DEPT-NBR             PIC X(03).        APWS302 
00016              15  FILLER                         PIC X(187).       APWS302 
00017                                                                   APWS302 
