*          DATA SET ARKM000    AT LEVEL 001 AS OF 12/10/88                      
*********************************************************************** 00001   
*       THIS IS THE MAPSET FOR THE MAIN MENU OF THE ACCOUNTS RECEIVABLE 00002*36
*  EMPLOYEE DISCOUNT SYSTEM (ARKCS000 - A000).                          00003*36
*                                                                       00004*36
*       THE FIRST BYTE OF THE MAP IS LEFT BLANK FOR THE FORMFEED        00005*36
*  CHARACTER.                                                           00006*36
*********************************************************************** 00007*36
        PRINT NOGEN                                                     00008*23
ARKM000 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES               00009*26
AR000A  DFHMDI SIZE=(24,80),CTRL=(FREEKB,FRSET),LINE=1,COLUMN=1,       X00010*36
               MAPATTS=HILIGHT,DSATTS=HILIGHT                           00011*37
        DFHMDF POS=(1,2),LENGTH=8,ATTRB=(ASKIP,BRT),                   X00012*36
               INITIAL='ARKCS000'                                       00013*36
        DFHMDF POS=(1,18),LENGTH=45,ATTRB=(ASKIP,BRT),                 X00014*36
               INITIAL='K O H L S   D E P A R T M E N T   S T O R E S'  00015*36
ADATE   DFHMDF POS=(1,71),LENGTH=8,ATTRB=(ASKIP,BRT)                    00016*36
ATERM   DFHMDF POS=(2,2),LENGTH=4,ATTRB=(ASKIP,BRT)                     00017*36
        DFHMDF POS=(2,27),LENGTH=26,ATTRB=(ASKIP,BRT),                 X00018*38
               INITIAL='ACCOUNTS RECEIVABLE SYSTEM'                     00019*36
ATIME   DFHMDF POS=(2,74),LENGTH=5,ATTRB=(ASKIP,BRT)                    00020*40
        DFHMDF POS=(3,27),LENGTH=27,ATTRB=(ASKIP,BRT),                 X00021*38
               INITIAL='EMPLOYEE DISCOUNT MAIN MENU'                    00022*36
        DFHMDF POS=(5,2),LENGTH=10,ATTRB=(ASKIP,BRT),                  X00023*43
               INITIAL='SELECTION:'                                     00024*28
ASEL    DFHMDF POS=(5,13),LENGTH=2,ATTRB=UNPROT,HILIGHT=UNDERLINE       00025*43
        DFHMDF POS=(5,16),LENGTH=10,ATTRB=ASKIP                         00026*43
        DFHMDF POS=(5,32),LENGTH=15,ATTRB=(ASKIP,BRT),                 X00031**2
               INITIAL='ACCOUNT NUMBER:'                                00032*43
AACCT   DFHMDF POS=(5,48),LENGTH=10,ATTRB=UNPROT,HILIGHT=UNDERLINE      00033**2
        DFHMDF POS=(5,59),LENGTH=16,ATTRB=ASKIP                         00034**2
        DFHMDF POS=(8,22),LENGTH=25,                                   X00039**2
               INITIAL='1 - EMPLOYEE ACCOUNT LIST'                      00040*40
        DFHMDF POS=(9,22),LENGTH=25,                                   X00039**2
               INITIAL='2 - EMPLOYEE DISC MAINT  '                      00040*40
        DFHMDF POS=(23,1),LENGTH=10,ATTRB=(ASKIP,BRT),                 X00061*42
               INITIAL='PF3 = EXIT'                                     00062*22
AMSG    DFHMDF POS=(24,1),LENGTH=79,ATTRB=(ASKIP,BRT)                   00063*41
        DFHMSD TYPE=FINAL                                               00064**5
        PRINT NOGEN                                                     00065*23
        END                                                             00066*14
