000100******************************************************************00010005
000200 IDENTIFICATION DIVISION.                                         00020005
000300******************************************************************00030005
000400                                                                  00040005
000500 PROGRAM-ID.             ARKUT120.                                00050005
000600 AUTHOR.                 ACCENTURE.                               00060005
000700 INSTALLATION.           KOHLS DEPARTMENT STORES.                 00070005
000800 DATE-WRITTEN            06-29-2016.                              00080005
000900 DATE-COMPILED.                                                   00090005
001000                                                                  00100005
001100******************************************************************00110005
001200* 07/21/2016 ACCENTURE    CHG0146923                              00120005
001210* -  THIS MODULE IS A COPY OF ARKUT100.                           00130005
001211*    IT WILL EXTRACT CARDMASTER MST DATA FROM FD INPUT            00140005
001212*    FILE. THIS PROGRAM WILL SUPPORT EVOC MDM PROJECT.            00150005
FD1704******************************************************************00160005
FD1704* 04/21/2017  COGNIZANT   CHG0166796                              00170005
FD1704* - ADDED NEW FIELDS AS A PART OF APR'17 RELEASE                  00180005
FD1704* - CHANGES ARE TAGGED WITH FD1704                                00190005
FD1704******************************************************************00200005
FDBARB* 02/21/2018  BARB SCHULTZ CHG0190592                             00210005
FDBARB* - ADDED NEW HISTORY FIELDS TO THE END OF THE RECORD             00220005
FDBARB* - INCREASED THE SIZE OF THE FILE FROM 6046 TO 6070              00230005
FDBARB* - VALIDATED THE HISTORY FIELDS FROM THE COMBINED CARDHOLDER     00240005
FDBARB*   MASTER AND FLAP FILE (095) DATED OCTOBER, 2017                00250005
FD1801* - MOVE AR69-ANNL-FEE-REVERSED-CD TO AR97-ANNL-FEE-REVERSED-CD   00260005
001300******************************************************************00260106
C25106* 06/04/2019  BARB SCHULTZ CHG0225106                             00261013
C25106* - ADDED RECORD VARYING AND DEPENDING ON STATEMENT IN FD OF THE  00262013
C25106*   CARD MASTER FILE.                                             00263013
001300******************************************************************00270005
003500 ENVIRONMENT DIVISION.                                            00280005
003600******************************************************************00290005
003700                                                                  00300005
003800 CONFIGURATION SECTION.                                           00310005
003900                                                                  00320005
004000 SOURCE-COMPUTER.        IBM-3090.                                00330005
004100 OBJECT-COMPUTER.        IBM-3090.                                00340005
004200                                                                  00350005
004300 INPUT-OUTPUT SECTION.                                            00360005
004400                                                                  00370005
004500 FILE-CONTROL.                                                    00380005
004600                                                                  00390005
004700     SELECT CARD-MASTER-IN-FILE                                   00400005
004800         ASSIGN TO INP01.                                         00410005
004900                                                                  00420005
005000     SELECT CARD-MASTER-OUT-FILE                                  00430005
005100         ASSIGN TO CARDOUT.                                       00440005
005200                                                                  00450005
005600******************************************************************00460005
005700 DATA DIVISION.                                                   00470005
005800******************************************************************00480005
005900                                                                  00490005
006000 FILE SECTION.                                                    00500005
006100                                                                  00510005
006200 FD CARD-MASTER-IN-FILE                                           00520005
006300     RECORDING MODE V                                             00530005
006400     LABEL RECORDS ARE STANDARD                                   00540005
006500     BLOCK CONTAINS 0 RECORDS                                     00550006
C25106     RECORD VARYING FROM 120 TO 23548                             00560013
C25106     DEPENDING ON PV-IN-REC-LENGTH                                00561013
C25106     DATA RECORD IS IN-MASTER-RECORD.                             00562013
006600                                                                  00563006
006700 01 IN-MASTER-RECORD.                                             00570005
006800    05 IN-MASTER-RECORD-ID          PIC X(6).                     00580005
006900       88  IN-MSTR-RECORD           VALUE "01MST1"                00590005
007000                                          "01MST2"                00600005
007100                                          "01MST3"                00610005
007200                                          "01MST4".               00620005
007300       88  IN-FLAP-RECORD           VALUE "02FLAP".               00630005
007400       88  IN-BFLP-RECORD           VALUE "03BFLP".               00640005
007500       88  IN-MTHO-RECORD           VALUE "04MTHO".               00650005
007600       88  IN-CHKP-RECORD           VALUE "05CHKP".               00660005
007700       88  IN-CIT-RECORD            VALUE "12CIT ".               00670005
007800       88  IN-DSPT-RECORD           VALUE "10DSPT".               00680005
007900    05 IN-MASTER-RECORD-SQNC-CT     PIC S9(7)V      COMP-3.       00690005
008000    05 FILLER                       PIC X(16326).                 00700005
008100    05 FILLER                       PIC X(7212).                  00710005
008200                                                                  00720005
008300 FD CARD-MASTER-OUT-FILE                                          00730010
008400     RECORDING MODE IS F                                          00740005
008500     BLOCK CONTAINS 0 RECORDS                                     00750005
008600     LABEL RECORDS ARE STANDARD.                                  00760005
FDBARB 01  CARD-MASTER-OUT-REC             PIC X(6070).                 00770010
008800                                                                  00780005
009600 WORKING-STORAGE SECTION.                                         00790005
009700******************************************************************00800005
009800*                        ABEND CODES                              00810005
009900******************************************************************00820005
010000     COPY ARWS052.                                                00830005
010100                                                                  00840005
010200******************************************************************00850005
010300*                        SWITCHES                                 00860005
010400******************************************************************00870005
010500 01 PS-PROGRAM-SWITCHES.                                          00880005
010600    05 PS-PROCESSING-SW               PIC X      VALUE SPACES.    00890005
010700       88 PS-CONTINUE-PROCESSING                 VALUE 'Y'.       00900005
010800       88 PS-STOP-PROCESSING                     VALUE 'N'.       00910005
010900                                                                  00920005
011000******************************************************************00930005
011100*                        CONSTANTS                                00940005
011200******************************************************************00950005
011300 01 PC-PROGRAM-CONSTANTS.                                         00960005
011400    05 PC-PROGRAM-NAME                PIC X(8)   VALUE 'ARKUT120'.00970005
011500                                                                  00980005
011600******************************************************************00990005
011700*                        VARIABLES                                01000005
011800******************************************************************01010005
011900 01 PV-PROGRAM-VARIABLES.                                         01020005
012000    05 PV-SUB                         PIC S9(9)  VALUE ZEROES     01030005
012100                                                 COMP.            01040005
FDBARB    05 PV-SUB-1                       PIC S9(9)  VALUE ZEROES     01050005
FDBARB                                                 COMP.            01060005
012200    05 PV-READ-COUNT                  PIC S9(9)  VALUE ZEROES     01070005
012300                                                 COMP.            01080005
012400    05 PV-MSTR-COUNT                  PIC S9(9)  VALUE ZEROES     01090005
012500                                                 COMP.            01100005
012600    05 PV-MTHO-COUNT                  PIC S9(9)  VALUE ZEROES     01110005
012700                                                 COMP.            01120005
012800    05 PV-FLAP-COUNT                  PIC S9(9)  VALUE ZEROES     01130005
012900                                                 COMP.            01140005
013600    05 PV-BTCH-DATE.                                              01150005
013700       10 PV-BTCH-DATE-YYYY           PIC 9(04)  VALUE ZEROS.     01160005
013800       10 PV-BTCH-DATE-MM             PIC 9(02)  VALUE ZEROS.     01170005
013900       10 PV-BTCH-DATE-DD             PIC 9(02)  VALUE ZEROS.     01180005
014000    05 PV-BTCH-NBR.                                               01190005
014100       10 PV-BTCH-SEQ-NBR             PIC 9(1)   VALUE ZERO.      01200005
014200       10 PV-BTCH-MM                  PIC 9(2)   VALUE ZEROS.     01210005
014300       10 PV-BTCH-DD                  PIC 9(2)   VALUE ZEROS.     01220005
014400    05 PV-PREV-PRIN                   PIC X(4)   VALUE SPACES.    01230005
014410    05 PV-POST-DATA                   PIC S9(12) VALUE ZEROES     01240005
014420                                                 COMP-3.          01250005
C25106    05 PV-IN-REC-LENGTH               PIC 9(5)   VALUE ZEROS.     01260013
014500                                                                  01261006
014600 01 WS-EDIT-FIELDS.                                               01270005
014700    05 WS-I                           PIC  9(3)  VALUE 0.         01280005
014800    05 WS-EDIT-N1                     PIC  9(1).                  01290005
014900    05 WS-EDIT-S1                     PIC +9(1).                  01300005
015000    05 WS-EDIT-S2                     PIC +9(2).                  01310005
015100    05 WS-EDIT-S3                     PIC +9(3).                  01320005
015200    05 WS-EDIT-S4                     PIC +9(4).                  01330005
015300    05 WS-EDIT-N4                     PIC  9(4).                  01340005
015400    05 WS-EDIT-S5                     PIC +9(5).                  01350005
015410    05 WS-EDIT-N5                     PIC  9(5).                  01360005
015500    05 WS-EDIT-S6                     PIC +9(6).                  01370005
015600    05 WS-EDIT-S7                     PIC +9(7).                  01380005
015700    05 WS-EDIT-N7                     PIC  9(7).                  01390005
015800    05 WS-EDIT-S8                     PIC +9(8).                  01400005
015900    05 WS-EDIT-N8                     PIC  9(8).                  01410005
016000    05 WS-EDIT-S9                     PIC +9(9).                  01420005
016010    05 WS-EDIT-N9                     PIC  9(9).                  01430005
016100    05 WS-EDIT-S10                    PIC +9(10).                 01440005
016200    05 WS-EDIT-S11                    PIC +9(11).                 01450005
016300    05 WS-EDIT-S12                    PIC +9(12).                 01460005
016310    05 WS-EDIT-N12                    PIC  9(12).                 01470005
016400    05 WS-EDIT-S13                    PIC +9(13).                 01480005
016500    05 WS-EDIT-S14                    PIC +9(14).                 01490005
016600    05 WS-EDIT-S15                    PIC +9(15).                 01500005
016700    05 WS-EDIT-S16                    PIC +9(16).                 01510005
016800    05 WS-EDIT-S17                    PIC +9(17).                 01520005
016900    05 WS-EDIT-S18                    PIC +9(18).                 01530005
017000    05 WS-EDIT-S19                    PIC +9(19).                 01540005
017100    05 WS-EDIT-N5V99                  PIC  9(05).99.              01550005
017200    05 WS-EDIT-N7V99                  PIC  9(07).99.              01560005
017300    05 WS-EDIT-N8V99                  PIC  9(08).99.              01570005
017400    05 WS-EDIT-S1V99                  PIC +9(1).99.               01580005
017500    05 WS-EDIT-S3V99                  PIC +9(3).99.               01590005
017600    05 WS-EDIT-S5V99                  PIC +9(5).99.               01600005
017700    05 WS-EDIT-SV999                  PIC +.999.                  01610005
017800    05 WS-EDIT-S2V999                 PIC +9(2).999.              01620005
017900    05 WS-EDIT-S4V999                 PIC +9(4).999.              01630005
018000    05 WS-EDIT-S10V99                 PIC +9(10).99.              01640005
018100    05 WS-EDIT-S13V99                 PIC +9(13).99.              01650005
018200    05 WS-EDIT-S11V99                 PIC +9(11).99.              01660005
018300    05 WS-EDIT-S15V99                 PIC +9(15).99.              01670005
018400    05 WS-EDIT-S16V99                 PIC +9(16).99.              01680005
018500    05 WS-EDIT-S17V99                 PIC +9(17).99.              01690005
018600    05 WS-EDIT-S13V94                 PIC +9(13).9999.            01700005
018700    05 WS-EDIT-S11V94                 PIC +9(11).9999.            01710005
018800    05 WS-EDIT-S3V94                  PIC +9(3).9999.             01720005
018900    05 WS-EDIT-SV95                   PIC +.99999.                01730005
019000    05 WS-EDIT-S1V94                  PIC +9.9999.                01740005
019100    05 WS-EDIT-S9V96                  PIC +9.999999.              01750005
019200    05 WS-EDIT-SV97                   PIC +.9999999.              01760005
019210    05 WS-EDIT-S2V95                  PIC +99.99999.              01770005
019300******************************************************************01780005
019400*                        COPYBOOKS                                01790005
019500******************************************************************01800005
019600                                                                  01810005
019700******************************************************************01820005
019800* FD COMBINED CARDHODLER MASTER LAYOUT - VARIABLE FORMAT (INPUT)  01830005
019900******************************************************************01840005
020000     COPY ARRD069.                                                01850005
020100                                                                  01860005
020200******************************************************************01870005
020300* FD MSTR RECORD LAYOUT - FIXED FORMAT (OUTPUT)                   01880005
020400******************************************************************01890005
020500     COPY ARRD097.                                                01900005
020600                                                                  01910005
020700******************************************************************01920005
020800* FD METHOD OVERRIDE LAYOUT - VARIABLE FORMAT (INPUT)             01930005
020900******************************************************************01940005
021000*    COPY ARRD071.                                                01950005
021100                                                                  01960005
021200******************************************************************01970005
021300* FD METHOD OVERRIDE LAYOUT - FIXED FORMAT (OUTPUT)               01980005
021400******************************************************************01990005
021500*    COPY ARRD072.                                                02000005
021600                                                                  02010005
021610******************************************************************02020005
021620* FD FLAP PROMO FILE LAYOUT - VARIABLE FORMAT (INPUT)             02030005
021630******************************************************************02040005
021640*    COPY ARRD093.                                                02050005
021650                                                                  02060005
021660******************************************************************02070005
021670* FD FLAP PROMO FILE LAYOUT - FIXED FORMAT (OUTPUT)               02080005
021680******************************************************************02090005
021690*    COPY ARRD094.                                                02100005
021700******************************************************************02110005
021800 PROCEDURE DIVISION.                                              02120005
021900******************************************************************02130005
022000*--------------*                                                  02140005
022100 0000-MAINLINE.                                                   02150005
022200*--------------*                                                  02160005
022300                                                                  02170005
022400     PERFORM Z050-INITIALIZE.                                     02180005
022500                                                                  02190005
022600     PERFORM 1000-PROCESS-CARD-MASTER-FILE.                       02200005
022700                                                                  02210005
022800     PERFORM Z100-END-PROC.                                       02220005
022900                                                                  02230005
023000     STOP RUN.                                                    02240005
023100                                                                  02250005
023200*-------------------------------*                                 02260005
023300 1000-PROCESS-CARD-MASTER-FILE.                                   02270005
023400*-------------------------------*                                 02280005
023500     SET PS-CONTINUE-PROCESSING TO TRUE.                          02290005
023600                                                                  02300005
023700     PERFORM 4000-READ-CARD-MASTER.                               02310005
023800                                                                  02320005
023900     PERFORM 2000-PROCESS-CARD-MASTER                             02330005
024000       UNTIL PS-STOP-PROCESSING.                                  02340005
024100                                                                  02350005
024200*-------------------------------*                                 02360005
024300 2000-PROCESS-CARD-MASTER.                                        02370005
024400*-------------------------------*                                 02380005
024410     IF IN-MSTR-RECORD                                            02390005
024420           MOVE IN-MASTER-RECORD    TO AR69-MASTER-DATA           02402012
024430           PERFORM 3000-PROCESS-MSTR-REC                          02410005
MFRETR           PERFORM 4200-PROCESS-MSTR-REC                          02420005
MFRETR           PERFORM 4205-PROCESS-MSTR-REC                          02430005
MFRETR           PERFORM 4400-PROCESS-MSTR-REC                          02440005
MFRETR           PERFORM 4600-PROCESS-MSTR-REC                          02450005
MFRETR           PERFORM 4800-PROCESS-MSTR-REC                          02460005
024440     END-IF                                                       02470005
025400     PERFORM 4000-READ-CARD-MASTER.                               02480005
025500     MOVE SPACES                 TO CARD-MASTER-OUT-REC.          02490005
025600                                                                  02500005
025700*-------------------------------*                                 02510005
025800 3000-PROCESS-MSTR-REC.                                           02520005
025900*-------------------------------*                                 02530005
026000                                                                  02540005
026100     MOVE AR69-RECORD-IDENTIFIER TO AR97-RECORD-IDENTIFIER.       02550005
026200                                                                  02560005
026300*************************************************************     02570005
026400* BASE AND CUST SEGS ARE REQUIRED ON ALL MSTR RECORDS.            02580005
026500*************************************************************     02590005
026600*    MOVE AR69-BASE-SEGMENT      TO AR97-BASE-DATA-SEGMENT.       02600005
026700                                                                  02610005
026800     MOVE AR69-RECORD-ID          TO AR97-RECORD-ID               02620005
026900     MOVE AR69-NEW-FILE-TYPE      TO AR97-NEW-FILE-TYPE           02630005
027000     MOVE AR69-RECORD-FORMAT      TO WS-EDIT-N1                   02640005
027100     MOVE WS-EDIT-N1              TO AR97-RECORD-FORMAT           02650005
027200     MOVE AR69-BRANCH-NO          TO AR97-BRANCH-NO               02660005
027300     MOVE AR69-CUST-NO-BS         TO AR97-CUST-NO-BS              02670005
027400     MOVE AR69-CUST-NO-AL         TO AR97-CUST-NO-AL              02680005
027500     MOVE AR69-CLIENT-NUMBER      TO AR97-CLIENT-NUMBER           02690005
027600     MOVE AR69-FULL-ACCT-NO       TO AR97-FULL-ACCT-NO            02700005
027700     MOVE AR69-ACCOUNT-NO-EXPN    TO AR97-ACCOUNT-NO-EXPN         02710005
027800     IF AR69-CIT-TOTL-CT           > 0                            02720005
027900        MOVE AR69-CIT-TOTL-CT     TO WS-EDIT-S4                   02730005
028000        MOVE WS-EDIT-S4           TO WS-EDIT-N4                   02740005
028100        MOVE WS-EDIT-N4           TO AR97-CIT-TOTL-CT             02750005
028200     ELSE                                                         02760005
028300        MOVE ZEROES               TO AR97-CIT-TOTL-CT             02770005
028400     END-IF                                                       02780005
028500     IF AR69-NO-DEL-ITEMS          > 0                            02790005
028600        MOVE AR69-NO-DEL-ITEMS    TO WS-EDIT-S4                   02800005
028700        MOVE WS-EDIT-S4           TO WS-EDIT-N4                   02810005
028800        MOVE WS-EDIT-N4           TO AR97-NO-DEL-ITEMS            02820005
028900     ELSE                                                         02830005
029000        MOVE ZEROES           TO AR97-NO-DEL-ITEMS                02840005
029100     END-IF                                                       02850005
029200     IF AR69-NO-BEHAVIOR-SEGS      > 0                            02860005
029300        MOVE AR69-NO-BEHAVIOR-SEGS   TO WS-EDIT-S4                02870005
029400        MOVE WS-EDIT-S4           TO WS-EDIT-N4                   02880005
029500        MOVE WS-EDIT-N4       TO AR97-NO-BEHAVIOR-SEGS            02890005
029600     ELSE                                                         02900005
029700        MOVE ZEROES           TO AR97-NO-BEHAVIOR-SEGS            02910005
029800     END-IF                                                       02920005
029900     IF AR69-NO-CUSTOMER-SEGS      > 0                            02930005
030000        MOVE AR69-NO-CUSTOMER-SEGS   TO WS-EDIT-S4                02940005
030100        MOVE WS-EDIT-S4           TO WS-EDIT-N4                   02950005
030200        MOVE WS-EDIT-N4       TO AR97-NO-CUSTOMER-SEGS            02960005
030300     ELSE                                                         02970005
030400        MOVE ZEROES           TO AR97-NO-CUSTOMER-SEGS            02980005
030500     END-IF                                                       02990005
030600     IF AR69-NO-HRSK-ACS-SEGS      > 0                            03000005
030700        MOVE AR69-NO-HRSK-ACS-SEGS   TO WS-EDIT-S4                03010005
030800        MOVE WS-EDIT-S4           TO WS-EDIT-N4                   03020005
030900        MOVE WS-EDIT-N4       TO AR97-NO-HRSK-ACS-SEGS            03030005
031000     ELSE                                                         03040005
031100        MOVE ZEROES           TO AR97-NO-HRSK-ACS-SEGS            03050005
031200     END-IF                                                       03060005
031300*    MOVE AR69-FUTURE-SMALL-SEGS  TO AR97-FUTURE-SMALL-SEGS       03070005
031310     MOVE SPACES                  TO FILLER-1                     03080005
031400     IF AR69-NO-SMALL-SEGS         > 0                            03090005
031500        MOVE AR69-NO-SMALL-SEGS      TO WS-EDIT-S4                03100005
031600        MOVE WS-EDIT-S4           TO WS-EDIT-N4                   03110005
031700        MOVE WS-EDIT-N4       TO AR97-NO-SMALL-SEGS               03120005
031800     ELSE                                                         03130005
031900        MOVE ZEROES           TO AR97-NO-SMALL-SEGS               03140005
032000     END-IF                                                       03150005
032100     IF AR69-NO-ALP-STAG-SEGS      > 0                            03160005
032200        MOVE AR69-NO-ALP-STAG-SEGS   TO WS-EDIT-S4                03170005
032300        MOVE WS-EDIT-S4           TO WS-EDIT-N4                   03180005
032400        MOVE WS-EDIT-N4       TO AR97-NO-ALP-STAG-SEGS            03190005
032500     ELSE                                                         03200005
032600        MOVE ZEROES           TO AR97-NO-ALP-STAG-SEGS            03210005
032700     END-IF                                                       03220005
032800     IF AR69-NO-NEW-MISC-SEGS      > 0                            03230005
032900        MOVE AR69-NO-NEW-MISC-SEGS   TO WS-EDIT-S4                03240005
033000        MOVE WS-EDIT-S4           TO WS-EDIT-N4                   03250005
033100        MOVE WS-EDIT-N4       TO AR97-NO-NEW-MISC-SEGS            03260005
033200     ELSE                                                         03270005
033300        MOVE ZEROES           TO AR97-NO-NEW-MISC-SEGS            03280005
033400     END-IF                                                       03290005
033500     IF AR69-NO-NEW-MISC2-SEGS     > 0                            03300005
033600        MOVE AR69-NO-NEW-MISC2-SEGS  TO WS-EDIT-S4                03310005
033700        MOVE WS-EDIT-S4           TO WS-EDIT-N4                   03320005
033800        MOVE WS-EDIT-N4       TO AR97-NO-NEW-MISC2-SEGS           03330005
033900     ELSE                                                         03340005
034000        MOVE ZEROES           TO AR97-NO-NEW-MISC2-SEGS           03350005
034100     END-IF                                                       03360005
034110     INSPECT AR69-NEW-MISC3-SEG (1)                               03370005
034120            REPLACING ALL X'25' BY ' '.                           03380005
034130     INSPECT AR69-NEW-MISC3-SEG (1)                               03390005
034140            REPLACING ALL X'0D' BY ' '.                           03400005
034150     INSPECT AR69-NEW-MISC3-SEG (1)                               03410005
034160            REPLACING ALL X'15' BY ' '.                           03420005
034170     INSPECT AR69-NEW-MISC3-SEG (1)                               03430005
034180            REPLACING ALL X'0A' BY ' '.                           03440005
034220     IF AR69-NO-NEW-MISC3-SEGS     > 0                            03450005
034300        MOVE AR69-NO-NEW-MISC3-SEGS  TO WS-EDIT-S4                03460005
034400        MOVE WS-EDIT-S4           TO WS-EDIT-N4                   03470005
034500        MOVE WS-EDIT-N4       TO AR97-NO-NEW-MISC3-SEGS           03480005
034600     ELSE                                                         03490005
034700        MOVE ZEROES           TO AR97-NO-NEW-MISC3-SEGS           03500005
034800     END-IF                                                       03510005
034900     IF AR69-NO-SLS-SYD-SEGS       > 0                            03520005
035000        MOVE AR69-NO-SLS-SYD-SEGS    TO WS-EDIT-S4                03530005
035100        MOVE WS-EDIT-S4           TO WS-EDIT-N4                   03540005
035200        MOVE WS-EDIT-N4       TO AR97-NO-SLS-SYD-SEGS             03550005
035300     ELSE                                                         03560005
035400        MOVE ZEROES           TO AR97-NO-SLS-SYD-SEGS             03570005
035500     END-IF                                                       03580005
035600*    MOVE AR69-FUTURE-LARGE-SEGS  TO AR97-FUTURE-LARGE-SEGS       03590005
035610     MOVE SPACES                  TO FILLER-2                     03600005
035700     IF AR69-NO-LARGE-SEGS         > 0                            03610005
035800        MOVE AR69-NO-LARGE-SEGS      TO WS-EDIT-S4                03620005
035900        MOVE WS-EDIT-S4           TO WS-EDIT-N4                   03630005
036000        MOVE WS-EDIT-N4       TO AR97-NO-LARGE-SEGS               03640005
036100     ELSE                                                         03650005
036200        MOVE ZEROES           TO AR97-NO-LARGE-SEGS               03660005
036300     END-IF                                                       03670005
037010     MOVE SPACES TO FILLER-3                                      03680005
037100     IF AR69-NO-FLAP-SEGS          > 0                            03690005
037200        MOVE AR69-NO-FLAP-SEGS        TO WS-EDIT-S8               03700005
037300        MOVE WS-EDIT-S8           TO WS-EDIT-N8                   03710005
037400        MOVE WS-EDIT-N8       TO AR97-NO-FLAP-SEGS                03720005
037500     ELSE                                                         03730005
037600        MOVE ZEROES           TO AR97-NO-FLAP-SEGS                03740005
037700     END-IF                                                       03750005
037800     IF AR69-NO-CHECKPOINTS        > 0                            03760005
037900        MOVE AR69-NO-CHECKPOINTS      TO WS-EDIT-S8               03770005
038000        MOVE WS-EDIT-S8           TO WS-EDIT-N8                   03780005
038100        MOVE WS-EDIT-N8       TO AR97-NO-CHECKPOINTS              03790005
038200     ELSE                                                         03800005
038300        MOVE ZEROES           TO AR97-NO-CHECKPOINTS              03810005
038400     END-IF                                                       03820005
038500     IF AR69-NO-TLP-BONUS-SEGS     > 0                            03830005
038600        MOVE AR69-NO-TLP-BONUS-SEGS   TO WS-EDIT-S8               03840005
038700        MOVE WS-EDIT-S8           TO WS-EDIT-N8                   03850005
038800        MOVE WS-EDIT-N8       TO AR97-NO-TLP-BONUS-SEGS           03860005
038900     ELSE                                                         03870005
039000        MOVE ZEROES           TO AR97-NO-TLP-BONUS-SEGS           03880005
039100     END-IF                                                       03890005
039200     IF AR69-NO-GLOBAL-NAME-CT     > 0                            03900005
039300        MOVE AR69-NO-GLOBAL-NAME-CT   TO WS-EDIT-S4               03910005
039400        MOVE WS-EDIT-S4       TO AR97-NO-GLOBAL-NAME-CT           03920005
039500     ELSE                                                         03930005
039600        MOVE ZEROES           TO AR97-NO-GLOBAL-NAME-CT           03940005
039700     END-IF                                                       03950005
039800     IF AR69-NO-GLOBAL-ADDRESS-CT  > 0                            03960005
039900        MOVE AR69-NO-GLOBAL-ADDRESS-CT TO WS-EDIT-S4              03970005
040000        MOVE WS-EDIT-S4       TO AR97-NO-GLOBAL-ADDRESS-CT        03980005
040100     ELSE                                                         03990005
040200        MOVE ZEROES           TO AR97-NO-GLOBAL-ADDRESS-CT        04000005
040300     END-IF                                                       04010005
040400     IF AR69-NO-GLOBAL-PHONE-CT    > 0                            04020005
040500        MOVE AR69-NO-GLOBAL-PHONE-CT   TO WS-EDIT-S4              04030005
040600        MOVE WS-EDIT-S4       TO AR97-NO-GLOBAL-PHONE-CT          04040005
040700     ELSE                                                         04050005
040800        MOVE SPACES           TO AR97-NO-GLOBAL-PHONE-CT          04060005
040900     END-IF                                                       04070005
041000     IF AR69-NO-MMB-ITEM-CT        > 0                            04080005
041100        MOVE AR69-NO-MMB-ITEM-CT       TO WS-EDIT-S4              04090005
041200        MOVE WS-EDIT-S4       TO AR97-NO-MMB-ITEM-CT              04100005
041300     ELSE                                                         04110005
041400        MOVE SPACES           TO AR97-NO-MMB-ITEM-CT              04120005
041500     END-IF                                                       04130005
041600     IF AR69-NO-PYST-ITEM-CT       > 0                            04140005
041700        MOVE AR69-NO-PYST-ITEM-CT      TO WS-EDIT-S4              04150005
041800        MOVE WS-EDIT-S4       TO AR97-NO-PYST-ITEM-CT             04160005
041900     ELSE                                                         04170005
042000        MOVE SPACES           TO AR97-NO-PYST-ITEM-CT             04180005
042100     END-IF                                                       04190005
042200     IF AR69-NMBR-DSPT-ITEM-CT     > 0                            04200005
042300        MOVE AR69-NMBR-DSPT-ITEM-CT    TO WS-EDIT-S4              04210005
042400        MOVE WS-EDIT-S4       TO AR97-NMBR-DSPT-ITEM-CT           04220005
042500     ELSE                                                         04230005
042600        MOVE SPACES           TO AR97-NMBR-DSPT-ITEM-CT           04240005
042700     END-IF                                                       04250005
042800     MOVE AR69-EXTERNAL-STATUS    TO AR97-EXTERNAL-STATUS         04260005
042900     MOVE AR69-INTERNAL-STATUS    TO AR97-INTERNAL-STATUS         04270005
043000     MOVE AR69-PREV-EXT-STATUS    TO AR97-PREV-EXT-STATUS         04280005
043100     MOVE AR69-CYCLE-CODE-99      TO AR97-CYCLE-CODE-99           04290005
043200     MOVE AR69-PREVIOUS-CYCLE-CODE-99                             04300005
043300       TO AR97-PREVIOUS-CYCLE-CODE-99                             04310005
043400     IF AR69-DLVR-PONT-NR         > 0                             04320005
043500        MOVE AR69-DLVR-PONT-NR           TO WS-EDIT-S8            04330005
043600        MOVE WS-EDIT-S8           TO AR97-DLVR-PONT-NR            04340005
043700     ELSE                                                         04350005
043800        MOVE SPACES               TO AR97-DLVR-PONT-NR            04360005
043900     END-IF                                                       04370005
044000     IF AR69-DLVR-BAR1-NR        > 0                              04380005
044100        MOVE AR69-DLVR-BAR1-NR           TO WS-EDIT-S18           04390005
044200        MOVE WS-EDIT-S18          TO AR97-DLVR-BAR1-NR            04400005
044300     ELSE                                                         04410005
044400        MOVE SPACES               TO AR97-DLVR-BAR1-NR            04420005
044500     END-IF                                                       04430005
044600     IF AR69-DLVR-BAR2-NR        > 0                              04440005
044700        MOVE AR69-DLVR-BAR2-NR           TO WS-EDIT-S18           04450005
044800        MOVE WS-EDIT-S18          TO AR97-DLVR-BAR2-NR            04460005
044900     ELSE                                                         04470005
045000        MOVE SPACES               TO AR97-DLVR-BAR2-NR            04480005
045100     END-IF                                                       04490005
045200     MOVE AR69-CHARGE-DDA-CODE    TO AR97-CHARGE-DDA-CODE         04500005
045300     IF AR69-TRANSIT-ROUTING-NO          IS NUMERIC               04510005
045400        MOVE AR69-TRANSIT-ROUTING-NO     TO WS-EDIT-S9            04520005
045500        MOVE WS-EDIT-S9           TO AR97-TRANSIT-ROUTING-NO      04530005
045600     ELSE                                                         04540005
045700        MOVE SPACES               TO AR97-TRANSIT-ROUTING-NO      04550005
045800     END-IF                                                       04560005
045900     MOVE AR69-CHECKING-ACCT-NO   TO AR97-CHECKING-ACCT-NO        04570005
046000     MOVE AR69-SAVINGS-ACCT-NO    TO AR97-SAVINGS-ACCT-NO         04580005
046100     MOVE AR69-SEC-CODE-NUM-1     TO AR97-SEC-CODE-NUM-1          04590005
046200     MOVE AR69-SEC-CODE-NUM-2     TO AR97-SEC-CODE-NUM-2          04600005
046300     MOVE AR69-SCRT-3-NMRC-CD     TO AR97-SCRT-3-NMRC-CD          04610005
046400     MOVE AR69-SCRT-4-NMRC-CD     TO AR97-SCRT-4-NMRC-CD          04620005
046500     IF AR69-PIN-VERIFY-1                IS NUMERIC               04630005
046600        MOVE AR69-PIN-VERIFY-1           TO WS-EDIT-S5            04640005
046700        MOVE WS-EDIT-S5           TO AR97-PIN-VERIFY-1            04650005
046800     ELSE                                                         04660005
046900        MOVE SPACES               TO AR97-PIN-VERIFY-1            04670005
047000     END-IF                                                       04680005
047100     IF AR69-PIN-VERIFY-2                IS NUMERIC               04690005
047200        MOVE AR69-PIN-VERIFY-2           TO WS-EDIT-S5            04700005
047300        MOVE WS-EDIT-S5           TO AR97-PIN-VERIFY-2            04710005
047400     ELSE                                                         04720005
047500        MOVE SPACES               TO AR97-PIN-VERIFY-2            04730005
047600     END-IF                                                       04740005
047700     IF AR69-PIN-VRFY-3-NR               IS NUMERIC               04750005
047800        MOVE AR69-PIN-VRFY-3-NR          TO WS-EDIT-S5            04760005
047900        MOVE WS-EDIT-S5           TO AR97-PIN-VRFY-3-NR           04770005
048000     ELSE                                                         04780005
048100        MOVE SPACES               TO AR97-PIN-VRFY-3-NR           04790005
048200     END-IF                                                       04800005
048300     IF AR69-PIN-VRFY-4-NR               IS NUMERIC               04810005
048400        MOVE AR69-PIN-VRFY-4-NR          TO WS-EDIT-S5            04820005
048500        MOVE WS-EDIT-S5           TO AR97-PIN-VRFY-4-NR           04830005
048600     ELSE                                                         04840005
048700        MOVE SPACES               TO AR97-PIN-VRFY-4-NR           04850005
048800     END-IF                                                       04860005
048900     MOVE AR69-PIN-TRANSFER-FLAG  TO AR97-PIN-TRANSFER-FLAG       04870005
049000     MOVE AR69-TEMP-PI-TYPE       TO AR97-TEMP-PI-TYPE            04880005
049100     MOVE AR69-TEMP-PI-STMT       TO AR97-TEMP-PI-STMT            04890005
049200     MOVE AR69-CREDIT-SCORE       TO AR97-CREDIT-SCORE            04900005
049300     MOVE AR69-COFF-REASON-CODE   TO AR97-COFF-REASON-CODE        04910005
049400     IF AR69-RECOURSE-MERCHANT           IS NUMERIC               04920005
049500        MOVE AR69-RECOURSE-MERCHANT      TO WS-EDIT-S5            04930005
049600        MOVE WS-EDIT-S5           TO AR97-RECOURSE-MERCHANT       04940005
049700     ELSE                                                         04950005
049800        MOVE SPACES               TO AR97-RECOURSE-MERCHANT       04960005
049900     END-IF                                                       04970005
050000     MOVE AR69-RECOURSE-FLAG      TO AR97-RECOURSE-FLAG           04980005
050100     MOVE AR69-WB-TRAN-TYPE       TO AR97-WB-TRAN-TYPE            04990005
050200     IF AR69-WB-PURGE-DATE               IS NUMERIC               05000005
050300        MOVE AR69-WB-PURGE-DATE          TO WS-EDIT-S5            05010005
050400        MOVE WS-EDIT-S5           TO AR97-WB-PURGE-DATE           05020005
050500     ELSE                                                         05030005
050600        MOVE SPACES               TO AR97-WB-PURGE-DATE           05040005
050700     END-IF                                                       05050005
050800     MOVE AR69-CREDIT-BUREAU-FLAG TO AR97-CREDIT-BUREAU-FLAG      05060005
050900     MOVE AR69-RECOVERY-IND       TO AR97-RECOVERY-IND            05070005
051000     MOVE AR69-TYPE-PLASTIC       TO AR97-TYPE-PLASTIC            05080005
051100     MOVE AR69-SPOUSE-TYPE-PLASTIC TO AR97-SPOUSE-TYPE-PLASTIC    05090005
051200     MOVE AR69-DUAL-TYPE-PLASTIC   TO AR97-DUAL-TYPE-PLASTIC      05100005
051300     MOVE AR69-DUAL-SPOUSE-TYPE-PLASTIC                           05110005
051400       TO AR97-DUAL-SPOUSE-TYPE-PLASTIC                           05120005
051500     MOVE AR69-NEWCARD-FLAG        TO AR97-NEWCARD-FLAG           05130005
051600     IF AR69-ANNUAL-CHG-DATE > 0                                  05140005
051700        MOVE AR69-ANNUAL-CHG-DATE          TO WS-EDIT-S4          05150005
051800        MOVE WS-EDIT-S4        TO AR97-ANNUAL-CHG-DATE            05160005
051900     ELSE                                                         05170005
052000        MOVE SPACES            TO AR97-ANNUAL-CHG-DATE            05180005
052100     END-IF                                                       05190005
052200     MOVE AR69-ANNUAL-CHARGE-FLAG  TO AR97-ANNUAL-CHARGE-FLAG     05200005
052300     IF AR69-MAIL-CODE                IS NUMERIC                  05210005
052400        MOVE AR69-MAIL-CODE                TO WS-EDIT-S3          05220005
052500        MOVE WS-EDIT-S3        TO AR97-MAIL-CODE                  05230005
052600     ELSE                                                         05240005
052700        MOVE SPACES            TO AR97-MAIL-CODE                  05250005
052800     END-IF                                                       05260005
052900     MOVE AR69-MAIL-CODE-FLAG      TO AR97-MAIL-CODE-FLAG         05270005
053000     MOVE AR69-PRTC-BLNC-CD        TO AR97-PRTC-BLNC-CD           05280005
053100     IF AR69-OPEN-DATE                IS NUMERIC                  05290005
053200        MOVE AR69-OPEN-DATE                TO WS-EDIT-S7          05300005
053300        MOVE WS-EDIT-S7        TO AR97-OPEN-DATE                  05310005
053400     ELSE                                                         05320005
053500        MOVE SPACES            TO AR97-OPEN-DATE                  05330005
053600     END-IF                                                       05340005
053700     MOVE AR69-MEMBER-SINCE-DATE        TO WS-EDIT-N4             05350005
053800     MOVE WS-EDIT-N4        TO AR97-MEMBER-SINCE-DATE             05360005
053900     MOVE AR69-FILLER-B5B022MS-2   TO AR97-FILLER-B5B022MS-2      05370005
054000     IF AR69-EXPIRATION-DATE          IS NUMERIC                  05380005
054100        MOVE AR69-EXPIRATION-DATE          TO WS-EDIT-S7          05390005
054200        MOVE WS-EDIT-S7        TO AR97-EXPIRATION-DATE            05400005
054300     ELSE                                                         05410005
054400        MOVE SPACES            TO AR97-EXPIRATION-DATE            05420005
054500     END-IF                                                       05430005
054600     IF AR69-REISSUE-CONTROL          IS NUMERIC                  05440005
054700        MOVE AR69-REISSUE-CONTROL          TO WS-EDIT-S1          05450005
054800        MOVE WS-EDIT-S1        TO AR97-REISSUE-CONTROL            05460005
054900     ELSE                                                         05470005
055000        MOVE SPACES            TO AR97-REISSUE-CONTROL            05480005
055100     END-IF                                                       05490005
055200     IF AR69-DATE-LAST-PLASTIC        IS NUMERIC                  05500005
055300        MOVE AR69-DATE-LAST-PLASTIC        TO WS-EDIT-S7          05510005
055400        MOVE WS-EDIT-S7        TO AR97-DATE-LAST-PLASTIC          05520005
055500     ELSE                                                         05530005
055600        MOVE SPACES            TO AR97-DATE-LAST-PLASTIC          05540005
055700     END-IF                                                       05550005
055800     MOVE AR69-SMRT-CARD-ICC-CD    TO AR97-SMRT-CARD-ICC-CD       05560005
055900     MOVE AR69-TYPE-CRED-LINE-CHG  TO AR97-TYPE-CRED-LINE-CHG     05570005
056000     IF AR69-CREDIT-LINE              IS NUMERIC                  05580005
056100        MOVE AR69-CREDIT-LINE              TO WS-EDIT-S15         05590005
056200        MOVE WS-EDIT-S15       TO AR97-CREDIT-LINE                05600005
056300     ELSE                                                         05610005
056400        MOVE SPACES            TO AR97-CREDIT-LINE                05620005
056500     END-IF                                                       05630005
056600     IF AR69-CR-LINE-DATE  > 0                                    05640005
056700        MOVE AR69-CR-LINE-DATE             TO WS-EDIT-S4          05650005
056800        MOVE WS-EDIT-S4        TO AR97-CR-LINE-DATE               05660005
056900     ELSE                                                         05670005
057000        MOVE SPACES            TO AR97-CR-LINE-DATE               05680005
057100     END-IF                                                       05690005
057200     IF AR69-DATE-LAST-REVIEW > 0                                 05700005
057300        MOVE AR69-DATE-LAST-REVIEW         TO WS-EDIT-S4          05710005
057400        MOVE WS-EDIT-S4        TO AR97-DATE-LAST-REVIEW           05720005
057500     ELSE                                                         05730005
057600        MOVE SPACES            TO AR97-DATE-LAST-REVIEW           05740005
057700     END-IF                                                       05750005
057800     IF AR69-DATE-NEXT-REVIEW > 0                                 05760005
057900        MOVE AR69-DATE-NEXT-REVIEW         TO WS-EDIT-S4          05770005
058000        MOVE WS-EDIT-S4        TO AR97-DATE-NEXT-REVIEW           05780005
058100     ELSE                                                         05790005
058200        MOVE SPACES            TO AR97-DATE-NEXT-REVIEW           05800005
058300     END-IF                                                       05810005
058400     MOVE AR69-EXPANDED-CUST-USE-FLAGS                            05820005
058500       TO AR97-EXPANDED-CUST-USE-FLAGS                            05830005
058600     MOVE AR69-SC-1               TO AR97-SC-1                    05840005
058700     MOVE AR69-SC-2               TO AR97-SC-2                    05850005
058800     MOVE AR69-SC-3               TO AR97-SC-3                    05860005
058900     MOVE AR69-SC-4               TO AR97-SC-4                    05870005
059000     MOVE AR69-SC-5               TO AR97-SC-5                    05880005
059100     MOVE AR69-SC-6               TO AR97-SC-6                    05890005
059200     MOVE AR69-SC-7               TO AR97-SC-7                    05900005
059300     MOVE AR69-SC-8               TO AR97-SC-8                    05910005
059310     IF AR69-MISCELLANEOUS-FIELD-1   IS NUMERIC AND               05920005
059320        AR69-MISCELLANEOUS-FIELD-1   > 0                          05930005
059330        MOVE AR69-MISCELLANEOUS-FIELD-1 TO WS-EDIT-N4             05940005
059340        MOVE WS-EDIT-N4                                           05950005
059350          TO AR97-MISCELLANEOUS-FIELD-1                           05960005
059360      ELSE IF  AR69-MISCELLANEOUS-FIELD-1 = LOW-VALUES            05970005
059361          MOVE SPACES TO  AR97-MISCELLANEOUS-FIELD-1              05980005
059362      ELSE                                                        05990005
059370        MOVE AR69-MISCELLANEOUS-FIELD-1                           06000005
059380          TO AR97-MISCELLANEOUS-FIELD-1                           06010005
059390      END-IF                                                      06020005
059391     END-IF                                                       06030005
059392     IF AR69-MISCELLANEOUS-FIELD-2   IS NUMERIC AND               06040005
059393        AR69-MISCELLANEOUS-FIELD-2   > 0                          06050005
059394        MOVE AR69-MISCELLANEOUS-FIELD-2 TO WS-EDIT-N5             06060005
059395        MOVE WS-EDIT-N5                                           06070005
059396          TO AR97-MISCELLANEOUS-FIELD-2                           06080005
059397      ELSE IF  AR69-MISCELLANEOUS-FIELD-2 = LOW-VALUES            06090005
059398          MOVE SPACES TO  AR97-MISCELLANEOUS-FIELD-2              06100005
059399      ELSE                                                        06110005
059400        MOVE AR69-MISCELLANEOUS-FIELD-2                           06120005
059401          TO AR97-MISCELLANEOUS-FIELD-2                           06130005
059402      END-IF                                                      06140005
059403     END-IF                                                       06150005
059800     IF AR69-MISCELLANEOUS-FIELD-3   IS NUMERIC AND               06160005
059900        AR69-MISCELLANEOUS-FIELD-3   > 0                          06170005
060000        MOVE AR69-MISCELLANEOUS-FIELD-3 TO WS-EDIT-N5V99          06180005
060100        MOVE WS-EDIT-N5V99                                        06190005
060200          TO AR97-MISCELLANEOUS-FIELD-3                           06200005
060210     ELSE                                                         06210005
060220       IF AR69-MISCELLANEOUS-FIELD-3 = LOW-VALUES                 06220005
060230          MOVE SPACES TO AR97-MISCELLANEOUS-FIELD-3               06230005
060300     ELSE                                                         06240005
060400        MOVE AR69-MISCELLANEOUS-FIELD-3                           06250005
060500          TO AR97-MISCELLANEOUS-FIELD-3                           06260005
060600      END-IF                                                      06270005
060610     END-IF                                                       06280005
060620          MOVE SPACES TO AR97-MISCELLANEOUS-FIELD-4               06290005
060700     IF AR69-MISCELLANEOUS-FIELD-4 IS NUMERIC                     06300005
060800       MOVE AR69-MISCELLANEOUS-FIELD-4 TO WS-EDIT-N8V99           06310005
060900       MOVE WS-EDIT-N8V99                                         06320005
061000         TO AR97-MISCELLANEOUS-FIELD-4                            06330005
061100     ELSE                                                         06340005
061200       MOVE AR69-MISCELLANEOUS-FIELD-4                            06350005
061300         TO AR97-MISCELLANEOUS-FIELD-4                            06360005
061400      END-IF                                                      06370005
061410        MOVE SPACES TO AR97-MISCELLANEOUS-FIELD-5                 06380005
061450     MOVE AR69-MISCELLANEOUS-FIELD-5                              06390005
061460       TO AR97-MISCELLANEOUS-FIELD-5.                             06400005
061500     IF AR69-PREV-PYMT-AMT IS NUMERIC                             06410005
061600       MOVE AR69-PREV-PYMT-AMT         TO WS-EDIT-S5V99           06420005
061700       MOVE WS-EDIT-S5V99              TO AR97-PREV-PYMT-AMT      06430005
061800     ELSE                                                         06440005
061900       MOVE SPACES                     TO AR97-PREV-PYMT-AMT      06450005
062000     END-IF                                                       06460005
062100     IF AR69-EARLY-PYMT-AMT IS NUMERIC                            06470005
062200        MOVE AR69-EARLY-PYMT-AMT       TO WS-EDIT-S5V99           06480005
062300        MOVE WS-EDIT-S5V99             TO AR97-EARLY-PYMT-AMT     06490005
062400     ELSE                                                         06500005
062500       MOVE SPACES                     TO AR97-EARLY-PYMT-AMT     06510005
062600     END-IF                                                       06520005
062810     MOVE SPACES                 TO AR97-MISCELLANEOUS-FIELD-6    06530005
062820                                    AR97-MYRIAD-AMT-PAID          06540005
062830                                    AR97-OVLMT-HIGH-BAL           06550005
062831                                    FILLER-6-3                    06560005
062840     MOVE ZEROES                 TO AR97-MYRIAD-NO-PYMTS          06570005
062860     MOVE AR69-MISCELLANEOUS-FIELD-6                              06580005
062870       TO AR97-MISCELLANEOUS-FIELD-6.                             06590005
062900     IF AR69-MYRIAD-AMT-PAID  IS NUMERIC                          06600005
062910        MOVE AR69-MYRIAD-AMT-PAID TO  WS-EDIT-N7V99               06610005
062920        MOVE WS-EDIT-N7V99 TO AR97-MYRIAD-AMT-PAID                06620005
062930     END-IF                                                       06630005
063000     IF AR69-MYRIAD-NO-PYMTS  IS NUMERIC                          06640005
063100        MOVE AR69-MYRIAD-NO-PYMTS   TO WS-EDIT-N7V99              06650005
063200        MOVE WS-EDIT-N7V99                                        06660005
063300          TO AR97-MYRIAD-NO-PYMTS                                 06670005
063600     END-IF                                                       06680005
063700     MOVE SPACES TO AR97-OVLMT-START-YYJJJ                        06690005
063800                     AR97-OVLMT-END-YYJJJ                         06700005
063900                     AR97-OVLMT-HIGH-BAL                          06710005
063910                     AR97-OVLMT-CR-LIMIT                          06720005
063920                     FILLER-6-2                                   06730005
064000       IF AR69-OVLMT-START-YYJJJ IS NUMERIC                       06740005
064010        MOVE AR69-OVLMT-START-YYJJJ  TO WS-EDIT-S5                06750005
064020        MOVE WS-EDIT-S5              TO AR97-OVLMT-START-YYJJJ    06760005
064030       END-IF                                                     06770005
064100       IF AR69-OVLMT-END-YYJJJ   IS NUMERIC                       06780005
064110        MOVE AR69-OVLMT-END-YYJJJ    TO WS-EDIT-S5                06790005
064120        MOVE WS-EDIT-S5              TO AR97-OVLMT-END-YYJJJ      06800005
064130       END-IF                                                     06810005
064200        IF AR69-OVLMT-HIGH-BAL    IS NUMERIC                      06820005
064210         MOVE AR69-OVLMT-HIGH-BAL     TO WS-EDIT-S5               06830005
064220         MOVE WS-EDIT-S5              TO AR97-OVLMT-HIGH-BAL      06840005
064230        END-IF                                                    06850005
064300        IF  AR69-OVLMT-CR-LIMIT    IS NUMERIC                     06860005
065000         MOVE AR69-OVLMT-CR-LIMIT     TO WS-EDIT-S5               06870005
065100         MOVE WS-EDIT-S5              TO AR97-OVLMT-CR-LIMIT      06880005
065200        END-IF                                                    06890005
065600     MOVE SPACES TO AR97-MISCELLANEOUS-FIELD-7                    06900005
065601                    AR97-LAST-CR-LIMIT                            06910005
065602                    AR97-PREV-PYMT-YYJJJ                          06920005
065603                    AR97-EARLY-PYMT-YYJJJ                         06930005
065604                    FILLER-7                                      06940005
065605     MOVE ZEROES TO AR97-MYRIAD-ANN-CASH-ADV-INT                  06950005
065606                    AR97-MYRIAD-INSURANCE-PREM                    06960005
065607     MOVE SPACES TO FILLER-7-1                                    06970005
065610     MOVE AR69-MISCELLANEOUS-FIELD-7                              06980005
065620       TO AR97-MISCELLANEOUS-FIELD-7                              06990005
065800      IF AR69-MYRIAD-ANN-CASH-ADV-INT IS NUMERIC                  07000005
065810        MOVE AR69-MYRIAD-ANN-CASH-ADV-INT                         07010005
065820          TO AR97-MYRIAD-ANN-CASH-ADV-INT                         07020005
065830      END-IF                                                      07030005
065900     IF AR69-MYRIAD-INSURANCE-PREM   IS NUMERIC                   07040005
066200        MOVE AR69-MYRIAD-INSURANCE-PREM                           07050005
066300          TO AR97-MYRIAD-INSURANCE-PREM                           07060005
066310     END-IF                                                       07070005
066800     IF AR69-LAST-CR-LIMIT    IS NUMERIC                          07080005
066810        MOVE AR69-LAST-CR-LIMIT    TO WS-EDIT-S5                  07090005
066820        MOVE WS-EDIT-S5            TO AR97-LAST-CR-LIMIT          07100005
066830     END-IF                                                       07110005
066900     IF AR69-PREV-PYMT-YYJJJ  IS NUMERIC                          07120005
066910        MOVE AR69-PREV-PYMT-YYJJJ  TO WS-EDIT-S5                  07130005
066920        MOVE WS-EDIT-S5            TO AR97-PREV-PYMT-YYJJJ        07140005
066930     END-IF                                                       07150005
067000     IF AR69-EARLY-PYMT-YYJJJ IS NUMERIC                          07160005
067500        MOVE AR69-EARLY-PYMT-YYJJJ TO WS-EDIT-S5                  07170005
067600        MOVE WS-EDIT-S5            TO AR97-EARLY-PYMT-YYJJJ       07180005
067700     END-IF                                                       07190005
068220                                                                  07200005
068230       MOVE SPACES TO AR97-MISCELLANEOUS-FIELD-8                  07210005
068250       MOVE AR69-MISCELLANEOUS-FIELD-8                            07220005
068260         TO AR97-MISCELLANEOUS-FIELD-8.                           07230005
068270       MOVE SPACES TO AR97-FIX-PAY-YYJJJ                          07240005
068280                    AR97-PREV-STAT-YYJJJ                          07250005
068290                    AR97-LAST-RET-CHECK                           07260005
068291                    AR97-PREV-EXT-STAT                            07270005
068292                    AR97-NW-OVLMT-START-YYJJJ                     07280005
068293                    AR97-NW-OVLMT-END-YYJJJ                       07290005
068294                    AR97-NW-DATE-HIGH-BAL-YYJJJ                   07300005
068295                    FILLER-8                                      07310005
068296                    AR97-MSCL-FLD8-PSTN1                          07320005
068297                    AR97-MSCL-FLD8-PSTN2                          07330005
068298                    AR97-MSCL-FLD8-PSTN3                          07340005
068299                    AR97-MSCL-FLD8-PSTN4                          07350005
068300                    AR97-MSCL-FLD8-PSTN5                          07360005
068301                    AR97-MSCL-FLD8-PSTN6                          07370005
068302                    AR97-MSCL-FLD8-PSTN7                          07380005
068303                    AR97-MSCL-FLD8-PSTN8                          07390005
068304                    AR97-MSCL-FLD8-PSTN9                          07400005
068305                    AR97-MSCL-FLD8-PSTN10                         07410005
068306                    FILLER-8-1                                    07420005
068307                    FILLER-8-2                                    07430005
068308                    FILLER-8-3                                    07440005
068309                    FILLER-8-4                                    07450005
068310                    AR97-MSCL-FLD8-CHG-DATE                       07460005
068311                    FILLER-8-5                                    07470005
068312      MOVE ZEROES TO AR97-MSCL-FLD8-PSTN4-6                       07480005
068320     IF AR69-FIX-PAY-YYJJJ        IS NUMERIC                      07490005
068330        MOVE AR69-FIX-PAY-YYJJJ TO WS-EDIT-S5                     07500005
068340        MOVE WS-EDIT-S5         TO AR97-FIX-PAY-YYJJJ             07510005
068350     END-IF                                                       07520005
068400     IF AR69-PREV-STAT-YYJJJ      IS NUMERIC                      07530005
068410        MOVE AR69-PREV-STAT-YYJJJ  TO WS-EDIT-S5                  07540005
068420        MOVE WS-EDIT-S5         TO AR97-PREV-STAT-YYJJJ           07550005
068430     END-IF                                                       07560005
068500     IF AR69-LAST-RET-CHECK       IS NUMERIC                      07570005
069000        MOVE AR69-LAST-RET-CHECK   TO WS-EDIT-S5                  07580005
069100        MOVE WS-EDIT-S5         TO AR97-LAST-RET-CHECK            07590005
069101     END-IF                                                       07600005
069110        IF AR69-PREV-EXT-STAT = LOW-VALUES                        07610005
069120           MOVE SPACES TO AR97-PREV-EXT-STAT                      07620005
069130        ELSE                                                      07630005
069200        MOVE AR69-PREV-EXT-STAT TO AR97-PREV-EXT-STAT             07640005
069210        END-IF                                                    07650005
069901     IF AR97-NW-OVLMT-START-YYJJJ IS NUMERIC                      07660005
069902        MOVE AR69-NW-OVLMT-START-YYJJJ                            07670005
069903           TO AR97-NW-OVLMT-START-YYJJJ                           07680005
069904     END-IF                                                       07690005
069905     IF AR97-NW-OVLMT-END-YYJJJ   IS NUMERIC                      07700005
069906        MOVE AR69-NW-OVLMT-END-YYJJJ                              07710005
069907           TO AR97-NW-OVLMT-END-YYJJJ                             07720005
069908     END-IF                                                       07730005
069909     IF AR97-NW-DATE-HIGH-BAL-YYJJJ IS NUMERIC                    07740005
069910        MOVE AR69-NW-DATE-HIGH-BAL-YYJJJ                          07750005
069911           TO AR97-NW-DATE-HIGH-BAL-YYJJJ                         07760005
069912     END-IF                                                       07770005
069913                                                                  07780005
069914     IF AR69-MSCL-FLD8-PSTN4-6 IS NUMERIC                         07790005
069915       MOVE AR69-MSCL-FLD8-PSTN4-6                                07800005
069916         TO AR97-MSCL-FLD8-PSTN4-6                                07810005
069917     END-IF                                                       07820005
069918                                                                  07830005
069920        MOVE SPACES TO AR97-MISC-FIELD-9                          07840005
069930*                      AR97-MISCELLANEOUS-FIELD-9                 07850005
069940                       FILLER-9-1                                 07860005
069950                       AR97-MISC9-POS6-ID                         07870005
069960                       FILLER-9-2                                 07880005
070000     MOVE AR69-MISC-FIELD-9     TO AR97-MISC-FIELD-9.             07890005
070100     IF AR69-MISC9-POS6-ID      IS NUMERIC                        07900005
070200        INITIALIZE AR97-MISCELLANEOUS-FIELD-9                     07910005
070300        MOVE AR69-MISC9-POS6-ID    TO AR97-MISC9-POS6-ID          07920005
070400     END-IF                                                       07930005
070500     IF AR69-MISCELLANEOUS-FIELD-9 > 0                            07940005
070600        MOVE AR69-MISCELLANEOUS-FIELD-9 TO WS-EDIT-N8V99          07950005
070700        MOVE WS-EDIT-N8V99      TO AR97-MISCELLANEOUS-FIELD-9     07960005
070800     END-IF                                                       07970005
070900     MOVE AR69-MISC-FIELD-10         TO AR97-MISC-FIELD-10        07980005
071000     MOVE AR69-MISC-FIELD-11-TX      TO AR97-MISC-FIELD-11-TX     07990005
071100     MOVE AR69-MISC-FIELD-12-TX      TO AR97-MISC-FIELD-12-TX     08000005
071200     IF AR69-DATE-LAST-PIN-MAILER    IS NUMERIC                   08010005
071300        MOVE AR69-DATE-LAST-PIN-MAILER     TO WS-EDIT-S7          08020005
071400        MOVE WS-EDIT-S7        TO AR97-DATE-LAST-PIN-MAILER       08030005
071500     ELSE                                                         08040005
071600        MOVE SPACES            TO AR97-DATE-LAST-PIN-MAILER       08050005
071700     END-IF                                                       08060005
071800     IF AR69-DESIGNATED-AUTOPAY-AMT  IS NUMERIC                   08070005
071900        MOVE AR69-DESIGNATED-AUTOPAY-AMT   TO WS-EDIT-S15V99      08080005
072000        MOVE WS-EDIT-S15V99    TO AR97-DESIGNATED-AUTOPAY-AMT     08090005
072100     ELSE                                                         08100005
072200        MOVE SPACES            TO AR97-DESIGNATED-AUTOPAY-AMT     08110005
072300     END-IF                                                       08120005
072400     IF AR69-CRLIFE-ORIG-NUM-STATE  IS NUMERIC                    08130005
072500        MOVE AR69-CRLIFE-ORIG-NUM-STATE TO WS-EDIT-S3             08140005
072600        MOVE WS-EDIT-S3                 TO                        08150005
072700             AR97-CRLIFE-ORIG-NUM-STATE                           08160005
072800     ELSE                                                         08170005
072900        MOVE SPACES           TO                                  08180005
073000             AR97-CRLIFE-ORIG-NUM-STATE                           08190005
073100     END-IF                                                       08200005
073110     MOVE SPACES TO AR97-FDR-USE-MISC-FIELD-1                     08210005
073120                    FILLER-10                                     08220005
073130                    AR97-CRD-BUR-FLAG-2                           08230005
073140                    AR97-BTI-USE-FLAG                             08240005
073150                    AR97-STI-USE-FLAG                             08250005
073160                    AR97-REFUND-INDICATOR                         08260005
073170                    AR97-CRLIFE-ORIG-STATE                        08270005
073180                    AR97-CRBR-CNSM-INFR-CD                        08280005
073190      MOVE ZEROES TO AR97-EXTD-REISSUE-BYPASS-FLAG                08290005
073200     MOVE AR69-FDR-USE-MISC-FIELD-1  TO AR97-FDR-USE-MISC-FIELD-1 08300005
073300     MOVE AR69-CRD-BUR-FLAG-2        TO AR97-CRD-BUR-FLAG-2       08310005
073400     MOVE AR69-BTI-USE-FLAG          TO AR97-BTI-USE-FLAG         08320005
073500     MOVE AR69-STI-USE-FLAG          TO AR97-STI-USE-FLAG         08330005
073600     MOVE AR69-REFUND-INDICATOR      TO AR97-REFUND-INDICATOR     08340005
073700     MOVE AR69-EXTD-REISSUE-BYPASS-FLAG                           08350005
073800       TO AR97-EXTD-REISSUE-BYPASS-FLAG                           08360005
073900     MOVE AR69-CRLIFE-ORIG-STATE     TO AR97-CRLIFE-ORIG-STATE    08370005
074000     MOVE AR69-CRBR-CNSM-INFR-CD     TO AR97-CRBR-CNSM-INFR-CD    08380005
074100     IF AR69-CROSS-REFERENCE-ACCT-NO      IS NUMERIC              08390005
074200        MOVE AR69-CROSS-REFERENCE-ACCT-NO TO  WS-EDIT-S17         08400005
074300        MOVE WS-EDIT-S17                  TO                      08410005
074400             AR97-CROSS-REFERENCE-ACCT-NO                         08420005
074500     ELSE                                                         08430005
074600        MOVE SPACES           TO                                  08440005
074700             AR97-CROSS-REFERENCE-ACCT-NO                         08450005
074800     END-IF                                                       08460005
074900     IF AR69-NEW-XREF-NO-1                IS NUMERIC              08470005
075000        MOVE AR69-NEW-XREF-NO-1           TO  WS-EDIT-S17         08480005
075100        MOVE WS-EDIT-S17                  TO                      08490005
075200             AR97-NEW-XREF-NO-1                                   08500005
075300     ELSE                                                         08510005
075400        MOVE SPACES           TO                                  08520005
075500             AR97-NEW-XREF-NO-1                                   08530005
075600     END-IF                                                       08540005
075700     IF AR69-NEW-XREF-NO-2                IS NUMERIC              08550005
075800        MOVE AR69-NEW-XREF-NO-2           TO  WS-EDIT-S17         08560005
075900        MOVE WS-EDIT-S17                  TO                      08570005
076000             AR97-NEW-XREF-NO-2                                   08580005
076100     ELSE                                                         08590005
076200        MOVE SPACES           TO                                  08600005
076300             AR97-NEW-XREF-NO-2                                   08610005
076400     END-IF                                                       08620005
076410     MOVE SPACES TO AR97-CUST-XREF-ID                             08630005
076420                    FILLER-11                                     08640005
076430                    AR97-OLD-CR-LIFE-DATE                         08650005
076440                    AR97-OLD-CR-LIFE-STAT-DATE                    08660005
076450                    AR97-OLD-CR-LIFE-PAID-AMT                     08670005
076500     MOVE AR69-CUST-XREF-ID         TO AR97-CUST-XREF-ID          08680005
076600     IF AR69-OLD-CR-LIFE-DATE             IS NUMERIC              08690005
076700        MOVE AR69-OLD-CR-LIFE-DATE        TO  WS-EDIT-S7          08700005
076800        MOVE WS-EDIT-S7                   TO                      08710005
076900             AR97-OLD-CR-LIFE-DATE                                08720005
076910     END-IF                                                       08730005
077400     IF AR69-OLD-CR-LIFE-STAT-DATE        IS NUMERIC              08740005
077500        MOVE AR69-OLD-CR-LIFE-STAT-DATE   TO  WS-EDIT-S7          08750005
077600        MOVE WS-EDIT-S7                   TO                      08760005
077700             AR97-OLD-CR-LIFE-STAT-DATE                           08770005
077710     END-IF                                                       08780005
078200     IF AR69-OLD-CR-LIFE-PAID-AMT         IS NUMERIC              08790005
078300        MOVE AR69-OLD-CR-LIFE-PAID-AMT    TO  WS-EDIT-S11V99      08800005
078400        MOVE WS-EDIT-S11V99               TO                      08810005
078500             AR97-OLD-CR-LIFE-PAID-AMT                            08820005
078510     END-IF                                                       08830005
079000     IF AR69-CR-LIFE-STAT-DATE       IS NUMERIC                   08840005
079100        MOVE AR69-CR-LIFE-STAT-DATE        TO WS-EDIT-S7          08850005
079200        MOVE WS-EDIT-S7        TO AR97-CR-LIFE-STAT-DATE          08860005
079300     ELSE                                                         08870005
079400        MOVE SPACES            TO AR97-CR-LIFE-STAT-DATE          08880005
079500     END-IF                                                       08890005
079600     IF AR69-CR-LIFE-PAID-AMT             IS NUMERIC              08900005
079700        MOVE AR69-CR-LIFE-PAID-AMT        TO  WS-EDIT-S11V99      08910005
079800        MOVE WS-EDIT-S11V99               TO                      08920005
079900             AR97-CR-LIFE-PAID-AMT                                08930005
080000     ELSE                                                         08940005
080100        MOVE SPACES           TO                                  08950005
080200             AR97-CR-LIFE-PAID-AMT                                08960005
080300     END-IF                                                       08970005
080400     IF AR69-LS-TERMS-FLAG IS NUMERIC                             08980005
080500        MOVE AR69-LS-TERMS-FLAG           TO  WS-EDIT-S1          08990005
080600        MOVE WS-EDIT-S1                   TO  AR97-LS-TERMS-FLAG  09000005
080700     ELSE                                                         09010005
080800        MOVE SPACES                       TO  AR97-LS-TERMS-FLAG  09020005
080900     END-IF                                                       09030005
081000     IF AR69-CTD-TERMS-FLAG       IS NUMERIC                      09040005
081100        MOVE AR69-CTD-TERMS-FLAG          TO  WS-EDIT-S1          09050005
081200        MOVE WS-EDIT-S1                   TO  AR97-CTD-TERMS-FLAG 09060005
081300     ELSE                                                         09070005
081400        MOVE SPACES                       TO  AR97-CTD-TERMS-FLAG 09080005
081500     END-IF                                                       09090005
081600     IF AR69-TERMS-DATE              IS NUMERIC                   09100005
081700        MOVE AR69-TERMS-DATE               TO WS-EDIT-S7          09110005
081800        MOVE WS-EDIT-S7        TO AR97-TERMS-DATE                 09120005
081900     ELSE                                                         09130005
082000        MOVE SPACES            TO AR97-TERMS-DATE                 09140005
082100     END-IF                                                       09150005
082200     IF AR69-TRANSFER-FLAG        IS NUMERIC                      09160005
082300        MOVE AR69-TRANSFER-FLAG           TO  WS-EDIT-S1          09170005
082400        MOVE WS-EDIT-S1                   TO  AR97-TRANSFER-FLAG  09180005
082500     ELSE                                                         09190005
082600        MOVE SPACES                       TO  AR97-TRANSFER-FLAG  09200005
082700     END-IF                                                       09210005
082800     IF AR69-DATE-LOST-STOLEN        IS NUMERIC                   09220005
082900        MOVE AR69-DATE-LOST-STOLEN         TO WS-EDIT-S7          09230005
083000        MOVE WS-EDIT-S7        TO AR97-DATE-LOST-STOLEN           09240005
083100     ELSE                                                         09250005
083200        MOVE SPACES            TO AR97-DATE-LOST-STOLEN           09260005
083300     END-IF                                                       09270005
083400     MOVE AR69-ACCT-TRANSFER         TO AR97-ACCT-TRANSFER        09280005
083500     MOVE AR69-ACCT-XFOOT            TO AR97-ACCT-XFOOT           09290005
083600     IF AR69-ACCUM-BONUS-AMT         IS NUMERIC                   09300005
083700        MOVE AR69-ACCUM-BONUS-AMT          TO WS-EDIT-S15V99      09310005
083800        MOVE WS-EDIT-S15V99    TO AR97-ACCUM-BONUS-AMT            09320005
083900     ELSE                                                         09330005
084000        MOVE SPACES            TO AR97-ACCUM-BONUS-AMT            09340005
084100     END-IF                                                       09350005
084200     IF AR69-CTD-BONUS-CREDIT        IS NUMERIC                   09360005
084300        MOVE AR69-CTD-BONUS-CREDIT         TO WS-EDIT-S15V99      09370005
084400        MOVE WS-EDIT-S15V99    TO AR97-CTD-BONUS-CREDIT           09380005
084500     ELSE                                                         09390005
084600        MOVE SPACES            TO AR97-CTD-BONUS-CREDIT           09400005
084700     END-IF                                                       09410005
084800     IF AR69-CTD-BONUS-DEBIT         IS NUMERIC                   09420005
084900        MOVE AR69-CTD-BONUS-DEBIT          TO WS-EDIT-S15V99      09430005
085000        MOVE WS-EDIT-S15V99    TO AR97-CTD-BONUS-DEBIT            09440005
085100     ELSE                                                         09450005
085200        MOVE SPACES            TO AR97-CTD-BONUS-DEBIT            09460005
085300     END-IF                                                       09470005
085400     IF AR69-BONUS-QUALIFIED-PURCH   IS NUMERIC                   09480005
085500        MOVE AR69-BONUS-QUALIFIED-PURCH    TO WS-EDIT-S15V99      09490005
085600        MOVE WS-EDIT-S15V99    TO AR97-BONUS-QUALIFIED-PURCH      09500005
085700     ELSE                                                         09510005
085800        MOVE SPACES            TO AR97-BONUS-QUALIFIED-PURCH      09520005
085900     END-IF                                                       09530005
086000     MOVE AR69-BONUS-SELECT-DISBURSE-MTH                          09540005
086100       TO AR97-BONUS-SELECT-DISBURSE-MTH                          09550005
086200     MOVE AR69-BONUS-ACTUAL-DISBURSE-MTH                          09560005
086300       TO AR97-BONUS-ACTUAL-DISBURSE-MTH                          09570005
086400     MOVE AR69-STMT-FEE-FLAG        TO AR97-STMT-FEE-FLAG         09580005
086500     IF AR69-BONUS-PREV-YR-QUAL-PUR  IS NUMERIC                   09590005
086600        MOVE AR69-BONUS-PREV-YR-QUAL-PUR   TO WS-EDIT-S15V99      09600005
086700        MOVE WS-EDIT-S15V99    TO AR97-BONUS-PREV-YR-QUAL-PUR     09610005
086800     ELSE                                                         09620005
086900        MOVE SPACES            TO AR97-BONUS-PREV-YR-QUAL-PUR     09630005
087000     END-IF                                                       09640005
087100     IF AR69-BONUS-PREV-YR-DOLLARS  IS NUMERIC                    09650005
087200        MOVE AR69-BONUS-PREV-YR-DOLLARS   TO WS-EDIT-S15V99       09660005
087300        MOVE WS-EDIT-S15V99    TO AR97-BONUS-PREV-YR-DOLLARS      09670005
087400     ELSE                                                         09680005
087500        MOVE SPACES            TO AR97-BONUS-PREV-YR-DOLLARS      09690005
087600     END-IF                                                       09700005
087700     IF AR69-LAST-CALC-BONUS-AMT   IS NUMERIC                     09710005
087800        MOVE AR69-LAST-CALC-BONUS-AMT    TO WS-EDIT-S15V99        09720005
087900        MOVE WS-EDIT-S15V99    TO AR97-LAST-CALC-BONUS-AMT        09730005
088000     ELSE                                                         09740005
088100        MOVE SPACES            TO AR97-LAST-CALC-BONUS-AMT        09750005
088200     END-IF                                                       09760005
088300     IF AR69-FIXED-PAYMENT-AMT    IS NUMERIC                      09770005
088400        MOVE AR69-FIXED-PAYMENT-AMT     TO WS-EDIT-S15V99         09780005
088500        MOVE WS-EDIT-S15V99    TO AR97-FIXED-PAYMENT-AMT          09790005
088600     ELSE                                                         09800005
088700        MOVE SPACES            TO AR97-FIXED-PAYMENT-AMT          09810005
088800     END-IF                                                       09820005
088900     IF AR69-CASH-FIXED-PAYMENT   IS NUMERIC                      09830005
089000        MOVE AR69-CASH-FIXED-PAYMENT    TO WS-EDIT-S15V99         09840005
089100        MOVE WS-EDIT-S15V99    TO AR97-CASH-FIXED-PAYMENT         09850005
089200     ELSE                                                         09860005
089300        MOVE SPACES            TO AR97-CASH-FIXED-PAYMENT         09870005
089400     END-IF                                                       09880005
089500     IF AR69-ANN-ACTIVITY-SUMM-FLAG IS NUMERIC                    09890005
089600        MOVE AR69-ANN-ACTIVITY-SUMM-FLAG  TO  WS-EDIT-S1          09900005
089700        MOVE WS-EDIT-S1                   TO                      09910005
089800             AR97-ANN-ACTIVITY-SUMM-FLAG                          09920005
089900     ELSE                                                         09930005
090000        MOVE SPACES                  TO                           09940005
090100             AR97-ANN-ACTIVITY-SUMM-FLAG                          09950005
090200     END-IF                                                       09960005
090300     IF AR69-90-DAY-FLAG        IS NUMERIC                        09970005
090400        MOVE AR69-90-DAY-FLAG             TO  WS-EDIT-S1          09980005
090500        MOVE WS-EDIT-S1                   TO  AR97-90-DAY-FLAG    09990005
090600     ELSE                                                         10000005
090700        MOVE SPACES                       TO  AR97-90-DAY-FLAG    10010005
090800     END-IF                                                       10020005
090900     IF AR69-DEFER-PAY-FLAG       IS NUMERIC                      10030005
091000        MOVE AR69-DEFER-PAY-FLAG          TO  WS-EDIT-S1          10040005
091100        MOVE WS-EDIT-S1                   TO  AR97-DEFER-PAY-FLAG 10050005
091200     ELSE                                                         10060005
091300        MOVE SPACES                       TO  AR97-DEFER-PAY-FLAG 10070005
091400     END-IF                                                       10080005
091500     IF AR69-PAY-AHEAD-FLAG       IS NUMERIC                      10090005
091600        MOVE AR69-PAY-AHEAD-FLAG          TO  WS-EDIT-S1          10100005
091700        MOVE WS-EDIT-S1                   TO  AR97-PAY-AHEAD-FLAG 10110005
091800     ELSE                                                         10120005
091900        MOVE SPACES                       TO  AR97-PAY-AHEAD-FLAG 10130005
092000     END-IF                                                       10140005
092100     MOVE AR69-CREDIT-LIFE-FLAG-N   TO AR97-CREDIT-LIFE-FLAG-N    10150005
092200     IF AR69-MAX-REBATE-AMT    IS NUMERIC                         10160005
092300        MOVE AR69-MAX-REBATE-AMT     TO WS-EDIT-S11V99            10170005
092400        MOVE WS-EDIT-S11V99    TO AR97-MAX-REBATE-AMT             10180005
092500     ELSE                                                         10190005
092600        MOVE SPACES            TO AR97-MAX-REBATE-AMT             10200005
092700     END-IF                                                       10210005
092800     MOVE AR69-DELETE-FLAG          TO AR97-DELETE-FLAG           10220005
092900     IF AR69-DUALITY-FLAG         IS NUMERIC                      10230005
093000        MOVE AR69-DUALITY-FLAG            TO  WS-EDIT-S1          10240005
093100        MOVE WS-EDIT-S1                   TO  AR97-DUALITY-FLAG   10250005
093200     ELSE                                                         10260005
093300        MOVE SPACES                       TO  AR97-DUALITY-FLAG   10270005
093400     END-IF                                                       10280005
093500     IF AR69-TYPE-LAST-NONMON IS NUMERIC                          10290005
093600        MOVE AR69-TYPE-LAST-NONMON      TO WS-EDIT-S3             10300005
093700        MOVE WS-EDIT-S3                 TO                        10310005
093800             AR97-TYPE-LAST-NONMON                                10320005
093900     ELSE                                                         10330005
094000        MOVE SPACES           TO                                  10340005
094100             AR97-TYPE-LAST-NONMON                                10350005
094200     END-IF                                                       10360005
095900     IF AR69-SPEC-STMT-FLAG       IS NUMERIC                      10370005
096000        MOVE AR69-SPEC-STMT-FLAG          TO  WS-EDIT-S1          10380005
096100        MOVE WS-EDIT-S1                   TO  AR97-SPEC-STMT-FLAG 10390005
096200     ELSE                                                         10400005
096300        MOVE SPACES                       TO  AR97-SPEC-STMT-FLAG 10410005
096400     END-IF                                                       10420005
096500     IF AR69-PORTFOLIO-NO-OLD IS NUMERIC                          10430005
096600        MOVE AR69-PORTFOLIO-NO-OLD      TO WS-EDIT-S3             10440005
096700        MOVE WS-EDIT-S3                 TO                        10450005
096800             AR97-PORTFOLIO-NO-OLD                                10460005
096900     ELSE                                                         10470005
097000        MOVE SPACES           TO                                  10480005
097100             AR97-PORTFOLIO-NO-OLD                                10490005
097200     END-IF.                                                      10500005
      **************************                                        10510005
       4200-PROCESS-MSTR-REC.                                           10520005
      **************************                                        10530005
097300     MOVE AR69-AUTOPAY-SKIP-FLAG    TO AR97-AUTOPAY-SKIP-FLAG     10540005
097400     MOVE AR69-GROSS-ACTIVE         TO AR97-GROSS-ACTIVE          10550005
097500     MOVE AR69-DEBIT-ACTIVE         TO AR97-DEBIT-ACTIVE          10560005
097600     MOVE AR69-BASIC-ACTIVE         TO AR97-BASIC-ACTIVE          10570005
097700     MOVE AR69-AUTH-FLAG            TO AR97-AUTH-FLAG             10580005
097800     MOVE AR69-INTEREST-SWITCH      TO AR97-INTEREST-SWITCH       10590005
097900     MOVE AR69-STMT-HOLD-FLAG       TO AR97-STMT-HOLD-FLAG        10600005
098000     MOVE AR69-MULTRAN-FLAG         TO AR97-MULTRAN-FLAG          10610005
098100     MOVE AR69-PREM-SUPPLE-INS-FLAG TO AR97-PREM-SUPPLE-INS-FLAG  10620005
098200     MOVE AR69-SPECIAL-RATE-FLAG    TO AR97-SPECIAL-RATE-FLAG     10630005
098300     MOVE AR69-INT-ON-INT-FLAG      TO AR97-INT-ON-INT-FLAG       10640005
098400     MOVE AR69-ADD-STMT-FLAG        TO AR97-ADD-STMT-FLAG         10650005
098500     MOVE AR69-DEBIT-RAT-TYPE       TO AR97-DEBIT-RAT-TYPE        10660005
098600     MOVE AR69-IRS-HOME-EQUITY-FLAG TO AR97-IRS-HOME-EQUITY-FLAG  10670005
098601     IF AR69-WAIV-OVERLATE-FEES = LOW-VALUES                      10680005
098610       MOVE SPACES                    TO AR97-WAIV-OVERLATE-FEES  10690005
098620     ELSE                                                         10700005
098700       MOVE AR69-WAIV-OVERLATE-FEES   TO AR97-WAIV-OVERLATE-FEES  10710005
098710     END-IF                                                       10720005
098800     MOVE AR69-CR-LIFE-STATUS       TO AR97-CR-LIFE-STATUS        10730005
098900     MOVE AR69-CHECK-ORDER-FLAG     TO AR97-CHECK-ORDER-FLAG      10740005
099000     MOVE AR69-CHECK-ORD-SPEC-FLAG  TO AR97-CHECK-ORD-SPEC-FLAG   10750005
099100     IF AR69-LAST-CHECK-NUM-ISSUED  IS NUMERIC                    10760005
099200        MOVE AR69-LAST-CHECK-NUM-ISSUED     TO WS-EDIT-S5         10770005
099300        MOVE WS-EDIT-S5      TO  AR97-LAST-CHECK-NUM-ISSUED       10780005
099400     ELSE                                                         10790005
099500        MOVE SPACES          TO  AR97-LAST-CHECK-NUM-ISSUED       10800005
099600     END-IF                                                       10810005
099700     MOVE AR69-PHONE-CHARGE-FLAG    TO AR97-PHONE-CHARGE-FLAG     10820005
099800     MOVE AR69-CB-ID                TO AR97-CB-ID                 10830005
099900     MOVE AR69-CB-CODE              TO AR97-CB-CODE               10840005
100000     MOVE AR69-CB-ATTR1             TO AR97-CB-ATTR1              10850005
100100     MOVE AR69-CB-ATTR2             TO AR97-CB-ATTR2              10860005
100200     MOVE AR69-CB-ATTR3             TO AR97-CB-ATTR3              10870005
100300     MOVE AR69-CB-REASON1           TO AR97-CB-REASON1            10880005
100400     MOVE AR69-CB-REASON2           TO AR97-CB-REASON2            10890005
100500     MOVE AR69-CB-REASON3           TO AR97-CB-REASON3            10900005
100600     MOVE AR69-CB-REASON4           TO AR97-CB-REASON4            10910005
100700     MOVE AR69-RANDOM-DIGITS        TO AR97-RANDOM-DIGITS         10920005
100800     MOVE AR69-CORRESPOND-FLAG      TO AR97-CORRESPOND-FLAG       10930005
100801     IF AR69-WAIV-OVLMT-RESET = LOW-VALUES                        10940005
100810       MOVE SPACES                    TO AR97-WAIV-OVLMT-RESET    10950005
100820     ELSE                                                         10960005
100900      MOVE AR69-WAIV-OVLMT-RESET     TO AR97-WAIV-OVLMT-RESET     10970005
100910     END-IF                                                       10980005
101000     MOVE AR69-BTI-FIRST-USE-FLAG   TO AR97-BTI-FIRST-USE-FLAG    10990005
101100     MOVE AR69-STI-FIRST-USE-FLAG   TO AR97-STI-FIRST-USE-FLAG    11000005
101200     MOVE AR69-DEF-CR-LIFE-FLAG     TO AR97-DEF-CR-LIFE-FLAG      11010005
101300     MOVE AR69-PRE-ANNUAL-CHG-MESSAGE                             11020005
101400       TO AR97-PRE-ANNUAL-CHG-MESSAGE                             11030005
101500     MOVE AR69-CHDSELCT-SEQ-NO                                    11040005
101600       TO AR97-CHDSELCT-SEQ-NO                                    11050005
101700     IF AR69-SERVICES-MATRIX  > 0                                 11060005
101800        MOVE AR69-SERVICES-MATRIX       TO WS-EDIT-S4             11070005
101900        MOVE WS-EDIT-S4                 TO                        11080005
102000             AR97-SERVICES-MATRIX                                 11090005
102100     ELSE                                                         11100005
102200        MOVE SPACES           TO                                  11110005
102300             AR97-SERVICES-MATRIX                                 11120005
102400     END-IF                                                       11130005
102500     IF AR69-APPLICATION-SCORE   IS NUMERIC                       11140005
102600        MOVE AR69-APPLICATION-SCORE     TO WS-EDIT-S5             11150005
102700        MOVE WS-EDIT-S5                 TO                        11160005
102800             AR97-APPLICATION-SCORE                               11170005
102900     ELSE                                                         11180005
103000        MOVE SPACES           TO                                  11190005
103100             AR97-APPLICATION-SCORE                               11200005
103200     END-IF                                                       11210005
103300     IF AR69-DATE-STATUS-CHG         IS NUMERIC                   11220005
103400        MOVE AR69-DATE-STATUS-CHG          TO WS-EDIT-S7          11230005
103500        MOVE WS-EDIT-S7        TO AR97-DATE-STATUS-CHG            11240005
103600     ELSE                                                         11250005
103700        MOVE SPACES            TO AR97-DATE-STATUS-CHG            11260005
103800     END-IF                                                       11270005
103900     IF AR69-RISK-PREDICTOR-SCORE    IS NUMERIC                   11280005
104000        MOVE AR69-RISK-PREDICTOR-SCORE     TO WS-EDIT-S4          11290005
104100        MOVE WS-EDIT-S4        TO AR97-RISK-PREDICTOR-SCORE       11300005
104200     ELSE                                                         11310005
104300        MOVE SPACES            TO AR97-RISK-PREDICTOR-SCORE       11320005
104400     END-IF                                                       11330005
104500     MOVE AR69-RISK-PREDICTOR-BUREAU                              11340005
104600       TO AR97-RISK-PREDICTOR-BUREAU                              11350005
104700     MOVE AR69-RISK-PREDICTOR-MODEL                               11360005
104800       TO AR97-RISK-PREDICTOR-MODEL                               11370005
104900     MOVE AR69-VISA-REGION   TO  AR97-VISA-REGION                 11380005
105000     MOVE AR69-MC-REGION     TO  AR97-MC-REGION                   11390005
105100     IF AR69-ACCT-TRANSFER-DATE      IS NUMERIC                   11400005
105200        MOVE AR69-ACCT-TRANSFER-DATE       TO WS-EDIT-S5          11410005
105300        MOVE WS-EDIT-S5        TO AR97-ACCT-TRANSFER-DATE         11420005
105400     ELSE                                                         11430005
105500        MOVE SPACES            TO AR97-ACCT-TRANSFER-DATE         11440005
105600     END-IF                                                       11450005
105700     MOVE AR69-ACCT-TRANSFER-FLAG                                 11460005
105800       TO AR97-ACCT-TRANSFER-FLAG                                 11470005
105900     IF AR69-CASH-CREDIT-LINE-CHG-DT  IS NUMERIC                  11480005
106000        MOVE AR69-CASH-CREDIT-LINE-CHG-DT  TO WS-EDIT-S7          11490005
106100        MOVE WS-EDIT-S7        TO AR97-CASH-CREDIT-LINE-CHG-DT    11500005
106200     ELSE                                                         11510005
106300        MOVE SPACES            TO AR97-CASH-CREDIT-LINE-CHG-DT    11520005
106400     END-IF                                                       11530005
106500     MOVE AR69-CASH-CREDIT-LINE-CHG-TYP                           11540005
106600       TO AR97-CASH-CREDIT-LINE-CHG-TYP                           11550005
106700     MOVE AR69-ADD-ON-RATE-FLAG                                   11560005
106800       TO AR97-ADD-ON-RATE-FLAG                                   11570005
106900     MOVE AR69-CURR-PRICING-PORTFOLIO                             11580005
107000       TO AR97-CURR-PRICING-PORTFOLIO                             11590005
107100     MOVE AR69-CURR-PRICING-STRATEGY                              11600005
107200       TO AR97-CURR-PRICING-STRATEGY                              11610005
107300     IF AR69-CURR-PRICE-STRATEGY-DATE IS NUMERIC                  11620005
107400        MOVE AR69-CURR-PRICE-STRATEGY-DATE TO WS-EDIT-S7          11630005
107500        MOVE WS-EDIT-S7        TO AR97-CURR-PRICE-STRATEGY-DATE   11640005
107600     ELSE                                                         11650005
107700        MOVE SPACES            TO AR97-CURR-PRICE-STRATEGY-DATE   11660005
107800     END-IF                                                       11670005
107900     MOVE AR69-CURR-STRAT-CYCLE-FLAG                              11680005
108000       TO AR97-CURR-STRAT-CYCLE-FLAG                              11690005
108100     MOVE AR69-LS-PRCN-PORT-ID                                    11700005
108200       TO AR97-LS-PRCN-PORT-ID                                    11710005
108300     MOVE AR69-OLD-NEXT-PRICING-STRATEGY                          11720005
108400       TO AR97-OLD-NEXT-PRICING-STRATEGY                          11730005
108500     IF AR69-NEXT-PRICE-STRATEGY-DATE > 0                         11740005
108600        MOVE AR69-NEXT-PRICE-STRATEGY-DATE TO WS-EDIT-S4          11750005
108700        MOVE WS-EDIT-S4        TO AR97-NEXT-PRICE-STRATEGY-DATE   11760005
108800     ELSE                                                         11770005
108900        MOVE SPACES            TO AR97-NEXT-PRICE-STRATEGY-DATE   11780005
109000     END-IF                                                       11790005
109100     MOVE AR69-OLD-NEXT-STRAT-CYCLE-FLAG                          11800005
109200       TO AR97-OLD-NEXT-STRAT-CYCLE-FLAG                          11810005
109300     MOVE AR69-OLD-NEXT-STRT-STAGE-RSN                            11820005
109400       TO AR97-OLD-NEXT-STRT-STAGE-RSN                            11830005
109500     MOVE AR69-LS-PRICING-STRATEGY   TO AR97-LS-PRICING-STRATEGY  11840005
109600     IF AR69-LAST-STRATEGY-CHANGE-DATE  IS NUMERIC                11850005
109700        MOVE AR69-LAST-STRATEGY-CHANGE-DATE TO WS-EDIT-S4         11860005
109800        MOVE WS-EDIT-S4        TO AR97-LAST-STRATEGY-CHANGE-DATE  11870005
109900     ELSE                                                         11880005
110000        MOVE SPACES            TO AR97-LAST-STRATEGY-CHANGE-DATE  11890005
110100     END-IF                                                       11900005
110200     MOVE AR69-PROCESSING-LEVEL      TO AR97-PROCESSING-LEVEL     11910005
110300     IF AR69-UD-GEO-CODE           IS NUMERIC                     11920005
110400        MOVE AR69-UD-GEO-CODE           TO WS-EDIT-S3             11930005
110500        MOVE WS-EDIT-S3                 TO AR97-UD-GEO-CODE       11940005
110600     ELSE                                                         11950005
110700        MOVE SPACES           TO AR97-UD-GEO-CODE                 11960005
110800     END-IF                                                       11970005
110900     IF AR69-UD-RISK-SCORE IS NUMERIC                             11980005
111000        MOVE AR69-UD-RISK-SCORE         TO WS-EDIT-S3             11990005
111100        MOVE WS-EDIT-S3                 TO AR97-UD-RISK-SCORE     12000005
111200     ELSE                                                         12010005
111300        MOVE SPACES           TO AR97-UD-RISK-SCORE               12020005
111400     END-IF                                                       12030005
111500     IF AR69-UD-PRODUCT-TYPE IS NUMERIC                           12040005
111600        MOVE AR69-UD-PRODUCT-TYPE    TO WS-EDIT-S3                12050005
111700        MOVE WS-EDIT-S3              TO                           12060005
111800             AR97-UD-PRODUCT-TYPE                                 12070005
111900     ELSE                                                         12080005
112000        MOVE SPACES           TO                                  12090005
112100             AR97-UD-PRODUCT-TYPE                                 12100005
112200     END-IF                                                       12110005
112300     MOVE AR69-RSRVD-FILLER-PRDT-TYP TO AR97-RSRVD-FILLER-PRDT-TYP12120005
112400     MOVE AR69-UD-SOURCE-CODE         TO AR97-UD-SOURCE-CODE      12130005
112500     IF AR69-UD-PROFITABILITY-INDEX IS NUMERIC                    12140005
112600        MOVE AR69-UD-PROFITABILITY-INDEX   TO WS-EDIT-S3          12150005
112700        MOVE WS-EDIT-S3       TO AR97-UD-PROFITABILITY-INDEX      12160005
112800     ELSE                                                         12170005
112900        MOVE SPACES           TO AR97-UD-PROFITABILITY-INDEX      12180005
113000     END-IF                                                       12190005
113100     IF AR69-UD-FINANCIAL-INSTITUTION   IS NUMERIC                12200005
113200        MOVE AR69-UD-FINANCIAL-INSTITUTION TO WS-EDIT-S7          12210005
113300        MOVE WS-EDIT-S7       TO AR97-UD-FINANCIAL-INSTITUTION    12220005
113400     ELSE                                                         12230005
113500        MOVE SPACES           TO AR97-UD-FINANCIAL-INSTITUTION    12240005
113600     END-IF                                                       12250005
113700     IF AR69-UD-BANK-RELATION-CODE IS NUMERIC                     12260005
113800        MOVE AR69-UD-BANK-RELATION-CODE    TO WS-EDIT-S3          12270005
113900        MOVE WS-EDIT-S3 TO AR97-UD-BANK-RELATION-CODE             12280005
114000     ELSE                                                         12290005
114100        MOVE SPACES     TO AR97-UD-BANK-RELATION-CODE             12300005
114200     END-IF                                                       12310005
114300     IF AR69-UD-ATTRITION-INDEX  IS NUMERIC                       12320005
114400        MOVE AR69-UD-ATTRITION-INDEX    TO WS-EDIT-S3             12330005
114500        MOVE WS-EDIT-S3 TO AR97-UD-ATTRITION-INDEX                12340005
114600     ELSE                                                         12350005
114700        MOVE SPACES     TO AR97-UD-ATTRITION-INDEX                12360005
114800     END-IF                                                       12370005
114900     IF AR69-UD-APPROVAL-OFFICER-CODE IS NUMERIC                  12380005
115000        MOVE AR69-UD-APPROVAL-OFFICER-CODE TO WS-EDIT-S7          12390005
115100        MOVE WS-EDIT-S7        TO AR97-UD-APPROVAL-OFFICER-CODE   12400005
115200     ELSE                                                         12410005
115300        MOVE SPACES            TO AR97-UD-APPROVAL-OFFICER-CODE   12420005
115400     END-IF                                                       12430005
115500     IF AR69-UD-LIFESTYLE-IND        IS NUMERIC                   12440005
115600        MOVE AR69-UD-LIFESTYLE-IND         TO WS-EDIT-S7          12450005
115700        MOVE WS-EDIT-S7        TO AR97-UD-LIFESTYLE-IND           12460005
115800     ELSE                                                         12470005
115900        MOVE SPACES            TO AR97-UD-LIFESTYLE-IND           12480005
116000     END-IF                                                       12490005
116100     MOVE AR69-UD-RPT1                TO AR97-UD-RPT1             12500005
116200     MOVE AR69-UD-RPT2                TO AR97-UD-RPT2             12510005
116300     MOVE AR69-UD-RPT3                TO AR97-UD-RPT3             12520005
116400     MOVE AR69-UD-RPT4                TO AR97-UD-RPT4             12530005
116500     IF AR69-UD-AD-MESSAGE-FLAG    IS NUMERIC                     12540005
116600        MOVE AR69-UD-AD-MESSAGE-FLAG    TO WS-EDIT-S3             12550005
116700        MOVE WS-EDIT-S3       TO AR97-UD-AD-MESSAGE-FLAG          12560005
116800     ELSE                                                         12570005
116900        MOVE SPACES           TO AR97-UD-AD-MESSAGE-FLAG          12580005
117000     END-IF.                                                      12590005
      **************************                                        12600005
       4205-PROCESS-MSTR-REC.                                           12610005
      **************************                                        12620005
117100     MOVE AR69-UPC-1                  TO AR97-UPC-1               12630005
117200     MOVE AR69-UPC-2                  TO AR97-UPC-2               12640005
117300     MOVE AR69-UPC-3                  TO AR97-UPC-3               12650005
117400     MOVE AR69-UPC-4                  TO AR97-UPC-4               12660005
117500     MOVE AR69-UPC-5                  TO AR97-UPC-5               12670005
117600     MOVE AR69-UPC-6                  TO AR97-UPC-6               12680005
117700     MOVE AR69-UPC-7                  TO AR97-UPC-7               12690005
117800     MOVE AR69-UPC-8                  TO AR97-UPC-8               12700005
117900     MOVE AR69-UPC-9                  TO AR97-UPC-9               12710005
118000     MOVE AR69-UPC-10                 TO AR97-UPC-10              12720005
118100     MOVE AR69-UPC-11                 TO AR97-UPC-11              12730005
118200     MOVE AR69-UPC-12                 TO AR97-UPC-12              12740005
118300     MOVE AR69-FRAUD-PORT-ID          TO AR97-FRAUD-PORT-ID       12750005
118400     MOVE AR69-FRAUD-ASSG-STRATEGY                                12760005
118500       TO AR97-FRAUD-ASSG-STRATEGY                                12770005
118600     IF AR69-FRAUD-STRAT-CHANGE-DATE  IS NUMERIC                  12780005
118700        MOVE AR69-FRAUD-STRAT-CHANGE-DATE  TO WS-EDIT-S7          12790005
118800        MOVE WS-EDIT-S7        TO AR97-FRAUD-STRAT-CHANGE-DATE    12800005
118900     ELSE                                                         12810005
119000        MOVE SPACES            TO AR97-FRAUD-STRAT-CHANGE-DATE    12820005
119100     END-IF                                                       12830005
119200     IF AR69-FRAUD-SUSP-STRATEGY-DATE IS NUMERIC                  12840005
119300        MOVE AR69-FRAUD-SUSP-STRATEGY-DATE TO WS-EDIT-S7          12850005
119400        MOVE WS-EDIT-S7        TO AR97-FRAUD-SUSP-STRATEGY-DATE   12860005
119500     ELSE                                                         12870005
119600        MOVE SPACES            TO AR97-FRAUD-SUSP-STRATEGY-DATE   12880005
119700     END-IF                                                       12890005
119800     IF AR69-FRAUD-SCORE-CHANGE-DATE  IS NUMERIC                  12900005
119900        MOVE AR69-FRAUD-SCORE-CHANGE-DATE  TO WS-EDIT-S7          12910005
120000        MOVE WS-EDIT-S7        TO AR97-FRAUD-SCORE-CHANGE-DATE    12920005
120100     ELSE                                                         12930005
120200        MOVE SPACES            TO AR97-FRAUD-SCORE-CHANGE-DATE    12940005
120300     END-IF                                                       12950005
120400     IF AR69-FRAUD-SCORE IS NUMERIC                               12960005
120500        MOVE AR69-FRAUD-SCORE           TO WS-EDIT-S3             12970005
120600        MOVE WS-EDIT-S3       TO AR97-FRAUD-SCORE                 12980005
120700     ELSE                                                         12990005
120800        MOVE SPACES           TO AR97-FRAUD-SCORE                 13000005
120900     END-IF                                                       13010005
121000     IF AR69-DATE-LAST-ACL-LTR        IS NUMERIC                  13020005
121100        MOVE AR69-DATE-LAST-ACL-LTR        TO WS-EDIT-S7          13030005
121200        MOVE WS-EDIT-S7        TO AR97-DATE-LAST-ACL-LTR          13040005
121300     ELSE                                                         13050005
121400        MOVE SPACES            TO AR97-DATE-LAST-ACL-LTR          13060005
121500     END-IF                                                       13070005
121600     MOVE AR69-FRAUD-SUSPEND-STRATEGY                             13080005
121700       TO AR97-FRAUD-SUSPEND-STRATEGY                             13090005
121800     MOVE AR69-LAST-PLASTIC-SOURCE                                13100005
121900       TO AR97-LAST-PLASTIC-SOURCE                                13110005
122000     MOVE AR69-DISCOUNT-CODE                                      13120005
122100       TO AR97-DISCOUNT-CODE                                      13130005
122200     IF AR69-DATE-ONE-DAY-PURCH-ELIG  IS NUMERIC                  13140005
122300        MOVE AR69-DATE-ONE-DAY-PURCH-ELIG  TO WS-EDIT-S7          13150005
122400        MOVE WS-EDIT-S7        TO AR97-DATE-ONE-DAY-PURCH-ELIG    13160005
122500     ELSE                                                         13170005
122600        MOVE SPACES            TO AR97-DATE-ONE-DAY-PURCH-ELIG    13180005
122700     END-IF                                                       13190005
122800     IF AR69-NO-DAYS-CLR-ONE-DAY-PURCH IS NUMERIC                 13200005
122900        MOVE AR69-NO-DAYS-CLR-ONE-DAY-PURCH                       13210005
123000          TO WS-EDIT-S3                                           13220005
123100        MOVE WS-EDIT-S3 TO AR97-NO-DAYS-CLR-ONE-DAY-PURCH         13230005
123200     ELSE                                                         13240005
123300        MOVE SPACES     TO AR97-NO-DAYS-CLR-ONE-DAY-PURCH         13250005
123400     END-IF                                                       13260005
123500     IF AR69-DATE-ONE-DAY-PRCH-APPLIED IS NUMERIC                 13270005
123600        MOVE AR69-DATE-ONE-DAY-PRCH-APPLIED  TO WS-EDIT-S7        13280005
123700        MOVE WS-EDIT-S7      TO AR97-DATE-ONE-DAY-PRCH-APPLIED    13290005
123800     ELSE                                                         13300005
123900        MOVE SPACES          TO AR97-DATE-ONE-DAY-PRCH-APPLIED    13310005
124000     END-IF                                                       13320005
124100     IF AR69-ONE-DAY-PURCH-DISC-PCT    IS NUMERIC                 13330005
124200        MOVE AR69-ONE-DAY-PURCH-DISC-PCT     TO WS-EDIT-SV999     13340005
124300        MOVE WS-EDIT-SV999   TO AR97-ONE-DAY-PURCH-DISC-PCT       13350005
124400     ELSE                                                         13360005
124500        MOVE SPACES          TO AR97-ONE-DAY-PURCH-DISC-PCT       13370005
124600     END-IF                                                       13380005
124700     MOVE AR69-ONE-DAY-PURCH-PROMO-ID                             13390005
124800       TO AR97-ONE-DAY-PURCH-PROMO-ID                             13400005
124900     MOVE AR69-MBR-BNFT-CD            TO AR97-MBR-BNFT-CD         13410005
FD1801     MOVE AR69-ANNL-FEE-REVERSED-CD                               13420005
FD1801       TO AR97-ANNL-FEE-REVERSED-CD                               13430005
FD1704     IF AR69-UPGR-DT                   IS NUMERIC                 13440005
FD1704        MOVE AR69-UPGR-DT                    TO WS-EDIT-S9        13450005
FD1704        MOVE WS-EDIT-S9      TO AR97-UPGR-DT                      13460005
FD1704     ELSE                                                         13470005
FD1704        MOVE SPACES          TO AR97-UPGR-DT                      13480005
FD1704     END-IF                                                       13490005
126800     IF AR69-NO-MAIL-FLAG             IS NUMERIC                  13500005
126900        MOVE AR69-NO-MAIL-FLAG            TO  WS-EDIT-S1          13510005
127000        MOVE WS-EDIT-S1                   TO                      13520005
127100             AR97-NO-MAIL-FLAG                                    13530005
127200     ELSE                                                         13540005
127300        MOVE SPACES                       TO                      13550005
127400             AR97-NO-MAIL-FLAG                                    13560005
127500     END-IF                                                       13570005
127600     MOVE AR69-RMRT-TYPE-CD           TO AR97-RMRT-TYPE-CD        13580005
127700     MOVE AR69-LS-PRMT-PRCH-STMT-IN                               13590005
127800       TO AR97-LS-PRMT-PRCH-STMT-IN                               13600005
127900     MOVE AR69-PRICING-STRATEGY-STATUS                            13610005
128000       TO AR97-PRICING-STRATEGY-STATUS                            13620005
128100     IF AR69-PRICING-STRATEGY-LOCK-BEG IS NUMERIC                 13630005
128200        MOVE AR69-PRICING-STRATEGY-LOCK-BEG TO WS-EDIT-S7         13640005
128300        MOVE WS-EDIT-S7                   TO                      13650005
128400             AR97-PRICING-STRATEGY-LOCK-BEG                       13660005
128500     ELSE                                                         13670005
128600        MOVE SPACES                       TO                      13680005
128700             AR97-PRICING-STRATEGY-LOCK-BEG                       13690005
128800     END-IF                                                       13700005
128900     IF AR69-PRICING-STRATEGY-LOCK-END IS NUMERIC                 13710005
129000        MOVE AR69-PRICING-STRATEGY-LOCK-END TO WS-EDIT-S7         13720005
129100        MOVE WS-EDIT-S7                   TO                      13730005
129200             AR97-PRICING-STRATEGY-LOCK-END                       13740005
129300     ELSE                                                         13750005
129400        MOVE SPACES                       TO                      13760005
129500             AR97-PRICING-STRATEGY-LOCK-END                       13770005
129600     END-IF                                                       13780005
129700     IF AR69-CTD-PARTNER-DEBITS        IS NUMERIC                 13790005
129800        MOVE AR69-CTD-PARTNER-DEBITS        TO WS-EDIT-S15V99     13800005
129900        MOVE WS-EDIT-S15V99               TO                      13810005
130000             AR97-CTD-PARTNER-DEBITS                              13820005
130100     ELSE                                                         13830005
130200        MOVE SPACES                       TO                      13840005
130300             AR97-CTD-PARTNER-DEBITS                              13850005
130400     END-IF                                                       13860005
130500     IF AR69-YTD-UNUSD-PRTNR-REBATES   IS NUMERIC                 13870005
130600        MOVE AR69-YTD-UNUSD-PRTNR-REBATES   TO WS-EDIT-S15V99     13880005
130700        MOVE WS-EDIT-S15V99               TO                      13890005
130800             AR97-YTD-UNUSD-PRTNR-REBATES                         13900005
130900     ELSE                                                         13910005
131000        MOVE SPACES                       TO                      13920005
131100             AR97-YTD-UNUSD-PRTNR-REBATES                         13930005
131200     END-IF                                                       13940005
131300     IF AR69-LSTYR-UNUSD-PRTNR-REBT    IS NUMERIC                 13950005
131400        MOVE AR69-LSTYR-UNUSD-PRTNR-REBT    TO WS-EDIT-S15V99     13960005
131500        MOVE WS-EDIT-S15V99               TO                      13970005
131600             AR97-LSTYR-UNUSD-PRTNR-REBT                          13980005
131700     ELSE                                                         13990005
131800        MOVE SPACES                       TO                      14000005
131900             AR97-LSTYR-UNUSD-PRTNR-REBT                          14010005
132000     END-IF                                                       14020005
132100     IF AR69-YTD-PARTNER-EARNED        IS NUMERIC                 14030005
132200        MOVE AR69-YTD-PARTNER-EARNED        TO WS-EDIT-S15V99     14040005
132300        MOVE WS-EDIT-S15V99               TO                      14050005
132400             AR97-YTD-PARTNER-EARNED                              14060005
132500     ELSE                                                         14070005
132600        MOVE SPACES                       TO                      14080005
132700             AR97-YTD-PARTNER-EARNED                              14090005
132800     END-IF                                                       14100005
132900     IF AR69-LIFTIME-PRTNR-EARNED      IS NUMERIC                 14110005
133000        MOVE AR69-LIFTIME-PRTNR-EARNED      TO WS-EDIT-S15V99     14120005
133100        MOVE WS-EDIT-S15V99               TO                      14130005
133200             AR97-LIFTIME-PRTNR-EARNED                            14140005
133300     ELSE                                                         14150005
133400        MOVE SPACES                       TO                      14160005
133500             AR97-LIFTIME-PRTNR-EARNED                            14170005
133600     END-IF                                                       14180005
133700     MOVE AR69-BONUS-STRATEGY         TO AR97-BONUS-STRATEGY      14190005
133800     MOVE AR69-LS-BONUS-STRATEGY      TO AR97-LS-BONUS-STRATEGY   14200005
133900     IF AR69-ADJ-EXPIRATION-DATE > 0                              14210005
134000        MOVE AR69-ADJ-EXPIRATION-DATE       TO WS-EDIT-S4         14220005
134100        MOVE WS-EDIT-S4                   TO                      14230005
134200             AR97-ADJ-EXPIRATION-DATE                             14240005
134300     ELSE                                                         14250005
134400        MOVE SPACES                       TO                      14260005
134500             AR97-ADJ-EXPIRATION-DATE                             14270005
134600     END-IF                                                       14280005
134700     IF AR69-ADJ-REISSUE-INTVL > 0                                14290005
134800        MOVE AR69-ADJ-REISSUE-INTVL         TO WS-EDIT-S4         14300005
134900        MOVE WS-EDIT-S4                   TO                      14310005
135000             AR97-ADJ-REISSUE-INTVL                               14320005
135100     ELSE                                                         14330005
135200        MOVE SPACES                       TO                      14340005
135300             AR97-ADJ-REISSUE-INTVL                               14350005
135400     END-IF                                                       14360005
135500     MOVE AR69-LAST-ANNUAL-CHARGE-FLAG                            14370005
135600       TO AR97-LAST-ANNUAL-CHARGE-FLAG                            14380005
135700     MOVE AR69-HOME-BANK-IND          TO AR97-HOME-BANK-IND       14390005
135800     IF AR69-HIGH-BAL-LIFE             IS NUMERIC                 14400005
135900        MOVE AR69-HIGH-BAL-LIFE             TO WS-EDIT-S15V99     14410005
136000        MOVE WS-EDIT-S15V99               TO                      14420005
136100             AR97-HIGH-BAL-LIFE                                   14430005
136200     ELSE                                                         14440005
136300        MOVE SPACES                       TO                      14450005
136400             AR97-HIGH-BAL-LIFE                                   14460005
136500     END-IF                                                       14470005
136600     IF AR69-MIN-DAYS-DELQ-NR IS NUMERIC                          14480005
136700        MOVE AR69-MIN-DAYS-DELQ-NR   TO WS-EDIT-S3                14490005
136800        MOVE WS-EDIT-S3       TO AR97-MIN-DAYS-DELQ-NR            14500005
136900     ELSE                                                         14510005
137000        MOVE SPACES           TO AR97-MIN-DAYS-DELQ-NR            14520005
137100     END-IF                                                       14530005
137200     MOVE AR69-ACS-CLNT-ID            TO AR97-ACS-CLNT-ID         14540005
137300     MOVE AR69-ACS-CURR-PORT          TO AR97-ACS-CURR-PORT       14550005
137400     MOVE AR69-ACS-RNDM-DGT           TO AR97-ACS-RNDM-DGT        14560005
137500     IF AR69-ACS-PORT-CHG-DATE       IS NUMERIC                   14570005
137600        MOVE AR69-ACS-PORT-CHG-DATE  TO WS-EDIT-S9                14580005
137700        MOVE WS-EDIT-S9       TO AR97-ACS-PORT-CHG-DATE           14590005
137800     ELSE                                                         14600005
137900        MOVE SPACES           TO AR97-ACS-PORT-CHG-DATE           14610005
138000     END-IF                                                       14620005
138100     MOVE AR69-ACS-OVERRIDE-PORT      TO AR97-ACS-OVERRIDE-PORT   14630005
138200     MOVE AR69-ALTERNATE-LANGUAGE-FLAG                            14640005
138300       TO AR97-ALTERNATE-LANGUAGE-FLAG                            14650005
138400     MOVE AR69-XCEPT-CHARGE-OFF-FLAG                              14660005
138500       TO AR97-XCEPT-CHARGE-OFF-FLAG                              14670005
138600     MOVE AR69-NOTE-OF-NEG-RPT                                    14680005
138700       TO AR97-NOTE-OF-NEG-RPT                                    14690005
138800     MOVE AR69-PREV-INTERNAL-STATUS                               14700005
138900       TO AR97-PREV-INTERNAL-STATUS                               14710005
139000     IF AR69-DATE-IN-COLLECTION      IS NUMERIC                   14720005
139100        MOVE AR69-DATE-IN-COLLECTION TO WS-EDIT-S9                14730005
139200        MOVE WS-EDIT-S9       TO AR97-DATE-IN-COLLECTION          14740005
139300     ELSE                                                         14750005
139400        MOVE SPACES           TO AR97-DATE-IN-COLLECTION          14760005
139500     END-IF                                                       14770005
139600     IF AR69-START-DATE-OF-DELQ      IS NUMERIC                   14780005
139700        MOVE AR69-START-DATE-OF-DELQ TO WS-EDIT-S9                14790005
139800        MOVE WS-EDIT-S9       TO AR97-START-DATE-OF-DELQ          14800005
139900     ELSE                                                         14810005
140000        MOVE SPACES           TO AR97-START-DATE-OF-DELQ          14820005
140100     END-IF                                                       14830005
140200     IF AR69-RECOVER-DOLLARS-FACTOR  IS NUMERIC                   14840005
140300        MOVE AR69-RECOVER-DOLLARS-FACTOR  TO WS-EDIT-S1V94        14850005
140400        MOVE WS-EDIT-S1V94    TO AR97-RECOVER-DOLLARS-FACTOR      14860005
140500     ELSE                                                         14870005
140600        MOVE SPACES           TO AR97-RECOVER-DOLLARS-FACTOR      14880005
140700     END-IF                                                       14890005
140800     MOVE AR69-PRIMARY-PEF            TO AR97-PRIMARY-PEF         14900005
140900     MOVE AR69-SECONDARY-PEF          TO AR97-SECONDARY-PEF       14910005
141000     MOVE AR69-LATE-FEE-WAIVER-CT     TO AR97-LATE-FEE-WAIVER-CT  14920005
141100     MOVE AR69-COV-STRATEGY-ID        TO AR97-COV-STRATEGY-ID     14930005
141200     PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 6              14940005
141300       MOVE AR69-CLI-PRODUCT-CODE (WS-I)                          14950005
141400         TO AR97-CLI-PRODUCT-CODE (WS-I)                          14960005
141500       IF AR69-CLI-EFFECTIVE-DATE           (WS-I) IS NUMERIC AND 14970005
141600          AR69-CLI-EFFECTIVE-DATE           (WS-I) > 0            14980005
141700          MOVE AR69-CLI-EFFECTIVE-DATE      (WS-I) TO WS-EDIT-S7  14990005
141800          MOVE WS-EDIT-S7 TO AR97-CLI-EFFECTIVE-DATE  (WS-I)      15000005
141900       ELSE                                                       15010005
142000          MOVE SPACES     TO AR97-CLI-EFFECTIVE-DATE  (WS-I)      15020005
142100       END-IF                                                     15030005
142200       MOVE AR69-CLI-RATE-STATE   (WS-I)                          15040005
142300         TO AR97-CLI-RATE-STATE   (WS-I)                          15050005
142400       MOVE AR69-CLI-STATUS-CODE  (WS-I)                          15060005
142500         TO AR97-CLI-STATUS-CODE  (WS-I)                          15070005
142600       IF AR69-CLI-FREE-CYCLES-REMAIN       (WS-I) IS NUMERIC     15080005
142700          MOVE AR69-CLI-FREE-CYCLES-REMAIN  (WS-I) TO WS-EDIT-S3  15090005
142800          MOVE WS-EDIT-S3 TO AR97-CLI-FREE-CYCLES-REMAIN (WS-I)   15100005
142900       ELSE                                                       15110005
143000          MOVE SPACES     TO AR97-CLI-FREE-CYCLES-REMAIN (WS-I)   15120005
143100       END-IF                                                     15130005
143200     END-PERFORM                                                  15140005
143300     IF AR69-LAST-PARTNER-EARNED        IS NUMERIC                15150005
143400        MOVE AR69-LAST-PARTNER-EARNED   TO WS-EDIT-S15V99         15160005
143500        MOVE WS-EDIT-S15V99   TO AR97-LAST-PARTNER-EARNED         15170005
143600     ELSE                                                         15180005
143700        MOVE SPACES           TO AR97-LAST-PARTNER-EARNED         15190005
143800     END-IF                                                       15200005
143900     IF AR69-CTD-PRTNR-SALE-ADJ         IS NUMERIC                15210005
144000        MOVE AR69-CTD-PRTNR-SALE-ADJ    TO WS-EDIT-S15V99         15220005
144100        MOVE WS-EDIT-S15V99   TO AR97-CTD-PRTNR-SALE-ADJ          15230005
144200     ELSE                                                         15240005
144300        MOVE SPACES           TO AR97-CTD-PRTNR-SALE-ADJ          15250005
144400     END-IF                                                       15260005
144500     IF AR69-CTD-PRTNR-RTRN-ADJ         IS NUMERIC                15270005
144600        MOVE AR69-CTD-PRTNR-RTRN-ADJ    TO WS-EDIT-S15V99         15280005
144700        MOVE WS-EDIT-S15V99   TO AR97-CTD-PRTNR-RTRN-ADJ          15290005
144800     ELSE                                                         15300005
144900        MOVE SPACES           TO AR97-CTD-PRTNR-RTRN-ADJ          15310005
145000     END-IF                                                       15320005
145100     IF AR69-BS-REASON-CODE-1           IS NUMERIC                15330005
145200        MOVE AR69-BS-REASON-CODE-1      TO WS-EDIT-S7             15340005
145300        MOVE WS-EDIT-S7       TO AR97-BS-REASON-CODE-1            15350005
145400     ELSE                                                         15360005
145500        MOVE SPACES           TO AR97-BS-REASON-CODE-1            15370005
145600     END-IF                                                       15380005
145700     IF AR69-BS-REASON-CODE-2           IS NUMERIC                15390005
145800        MOVE AR69-BS-REASON-CODE-2      TO WS-EDIT-S7             15400005
145900        MOVE WS-EDIT-S7       TO AR97-BS-REASON-CODE-2            15410005
146000     ELSE                                                         15420005
146100        MOVE SPACES           TO AR97-BS-REASON-CODE-2            15430005
146200     END-IF                                                       15440005
146300     IF AR69-BS-REASON-CODE-3           IS NUMERIC                15450005
146400        MOVE AR69-BS-REASON-CODE-3      TO WS-EDIT-S7             15460005
146500        MOVE WS-EDIT-S7       TO AR97-BS-REASON-CODE-3            15470005
146600     ELSE                                                         15480005
146700        MOVE SPACES           TO AR97-BS-REASON-CODE-3            15490005
146800     END-IF                                                       15500005
146900     IF AR69-BS-REASON-CODE-4           IS NUMERIC                15510005
147000        MOVE AR69-BS-REASON-CODE-4      TO WS-EDIT-S7             15520005
147100        MOVE WS-EDIT-S7       TO AR97-BS-REASON-CODE-4            15530005
147200     ELSE                                                         15540005
147300        MOVE SPACES           TO AR97-BS-REASON-CODE-4            15550005
147400     END-IF                                                       15560005
147500     IF AR69-LIFTIME-REBATE-PTS         IS NUMERIC                15570005
147600        MOVE AR69-LIFTIME-REBATE-PTS    TO WS-EDIT-S15V99         15580005
147700        MOVE WS-EDIT-S15V99   TO AR97-LIFTIME-REBATE-PTS          15590005
147800     ELSE                                                         15600005
147900        MOVE SPACES           TO AR97-LIFTIME-REBATE-PTS          15610005
148000     END-IF                                                       15620005
148100     MOVE AR69-TESR-QLFD-IN           TO AR97-TESR-QLFD-IN        15630005
148200     IF AR69-PRTNR-BONUS-QUAL-PURCH     IS NUMERIC                15640005
148300        MOVE AR69-PRTNR-BONUS-QUAL-PURCH TO WS-EDIT-S15V99        15650005
148400        MOVE WS-EDIT-S15V99   TO AR97-PRTNR-BONUS-QUAL-PURCH      15660005
148500     ELSE                                                         15670005
148600        MOVE SPACES           TO AR97-PRTNR-BONUS-QUAL-PURCH      15680005
148700     END-IF                                                       15690005
148800     IF AR69-CTD-PRTNR-RETURNS          IS NUMERIC                15700005
148900        MOVE AR69-CTD-PRTNR-RETURNS      TO WS-EDIT-S15V99        15710005
149000        MOVE WS-EDIT-S15V99   TO AR97-CTD-PRTNR-RETURNS           15720005
149100     ELSE                                                         15730005
149200        MOVE SPACES           TO AR97-CTD-PRTNR-RETURNS           15740005
149300     END-IF                                                       15750005
149400     MOVE AR69-CACS-REASON            TO AR97-CACS-REASON         15760005
149500     MOVE AR69-CACS-USER-ROUTING      TO AR97-CACS-USER-ROUTING   15770005
149600     MOVE AR69-CACS-COLLECTOR         TO AR97-CACS-COLLECTOR      15780005
149700     IF AR69-REQ-CLOSED-DATE            IS NUMERIC                15790005
149800        MOVE AR69-REQ-CLOSED-DATE        TO WS-EDIT-S9            15800005
149900        MOVE WS-EDIT-S9       TO AR97-REQ-CLOSED-DATE             15810005
150000     ELSE                                                         15820005
150100        MOVE SPACES           TO AR97-REQ-CLOSED-DATE             15830005
150200     END-IF                                                       15840005
150300     IF AR69-PIN-CHANGE-DATE            IS NUMERIC                15850005
150400        MOVE AR69-PIN-CHANGE-DATE        TO WS-EDIT-S9            15860005
150500        MOVE WS-EDIT-S9       TO AR97-PIN-CHANGE-DATE             15870005
150600     ELSE                                                         15880005
150700        MOVE SPACES           TO AR97-PIN-CHANGE-DATE             15890005
150800     END-IF                                                       15900005
150900     IF AR69-PREV-CRLINE-CHANGE-DATE > 0                          15910005
151000        MOVE AR69-PREV-CRLINE-CHANGE-DATE TO WS-EDIT-S4           15920005
151100        MOVE WS-EDIT-S4       TO AR97-PREV-CRLINE-CHANGE-DATE     15930005
151200     ELSE                                                         15940005
151300        MOVE SPACES           TO AR97-PREV-CRLINE-CHANGE-DATE     15950005
151400     END-IF                                                       15960005
151500     IF AR69-CRLINE-CHANGE-AMT          IS NUMERIC                15970005
151600        MOVE AR69-CRLINE-CHANGE-AMT       TO WS-EDIT-S15          15980005
151700        MOVE WS-EDIT-S15      TO AR97-CRLINE-CHANGE-AMT           15990005
151800     ELSE                                                         16000005
151900        MOVE SPACES           TO AR97-CRLINE-CHANGE-AMT           16010005
152000     END-IF                                                       16020005
152100     MOVE AR69-PHONE-CARD-ID          TO AR97-PHONE-CARD-ID       16030005
152200     IF AR69-IP-START-DATE              IS NUMERIC                16040005
152300        MOVE AR69-IP-START-DATE           TO WS-EDIT-S9           16050005
152400        MOVE WS-EDIT-S9       TO AR97-IP-START-DATE               16060005
152500     ELSE                                                         16070005
152600        MOVE SPACES           TO AR97-IP-START-DATE               16080005
152700     END-IF                                                       16090005
152800     IF AR69-IP-EFF-END-DATE            IS NUMERIC                16100005
152900        MOVE AR69-IP-EFF-END-DATE         TO WS-EDIT-S9           16110005
153000        MOVE WS-EDIT-S9       TO AR97-IP-EFF-END-DATE             16120005
153100     ELSE                                                         16130005
153200        MOVE SPACES           TO AR97-IP-EFF-END-DATE             16140005
153300     END-IF                                                       16150005
153400     IF AR69-IP-PLANNED-END-DATE        IS NUMERIC                16160005
153500        MOVE AR69-IP-PLANNED-END-DATE     TO WS-EDIT-S9           16170005
153600        MOVE WS-EDIT-S9       TO AR97-IP-PLANNED-END-DATE         16180005
153700     ELSE                                                         16190005
153800        MOVE SPACES           TO AR97-IP-PLANNED-END-DATE         16200005
153900     END-IF                                                       16210005
154000     IF AR69-IP-CASH-RATE-ANN           IS NUMERIC                16220005
154100        MOVE AR69-IP-CASH-RATE-ANN        TO WS-EDIT-S2V999       16230005
154200        MOVE WS-EDIT-S2V999   TO AR97-IP-CASH-RATE-ANN            16240005
154300     ELSE                                                         16250005
154400        MOVE SPACES           TO AR97-IP-CASH-RATE-ANN            16260005
154500     END-IF                                                       16270005
154600     IF AR69-IP-CASH-RATE-MONTHLY       IS NUMERIC                16280005
154700        MOVE AR69-IP-CASH-RATE-MONTHLY    TO WS-EDIT-SV95         16290005
154800        MOVE WS-EDIT-SV95     TO AR97-IP-CASH-RATE-MONTHLY        16300005
154900     ELSE                                                         16310005
155000        MOVE SPACES           TO AR97-IP-CASH-RATE-MONTHLY        16320005
155100     END-IF                                                       16330005
155200     IF AR69-IP-CASH-RATE-DAILY         IS NUMERIC                16340005
155300        MOVE AR69-IP-CASH-RATE-DAILY      TO WS-EDIT-SV97         16350005
155400        MOVE WS-EDIT-SV97     TO AR97-IP-CASH-RATE-DAILY          16360005
155500     ELSE                                                         16370005
155600        MOVE SPACES           TO AR97-IP-CASH-RATE-DAILY          16380005
155700     END-IF                                                       16390005
155800     IF AR69-IP-MRCH-RATE-ANN           IS NUMERIC                16400005
155900        MOVE AR69-IP-MRCH-RATE-ANN        TO WS-EDIT-S2V999       16410005
156000        MOVE WS-EDIT-S2V999   TO AR97-IP-MRCH-RATE-ANN            16420005
156100     ELSE                                                         16430005
156200        MOVE SPACES           TO AR97-IP-MRCH-RATE-ANN            16440005
156300     END-IF                                                       16450005
156400     IF AR69-IP-MRCH-RATE-MONTHLY       IS NUMERIC                16460005
156500        MOVE AR69-IP-MRCH-RATE-MONTHLY    TO WS-EDIT-SV95         16470005
156600        MOVE WS-EDIT-SV95     TO AR97-IP-MRCH-RATE-MONTHLY        16480005
156700     ELSE                                                         16490005
156800        MOVE SPACES           TO AR97-IP-MRCH-RATE-MONTHLY        16500005
156900     END-IF                                                       16510005
157000     IF AR69-IP-MRCH-RATE-DAILY         IS NUMERIC                16520005
157100        MOVE AR69-IP-MRCH-RATE-DAILY      TO WS-EDIT-SV97         16530005
157200        MOVE WS-EDIT-SV97     TO AR97-IP-MRCH-RATE-DAILY          16540005
157300     ELSE                                                         16550005
157400        MOVE SPACES           TO AR97-IP-MRCH-RATE-DAILY          16560005
157500     END-IF                                                       16570005
157600     IF AR69-PP-EXCL-ADD-ON-FLAG        IS NUMERIC                16580005
157700        MOVE AR69-PP-EXCL-ADD-ON-FLAG     TO WS-EDIT-S2           16590005
157800        MOVE WS-EDIT-S2       TO AR97-PP-EXCL-ADD-ON-FLAG         16600005
157900     ELSE                                                         16610005
158000        MOVE SPACES           TO AR97-PP-EXCL-ADD-ON-FLAG         16620005
158100     END-IF                                                       16630005
158200     IF AR69-PP-EXCL-MPD-FLAG           IS NUMERIC                16640005
158300        MOVE AR69-PP-EXCL-MPD-FLAG        TO WS-EDIT-S2           16650005
158400        MOVE WS-EDIT-S2       TO AR97-PP-EXCL-MPD-FLAG            16660005
158500     ELSE                                                         16670005
158600        MOVE SPACES           TO AR97-PP-EXCL-MPD-FLAG            16680005
158700     END-IF                                                       16690005
158800     MOVE AR69-PP-CURE-FLAG           TO AR97-PP-CURE-FLAG        16700005
158900     IF AR69-DATE-LAST-RSNCD-CHNG       IS NUMERIC                16710005
159000        MOVE AR69-DATE-LAST-RSNCD-CHNG    TO WS-EDIT-S9           16720005
159100        MOVE WS-EDIT-S9       TO AR97-DATE-LAST-RSNCD-CHNG        16730005
159200     ELSE                                                         16740005
159300        MOVE SPACES           TO AR97-DATE-LAST-RSNCD-CHNG        16750005
159400     END-IF                                                       16760005
159500     MOVE AR69-AT-AUTH-AGAINST-NEW    TO AR97-AT-AUTH-AGAINST-NEW 16770005
159600     MOVE AR69-CIMS-PRODUCT-CODE      TO AR97-CIMS-PRODUCT-CODE   16780005
159700     IF AR69-LOST-ACCUM                 IS NUMERIC                16790005
159800        MOVE AR69-LOST-ACCUM              TO WS-EDIT-S3           16800005
159900        MOVE WS-EDIT-S3       TO AR97-LOST-ACCUM                  16810005
160000     ELSE                                                         16820005
160100        MOVE SPACES           TO AR97-LOST-ACCUM                  16830005
160200     END-IF                                                       16840005
160300     IF AR69-STOLEN-ACCUM               IS NUMERIC                16850005
160400        MOVE AR69-STOLEN-ACCUM            TO WS-EDIT-S3           16860005
160500        MOVE WS-EDIT-S3       TO AR97-STOLEN-ACCUM                16870005
160600     ELSE                                                         16880005
160700        MOVE SPACES           TO AR97-STOLEN-ACCUM                16890005
160800     END-IF                                                       16900005
160900     MOVE AR69-TEMP-PLASTIC-IND       TO AR97-TEMP-PLASTIC-IND    16910005
161000     MOVE AR69-SKIP-PAY-HISTORY       TO AR97-SKIP-PAY-HISTORY    16920005
161100     MOVE AR69-LAST-CRDT-BURE-IN      TO AR97-LAST-CRDT-BURE-IN   16930005
161200     MOVE AR69-SKIP-ELGB-IN           TO AR97-SKIP-ELGB-IN        16940005
161300     IF AR69-AUTO-STRT-DT               IS NUMERIC                16950005
161400        MOVE AR69-AUTO-STRT-DT            TO WS-EDIT-S9           16960005
161500        MOVE WS-EDIT-S9       TO AR97-AUTO-STRT-DT                16970005
161600     ELSE                                                         16980005
161700        MOVE SPACES           TO AR97-AUTO-STRT-DT                16990005
161800     END-IF                                                       17000005
161900     IF AR69-AUTO-END-DT                IS NUMERIC                17010005
162000        MOVE AR69-AUTO-END-DT             TO WS-EDIT-S9           17020005
162100        MOVE WS-EDIT-S9       TO AR97-AUTO-END-DT                 17030005
162200     ELSE                                                         17040005
162300        MOVE SPACES           TO AR97-AUTO-END-DT                 17050005
162400     END-IF                                                       17060005
162500     IF AR69-CASH-CRDT-LINE-AM          IS NUMERIC                17070005
162600        MOVE AR69-CASH-CRDT-LINE-AM       TO WS-EDIT-S15          17080005
162700        MOVE WS-EDIT-S15      TO AR97-CASH-CRDT-LINE-AM           17090005
162800     ELSE                                                         17100005
162900        MOVE SPACES           TO AR97-CASH-CRDT-LINE-AM           17110005
163000     END-IF                                                       17120005
163100     IF AR69-CASH-LINE-REVW-DT          IS NUMERIC                17130005
163200        MOVE AR69-AUTO-END-DT             TO WS-EDIT-S7           17140005
163300        MOVE WS-EDIT-S7       TO AR97-CASH-LINE-REVW-DT           17150005
163400     ELSE                                                         17160005
163500        MOVE SPACES           TO AR97-CASH-LINE-REVW-DT           17170005
163600     END-IF                                                       17180005
163700     MOVE AR69-CASH-LINE-ADJS-CD      TO AR97-CASH-LINE-ADJS-CD   17190005
163800     MOVE AR69-PLST-DLAY-DAY-CT       TO AR97-PLST-DLAY-DAY-CT    17200005
163900     IF AR69-MIN-PMNT-DUE-STRT-DT       IS NUMERIC                17210005
164000        MOVE AR69-MIN-PMNT-DUE-STRT-DT    TO WS-EDIT-S9           17220005
164100        MOVE WS-EDIT-S9       TO AR97-MIN-PMNT-DUE-STRT-DT        17230005
164200     ELSE                                                         17240005
164300        MOVE SPACES           TO AR97-MIN-PMNT-DUE-STRT-DT        17250005
164400     END-IF                                                       17260005
164500     IF AR69-MIN-PMNT-DUE-END-DT        IS NUMERIC                17270005
164600        MOVE AR69-MIN-PMNT-DUE-END-DT     TO WS-EDIT-S9           17280005
164700        MOVE WS-EDIT-S9       TO AR97-MIN-PMNT-DUE-END-DT         17290005
164800     ELSE                                                         17300005
164900        MOVE SPACES           TO AR97-MIN-PMNT-DUE-END-DT         17310005
165000     END-IF                                                       17320005
165100     MOVE AR69-MIN-PMNT-DUE-OVRR-CD   TO AR97-MIN-PMNT-DUE-OVRR-CD17330005
165200     IF AR69-MIN-PMNT-DUE-RT            IS NUMERIC                17340005
165300        MOVE AR69-MIN-PMNT-DUE-RT         TO WS-EDIT-S9V96        17350005
165400        MOVE WS-EDIT-S9V96    TO AR97-MIN-PMNT-DUE-RT             17360005
165500     ELSE                                                         17370005
165600        MOVE SPACES           TO AR97-MIN-PMNT-DUE-RT             17380005
165700     END-IF                                                       17390005
165800     IF AR69-FIXD-PMNT-FUTR-AM          IS NUMERIC                17400005
165900        MOVE AR69-FIXD-PMNT-FUTR-AM       TO WS-EDIT-S15V99       17410005
166000        MOVE WS-EDIT-S15V99   TO AR97-FIXD-PMNT-FUTR-AM           17420005
166100     ELSE                                                         17430005
166200        MOVE SPACES           TO AR97-FIXD-PMNT-FUTR-AM           17440005
166300     END-IF                                                       17450005
166400     IF AR69-SHDW-LINE-AM               IS NUMERIC                17460005
166500        MOVE AR69-SHDW-LINE-AM            TO WS-EDIT-S15V99       17470005
166600        MOVE WS-EDIT-S15V99   TO AR97-SHDW-LINE-AM                17480005
166700     ELSE                                                         17490005
166800        MOVE SPACES           TO AR97-SHDW-LINE-AM                17500005
166900     END-IF                                                       17510005
167000     IF AR69-SHDW-LINE-CHNG-DT          IS NUMERIC                17520005
167100        MOVE AR69-SHDW-LINE-CHNG-DT       TO WS-EDIT-S9           17530005
167200        MOVE WS-EDIT-S9       TO AR97-SHDW-LINE-CHNG-DT           17540005
167300     ELSE                                                         17550005
167400        MOVE SPACES           TO AR97-SHDW-LINE-CHNG-DT           17560005
167500     END-IF                                                       17570005
167600     IF AR69-SHDW-LINE-EXPR-DT          IS NUMERIC                17580005
167700        MOVE AR69-SHDW-LINE-EXPR-DT       TO WS-EDIT-S9           17590005
167800        MOVE WS-EDIT-S9       TO AR97-SHDW-LINE-EXPR-DT           17600005
167900     ELSE                                                         17610005
168000        MOVE SPACES           TO AR97-SHDW-LINE-EXPR-DT           17620005
168100     END-IF                                                       17630005
168200     IF AR69-SHDW-LINE-REVW-DT          IS NUMERIC                17640005
168300        MOVE AR69-SHDW-LINE-REVW-DT       TO WS-EDIT-S7           17650005
168400        MOVE WS-EDIT-S7       TO AR97-SHDW-LINE-REVW-DT           17660005
168500     ELSE                                                         17670005
168600        MOVE SPACES           TO AR97-SHDW-LINE-REVW-DT           17680005
168700     END-IF                                                       17690005
168800     MOVE AR69-LS-OVRL-FEE-WAVR-ID    TO AR97-LS-OVRL-FEE-WAVR-ID 17700005
168900     MOVE AR69-LAST-SKIP-PAY-CD       TO AR97-LAST-SKIP-PAY-CD    17710005
169000     IF AR69-RSRV-CRDT-LINE-PRCN-RT     IS NUMERIC                17720005
169100        MOVE AR69-RSRV-CRDT-LINE-PRCN-RT  TO WS-EDIT-S1V99        17730005
169200        MOVE WS-EDIT-S1V99    TO AR97-RSRV-CRDT-LINE-PRCN-RT      17740005
169300     ELSE                                                         17750005
169400        MOVE SPACES           TO AR97-RSRV-CRDT-LINE-PRCN-RT      17760005
169500     END-IF                                                       17770005
169600     IF AR69-RSRV-CRDT-LINE-AVLB-AM     IS NUMERIC                17780005
169700        MOVE AR69-RSRV-CRDT-LINE-AVLB-AM  TO WS-EDIT-S15V99       17790005
169800        MOVE WS-EDIT-S15V99   TO AR97-RSRV-CRDT-LINE-AVLB-AM      17800005
169900     ELSE                                                         17810005
170000        MOVE SPACES           TO AR97-RSRV-CRDT-LINE-AVLB-AM      17820005
170100     END-IF                                                       17830005
170200     MOVE AR69-AMEX-AIRF-INSR-CD      TO AR97-AMEX-AIRF-INSR-CD   17840005
170300     IF AR69-AMEX-FATO-ANNV-DT          IS NUMERIC                17850005
170400        MOVE AR69-AMEX-FATO-ANNV-DT       TO WS-EDIT-S9           17860005
170500        MOVE WS-EDIT-S9       TO AR97-AMEX-FATO-ANNV-DT           17870005
170600     ELSE                                                         17880005
170700        MOVE SPACES           TO AR97-AMEX-FATO-ANNV-DT           17890005
170800     END-IF                                                       17900005
170900     MOVE AR69-AMEX-BAGG-INSR-CD      TO AR97-AMEX-BAGG-INSR-CD   17910005
171000     MOVE AR69-USAV-GROP-ID           TO AR97-USAV-GROP-ID        17920005
171100     MOVE AR69-PREV-USAV-GROP-ID      TO AR97-PREV-USAV-GROP-ID   17930005
171200     IF AR69-USAV-GROP-ID-LAST-CHNG-DT  IS NUMERIC                17940005
171300        MOVE AR69-USAV-GROP-ID-LAST-CHNG-DT TO WS-EDIT-S9         17950005
171400        MOVE WS-EDIT-S9       TO AR97-USAV-GROP-ID-LAST-CHNG-DT   17960005
171500     ELSE                                                         17970005
171600        MOVE SPACES           TO AR97-USAV-GROP-ID-LAST-CHNG-DT   17980005
171700     END-IF                                                       17990005
171800     MOVE AR69-USAV-OPT-OUT-CD        TO AR97-USAV-OPT-OUT-CD     18000005
171900     MOVE AR69-REGN-CD                TO AR97-REGN-CD             18010005
172000     IF AR69-ANNL-CHRG-CASH-ADVN-CT     IS NUMERIC                18020005
172100        MOVE AR69-USAV-GROP-ID-LAST-CHNG-DT TO WS-EDIT-S9         18030005
172200        MOVE WS-EDIT-S9       TO AR97-ANNL-CHRG-CASH-ADVN-CT      18040005
172300     ELSE                                                         18050005
172400        MOVE SPACES           TO AR97-ANNL-CHRG-CASH-ADVN-CT      18060005
172500     END-IF                                                       18070005
172510     MOVE SPACES TO AR97-NON-REISSUE-LETTER-DATA                  18080005
172511                    AR97-NON-REISSUE-LETTER-NO                    18090005
172512                    AR97-NON-REISSUE-LETTER-DATE                  18100005
172513                    AR97-NON-REISSUE-LETTER-TYPE                  18110005
172600     MOVE AR69-NON-REISSUE-LETTER-DATA                            18120005
172700       TO AR97-NON-REISSUE-LETTER-DATA                            18130005
172800     IF AR69-NON-REISSUE-LETTER-DATE  IS NUMERIC                  18140005
172900        MOVE AR69-NON-REISSUE-LETTER-DATE  TO WS-EDIT-S7          18150005
173000        MOVE WS-EDIT-S7        TO AR97-NON-REISSUE-LETTER-DATE    18160005
173100*    ELSE                                                         18170005
173200*       MOVE SPACES            TO AR97-NON-REISSUE-LETTER-DATE    18180005
173300     END-IF                                                       18190005
173400        MOVE AR69-NON-REISSUE-LETTER-NO                           18200005
173500          TO AR97-NON-REISSUE-LETTER-NO                           18210005
173600        MOVE AR69-NON-REISSUE-LETTER-TYPE                         18220005
173700          TO AR97-NON-REISSUE-LETTER-TYPE                         18230005
173800     MOVE AR69-PYMNT-REAG-REFNO-NR                                18240005
173900       TO AR97-PYMNT-REAG-REFNO-NR                                18250005
174000     MOVE AR69-PRTN-ID                TO AR97-PRTN-ID             18260005
174100     IF AR69-PYMNT-REAG-CCYYMMDD-DT  IS NUMERIC                   18270005
174200        MOVE AR69-PYMNT-REAG-CCYYMMDD-DT   TO WS-EDIT-S9          18280005
174300        MOVE WS-EDIT-S9        TO AR97-PYMNT-REAG-CCYYMMDD-DT     18290005
174400     ELSE                                                         18300005
174500        MOVE SPACES            TO AR97-PYMNT-REAG-CCYYMMDD-DT     18310005
174600     END-IF                                                       18320005
174700     IF AR69-PYMNT-REAG-LAST-YYMM-DT IS NUMERIC                   18330005
174800        MOVE AR69-PYMNT-REAG-LAST-YYMM-DT  TO WS-EDIT-S5          18340005
174900        MOVE WS-EDIT-S5        TO AR97-PYMNT-REAG-LAST-YYMM-DT    18350005
175000     ELSE                                                         18360005
175100        MOVE SPACES            TO AR97-PYMNT-REAG-LAST-YYMM-DT    18370005
175200     END-IF                                                       18380005
175300     IF AR69-PYMNT-REAG-NEXT-YYMM-DT IS NUMERIC                   18390005
175400        MOVE AR69-PYMNT-REAG-NEXT-YYMM-DT  TO WS-EDIT-S5          18400005
175500        MOVE WS-EDIT-S5        TO AR97-PYMNT-REAG-NEXT-YYMM-DT    18410005
175600     ELSE                                                         18420005
175700        MOVE SPACES            TO AR97-PYMNT-REAG-NEXT-YYMM-DT    18430005
175800     END-IF.                                                      18440005
      *****************************                                     18450005
       4400-PROCESS-MSTR-REC.                                           18460005
      *****************************                                     18470005
175900     MOVE AR69-TLP-CLT-ID             TO AR97-TLP-CLT-ID          18480005
176000     IF AR69-TLP-CLT-EXPR-DT         IS NUMERIC                   18490005
176100        MOVE AR69-TLP-CLT-EXPR-DT          TO WS-EDIT-S9          18500005
176200        MOVE WS-EDIT-S9        TO AR97-TLP-CLT-EXPR-DT            18510005
176300     ELSE                                                         18520005
176400        MOVE SPACES            TO AR97-TLP-CLT-EXPR-DT            18530005
176500     END-IF                                                       18540005
176600     IF AR69-ACCT-CT                 IS NUMERIC                   18550005
176700        MOVE AR69-ACCT-CT                  TO WS-EDIT-S3          18560005
176800        MOVE WS-EDIT-S3        TO AR97-ACCT-CT                    18570005
176900     ELSE                                                         18580005
177000        MOVE SPACES            TO AR97-ACCT-CT                    18590005
177100     END-IF                                                       18600005
177110     MOVE SPACES TO AR97-USER-TX                                  18610005
177111                    AR97-ORGN-ACCT                                18620005
177112                    AR97-ORGN-ACCT-DT                             18630005
177200     MOVE AR69-USER-TX                TO AR97-USER-TX             18640005
177300     MOVE AR69-ORGN-ACCT              TO AR97-ORGN-ACCT           18650005
177400     MOVE AR69-ORGN-ACCT-DT           TO AR97-ORGN-ACCT-DT        18660005
177500     MOVE AR69-UNPD-ANNL-FEE-REB-BON-CD                           18670005
177600       TO AR97-UNPD-ANNL-FEE-REB-BON-CD                           18680005
177700     IF AR69-UNPD-ANNL-FEE-AM    IS NUMERIC                       18690005
177800        MOVE AR69-UNPD-ANNL-FEE-AM         TO WS-EDIT-S11V99      18700005
177900        MOVE WS-EDIT-S11V99    TO AR97-UNPD-ANNL-FEE-AM           18710005
178000     ELSE                                                         18720005
178100        MOVE SPACES            TO AR97-UNPD-ANNL-FEE-AM           18730005
178200     END-IF                                                       18740005
178300     MOVE AR69-FLGH-RWRD-CD           TO AR97-FLGH-RWRD-CD        18750005
178400     MOVE AR69-PREV-CLT-ID            TO AR97-PREV-CLT-ID         18760005
178500     IF AR69-CLT-CHG-DT               IS NUMERIC                  18770005
178600        MOVE AR69-CLT-CHG-DT               TO WS-EDIT-S9          18780005
178700        MOVE WS-EDIT-S9        TO AR97-CLT-CHG-DT                 18790005
178800     ELSE                                                         18800005
178900        MOVE SPACES            TO AR97-CLT-CHG-DT                 18810005
179000     END-IF                                                       18820005
179200     MOVE AR69-PFST-ATTR-SCOR-NR      TO AR97-PFST-ATTR-SCOR-NR   18830005
179300     IF AR69-PFST-REVN-PRDC-AM        IS NUMERIC                  18840005
179400        MOVE AR69-PFST-REVN-PRDC-AM        TO WS-EDIT-S15V99      18850005
179500        MOVE WS-EDIT-S15V99    TO AR97-PFST-REVN-PRDC-AM          18860005
179600     ELSE                                                         18870005
179700        MOVE SPACES            TO AR97-PFST-REVN-PRDC-AM          18880005
179800     END-IF                                                       18890005
179900     IF AR69-PFST-PRFT-PRDC-AM        IS NUMERIC                  18900005
180000        MOVE AR69-PFST-PRFT-PRDC-AM        TO WS-EDIT-S15V99      18910005
180100        MOVE WS-EDIT-S15V99    TO AR97-PFST-PRFT-PRDC-AM          18920005
180200     ELSE                                                         18930005
180300        MOVE SPACES            TO AR97-PFST-PRFT-PRDC-AM          18940005
180400     END-IF                                                       18950005
180600                                                                  18960005
180610     MOVE AR69-PFST-CRDT-RSN1-CD      TO AR97-PFST-CRDT-RSN1-CD   18970005
180620     MOVE AR69-PFST-CRDT-RSN2-CD      TO AR97-PFST-CRDT-RSN2-CD   18980005
180700     MOVE AR69-PFST-CRDT-RSN3-CD      TO AR97-PFST-CRDT-RSN3-CD   18990005
180800      MOVE AR69-PFST-SCOR-LAST-DT    TO AR97-PFST-SCOR-LAST-DT    19000005
180850                                                                  19010005
180900     MOVE AR69-ACS-WB-STTS-CD         TO AR97-ACS-WB-STTS-CD      19020005
181000     IF AR69-CAYR-REBT-ERND-AM   IS NUMERIC                       19030005
181100        MOVE AR69-CAYR-REBT-ERND-AM        TO WS-EDIT-S15V99      19040005
181200        MOVE WS-EDIT-S15V99    TO AR97-CAYR-REBT-ERND-AM          19050005
181300     ELSE                                                         19060005
181400        MOVE SPACES            TO AR97-CAYR-REBT-ERND-AM          19070005
181500     END-IF                                                       19080005
181600     IF AR69-LAYR-REBT-ERND-AM   IS NUMERIC                       19090005
181700        MOVE AR69-LAYR-REBT-ERND-AM        TO WS-EDIT-S15V99      19100005
181800        MOVE WS-EDIT-S15V99    TO AR97-LAYR-REBT-ERND-AM          19110005
181900     ELSE                                                         19120005
182000        MOVE SPACES            TO AR97-LAYR-REBT-ERND-AM          19130005
182100     END-IF                                                       19140005
182200     IF AR69-REBT-EXPR-AM        IS NUMERIC                       19150005
182300        MOVE AR69-REBT-EXPR-AM             TO WS-EDIT-S15V99      19160005
182400        MOVE WS-EDIT-S15V99    TO AR97-REBT-EXPR-AM               19170005
182500     ELSE                                                         19180005
182600        MOVE SPACES            TO AR97-REBT-EXPR-AM               19190005
182700     END-IF                                                       19200005
182800     IF AR69-XCSV-INT-CT         IS NUMERIC                       19210005
182900        MOVE AR69-XCSV-INT-CT              TO WS-EDIT-S3          19220005
183000        MOVE WS-EDIT-S3        TO AR97-XCSV-INT-CT                19230005
183100     ELSE                                                         19240005
183200        MOVE SPACES            TO AR97-XCSV-INT-CT                19250005
183300     END-IF                                                       19260005
183400     IF AR69-OTST-CHCK-CT        IS NUMERIC                       19270005
183500        MOVE AR69-OTST-CHCK-CT             TO WS-EDIT-S3          19280005
183600        MOVE WS-EDIT-S3        TO AR97-OTST-CHCK-CT               19290005
183700     ELSE                                                         19300005
183800        MOVE SPACES            TO AR97-OTST-CHCK-CT               19310005
183900     END-IF                                                       19320005
184000     IF AR69-CRRN-ANNL-CASH-RT   IS NUMERIC                       19330005
184100        MOVE AR69-CRRN-ANNL-CASH-RT        TO WS-EDIT-S2V999      19340005
184200        MOVE WS-EDIT-S2V999    TO AR97-CRRN-ANNL-CASH-RT          19350005
184300     ELSE                                                         19360005
184400        MOVE SPACES            TO AR97-CRRN-ANNL-CASH-RT          19370005
184500     END-IF                                                       19380005
184600     IF AR69-CRRN-ANNL-MRCH-RT   IS NUMERIC                       19390005
184700        MOVE AR69-CRRN-ANNL-MRCH-RT        TO WS-EDIT-S2V999      19400005
184800        MOVE WS-EDIT-S2V999    TO AR97-CRRN-ANNL-MRCH-RT          19410005
184900     ELSE                                                         19420005
185000        MOVE SPACES            TO AR97-CRRN-ANNL-MRCH-RT          19430005
185100     END-IF                                                       19440005
185200     IF AR69-HIGH-NOM-MRCH-APPLIED-RT     IS NUMERIC              19450005
185300        MOVE AR69-HIGH-NOM-MRCH-APPLIED-RT TO WS-EDIT-S2V999      19460005
185400        MOVE WS-EDIT-S2V999    TO AR97-HIGH-NOM-MRCH-APPLIED-RT   19470005
185500     ELSE                                                         19480005
185600        MOVE SPACES            TO AR97-HIGH-NOM-MRCH-APPLIED-RT   19490005
185700     END-IF                                                       19500005
185800     IF AR69-LOW-NOM-MRCH-APPLIED-RT      IS NUMERIC              19510005
185900        MOVE AR69-LOW-NOM-MRCH-APPLIED-RT  TO WS-EDIT-S2V999      19520005
186000        MOVE WS-EDIT-S2V999    TO AR97-LOW-NOM-MRCH-APPLIED-RT    19530005
186100     ELSE                                                         19540005
186200        MOVE SPACES            TO AR97-LOW-NOM-MRCH-APPLIED-RT    19550005
186300     END-IF                                                       19560005
186400     IF AR69-HIGH-NOM-CASH-APPLIED-RT     IS NUMERIC              19570005
186500        MOVE AR69-HIGH-NOM-CASH-APPLIED-RT TO WS-EDIT-S2V999      19580005
186600        MOVE WS-EDIT-S2V999    TO AR97-HIGH-NOM-CASH-APPLIED-RT   19590005
186700     ELSE                                                         19600005
186800        MOVE SPACES            TO AR97-HIGH-NOM-CASH-APPLIED-RT   19610005
186900     END-IF                                                       19620005
187000     IF AR69-LOW-NOM-CASH-APPLIED-RT      IS NUMERIC              19630005
187100        MOVE AR69-LOW-NOM-CASH-APPLIED-RT  TO WS-EDIT-S2V999      19640005
187200        MOVE WS-EDIT-S2V999    TO AR97-LOW-NOM-CASH-APPLIED-RT    19650005
187300     ELSE                                                         19660005
187400        MOVE SPACES            TO AR97-LOW-NOM-CASH-APPLIED-RT    19670005
187500     END-IF                                                       19680005
187600     MOVE AR69-NO-DELT-CD             TO AR97-NO-DELT-CD          19690005
187700     IF AR69-CLT-CHG-DT                   IS NUMERIC              19700005
187800        MOVE AR69-CLT-CHG-DT               TO WS-EDIT-S9          19710005
187900        MOVE WS-EDIT-S9        TO AR97-CLT-CHG-DT                 19720005
188000     ELSE                                                         19730005
188100        MOVE SPACES            TO AR97-CLT-CHG-DT                 19740005
188200     END-IF                                                       19750005
188300     IF AR69-E1-DATE                      IS NUMERIC              19760005
188400        MOVE AR69-E1-DATE                  TO WS-EDIT-S9          19770005
188500        MOVE WS-EDIT-S9        TO AR97-E1-DATE                    19780005
188600     ELSE                                                         19790005
188700        MOVE SPACES            TO AR97-E1-DATE                    19800005
188800     END-IF                                                       19810005
188900     IF AR69-EQTY-ACCT-MTRT-DT            IS NUMERIC              19820005
189000        MOVE AR69-EQTY-ACCT-MTRT-DT        TO WS-EDIT-S9          19830005
189100        MOVE WS-EDIT-S9        TO AR97-EQTY-ACCT-MTRT-DT          19840005
189200     ELSE                                                         19850005
189300        MOVE SPACES            TO AR97-EQTY-ACCT-MTRT-DT          19860005
189400     END-IF                                                       19870005
189500     IF AR69-SKIP-CHRG-OFF-DAYS-NR        IS NUMERIC              19880005
189600        MOVE AR69-SKIP-CHRG-OFF-DAYS-NR    TO WS-EDIT-S3          19890005
189700        MOVE WS-EDIT-S3        TO AR97-SKIP-CHRG-OFF-DAYS-NR      19900005
189800     ELSE                                                         19910005
189900        MOVE SPACES            TO AR97-SKIP-CHRG-OFF-DAYS-NR      19920005
190000     END-IF                                                       19930005
190100     IF AR69-LAST-STMT-RELJUL             IS NUMERIC              19940005
190200        MOVE AR69-LAST-STMT-RELJUL         TO WS-EDIT-S3          19950005
190300        MOVE WS-EDIT-S3        TO AR97-LAST-STMT-RELJUL           19960005
190400     ELSE                                                         19970005
190500        MOVE SPACES            TO AR97-LAST-STMT-RELJUL           19980005
190600     END-IF                                                       19990005
190700     IF AR69-USAV-CTD-TOTL-AM             IS NUMERIC              20000005
190800        MOVE AR69-USAV-CTD-TOTL-AM         TO WS-EDIT-S15V99      20010005
190900        MOVE WS-EDIT-S15V99    TO AR97-USAV-CTD-TOTL-AM           20020005
191000     ELSE                                                         20030005
191100        MOVE SPACES            TO AR97-USAV-CTD-TOTL-AM           20040005
191200     END-IF                                                       20050005
191300     MOVE AR69-NO-FEES-CD             TO AR97-NO-FEES-CD          20060005
191400     IF AR69-CTD-AUTH-AM                  IS NUMERIC              20070005
191500        MOVE AR69-CTD-AUTH-AM              TO WS-EDIT-S15V99      20080005
191600        MOVE WS-EDIT-S15V99    TO AR97-CTD-AUTH-AM                20090005
191700     ELSE                                                         20100005
191800        MOVE SPACES            TO AR97-CTD-AUTH-AM                20110005
191900     END-IF                                                       20120005
192000     MOVE AR69-SUB-ACCT-CD          TO AR97-SUB-ACCT-CD           20130005
192100     IF AR69-ACCT-MRKT-STRT-DT            IS NUMERIC              20140005
192200        MOVE AR69-ACCT-MRKT-STRT-DT        TO WS-EDIT-S9          20150005
192300        MOVE WS-EDIT-S9        TO AR97-ACCT-MRKT-STRT-DT          20160005
192400     ELSE                                                         20170005
192500        MOVE SPACES            TO AR97-ACCT-MRKT-STRT-DT          20180005
192600     END-IF                                                       20190005
192700     MOVE AR69-CMPN-ID                TO AR97-CMPN-ID             20200005
192800     MOVE AR69-ACCT-MRKT-STRT-NM      TO AR97-ACCT-MRKT-STRT-NM   20210005
192900     MOVE AR69-ACCT-MRKT-PRCS-CD      TO AR97-ACCT-MRKT-PRCS-CD   20220005
193000     MOVE AR69-REIS-STRT-NM           TO AR97-REIS-STRT-NM        20230005
193100     MOVE AR69-REIS-PRCS-CD           TO AR97-REIS-PRCS-CD        20240005
193200     MOVE AR69-PRMR-PLST-STRT-NM      TO AR97-PRMR-PLST-STRT-NM   20250005
193300     MOVE AR69-PLST-PRCS-CD           TO AR97-PLST-PRCS-CD        20260005
193400     IF AR69-REIS-STRT-DT                 IS NUMERIC              20270005
193500        MOVE AR69-REIS-STRT-DT             TO WS-EDIT-S9          20280005
193600        MOVE WS-EDIT-S9        TO AR97-REIS-STRT-DT               20290005
193700     ELSE                                                         20300005
193800        MOVE SPACES            TO AR97-REIS-STRT-DT               20310005
193900     END-IF                                                       20320005
194000     IF AR69-PLST-STRT-DT                 IS NUMERIC              20330005
194100        MOVE AR69-PLST-STRT-DT             TO WS-EDIT-S9          20340005
194200        MOVE WS-EDIT-S9        TO AR97-PLST-STRT-DT               20350005
194300     ELSE                                                         20360005
194400        MOVE SPACES            TO AR97-PLST-STRT-DT               20370005
194500     END-IF                                                       20380005
194600     MOVE AR69-CARD-ISSN-STRT-NM      TO AR97-CARD-ISSN-STRT-NM   20390005
194700     MOVE AR69-CARD-ISSN-PRCS-CD      TO AR97-CARD-ISSN-PRCS-CD   20400005
194800     IF AR69-CARD-ISSN-STRT-DT            IS NUMERIC              20410005
194900        MOVE AR69-CARD-ISSN-STRT-DT        TO WS-EDIT-S9          20420005
195000        MOVE WS-EDIT-S9        TO AR97-CARD-ISSN-STRT-DT          20430005
195100     ELSE                                                         20440005
195200        MOVE SPACES            TO AR97-CARD-ISSN-STRT-DT          20450005
195300     END-IF                                                       20460005
195400     IF AR69-TMPR-AUTO-PAY-AM             IS NUMERIC              20470005
195500        MOVE AR69-TMPR-AUTO-PAY-AM         TO WS-EDIT-S11V99      20480005
195600        MOVE WS-EDIT-S11V99    TO AR97-TMPR-AUTO-PAY-AM           20490005
195700     ELSE                                                         20500005
195800        MOVE SPACES            TO AR97-TMPR-AUTO-PAY-AM           20510005
195900     END-IF                                                       20520005
196000     MOVE AR69-PRCN-STRT-UNLC-DT-RLLC-CD                          20530005
196100       TO AR97-PRCN-STRT-UNLC-DT-RLLC-CD                          20540005
196200     IF AR69-SCOR-ONE-NR                  IS NUMERIC              20550005
196300        MOVE AR69-SCOR-ONE-NR              TO WS-EDIT-S7          20560005
196400        MOVE WS-EDIT-S7        TO AR97-SCOR-ONE-NR                20570005
196500     ELSE                                                         20580005
196600        MOVE SPACES            TO AR97-SCOR-ONE-NR                20590005
196700     END-IF                                                       20600005
196800     IF AR69-SCOR-ONE-DT                  IS NUMERIC              20610005
196900        MOVE AR69-SCOR-ONE-DT              TO WS-EDIT-S9          20620005
197000        MOVE WS-EDIT-S9        TO AR97-SCOR-ONE-DT                20630005
197100     ELSE                                                         20640005
197200        MOVE SPACES            TO AR97-SCOR-ONE-DT                20650005
197300     END-IF                                                       20660005
197400     IF AR69-SCOR-ONE-RESN-ONE-NR         IS NUMERIC              20670005
197500        MOVE AR69-SCOR-ONE-RESN-ONE-NR     TO WS-EDIT-S7          20680005
197600        MOVE WS-EDIT-S7        TO AR97-SCOR-ONE-RESN-ONE-NR       20690005
197700     ELSE                                                         20700005
197800        MOVE SPACES            TO AR97-SCOR-ONE-RESN-ONE-NR       20710005
197900     END-IF                                                       20720005
198000     IF AR69-SCOR-ONE-RESN-TWO-NR         IS NUMERIC              20730005
198100        MOVE AR69-SCOR-ONE-RESN-TWO-NR     TO WS-EDIT-S7          20740005
198200        MOVE WS-EDIT-S7        TO AR97-SCOR-ONE-RESN-TWO-NR       20750005
198300     ELSE                                                         20760005
198400        MOVE SPACES            TO AR97-SCOR-ONE-RESN-TWO-NR       20770005
198500     END-IF                                                       20780005
198600     IF AR69-SCOR-ONE-RESN-THRE-NR       IS NUMERIC               20790005
198700        MOVE AR69-SCOR-ONE-RESN-THRE-NR    TO WS-EDIT-S7          20800005
198800        MOVE WS-EDIT-S7        TO AR97-SCOR-ONE-RESN-THRE-NR      20810005
198900     ELSE                                                         20820005
199000        MOVE SPACES            TO AR97-SCOR-ONE-RESN-THRE-NR      20830005
199100     END-IF                                                       20840005
199200     IF AR69-SCOR-TWO-NR                  IS NUMERIC              20850005
199300        MOVE AR69-SCOR-TWO-NR              TO WS-EDIT-S7          20860005
199400        MOVE WS-EDIT-S7        TO AR97-SCOR-TWO-NR                20870005
199500     ELSE                                                         20880005
199600        MOVE SPACES            TO AR97-SCOR-TWO-NR                20890005
199700     END-IF                                                       20900005
199800     IF AR69-SCOR-TWO-DT                  IS NUMERIC              20910005
199900        MOVE AR69-SCOR-TWO-DT              TO WS-EDIT-S9          20920005
200000        MOVE WS-EDIT-S9        TO AR97-SCOR-TWO-DT                20930005
200100     ELSE                                                         20940005
200200        MOVE SPACES            TO AR97-SCOR-TWO-DT                20950005
200300     END-IF                                                       20960005
200400     IF AR69-SCOR-TWO-RESN-ONE-NR         IS NUMERIC              20970005
200500        MOVE AR69-SCOR-TWO-RESN-ONE-NR     TO WS-EDIT-S7          20980005
200600        MOVE WS-EDIT-S7        TO AR97-SCOR-TWO-RESN-ONE-NR       20990005
200700     ELSE                                                         21000005
200800        MOVE SPACES            TO AR97-SCOR-TWO-RESN-ONE-NR       21010005
200900     END-IF                                                       21020005
201000     IF AR69-SCOR-TWO-RESN-TWO-NR         IS NUMERIC              21030005
201100        MOVE AR69-SCOR-TWO-RESN-TWO-NR     TO WS-EDIT-S7          21040005
201200        MOVE WS-EDIT-S7        TO AR97-SCOR-TWO-RESN-TWO-NR       21050005
201300     ELSE                                                         21060005
201400        MOVE SPACES            TO AR97-SCOR-TWO-RESN-TWO-NR       21070005
201500     END-IF                                                       21080005
201600     IF AR69-SCOR-TWO-RESN-THRE-NR       IS NUMERIC               21090005
201700        MOVE AR69-SCOR-TWO-RESN-THRE-NR    TO WS-EDIT-S7          21100005
201800        MOVE WS-EDIT-S7        TO AR97-SCOR-TWO-RESN-THRE-NR      21110005
201900     ELSE                                                         21120005
202000        MOVE SPACES            TO AR97-SCOR-TWO-RESN-THRE-NR      21130005
202100     END-IF                                                       21140005
202200     IF AR69-SCOR-THRE-NR                 IS NUMERIC              21150005
202300        MOVE AR69-SCOR-THRE-NR             TO WS-EDIT-S7          21160005
202400        MOVE WS-EDIT-S7        TO AR97-SCOR-THRE-NR               21170005
202500     ELSE                                                         21180005
202600        MOVE SPACES            TO AR97-SCOR-THRE-NR               21190005
202700     END-IF                                                       21200005
202800     IF AR69-SCOR-THRE-DT                 IS NUMERIC              21210005
202900        MOVE AR69-SCOR-THRE-DT             TO WS-EDIT-S9          21220005
203000        MOVE WS-EDIT-S9        TO AR97-SCOR-THRE-DT               21230005
203100     ELSE                                                         21240005
203200        MOVE SPACES            TO AR97-SCOR-THRE-DT               21250005
203300     END-IF                                                       21260005
203400     IF AR69-SCOR-FOUR-NR                 IS NUMERIC              21270005
203500        MOVE AR69-SCOR-FOUR-NR             TO WS-EDIT-S7          21280005
203600        MOVE WS-EDIT-S7        TO AR97-SCOR-FOUR-NR               21290005
203700     ELSE                                                         21300005
203800        MOVE SPACES            TO AR97-SCOR-FOUR-NR               21310005
203900     END-IF                                                       21320005
204000     IF AR69-SCOR-FOUR-DT                 IS NUMERIC              21330005
204100        MOVE AR69-SCOR-FOUR-DT             TO WS-EDIT-S9          21340005
204200        MOVE WS-EDIT-S9        TO AR97-SCOR-FOUR-DT               21350005
204300     ELSE                                                         21360005
204400        MOVE SPACES            TO AR97-SCOR-FOUR-DT               21370005
204500     END-IF                                                       21380005
204600     IF AR69-SCOR-FIVE-NR                 IS NUMERIC              21390005
204700        MOVE AR69-SCOR-FIVE-NR             TO WS-EDIT-S7          21400005
204800        MOVE WS-EDIT-S7        TO AR97-SCOR-FIVE-NR               21410005
204900     ELSE                                                         21420005
205000        MOVE SPACES            TO AR97-SCOR-FIVE-NR               21430005
205100     END-IF                                                       21440005
205200     IF AR69-SCOR-FIVE-DT                 IS NUMERIC              21450005
205300        MOVE AR69-SCOR-FIVE-DT             TO WS-EDIT-S9          21460005
205400        MOVE WS-EDIT-S9        TO AR97-SCOR-FIVE-DT               21470005
205500     ELSE                                                         21480005
205600        MOVE SPACES            TO AR97-SCOR-FIVE-DT               21490005
205700     END-IF                                                       21500005
205800     IF AR69-SCOR-SIX-NR                  IS NUMERIC              21510005
205900        MOVE AR69-SCOR-SIX-NR              TO WS-EDIT-S7          21520005
206000        MOVE WS-EDIT-S7        TO AR97-SCOR-SIX-NR                21530005
206100     ELSE                                                         21540005
206200        MOVE SPACES            TO AR97-SCOR-SIX-NR                21550005
206300     END-IF                                                       21560005
206400     IF AR69-SCOR-SIX-DT                  IS NUMERIC              21570005
206500        MOVE AR69-SCOR-SIX-DT              TO WS-EDIT-S9          21580005
206600        MOVE WS-EDIT-S9        TO AR97-SCOR-SIX-DT                21590005
206700     ELSE                                                         21600005
206800        MOVE SPACES            TO AR97-SCOR-SIX-DT                21610005
206900     END-IF                                                       21620005
207000     IF AR69-SCOR-SIX-RESN-ONE-NR         IS NUMERIC              21630005
207100        MOVE AR69-SCOR-SIX-RESN-ONE-NR     TO WS-EDIT-S7          21640005
207200        MOVE WS-EDIT-S7        TO AR97-SCOR-SIX-RESN-ONE-NR       21650005
207300     ELSE                                                         21660005
207400        MOVE SPACES            TO AR97-SCOR-SIX-RESN-ONE-NR       21670005
207500     END-IF                                                       21680005
207600     IF AR69-SCOR-SIX-RESN-TWO-NR         IS NUMERIC              21690005
207700        MOVE AR69-SCOR-SIX-RESN-TWO-NR     TO WS-EDIT-S7          21700005
207800        MOVE WS-EDIT-S7        TO AR97-SCOR-SIX-RESN-TWO-NR       21710005
207900     ELSE                                                         21720005
208000        MOVE SPACES            TO AR97-SCOR-SIX-RESN-TWO-NR       21730005
208100     END-IF                                                       21740005
208200     IF AR69-SCOR-SIX-RESN-THRE-NR       IS NUMERIC               21750005
208300        MOVE AR69-SCOR-SIX-RESN-THRE-NR    TO WS-EDIT-S7          21760005
208400        MOVE WS-EDIT-S7        TO AR97-SCOR-SIX-RESN-THRE-NR      21770005
208500     ELSE                                                         21780005
208600        MOVE SPACES            TO AR97-SCOR-SIX-RESN-THRE-NR      21790005
208700     END-IF                                                       21800005
208800     IF AR69-SCOR-SEVN-NR                 IS NUMERIC              21810005
208900        MOVE AR69-SCOR-SEVN-NR             TO WS-EDIT-S7          21820005
209000        MOVE WS-EDIT-S7        TO AR97-SCOR-SEVN-NR               21830005
209100     ELSE                                                         21840005
209200        MOVE SPACES            TO AR97-SCOR-SEVN-NR               21850005
209300     END-IF                                                       21860005
209400     IF AR69-SCOR-SEVN-DT                 IS NUMERIC              21870005
209500        MOVE AR69-SCOR-SEVN-DT             TO WS-EDIT-S9          21880005
209600        MOVE WS-EDIT-S9        TO AR97-SCOR-SEVN-DT               21890005
209700     ELSE                                                         21900005
209800        MOVE SPACES            TO AR97-SCOR-SEVN-DT               21910005
209900     END-IF                                                       21920005
210000     IF AR69-SCOR-SEVN-RESN-ONE-NR        IS NUMERIC              21930005
210100        MOVE AR69-SCOR-SEVN-RESN-ONE-NR    TO WS-EDIT-S7          21940005
210200        MOVE WS-EDIT-S7        TO AR97-SCOR-SEVN-RESN-ONE-NR      21950005
210300     ELSE                                                         21960005
210400        MOVE SPACES            TO AR97-SCOR-SEVN-RESN-ONE-NR      21970005
210500     END-IF                                                       21980005
210600     IF AR69-SCOR-SEVN-RESN-TWO-NR        IS NUMERIC              21990005
210700        MOVE AR69-SCOR-SEVN-RESN-TWO-NR    TO WS-EDIT-S7          22000005
210800        MOVE WS-EDIT-S7        TO AR97-SCOR-SEVN-RESN-TWO-NR      22010005
210900     ELSE                                                         22020005
211000        MOVE SPACES            TO AR97-SCOR-SEVN-RESN-TWO-NR      22030005
211100     END-IF                                                       22040005
211200     IF AR69-SCOR-SEVN-RESN-THRE-NR      IS NUMERIC               22050005
211300        MOVE AR69-SCOR-SEVN-RESN-THRE-NR   TO WS-EDIT-S7          22060005
211400        MOVE WS-EDIT-S7        TO AR97-SCOR-SEVN-RESN-THRE-NR     22070005
211500     ELSE                                                         22080005
211600        MOVE SPACES            TO AR97-SCOR-SEVN-RESN-THRE-NR     22090005
211700     END-IF                                                       22100005
211800     IF AR69-SCOR-EGHT-NR                 IS NUMERIC              22110005
211900        MOVE AR69-SCOR-EGHT-NR             TO WS-EDIT-S7          22120005
212000        MOVE WS-EDIT-S7        TO AR97-SCOR-EGHT-NR               22130005
212100     ELSE                                                         22140005
212200        MOVE SPACES            TO AR97-SCOR-EGHT-NR               22150005
212300     END-IF                                                       22160005
212400     IF AR69-SCOR-EGHT-DT                 IS NUMERIC              22170005
212500        MOVE AR69-SCOR-EGHT-DT             TO WS-EDIT-S9          22180005
212600        MOVE WS-EDIT-S9        TO AR97-SCOR-EGHT-DT               22190005
212700     ELSE                                                         22200005
212800        MOVE SPACES            TO AR97-SCOR-EGHT-DT               22210005
212900     END-IF                                                       22220005
213000     IF AR69-SCOR-NINE-NR                 IS NUMERIC              22230005
213100        MOVE AR69-SCOR-NINE-NR             TO WS-EDIT-S7          22240005
213200        MOVE WS-EDIT-S7        TO AR97-SCOR-NINE-NR               22250005
213300     ELSE                                                         22260005
213400        MOVE SPACES            TO AR97-SCOR-NINE-NR               22270005
213500     END-IF                                                       22280005
213600     IF AR69-SCOR-NINE-DT                 IS NUMERIC              22290005
213700        MOVE AR69-SCOR-NINE-DT             TO WS-EDIT-S9          22300005
213800        MOVE WS-EDIT-S9        TO AR97-SCOR-NINE-DT               22310005
213900     ELSE                                                         22320005
214000        MOVE SPACES            TO AR97-SCOR-NINE-DT               22330005
214100     END-IF                                                       22340005
214200     IF AR69-SCOR-TEN-NR                  IS NUMERIC              22350005
214300        MOVE AR69-SCOR-TEN-NR              TO WS-EDIT-S7          22360005
214400        MOVE WS-EDIT-S7        TO AR97-SCOR-TEN-NR                22370005
214500     ELSE                                                         22380005
214600        MOVE SPACES            TO AR97-SCOR-TEN-NR                22390005
214700     END-IF                                                       22400005
214800     IF AR69-SCOR-TEN-DT                  IS NUMERIC              22410005
214900        MOVE AR69-SCOR-TEN-DT              TO WS-EDIT-S9          22420005
215000        MOVE WS-EDIT-S9        TO AR97-SCOR-TEN-DT                22430005
215100     ELSE                                                         22440005
215200        MOVE SPACES            TO AR97-SCOR-TEN-DT                22450005
215300     END-IF                                                       22460005
215400     IF AR69-BHVR-SCOR-PRTF-ID            IS NUMERIC              22470005
215500        MOVE AR69-BHVR-SCOR-PRTF-ID        TO WS-EDIT-S5          22480005
215600        MOVE WS-EDIT-S5        TO AR97-BHVR-SCOR-PRTF-ID          22490005
215700     ELSE                                                         22500005
215800        MOVE SPACES            TO AR97-BHVR-SCOR-PRTF-ID          22510005
215900     END-IF                                                       22520005
216023                                                                  22530005
216030     MOVE AR69-PFST-REVN-RSN1-CD    TO AR97-PFST-REVN-RSN1-CD     22540005
216100     MOVE AR69-PFST-REVN-RSN2-CD    TO AR97-PFST-REVN-RSN2-CD     22550005
216200     MOVE AR69-PFST-REVN-RSN3-CD    TO AR97-PFST-REVN-RSN3-CD     22560005
216300     MOVE AR69-PFST-ATTR-RSN1-CD    TO AR97-PFST-ATTR-RSN1-CD     22570005
216400     MOVE AR69-PFST-ATTR-RSN2-CD    TO AR97-PFST-ATTR-RSN2-CD     22580005
216500     MOVE AR69-PFST-ATTR-RSN3-CD    TO AR97-PFST-ATTR-RSN3-CD     22590005
216600     IF AR69-ANNV-CASH-INTR-RT            IS NUMERIC              22600005
216700        MOVE AR69-ANNV-CASH-INTR-RT        TO WS-EDIT-S2V999      22610005
216800        MOVE WS-EDIT-S2V999    TO AR97-ANNV-CASH-INTR-RT          22620005
216900     ELSE                                                         22630005
217000        MOVE SPACES            TO AR97-ANNV-CASH-INTR-RT          22640005
217100     END-IF                                                       22650005
217200     IF AR69-ANNV-MDSE-INTR-RT            IS NUMERIC              22660005
217300        MOVE AR69-ANNV-MDSE-INTR-RT        TO WS-EDIT-S2V999      22670005
217400        MOVE WS-EDIT-S2V999    TO AR97-ANNV-MDSE-INTR-RT          22680005
217500     ELSE                                                         22690005
217600        MOVE SPACES            TO AR97-ANNV-MDSE-INTR-RT          22700005
217700     END-IF                                                       22710005
217800     IF AR69-ACTV-DSPT-CT IS NUMERIC                              22720005
217900        MOVE AR69-ACTV-DSPT-CT       TO WS-EDIT-S3                22730005
218000        MOVE WS-EDIT-S3       TO AR97-ACTV-DSPT-CT                22740005
218100     ELSE                                                         22750005
218200        MOVE SPACES           TO AR97-ACTV-DSPT-CT                22760005
218300     END-IF                                                       22770005
218400     MOVE AR69-JONT-INSR-CD           TO AR97-JONT-INSR-CD        22780005
218500     MOVE AR69-TRMN-INCN-PRCN-CD      TO AR97-TRMN-INCN-PRCN-CD   22790005
218600     MOVE AR69-DVRT-LATE-FEES-CD                                  22800005
218700       TO AR97-DVRT-LATE-FEES-CD                                  22810005
218800     MOVE AR69-DVRT-CASH-ITEM-FEES-CD                             22820005
218900       TO AR97-DVRT-CASH-ITEM-FEES-CD                             22830005
219000     MOVE AR69-DVRT-OVER-LIMT-FEES-CD                             22840005
219100       TO AR97-DVRT-OVER-LIMT-FEES-CD                             22850005
219200     MOVE AR69-DVRT-STMT-FEES-CD                                  22860005
219300       TO AR97-DVRT-STMT-FEES-CD                                  22870005
219400     MOVE AR69-DVRT-MRCH-ITEM-FEES-CD                             22880005
219500       TO AR97-DVRT-MRCH-ITEM-FEES-CD                             22890005
219600     MOVE AR69-DVRT-INTR-MTHD-FEES-CD                             22900005
219700       TO AR97-DVRT-INTR-MTHD-FEES-CD                             22910005
219800     MOVE AR69-DVRT-CRDT-LIFE-FEES-CD                             22920005
219900       TO AR97-DVRT-CRDT-LIFE-FEES-CD                             22930005
220000     IF AR69-OTST-PLST-CT IS NUMERIC                              22940005
220100        MOVE AR69-OTST-PLST-CT       TO WS-EDIT-S3                22950005
220200        MOVE WS-EDIT-S3              TO AR97-OTST-PLST-CT         22960005
220300     ELSE                                                         22970005
220400        MOVE SPACES           TO AR97-OTST-PLST-CT                22980005
220500     END-IF                                                       22990005
220600     MOVE AR69-ACCT-GROP-ID          TO AR97-ACCT-GROP-ID         23000005
220700     MOVE AR69-GROP-MMBR-TYPE-CD     TO AR97-GROP-MMBR-TYPE-CD    23010005
220800     MOVE AR69-DPND-STRT-ID          TO AR97-DPND-STRT-ID         23020005
220900     MOVE AR69-ALWY-REFR-CD          TO AR97-ALWY-REFR-CD         23030005
221000     MOVE AR69-STMT-FORM-ID          TO AR97-STMT-FORM-ID         23040005
221100     MOVE AR69-STMT-FRMT-ID          TO AR97-STMT-FRMT-ID         23050005
221200     MOVE AR69-STMT-DSCL-ID          TO AR97-STMT-DSCL-ID         23060005
221300     IF AR69-ATPY-BAL-RT   IS NUMERIC                             23070005
221400        MOVE AR69-ATPY-BAL-RT        TO WS-EDIT-S4V999            23080005
221500        MOVE WS-EDIT-S4V999          TO AR97-ATPY-BAL-RT          23090005
221600     ELSE                                                         23100005
221700        MOVE SPACES                  TO AR97-ATPY-BAL-RT          23110005
221800     END-IF                                                       23120005
221900     IF AR69-ATPY-CLNG-AM  IS NUMERIC                             23130005
222000        MOVE AR69-ATPY-CLNG-AM       TO WS-EDIT-S11V99            23140005
222100        MOVE WS-EDIT-S11V99          TO AR97-ATPY-CLNG-AM         23150005
222200     ELSE                                                         23160005
222300        MOVE SPACES                  TO AR97-ATPY-CLNG-AM         23170005
222400     END-IF                                                       23180005
222500     MOVE AR69-DDA-NM                TO AR97-DDA-NM               23190005
222600     MOVE AR69-INTL-VISA-PHONE-CD    TO AR97-INTL-VISA-PHONE-CD   23200005
222700     IF AR69-INTL-VISA-PHONE-DT      IS NUMERIC                   23210005
222800        MOVE AR69-INTL-VISA-PHONE-DT TO WS-EDIT-S9                23220005
222900        MOVE WS-EDIT-S9              TO AR97-INTL-VISA-PHONE-DT   23230005
223000     ELSE                                                         23240005
223100        MOVE SPACES                  TO AR97-INTL-VISA-PHONE-DT   23250005
223200     END-IF                                                       23260005
223300     IF AR69-UPC-19-NR IS NUMERIC                                 23270005
223400        MOVE AR69-UPC-19-NR          TO WS-EDIT-S3                23280005
223500        MOVE WS-EDIT-S3              TO AR97-UPC-19-NR            23290005
223600     ELSE                                                         23300005
223700        MOVE SPACES           TO AR97-UPC-19-NR                   23310005
223800     END-IF                                                       23320005
223900     IF AR69-UPC-20-NR IS NUMERIC                                 23330005
224000        MOVE AR69-UPC-20-NR          TO WS-EDIT-S9                23340005
224100        MOVE WS-EDIT-S9              TO AR97-UPC-20-NR            23350005
224200     ELSE                                                         23360005
224300        MOVE SPACES           TO AR97-UPC-20-NR                   23370005
224400     END-IF                                                       23380005
224500     IF AR69-UPC-22-NR IS NUMERIC                                 23390005
224600        MOVE AR69-UPC-22-NR          TO WS-EDIT-S15               23400005
224700        MOVE WS-EDIT-S15             TO AR97-UPC-22-NR            23410005
224800     ELSE                                                         23420005
224900        MOVE SPACES                  TO AR97-UPC-22-NR            23430005
225000     END-IF                                                       23440005
225100     IF AR69-UPC-21-AM IS NUMERIC                                 23450005
225200        MOVE AR69-UPC-21-AM          TO WS-EDIT-S15V99            23460005
225300        MOVE WS-EDIT-S15V99          TO AR97-UPC-21-AM            23470005
225400     ELSE                                                         23480005
225500        MOVE SPACES                  TO AR97-UPC-21-AM            23490005
225600     END-IF                                                       23500005
225700     IF AR69-MTHD-OVRR-SEGS-NR IS NUMERIC                         23510005
225800        MOVE AR69-MTHD-OVRR-SEGS-NR  TO WS-EDIT-S3                23520005
225900        MOVE WS-EDIT-S3              TO AR97-MTHD-OVRR-SEGS-NR    23530005
226000     ELSE                                                         23540005
226100        MOVE SPACES           TO AR97-MTHD-OVRR-SEGS-NR           23550005
226200     END-IF                                                       23560005
226300     MOVE AR69-REBATE-PENDG-IND      TO AR97-REBATE-PENDG-IND     23570005
226400     MOVE AR69-UPC-13                TO AR97-UPC-13               23580005
226500     MOVE AR69-UPC-14                TO AR97-UPC-14               23590005
226600     MOVE AR69-UPC-15                TO AR97-UPC-15               23600005
226700     MOVE AR69-UPC-16                TO AR97-UPC-16               23610005
226800     MOVE AR69-UPC-17                TO AR97-UPC-17               23620005
226900     MOVE AR69-FCLT-GRAD-NR          TO AR97-FCLT-GRAD-NR         23630005
227000     IF AR69-FCLT-GRAD-CHNG-DT IS NUMERIC                         23640005
227100        MOVE AR69-FCLT-GRAD-CHNG-DT  TO WS-EDIT-S9                23650005
227200        MOVE WS-EDIT-S9              TO AR97-FCLT-GRAD-CHNG-DT    23660005
227300     ELSE                                                         23670005
227400        MOVE SPACES           TO AR97-FCLT-GRAD-CHNG-DT           23680005
227500     END-IF                                                       23690005
227600     IF AR69-INT-IN-SUSP-AMT   IS NUMERIC                         23700005
227700        MOVE AR69-INT-IN-SUSP-AMT    TO WS-EDIT-S15V99            23710005
227800        MOVE WS-EDIT-S15V99          TO AR97-INT-IN-SUSP-AMT      23720005
227900     ELSE                                                         23730005
228000        MOVE SPACES           TO AR97-INT-IN-SUSP-AMT             23740005
228100     END-IF                                                       23750005
228200     IF AR69-INT-BEF-SUSP-AMT  IS NUMERIC                         23760005
228300        MOVE AR69-INT-BEF-SUSP-AMT   TO WS-EDIT-S15V99            23770005
228400        MOVE WS-EDIT-S15V99          TO AR97-INT-BEF-SUSP-AMT     23780005
228500     ELSE                                                         23790005
228600        MOVE SPACES           TO AR97-INT-BEF-SUSP-AMT            23800005
228700     END-IF                                                       23810005
228800     IF AR69-PY-INT-IN-SUSP-AMT IS NUMERIC                        23820005
228900        MOVE AR69-PY-INT-IN-SUSP-AMT TO WS-EDIT-S15V99            23830005
229000        MOVE WS-EDIT-S15V99          TO AR97-PY-INT-IN-SUSP-AMT   23840005
229100     ELSE                                                         23850005
229200        MOVE SPACES           TO AR97-PY-INT-IN-SUSP-AMT          23860005
229300     END-IF                                                       23870005
229400     MOVE AR69-LTR-CATGRY-GRP-A-CD   TO AR97-LTR-CATGRY-GRP-A-CD  23880005
229500     MOVE AR69-LTR-CATGRY-GRP-B-CD   TO AR97-LTR-CATGRY-GRP-B-CD  23890005
229600     MOVE AR69-LTR-CATGRY-GRP-C-CD   TO AR97-LTR-CATGRY-GRP-C-CD  23900005
229700     MOVE AR69-LTR-CATGRY-GRP-D-CD   TO AR97-LTR-CATGRY-GRP-D-CD  23910005
229800     MOVE AR69-LTR-CATGRY-GRP-E-CD   TO AR97-LTR-CATGRY-GRP-E-CD  23920005
229900     MOVE AR69-LTR-CATGRY-GRP-F-CD   TO AR97-LTR-CATGRY-GRP-F-CD  23930005
230000     MOVE AR69-LTR-CATGRY-GRP-G-CD   TO AR97-LTR-CATGRY-GRP-G-CD  23940005
230100     MOVE AR69-LTR-CATGRY-GRP-H-CD   TO AR97-LTR-CATGRY-GRP-H-CD  23950005
230200     MOVE AR69-LTR-CATGRY-GRP-I-CD   TO AR97-LTR-CATGRY-GRP-I-CD  23960005
230300     MOVE AR69-LTR-CATGRY-GRP-J-CD   TO AR97-LTR-CATGRY-GRP-J-CD  23970005
230400     MOVE AR69-LTR-CATGRY-GRP-K-CD   TO AR97-LTR-CATGRY-GRP-K-CD  23980005
230500     MOVE AR69-LTR-CATGRY-GRP-L-CD   TO AR97-LTR-CATGRY-GRP-L-CD  23990005
230600     MOVE AR69-LTR-CATGRY-GRP-M-CD   TO AR97-LTR-CATGRY-GRP-M-CD  24000005
230700     MOVE AR69-LTR-CATGRY-GRP-N-CD   TO AR97-LTR-CATGRY-GRP-N-CD  24010005
230800     MOVE AR69-LTR-CATGRY-GRP-O-CD   TO AR97-LTR-CATGRY-GRP-O-CD  24020005
230900     MOVE AR69-LTR-CATGRY-GRP-P-CD   TO AR97-LTR-CATGRY-GRP-P-CD  24030005
231000     MOVE AR69-LTR-CATGRY-GRP-Q-CD   TO AR97-LTR-CATGRY-GRP-Q-CD  24040005
231100     MOVE AR69-LTR-CATGRY-GRP-T-CD   TO AR97-LTR-CATGRY-GRP-T-CD  24050005
231200     MOVE AR69-LTR-CATGRY-GRP-U-CD   TO AR97-LTR-CATGRY-GRP-U-CD  24060005
231300     MOVE AR69-LTR-CATGRY-GRP-V-CD   TO AR97-LTR-CATGRY-GRP-V-CD  24070005
231400     MOVE AR69-LTR-CATGRY-GRP-Z-CD   TO AR97-LTR-CATGRY-GRP-Z-CD  24080005
231500     IF AR69-ANNL-FEE-WAVR-AM   IS NUMERIC                        24090005
231600        MOVE AR69-ANNL-FEE-WAVR-AM   TO WS-EDIT-S11V99            24100005
231700        MOVE WS-EDIT-S11V99          TO AR97-ANNL-FEE-WAVR-AM     24110005
231800     ELSE                                                         24120005
231900        MOVE SPACES           TO AR97-ANNL-FEE-WAVR-AM            24130005
232000     END-IF                                                       24140005
232100     IF AR69-ANNL-FEE-WAVR-DT   IS NUMERIC                        24150005
232200        MOVE AR69-ANNL-FEE-WAVR-DT   TO WS-EDIT-S9                24160005
232300        MOVE WS-EDIT-S9              TO AR97-ANNL-FEE-WAVR-DT     24170005
232400     ELSE                                                         24180005
232500        MOVE SPACES           TO AR97-ANNL-FEE-WAVR-DT            24190005
232600     END-IF                                                       24200005
232700     MOVE AR69-ANNL-FEE-WAVR-CD      TO AR97-ANNL-FEE-WAVR-CD     24210005
232800     MOVE AR69-LAST-ANNL-FEE-WAVR-CD                              24220005
232900       TO AR97-LAST-ANNL-FEE-WAVR-CD                              24230005
233000     MOVE AR69-TLR-CLT-ID            TO AR97-TLR-CLT-ID           24240005
233100     IF AR69-TLR-CLT-EXPR-DT    IS NUMERIC                        24250005
233200        MOVE AR69-TLR-CLT-EXPR-DT    TO WS-EDIT-S9                24260005
233300        MOVE WS-EDIT-S9              TO AR97-TLR-CLT-EXPR-DT      24270005
233400     ELSE                                                         24280005
233500        MOVE SPACES           TO AR97-TLR-CLT-EXPR-DT             24290005
233600     END-IF                                                       24300005
233700     MOVE AR69-PREV-CLT-TLR-ID       TO AR97-PREV-CLT-TLR-ID      24310005
233800     IF AR69-CLT-TLR-CHG-DT     IS NUMERIC                        24320005
233900        MOVE AR69-CLT-TLR-CHG-DT     TO WS-EDIT-S9                24330005
234000        MOVE WS-EDIT-S9              TO AR97-CLT-TLR-CHG-DT       24340005
234100     ELSE                                                         24350005
234200        MOVE SPACES           TO AR97-CLT-TLR-CHG-DT              24360005
234300     END-IF                                                       24370005
234400     IF AR69-TMPR-CRDT-LINE-STRT-DT IS NUMERIC                    24380005
234500        MOVE AR69-TMPR-CRDT-LINE-STRT-DT TO WS-EDIT-S9            24390005
234600        MOVE WS-EDIT-S9       TO AR97-TMPR-CRDT-LINE-STRT-DT      24400005
234700     ELSE                                                         24410005
234800        MOVE SPACES           TO AR97-TMPR-CRDT-LINE-STRT-DT      24420005
234900     END-IF                                                       24430005
235000     IF AR69-TMPR-CRDT-LINE-END-DT  IS NUMERIC                    24440005
235100        MOVE AR69-TMPR-CRDT-LINE-END-DT  TO WS-EDIT-S9            24450005
235200        MOVE WS-EDIT-S9       TO AR97-TMPR-CRDT-LINE-END-DT       24460005
235300     ELSE                                                         24470005
235400        MOVE SPACES           TO AR97-TMPR-CRDT-LINE-END-DT       24480005
235500     END-IF                                                       24490005
235600     IF AR69-TMPR-CRDT-LINE-AM      IS NUMERIC                    24500005
235700        MOVE AR69-TMPR-CRDT-LINE-AM      TO WS-EDIT-S17           24510005
235800        MOVE WS-EDIT-S17      TO AR97-TMPR-CRDT-LINE-AM           24520005
235900     ELSE                                                         24530005
236000        MOVE SPACES           TO AR97-TMPR-CRDT-LINE-AM           24540005
236100     END-IF                                                       24550005
236200     MOVE AR69-TMPR-CRDT-LINE-CD     TO AR97-TMPR-CRDT-LINE-CD    24560005
236300     IF AR69-PDAY-INTR-IN-SSPN-AM   IS NUMERIC                    24570005
236400        MOVE AR69-PDAY-INTR-IN-SSPN-AM   TO WS-EDIT-S15V99        24580005
236500        MOVE WS-EDIT-S15V99   TO AR97-PDAY-INTR-IN-SSPN-AM        24590005
236600     ELSE                                                         24600005
236700        MOVE SPACES           TO AR97-PDAY-INTR-IN-SSPN-AM        24610005
236800     END-IF                                                       24620005
236900     IF AR69-PDAY-INTR-BEFR-SSPN-AM IS NUMERIC                    24630005
237000        MOVE AR69-PDAY-INTR-BEFR-SSPN-AM TO WS-EDIT-S15V99        24640005
237100        MOVE WS-EDIT-S15V99   TO AR97-PDAY-INTR-BEFR-SSPN-AM      24650005
237200     ELSE                                                         24660005
237300        MOVE SPACES           TO AR97-PDAY-INTR-BEFR-SSPN-AM      24670005
237400     END-IF                                                       24680005
237500     IF AR69-CTD-CASH-MEMO-AM       IS NUMERIC                    24690005
237600        MOVE AR69-CTD-CASH-MEMO-AM       TO WS-EDIT-S15V99        24700005
237700        MOVE WS-EDIT-S15V99   TO AR97-CTD-CASH-MEMO-AM            24710005
237800     ELSE                                                         24720005
237900        MOVE SPACES           TO AR97-CTD-CASH-MEMO-AM            24730005
238000     END-IF                                                       24740005
238100     MOVE AR69-CNTL-ACCT-EXTR-STAT-CD                             24750005
238200       TO AR97-CNTL-ACCT-EXTR-STAT-CD                             24760005
238300     MOVE AR69-FLEX-BLLN-CD         TO AR97-FLEX-BLLN-CD          24770005
238400     MOVE AR69-PRFT-SCR1-CD         TO AR97-PRFT-SCR1-CD          24780005
238500     MOVE AR69-PRFT-SCR2-CD         TO AR97-PRFT-SCR2-CD          24790005
238600     MOVE AR69-PRFT-SCR3-CD         TO AR97-PRFT-SCR3-CD          24800005
238700     MOVE AR69-PRFT-SCR4-CD         TO AR97-PRFT-SCR4-CD          24810005
238800     IF AR69-TRNS-PYMT-DUE-CT       IS NUMERIC                    24820005
238900        MOVE AR69-TRNS-PYMT-DUE-CT       TO WS-EDIT-S3            24830005
239000        MOVE WS-EDIT-S3       TO AR97-TRNS-PYMT-DUE-CT            24840005
239100     ELSE                                                         24850005
239200        MOVE SPACES           TO AR97-TRNS-PYMT-DUE-CT            24860005
239300     END-IF                                                       24870005
239400     IF AR69-TRNS-PYFF-EXCP-CT      IS NUMERIC                    24880005
239500        MOVE AR69-TRNS-PYFF-EXCP-CT      TO WS-EDIT-S3            24890005
239600        MOVE WS-EDIT-S3       TO AR97-TRNS-PYFF-EXCP-CT           24900005
239700     ELSE                                                         24910005
239800        MOVE SPACES           TO AR97-TRNS-PYFF-EXCP-CT           24920005
239900     END-IF                                                       24930005
240000     IF AR69-LAST-TRNS-PYFF-EXCP-CT IS NUMERIC                    24940005
240100        MOVE AR69-LAST-TRNS-PYFF-EXCP-CT TO WS-EDIT-S3            24950005
240200        MOVE WS-EDIT-S3       TO AR97-LAST-TRNS-PYFF-EXCP-CT      24960005
240300     ELSE                                                         24970005
240400        MOVE SPACES           TO AR97-LAST-TRNS-PYFF-EXCP-CT      24980005
240500     END-IF                                                       24990005
240600     IF AR69-LAST-TRNS-PYMT-DUE-CT  IS NUMERIC                    25000005
240700        MOVE AR69-LAST-TRNS-PYMT-DUE-CT  TO WS-EDIT-S3            25010005
240800        MOVE WS-EDIT-S3       TO AR97-LAST-TRNS-PYMT-DUE-CT       25020005
240900     ELSE                                                         25030005
241000        MOVE SPACES           TO AR97-LAST-TRNS-PYMT-DUE-CT       25040005
241100     END-IF                                                       25050005
241200     IF AR69-PREV-TRNS-PYMT-DUE-CT  IS NUMERIC                    25060005
241300        MOVE AR69-PREV-TRNS-PYMT-DUE-CT  TO WS-EDIT-S3            25070005
241400        MOVE WS-EDIT-S3       TO AR97-PREV-TRNS-PYMT-DUE-CT       25080005
241500     ELSE                                                         25090005
241600        MOVE SPACES           TO AR97-PREV-TRNS-PYMT-DUE-CT       25100005
241700     END-IF                                                       25110005
241800     IF AR69-OTST-AUTH-BAL-AM       IS NUMERIC                    25120005
241900        MOVE AR69-OTST-AUTH-BAL-AM       TO WS-EDIT-S15V99        25130005
242000        MOVE WS-EDIT-S15V99   TO AR97-OTST-AUTH-BAL-AM            25140005
242100     ELSE                                                         25150005
242200        MOVE SPACES           TO AR97-OTST-AUTH-BAL-AM            25160005
242300     END-IF                                                       25170005
242400     IF AR69-SKIP-PMNT-PRTF-ID      IS NUMERIC                    25180005
242500        MOVE AR69-SKIP-PMNT-PRTF-ID      TO WS-EDIT-S5            25190005
242600        MOVE WS-EDIT-S5       TO AR97-SKIP-PMNT-PRTF-ID           25200005
242700     ELSE                                                         25210005
242800        MOVE SPACES           TO AR97-SKIP-PMNT-PRTF-ID           25220005
242900     END-IF                                                       25230005
243000     IF AR69-SKIP-PMNT-OVRD-PRTF-ID IS NUMERIC                    25240005
243100        MOVE AR69-SKIP-PMNT-OVRD-PRTF-ID TO WS-EDIT-S5            25250005
243200        MOVE WS-EDIT-S5       TO AR97-SKIP-PMNT-OVRD-PRTF-ID      25260005
243300     ELSE                                                         25270005
243400        MOVE SPACES           TO AR97-SKIP-PMNT-OVRD-PRTF-ID      25280005
243500     END-IF                                                       25290005
243600     IF AR69-SKIP-PMNT-OVRD-PRTF-DT IS NUMERIC                    25300005
243700        MOVE AR69-SKIP-PMNT-OVRD-PRTF-DT TO WS-EDIT-S9            25310005
243800        MOVE WS-EDIT-S9       TO AR97-SKIP-PMNT-OVRD-PRTF-DT      25320005
243900     ELSE                                                         25330005
244000        MOVE SPACES           TO AR97-SKIP-PMNT-OVRD-PRTF-DT      25340005
244100     END-IF                                                       25350005
244200     IF AR69-SKIP-PMNT-OFFR-NR      IS NUMERIC                    25360005
244300        MOVE AR69-SKIP-PMNT-OFFR-NR      TO WS-EDIT-S3            25370005
244400        MOVE WS-EDIT-S3       TO AR97-SKIP-PMNT-OFFR-NR           25380005
244500     ELSE                                                         25390005
244600        MOVE SPACES           TO AR97-SKIP-PMNT-OFFR-NR           25400005
244700     END-IF                                                       25410005
244800     IF AR69-SKIP-PMNT-ACCP-NR      IS NUMERIC                    25420005
244900        MOVE AR69-SKIP-PMNT-ACCP-NR      TO WS-EDIT-S3            25430005
245000        MOVE WS-EDIT-S3       TO AR97-SKIP-PMNT-ACCP-NR           25440005
245100     ELSE                                                         25450005
245200        MOVE SPACES           TO AR97-SKIP-PMNT-ACCP-NR           25460005
245300     END-IF                                                       25470005
245400     MOVE AR69-EPMT-PART-IND-ID     TO AR97-EPMT-PART-IND-ID      25480005
245500     MOVE AR69-EPMT-UNIQ-ID         TO AR97-EPMT-UNIQ-ID          25490005
245600     IF AR69-EPMT-STRT-DT           IS NUMERIC                    25500005
245700        MOVE AR69-EPMT-STRT-DT           TO WS-EDIT-S9            25510005
245800        MOVE WS-EDIT-S9       TO AR97-EPMT-STRT-DT                25520005
245900     ELSE                                                         25530005
246000        MOVE SPACES           TO AR97-EPMT-STRT-DT                25540005
246100     END-IF                                                       25550005
246200     IF AR69-EPMT-END-DT            IS NUMERIC                    25560005
246300        MOVE AR69-EPMT-END-DT            TO WS-EDIT-S9            25570005
246400        MOVE WS-EDIT-S9       TO AR97-EPMT-END-DT                 25580005
246500     ELSE                                                         25590005
246600        MOVE SPACES           TO AR97-EPMT-END-DT                 25600005
246700     END-IF                                                       25610005
246800     MOVE AR69-ALL-TRANSFER-FLAG    TO AR97-ALL-TRANSFER-FLAG     25620005
246900     IF AR69-CTD-PRTN-PRCH-AM IS NUMERIC                          25630005
247000        MOVE AR69-CTD-PRTN-PRCH-AM      TO WS-EDIT-S15V99         25640005
247100        MOVE WS-EDIT-S15V99             TO                        25650005
247200             AR97-CTD-PRTN-PRCH-AM                                25660005
247300     ELSE                                                         25670005
247400        MOVE SPACES           TO                                  25680005
247500             AR97-CTD-PRTN-PRCH-AM                                25690005
247600     END-IF                                                       25700005
247700     MOVE AR69-MON-RJCT-CD          TO AR97-MON-RJCT-CD           25710005
247800     MOVE AR69-NON-AUTH-ACTV-ACCT-CD TO AR97-NON-AUTH-ACTV-ACCT-CD25720005
247900     MOVE AR69-ACCT-CURED-CD        TO AR97-ACCT-CURED-CD         25730005
248000     IF AR69-DPST-CRDT-LINE-CHG-DT IS NUMERIC                     25740005
248100        MOVE AR69-DPST-CRDT-LINE-CHG-DT TO WS-EDIT-S7             25750005
248200        MOVE WS-EDIT-S7                 TO                        25760005
248300             AR97-DPST-CRDT-LINE-CHG-DT                           25770005
248400     ELSE                                                         25780005
248500        MOVE SPACES           TO                                  25790005
248600             AR97-DPST-CRDT-LINE-CHG-DT                           25800005
248700     END-IF                                                       25810005
248800     IF AR69-RVRS-ANNL-FEE-DT      IS NUMERIC                     25820005
248900        MOVE AR69-RVRS-ANNL-FEE-DT      TO WS-EDIT-S9             25830005
249000        MOVE WS-EDIT-S9                 TO                        25840005
249100             AR97-RVRS-ANNL-FEE-DT                                25850005
249200     ELSE                                                         25860005
249300        MOVE SPACES           TO                                  25870005
249400             AR97-RVRS-ANNL-FEE-DT                                25880005
249500     END-IF                                                       25890005
249600     MOVE AR69-RVRS-ANNL-FEE-CD     TO AR97-RVRS-ANNL-FEE-CD      25900005
249700     MOVE AR69-REIM-BACK-DATE-CD    TO AR97-REIM-BACK-DATE-CD     25910005
249800     MOVE AR69-STMT-LATE-DAYS-NR    TO AR97-STMT-LATE-DAYS-NR     25920005
249900     MOVE AR69-ACS-AUTH-OVRR-STRT-ID TO AR97-ACS-AUTH-OVRR-STRT-ID25930005
250000     IF AR69-ACS-AUTH-OVRR-STRT-DT IS NUMERIC                     25940005
250100        MOVE AR69-ACS-AUTH-OVRR-STRT-DT TO WS-EDIT-S9             25950005
250200        MOVE WS-EDIT-S9                 TO                        25960005
250300             AR97-ACS-AUTH-OVRR-STRT-DT                           25970005
250400     ELSE                                                         25980005
250500        MOVE SPACES           TO                                  25990005
250600             AR97-ACS-AUTH-OVRR-STRT-DT                           26000005
250700     END-IF.                                                      26010005
      *****************************                                     26020005
       4600-PROCESS-MSTR-REC.                                           26030005
      *****************************                                     26040005
250800     MOVE AR69-REIS-MSSG-ID         TO AR97-REIS-MSSG-ID          26050005
250900     MOVE AR69-WRBL-MSSG-ID         TO AR97-WRBL-MSSG-ID          26060005
251000     MOVE AR69-AVLB-FUND-MSSG-ID    TO AR97-AVLB-FUND-MSSG-ID     26070005
251100     MOVE AR69-SSPN-CYCL-CD         TO AR97-SSPN-CYCL-CD          26080005
251200     MOVE AR69-TLF-TABL-ID          TO AR97-TLF-TABL-ID           26090005
251300     MOVE AR69-TLP-TQ-TABL-ID       TO AR97-TLP-TQ-TABL-ID        26100005
251400     IF AR69-PYMN-DUE-DT          IS NUMERIC                      26110005
251500        MOVE AR69-PYMN-DUE-DT           TO WS-EDIT-S9             26120005
251600        MOVE WS-EDIT-S9                 TO                        26130005
251700             AR97-PYMN-DUE-DT                                     26140005
251800     ELSE                                                         26150005
251900        MOVE SPACES           TO                                  26160005
252000             AR97-PYMN-DUE-DT                                     26170005
252100     END-IF                                                       26180005
252200     IF AR69-NEWCRD-FLAG-RETN-DT  IS NUMERIC                      26190005
252300        MOVE AR69-NEWCRD-FLAG-RETN-DT   TO WS-EDIT-S9             26200005
252400        MOVE WS-EDIT-S9                 TO                        26210005
252500             AR97-NEWCRD-FLAG-RETN-DT                             26220005
252600     ELSE                                                         26230005
252700        MOVE SPACES           TO                                  26240005
252800             AR97-NEWCRD-FLAG-RETN-DT                             26250005
252900     END-IF                                                       26260005
253000     IF AR69-NEXT-CYCL-DT         IS NUMERIC                      26270005
253100        MOVE AR69-NEXT-CYCL-DT          TO WS-EDIT-S9             26280005
253200        MOVE WS-EDIT-S9                 TO                        26290005
253300             AR97-NEXT-CYCL-DT                                    26300005
253400     ELSE                                                         26310005
253500        MOVE SPACES           TO                                  26320005
253600             AR97-NEXT-CYCL-DT                                    26330005
253700     END-IF                                                       26340005
253800     IF AR69-LAST-MON-TRAN-CD     IS NUMERIC                      26350005
253900        MOVE AR69-LAST-MON-TRAN-CD      TO WS-EDIT-S3             26360005
254000        MOVE WS-EDIT-S3                 TO                        26370005
254100             AR97-LAST-MON-TRAN-CD                                26380005
254200     ELSE                                                         26390005
254300        MOVE SPACES           TO                                  26400005
254400             AR97-LAST-MON-TRAN-CD                                26410005
254500     END-IF                                                       26420005
254600     IF AR69-LAST-EMBS-ADDR-CHNG-DT    IS NUMERIC                 26430005
254700        MOVE AR69-LAST-EMBS-ADDR-CHNG-DT TO WS-EDIT-S9            26440005
254800        MOVE WS-EDIT-S9                 TO                        26450005
254900             AR97-LAST-EMBS-ADDR-CHNG-DT                          26460005
255000     ELSE                                                         26470005
255100        MOVE SPACES           TO                                  26480005
255200             AR97-LAST-EMBS-ADDR-CHNG-DT                          26490005
255300     END-IF                                                       26500005
255400     IF AR69-DBT-RTFC-NTFC-MNTH-CT    IS NUMERIC                  26510005
255500        MOVE AR69-DBT-RTFC-NTFC-MNTH-CT   TO  WS-EDIT-S1          26520005
255600        MOVE WS-EDIT-S1                   TO                      26530005
255700             AR97-DBT-RTFC-NTFC-MNTH-CT                           26540005
255800     ELSE                                                         26550005
255900        MOVE SPACES                       TO                      26560005
256000             AR97-DBT-RTFC-NTFC-MNTH-CT                           26570005
256100     END-IF                                                       26580005
256200     IF AR69-DBT-RTFC-GRAC-MNTH-CT    IS NUMERIC                  26590005
256300        MOVE AR69-DBT-RTFC-GRAC-MNTH-CT   TO  WS-EDIT-S1          26600005
256400        MOVE WS-EDIT-S1                   TO                      26610005
256500             AR97-DBT-RTFC-GRAC-MNTH-CT                           26620005
256600     ELSE                                                         26630005
256700        MOVE SPACES                       TO                      26640005
256800             AR97-DBT-RTFC-GRAC-MNTH-CT                           26650005
256900     END-IF                                                       26660005
257000     IF AR69-DBT-RTFC-LAST-NTFC-DT    IS NUMERIC                  26670005
257100        MOVE AR69-DBT-RTFC-LAST-NTFC-DT   TO  WS-EDIT-S9          26680005
257200        MOVE WS-EDIT-S9                   TO                      26690005
257300             AR97-DBT-RTFC-LAST-NTFC-DT                           26700005
257400     ELSE                                                         26710005
257500        MOVE SPACES                       TO                      26720005
257600             AR97-DBT-RTFC-LAST-NTFC-DT                           26730005
257700     END-IF                                                       26740005
257800     MOVE AR69-OVRL-NMN-ENTR-TYPE-ID TO AR97-OVRL-NMN-ENTR-TYPE-ID26750005
257900     IF AR69-PRCN-STRT-CT         IS NUMERIC                      26760005
258000        MOVE AR69-PRCN-STRT-CT       TO WS-EDIT-S3                26770005
258100        MOVE WS-EDIT-S3          TO AR97-PRCN-STRT-CT             26780005
258200     ELSE                                                         26790005
258300        MOVE SPACES              TO AR97-PRCN-STRT-CT             26800005
258400     END-IF                                                       26810005
258500     MOVE AR69-PRCN-STRT-RSET-IN     TO AR97-PRCN-STRT-RSET-IN    26820005
258600     MOVE AR69-NMN-ENTR-ID           TO AR97-NMN-ENTR-ID          26830005
258700     MOVE AR69-DALY-INTR-CALC-MTHD-CD                             26840005
258800       TO AR97-DALY-INTR-CALC-MTHD-CD                             26850005
258900     MOVE AR69-CC-FLET-RSTR-CD       TO AR97-CC-FLET-RSTR-CD      26860005
259000     MOVE AR69-CC-FLET-PRMP-CD       TO AR97-CC-FLET-PRMP-CD      26870005
259100     IF AR69-CR-LIFE-STATUS-DT    IS NUMERIC                      26880005
259200        MOVE AR69-CR-LIFE-STATUS-DT  TO WS-EDIT-S9                26890005
259300        MOVE WS-EDIT-S9          TO AR97-CR-LIFE-STATUS-DT        26900005
259400     ELSE                                                         26910005
259500        MOVE SPACES              TO AR97-CR-LIFE-STATUS-DT        26920005
259600     END-IF                                                       26930005
259700     PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 28             26940005
259800         IF AR69-SCOR-1TO10  (WS-I)   IS NUMERIC                  26950005
259900            MOVE AR69-SCOR-1TO10  (WS-I)   TO WS-EDIT-S7          26960005
260000            MOVE WS-EDIT-S7      TO AR97-SCOR-1TO10  (WS-I)       26970005
260100         ELSE                                                     26980005
260200            MOVE SPACES          TO AR97-SCOR-1TO10  (WS-I)       26990005
260300         END-IF                                                   27000005
260400     END-PERFORM                                                  27010005
260500     MOVE AR69-LAST-LTTR-ID          TO AR97-LAST-LTTR-ID         27020005
260600     IF AR69-LAST-LTTR-DT                 IS NUMERIC              27030005
260700        MOVE AR69-LAST-LTTR-DT            TO WS-EDIT-S9           27040005
260800        MOVE WS-EDIT-S9        TO AR97-LAST-LTTR-DT               27050005
260900     ELSE                                                         27060005
261000        MOVE SPACES            TO AR97-LAST-LTTR-DT               27070005
261100     END-IF                                                       27080005
261200     MOVE AR69-CRRS-ADDR-CD          TO AR97-CRRS-ADDR-CD         27090005
261300     MOVE AR69-MLP-CD                TO AR97-MLP-CD               27100005
261400     IF AR69-AVLB-CRDT-AMT                IS NUMERIC              27110005
261500        MOVE AR69-AVLB-CRDT-AMT           TO WS-EDIT-S15V99       27120005
261600        MOVE WS-EDIT-S15V99    TO AR97-AVLB-CRDT-AMT              27130005
261700     ELSE                                                         27140005
261800        MOVE SPACES            TO AR97-AVLB-CRDT-AMT              27150005
261900     END-IF                                                       27160005
262000     IF AR69-EBP-STOP-PAPR-DT             IS NUMERIC              27170005
262100        MOVE AR69-EBP-STOP-PAPR-DT        TO WS-EDIT-S9           27180005
262200        MOVE WS-EDIT-S9        TO AR97-EBP-STOP-PAPR-DT           27190005
262300     ELSE                                                         27200005
262400        MOVE SPACES            TO AR97-EBP-STOP-PAPR-DT           27210005
262500     END-IF                                                       27220005
262600     MOVE AR69-GRCE-NGRC-OVRD-CD     TO AR97-GRCE-NGRC-OVRD-CD    27230005
262700     PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 28             27240005
262800         IF AR69-CRDT-PRTC-PRMM-DT      (WS-I)  IS NUMERIC        27250005
262900            MOVE AR69-CRDT-PRTC-PRMM-DT (WS-I)  TO WS-EDIT-S7     27260005
263000            MOVE WS-EDIT-S7    TO AR97-CRDT-PRTC-PRMM-DT (WS-I)   27270005
263100         ELSE                                                     27280005
263200            MOVE SPACES        TO AR97-CRDT-PRTC-PRMM-DT (WS-I)   27290005
263300         END-IF                                                   27300005
263400     END-PERFORM                                                  27310005
263500                                                                  27320005
263600     MOVE AR69-ACS-AVLB-FUND-PRTF-ID TO AR97-ACS-AVLB-FUND-PRTF-ID27330005
263700     IF AR69-ACS-AVLB-FUND-CAT-DT         IS NUMERIC              27340005
263800        MOVE AR69-ACS-AVLB-FUND-CAT-DT    TO WS-EDIT-S9           27350005
263900        MOVE WS-EDIT-S9        TO AR97-ACS-AVLB-FUND-CAT-DT       27360005
264000     ELSE                                                         27370005
264100        MOVE SPACES            TO AR97-ACS-AVLB-FUND-CAT-DT       27380005
264200     END-IF                                                       27390005
264300     MOVE AR69-MLTP-LIKE-UNIQ-CD     TO AR97-MLTP-LIKE-UNIQ-CD    27400005
264400     MOVE AR69-MLTP-UNIQ-OVRR-CD     TO AR97-MLTP-UNIQ-OVRR-CD    27410005
264500     MOVE AR69-SSR-IN                TO AR97-SSR-IN               27420005
264600     MOVE AR69-CRBR-LAST-RPRT-ID     TO AR97-CRBR-LAST-RPRT-ID    27430005
264700     IF AR69-LOST-STLN-PI-CT              IS NUMERIC              27440005
264800        MOVE AR69-LOST-STLN-PI-CT         TO WS-EDIT-S3           27450005
264900        MOVE WS-EDIT-S3        TO AR97-LOST-STLN-PI-CT            27460005
265000     ELSE                                                         27470005
265100        MOVE SPACES            TO AR97-LOST-STLN-PI-CT            27480005
265200     END-IF                                                       27490005
265300     IF AR69-CALC-NORM-CASH-RT            IS NUMERIC              27500005
265400        MOVE AR69-CALC-NORM-CASH-RT       TO WS-EDIT-SV97         27510005
265500        MOVE WS-EDIT-SV97      TO AR97-CALC-NORM-CASH-RT          27520005
265600     ELSE                                                         27530005
265700        MOVE SPACES            TO AR97-CALC-NORM-CASH-RT          27540005
265800     END-IF                                                       27550005
265900     IF AR69-CALC-NORM-MRCH-RT            IS NUMERIC              27560005
266000        MOVE AR69-CALC-NORM-MRCH-RT       TO WS-EDIT-SV97         27570005
266100        MOVE WS-EDIT-SV97      TO AR97-CALC-NORM-MRCH-RT          27580005
266200     ELSE                                                         27590005
266300        MOVE SPACES            TO AR97-CALC-NORM-MRCH-RT          27600005
266400     END-IF                                                       27610005
266500     IF AR69-CALC-NORM-CASH-MNTH-RT       IS NUMERIC              27620005
266600        MOVE AR69-CALC-NORM-CASH-MNTH-RT  TO WS-EDIT-SV95         27630005
266700        MOVE WS-EDIT-SV95      TO AR97-CALC-NORM-CASH-MNTH-RT     27640005
266800     ELSE                                                         27650005
266900        MOVE SPACES            TO AR97-CALC-NORM-CASH-MNTH-RT     27660005
267000     END-IF                                                       27670005
267100     IF AR69-CALC-NORM-MRCH-MNTH-RT       IS NUMERIC              27680005
267200        MOVE AR69-CALC-NORM-MRCH-MNTH-RT  TO WS-EDIT-SV95         27690005
267300        MOVE WS-EDIT-SV95      TO AR97-CALC-NORM-MRCH-MNTH-RT     27700005
267400     ELSE                                                         27710005
267500        MOVE SPACES            TO AR97-CALC-NORM-MRCH-MNTH-RT     27720005
267600     END-IF                                                       27730005
267700     IF AR69-CALC-NORM-CASH-ANN-RT        IS NUMERIC              27740005
267800        MOVE AR69-CALC-NORM-CASH-ANN-RT   TO WS-EDIT-S2V999       27750005
267900        MOVE WS-EDIT-S2V999    TO AR97-CALC-NORM-CASH-ANN-RT      27760005
268000     ELSE                                                         27770005
268100        MOVE SPACES            TO AR97-CALC-NORM-CASH-ANN-RT      27780005
268200     END-IF                                                       27790005
268300     IF AR69-CALC-NORM-MRCH-ANN-RT        IS NUMERIC              27800005
268400        MOVE AR69-CALC-NORM-MRCH-ANN-RT   TO WS-EDIT-S2V999       27810005
268500        MOVE WS-EDIT-S2V999    TO AR97-CALC-NORM-MRCH-ANN-RT      27820005
268600     ELSE                                                         27830005
268700        MOVE SPACES            TO AR97-CALC-NORM-MRCH-ANN-RT      27840005
268800     END-IF                                                       27850005
268900     IF AR69-PAYMENT-DUE-DAYS-NR          IS NUMERIC              27860005
269000        MOVE AR69-PAYMENT-DUE-DAYS-NR     TO WS-EDIT-S3           27870005
269100        MOVE WS-EDIT-S3        TO AR97-PAYMENT-DUE-DAYS-NR        27880005
269200     ELSE                                                         27890005
269300        MOVE SPACES            TO AR97-PAYMENT-DUE-DAYS-NR        27900005
269400     END-IF                                                       27910005
269500     IF AR69-HRSK-PRMN-CLLC-ID            IS NUMERIC              27920005
269600        MOVE AR69-HRSK-PRMN-CLLC-ID       TO WS-EDIT-S3           27930005
269700        MOVE WS-EDIT-S3        TO AR97-HRSK-PRMN-CLLC-ID          27940005
269800     ELSE                                                         27950005
269900        MOVE SPACES            TO AR97-HRSK-PRMN-CLLC-ID          27960005
270000     END-IF                                                       27970005
270100     IF AR69-LAST-TRMS-CHNG-NTFC-DT       IS NUMERIC              27980005
270200        MOVE AR69-LAST-TRMS-CHNG-NTFC-DT  TO WS-EDIT-S9           27990005
270300        MOVE WS-EDIT-S9        TO AR97-LAST-TRMS-CHNG-NTFC-DT     28000005
270400     ELSE                                                         28010005
270500        MOVE SPACES            TO AR97-LAST-TRMS-CHNG-NTFC-DT     28020005
270600     END-IF                                                       28030005
270700     IF AR69-PREV-TRMS-CHNG-NTFC-DT       IS NUMERIC              28040005
270800        MOVE AR69-PREV-TRMS-CHNG-NTFC-DT  TO WS-EDIT-S9           28050005
270900        MOVE WS-EDIT-S9        TO AR97-PREV-TRMS-CHNG-NTFC-DT     28060005
271000     ELSE                                                         28070005
271100        MOVE SPACES            TO AR97-PREV-TRMS-CHNG-NTFC-DT     28080005
271200     END-IF                                                       28090005
271300     MOVE AR69-PRMT-PRCN-VOID-IN     TO AR97-PRMT-PRCN-VOID-IN    28100005
271400     MOVE AR69-GRND-FTHR-WAVR-CD     TO AR97-GRND-FTHR-WAVR-CD    28110005
271500     IF AR69-CRRN-ARBT-CD                 IS NUMERIC              28120005
271600        MOVE AR69-CRRN-ARBT-CD            TO WS-EDIT-S1           28130005
271700        MOVE WS-EDIT-S1        TO AR97-CRRN-ARBT-CD               28140005
271800     ELSE                                                         28150005
271900        MOVE SPACES            TO AR97-CRRN-ARBT-CD               28160005
272000     END-IF                                                       28170005
272100     IF AR69-CRRN-ARBT-NTFC-DT            IS NUMERIC              28180005
272200        MOVE AR69-CRRN-ARBT-NTFC-DT       TO WS-EDIT-S9           28190005
272300        MOVE WS-EDIT-S9        TO AR97-CRRN-ARBT-NTFC-DT          28200005
272400     ELSE                                                         28210005
272500        MOVE SPACES            TO AR97-CRRN-ARBT-NTFC-DT          28220005
272600     END-IF                                                       28230005
272700     IF AR69-CRRN-ARBT-EFFC-DT            IS NUMERIC              28240005
272800        MOVE AR69-CRRN-ARBT-EFFC-DT       TO WS-EDIT-S9           28250005
272900        MOVE WS-EDIT-S9        TO AR97-CRRN-ARBT-EFFC-DT          28260005
273000     ELSE                                                         28270005
273100        MOVE SPACES            TO AR97-CRRN-ARBT-EFFC-DT          28280005
273200     END-IF                                                       28290005
273300     IF AR69-PREV-ARBT-CD             IS NUMERIC                  28300005
273400        MOVE AR69-PREV-ARBT-CD            TO  WS-EDIT-S1          28310005
273500        MOVE WS-EDIT-S1                   TO                      28320005
273600             AR97-PREV-ARBT-CD                                    28330005
273700     ELSE                                                         28340005
273800        MOVE SPACES                       TO                      28350005
273900             AR97-PREV-ARBT-CD                                    28360005
274000     END-IF                                                       28370005
274100     IF AR69-PREV-ARBT-NTFC-DT            IS NUMERIC              28380005
274200        MOVE AR69-PREV-ARBT-NTFC-DT       TO WS-EDIT-S9           28390005
274300        MOVE WS-EDIT-S9        TO AR97-PREV-ARBT-NTFC-DT          28400005
274400     ELSE                                                         28410005
274500        MOVE SPACES            TO AR97-PREV-ARBT-NTFC-DT          28420005
274600     END-IF                                                       28430005
274700     IF AR69-PREV-ARBT-EFFC-DT            IS NUMERIC              28440005
274800        MOVE AR69-PREV-ARBT-EFFC-DT       TO WS-EDIT-S9           28450005
274900        MOVE WS-EDIT-S9        TO AR97-PREV-ARBT-EFFC-DT          28460005
275000     ELSE                                                         28470005
275100        MOVE SPACES            TO AR97-PREV-ARBT-EFFC-DT          28480005
275200     END-IF                                                       28490005
275300     MOVE AR69-MISC-13-PSTN-1-10-TX  TO AR97-MISC-13-PSTN-1-10-TX 28500005
275400     MOVE AR69-MISC-13-PSTN-11-15-TX TO AR97-MISC-13-PSTN-11-15-TX28510005
275500     MOVE AR69-MISC-13-PSTN-16-20-TX TO AR97-MISC-13-PSTN-16-20-TX28520005
275600     MOVE AR69-MISC-13-PSTN-21-25-TX TO AR97-MISC-13-PSTN-21-25-TX28530005
275700     MOVE AR69-MISC-13-PSTN-26-TX    TO AR97-MISC-13-PSTN-26-TX   28540005
275800     MOVE AR69-MISC-13-PSTN-27-TX    TO AR97-MISC-13-PSTN-27-TX   28550005
275900     MOVE AR69-MISC-13-PSTN-28-TX    TO AR97-MISC-13-PSTN-28-TX   28560005
276000     MOVE AR69-MISC-13-PSTN-29-TX    TO AR97-MISC-13-PSTN-29-TX   28570005
276100     MOVE AR69-MISC-13-PSTN-30-TX    TO AR97-MISC-13-PSTN-30-TX   28580005
276200     MOVE AR69-MISC-13-PSTN-31-TX    TO AR97-MISC-13-PSTN-31-TX   28590005
276300     MOVE AR69-MISC-13-PSTN-32-TX    TO AR97-MISC-13-PSTN-32-TX   28600005
276400     MOVE AR69-MISC-13-PSTN-33-TX    TO AR97-MISC-13-PSTN-33-TX   28610005
276500     MOVE AR69-MISC-13-PSTN-34-TX    TO AR97-MISC-13-PSTN-34-TX   28620005
276600     MOVE AR69-MISC-13-PSTN-35-TX    TO AR97-MISC-13-PSTN-35-TX   28630005
276700     MOVE AR69-MISC-13-PSTN-36-TX    TO AR97-MISC-13-PSTN-36-TX   28640005
276800     MOVE AR69-MISC-13-PSTN-37-TX    TO AR97-MISC-13-PSTN-37-TX   28650005
276900     MOVE AR69-MISC-13-PSTN-38-TX    TO AR97-MISC-13-PSTN-38-TX   28660005
277000     MOVE AR69-MISC-13-PSTN-39-TX    TO AR97-MISC-13-PSTN-39-TX   28670005
277100     MOVE AR69-MISC-13-PSTN-40-TX    TO AR97-MISC-13-PSTN-40-TX   28680005
277200     MOVE AR69-MISC-13-PSTN-41-TX    TO AR97-MISC-13-PSTN-41-TX   28690005
277300     MOVE AR69-MISC-13-PSTN-42-TX    TO AR97-MISC-13-PSTN-42-TX   28700005
277400     MOVE AR69-MISC-13-PSTN-43-TX    TO AR97-MISC-13-PSTN-43-TX   28710005
277500     MOVE AR69-MISC-13-PSTN-44-TX    TO AR97-MISC-13-PSTN-44-TX   28720005
277600     MOVE AR69-MISC-13-PSTN-45-TX    TO AR97-MISC-13-PSTN-45-TX   28730005
277700     MOVE AR69-MISC-13-PSTN-46-TX    TO AR97-MISC-13-PSTN-46-TX   28740005
277800     MOVE AR69-MISC-13-PSTN-47-TX    TO AR97-MISC-13-PSTN-47-TX   28750005
277900     MOVE AR69-MISC-13-PSTN-48-TX    TO AR97-MISC-13-PSTN-48-TX   28760005
278000     MOVE AR69-MISC-13-PSTN-49-TX    TO AR97-MISC-13-PSTN-49-TX   28770005
278100     MOVE AR69-MISC-13-PSTN-50-TX    TO AR97-MISC-13-PSTN-50-TX   28780005
278200     MOVE AR69-DIALER-SITE-ID        TO AR97-DIALER-SITE-ID       28790005
278300     IF AR69-PREV-ARBT-NTFC-DT            IS NUMERIC              28800005
278400        MOVE AR69-PREV-ARBT-NTFC-DT       TO WS-EDIT-S9           28810005
278500        MOVE WS-EDIT-S9        TO AR97-PREV-ARBT-NTFC-DT          28820005
278600     ELSE                                                         28830005
278700        MOVE SPACES            TO AR97-PREV-ARBT-NTFC-DT          28840005
278800     END-IF                                                       28850005
278900     IF AR69-RULE-NEXT-DAY-1-CT           IS NUMERIC              28860005
279000        MOVE AR69-RULE-NEXT-DAY-1-CT      TO WS-EDIT-S6           28870005
279100        MOVE WS-EDIT-S6        TO AR97-RULE-NEXT-DAY-1-CT         28880005
279200     ELSE                                                         28890005
279300        MOVE SPACES            TO AR97-RULE-NEXT-DAY-1-CT         28900005
279400     END-IF                                                       28910005
279500     IF AR69-RULE-NEXT-DAY-2-CT           IS NUMERIC              28920005
279600        MOVE AR69-RULE-NEXT-DAY-2-CT      TO WS-EDIT-S6           28930005
279700        MOVE WS-EDIT-S6        TO AR97-RULE-NEXT-DAY-2-CT         28940005
279800     ELSE                                                         28950005
279900        MOVE SPACES            TO AR97-RULE-NEXT-DAY-2-CT         28960005
280000     END-IF                                                       28970005
280100     MOVE AR69-FUND-DMM-OVRD-ID      TO AR97-FUND-DMM-OVRD-ID     28980005
280200     MOVE AR69-PRCN-ST-OF-ORGN-CD    TO AR97-PRCN-ST-OF-ORGN-CD   28990005
280300     IF AR69-MECH-PULL-PRCS-RESN-CD IS NUMERIC                    29000005
280400        MOVE AR69-MECH-PULL-PRCS-RESN-CD TO WS-EDIT-S3            29010005
280500        MOVE WS-EDIT-S3       TO AR97-MECH-PULL-PRCS-RESN-CD      29020005
280600     ELSE                                                         29030005
280700        MOVE SPACES           TO AR97-MECH-PULL-PRCS-RESN-CD      29040005
280800     END-IF                                                       29050005
280900     IF AR69-LAST-PRCN-PRTF-CHNG-DT IS NUMERIC                    29060005
281000        MOVE AR69-LAST-PRCN-PRTF-CHNG-DT TO WS-EDIT-S9            29070005
281100        MOVE WS-EDIT-S9       TO AR97-LAST-PRCN-PRTF-CHNG-DT      29080005
281200     ELSE                                                         29090005
281300        MOVE SPACES           TO AR97-LAST-PRCN-PRTF-CHNG-DT      29100005
281400     END-IF                                                       29110005
281500     MOVE AR69-LAST-PRCN-PRTF-CD     TO AR97-LAST-PRCN-PRTF-CD    29120005
281600     MOVE AR69-HOLD-CYCL-CD-99       TO AR97-HOLD-CYCL-CD-99      29130005
281700     IF AR69-FEE-CASH-INTR-BRNG-AM  IS NUMERIC                    29140005
281800        MOVE AR69-FEE-CASH-INTR-BRNG-AM TO WS-EDIT-S15V99         29150005
281900        MOVE WS-EDIT-S15V99   TO AR97-FEE-CASH-INTR-BRNG-AM       29160005
282000     ELSE                                                         29170005
282100        MOVE SPACES           TO AR97-FEE-CASH-INTR-BRNG-AM       29180005
282200     END-IF                                                       29190005
282300     IF AR69-FEE-MDSE-INTR-BRNG-AM  IS NUMERIC                    29200005
282400        MOVE AR69-FEE-MDSE-INTR-BRNG-AM TO WS-EDIT-S15V99         29210005
282500        MOVE WS-EDIT-S15V99   TO AR97-FEE-MDSE-INTR-BRNG-AM       29220005
282600     ELSE                                                         29230005
282700        MOVE SPACES           TO AR97-FEE-MDSE-INTR-BRNG-AM       29240005
282800     END-IF                                                       29250005
282900     IF AR69-POB-CMPND-CD             IS NUMERIC                  29260005
283000        MOVE AR69-POB-CMPND-CD            TO  WS-EDIT-S1          29270005
283100        MOVE WS-EDIT-S1                   TO                      29280005
283200             AR97-POB-CMPND-CD                                    29290005
283300     ELSE                                                         29300005
283400        MOVE SPACES                       TO                      29310005
283500             AR97-POB-CMPND-CD                                    29320005
283600     END-IF                                                       29330005
283700     MOVE AR69-SCRX-AUTH-OVRR-CRDT-CD                             29340005
283800       TO AR97-SCRX-AUTH-OVRR-CRDT-CD                             29350005
283900     MOVE AR69-SCRX-AUTH-OVRR-FRD-CD                              29360005
284000       TO AR97-SCRX-AUTH-OVRR-FRD-CD                              29370005
284100     MOVE AR69-SCRX-AUTH-OVRR-BHVR-CD                             29380005
284200       TO AR97-SCRX-AUTH-OVRR-BHVR-CD                             29390005
284300     MOVE AR69-SCRX-AUTH-OVRR-RISK-CD                             29400005
284400       TO AR97-SCRX-AUTH-OVRR-RISK-CD                             29410005
284500     MOVE AR69-SCRX-AUTH-OVRR-INCR-CD                             29420005
284600       TO AR97-SCRX-AUTH-OVRR-INCR-CD                             29430005
284700     MOVE AR69-SCRX-AUTH-OVRR-DECR-CD                             29440005
284800       TO AR97-SCRX-AUTH-OVRR-DECR-CD                             29450005
284900     MOVE AR69-SCRX-AUTH-OVRR-OVLM-CD                             29460005
285000       TO AR97-SCRX-AUTH-OVRR-OVLM-CD                             29470005
285100     IF AR69-SCRX-AUTH-OVRR-CRDT-DT IS NUMERIC                    29480005
285200        MOVE AR69-SCRX-AUTH-OVRR-CRDT-DT TO WS-EDIT-S9            29490005
285300        MOVE WS-EDIT-S9       TO AR97-SCRX-AUTH-OVRR-CRDT-DT      29500005
285400     ELSE                                                         29510005
285500        MOVE SPACES           TO AR97-SCRX-AUTH-OVRR-CRDT-DT      29520005
285600     END-IF                                                       29530005
285700     IF AR69-SCRX-AUTH-OVRR-FRD-DT  IS NUMERIC                    29540005
285800        MOVE AR69-SCRX-AUTH-OVRR-FRD-DT  TO WS-EDIT-S9            29550005
285900        MOVE WS-EDIT-S9       TO AR97-SCRX-AUTH-OVRR-FRD-DT       29560005
286000     ELSE                                                         29570005
286100        MOVE SPACES           TO AR97-SCRX-AUTH-OVRR-FRD-DT       29580005
286200     END-IF                                                       29590005
286300     IF AR69-SCRX-AUTH-OVRR-BHVR-DT IS NUMERIC                    29600005
286400        MOVE AR69-SCRX-AUTH-OVRR-BHVR-DT TO WS-EDIT-S9            29610005
286500        MOVE WS-EDIT-S9       TO AR97-SCRX-AUTH-OVRR-BHVR-DT      29620005
286600     ELSE                                                         29630005
286700        MOVE SPACES           TO AR97-SCRX-AUTH-OVRR-BHVR-DT      29640005
286800     END-IF                                                       29650005
286900     IF AR69-SCRX-AUTH-OVRR-RISK-DT IS NUMERIC                    29660005
287000        MOVE AR69-SCRX-AUTH-OVRR-RISK-DT TO WS-EDIT-S9            29670005
287100        MOVE WS-EDIT-S9       TO AR97-SCRX-AUTH-OVRR-RISK-DT      29680005
287200     ELSE                                                         29690005
287300        MOVE SPACES           TO AR97-SCRX-AUTH-OVRR-RISK-DT      29700005
287400     END-IF                                                       29710005
287500     IF AR69-SCRX-AUTH-OVRR-INCR-DT IS NUMERIC                    29720005
287600        MOVE AR69-SCRX-AUTH-OVRR-INCR-DT TO WS-EDIT-S9            29730005
287700        MOVE WS-EDIT-S9       TO AR97-SCRX-AUTH-OVRR-INCR-DT      29740005
287800     ELSE                                                         29750005
287900        MOVE SPACES           TO AR97-SCRX-AUTH-OVRR-INCR-DT      29760005
288000     END-IF                                                       29770005
288100     IF AR69-SCRX-AUTH-OVRR-DECR-DT IS NUMERIC                    29780005
288200        MOVE AR69-SCRX-AUTH-OVRR-DECR-DT TO WS-EDIT-S9            29790005
288300        MOVE WS-EDIT-S9       TO AR97-SCRX-AUTH-OVRR-DECR-DT      29800005
288400     ELSE                                                         29810005
288500        MOVE SPACES           TO AR97-SCRX-AUTH-OVRR-DECR-DT      29820005
288600     END-IF                                                       29830005
288700     IF AR69-SCRX-AUTH-OVRR-DECR-DT IS NUMERIC                    29840005
288800        MOVE AR69-SCRX-AUTH-OVRR-DECR-DT TO WS-EDIT-S9            29850005
288900        MOVE WS-EDIT-S9       TO AR97-SCRX-AUTH-OVRR-DECR-DT      29860005
289000     ELSE                                                         29870005
289100        MOVE SPACES           TO AR97-SCRX-AUTH-OVRR-DECR-DT      29880005
289200     END-IF                                                       29890005
289300     IF AR69-BHVR-SCOR-DT           IS NUMERIC                    29900005
289400        MOVE AR69-BHVR-SCOR-DT           TO WS-EDIT-S9            29910005
289500        MOVE WS-EDIT-S9       TO AR97-BHVR-SCOR-DT                29920005
289600     ELSE                                                         29930005
289700        MOVE SPACES           TO AR97-BHVR-SCOR-DT                29940005
289800     END-IF                                                       29950005
289900     MOVE AR69-CRDT-BUR-ALRT-CD      TO AR97-CRDT-BUR-ALRT-CD     29960005
290000     MOVE AR69-DBT-ACTV-ID           TO AR97-DBT-ACTV-ID          29970005
290100     MOVE AR69-RULS-RESS-PRTF-ID                                  29980005
290200       TO AR97-RULS-RESS-PRTF-ID                                  29990005
290300     MOVE AR69-RULS-RESS-OVRR-PRTF-ID                             30000005
290400       TO AR97-RULS-RESS-OVRR-PRTF-ID                             30010005
290500     IF AR69-RULS-RESS-OVRR-PRTF-DT IS NUMERIC                    30020005
290600        MOVE AR69-RULS-RESS-OVRR-PRTF-DT TO WS-EDIT-S9            30030005
290700        MOVE WS-EDIT-S9       TO AR97-RULS-RESS-OVRR-PRTF-DT      30040005
290800     ELSE                                                         30050005
290900        MOVE SPACES           TO AR97-RULS-RESS-OVRR-PRTF-DT      30060005
291000     END-IF                                                       30070005
291100     IF AR69-LATE-FEE-TIRD-BAL-AM   IS NUMERIC                    30080005
291200        MOVE AR69-LATE-FEE-TIRD-BAL-AM   TO WS-EDIT-S15V99        30090005
291300        MOVE WS-EDIT-S15V99   TO AR97-LATE-FEE-TIRD-BAL-AM        30100005
291400     ELSE                                                         30110005
291500        MOVE SPACES           TO AR97-LATE-FEE-TIRD-BAL-AM        30120005
291600     END-IF                                                       30130005
291700     MOVE AR69-ALTR-STMT-FRMT-CD    TO AR97-ALTR-STMT-FRMT-CD     30140005
291800     MOVE AR69-PRMR-ACCT-CD         TO AR97-PRMR-ACCT-CD          30150005
291900     IF AR69-PRMR-ACCT-CHNG-DT      IS NUMERIC                    30160005
292000        MOVE AR69-PRMR-ACCT-CHNG-DT      TO WS-EDIT-S9            30170005
292100        MOVE WS-EDIT-S9       TO AR97-PRMR-ACCT-CHNG-DT           30180005
292200     ELSE                                                         30190005
292300        MOVE SPACES           TO AR97-PRMR-ACCT-CHNG-DT           30200005
292400     END-IF                                                       30210005
292500     IF AR69-DLNQ-STRT-OVRR-DT      IS NUMERIC                    30220005
292600        MOVE AR69-DLNQ-STRT-OVRR-DT      TO WS-EDIT-S9            30230005
292700        MOVE WS-EDIT-S9       TO AR97-DLNQ-STRT-OVRR-DT           30240005
292800     ELSE                                                         30250005
292900        MOVE SPACES           TO AR97-DLNQ-STRT-OVRR-DT           30260005
293000     END-IF                                                       30270005
293100     PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 6              30280005
293200        IF AR69-CLI-FREE-DAYS-RMNN-CT (WS-I) IS NUMERIC           30290005
293300           MOVE AR69-CLI-FREE-DAYS-RMNN-CT (WS-I)  TO WS-EDIT-S3  30300005
293400           MOVE WS-EDIT-S3     TO AR97-CLI-FREE-DAYS-RMNN-CT(WS-I)30310005
293500        ELSE                                                      30320005
293600           MOVE SPACES         TO AR97-CLI-FREE-DAYS-RMNN-CT(WS-I)30330005
293700        END-IF                                                    30340005
293800     END-PERFORM                                                  30350005
293900     IF AR69-PRJC-CARD-SQNC-NR      IS NUMERIC                    30360005
294000        MOVE AR69-PRJC-CARD-SQNC-NR      TO WS-EDIT-S3            30370005
294100        MOVE WS-EDIT-S3       TO AR97-PRJC-CARD-SQNC-NR           30380005
294200     ELSE                                                         30390005
294300        MOVE SPACES           TO AR97-PRJC-CARD-SQNC-NR           30400005
294400     END-IF                                                       30410005
294500     MOVE AR69-DFLT-PLAN-ID         TO AR97-DFLT-PLAN-ID          30420005
294600     IF AR69-PLAN-LOCK-BEGN-DT      IS NUMERIC                    30430005
294700        MOVE AR69-PLAN-LOCK-BEGN-DT      TO WS-EDIT-S9            30440005
294800        MOVE WS-EDIT-S9       TO AR97-PLAN-LOCK-BEGN-DT           30450005
294900     ELSE                                                         30460005
295000        MOVE SPACES           TO AR97-PLAN-LOCK-BEGN-DT           30470005
295100     END-IF                                                       30480005
295200     IF AR69-PLAN-LOCK-END-DT       IS NUMERIC                    30490005
295300        MOVE AR69-PLAN-LOCK-END-DT       TO WS-EDIT-S9            30500005
295400        MOVE WS-EDIT-S9       TO AR97-PLAN-LOCK-END-DT            30510005
295500     ELSE                                                         30520005
295600        MOVE SPACES           TO AR97-PLAN-LOCK-END-DT            30530005
295700     END-IF                                                       30540005
295800     IF AR69-CNSM-ACCT-CLSD-DT      IS NUMERIC                    30550005
295900        MOVE AR69-CNSM-ACCT-CLSD-DT      TO WS-EDIT-S9            30560005
296000        MOVE WS-EDIT-S9       TO AR97-CNSM-ACCT-CLSD-DT           30570005
296100     ELSE                                                         30580005
296200        MOVE SPACES           TO AR97-CNSM-ACCT-CLSD-DT           30590005
296300     END-IF                                                       30600005
296400     IF AR69-CRDT-LINE-CHNG-DT      IS NUMERIC                    30610005
296500        MOVE AR69-CRDT-LINE-CHNG-DT      TO WS-EDIT-S9            30620005
296600        MOVE WS-EDIT-S9       TO AR97-CRDT-LINE-CHNG-DT           30630005
296700     ELSE                                                         30640005
296800        MOVE SPACES           TO AR97-CRDT-LINE-CHNG-DT           30650005
296900     END-IF                                                       30660005
297000     IF AR69-PREV-CRDT-LINE-CHNG-DT IS NUMERIC                    30670005
297100        MOVE AR69-PREV-CRDT-LINE-CHNG-DT TO WS-EDIT-S9            30680005
297200        MOVE WS-EDIT-S9       TO AR97-PREV-CRDT-LINE-CHNG-DT      30690005
297300     ELSE                                                         30700005
297400        MOVE SPACES           TO AR97-PREV-CRDT-LINE-CHNG-DT      30710005
297500     END-IF                                                       30720005
297600     IF AR69-CRDT-BUR-BKCY-DT       IS NUMERIC                    30730005
297700        MOVE AR69-CRDT-BUR-BKCY-DT       TO WS-EDIT-S9            30740005
297800        MOVE WS-EDIT-S9       TO AR97-CRDT-BUR-BKCY-DT            30750005
297900     ELSE                                                         30760005
298000        MOVE SPACES           TO AR97-CRDT-BUR-BKCY-DT            30770005
298100     END-IF                                                       30780005
298200     MOVE AR69-QUAL-FUTR-LATE-FEE-CD                              30790005
298300       TO AR97-QUAL-FUTR-LATE-FEE-CD                              30800005
298400     MOVE AR69-PREV-STTS-RESN-CD    TO AR97-PREV-STTS-RESN-CD     30810005
298500     IF AR69-NO-MMB-LEVL-CT         > 0                           30820005
298600        MOVE AR69-NO-MMB-LEVL-CT         TO WS-EDIT-S9            30830005
298700        MOVE WS-EDIT-S9       TO AR97-NO-MMB-LEVL-CT              30840005
298800     ELSE                                                         30850005
298900        MOVE SPACES           TO AR97-NO-MMB-LEVL-CT              30860005
299000     END-IF                                                       30870005
299100     MOVE AR69-STRT-REVW-IN         TO AR97-STRT-REVW-IN          30880005
299200     MOVE AR69-CYCL-PRCN-STRT-ID    TO AR97-CYCL-PRCN-STRT-ID     30890005
299300     MOVE AR69-CYCL-PRCN-PORT-ID    TO AR97-CYCL-PRCN-PORT-ID     30900005
299400     MOVE AR69-PORT-REVW-IN         TO AR97-PORT-REVW-IN          30910005
299500     MOVE AR69-PRCN-REPOST-IN       TO AR97-PRCN-REPOST-IN        30920005
299600     IF AR69-PRMT-MRCH-ANNL-ITRO-RT IS NUMERIC                    30930005
299700        MOVE AR69-PRMT-MRCH-ANNL-ITRO-RT TO WS-EDIT-S2V999        30940005
299800        MOVE WS-EDIT-S2V999   TO AR97-PRMT-MRCH-ANNL-ITRO-RT      30950005
299900     ELSE                                                         30960005
300000        MOVE SPACES           TO AR97-PRMT-MRCH-ANNL-ITRO-RT      30970005
300100     END-IF                                                       30980005
300200     IF AR69-PRMT-CASH-ANNL-ITRO-RT IS NUMERIC                    30990005
300300        MOVE AR69-PRMT-CASH-ANNL-ITRO-RT TO WS-EDIT-S2V999        31000005
300400        MOVE WS-EDIT-S2V999   TO AR97-PRMT-CASH-ANNL-ITRO-RT      31010005
300500     ELSE                                                         31020005
300600        MOVE SPACES           TO AR97-PRMT-CASH-ANNL-ITRO-RT      31030005
300700     END-IF                                                       31040005
300800     IF AR69-PRMT-MRCH-ANNL-RGLR-RT IS NUMERIC                    31050005
300900        MOVE AR69-PRMT-MRCH-ANNL-RGLR-RT TO WS-EDIT-S2V999        31060005
301000        MOVE WS-EDIT-S2V999   TO AR97-PRMT-MRCH-ANNL-RGLR-RT      31070005
301100     ELSE                                                         31080005
301200        MOVE SPACES           TO AR97-PRMT-MRCH-ANNL-RGLR-RT      31090005
301300     END-IF                                                       31100005
301400     IF AR69-PLAN-MRCH-ANNL-RGLR-RT IS NUMERIC                    31110005
301500        MOVE AR69-PLAN-MRCH-ANNL-RGLR-RT TO WS-EDIT-S2V999        31120005
301600        MOVE WS-EDIT-S2V999   TO AR97-PLAN-MRCH-ANNL-RGLR-RT      31130005
301700     ELSE                                                         31140005
301800        MOVE SPACES           TO AR97-PLAN-MRCH-ANNL-RGLR-RT      31150005
301900     END-IF                                                       31160005
302000     IF AR69-PLAN-CASH-ANNL-RGLR-RT IS NUMERIC                    31170005
302100        MOVE AR69-PLAN-CASH-ANNL-RGLR-RT TO WS-EDIT-S2V999        31180005
302200        MOVE WS-EDIT-S2V999   TO AR97-PLAN-CASH-ANNL-RGLR-RT      31190005
302300     ELSE                                                         31200005
302400        MOVE SPACES           TO AR97-PLAN-CASH-ANNL-RGLR-RT      31210005
302500     END-IF                                                       31220005
302600     IF AR69HD-1098-YTD-INTR-THRD-AM  IS NUMERIC                  31230005
302700        MOVE AR69HD-1098-YTD-INTR-THRD-AM  TO WS-EDIT-S15V99      31240005
302800        MOVE WS-EDIT-S15V99  TO AR97HD-1098-YTD-INTR-THRD-AM      31250005
302900     ELSE                                                         31260005
303000        MOVE SPACES          TO AR97HD-1098-YTD-INTR-THRD-AM      31270005
303100     END-IF                                                       31280005
303200     IF AR69HD-1098-YTD-INTR-TOTL-AM  IS NUMERIC                  31290005
303300        MOVE AR69HD-1098-YTD-INTR-TOTL-AM  TO WS-EDIT-S15V99      31300005
303400        MOVE WS-EDIT-S15V99  TO AR97HD-1098-YTD-INTR-TOTL-AM      31310005
303500     ELSE                                                         31320005
303600        MOVE SPACES          TO AR97HD-1098-YTD-INTR-TOTL-AM      31330005
303700     END-IF                                                       31340005
303800     IF AR69HD-1098-PREV-INTR-THRD-AM IS NUMERIC                  31350005
303900        MOVE AR69HD-1098-PREV-INTR-THRD-AM TO WS-EDIT-S15V99      31360005
304000        MOVE WS-EDIT-S15V99  TO AR97HD-1098-PREV-INTR-THRD-AM     31370005
304100     ELSE                                                         31380005
304200        MOVE SPACES          TO AR97HD-1098-PREV-INTR-THRD-AM     31390005
304300     END-IF                                                       31400005
304400     IF AR69HD-1098-PREV-INTR-TOTL-AM IS NUMERIC                  31410005
304500        MOVE AR69HD-1098-PREV-INTR-TOTL-AM TO WS-EDIT-S15V99      31420005
304600        MOVE WS-EDIT-S15V99  TO AR97HD-1098-PREV-INTR-TOTL-AM     31430005
304700     ELSE                                                         31440005
304800        MOVE SPACES          TO AR97HD-1098-PREV-INTR-TOTL-AM     31450005
304900     END-IF                                                       31460005
305000     MOVE AR69-CLLT-RELS-IN         TO AR97-CLLT-RELS-IN          31470005
305100     IF AR69-CMBN-LTV-RT            IS NUMERIC                    31480005
305200        MOVE AR69-CMBN-LTV-RT            TO WS-EDIT-S3            31490005
305300        MOVE WS-EDIT-S3       TO AR97-CMBN-LTV-RT                 31500005
305400     ELSE                                                         31510005
305500        MOVE SPACES           TO AR97-CMBN-LTV-RT                 31520005
305600     END-IF                                                       31530005
305700     IF AR69-DRAW-PERD-END-DT       IS NUMERIC                    31540005
305800        MOVE AR69-DRAW-PERD-END-DT       TO WS-EDIT-S9            31550005
305900        MOVE WS-EDIT-S9       TO AR97-DRAW-PERD-END-DT            31560005
306000     ELSE                                                         31570005
306100        MOVE SPACES           TO AR97-DRAW-PERD-END-DT            31580005
306200     END-IF                                                       31590005
306300     IF AR69-CLSN-CSTS-AM           IS NUMERIC                    31600005
306400        MOVE AR69-CLSN-CSTS-AM           TO WS-EDIT-S11V99        31610005
306500        MOVE WS-EDIT-S11V99   TO AR97-CLSN-CSTS-AM                31620005
306600     ELSE                                                         31630005
306700        MOVE SPACES           TO AR97-CLSN-CSTS-AM                31640005
306800     END-IF                                                       31650005
306900     IF AR69-AVOD-FINC-CHRG-AM      IS NUMERIC                    31660005
307000        MOVE AR69-AVOD-FINC-CHRG-AM      TO WS-EDIT-S15V99        31670005
307100        MOVE WS-EDIT-S15V99   TO AR97-AVOD-FINC-CHRG-AM           31680005
307200     ELSE                                                         31690005
307300        MOVE SPACES           TO AR97-AVOD-FINC-CHRG-AM           31700005
307400     END-IF                                                       31710005
307500     MOVE AR69-ASSC-PRDT-TYPE-CD    TO AR97-ASSC-PRDT-TYPE-CD     31720005
307600     IF AR69-HOME-EQTY-CHNG-DT      IS NUMERIC                    31730005
307700        MOVE AR69-HOME-EQTY-CHNG-DT      TO WS-EDIT-S9            31740005
307800        MOVE WS-EDIT-S9       TO AR97-HOME-EQTY-CHNG-DT           31750005
307900     ELSE                                                         31760005
308000        MOVE SPACES           TO AR97-HOME-EQTY-CHNG-DT           31770005
308100     END-IF                                                       31780005
308200     MOVE AR69-DCLN-AVLB-CRDT-OPTN-CD                             31790005
308300       TO AR97-DCLN-AVLB-CRDT-OPTN-CD                             31800005
308400     IF AR69-CLSN-CSTS-BLLD-DT      IS NUMERIC                    31810005
308500        MOVE AR69-CLSN-CSTS-BLLD-DT      TO WS-EDIT-S9            31820005
308600        MOVE WS-EDIT-S9       TO AR97-CLSN-CSTS-BLLD-DT           31830005
308700     ELSE                                                         31840005
308800        MOVE SPACES           TO AR97-CLSN-CSTS-BLLD-DT           31850005
308900     END-IF                                                       31860005
309000     MOVE AR69-ERLY-TRMN-FEE-IN     TO AR97-ERLY-TRMN-FEE-IN      31870005
309100     IF AR69-LFTM-CASH-AND-MRCH-AM  IS NUMERIC                    31880005
309200        MOVE AR69-LFTM-CASH-AND-MRCH-AM  TO WS-EDIT-S15V99        31890005
309300        MOVE WS-EDIT-S15V99   TO AR97-LFTM-CASH-AND-MRCH-AM       31900005
309400     ELSE                                                         31910005
309500        MOVE SPACES           TO AR97-LFTM-CASH-AND-MRCH-AM       31920005
309600     END-IF                                                       31930005
309700     MOVE AR69-FLIP-TRAN-SSPN-ST-CD TO AR97-FLIP-TRAN-SSPN-ST-CD  31940005
309800     MOVE AR69-TNSLT-XFER-CD        TO AR97-TNSLT-XFER-CD         31950005
309900     PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 6              31960005
310000        IF AR69-CLI-CNCL-DT (WS-I) IS NUMERIC                     31970005
310100           MOVE AR69-CLI-CNCL-DT (WS-I) TO WS-EDIT-S7             31980005
310200           MOVE WS-EDIT-S7              TO AR97-CLI-CNCL-DT (WS-I)31990005
310300        ELSE                                                      32000005
310400           MOVE SPACES                  TO AR97-CLI-CNCL-DT (WS-I)32010005
310500        END-IF                                                    32020005
310600        MOVE AR69-CLI-CNCL-RESN-CD (WS-I)                         32030005
310700          TO AR97-CLI-CNCL-RESN-CD (WS-I)                         32040005
310800        IF AR69-CLI-CNCL-DT (WS-I) IS NUMERIC                     32050005
310900           MOVE AR69-CLI-CNCL-DT(WS-I) TO WS-EDIT-S7              32060005
311000           MOVE WS-EDIT-S7             TO AR97-CLI-CNCL-DT (WS-I) 32070005
311100        ELSE                                                      32080005
311200           MOVE SPACES                 TO AR97-CLI-CNCL-DT (WS-I) 32090005
311300        END-IF                                                    32100005
311400        IF AR69-CLI-RNST-DT (WS-I) IS NUMERIC                     32110005
311500           MOVE AR69-CLI-RNST-DT(WS-I) TO WS-EDIT-S7              32120005
311600           MOVE WS-EDIT-S7             TO AR97-CLI-RNST-DT (WS-I) 32130005
311700        ELSE                                                      32140005
311800           MOVE SPACES                 TO AR97-CLI-RNST-DT (WS-I) 32150005
311900        END-IF                                                    32160005
312000        MOVE AR69-CLI-RFND-CD   (WS-I) TO AR97-CLI-RFND-CD (WS-I) 32170005
312100        MOVE AR69LS-CLI-STTS-CD (WS-I) TO AR97LS-CLI-STTS-CD(WS-I)32180005
312200        MOVE AR69PS-CLI-STTS-CD (WS-I) TO AR97PS-CLI-STTS-CD(WS-I)32190005
312300     END-PERFORM                                                  32200005
312400     MOVE AR69-07-DAY-PYMT-CT        TO AR97-07-DAY-PYMT-CT       32210005
312500     MOVE AR69-15-DAY-PYMT-CT        TO AR97-15-DAY-PYMT-CT       32220005
312600     MOVE AR69-CRD-BUR-DROP-IN       TO AR97-CRD-BUR-DROP-IN      32230005
312700     IF AR69-CRD-BUR-DROP-AM         IS NUMERIC                   32240005
312800        MOVE AR69-CRD-BUR-DROP-AM    TO WS-EDIT-S15V99            32250005
312900        MOVE WS-EDIT-S15V99    TO AR97-CRD-BUR-DROP-AM            32260005
313000     ELSE                                                         32270005
313100        MOVE SPACES            TO AR97-CRD-BUR-DROP-AM            32280005
313200     END-IF                                                       32290005
313300     IF AR69-CRD-BUR-DROP-DT         IS NUMERIC                   32300005
313400        MOVE AR69-CRD-BUR-DROP-DT    TO WS-EDIT-S9                32310005
313500        MOVE WS-EDIT-S9        TO AR97-CRD-BUR-DROP-DT            32320005
313600     ELSE                                                         32330005
313700        MOVE SPACES            TO AR97-CRD-BUR-DROP-DT            32340005
313800     END-IF                                                       32350005
313900     IF AR69BPS-RULS-DATA-1-AM IS NUMERIC                         32360005
314000        MOVE AR69BPS-RULS-DATA-1-AM  TO WS-EDIT-S13V99            32370005
314100        MOVE WS-EDIT-S13V99    TO AR97BPS-RULS-DATA-1-AM          32380005
314200     ELSE                                                         32390005
314300        MOVE SPACES            TO AR97BPS-RULS-DATA-1-AM          32400005
314400     END-IF                                                       32410005
314500     IF AR69BPS-RULS-DATA-2-AM  IS NUMERIC                        32420005
314600        MOVE AR69BPS-RULS-DATA-2-AM  TO WS-EDIT-S13V99            32430005
314700        MOVE WS-EDIT-S13V99    TO AR97BPS-RULS-DATA-2-AM          32440005
314800     ELSE                                                         32450005
314900        MOVE SPACES            TO AR97BPS-RULS-DATA-2-AM          32460005
315000     END-IF                                                       32470005
315100     IF AR69BPS-RULS-DATA-3-AM  IS NUMERIC                        32480005
315200        MOVE AR69BPS-RULS-DATA-3-AM  TO WS-EDIT-S13V99            32490005
315300        MOVE WS-EDIT-S13V99    TO AR97BPS-RULS-DATA-3-AM          32500005
315400     ELSE                                                         32510005
315500        MOVE SPACES            TO AR97BPS-RULS-DATA-3-AM          32520005
315600     END-IF                                                       32530005
315700     IF AR69BPS-RULS-DATA-4-AM  IS NUMERIC                        32540005
315800        MOVE AR69BPS-RULS-DATA-4-AM  TO WS-EDIT-S13V99            32550005
315900        MOVE WS-EDIT-S13V99    TO AR97BPS-RULS-DATA-4-AM          32560005
316000     ELSE                                                         32570005
316100        MOVE SPACES            TO AR97BPS-RULS-DATA-4-AM          32580005
316200     END-IF                                                       32590005
316300     IF AR69BPS-1-RULS-DATA-1-AM  IS NUMERIC                      32600005
316400        MOVE AR69BPS-1-RULS-DATA-1-AM TO WS-EDIT-S13V99           32610005
316500        MOVE WS-EDIT-S13V99    TO AR97BPS-1-RULS-DATA-1-AM        32620005
316600     ELSE                                                         32630005
316700        MOVE SPACES            TO AR97BPS-1-RULS-DATA-1-AM        32640005
316800     END-IF                                                       32650005
316900     IF AR69BPS-1-RULS-DATA-2-AM  IS NUMERIC                      32660005
317000        MOVE AR69BPS-1-RULS-DATA-2-AM TO WS-EDIT-S13V99           32670005
317100        MOVE WS-EDIT-S13V99    TO AR97BPS-1-RULS-DATA-2-AM        32680005
317200     ELSE                                                         32690005
317300        MOVE SPACES            TO AR97BPS-1-RULS-DATA-2-AM        32700005
317400     END-IF                                                       32710005
317500     IF AR69BPS-1-RULS-DATA-3-AM  IS NUMERIC                      32720005
317600        MOVE AR69BPS-1-RULS-DATA-3-AM TO WS-EDIT-S13V99           32730005
317700        MOVE WS-EDIT-S13V99    TO AR97BPS-1-RULS-DATA-3-AM        32740005
317800     ELSE                                                         32750005
317900        MOVE SPACES            TO AR97BPS-1-RULS-DATA-3-AM        32760005
318000     END-IF                                                       32770005
318100     IF AR69BPS-1-RULS-DATA-4-AM  IS NUMERIC                      32780005
318200        MOVE AR69BPS-1-RULS-DATA-4-AM TO WS-EDIT-S13V99           32790005
318300        MOVE WS-EDIT-S13V99    TO AR97BPS-1-RULS-DATA-4-AM        32800005
318400     ELSE                                                         32810005
318500        MOVE SPACES            TO AR97BPS-1-RULS-DATA-4-AM        32820005
318600     END-IF                                                       32830005
318700     MOVE AR69-RULS-DATA-1-CD        TO AR97-RULS-DATA-1-CD       32840005
318800     MOVE AR69-ATPY-ENRL-TYPE-CD     TO AR97-ATPY-ENRL-TYPE-CD    32850005
318900     IF AR69-1STY-MXFE-ALLW-AM    IS NUMERIC                      32860005
319000        MOVE AR69-1STY-MXFE-ALLW-AM  TO WS-EDIT-S15V99            32870005
319100        MOVE WS-EDIT-S15V99          TO AR97-1STY-MXFE-ALLW-AM    32880005
319200     ELSE                                                         32890005
319300        MOVE SPACES                  TO AR97-1STY-MXFE-ALLW-AM    32900005
319400     END-IF                                                       32910005
319500     MOVE AR69-RECOVERY-CD           TO AR97-RECOVERY-CD.         32920005
319600     PERFORM 3100-GET-NUMERIC-DATA.                               32930005
      *****************************                                     32940005
       4800-PROCESS-MSTR-REC.                                           32950005
      *****************************                                     32960005
319700*----------------*                                                32970005
319800*CUSTOMER SEGMENT - PRESENT IF AR69-NO-CUSTOMER-SEGS = 1          32980005
319900*----------------*                                                32990005
320000     IF AR69-NO-CUSTOMER-SEGS > 0                                 33000005
320100        MOVE AR69-PRINCIPAL-NAME (1) TO AR97-PRINCIPAL-NAME (1)   33010005
320200        MOVE AR69-SPOUSE-NAME    (1) TO AR97-SPOUSE-NAME (1)      33020005
320300        MOVE AR69-ADDR-LINE-1    (1) TO AR97-ADDR-LINE-1 (1)      33030005
320400        MOVE AR69-ADDR-LINE-2    (1) TO AR97-ADDR-LINE-2 (1)      33040005
320500        MOVE AR69-CITY  (1)          TO AR97-CITY (1)             33050005
320510        MOVE SPACES                  TO FILLER1(1)                33060005
320600        MOVE AR69-STATE (1)          TO AR97-STATE(1)             33070005
320700        MOVE AR69-DELIVERY-POINT (1) TO AR97-DELIVERY-POINT (1)   33080005
320800        MOVE AR69-PD-ADDR-LINE-3 (1) TO AR97-PD-ADDR-LINE-3 (1)   33090005
320900        MOVE AR69-PD-COUNTY      (1) TO AR97-PD-COUNTY (1)        33100005
321000        MOVE AR69-PD-POSTCODE    (1) TO AR97-PD-POSTCODE (1)      33110005
321100        MOVE AR69-SEX-CODE (1)       TO AR97-SEX-CODE (1)         33120005
321200        MOVE AR69-MOTHERS-MAIDEN-NAME (1)                         33130005
321300          TO AR97-MOTHERS-MAIDEN-NAME (1)                         33140005
321400        MOVE AR69-ADDRESS-FLAG    (1) TO AR97-ADDRESS-FLAG (1)    33150005
321500        MOVE AR69-HOME-PHONE-FLAG (1) TO AR97-HOME-PHONE-FLAG (1) 33160005
321600        MOVE AR69-BUSINESS-PHONE-FLAG (1)                         33170005
321700          TO AR97-BUSINESS-PHONE-FLAG (1)                         33180005
321800        MOVE AR69-DECEASED-FLAG (1)   TO AR97-DECEASED-FLAG (1)   33190005
321900        MOVE AR69-SOLICITATION-FLAG(1)                            33200005
322000          TO AR97-SOLICITATION-FLAG(1)                            33210005
322100        MOVE AR69-EMPL-ACCT-CD    (1) TO AR97-EMPL-ACCT-CD (1)    33220005
322200        MOVE AR69-ALT-CUSTOMER-NO (1) TO AR97-ALT-CUSTOMER-NO (1) 33230005
322300        IF AR69-ZIP-CODE(1) IS NUMERIC                            33240005
322400           MOVE AR69-ZIP-CODE (1)    TO WS-EDIT-S9                33250005
322500           MOVE WS-EDIT-S9           TO AR97-ZIP-CODE (1)         33260005
322600        END-IF                                                    33270005
322700        IF AR69-NUMERIC-STATE (1)      IS NUMERIC                 33280005
322800           MOVE AR69-NUMERIC-STATE (1)      TO WS-EDIT-S3         33290005
322900           MOVE WS-EDIT-S3       TO AR97-NUMERIC-STATE (1)        33300005
323000        ELSE                                                      33310005
323100           MOVE SPACES           TO AR97-NUMERIC-STATE (1)        33320005
323200        END-IF                                                    33330005
323300        IF AR69-PD-PREFIX  (1)         IS NUMERIC                 33340005
323400           MOVE AR69-PD-PREFIX  (1)         TO WS-EDIT-S3         33350005
323500           MOVE WS-EDIT-S3       TO AR97-PD-PREFIX (1)            33360005
323600        ELSE                                                      33370005
323700           MOVE SPACES           TO AR97-PD-PREFIX (1)            33380005
323800        END-IF                                                    33390005
323900        IF AR69-PD-SUFFIX (1)          IS NUMERIC                 33400005
324000           MOVE AR69-PD-SUFFIX (1)          TO WS-EDIT-S3         33410005
324100           MOVE WS-EDIT-S3       TO AR97-PD-SUFFIX (1)            33420005
324200        ELSE                                                      33430005
324300           MOVE SPACES           TO AR97-PD-SUFFIX (1)            33440005
324400        END-IF                                                    33450005
324500        IF AR69-PD-ADDRESS-FORMAT (1)  IS NUMERIC                 33460005
324600           MOVE AR69-PD-ADDRESS-FORMAT (1)   TO  WS-EDIT-S1       33470005
324700           MOVE WS-EDIT-S1                   TO                   33480005
324800                AR97-PD-ADDRESS-FORMAT (1)                        33490005
324900        ELSE                                                      33500005
325000           MOVE SPACES     TO AR97-PD-ADDRESS-FORMAT (1)          33510005
325100        END-IF                                                    33520005
325200        IF AR69-SD-PREFIX  (1)         IS NUMERIC                 33530005
325300           MOVE AR69-SD-PREFIX  (1)    TO WS-EDIT-S3              33540005
325400           MOVE WS-EDIT-S3       TO AR97-SD-PREFIX (1)            33550005
325500        ELSE                                                      33560005
325600           MOVE SPACES           TO AR97-SD-PREFIX (1)            33570005
325700        END-IF                                                    33580005
325800        IF AR69-SD-SUFFIX (1)          IS NUMERIC                 33590005
325900           MOVE AR69-SD-SUFFIX (1)          TO WS-EDIT-S3         33600005
326000           MOVE WS-EDIT-S3       TO AR97-SD-SUFFIX (1)            33610005
326100        ELSE                                                      33620005
326200           MOVE SPACES           TO AR97-SD-SUFFIX (1)            33630005
326300        END-IF                                                    33640005
326400        IF AR69-SOC-SECURITY-NO (1)    IS NUMERIC                 33650005
326500           MOVE AR69-SOC-SECURITY-NO (1)    TO WS-EDIT-S9         33660005
326600           MOVE WS-EDIT-S9       TO AR97-SOC-SECURITY-NO (1)      33670005
326700        ELSE                                                      33680005
326800           MOVE SPACES           TO AR97-SOC-SECURITY-NO (1)      33690005
326900        END-IF                                                    33700005
327000        IF AR69-TELEPHONE-NUMBER(1)    IS NUMERIC                 33710005
327100           MOVE AR69-TELEPHONE-NUMBER(1)    TO WS-EDIT-S11        33720005
327200           MOVE WS-EDIT-S11      TO AR97-TELEPHONE-NUMBER (1)     33730005
327300        ELSE                                                      33740005
327400           MOVE SPACES           TO AR97-TELEPHONE-NUMBER (1)     33750005
327500        END-IF                                                    33760005
327600        IF AR69-SECOND-TELEPHONE-NUMBER(1) IS NUMERIC             33770005
327700           MOVE AR69-SECOND-TELEPHONE-NUMBER(1) TO WS-EDIT-S11    33780005
327800           MOVE WS-EDIT-S11    TO AR97-SECOND-TELEPHONE-NUMBER (1)33790005
327900        ELSE                                                      33800005
328000           MOVE SPACES         TO AR97-SECOND-TELEPHONE-NUMBER (1)33810005
328100        END-IF                                                    33820005
328200        IF AR69-HOME-PHONE-FORMAT (1) > 0                         33830005
328300           MOVE AR69-HOME-PHONE-FORMAT  (1) TO WS-EDIT-S4         33840005
328400           MOVE WS-EDIT-S4     TO AR97-HOME-PHONE-FORMAT (1)      33850005
328500        ELSE                                                      33860005
328600           MOVE SPACES         TO AR97-HOME-PHONE-FORMAT (1)      33870005
328700        END-IF                                                    33880005
328800        IF AR69-BUS-PHONE-FORMAT (1) > 0                          33890005
328900           MOVE AR69-BUS-PHONE-FORMAT  (1) TO WS-EDIT-S4          33900005
329000           MOVE WS-EDIT-S4     TO AR97-BUS-PHONE-FORMAT (1)       33910005
329100        ELSE                                                      33920005
329200           MOVE SPACES         TO AR97-BUS-PHONE-FORMAT (1)       33930005
329300        END-IF                                                    33940005
329400        IF AR69-SECONDARY-SOC-SEC-NO (1)   IS NUMERIC             33950005
329500           MOVE AR69-SECONDARY-SOC-SEC-NO(1) TO WS-EDIT-S9        33960005
329600           MOVE WS-EDIT-S9       TO AR97-SECONDARY-SOC-SEC-NO(1)  33970005
329700        ELSE                                                      33980005
329800           MOVE SPACES           TO AR97-SECONDARY-SOC-SEC-NO(1)  33990005
329900        END-IF                                                    34000005
330000        IF AR69-DATE-LAST-ADDR-CHANGE(1)   IS NUMERIC             34010005
330100           MOVE AR69-DATE-LAST-ADDR-CHANGE(1) TO WS-EDIT-S7       34020005
330200           MOVE WS-EDIT-S7       TO AR97-DATE-LAST-ADDR-CHANGE(1) 34030005
330300        ELSE                                                      34040005
330400           MOVE SPACES           TO AR97-DATE-LAST-ADDR-CHANGE(1) 34050005
330500        END-IF                                                    34060005
330600        IF AR69-NAME-ADDR-CHG (1)        IS NUMERIC               34070005
330700           MOVE AR69-NAME-ADDR-CHG (1)       TO  WS-EDIT-S1       34080005
330800           MOVE WS-EDIT-S1                   TO                   34090005
330900                AR97-NAME-ADDR-CHG (1)                            34100005
331000        ELSE                                                      34110005
331100           MOVE SPACES                       TO                   34120005
331200                AR97-NAME-ADDR-CHG (1)                            34130005
331300        END-IF                                                    34140005
331400        IF AR69-DATE-OF-BIRTH (1)        IS NUMERIC               34150005
331500           MOVE AR69-DATE-OF-BIRTH (1)   TO WS-EDIT-S9            34160005
331600           MOVE WS-EDIT-S9               TO AR97-DATE-OF-BIRTH(1) 34170005
331700        ELSE                                                      34180005
331800           MOVE SPACES                   TO AR97-DATE-OF-BIRTH(1) 34190005
331900        END-IF                                                    34200005
332000        IF AR69-SECONDARY-DATE-OF-BIRTH (1) IS NUMERIC            34210005
332100           MOVE AR69-SECONDARY-DATE-OF-BIRTH (1) TO WS-EDIT-S9    34220005
332200           MOVE WS-EDIT-S9                                        34230005
332300             TO AR97-SECONDARY-DATE-OF-BIRTH (1)                  34240005
332400        ELSE                                                      34250005
332500           MOVE SPACES                                            34260005
332600             TO AR97-SECONDARY-DATE-OF-BIRTH (1)                  34270005
332700        END-IF                                                    34280005
332800        IF AR69-FIXD-MPD-USAG-CD(1)      IS NUMERIC               34290005
332900           MOVE AR69-FIXD-MPD-USAG-CD (1)    TO  WS-EDIT-S1       34300005
333000           MOVE WS-EDIT-S1                   TO                   34310005
333100                AR97-FIXD-MPD-USAG-CD (1)                         34320005
333200        ELSE                                                      34330005
333300           MOVE SPACES                       TO                   34340005
333400                AR97-FIXD-MPD-USAG-CD (1)                         34350005
333500        END-IF                                                    34360005
333600        IF AR69-MPW-APR-OVRR-USAG-CD (1) IS NUMERIC               34370005
333700           MOVE AR69-MPW-APR-OVRR-USAG-CD(1) TO  WS-EDIT-S1       34380005
333800           MOVE WS-EDIT-S1                   TO                   34390005
333900                AR97-MPW-APR-OVRR-USAG-CD(1)                      34400005
334000        ELSE                                                      34410005
334100           MOVE SPACES                       TO                   34420005
334200                AR97-MPW-APR-OVRR-USAG-CD(1)                      34430005
334300        END-IF                                                    34440005
334400        IF AR69-MPW-APR-OVRR-USAG-DT (1) IS NUMERIC               34450005
334500           MOVE AR69-MPW-APR-OVRR-USAG-DT(1) TO  WS-EDIT-S9       34460005
334600           MOVE WS-EDIT-S9  TO AR97-MPW-APR-OVRR-USAG-DT(1)       34470005
334700        ELSE                                                      34480005
334800           MOVE SPACES      TO AR97-MPW-APR-OVRR-USAG-DT(1)       34490005
334900        END-IF                                                    34500005
335000        PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 4           34510005
335100          IF AR69-FIXD-MPD-OVRR-AM (1, WS-I)    IS NUMERIC        34520005
335200            MOVE AR69-FIXD-MPD-OVRR-AM (1, WS-I) TO WS-EDIT-S15V9934530005
335300            MOVE WS-EDIT-S15V99 TO AR97-FIXD-MPD-OVRR-AM (1, WS-I)34540005
335400          ELSE                                                    34550005
335500            MOVE SPACES         TO AR97-FIXD-MPD-OVRR-AM (1, WS-I)34560005
335600          END-IF                                                  34570005
335700          IF AR69-FIXD-MPD-OVRR-DT (1, WS-I)    IS NUMERIC        34580005
335800            MOVE AR69-FIXD-MPD-OVRR-DT (1, WS-I) TO WS-EDIT-S9    34590005
335900            MOVE WS-EDIT-S15V99 TO AR97-FIXD-MPD-OVRR-DT (1, WS-I)34600005
336000          ELSE                                                    34610005
336100            MOVE SPACES         TO AR97-FIXD-MPD-OVRR-DT (1, WS-I)34620005
336200          END-IF                                                  34630005
336300        END-PERFORM                                               34640005
336400     ELSE                                                         34650005
336500        MOVE SPACES     TO AR97-CUSTOMER-DATA-SEGMENT (1)         34660005
336600     END-IF                                                       34670005
779900* NOW ENTIRE OUTPUT IS POPULATED. WRITE IT OUT.                   34680005
780000*                                                                 34690005
780020      PERFORM 9000-JUNK-VALUE-CHK-PARA                            34700005
FDBARB* HISTORY-DATA                                                    34710005
FDBARB     PERFORM 3500-VALIDATE-HISTORY-FIELDS VARYING PV-SUB-1        34720005
FDBARB         FROM 1 BY 1 UNTIL PV-SUB-1 > 12.                         34730005
FDBARB                                                                  34740005
FDBARB     PERFORM 3600-VALIDATE-HISTORY-FIELDS VARYING PV-SUB-1        34750005
FDBARB         FROM 1 BY 1 UNTIL PV-SUB-1 > 12.                         34760005
FDBARB                                                                  34770005
780100     WRITE CARD-MASTER-OUT-REC                                    34780005
780200        FROM AR97-MASTER-DATA.                                    34790005
780300     ADD 1                       TO PV-MSTR-COUNT.                34800005
780400                                                                  34810005
780500*-------------------------------*                                 34820005
780600 3100-GET-NUMERIC-DATA.                                           34830005
780700*-------------------------------*                                 34840005
780800* S9V OR S9  = X(2)                                               34850005
780900     IF AR69-DEBIT-BALANCE-CYCLE  IS NUMERIC                      34860005
781000        MOVE AR69-DEBIT-BALANCE-CYCLE     TO  WS-EDIT-S1          34870005
781100        MOVE WS-EDIT-S1                   TO                      34880005
781200             AR97-DEBIT-BALANCE-CYCLE                             34890005
781300     ELSE                                                         34900005
781400        MOVE SPACES   TO  AR97-DEBIT-BALANCE-CYCLE                34910005
781500     END-IF                                                       34920005
781600     IF AR69-DAY-1-DEBITS         IS NUMERIC                      34930005
781700        MOVE AR69-DAY-1-DEBITS            TO  WS-EDIT-S1          34940005
781800        MOVE WS-EDIT-S1                   TO  AR97-DAY-1-DEBITS   34950005
781900     ELSE                                                         34960005
782000        MOVE SPACES                       TO  AR97-DAY-1-DEBITS   34970005
782100     END-IF                                                       34980005
782200     IF AR69-DAY-2-DEBITS         IS NUMERIC                      34990005
782300        MOVE AR69-DAY-2-DEBITS            TO  WS-EDIT-S1          35000005
782400        MOVE WS-EDIT-S1                   TO  AR97-DAY-2-DEBITS   35010005
782500     ELSE                                                         35020005
782600        MOVE SPACES                       TO  AR97-DAY-2-DEBITS   35030005
782700     END-IF                                                       35040005
782800     IF AR69-DAY-3-DEBITS         IS NUMERIC                      35050005
782900        MOVE AR69-DAY-3-DEBITS            TO  WS-EDIT-S1          35060005
783000        MOVE WS-EDIT-S1                   TO  AR97-DAY-3-DEBITS   35070005
783100     ELSE                                                         35080005
783200        MOVE SPACES                       TO  AR97-DAY-3-DEBITS   35090005
783300     END-IF                                                       35100005
783400     IF AR69-DAY-4-DEBITS         IS NUMERIC                      35110005
783500        MOVE AR69-DAY-4-DEBITS            TO  WS-EDIT-S1          35120005
783600        MOVE WS-EDIT-S1                   TO  AR97-DAY-4-DEBITS   35130005
783700     ELSE                                                         35140005
783800        MOVE SPACES                       TO  AR97-DAY-4-DEBITS   35150005
783900     END-IF                                                       35160005
784000     IF AR69-DAY-5-DEBITS         IS NUMERIC                      35170005
784100        MOVE AR69-DAY-5-DEBITS            TO  WS-EDIT-S1          35180005
784200        MOVE WS-EDIT-S1                   TO  AR97-DAY-5-DEBITS   35190005
784300     ELSE                                                         35200005
784400        MOVE SPACES                       TO  AR97-DAY-5-DEBITS   35210005
784500     END-IF                                                       35220005
784600     IF AR69-DAY-6-DEBITS         IS NUMERIC                      35230005
784700        MOVE AR69-DAY-6-DEBITS            TO  WS-EDIT-S1          35240005
784800        MOVE WS-EDIT-S1                   TO  AR97-DAY-6-DEBITS   35250005
784900     ELSE                                                         35260005
785000        MOVE SPACES                       TO  AR97-DAY-6-DEBITS   35270005
785100     END-IF                                                       35280005
785200                                                                  35290005
785300     IF AR69-COLL-PROC-FLAG       IS NUMERIC                      35300005
785400        MOVE AR69-COLL-PROC-FLAG          TO  WS-EDIT-S1          35310005
785500        MOVE WS-EDIT-S1                   TO  AR97-COLL-PROC-FLAG 35320005
785600     ELSE                                                         35330005
785700        MOVE SPACES                       TO  AR97-COLL-PROC-FLAG 35340005
785800     END-IF                                                       35350005
785900     IF AR69-RENEWAL-CODE         IS NUMERIC                      35360005
786000        MOVE AR69-RENEWAL-CODE            TO  WS-EDIT-S1          35370005
786100        MOVE WS-EDIT-S1                   TO  AR97-RENEWAL-CODE   35380005
786200     ELSE                                                         35390005
786300        MOVE SPACES                       TO  AR97-RENEWAL-CODE   35400005
786400     END-IF                                                       35410005
786500     IF AR69-ANN-FEE-CHARGED      IS NUMERIC                      35420005
786600        MOVE AR69-ANN-FEE-CHARGED         TO  WS-EDIT-S1          35430005
786700        MOVE WS-EDIT-S1                   TO  AR97-ANN-FEE-CHARGED35440005
786800     ELSE                                                         35450005
786900        MOVE SPACES                       TO  AR97-ANN-FEE-CHARGED35460005
787000     END-IF                                                       35470005
787100     IF AR69-PINOFFSET-SECCODE-CHG-SW IS NUMERIC                  35480005
787200        MOVE AR69-PINOFFSET-SECCODE-CHG-SW  TO  WS-EDIT-S1        35490005
787300        MOVE WS-EDIT-S1                   TO                      35500005
787400             AR97-PINOFFSET-SECCODE-CHG-SW                        35510005
787500     ELSE                                                         35520005
787600        MOVE SPACES                       TO                      35530005
787700             AR97-PINOFFSET-SECCODE-CHG-SW                        35540005
787800     END-IF                                                       35550005
787900     IF AR69-PD-ADDRESS-FORMAT (1)    IS NUMERIC                  35560005
788000        MOVE AR69-PD-ADDRESS-FORMAT (1)   TO  WS-EDIT-S1          35570005
788100        MOVE WS-EDIT-S1                   TO                      35580005
788200             AR97-PD-ADDRESS-FORMAT (1)                           35590005
788300     ELSE                                                         35600005
788400        MOVE SPACES                       TO                      35610005
788500             AR97-PD-ADDRESS-FORMAT (1)                           35620005
788600     END-IF                                                       35630005
790300                                                                  35640005
790400**** MOVING S9(3)V VALUES TO OUTPUT AFTER FORMATTING              35650005
790500     IF AR69-AFK-ENTITY       IS NUMERIC                          35660005
790600        MOVE AR69-AFK-ENTITY     TO WS-EDIT-S3                    35670005
790700        MOVE WS-EDIT-S3                                           35680005
790800          TO AR97-AFK-ENTITY                                      35690005
790900     ELSE                                                         35700005
791000        MOVE SPACES                                               35710005
791100          TO AR97-AFK-ENTITY                                      35720005
791200     END-IF                                                       35730005
791300     IF AR69-AFK-CARD-NOCARD  IS NUMERIC                          35740005
791400        MOVE AR69-AFK-CARD-NOCARD TO WS-EDIT-S3                   35750005
791500        MOVE WS-EDIT-S3                                           35760005
791600          TO AR97-AFK-CARD-NOCARD                                 35770005
791700     ELSE                                                         35780005
791800        MOVE SPACES                                               35790005
791900          TO AR97-AFK-ENTITY                                      35800005
792000     END-IF                                                       35810005
792100     IF AR69-BEHAVIOR-SCORE IS NUMERIC                            35820005
792200        MOVE AR69-BEHAVIOR-SCORE TO WS-EDIT-S3                    35830005
792300        MOVE WS-EDIT-S3                                           35840005
792400          TO AR97-BEHAVIOR-SCORE                                  35850005
792500     ELSE                                                         35860005
792600        MOVE SPACES                                               35870005
792700          TO AR97-BEHAVIOR-SCORE                                  35880005
792800     END-IF                                                       35890005
792900     IF AR69-PREV-BHVR-SCORE IS NUMERIC                           35900005
793000        MOVE AR69-PREV-BHVR-SCORE TO WS-EDIT-S3                   35910005
793100        MOVE WS-EDIT-S3           TO AR97-PREV-BHVR-SCORE         35920005
793200     ELSE                                                         35930005
793300        MOVE SPACES                                               35940005
793400          TO AR97-PREV-BHVR-SCORE                                 35950005
793500     END-IF                                                       35960005
793600     IF AR69-COLLECTION-CODE  IS NUMERIC                          35970005
793700        MOVE AR69-COLLECTION-CODE       TO WS-EDIT-S3             35980005
793800        MOVE WS-EDIT-S3                 TO AR97-COLLECTION-CODE   35990005
793900     ELSE                                                         36000005
794000        MOVE SPACES        TO AR97-COLLECTION-CODE                36010005
794100     END-IF                                                       36020005
794200     IF AR69-NO-PLASTICS IS NUMERIC                               36030005
794300        MOVE AR69-NO-PLASTICS           TO WS-EDIT-S3             36040005
794400        MOVE WS-EDIT-S3                 TO                        36050005
794500             AR97-NO-PLASTICS                                     36060005
794600     ELSE                                                         36070005
794700        MOVE SPACES           TO                                  36080005
794800             AR97-NO-PLASTICS                                     36090005
794900     END-IF                                                       36100005
795000     IF AR69-LS-CASH-MOVE-DATE IS NUMERIC                         36110005
795100        MOVE AR69-LS-CASH-MOVE-DATE     TO WS-EDIT-S3             36120005
795200        MOVE WS-EDIT-S3                 TO                        36130005
795300             AR97-LS-CASH-MOVE-DATE                               36140005
795400     ELSE                                                         36150005
795500        MOVE SPACES           TO                                  36160005
795600             AR97-LS-CASH-MOVE-DATE                               36170005
795700     END-IF                                                       36180005
795800                                                                  36190005
795900     IF AR69-AFK-ENTITY       IS NUMERIC                          36200005
796000        MOVE AR69-AFK-ENTITY     TO WS-EDIT-S3                    36210005
796100        MOVE WS-EDIT-S3                                           36220005
796200          TO AR97-AFK-ENTITY                                      36230005
796300     ELSE                                                         36240005
796400        MOVE SPACES                                               36250005
796500          TO AR97-AFK-ENTITY                                      36260005
796600     END-IF                                                       36270005
796700     IF AR69-AFK-CARD-NOCARD  IS NUMERIC                          36280005
796800        MOVE AR69-AFK-CARD-NOCARD TO WS-EDIT-S3                   36290005
796900        MOVE WS-EDIT-S3                                           36300005
797000          TO AR97-AFK-CARD-NOCARD                                 36310005
797100     ELSE                                                         36320005
797200        MOVE SPACES TO AR97-AFK-CARD-NOCARD                       36330005
797300     END-IF                                                       36340005
797400     IF AR69-BEHAVIOR-SCORE IS NUMERIC                            36350005
797500        MOVE AR69-BEHAVIOR-SCORE TO WS-EDIT-S3                    36360005
797600        MOVE WS-EDIT-S3          TO AR97-BEHAVIOR-SCORE           36370005
797700     ELSE                                                         36380005
797800        MOVE SPACES                                               36390005
797900          TO AR97-BEHAVIOR-SCORE                                  36400005
798000     END-IF                                                       36410005
798100     IF AR69-PREV-BHVR-SCORE IS NUMERIC                           36420005
798200        MOVE AR69-PREV-BHVR-SCORE TO WS-EDIT-S3                   36430005
798300        MOVE WS-EDIT-S3           TO AR97-PREV-BHVR-SCORE         36440005
798400     ELSE                                                         36450005
798500        MOVE SPACES               TO AR97-PREV-BHVR-SCORE         36460005
798600     END-IF                                                       36470005
798700     IF AR69-COLLECTION-CODE  IS NUMERIC                          36480005
798800        MOVE AR69-COLLECTION-CODE       TO WS-EDIT-S3             36490005
798900        MOVE WS-EDIT-S3                 TO AR97-COLLECTION-CODE   36500005
799000     ELSE                                                         36510005
799100        MOVE SPACES                     TO AR97-COLLECTION-CODE   36520005
799200     END-IF                                                       36530005
799300     IF AR69-NO-PLASTICS IS NUMERIC                               36540005
799400        MOVE AR69-NO-PLASTICS    TO WS-EDIT-S3                    36550005
799500        MOVE WS-EDIT-S3          TO AR97-NO-PLASTICS              36560005
799600     ELSE                                                         36570005
799700        MOVE SPACES              TO AR97-NO-PLASTICS              36580005
799800     END-IF                                                       36590005
799900     IF AR69-CRLIFE-ORIG-NUM-STATE  IS NUMERIC                    36600005
800000        MOVE AR69-CRLIFE-ORIG-NUM-STATE TO WS-EDIT-S3             36610005
800100        MOVE WS-EDIT-S3                 TO                        36620005
800200             AR97-CRLIFE-ORIG-NUM-STATE                           36630005
800300     ELSE                                                         36640005
800400        MOVE SPACES           TO                                  36650005
800500             AR97-CRLIFE-ORIG-NUM-STATE                           36660005
800600     END-IF                                                       36670005
800700     IF AR69-TYPE-LAST-NONMON IS NUMERIC                          36680005
800800        MOVE AR69-TYPE-LAST-NONMON      TO WS-EDIT-S3             36690005
800900        MOVE WS-EDIT-S3                 TO                        36700005
801000             AR97-TYPE-LAST-NONMON                                36710005
801100     ELSE                                                         36720005
801200        MOVE SPACES           TO AR97-TYPE-LAST-NONMON            36730005
801300     END-IF                                                       36740005
801400     IF AR69-PORTFOLIO-NO-OLD IS NUMERIC                          36750005
801500        MOVE AR69-PORTFOLIO-NO-OLD      TO WS-EDIT-S3             36760005
801600        MOVE WS-EDIT-S3                 TO                        36770005
801700             AR97-PORTFOLIO-NO-OLD                                36780005
801800     ELSE                                                         36790005
801900        MOVE SPACES           TO                                  36800005
802000             AR97-PORTFOLIO-NO-OLD                                36810005
802100     END-IF                                                       36820005
802200     IF AR69-LS-CASH-MOVE-DATE IS NUMERIC                         36830005
802300        MOVE AR69-LS-CASH-MOVE-DATE     TO WS-EDIT-S3             36840005
802400        MOVE WS-EDIT-S3                 TO                        36850005
802500             AR97-LS-CASH-MOVE-DATE                               36860005
802600     ELSE                                                         36870005
802700        MOVE SPACES           TO AR97-LS-CASH-MOVE-DATE           36880005
802800     END-IF                                                       36890005
802900     IF AR69-SORT-DISTRIBUTION IS NUMERIC                         36900005
803000        MOVE AR69-SORT-DISTRIBUTION     TO WS-EDIT-S3             36910005
803100        MOVE WS-EDIT-S3                 TO                        36920005
803200             AR97-SORT-DISTRIBUTION                               36930005
803300     ELSE                                                         36940005
803400        MOVE SPACES           TO                                  36950005
803500             AR97-SORT-DISTRIBUTION                               36960005
803600     END-IF                                                       36970005
803700     IF AR69-CB-SCORE IS NUMERIC                                  36980005
803800        MOVE AR69-CB-SCORE              TO WS-EDIT-S3             36990005
803900        MOVE WS-EDIT-S3                 TO                        37000005
804000             AR97-CB-SCORE                                        37010005
804100     ELSE                                                         37020005
804200        MOVE SPACES           TO AR97-CB-SCORE                    37030005
804300     END-IF                                                       37040005
804400     IF AR69-MO-CHARGE-INT-ONLY IS NUMERIC                        37050005
804500        MOVE AR69-MO-CHARGE-INT-ONLY    TO WS-EDIT-S3             37060005
804600        MOVE WS-EDIT-S3                 TO AR97-MO-CHARGE-INT-ONLY37070005
804700     ELSE                                                         37080005
804800        MOVE SPACES           TO AR97-MO-CHARGE-INT-ONLY          37090005
804900     END-IF                                                       37100005
805000     IF AR69-PINPOINT-CTD-COUNT    IS NUMERIC                     37110005
805100        MOVE AR69-PINPOINT-CTD-COUNT    TO WS-EDIT-S3             37120005
805200        MOVE WS-EDIT-S3                 TO AR97-PINPOINT-CTD-COUNT37130005
805300     ELSE                                                         37140005
805400        MOVE SPACES           TO AR97-PINPOINT-CTD-COUNT          37150005
805500     END-IF                                                       37160005
805600     IF AR69-UD-RISK-SCORE IS NUMERIC                             37170005
805700        MOVE AR69-UD-RISK-SCORE         TO WS-EDIT-S3             37180005
805800        MOVE WS-EDIT-S3      TO AR97-UD-RISK-SCORE                37190005
805900     ELSE                                                         37200005
806000        MOVE SPACES          TO AR97-UD-RISK-SCORE                37210005
806100     END-IF                                                       37220005
806200     IF AR69-UD-PRODUCT-TYPE IS NUMERIC                           37230005
806300        MOVE AR69-UD-PRODUCT-TYPE       TO WS-EDIT-S3             37240005
806400        MOVE WS-EDIT-S3      TO AR97-UD-PRODUCT-TYPE              37250005
806500     ELSE                                                         37260005
806600        MOVE SPACES          TO AR97-UD-PRODUCT-TYPE              37270005
806700     END-IF                                                       37280005
806800     IF AR69-OTST-CHCK-CT IS NUMERIC                              37290005
806900        MOVE AR69-OTST-CHCK-CT       TO WS-EDIT-S3                37300005
807000        MOVE WS-EDIT-S3       TO AR97-OTST-CHCK-CT                37310005
807100     ELSE                                                         37320005
807200        MOVE SPACES           TO AR97-OTST-CHCK-CT                37330005
807300     END-IF                                                       37340005
807400     IF AR69-SKIP-CHRG-OFF-DAYS-NR IS NUMERIC                     37350005
807500        MOVE AR69-SKIP-CHRG-OFF-DAYS-NR                           37360005
807600          TO WS-EDIT-S3                                           37370005
807700        MOVE WS-EDIT-S3      TO AR97-SKIP-CHRG-OFF-DAYS-NR        37380005
807800     ELSE                                                         37390005
807900        MOVE SPACES          TO AR97-SKIP-CHRG-OFF-DAYS-NR        37400005
808000     END-IF                                                       37410005
808100     IF AR69-LAST-STMT-RELJUL IS NUMERIC                          37420005
808200        MOVE AR69-LAST-STMT-RELJUL   TO WS-EDIT-S3                37430005
808300        MOVE WS-EDIT-S3       TO AR97-LAST-STMT-RELJUL            37440005
808400     ELSE                                                         37450005
808500        MOVE SPACES           TO AR97-LAST-STMT-RELJUL            37460005
808600     END-IF                                                       37470005
813500* S9(7)V OR S9(7)                                                 37480005
813600     IF AR69-RECORD-SQNC-CT IS NUMERIC                            37490005
813700        MOVE AR69-RECORD-SQNC-CT  TO WS-EDIT-S7                   37500005
813710        MOVE WS-EDIT-S7           TO AR97-RECORD-SQNC-CT          37510005
813800     ELSE                                                         37520005
813900        MOVE ZEROES            TO AR97-RECORD-SQNC-CT             37530005
814000     END-IF                                                       37540005
814100     IF AR69-CASH-MOVE-DATE          IS NUMERIC                   37550005
814200        MOVE AR69-CASH-MOVE-DATE           TO WS-EDIT-S7          37560005
814300        MOVE WS-EDIT-S7        TO AR97-CASH-MOVE-DATE             37570005
814400     ELSE                                                         37580005
814500        MOVE SPACES            TO AR97-CASH-MOVE-DATE             37590005
814600     END-IF                                                       37600005
814700     IF AR69-ICHG-DATE               IS NUMERIC                   37610005
814800        MOVE AR69-ICHG-DATE                TO WS-EDIT-S7          37620005
814900        MOVE WS-EDIT-S7        TO AR97-ICHG-DATE                  37630005
815000     ELSE                                                         37640005
815100        MOVE SPACES            TO AR97-ICHG-DATE                  37650005
815200     END-IF                                                       37660005
815300     IF AR69-DATE-FUTURE-TERMS       IS NUMERIC                   37670005
815400        MOVE AR69-DATE-FUTURE-TERMS        TO WS-EDIT-S7          37680005
815500        MOVE WS-EDIT-S7        TO AR97-DATE-FUTURE-TERMS          37690005
815600     ELSE                                                         37700005
815700        MOVE SPACES            TO AR97-DATE-FUTURE-TERMS          37710005
815800     END-IF                                                       37720005
815900     IF AR69-CB-SCORE-DATE           IS NUMERIC                   37730005
816000        MOVE AR69-CB-SCORE-DATE            TO WS-EDIT-S7          37740005
816100        MOVE WS-EDIT-S7        TO AR97-CB-SCORE-DATE              37750005
816200     ELSE                                                         37760005
816300        MOVE SPACES            TO AR97-CB-SCORE-DATE              37770005
816400     END-IF                                                       37780005
816500     IF AR69-DATE-LAST-NONMON         IS NUMERIC                  37790005
816600        MOVE AR69-DATE-LAST-NONMON         TO WS-EDIT-S7          37800005
816700        MOVE WS-EDIT-S7        TO AR97-DATE-LAST-NONMON           37810005
816800     ELSE                                                         37820005
816900        MOVE SPACES            TO AR97-DATE-LAST-NONMON           37830005
817000     END-IF                                                       37840005
817100     IF AR69-TEMP-PROMO-START-DATE    IS NUMERIC                  37850005
817200        MOVE AR69-TEMP-PROMO-START-DATE    TO WS-EDIT-S7          37860005
817300        MOVE WS-EDIT-S7        TO AR97-TEMP-PROMO-START-DATE      37870005
817400     ELSE                                                         37880005
817500        MOVE SPACES            TO AR97-TEMP-PROMO-START-DATE      37890005
817600     END-IF                                                       37900005
817700     IF AR69-TEMP-PROMO-END-DATE     IS NUMERIC                   37910005
817800        MOVE AR69-TEMP-PROMO-END-DATE      TO WS-EDIT-S7          37920005
817900        MOVE WS-EDIT-S7        TO AR97-TEMP-PROMO-END-DATE        37930005
818000     ELSE                                                         37940005
818100        MOVE SPACES            TO AR97-TEMP-PROMO-END-DATE        37950005
818200     END-IF                                                       37960005
818300     IF AR69-ANN-RATE-CASH            IS NUMERIC                  37970005
818400        MOVE AR69-ANN-RATE-CASH            TO WS-EDIT-S2V999      37980005
818500        MOVE WS-EDIT-S2V999    TO AR97-ANN-RATE-CASH              37990005
818600     ELSE                                                         38000005
818700        MOVE SPACES            TO AR97-ANN-RATE-CASH              38010005
818800     END-IF                                                       38020005
818900     IF AR69-ANN-RATE-MRCH            IS NUMERIC                  38030005
819000        MOVE AR69-ANN-RATE-MRCH            TO WS-EDIT-S2V999      38040005
819100        MOVE WS-EDIT-S2V999    TO AR97-ANN-RATE-MRCH              38050005
819200     ELSE                                                         38060005
819300        MOVE SPACES            TO AR97-ANN-RATE-MRCH              38070005
819400     END-IF                                                       38080005
819500     IF AR69-OLD-ANN-RATE             IS NUMERIC                  38090005
819600        MOVE AR69-OLD-ANN-RATE             TO WS-EDIT-S2V999      38100005
819700        MOVE WS-EDIT-S2V999    TO AR97-OLD-ANN-RATE               38110005
819800     ELSE                                                         38120005
819900        MOVE SPACES            TO AR97-OLD-ANN-RATE               38130005
820000     END-IF                                                       38140005
820100     IF AR69-OLD-ANN-RATE-CASH        IS NUMERIC                  38150005
820200        MOVE AR69-OLD-ANN-RATE-CASH        TO WS-EDIT-S2V999      38160005
820300        MOVE WS-EDIT-S2V999    TO AR97-OLD-ANN-RATE-CASH          38170005
820400     ELSE                                                         38180005
820500        MOVE SPACES            TO AR97-OLD-ANN-RATE-CASH          38190005
820600     END-IF                                                       38200005
820700     IF AR69-ANN-RATE-CASH-MAX        IS NUMERIC                  38210005
820800        MOVE AR69-ANN-RATE-CASH-MAX        TO WS-EDIT-S2V999      38220005
820900        MOVE WS-EDIT-S2V999    TO AR97-ANN-RATE-CASH-MAX          38230005
821000     ELSE                                                         38240005
821100        MOVE SPACES            TO AR97-ANN-RATE-CASH-MAX          38250005
821200     END-IF                                                       38260005
821300     IF AR69-ANN-RATE-MRCH-MAX        IS NUMERIC                  38270005
821400        MOVE AR69-ANN-RATE-MRCH-MAX        TO WS-EDIT-S2V999      38280005
821500        MOVE WS-EDIT-S2V999    TO AR97-ANN-RATE-MRCH-MAX          38290005
821600     ELSE                                                         38300005
821700        MOVE SPACES            TO AR97-ANN-RATE-MRCH-MAX          38310005
821800     END-IF                                                       38320005
821900     IF AR69-ANN-RATE-MRCH-FUTURE     IS NUMERIC                  38330005
822000        MOVE AR69-ANN-RATE-MRCH-FUTURE     TO WS-EDIT-S2V999      38340005
822100        MOVE WS-EDIT-S2V999    TO AR97-ANN-RATE-MRCH-FUTURE       38350005
822200     ELSE                                                         38360005
822300        MOVE SPACES            TO AR97-ANN-RATE-MRCH-FUTURE       38370005
822400     END-IF                                                       38380005
822500     IF AR69-ANN-RATE-CASH-FUTURE     IS NUMERIC                  38390005
822600        MOVE AR69-ANN-RATE-CASH-FUTURE     TO WS-EDIT-S2V999      38400005
822700        MOVE WS-EDIT-S2V999    TO AR97-ANN-RATE-CASH-FUTURE       38410005
822800     ELSE                                                         38420005
822900        MOVE SPACES            TO AR97-ANN-RATE-CASH-FUTURE       38430005
823000     END-IF                                                       38440005
823100     IF AR69-MONTHLY-RATE-CASH        IS NUMERIC                  38450005
823200        MOVE AR69-MONTHLY-RATE-CASH        TO WS-EDIT-SV95        38460005
823300        MOVE WS-EDIT-SV95      TO AR97-MONTHLY-RATE-CASH          38470005
823400     ELSE                                                         38480005
823500        MOVE SPACES            TO AR97-MONTHLY-RATE-CASH          38490005
823600     END-IF                                                       38500005
823700     IF AR69-DAILY-RATE-CASH          IS NUMERIC                  38510005
823800        MOVE AR69-DAILY-RATE-CASH          TO WS-EDIT-SV95        38520005
823900        MOVE WS-EDIT-SV95      TO AR97-DAILY-RATE-CASH            38530005
824000     ELSE                                                         38540005
824100        MOVE SPACES            TO AR97-DAILY-RATE-CASH            38550005
824200     END-IF                                                       38560005
824300     IF AR69-DAILY-RATE-CASH          IS NUMERIC                  38570005
824400        MOVE AR69-DAILY-RATE-CASH          TO WS-EDIT-SV97        38580005
824500        MOVE WS-EDIT-SV97      TO AR97-DAILY-RATE-CASH            38590005
824600     ELSE                                                         38600005
824700        MOVE SPACES            TO AR97-DAILY-RATE-CASH            38610005
824800     END-IF                                                       38620005
824900     IF AR69-MONTHLY-RATE             IS NUMERIC                  38630005
825000        MOVE AR69-MONTHLY-RATE             TO WS-EDIT-SV95        38640005
825100        MOVE WS-EDIT-SV95      TO AR97-MONTHLY-RATE               38650005
825200     ELSE                                                         38660005
825300        MOVE SPACES            TO AR97-MONTHLY-RATE               38670005
825400     END-IF                                                       38680005
825500     IF AR69-DAILY-RATE-MRCH          IS NUMERIC                  38690005
825600        MOVE AR69-DAILY-RATE-MRCH          TO WS-EDIT-SV97        38700005
825700        MOVE WS-EDIT-SV97      TO AR97-DAILY-RATE-MRCH            38710005
825800     ELSE                                                         38720005
825900        MOVE SPACES            TO AR97-DAILY-RATE-MRCH            38730005
826000     END-IF                                                       38740005
826100     IF AR69-ANN-RATE-CRDINT          IS NUMERIC                  38750005
826200        MOVE AR69-ANN-RATE-CRDINT          TO WS-EDIT-S2V999      38760005
826300        MOVE WS-EDIT-S2V999    TO AR97-ANN-RATE-CRDINT            38770005
826400     ELSE                                                         38780005
826500        MOVE SPACES            TO AR97-ANN-RATE-CRDINT            38790005
826600     END-IF                                                       38800005
826700     IF AR69-MONTHLY-RATE-CRDINT      IS NUMERIC                  38810005
826800        MOVE AR69-MONTHLY-RATE-CRDINT      TO WS-EDIT-SV95        38820005
826900        MOVE WS-EDIT-SV95      TO AR97-MONTHLY-RATE-CRDINT        38830005
827000     ELSE                                                         38840005
827100        MOVE SPACES            TO AR97-MONTHLY-RATE-CRDINT        38850005
827200     END-IF                                                       38860005
827300     IF AR69-DAILY-RATE-CRDINT        IS NUMERIC                  38870005
827400        MOVE AR69-DAILY-RATE-CRDINT        TO WS-EDIT-SV97        38880005
827500        MOVE WS-EDIT-SV97      TO AR97-DAILY-RATE-CRDINT          38890005
827600     ELSE                                                         38900005
827700        MOVE SPACES            TO AR97-DAILY-RATE-CRDINT          38910005
827800     END-IF                                                       38920005
827900     IF AR69-MTH-RATE-CASH-MAX        IS NUMERIC                  38930005
828000        MOVE AR69-MTH-RATE-CASH-MAX        TO WS-EDIT-SV95        38940005
828100        MOVE WS-EDIT-SV95      TO AR97-MTH-RATE-CASH-MAX          38950005
828200     ELSE                                                         38960005
828300        MOVE SPACES            TO AR97-MTH-RATE-CASH-MAX          38970005
828400     END-IF                                                       38980005
828500     IF AR69-MTH-RATE-MRCH-MAX        IS NUMERIC                  38990005
828600        MOVE AR69-MTH-RATE-MRCH-MAX        TO WS-EDIT-SV95        39000005
828700        MOVE WS-EDIT-SV95      TO AR97-MTH-RATE-MRCH-MAX          39010005
828800     ELSE                                                         39020005
828900        MOVE SPACES            TO AR97-MTH-RATE-MRCH-MAX          39030005
829000     END-IF                                                       39040005
829100     IF AR69-ANN-RATE-CASH-MIN        IS NUMERIC                  39050005
829200        MOVE AR69-ANN-RATE-CASH-MIN        TO WS-EDIT-S2V999      39060005
829300        MOVE WS-EDIT-S2V999    TO AR97-ANN-RATE-CASH-MIN          39070005
829400     ELSE                                                         39080005
829500        MOVE SPACES            TO AR97-ANN-RATE-CASH-MIN          39090005
829600     END-IF                                                       39100005
829700     IF AR69-ANN-RATE-MRCH-MIN        IS NUMERIC                  39110005
829800        MOVE AR69-ANN-RATE-MRCH-MIN        TO WS-EDIT-S2V999      39120005
829900        MOVE WS-EDIT-S2V999    TO AR97-ANN-RATE-MRCH-MIN          39130005
830000     ELSE                                                         39140005
830100        MOVE SPACES            TO AR97-ANN-RATE-MRCH-MIN          39150005
830200     END-IF                                                       39160005
830300     IF AR69-MTH-RATE-CASH-MIN        IS NUMERIC                  39170005
830400        MOVE AR69-MTH-RATE-CASH-MIN        TO WS-EDIT-SV95        39180005
830500        MOVE WS-EDIT-SV95      TO AR97-MTH-RATE-CASH-MIN          39190005
830600     ELSE                                                         39200005
830700        MOVE SPACES            TO AR97-MTH-RATE-CASH-MIN          39210005
830800     END-IF                                                       39220005
830900     IF AR69-MTH-RATE-MRCH-MIN        IS NUMERIC                  39230005
831000        MOVE AR69-MTH-RATE-MRCH-MIN        TO WS-EDIT-SV95        39240005
831100        MOVE WS-EDIT-SV95      TO AR97-MTH-RATE-MRCH-MIN          39250005
831200     ELSE                                                         39260005
831300        MOVE SPACES            TO AR97-MTH-RATE-MRCH-MIN          39270005
831400     END-IF                                                       39280005
831500     IF AR69-SOCIETY-LS-MRCH-RATE     IS NUMERIC                  39290005
831600        MOVE AR69-SOCIETY-LS-MRCH-RATE     TO WS-EDIT-S2V999      39300005
831700        MOVE WS-EDIT-S2V999    TO AR97-SOCIETY-LS-MRCH-RATE       39310005
831800     ELSE                                                         39320005
831900        MOVE SPACES            TO AR97-SOCIETY-LS-MRCH-RATE       39330005
832000     END-IF                                                       39340005
832100     IF AR69-SOCIETY-LS-CASH-RATE     IS NUMERIC                  39350005
832200        MOVE AR69-SOCIETY-LS-CASH-RATE     TO WS-EDIT-S2V999      39360005
832300        MOVE WS-EDIT-S2V999    TO AR97-SOCIETY-LS-CASH-RATE       39370005
832400     ELSE                                                         39380005
832500        MOVE SPACES            TO AR97-SOCIETY-LS-CASH-RATE       39390005
832600     END-IF                                                       39400005
832700     MOVE AR69-CR-SCORE-DATE            TO WS-EDIT-N4             39410005
832800     MOVE WS-EDIT-N4        TO AR97-CR-SCORE-DATE                 39420005
832900     MOVE AR69-CREDIT-SCORE    TO AR97-CREDIT-SCORE               39430005
833000     IF AR69-DATE-LAST-PIN-MAILER     IS NUMERIC                  39440005
833100        MOVE AR69-DATE-LAST-PIN-MAILER     TO WS-EDIT-S7          39450005
833200        MOVE WS-EDIT-S7        TO AR97-DATE-LAST-PIN-MAILER       39460005
833300     ELSE                                                         39470005
833400        MOVE SPACES            TO AR97-DATE-LAST-PIN-MAILER       39480005
833500     END-IF                                                       39490005
833600     IF AR69-LAST-STRATEGY-CHANGE-DATE IS NUMERIC                 39500005
833700        MOVE AR69-LAST-STRATEGY-CHANGE-DATE TO WS-EDIT-S7         39510005
833800        MOVE WS-EDIT-S7        TO AR97-LAST-STRATEGY-CHANGE-DATE  39520005
833900     ELSE                                                         39530005
834000        MOVE SPACES            TO AR97-LAST-STRATEGY-CHANGE-DATE  39540005
834100     END-IF.                                                      39550005
834200                                                                  39560005
FDBARB*-------------------------------*                                 39570005
FDBARB 3500-VALIDATE-HISTORY-FIELDS.                                    39580005
FDBARB*-------------------------------*                                 39590005
FDBARB                                                                  39600005
FDBARB     IF AR69HD-PH-1-12(PV-SUB-1) = SPACES OR                      39610005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = LOW-VALUES OR                  39620005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = '*'                            39630005
FDBARB         MOVE SPACE TO AR97-PH-1-12(PV-SUB-1)                     39640005
FDBARB     ELSE                                                         39650005
FDBARB       IF AR69HD-PH-1-12(PV-SUB-1) = '0' OR                       39660005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = '1' OR                         39670005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = '2' OR                         39680005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = '3' OR                         39690005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = '4' OR                         39700005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = '5' OR                         39710005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = '6' OR                         39720005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = '7' OR                         39730005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'A' OR                         39740005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'B' OR                         39750005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'C' OR                         39760005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'D' OR                         39770005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'E' OR                         39780005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'F' OR                         39790005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'G' OR                         39800005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'H' OR                         39810005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'I' OR                         39820005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'J' OR                         39830005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'K' OR                         39840005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'L' OR                         39850005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'M' OR                         39860005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'N' OR                         39870005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'O' OR                         39880005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'P' OR                         39890005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'Q' OR                         39900005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'R' OR                         39910005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'S' OR                         39920005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'T' OR                         39930005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'U' OR                         39940005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'V' OR                         39950005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'W' OR                         39960005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'X' OR                         39970005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = 'Z' OR                         39980005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = '%' OR                         39990005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = '#' OR                         40000005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = '+' OR                         40010005
FDBARB        AR69HD-PH-1-12(PV-SUB-1) = '-'                            40020005
FDBARB         MOVE AR69HD-PH-1-12(PV-SUB-1) TO AR97-PH-1-12(PV-SUB-1)  40030005
FDBARB       ELSE                                                       40040005
FDBARB         MOVE SPACE TO AR97-PH-1-12(PV-SUB-1)                     40050005
FDBARB       END-IF                                                     40060005
FDBARB     END-IF.                                                      40070005
FDBARB                                                                  40080005
FDBARB*-------------------------------*                                 40090005
FDBARB 3600-VALIDATE-HISTORY-FIELDS.                                    40100005
FDBARB*-------------------------------*                                 40110005
FDBARB                                                                  40120005
FDBARB     IF AR69HD-PH-13-24(PV-SUB-1) = SPACES OR                     40130005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = LOW-VALUES OR                 40140005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = '*'                           40150005
FDBARB         MOVE SPACE TO AR97-PH-13-24(PV-SUB-1)                    40160005
FDBARB     ELSE                                                         40170005
FDBARB       IF AR69HD-PH-13-24(PV-SUB-1) = '0' OR                      40180005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = '1' OR                        40190005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = '2' OR                        40200005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = '3' OR                        40210005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = '4' OR                        40220005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = '5' OR                        40230005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = '6' OR                        40240005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = '7' OR                        40250005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'A' OR                        40260005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'B' OR                        40270005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'C' OR                        40280005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'D' OR                        40290005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'E' OR                        40300005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'F' OR                        40310005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'G' OR                        40320005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'H' OR                        40330005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'I' OR                        40340005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'J' OR                        40350005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'K' OR                        40360005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'L' OR                        40370005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'M' OR                        40380005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'N' OR                        40390005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'O' OR                        40400005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'P' OR                        40410005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'Q' OR                        40420005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'R' OR                        40430005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'S' OR                        40440005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'T' OR                        40450005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'U' OR                        40460005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'V' OR                        40470005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'W' OR                        40480005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'X' OR                        40490005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = 'Z' OR                        40500005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = '%' OR                        40510005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = '#' OR                        40520005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = '+' OR                        40530005
FDBARB        AR69HD-PH-13-24(PV-SUB-1) = '-'                           40540005
FDBARB         MOVE AR69HD-PH-13-24(PV-SUB-1) TO AR97-PH-13-24(PV-SUB-1)40550005
FDBARB       ELSE                                                       40560005
FDBARB         MOVE SPACE TO AR97-PH-13-24(PV-SUB-1)                    40570005
FDBARB       END-IF                                                     40580005
FDBARB     END-IF.                                                      40590005
FDBARB                                                                  40600005
834300                                                                  40610005
871705*-------------------------------*                                 40620005
871706 4000-READ-CARD-MASTER.                                           40630005
871707*-------------------------------*                                 40640005
871708                                                                  40650005
871709     READ CARD-MASTER-IN-FILE                                     40660005
871710        AT END                                                    40670005
871711           SET PS-STOP-PROCESSING TO TRUE                         40680005
871712     END-READ.                                                    40690005
871713                                                                  40700005
871714     IF NOT PS-STOP-PROCESSING                                    40710005
871715        ADD 1 TO PV-READ-COUNT                                    40720005
871716     END-IF.                                                      40730005
871717                                                                  40740005
871718*-------------------------------*                                 40750005
871719*8000-JUNK-VALUE-CHK-PARA.                                        40760005
871720*-------------------------------*                                 40770005
871721*    INSPECT AR94-RECORD                                          40780005
871722*           REPLACING ALL X'09' BY ' '.                           40790005
871723*    INSPECT AR94-RECORD                                          40800005
871724*           REPLACING ALL X'CF' BY ' '.                           40810005
871725*    INSPECT AR94-RECORD                                          40820005
871726*           REPLACING ALL X'00' BY ' '.                           40830005
871727*    INSPECT AR94-RECORD                                          40840005
871728*           REPLACING ALL X'0C' BY ' '.                           40850005
871729*    INSPECT AR94-RECORD                                          40860005
871730*           REPLACING ALL X'6E' BY ' '.                           40870005
871731*    INSPECT AR94-RECORD                                          40880005
871732*           REPLACING ALL X'07' BY ' '.                           40890005
871733*    INSPECT AR94-RECORD                                          40900005
871734*           REPLACING ALL X'40' BY ' '.                           40910005
871735*    INSPECT AR94-RECORD                                          40920005
871736*           REPLACING ALL X'8C' BY ' '.                           40930005
871737*    INSPECT AR94-RECORD                                          40940005
871738*           REPLACING ALL X'43' BY ' '.                           40950005
871739*    INSPECT AR94-RECORD                                          40960005
871740*           REPLACING ALL X'99' BY ' '.                           40970005
871741*    INSPECT AR94-RECORD                                          40980005
871742*           REPLACING ALL X'9C' BY ' '.                           40990005
871743*    INSPECT AR94-RECORD                                          41000005
871744*           REPLACING ALL X'5C' BY ' '.                           41010005
871745*    INSPECT AR94-RECORD                                          41020005
871746*           REPLACING ALL X'7C' BY ' '.                           41030005
871747*    INSPECT AR94-RECORD                                          41040005
871748*           REPLACING ALL X'80' BY ' '.                           41050005
871749*    INSPECT AR94-RECORD                                          41060005
871750*           REPLACING ALL X'50' BY ' '.                           41070005
871751*    INSPECT AR94-RECORD                                          41080005
871752*           REPLACING ALL X'55' BY ' '.                           41090005
871753*    INSPECT AR94-RECORD                                          41100005
871754*           REPLACING ALL X'92' BY ' '.                           41110005
871755*    INSPECT AR94-RECORD                                          41120005
871756*           REPLACING ALL X'01' BY ' '.                           41130005
871757*    INSPECT AR94-RECORD                                          41140005
871758*           REPLACING ALL X'97' BY ' '.                           41150005
871759*    INSPECT AR94-RECORD                                          41160005
871760*           REPLACING ALL X'70' BY ' '.                           41170005
871761*    INSPECT AR94-RECORD                                          41180005
871762*           REPLACING ALL X'97' BY ' '.                           41190005
871763*    INSPECT AR94-RECORD                                          41200005
871764*           REPLACING ALL X'95' BY ' '.                           41210005
871765*    INSPECT AR94-RECORD                                          41220005
871766*           REPLACING ALL X'DA' BY ' '.                           41230005
871767*    INSPECT AR94-RECORD                                          41240005
871768*           REPLACING ALL X'CA' BY ' '.                           41250005
871769*    INSPECT AR94-RECORD                                          41260005
871770*           REPLACING ALL X'51' BY ' '.                           41270005
871771*    INSPECT AR94-RECORD                                          41280005
871772*           REPLACING ALL X'30' BY ' '.                           41290005
871773*    INSPECT AR94-RECORD                                          41300005
871774*           REPLACING ALL X'C0' BY ' '.                           41310005
871775*    INSPECT AR94-RECORD                                          41320005
871776*           REPLACING ALL X'42' BY ' '.                           41330005
871777*    INSPECT AR94-RECORD                                          41340005
871778*           REPLACING ALL X'43' BY ' '.                           41350005
871779*    INSPECT AR94-RECORD                                          41360005
871780*           REPLACING ALL X'94' BY ' '.                           41370005
871781*    INSPECT AR94-RECORD                                          41380005
871782*           REPLACING ALL X'66' BY ' '.                           41390005
871783*    INSPECT AR94-RECORD                                          41400005
871784*           REPLACING ALL X'98' BY ' '.                           41410005
871785*    INSPECT AR94-RECORD                                          41420005
871786*           REPLACING ALL X'61' BY ' '.                           41430005
871787*    INSPECT AR94-RECORD                                          41440005
871788*           REPLACING ALL X'56' BY ' '.                           41450005
871789*    INSPECT AR94-RECORD                                          41460005
871790*           REPLACING ALL X'88' BY ' '.                           41470005
871791*    INSPECT AR94-RECORD                                          41480005
871792*           REPLACING ALL X'2C' BY ' '.                           41490005
871793*    INSPECT AR94-RECORD                                          41500005
871794*           REPLACING ALL X'4C' BY ' '.                           41510005
871795*    INSPECT AR94-RECORD                                          41520005
871796*           REPLACING ALL X'14' BY ' '.                           41530005
871797*    INSPECT AR94-RECORD                                          41540005
871798*           REPLACING ALL X'13' BY ' '.                           41550005
871799*    INSPECT AR94-RECORD                                          41560005
871800*           REPLACING ALL X'04' BY ' '.                           41570005
871801*    INSPECT AR94-RECORD                                          41580005
871802*           REPLACING ALL X'90' BY ' '.                           41590005
871803*    INSPECT AR94-RECORD                                          41600005
871804*           REPLACING ALL X'05' BY ' '.                           41610005
871805*    INSPECT AR94-RECORD                                          41620005
871806*           REPLACING ALL X'21' BY ' '.                           41630005
871807*    INSPECT AR94-RECORD                                          41640005
871808*           REPLACING ALL X'BA' BY ' '.                           41650005
871809*    INSPECT AR94-RECORD                                          41660005
871810*           REPLACING ALL X'BB' BY ' '.                           41670005
871811*    INSPECT AR94-RECORD                                          41680005
871812*           REPLACING ALL X'CC' BY ' '.                           41690005
871813*    INSPECT AR94-RECORD                                          41700005
871814*           REPLACING ALL X'CD' BY ' '.                           41710005
871815*    INSPECT AR94-RECORD                                          41720005
871816*           REPLACING ALL X'9A' BY ' '.                           41730005
871817*    INSPECT AR94-RECORD                                          41740005
871818*           REPLACING ALL X'AF' BY ' '.                           41750005
871819*    INSPECT AR94-RECORD                                          41760005
871820*           REPLACING ALL X'0D' BY ' '.                           41770005
871821*    INSPECT AR94-RECORD                                          41780005
871822*           REPLACING ALL X'25' BY ' '.                           41790005
871823*    INSPECT AR94-RECORD                                          41800005
871824*           REPLACING ALL X'B8' BY ' '.                           41810005
871825*    INSPECT AR94-RECORD                                          41820005
871826*           REPLACING ALL X'B2' BY ' '.                           41830005
871827*    INSPECT AR94-RECORD                                          41840005
871828*           REPLACING ALL X'90' BY ' '.                           41850005
871829*    INSPECT AR94-RECORD                                          41860005
871830*           REPLACING ALL X'51' BY ' '.                           41870005
871831*    INSPECT AR94-RECORD                                          41880005
871832*           REPLACING ALL X'54' BY ' '.                           41890005
871833*    INSPECT AR94-RECORD                                          41900005
871834*           REPLACING ALL X'9E' BY ' '.                           41910005
871835*    INSPECT AR94-RECORD                                          41920005
871836*           REPLACING ALL X'DF' BY ' '.                           41930005
871837*    INSPECT AR94-RECORD                                          41940005
871838*           REPLACING ALL X'50' BY ' '.                           41950005
871839*    INSPECT AR94-RECORD                                          41960005
871840*           REPLACING ALL X'3C' BY ' '.                           41970005
871841*    INSPECT AR94-RECORD                                          41980005
871842*           REPLACING ALL X'02' BY ' '.                           41990005
871843*    INSPECT AR94-RECORD                                          42000005
871844*           REPLACING ALL X'1C' BY ' '.                           42010005
871845*    INSPECT AR94-RECORD                                          42020005
871846*           REPLACING ALL X'58' BY ' '.                           42030005
871847*    INSPECT AR94-RECORD                                          42040005
871848*           REPLACING ALL X'52' BY ' '.                           42050005
871849*    INSPECT AR94-RECORD                                          42060005
871850*           REPLACING ALL X'53' BY ' '.                           42070005
871851*    INSPECT AR94-RECORD                                          42080005
871852*           REPLACING ALL X'63' BY ' '.                           42090005
871853*    INSPECT AR94-RECORD                                          42100005
871854*           REPLACING ALL X'46' BY ' '.                           42110005
871855*    INSPECT AR94-RECORD                                          42120005
871856*           REPLACING ALL X'57' BY ' '.                           42130005
871857*    INSPECT AR94-RECORD                                          42140005
871858*           REPLACING ALL X'67' BY ' '.                           42150005
871859*    INSPECT AR94-RECORD                                          42160005
871860*           REPLACING ALL X'75' BY ' '.                           42170005
871861*    INSPECT AR94-RECORD                                          42180005
871862*           REPLACING ALL X'71' BY ' '.                           42190005
871863*    INSPECT AR94-RECORD                                          42200005
871864*           REPLACING ALL X'21' BY ' '.                           42210005
871865*    INSPECT AR94-RECORD                                          42220005
871866*           REPLACING ALL X'32' BY ' '.                           42230005
871867*    INSPECT AR94-RECORD                                          42240005
871868*           REPLACING ALL X'31' BY ' '.                           42250005
871869*    INSPECT AR94-RECORD                                          42260005
871870*           REPLACING ALL X'03' BY ' '.                           42270005
871871*    INSPECT AR94-RECORD                                          42280005
871872*           REPLACING ALL X'1A' BY ' '.                           42290005
871873*    INSPECT AR94-RECORD                                          42300005
871874*           REPLACING ALL X'11' BY ' '.                           42310005
871875*    INSPECT AR94-RECORD                                          42320005
871876*           REPLACING ALL X'38' BY ' '.                           42330005
871877*    INSPECT AR94-RECORD                                          42340005
871878*           REPLACING ALL X'20' BY ' '.                           42350005
871879*    INSPECT AR94-RECORD                                          42360005
871880*           REPLACING ALL X'27' BY ' '.                           42370005
871881*    INSPECT AR94-RECORD                                          42380005
871882*           REPLACING ALL X'79' BY ' '.                           42390005
871883*    INSPECT AR94-RECORD                                          42400005
871884*           REPLACING ALL X'22' BY ' '.                           42410005
871885*    INSPECT AR94-RECORD                                          42420005
871886*           REPLACING ALL X'26' BY ' '.                           42430005
871887*    INSPECT AR94-RECORD                                          42440005
871888*           REPLACING ALL X'19' BY ' '.                           42450005
871889*    INSPECT AR94-RECORD                                          42460005
871890*           REPLACING ALL X'10' BY ' '.                           42470005
871891*    INSPECT AR94-RECORD                                          42480005
871892*           REPLACING ALL X'0F' BY ' '.                           42490005
871893*    INSPECT AR94-RECORD                                          42500005
871894*           REPLACING ALL X'69' BY ' '.                           42510005
871895*    INSPECT AR94-RECORD                                          42520005
871896*           REPLACING ALL X'39' BY ' '.                           42530005
871897*    INSPECT AR94-RECORD                                          42540005
871898*           REPLACING ALL X'16' BY ' '.                           42550005
871899*    INSPECT AR94-RECORD                                          42560005
871900*           REPLACING ALL X'65' BY ' '.                           42570005
871901*    INSPECT AR94-RECORD                                          42580005
871902*           REPLACING ALL X'0A' BY ' '.                           42590005
871903*    INSPECT AR94-RECORD                                          42600005
871904*           REPLACING ALL X'33' BY ' '.                           42610005
871905*    INSPECT AR94-RECORD                                          42620005
871906*           REPLACING ALL X'08' BY ' '.                           42630005
871907*    INSPECT AR94-RECORD                                          42640005
871908*           REPLACING ALL X'73' BY ' '.                           42650005
871909*    INSPECT AR94-RECORD                                          42660005
871910*           REPLACING ALL X'41' BY ' '.                           42670005
871911*    INSPECT AR94-RECORD                                          42680005
871912*           REPLACING ALL X'72' BY ' '.                           42690005
871913*    INSPECT AR94-RECORD                                          42700005
871914*           REPLACING ALL X'34' BY ' '.                           42710005
871915*    INSPECT AR94-RECORD                                          42720005
871916*           REPLACING ALL X'77' BY ' '.                           42730005
871917*    INSPECT AR94-RECORD                                          42740005
871918*           REPLACING ALL X'12' BY ' '.                           42750005
871919*    INSPECT AR94-RECORD                                          42760005
871920*           REPLACING ALL X'68' BY ' '.                           42770005
871921*    INSPECT AR94-RECORD                                          42780005
871922*           REPLACING ALL X'48' BY ' '.                           42790005
871923*    INSPECT AR94-RECORD                                          42800005
871924*           REPLACING ALL X'64' BY ' '.                           42810005
871925*    INSPECT AR94-RECORD                                          42820005
871926*           REPLACING ALL X'62' BY ' '.                           42830005
871927*    INSPECT AR94-RECORD                                          42840005
871928*           REPLACING ALL X'44' BY ' '.                           42850005
871929*    INSPECT AR94-RECORD                                          42860005
871930*           REPLACING ALL X'59' BY ' '.                           42870005
871931*    INSPECT AR94-RECORD                                          42880005
871932*           REPLACING ALL X'78' BY ' '.                           42890005
871933*    INSPECT AR94-RECORD                                          42900005
871934*           REPLACING ALL X'74' BY ' '.                           42910005
871935*    INSPECT AR94-RECORD                                          42920005
871936*           REPLACING ALL X'34' BY ' '.                           42930005
871937*    INSPECT AR94-RECORD                                          42940005
871938*           REPLACING ALL X'15' BY ' '.                           42950005
871939*    INSPECT AR94-RECORD                                          42960005
871940*           REPLACING ALL X'23' BY ' '.                           42970005
872161*-------------------------------*                                 42980005
872162 9000-JUNK-VALUE-CHK-PARA.                                        42990005
872163*-------------------------------*                                 43000005
872198     INSPECT AR97-MASTER-DATA(62:2)                               43010005
872199            REPLACING ALL X'0F00' BY X'4040'.                     43020005
872200     INSPECT AR97-MASTER-DATA(1255:12)                            43030005
872201            REPLACING ALL X'00' BY X'40'.                         43040005
872202     INSPECT AR97-MASTER-DATA(1255:12)                            43050005
872203            REPLACING ALL X'0C' BY X'40'.                         43060005
872204     INSPECT AR97-MASTER-DATA(1692:18)                            43070005
872205            REPLACING ALL X'00' BY X'40'.                         43080005
872206     INSPECT AR97-MASTER-DATA(1692:18)                            43090005
872207            REPLACING ALL X'0C' BY X'40'.                         43100005
872208     INSPECT AR97-MASTER-DATA(6006:41)                            43110005
872209            REPLACING ALL X'00' BY X'40'.                         43120005
872210*    INSPECT AR97-MASTER-DATA(6299:62)                            43130005
872211*           REPLACING ALL X'00' BY X'40'.                         43140005
872212*    INSPECT AR97-MASTER-DATA(7040:28)                            43150005
872213*           REPLACING ALL X'00' BY X'40'.                         43160005
872214*    INSPECT AR97-MASTER-DATA(7072:26)                            43170005
872215*           REPLACING ALL X'00' BY X'40'.                         43180005
872216*    INSPECT AR97-MASTER-DATA(7594:217)                           43190005
872217*           REPLACING ALL X'00' BY X'40'.                         43200005
872218*    INSPECT AR97-MASTER-DATA                                     43210005
872219*           REPLACING ALL X'51' BY ' '.                           43220005
872220*    INSPECT AR97-MASTER-DATA                                     43230005
872221*           REPLACING ALL X'52' BY ' '.                           43240005
872222*    INSPECT AR97-MASTER-DATA                                     43250005
872223*           REPLACING ALL X'09' BY ' '.                           43260005
872224*    INSPECT AR97-MASTER-DATA                                     43270005
872225*           REPLACING ALL X'CF' BY ' '.                           43280005
872226*    INSPECT AR97-MASTER-DATA                                     43290005
872227*           REPLACING ALL X'00' BY ' '.                           43300005
872228*    INSPECT AR97-MASTER-DATA                                     43310005
872229*           REPLACING ALL X'0C' BY ' '.                           43320005
872230*    INSPECT AR97-MASTER-DATA                                     43330005
872231*           REPLACING ALL X'6E' BY ' '.                           43340005
872232*    INSPECT AR97-MASTER-DATA                                     43350005
872233*           REPLACING ALL X'07' BY ' '.                           43360005
872234*    INSPECT AR97-MASTER-DATA                                     43370005
872235*           REPLACING ALL X'40' BY ' '.                           43380005
872236*    INSPECT AR97-MASTER-DATA                                     43390005
872237*           REPLACING ALL X'8C' BY ' '.                           43400005
872238*    INSPECT AR97-MASTER-DATA                                     43410005
872239*           REPLACING ALL X'43' BY ' '.                           43420005
872240*    INSPECT AR97-MASTER-DATA                                     43430005
872241*           REPLACING ALL X'99' BY ' '.                           43440005
872242*    INSPECT AR97-MASTER-DATA                                     43450005
872243*           REPLACING ALL X'9C' BY ' '.                           43460005
872244*    INSPECT AR97-MASTER-DATA                                     43470005
872245*           REPLACING ALL X'5C' BY ' '.                           43480005
872246*    INSPECT AR97-MASTER-DATA                                     43490005
872247*           REPLACING ALL X'7C' BY ' '.                           43500005
872248*    INSPECT AR97-MASTER-DATA                                     43510005
872249*           REPLACING ALL X'80' BY ' '.                           43520005
872250*    INSPECT AR97-MASTER-DATA                                     43530005
872251*           REPLACING ALL X'50' BY ' '.                           43540005
872252*    INSPECT AR97-MASTER-DATA                                     43550005
872253*           REPLACING ALL X'55' BY ' '.                           43560005
872254*    INSPECT AR97-MASTER-DATA                                     43570005
872255*           REPLACING ALL X'92' BY ' '.                           43580005
872256*    INSPECT AR97-MASTER-DATA                                     43590005
872257*           REPLACING ALL X'01' BY ' '.                           43600005
872258*    INSPECT AR97-MASTER-DATA                                     43610005
872259*           REPLACING ALL X'97' BY ' '.                           43620005
872260*    INSPECT AR97-MASTER-DATA                                     43630005
872261*           REPLACING ALL X'70' BY ' '.                           43640005
872262*    INSPECT AR97-MASTER-DATA                                     43650005
872263*           REPLACING ALL X'97' BY ' '.                           43660005
872264*    INSPECT AR97-MASTER-DATA                                     43670005
872265*           REPLACING ALL X'95' BY ' '.                           43680005
872266*    INSPECT AR97-MASTER-DATA                                     43690005
872267*           REPLACING ALL X'DA' BY ' '.                           43700005
872268*    INSPECT AR97-MASTER-DATA                                     43710005
872269*           REPLACING ALL X'CA' BY ' '.                           43720005
872270*    INSPECT AR97-MASTER-DATA                                     43730005
872271*           REPLACING ALL X'51' BY ' '.                           43740005
872272*    INSPECT AR97-MASTER-DATA                                     43750005
872273*           REPLACING ALL X'30' BY ' '.                           43760005
872274*    INSPECT AR97-MASTER-DATA                                     43770005
872275*           REPLACING ALL X'C0' BY ' '.                           43780005
872276*    INSPECT AR97-MASTER-DATA                                     43790005
872277*           REPLACING ALL X'42' BY ' '.                           43800005
872278*    INSPECT AR97-MASTER-DATA                                     43810005
872279*           REPLACING ALL X'43' BY ' '.                           43820005
872280*    INSPECT AR97-MASTER-DATA                                     43830005
872281*           REPLACING ALL X'94' BY ' '.                           43840005
872282*    INSPECT AR97-MASTER-DATA                                     43850005
872283*           REPLACING ALL X'66' BY ' '.                           43860005
872284*    INSPECT AR97-MASTER-DATA                                     43870005
872285*           REPLACING ALL X'98' BY ' '.                           43880005
872286*    INSPECT AR97-MASTER-DATA                                     43890005
872287*           REPLACING ALL X'61' BY ' '.                           43900005
872288*    INSPECT AR97-MASTER-DATA                                     43910005
872289*           REPLACING ALL X'56' BY ' '.                           43920005
872290*    INSPECT AR97-MASTER-DATA                                     43930005
872291*           REPLACING ALL X'88' BY ' '.                           43940005
872292*    INSPECT AR97-MASTER-DATA                                     43950005
872293*           REPLACING ALL X'2C' BY ' '.                           43960005
872294*    INSPECT AR97-MASTER-DATA                                     43970005
872295*           REPLACING ALL X'4C' BY ' '.                           43980005
872296*    INSPECT AR97-MASTER-DATA                                     43990005
872297*           REPLACING ALL X'14' BY ' '.                           44000005
872298*    INSPECT AR97-MASTER-DATA                                     44010005
872299*           REPLACING ALL X'13' BY ' '.                           44020005
872300*    INSPECT AR97-MASTER-DATA                                     44030005
872301*           REPLACING ALL X'04' BY ' '.                           44040005
872302*    INSPECT AR97-MASTER-DATA                                     44050005
872303*           REPLACING ALL X'90' BY ' '.                           44060005
872304*    INSPECT AR97-MASTER-DATA                                     44070005
872305*           REPLACING ALL X'05' BY ' '.                           44080005
872306*    INSPECT AR97-MASTER-DATA                                     44090005
872307*           REPLACING ALL X'21' BY ' '.                           44100005
872308*    INSPECT AR97-MASTER-DATA                                     44110005
872309*           REPLACING ALL X'BA' BY ' '.                           44120005
872310*    INSPECT AR97-MASTER-DATA                                     44130005
872311*           REPLACING ALL X'BB' BY ' '.                           44140005
872312*    INSPECT AR97-MASTER-DATA                                     44150005
872313*           REPLACING ALL X'CC' BY ' '.                           44160005
872314*    INSPECT AR97-MASTER-DATA                                     44170005
872315*           REPLACING ALL X'CD' BY ' '.                           44180005
872316*    INSPECT AR97-MASTER-DATA                                     44190005
872317*           REPLACING ALL X'9A' BY ' '.                           44200005
872318*    INSPECT AR97-MASTER-DATA                                     44210005
872319*           REPLACING ALL X'AF' BY ' '.                           44220005
872320*    INSPECT AR97-MASTER-DATA                                     44230005
872321*           REPLACING ALL X'0D' BY ' '.                           44240005
872322*    INSPECT AR97-MASTER-DATA                                     44250005
872323*           REPLACING ALL X'25' BY ' '.                           44260005
872324*    INSPECT AR97-MASTER-DATA                                     44270005
872325*           REPLACING ALL X'B8' BY ' '.                           44280005
872326*    INSPECT AR97-MASTER-DATA                                     44290005
872327*           REPLACING ALL X'B2' BY ' '.                           44300005
872328*    INSPECT AR97-MASTER-DATA                                     44310005
872329*           REPLACING ALL X'90' BY ' '.                           44320005
872330*    INSPECT AR97-MASTER-DATA                                     44330005
872331*           REPLACING ALL X'51' BY ' '.                           44340005
872332*    INSPECT AR97-MASTER-DATA                                     44350005
872333*           REPLACING ALL X'54' BY ' '.                           44360005
872334*    INSPECT AR97-MASTER-DATA                                     44370005
872335*           REPLACING ALL X'9E' BY ' '.                           44380005
872336*    INSPECT AR97-MASTER-DATA                                     44390005
872337*           REPLACING ALL X'DF' BY ' '.                           44400005
872338*    INSPECT AR97-MASTER-DATA                                     44410005
872339*           REPLACING ALL X'50' BY ' '.                           44420005
872340*    INSPECT AR97-MASTER-DATA                                     44430005
872341*           REPLACING ALL X'3C' BY ' '.                           44440005
872342*    INSPECT AR97-MASTER-DATA                                     44450005
872343*           REPLACING ALL X'02' BY ' '.                           44460005
872344*    INSPECT AR97-MASTER-DATA                                     44470005
872345*           REPLACING ALL X'1C' BY ' '.                           44480005
872346*    INSPECT AR97-MASTER-DATA                                     44490005
872347*           REPLACING ALL X'58' BY ' '.                           44500005
872348*    INSPECT AR97-MASTER-DATA                                     44510005
872349*           REPLACING ALL X'52' BY ' '.                           44520005
872350*    INSPECT AR97-MASTER-DATA                                     44530005
872351*           REPLACING ALL X'53' BY ' '.                           44540005
872352*    INSPECT AR97-MASTER-DATA                                     44550005
872353*           REPLACING ALL X'63' BY ' '.                           44560005
872354*    INSPECT AR97-MASTER-DATA                                     44570005
872355*           REPLACING ALL X'46' BY ' '.                           44580005
872356*    INSPECT AR97-MASTER-DATA                                     44590005
872357*           REPLACING ALL X'57' BY ' '.                           44600005
872358*    INSPECT AR97-MASTER-DATA                                     44610005
872359*           REPLACING ALL X'67' BY ' '.                           44620005
872360*    INSPECT AR97-MASTER-DATA                                     44630005
872361*           REPLACING ALL X'75' BY ' '.                           44640005
872362*    INSPECT AR97-MASTER-DATA                                     44650005
872363*           REPLACING ALL X'71' BY ' '.                           44660005
872364*    INSPECT AR97-MASTER-DATA                                     44670005
872365*           REPLACING ALL X'21' BY ' '.                           44680005
872366*    INSPECT AR97-MASTER-DATA                                     44690005
872367*           REPLACING ALL X'32' BY ' '.                           44700005
872368*    INSPECT AR97-MASTER-DATA                                     44710005
872369*           REPLACING ALL X'31' BY ' '.                           44720005
872370*    INSPECT AR97-MASTER-DATA                                     44730005
872371*           REPLACING ALL X'03' BY ' '.                           44740005
872372*    INSPECT AR97-MASTER-DATA                                     44750005
872373*           REPLACING ALL X'1A' BY ' '.                           44760005
872374*    INSPECT AR97-MASTER-DATA                                     44770005
872375*           REPLACING ALL X'11' BY ' '.                           44780005
872376*    INSPECT AR97-MASTER-DATA                                     44790005
872377*           REPLACING ALL X'38' BY ' '.                           44800005
872378*    INSPECT AR97-MASTER-DATA                                     44810005
872379*           REPLACING ALL X'20' BY ' '.                           44820005
872380*    INSPECT AR97-MASTER-DATA                                     44830005
872381*           REPLACING ALL X'27' BY ' '.                           44840005
872382*    INSPECT AR97-MASTER-DATA                                     44850005
872383*           REPLACING ALL X'79' BY ' '.                           44860005
872384*    INSPECT AR97-MASTER-DATA                                     44870005
872385*           REPLACING ALL X'22' BY ' '.                           44880005
872386*    INSPECT AR97-MASTER-DATA                                     44890005
872387*           REPLACING ALL X'26' BY ' '.                           44900005
872388*    INSPECT AR97-MASTER-DATA                                     44910005
872389*           REPLACING ALL X'19' BY ' '.                           44920005
872390*    INSPECT AR97-MASTER-DATA                                     44930005
872391*           REPLACING ALL X'10' BY ' '.                           44940005
872392*    INSPECT AR97-MASTER-DATA                                     44950005
872393*           REPLACING ALL X'0F' BY ' '.                           44960005
872394*    INSPECT AR97-MASTER-DATA                                     44970005
872395*           REPLACING ALL X'69' BY ' '.                           44980005
872396*    INSPECT AR97-MASTER-DATA                                     44990005
872397*           REPLACING ALL X'39' BY ' '.                           45000005
872398*    INSPECT AR97-MASTER-DATA                                     45010005
872399*           REPLACING ALL X'16' BY ' '.                           45020005
872400*    INSPECT AR97-MASTER-DATA                                     45030005
872401*           REPLACING ALL X'65' BY ' '.                           45040005
872402*    INSPECT AR97-MASTER-DATA                                     45050005
872403*           REPLACING ALL X'0A' BY ' '.                           45060005
872404*    INSPECT AR97-MASTER-DATA                                     45070005
872405*           REPLACING ALL X'33' BY ' '.                           45080005
872406*    INSPECT AR97-MASTER-DATA                                     45090005
872407*           REPLACING ALL X'08' BY ' '.                           45100005
872408*    INSPECT AR97-MASTER-DATA                                     45110005
872409*           REPLACING ALL X'73' BY ' '.                           45120005
872410*    INSPECT AR97-MASTER-DATA                                     45130005
872411*           REPLACING ALL X'41' BY ' '.                           45140005
872412*    INSPECT AR97-MASTER-DATA                                     45150005
872413*           REPLACING ALL X'72' BY ' '.                           45160005
872414*    INSPECT AR97-MASTER-DATA                                     45170005
872415*           REPLACING ALL X'34' BY ' '.                           45180005
872416*    INSPECT AR97-MASTER-DATA                                     45190005
872417*           REPLACING ALL X'77' BY ' '.                           45200005
872418*    INSPECT AR97-MASTER-DATA                                     45210005
872419*           REPLACING ALL X'12' BY ' '.                           45220005
872420*    INSPECT AR97-MASTER-DATA                                     45230005
872421*           REPLACING ALL X'68' BY ' '.                           45240005
872422*    INSPECT AR97-MASTER-DATA                                     45250005
872423*           REPLACING ALL X'48' BY ' '.                           45260005
872424*    INSPECT AR97-MASTER-DATA                                     45270005
872425*           REPLACING ALL X'64' BY ' '.                           45280005
872426*    INSPECT AR97-MASTER-DATA                                     45290005
872427*           REPLACING ALL X'62' BY ' '.                           45300005
872428*    INSPECT AR97-MASTER-DATA                                     45310005
872429*           REPLACING ALL X'44' BY ' '.                           45320005
872430*    INSPECT AR97-MASTER-DATA                                     45330005
872431*           REPLACING ALL X'59' BY ' '.                           45340005
872432*    INSPECT AR97-MASTER-DATA                                     45350005
872433*           REPLACING ALL X'78' BY ' '.                           45360005
872434*    INSPECT AR97-MASTER-DATA                                     45370005
872435*           REPLACING ALL X'74' BY ' '.                           45380005
872436*    INSPECT AR97-MASTER-DATA                                     45390005
872437*           REPLACING ALL X'34' BY ' '.                           45400005
872438*    INSPECT AR97-MASTER-DATA                                     45410005
872439*           REPLACING ALL X'15' BY ' '.                           45420005
872440*    INSPECT AR97-MASTER-DATA                                     45430005
872441*           REPLACING ALL X'23' BY ' '.                           45440005
872442*-------------------------------*                                 45450005
872443*3300-PROCESS-MTHO-REC.                                           45460005
872444*-------------------------------*                                 45470005
872445*    MOVE SPACES             TO AR72-OVRR-RECORD.                 45480005
872446*    INITIALIZE                 AR72-OVRR-RECORD.                 45490005
872447*                                                                 45500005
872448*    MOVE AR71-SYS-ID        TO AR72-SYS-ID                       45510005
872449*    IF AR71-SYS-CNT    IS NUMERIC                                45520005
872450*       MOVE AR71-SYS-CNT    TO WS-EDIT-S7                        45530005
872451*       MOVE WS-EDIT-S7      TO AR72-SYS-CNT                      45540005
872452*    ELSE                                                         45550005
872453*       MOVE ZEROES          TO AR72-SYS-CNT                      45560005
872454*    END-IF                                                       45570005
872455*    MOVE AR71-PRIN-ID       TO AR72-PRIN-ID                      45580005
872456*    MOVE AR71-AGNT-ID       TO AR72-AGNT-ID                      45590005
872457*    MOVE AR71-ACCT-ID       TO AR72-ACCT-ID                      45600005
872458*    MOVE AR71-OVERRIDES-CT  TO AR72-OVERRIDES-CT                 45610005
872459*    MOVE AR71-LAST-DFFR-CT  TO AR72-LAST-DFFR-CT                 45620005
872460*                                                                 45630005
872461*    PERFORM VARYING WS-I FROM 1 BY 1                             45640005
872462*            UNTIL WS-I > 48                                      45650005
872463*       MOVE SPACES  TO AR72-METHOD-OVRR-DATA    (WS-I)           45660005
872464*                       AR72-LAST-DFFR-OVRR-DATA (WS-I)           45670005
872465*    END-PERFORM                                                  45680005
872466*                                                                 45690005
872467*    PERFORM VARYING WS-I FROM 1 BY 1                             45700005
872468*        UNTIL  WS-I > AR71-OVERRIDES-CT                          45710005
872469*         MOVE  AR71-CRRN-OVRR-TYPE-ID  (WS-I)                    45720005
872470*           TO  AR72-CRRN-OVRR-TYPE-ID  (WS-I)                    45730005
872471*         MOVE  AR71-CRRN-OVRR-ID       (WS-I)                    45740005
872472*           TO  AR72-CRRN-OVRR-ID       (WS-I)                    45750005
872473*         IF AR71-CRRN-OVRR-DT (WS-I) IS NUMERIC                  45760005
872474*            MOVE  AR71-CRRN-OVRR-DT       (WS-I) TO WS-EDIT-S9   45770005
872475*            MOVE  WS-EDIT-S9     TO AR72-CRRN-OVRR-DT    (WS-I)  45780005
872476*         ELSE                                                    45790005
872477*            MOVE  SPACES         TO AR72-CRRN-OVRR-DT    (WS-I)  45800005
872478*         END-IF                                                  45810005
872479*         MOVE  AR71-CRRN-OVRR-WHOC-ID  (WS-I)                    45820005
872480*           TO  AR72-CRRN-OVRR-WHOC-ID  (WS-I)                    45830005
872481*         MOVE  AR71-CRRN-OVRR-WHYC-ID  (WS-I)                    45840005
872482*           TO  AR72-CRRN-OVRR-WHYC-ID  (WS-I)                    45850005
872483*         MOVE  AR71-CRRN-OVRR-LOCK-CD  (WS-I)                    45860005
872484*           TO  AR72-CRRN-OVRR-LOCK-CD  (WS-I)                    45870005
872485*         IF AR71-CRRN-OVRR-LOCK-DT  (WS-I)  IS NUMERIC           45880005
872486*            MOVE  AR71-CRRN-OVRR-LOCK-DT  (WS-I) TO WS-EDIT-S9   45890005
872487*            MOVE  WS-EDIT-S9     TO AR72-CRRN-OVRR-LOCK-DT (WS-I)45900005
872488*         ELSE                                                    45910005
872489*            MOVE  SPACES         TO AR72-CRRN-OVRR-LOCK-DT (WS-I)45920005
872490*         END-IF                                                  45930005
872491*         IF AR71-CRRN-OVRR-UNLC-DT (WS-I) IS NUMERIC             45940005
872492*            MOVE  AR71-CRRN-OVRR-UNLC-DT  (WS-I) TO WS-EDIT-S9   45950005
872493*            MOVE  WS-EDIT-S9     TO AR72-CRRN-OVRR-UNLC-DT (WS-I)45960005
872494*         ELSE                                                    45970005
872495*            MOVE  SPACES         TO AR72-CRRN-OVRR-UNLC-DT (WS-I)45980005
872496*         END-IF                                                  45990005
872497*         MOVE  AR71-CRRN-OVRR-RLUL-CD    (WS-I)                  46000005
872498*           TO  AR72-CRRN-OVRR-RLUL-CD    (WS-I)                  46010005
872499*         MOVE  AR71-CRRN-OVRR-AQTB-ID    (WS-I)                  46020005
872500*           TO  AR72-CRRN-OVRR-AQTB-ID    (WS-I)                  46030005
872501*         MOVE  AR71-CRRN-OVRR-BA-CD      (WS-I)                  46040005
872502*           TO  AR72-CRRN-OVRR-BA-CD      (WS-I)                  46050005
872503*         MOVE  AR71-CRRN-AQTB-REVW-IN    (WS-I)                  46060005
872504*           TO  AR72-CRRN-AQTB-REVW-IN    (WS-I)                  46070005
872505*         MOVE  AR71-CRRN-OVRR-REVW-IN    (WS-I)                  46080005
872506*           TO  AR72-CRRN-OVRR-REVW-IN    (WS-I)                  46090005
872507*         MOVE  AR71-CYCL-OVRR-ID         (WS-I)                  46100005
872508*           TO  AR72-CYCL-OVRR-ID         (WS-I)                  46110005
872509*         MOVE  AR71-CYCL-OVRR-AQTB-ID    (WS-I)                  46120005
872510*           TO  AR72-CYCL-OVRR-AQTB-ID    (WS-I)                  46130005
872511*         MOVE  AR71-LS-OVRR-ID           (WS-I)                  46140005
872512*           TO  AR72-LS-OVRR-ID           (WS-I)                  46150005
872513*         MOVE  AR71-LS-AQTB-ID           (WS-I)                  46160005
872514*           TO  AR72-LS-AQTB-ID           (WS-I)                  46170005
872515*         MOVE  AR71-LS-BA-CD             (WS-I)                  46180005
872516*           TO  AR72-LS-BA-CD             (WS-I)                  46190005
872517*         MOVE  AR71-NEXT-OVRR-ID         (WS-I)                  46200005
872518*           TO  AR72-NEXT-OVRR-ID         (WS-I)                  46210005
872519*         IF AR71-NEXT-OVRR-DT (WS-I) IS NUMERIC                  46220005
872520*            MOVE  AR71-NEXT-OVRR-DT      (WS-I) TO WS-EDIT-S9    46230005
872521*            MOVE  WS-EDIT-S9     TO AR72-NEXT-OVRR-DT      (WS-I)46240005
872522*         ELSE                                                    46250005
872523*            MOVE  SPACES         TO AR72-NEXT-OVRR-DT      (WS-I)46260005
872524*         END-IF                                                  46270005
872525*         MOVE  AR71-NEXT-OVRR-WHYC-ID (WS-I)                     46280005
872526*           TO  AR72-NEXT-OVRR-WHYC-ID (WS-I)                     46290005
872527*         MOVE  AR71-NEXT-OVRR-BA-CD   (WS-I)                     46300005
872528*           TO  AR72-NEXT-OVRR-BA-CD   (WS-I)                     46310005
872529*         MOVE  AR71-NEXT-OVRR-REVW-IN    (WS-I)                  46320005
872530*           TO  AR72-NEXT-OVRR-REVW-IN    (WS-I)                  46330005
872531*         MOVE  AR71-NEXT-MTHD-HONR-ID    (WS-I)                  46340005
872532*           TO  AR72-NEXT-MTHD-HONR-ID    (WS-I)                  46350005
872533*         MOVE  AR71-NEXT-OVRR-TMNG-CD    (WS-I)                  46360005
872534*           TO  AR72-NEXT-OVRR-TMNG-CD    (WS-I)                  46370005
872535*         MOVE  AR71-NEXT-CIT-MTHD-ID     (WS-I)                  46380005
872536*           TO  AR72-NEXT-CIT-MTHD-ID     (WS-I)                  46390005
872537*         IF AR71-NEXT-EVNT-DT (WS-I)  IS NUMERIC                 46400005
872538*            MOVE  AR71-NEXT-EVNT-DT      (WS-I) TO WS-EDIT-S9    46410005
872539*            MOVE  WS-EDIT-S9     TO AR72-NEXT-EVNT-DT      (WS-I)46420005
872540*         ELSE                                                    46430005
872541*            MOVE  SPACES         TO AR72-NEXT-EVNT-DT      (WS-I)46440005
872542*         END-IF                                                  46450005
872543*                                                                 46460005
872544*         MOVE  AR71-NXT2-OVRR-ID         (WS-I)                  46470005
872545*           TO  AR72-NXT2-OVRR-ID         (WS-I)                  46480005
872546*         IF AR71-NXT2-OVRR-DT (WS-I) IS NUMERIC                  46490005
872547*            MOVE  AR71-NXT2-OVRR-DT      (WS-I) TO WS-EDIT-S9    46500005
872548*            MOVE  WS-EDIT-S9     TO AR72-NXT2-OVRR-DT      (WS-I)46510005
872549*         ELSE                                                    46520005
872550*            MOVE  SPACES         TO AR72-NXT2-OVRR-DT      (WS-I)46530005
872551*         END-IF                                                  46540005
872552*         MOVE  AR71-NXT2-OVRR-WHYC-ID    (WS-I)                  46550005
872553*           TO  AR72-NXT2-OVRR-WHYC-ID    (WS-I)                  46560005
872554*         MOVE  AR71-NXT2-OVRR-BA-CD      (WS-I)                  46570005
872555*           TO  AR72-NXT2-OVRR-BA-CD      (WS-I)                  46580005
872556*         MOVE  AR71-NXT2-OVRR-REVW-IN    (WS-I)                  46590005
872557*           TO  AR72-NXT2-OVRR-REVW-IN    (WS-I)                  46600005
872558*         MOVE  AR71-NXT2-MTHD-HONR-ID    (WS-I)                  46610005
872559*           TO  AR72-NXT2-MTHD-HONR-ID    (WS-I)                  46620005
872560*         MOVE  AR71-NXT2-OVRR-TMNG-CD    (WS-I)                  46630005
872561*           TO  AR72-NXT2-OVRR-TMNG-CD    (WS-I)                  46640005
872562*         MOVE  AR71-NXT2-CIT-MTHD-ID     (WS-I)                  46650005
872563*           TO  AR72-NXT2-CIT-MTHD-ID     (WS-I)                  46660005
872564*         IF AR71-NXT2-EVNT-DT (WS-I)   IS NUMERIC                46670005
872565*            MOVE AR71-NXT2-EVNT-DT       (WS-I) TO WS-EDIT-S9    46680005
872566*            MOVE WS-EDIT-S9     TO AR72-NXT2-EVNT-DT       (WS-I)46690005
872567*         ELSE                                                    46700005
872568*            MOVE  SPACES        TO AR72-NXT2-EVNT-DT       (WS-I)46710005
872569*         END-IF                                                  46720005
872570*         MOVE  AR71-CRRN-OVRR-TMNG-CD    (WS-I)                  46730005
872571*           TO  AR72-CRRN-OVRR-TMNG-CD    (WS-I)                  46740005
872572*         MOVE  AR71-CRRN-CIT-MTHD-ID     (WS-I)                  46750005
872573*           TO  AR72-CRRN-CIT-MTHD-ID     (WS-I)                  46760005
872574*         IF AR71-CRRN-EVNT-DT (WS-I) IS NUMERIC                  46770005
872575*            MOVE AR71-CRRN-EVNT-DT         (WS-I) TO WS-EDIT-S9  46780005
872576*            MOVE WS-EDIT-S9     TO AR72-CRRN-EVNT-DT       (WS-I)46790005
872577*         ELSE                                                    46800005
872578*            MOVE  SPACES        TO AR72-CRRN-EVNT-DT       (WS-I)46810005
872579*         END-IF                                                  46820005
872580*         IF AR71-CRRN-OVRR-ALLC-DT  (WS-I) IS NUMERIC            46830005
872581*            MOVE AR71-CRRN-OVRR-ALLC-DT    (WS-I) TO WS-EDIT-S9  46840005
872582*            MOVE WS-EDIT-S9     TO AR72-CRRN-OVRR-ALLC-DT  (WS-I)46850005
872583*         ELSE                                                    46860005
872584*            MOVE  SPACES        TO AR72-CRRN-OVRR-ALLC-DT  (WS-I)46870005
872585*         END-IF                                                  46880005
872586*         MOVE  AR71-MIDC-OVRR-MTHD-ID    (WS-I)                  46890005
872587*           TO  AR71-MIDC-OVRR-MTHD-ID    (WS-I)                  46900005
872588*         IF AR71-CRRN-MTHD-CYCL-CT (WS-I) IS NUMERIC             46910005
872589*            MOVE AR71-CRRN-MTHD-CYCL-CT    (WS-I) TO WS-EDIT-S3  46920005
872590*            MOVE WS-EDIT-S3     TO AR72-CRRN-MTHD-CYCL-CT  (WS-I)46930005
872591*         ELSE                                                    46940005
872592*            MOVE  SPACES        TO AR72-CRRN-MTHD-CYCL-CT  (WS-I)46950005
872593*         END-IF                                                  46960005
872594*         IF AR71-LS-MTHD-CYCL-CT   (WS-I) IS NUMERIC             46970005
872595*            MOVE AR71-LS-MTHD-CYCL-CT      (WS-I) TO WS-EDIT-S3  46980005
872596*            MOVE WS-EDIT-S3     TO AR72-LS-MTHD-CYCL-CT    (WS-I)46990005
872597*         ELSE                                                    47000005
872598*            MOVE  SPACES        TO AR72-LS-MTHD-CYCL-CT    (WS-I)47010005
872599*         END-IF                                                  47020005
872600*         MOVE  AR71-LS-NEXT-OVRR-ID      (WS-I)                  47030005
872601*           TO  AR72-LS-NEXT-OVRR-ID      (WS-I)                  47040005
872602*         IF AR71-LS-NEXT-OVRR-DT   (WS-I) IS NUMERIC             47050005
872603*            MOVE AR71-LS-NEXT-OVRR-DT      (WS-I) TO WS-EDIT-S9  47060005
872604*            MOVE WS-EDIT-S9     TO AR72-LS-NEXT-OVRR-DT    (WS-I)47070005
872605*         ELSE                                                    47080005
872606*            MOVE  SPACES        TO AR72-LS-NEXT-OVRR-DT    (WS-I)47090005
872607*         END-IF                                                  47100005
872608*         MOVE  AR71-LS-NEXT-OVRR-WHYC-ID (WS-I)                  47110005
872609*           TO  AR72-LS-NEXT-OVRR-WHYC-ID (WS-I)                  47120005
872610*         MOVE  AR71-LS-NEXT-OVRR-BA-CD   (WS-I)                  47130005
872611*           TO  AR72-LS-NEXT-OVRR-BA-CD   (WS-I)                  47140005
872612*         MOVE  AR71-LS-NEXT-MTHD-HONR-ID (WS-I)                  47150005
872613*           TO  AR72-LS-NEXT-MTHD-HONR-ID (WS-I)                  47160005
872614*         MOVE  AR71-LS-NEXT-OVRR-TMNG-CD (WS-I)                  47170005
872615*           TO  AR72-LS-NEXT-OVRR-TMNG-CD (WS-I)                  47180005
872616*         MOVE  AR71-LS-NEXT-CIT-MTHD-ID  (WS-I)                  47190005
872617*           TO  AR72-LS-NEXT-CIT-MTHD-ID  (WS-I)                  47200005
872618*         MOVE  AR71-LS-NXT2-OVRR-ID      (WS-I)                  47210005
872619*           TO  AR72-LS-NXT2-OVRR-ID      (WS-I)                  47220005
872620*         IF AR71-LS-NXT2-OVRR-DT         (WS-I) IS NUMERIC       47230005
872621*            MOVE  AR71-LS-NXT2-OVRR-DT   (WS-I) TO WS-EDIT-S9    47240005
872622*            MOVE  WS-EDIT-S9                                     47250005
872623*              TO  AR72-LS-NXT2-OVRR-DT   (WS-I)                  47260005
872624*         ELSE                                                    47270005
872625*            MOVE SPACES                                          47280005
872626*              TO  AR72-LS-NXT2-OVRR-DT   (WS-I)                  47290005
872627*         END-IF                                                  47300005
872628*         MOVE  AR71-LS-NXT2-OVRR-WHYC-ID (WS-I)                  47310005
872629*           TO  AR72-LS-NXT2-OVRR-WHYC-ID (WS-I)                  47320005
872630*         MOVE  AR71-LS-NXT2-OVRR-BA-CD   (WS-I)                  47330005
872631*           TO  AR72-LS-NXT2-OVRR-BA-CD   (WS-I)                  47340005
872632*         MOVE  AR71-LS-NXT2-MTHD-HONR-ID (WS-I)                  47350005
872633*           TO  AR72-LS-NXT2-MTHD-HONR-ID (WS-I)                  47360005
872634*         MOVE  AR71-LS-NXT2-OVRR-TMNG-CD (WS-I)                  47370005
872635*           TO  AR72-LS-NXT2-OVRR-TMNG-CD (WS-I)                  47380005
872636*         MOVE  AR71-LS-NXT2-CIT-MTHD-ID  (WS-I)                  47390005
872637*           TO  AR72-LS-NXT2-CIT-MTHD-ID  (WS-I)                  47400005
872638*         IF AR71-CURR-DSCL-DT            (WS-I) IS NUMERIC       47410005
872639*            MOVE  AR71-CURR-DSCL-DT      (WS-I) TO WS-EDIT-S9    47420005
872640*            MOVE  WS-EDIT-S9                                     47430005
872641*              TO  AR72-CURR-DSCL-DT      (WS-I)                  47440005
872642*         ELSE                                                    47450005
872643*            MOVE SPACES                                          47460005
872644*              TO  AR72-CURR-DSCL-DT      (WS-I)                  47470005
872645*         END-IF                                                  47480005
872646*         IF AR71-CURR-DSCL-CT            (WS-I) IS NUMERIC       47490005
872647*            MOVE  AR71-CURR-DSCL-CT      (WS-I) TO WS-EDIT-S3    47500005
872648*            MOVE  WS-EDIT-S9                                     47510005
872649*              TO  AR72-CURR-DSCL-CT      (WS-I)                  47520005
872650*         ELSE                                                    47530005
872651*            MOVE SPACES                                          47540005
872652*              TO  AR72-CURR-DSCL-CT      (WS-I)                  47550005
872653*         END-IF                                                  47560005
872654*         IF AR71-NEXT-DSCL-DT            (WS-I) IS NUMERIC       47570005
872655*            MOVE  AR71-NEXT-DSCL-DT      (WS-I) TO WS-EDIT-S9    47580005
872656*            MOVE  WS-EDIT-S9                                     47590005
872657*              TO  AR72-NEXT-DSCL-DT      (WS-I)                  47600005
872658*         ELSE                                                    47610005
872659*            MOVE SPACES                                          47620005
872660*              TO  AR72-NEXT-DSCL-DT      (WS-I)                  47630005
872661*         END-IF                                                  47640005
872662*         IF AR71-NEXT-DSCL-CT            (WS-I) IS NUMERIC       47650005
872663*            MOVE  AR71-NEXT-DSCL-CT      (WS-I) TO WS-EDIT-S3    47660005
872664*            MOVE  WS-EDIT-S9                                     47670005
872665*              TO  AR72-NEXT-DSCL-CT      (WS-I)                  47680005
872666*         ELSE                                                    47690005
872667*            MOVE SPACES                                          47700005
872668*              TO  AR72-NEXT-DSCL-CT      (WS-I)                  47710005
872669*         END-IF                                                  47720005
872670*         IF AR71-NXT2-DSCL-DT            (WS-I) IS NUMERIC       47730005
872671*            MOVE  AR71-NXT2-DSCL-DT      (WS-I) TO WS-EDIT-S9    47740005
872672*            MOVE  WS-EDIT-S9                                     47750005
872673*              TO  AR72-NXT2-DSCL-DT      (WS-I)                  47760005
872674*         ELSE                                                    47770005
872675*            MOVE SPACES                                          47780005
872676*              TO  AR72-NXT2-DSCL-DT      (WS-I)                  47790005
872677*         END-IF                                                  47800005
872678*         IF AR71-NXT2-DSCL-CT            (WS-I) IS NUMERIC       47810005
872679*            MOVE  AR71-NXT2-DSCL-CT      (WS-I) TO WS-EDIT-S3    47820005
872680*            MOVE  WS-EDIT-S9                                     47830005
872681*              TO  AR72-NXT2-DSCL-CT      (WS-I)                  47840005
872682*         ELSE                                                    47850005
872683*            MOVE SPACES                                          47860005
872684*              TO  AR72-NXT2-DSCL-CT      (WS-I)                  47870005
872685*         END-IF                                                  47880005
872686*         IF AR71-LOCK-UNLK-SOON-CD       (WS-I) IS NUMERIC       47890005
872687*            MOVE  AR71-LOCK-UNLK-SOON-CD (WS-I)                  47900005
872688*              TO  AR72-LOCK-UNLK-SOON-CD (WS-I)                  47910005
872689*         ELSE                                                    47920005
872690*            MOVE SPACES                                          47930005
872691*              TO  AR72-LOCK-UNLK-SOON-CD (WS-I)                  47940005
872692*         END-IF                                                  47950005
872693*         IF AR71-NEXT-DAY-ALLC-CD        (WS-I) IS NUMERIC       47960005
872694*            MOVE  AR71-NEXT-DAY-ALLC-CD  (WS-I)                  47970005
872695*              TO  AR72-NEXT-DAY-ALLC-CD  (WS-I)                  47980005
872696*         ELSE                                                    47990005
872697*            MOVE SPACES                                          48000005
872698*              TO  AR72-NEXT-DAY-ALLC-CD  (WS-I)                  48010005
872699*         END-IF                                                  48020005
872700*    END-PERFORM                                                  48030005
872701*    PERFORM VARYING WS-I FROM 1 BY 1                             48040005
872702*            UNTIL WS-I > AR71-LAST-DFFR-CT                       48050005
872703*       MOVE  AR71-LAST-DFFR-TYPE-ID (WS-I)                       48060005
872704*         TO  AR72-LAST-DFFR-TYPE-ID (WS-I)                       48070005
872705*       MOVE  AR71-LAST-DFFR-OVRR-ID (WS-I)                       48080005
872706*         TO  AR72-LAST-DFFR-OVRR-ID (WS-I)                       48090005
872707*       IF AR71-LAST-DFFR-CHNG-DT (WS-I) IS NUMERIC               48100005
872708*          MOVE  AR71-LAST-DFFR-CHNG-DT (WS-I) TO  WS-EDIT-S9     48110005
872709*          MOVE  WS-EDIT-S9                                       48120005
872710*            TO  AR72-LAST-DFFR-CHNG-DT (WS-I)                    48130005
872711*       ELSE                                                      48140005
872712*          MOVE  SPACES                                           48150005
872713*            TO  AR72-LAST-DFFR-CHNG-DT (WS-I)                    48160005
872714*       END-IF                                                    48170005
872715*       MOVE  AR71-LAST-DFFR-WHYC-ID (WS-I)                       48180005
872716*         TO  AR72-LAST-DFFR-WHYC-ID (WS-I)                       48190005
872717*    END-PERFORM                                                  48200005
872718*                                                                 48210005
872719*    WRITE METHOD-OVERRIDE-OUT-REC                                48220005
872720*     FROM AR72-OVRR-RECORD.                                      48230005
872721*    ADD 1                       TO PV-MTHO-COUNT.                48240005
872722*                                                                 48250005
872723*                                                                 48260005
872724*-------------------------------*                                 48270005
872725*3400-PROCESS-FLAP-REC.                                           48280005
872726*-------------------------------*                                 48290005
872727*    INITIALIZE     AR94-RECORD                                   48300005
872728*    MOVE AR93-RECORD-IDENTIFIER TO AR94-RECORD-IDENTIFIER        48310005
872729*    MOVE AR93-RECORD-ID         TO AR94-RECORD-ID                48320005
872730*    IF AR93-RECORD-SQNC-CT      IS NUMERIC                       48330005
872731*        MOVE AR93-RECORD-SQNC-CT    TO WS-EDIT-S7                48340005
872732*        MOVE WS-EDIT-S7         TO AR94-RECORD-SQNC-CT           48350005
872733*    ELSE                                                         48360005
872734*         MOVE ZEROES            TO AR94-RECORD-SQNC-CT           48370005
872735*    END-IF                                                       48380005
872736*    MOVE AR93-SYS-ID            TO AR94-SYS-ID                   48390005
872737*    MOVE AR93-PRIN-ID           TO AR94-PRIN-ID                  48400005
872738*    MOVE AR93-AGNT-ID           TO AR94-AGNT-ID                  48410005
872739*    MOVE AR93-ACCT-ID           TO AR94-ACCT-ID                  48420005
872740*                                                                 48430005
872741*   KEYID SHOULD BE IN YYJJJSS FORMAT (SS=SEQUENCE NUMBER)        48440005
872742*   SS STARTS OVER AT 01 DAILY                                    48450005
872743*    IF AR93-KEY-ID              IS NUMERIC                       48460005
872744*        MOVE AR93-KEY-ID        TO WS-EDIT-S7                    48470005
872745*        MOVE WS-EDIT-S7         TO AR94-KEY-ID                   48480005
872746*    ELSE                                                         48490005
872747*        MOVE ZEROES             TO AR94-KEY-ID                   48500005
872748*    END-IF                                                       48510005
872749*                                                                 48520005
872750*    IF AR93-OCCR-CT             IS NUMERIC                       48530005
872751*        MOVE AR93-OCCR-CT       TO WS-EDIT-S7                    48540005
872752*        MOVE WS-EDIT-S7         TO AR94-OCCR-CT                  48550005
872753*    ELSE                                                         48560005
872754*        MOVE ZEROES             TO AR94-OCCR-CT                  48570005
872755*    END-IF                                                       48580005
872756*                                                                 48590005
872757*    IF AR93-TOTL-FLAP-CT        IS NUMERIC                       48600005
872758*        MOVE AR93-TOTL-FLAP-CT  TO WS-EDIT-S7                    48610005
872759*        MOVE WS-EDIT-S7         TO AR94-TOTL-FLAP-CT             48620005
872760*    ELSE                                                         48630005
872761*        MOVE ZEROES             TO AR94-TRANSACTION-AMT          48640005
872762*    END-IF                                                       48650005
872763*                                                                 48660005
872764*    IF AR93-ID                  IS NUMERIC                       48670005
872765*        MOVE AR93-ID            TO WS-EDIT-S7                    48680005
872766*        MOVE WS-EDIT-S7         TO AR94-ID                       48690005
872767*    ELSE                                                         48700005
872768*        MOVE ZEROES             TO AR94-ID                       48710005
872769*    END-IF                                                       48720005
872770*                                                                 48730005
872771*    IF AR93-TRANSACTION-AMT     IS NUMERIC                       48740005
872772*        MOVE AR93-TRANSACTION-AMT  TO WS-EDIT-S15V99             48750005
872773*        MOVE WS-EDIT-S15V99     TO AR94-TRANSACTION-AMT          48760005
872774*    ELSE                                                         48770005
872775*        MOVE ZEROES             TO AR94-TRANSACTION-AMT          48780005
872776*    END-IF                                                       48790005
872777*    MOVE AR93-TRAN-DATE         TO AR94-TRAN-DATE                48800005
872778*    MOVE AR93-EFFECTIVE-DATE    TO AR94-EFFECTIVE-DATE           48810005
872779*    MOVE AR93-EFFECTIVE-RELJUL  TO AR94-EFFECTIVE-RELJUL         48820005
872780*    MOVE AR93-POST-DATE         TO AR94-POST-DATE                48830005
872781*    MOVE AR93-DELAY-INT-END-DATE  TO AR94-DELAY-INT-END-DATE     48840005
872782*    MOVE AR93-DELAY-PAY-END-DATE  TO AR94-DELAY-PAY-END-DATE     48850005
872783*    IF AR93-PAYOUT-PERIOD       IS NUMERIC                       48860005
872784*        MOVE AR93-PAYOUT-PERIOD TO  WS-EDIT-S3                   48870005
872785*        MOVE WS-EDIT-S3         TO  AR94-PAYOUT-PERIOD           48880005
872786*    ELSE                                                         48890005
872787*        MOVE ZEROES             TO AR94-PAYOUT-PERIOD            48900005
872788*    END-IF                                                       48910005
872789*    IF AR93-HIGH-NOM-APPLIED-RT IS NUMERIC                       48920005
872790*        MOVE AR93-HIGH-NOM-APPLIED-RT TO  WS-EDIT-S2V999         48930005
872791*        MOVE  WS-EDIT-S2V999    TO  AR94-HIGH-NOM-APPLIED-RT     48940005
872792*    ELSE                                                         48950005
872793*        MOVE ZEROES             TO AR94-HIGH-NOM-APPLIED-RT      48960005
872794*    END-IF                                                       48970005
872795*    IF AR93-LOW-NOM-APPLIED-RT IS NUMERIC                        48980005
872796*        MOVE AR93-LOW-NOM-APPLIED-RT TO  WS-EDIT-S2V999          48990005
872797*        MOVE  WS-EDIT-S2V999    TO  AR94-LOW-NOM-APPLIED-RT      49000005
872798*    ELSE                                                         49010005
872799*        MOVE ZEROES             TO AR94-LOW-NOM-APPLIED-RT       49020005
872800*    END-IF                                                       49030005
872801*    IF AR93-ANN-INT-RATE        IS NUMERIC                       49040005
872802*        MOVE AR93-ANN-INT-RATE  TO  WS-EDIT-S2V999               49050005
872803*        MOVE  WS-EDIT-S2V999    TO  AR94-ANN-INT-RATE            49060005
872804*    ELSE                                                         49070005
872805*        MOVE ZEROES             TO AR94-ANN-INT-RATE             49080005
872806*    END-IF                                                       49090005
872807*    IF AR93-MONTH-INT-RATE      IS NUMERIC                       49100005
872808*        MOVE AR93-MONTH-INT-RATE TO  WS-EDIT-SV95                49110005
872809*        MOVE  WS-EDIT-SV95      TO  AR94-MONTH-INT-RATE          49120005
872810*    ELSE                                                         49130005
872811*        MOVE ZEROES             TO AR94-MONTH-INT-RATE           49140005
872812*    END-IF                                                       49150005
872813*    IF AR93-DAILY-INT-RATE      IS NUMERIC                       49160005
872814*        MOVE AR93-DAILY-INT-RATE TO  WS-EDIT-SV95                49170005
872815*        MOVE  WS-EDIT-SV95      TO  AR94-DAILY-INT-RATE          49180005
872816*    ELSE                                                         49190005
872817*        MOVE ZEROES             TO AR94-DAILY-INT-RATE           49200005
872818*    END-IF                                                       49210005
872819*    IF AR93-ORIG-ANN-INT-RATE   IS NUMERIC                       49220005
872820*        MOVE AR93-ORIG-ANN-INT-RATE TO  WS-EDIT-S2V999           49230005
872821*        MOVE  WS-EDIT-S2V999    TO  AR94-ORIG-ANN-INT-RATE       49240005
872822*    ELSE                                                         49250005
872823*        MOVE ZEROES             TO AR94-ORIG-ANN-INT-RATE        49260005
872824*    END-IF                                                       49270005
872825*    IF AR93-ORIG-MONTH-INT-RATE IS NUMERIC                       49280005
872826*        MOVE AR93-ORIG-MONTH-INT-RATE TO  WS-EDIT-SV95           49290005
872827*        MOVE WS-EDIT-SV95       TO  AR94-ORIG-MONTH-INT-RATE     49300005
872828*    ELSE                                                         49310005
872829*        MOVE ZEROES             TO AR94-ORIG-MONTH-INT-RATE      49320005
872830*    END-IF                                                       49330005
872831*    IF AR93-ORIG-DAILY-INT-RATE IS NUMERIC                       49340005
872832*        MOVE AR93-ORIG-DAILY-INT-RATE TO  WS-EDIT-SV95           49350005
872833*        MOVE WS-EDIT-SV95       TO  AR94-ORIG-DAILY-INT-RATE     49360005
872834*    ELSE                                                         49370005
872835*        MOVE ZEROES             TO AR94-ORIG-DAILY-INT-RATE      49380005
872836*    END-IF                                                       49390005
872837*    MOVE AR93-OLD-DEPT-CODE     TO AR94-OLD-DEPT-CODE            49400005
872838*    IF AR93-LIFE-BILLED-INT   IS NUMERIC                         49410005
872839*        MOVE AR93-LIFE-BILLED-INT TO WS-EDIT-S15V99              49420005
872840*        MOVE WS-EDIT-S15V99     TO  AR94-LIFE-BILLED-INT         49430005
872841*    ELSE                                                         49440005
872842*        MOVE ZEROES             TO AR94-LIFE-BILLED-INT          49450005
872843*    END-IF                                                       49460005
872844*    MOVE AR93-DISPUTE-FLAG      TO AR94-DISPUTE-FLAG             49470005
872845*    IF AR93-LIFE-BILLED-INT   IS NUMERIC                         49480005
872846*        MOVE AR93-LIFE-BILLED-INT TO WS-EDIT-S15V99              49490005
872847*        MOVE WS-EDIT-S15V99     TO  AR94-LIFE-BILLED-INT         49500005
872848*    ELSE                                                         49510005
872849*        MOVE ZEROES             TO AR94-LIFE-BILLED-INT          49520005
872850*    END-IF                                                       49530005
872851*    MOVE AR93-TERMS-CODE        TO AR94-TERMS-CODE               49540005
872852*    IF AR93-CASH-OPT-END-DATE IS NUMERIC                         49550005
872853*        MOVE AR93-CASH-OPT-END-DATE TO WS-EDIT-S7                49560005
872854*        MOVE WS-EDIT-S7         TO AR94-CASH-OPT-END-DATE        49570005
872855*    ELSE                                                         49580005
872856*        MOVE ZEROES             TO AR94-CASH-OPT-END-DATE        49590005
872857*    END-IF                                                       49600005
872858*    IF AR93-WAIVED-UNBILLED-INT IS NUMERIC                       49610005
872859*        MOVE AR93-WAIVED-UNBILLED-INT TO WS-EDIT-S15V99          49620005
872860*        MOVE WS-EDIT-S15V99     TO  AR94-WAIVED-UNBILLED-INT     49630005
872861*    ELSE                                                         49640005
872862*        MOVE ZEROES             TO AR94-WAIVED-UNBILLED-INT      49650005
872863*    END-IF                                                       49660005
872864*    MOVE AR93-PROMOTIONAL-ID    TO AR94-PROMOTIONAL-ID           49670005
872865*    IF AR93-PAID-OFF-MOS        IS NUMERIC                       49680005
872866*        MOVE AR93-PAID-OFF-MOS  TO  WS-EDIT-S3                   49690005
872867*        MOVE  WS-EDIT-S3        TO  AR94-PAID-OFF-MOS            49700005
872868*    ELSE                                                         49710005
872869*        MOVE ZEROES             TO AR94-PAID-OFF-MOS             49720005
872870*    END-IF                                                       49730005
872871*    IF AR93-HIST-PURCHASES      IS NUMERIC                       49740005
872872*        MOVE AR93-HIST-PURCHASES   TO  WS-EDIT-S15V99            49750005
872873*        MOVE  WS-EDIT-S15V99    TO AR94-HIST-PURCHASES           49760005
872874*    ELSE                                                         49770005
872875*        MOVE ZEROES             TO AR94-TRANSACTION-AMT          49780005
872876*    END-IF                                                       49790005
872877*    IF AR93-POB-AMT             IS NUMERIC                       49800005
872878*        MOVE AR93-POB-AMT       TO  WS-EDIT-S13V94               49810005
872879*        MOVE  WS-EDIT-S13V94    TO  AR94-POB-AMT                 49820005
872880*    ELSE                                                         49830005
872881*        MOVE ZEROES             TO AR94-POB-AMT                  49840005
872882*    END-IF                                                       49850005
872883*    IF AR93-POB-RATE            IS NUMERIC                       49860005
872884*        MOVE AR93-POB-AMT       TO  WS-EDIT-S11V94               49870005
872885*        MOVE WS-EDIT-S11V94     TO  AR94-POB-RATE                49880005
872886*    ELSE                                                         49890005
872887*        MOVE ZEROES             TO AR94-POB-RATE                 49900005
872888*    END-IF                                                       49910005
872889*    IF AR93-PERC-BPD            IS NUMERIC                       49920005
872890*        MOVE AR93-PERC-BPD      TO  WS-EDIT-S15V99               49930005
872891*        MOVE WS-EDIT-S15V99     TO  AR94-PERC-BPD                49940005
872892*    ELSE                                                         49950005
872893*        MOVE ZEROES             TO AR94-PERC-BPD                 49960005
872894*    END-IF                                                       49970005
872895*    MOVE AR93-ITEM-FEE-DLAY-DT  TO   AR94-ITEM-FEE-DLAY-DT       49980005
872896*    IF AR93-UNBD-ITEM-FEE-CURR-AM   IS NUMERIC                   49990005
872897*        MOVE AR93-UNBD-ITEM-FEE-CURR-AM  TO  WS-EDIT-S15V99      50000005
872898*        MOVE WS-EDIT-S15V99     TO  AR94-UNBD-ITEM-FEE-CURR-AM   50010005
872899*    ELSE                                                         50020005
872900*        MOVE ZEROES             TO AR94-UNBD-ITEM-FEE-CURR-AM    50030005
872901*    END-IF                                                       50040005
872902*    MOVE AR93-INTRO-VAR-BR-SW TO AR94-INTRO-VAR-BR-SW            50050005
872903*    IF AR93-RGLR-INDX-RT         IS NUMERIC                      50060005
872904*        MOVE AR93-RGLR-INDX-RT  TO  WS-EDIT-S2V999               50070005
872905*        MOVE WS-EDIT-S2V999     TO  AR94-RGLR-INDX-RT            50080005
872906*    ELSE                                                         50090005
872907*        MOVE ZEROES             TO AR94-RGLR-INDX-RT             50100005
872908*    END-IF                                                       50110005
872909*    IF AR93-INTR-INDX-RT         IS NUMERIC                      50120005
872910*        MOVE AR93-INTR-INDX-RT  TO  WS-EDIT-S2V999               50130005
872911*        MOVE WS-EDIT-S2V999     TO  AR94-INTR-INDX-RT            50140005
872912*    ELSE                                                         50150005
872913*        MOVE ZEROES             TO AR94-INTR-INDX-RT             50160005
872914*    END-IF                                                       50170005
872915*    IF AR93-LS-ANN-APR          IS NUMERIC                       50180005
872916*        MOVE AR93-LS-ANN-APR    TO  WS-EDIT-S2V999               50190005
872917*        MOVE  WS-EDIT-S2V999    TO AR94-LS-ANN-APR               50200005
872918*    ELSE                                                         50210005
872919*        MOVE SPACES             TO AR94-LS-ANN-APR               50220005
872920*    END-IF                                                       50230005
872921*    IF AR93-LS-TEMP-APR         IS NUMERIC                       50240005
872922*        MOVE AR93-LS-TEMP-APR   TO  WS-EDIT-S2V999               50250005
872923*        MOVE  WS-EDIT-S2V999    TO AR94-LS-TEMP-APR              50260005
872924*    ELSE                                                         50270005
872925*        MOVE SPACES             TO AR94-LS-TEMP-APR              50280005
872926*    END-IF                                                       50290005
872927*    MOVE AR93-LS-CLLP-FLAP-MTRC-CD                               50300005
872928*                                TO  AR94-LS-CLLP-FLAP-MTRC-CD    50310005
872929*    MOVE AR93-PS-CLLP-FLAP-MTRC-CD                               50320005
872930*                                TO  AR94-PS-CLLP-FLAP-MTRC-CD    50330005
872931*    MOVE AR93-DFRD-INT-CD       TO AR94-DFRD-INT-CD              50340005
872932*    IF AR93-PS-APR-RT           IS NUMERIC                       50350005
872933*        MOVE AR93-PS-APR-RT     TO  WS-EDIT-S2V999               50360005
872934*        MOVE  WS-EDIT-S2V999    TO AR94-PS-APR-RT                50370005
872935*    ELSE                                                         50380005
872936*        MOVE SPACES             TO AR94-PS-APR-RT                50390005
872937*    END-IF                                                       50400005
872938*    IF AR93-HIST-LS-BAL         IS NUMERIC                       50410005
872939*        MOVE AR93-HIST-LS-BAL   TO  WS-EDIT-S15V99               50420005
872940*        MOVE WS-EDIT-S15V99     TO AR94-HIST-LS-BAL              50430005
872941*    ELSE                                                         50440005
872942*        MOVE SPACES             TO AR94-HIST-LS-BAL              50450005
872943*    END-IF                                                       50460005
872944*    IF AR93-HIST-PS-BAL         IS NUMERIC                       50470005
872945*        MOVE AR93-HIST-PS-BAL   TO  WS-EDIT-S15V99               50480005
872946*        MOVE WS-EDIT-S15V99     TO AR94-HIST-PS-BAL              50490005
872947*    ELSE                                                         50500005
872948*        MOVE SPACES             TO AR94-HIST-PS-BAL              50510005
872949*    END-IF                                                       50520005
872950*    MOVE AR93-EXPR-UNPD-CD      TO AR94-EXPR-UNPD-CD             50530005
872951*    IF AR93-CTD-BLLD-INTR-AM    IS NUMERIC                       50540005
872952*        MOVE AR93-CTD-BLLD-INTR-AM TO  WS-EDIT-S11V99            50550005
872953*        MOVE WS-EDIT-S11V99     TO AR94-CTD-BLLD-INTR-AM         50560005
872954*    ELSE                                                         50570005
872955*        MOVE SPACES             TO AR94-CTD-BLLD-INTR-AM         50580005
872956*    END-IF                                                       50590005
872957*    IF AR93-EXPR-DALY-INTR-RT   IS NUMERIC                       50600005
872958*        MOVE AR93-EXPR-DALY-INTR-RT TO  WS-EDIT-SV95             50610005
872959*        MOVE WS-EDIT-SV95       TO AR94-EXPR-DALY-INTR-RT        50620005
872960*    ELSE                                                         50630005
872961*        MOVE SPACES             TO AR94-EXPR-DALY-INTR-RT        50640005
872962*    END-IF                                                       50650005
872963*    IF AR93-EXPR-MNTH-INTR-RT   IS NUMERIC                       50660005
872964*        MOVE AR93-EXPR-MNTH-INTR-RT TO  WS-EDIT-SV95             50670005
872965*        MOVE WS-EDIT-SV95       TO AR94-EXPR-MNTH-INTR-RT        50680005
872966*    ELSE                                                         50690005
872967*        MOVE SPACES             TO AR94-EXPR-MNTH-INTR-RT        50700005
872968*    END-IF                                                       50710005
872969*    IF AR93-EXPR-ANNL-INTR-RT   IS NUMERIC                       50720005
872970*        MOVE AR93-EXPR-ANNL-INTR-RT TO  WS-EDIT-S2V999           50730005
872971*        MOVE WS-EDIT-S2V999     TO AR94-EXPR-ANNL-INTR-RT        50740005
872972*    ELSE                                                         50750005
872973*        MOVE SPACES             TO AR94-EXPR-ANNL-INTR-RT        50760005
872974*    END-IF                                                       50770005
872975*    IF AR93-MIN-INTR-ITRO-RT    IS NUMERIC                       50780005
872976*        MOVE AR93-MIN-INTR-ITRO-RT  TO  WS-EDIT-S2V999           50790005
872977*        MOVE WS-EDIT-S2V999     TO AR94-MIN-INTR-ITRO-RT         50800005
872978*    ELSE                                                         50810005
872979*        MOVE SPACES             TO AR94-MIN-INTR-ITRO-RT         50820005
872980*    END-IF                                                       50830005
872981*    IF AR93-MIN-RGLR-ANNL-RT    IS NUMERIC                       50840005
872982*        MOVE AR93-MIN-RGLR-ANNL-RT  TO  WS-EDIT-S2V999           50850005
872983*        MOVE WS-EDIT-S2V999     TO AR94-MIN-RGLR-ANNL-RT         50860005
872984*    ELSE                                                         50870005
872985*        MOVE SPACES             TO AR94-MIN-RGLR-ANNL-RT         50880005
872986*    END-IF                                                       50890005
872987*    IF AR93-RTRN-TO-RVLV-DT     IS NUMERIC                       50900005
872988*        MOVE AR93-RTRN-TO-RVLV-DT  TO  WS-EDIT-S9                50910005
872989*        MOVE  WS-EDIT-S9        TO AR94-RTRN-TO-RVLV-DT          50920005
872990*    ELSE                                                         50930005
872991*        MOVE SPACES             TO AR94-RTRN-TO-RVLV-DT          50940005
872992*    END-IF                                                       50950005
872993*    MOVE AR93-RTRN-TO-RVLV-CD   TO AR94-RTRN-TO-RVLV-CD          50960005
872994*    MOVE AR93-LS-REVOLV-SW      TO AR94-LS-REVOLV-SW             50970005
872995*    MOVE AR93-PS-REVOLV-SW      TO AR94-PS-REVOLV-SW             50980005
872996*    MOVE AR93-LAST-REVOLV-SW    TO AR94-LAST-REVOLV-SW           50990005
872997*    MOVE AR93-LS-RVLV-SWTC-CD   TO AR94-LS-RVLV-SWTC-CD          51000005
872998*    MOVE AR93-PS-RVLV-SWTC-CD   TO AR94-PS-RVLV-SWTC-CD          51010005
872999*    MOVE AR93-LAST-RVLV-SWTC-CD TO AR94-REVOLV-INT-RATES         51020005
873000*    MOVE AR93-REVOLV-INT-METHOD TO AR94-REVOLV-INT-METHOD        51030005
873001*    MOVE AR93-REVOLV-MPD        TO AR94-REVOLV-MPD               51040005
873002*    MOVE AR93-REVOLV-ITEM-FEES  TO AR94-REVOLV-ITEM-FEES         51050005
873003*    MOVE AR93-REVOLV-PAYOFF-EXCEPT                               51060005
873004*                                TO AR94-REVOLV-PAYOFF-EXCEPT     51070005
873005*    MOVE AR93-REVOLV-BASE-INT   TO AR94-REVOLV-BASE-INT          51080005
873006*    MOVE AR93-REVOLV-REBATE     TO AR94-REVOLV-REBATE            51090005
873007*    MOVE AR93-REVOLV-BREAKRATES TO AR94-REVOLV-BREAKRATES        51100005
873008*    MOVE AR93-RVLV-INTR-ON-INTR-CD                               51110005
873009*                                TO AR94-RVLV-INTR-ON-INTR-CD     51120005
873010*    MOVE AR93-RVLVINTR-DFLT-CD  TO AR94-RVLVINTR-DFLT-CD         51130005
873011*    IF AR93-PROMO-SQNC-NR       IS NUMERIC                       51140005
873012*        MOVE AR93-PROMO-SQNC-NR TO WS-EDIT-S5                    51150005
873013*        MOVE WS-EDIT-S5         TO AR94-PROMO-SQNC-NR            51160005
873014*    ELSE                                                         51170005
873015*        MOVE ZEROES             TO AR94-PROMO-SQNC-NR            51180005
873016*    END-IF                                                       51190005
873017*    IF AR93-PLAN-FLAP-ID        IS NUMERIC                       51200005
873018*        MOVE AR93-PLAN-FLAP-ID  TO WS-EDIT-S7                    51210005
873019*        MOVE WS-EDIT-S7         TO AR94-PLAN-FLAP-ID             51220005
873020*    ELSE                                                         51230005
873021*        MOVE ZEROES             TO AR94-PLAN-FLAP-ID             51240005
873022*    END-IF                                                       51250005
873023*    IF AR93-BLNC-TYPE-CD        IS= ('B' OR 'I' OR 'P')          51260005
873024*        MOVE AR93-BLNC-TYPE-CD  TO  AR94-BLNC-TYPE-CD            51270005
873025*    ELSE                                                         51280005
873026*        MOVE 'I'                TO AR94-RTRN-TO-RVLV-DT          51290005
873027*    END-IF                                                       51300005
873028*    IF AR93-MPD-HIGH-BLNC-AM    IS NUMERIC                       51310005
873029*        MOVE AR93-MPD-HIGH-BLNC-AM TO  WS-EDIT-S15V99            51320005
873030*        MOVE  WS-EDIT-S15V99    TO AR94-MPD-HIGH-BLNC-AM         51330005
873031*    ELSE                                                         51340005
873032*        MOVE ZEROES             TO AR94-MPD-HIGH-BLNC-AM         51350005
873033*    END-IF                                                       51360005
873034*    MOVE AR93-INVC-NMBR-TX      TO AR94-INVC-NMBR-TX             51370005
873035*    IF AR93-BPS-HIST-BAL        IS NUMERIC                       51380005
873036*        MOVE AR93-BPS-HIST-BAL  TO  WS-EDIT-S15V99               51390005
873037*        MOVE  WS-EDIT-S15V99    TO AR94-BPS-HIST-BAL             51400005
873038*    ELSE                                                         51410005
873039*        MOVE ZEROES             TO AR94-BPS-HIST-BAL             51420005
873040*    END-IF                                                       51430005
873041*    IF AR93-CRRN-INST-NR        IS NUMERIC                       51440005
873042*        MOVE AR93-CRRN-INST-NR  TO  WS-EDIT-S3                   51450005
873043*        MOVE WS-EDIT-S3         TO AR94-CRRN-INST-NR             51460005
873044*    ELSE                                                         51470005
873045*        MOVE ZEROES             TO AR94-CRRN-INST-NR             51480005
873046*    END-IF                                                       51490005
873047*                                                                 51500005
873048*    MOVE AR93-DEPT-CODE         TO AR94-DEPT-CODE                51510005
873049*    MOVE AR93-MTHD-RELD-CD      TO AR94-MTHD-RELD-CD             51520005
873050*    MOVE AR93-RTRN-TO-RVLV-SSPN-CD                               51530005
873051*                                TO AR94-RTRN-TO-RVLV-SSPN-CD     51540005
873052*    MOVE AR93-MTHD-SET-NR       TO AR94-MTHD-SET-NR              51550005
873053*                                                                 51560005
873054*    IF AR93-UNBL-INTR-ADJ-AM    IS NUMERIC                       51570005
873055*        MOVE AR93-UNBL-INTR-ADJ-AM TO  WS-EDIT-S11V99            51580005
873056*        MOVE WS-EDIT-S11V99     TO AR94-UNBL-INTR-ADJ-AM         51590005
873057*    ELSE                                                         51600005
873058*        MOVE ZEROES             TO AR94-UNBL-INTR-ADJ-AM         51610005
873059*    END-IF                                                       51620005
873060*    MOVE AR93-UNBL-INTR-ADJ-DT  TO AR94-UNBL-INTR-ADJ-DT         51630005
873061*******                                                           51640005
873062*    IF AR93-PRMT-POB-RT         IS NUMERIC                       51650005
873063*        MOVE AR93-PRMT-POB-RT   TO   WS-EDIT-SV97                51660005
873064*        MOVE   WS-EDIT-SV97     TO AR94-PRMT-POB-RT              51670005
873065*    ELSE                                                         51680005
873066*        MOVE ZEROES             TO AR94-PRMT-POB-RT              51690005
873067*    END-IF                                                       51700005
873068*    IF AR93-PRMT-POB-CMPN-IN    IS NUMERIC                       51710005
873069*        MOVE AR93-PRMT-POB-CMPN-IN TO  AR94-PRMT-POB-CMPN-IN     51720005
873070*    ELSE                                                         51730005
873071*        MOVE ZEROES             TO AR94-PRMT-POB-CMPN-IN         51740005
873072*    END-IF                                                       51750005
873073*    MOVE AR93-RMRT-TYPE-CD      TO AR94-RMRT-TYPE-CD             51760005
873074*    MOVE AR93-SPCL-USE-1-CD     TO AR94-SPCL-USE-1-CD            51770005
873075*******                                                           51780005
873076*    IF AR93-PS-PRMT-DBT-AM      IS NUMERIC                       51790005
873077*        MOVE AR93-PS-PRMT-DBT-AM TO  WS-EDIT-SV97                51800005
873078*        MOVE WS-EDIT-SV97        TO AR94-PS-PRMT-DBT-AM          51810005
873079*    ELSE                                                         51820005
873080*        MOVE ZEROES             TO AR94-PS-PRMT-DBT-AM           51830005
873081*    END-IF                                                       51840005
873082*    IF AR93-PS-PRMT-CRDT-AM     IS NUMERIC                       51850005
873083*        MOVE AR93-PS-PRMT-CRDT-AM  TO  WS-EDIT-S15V99            51860005
873084*        MOVE  WS-EDIT-S15V99    TO AR94-PS-PRMT-CRDT-AM          51870005
873085*    ELSE                                                         51880005
873086*        MOVE ZEROES             TO AR94-PS-PRMT-CRDT-AM          51890005
873087*    END-IF                                                       51900005
873088*    IF AR93-LFTM-BLLD-CRDT-INSR-AM  IS  NUMERIC                  51910005
873089*        MOVE AR93-LFTM-BLLD-CRDT-INSR-AM TO WS-EDIT-S15V99       51920005
873090*        MOVE  WS-EDIT-S15V99    TO   AR94-LFTM-BLLD-CRDT-INSR-AM 51930005
873091*    ELSE                                                         51940005
873092*        MOVE ZEROES             TO AR94-LFTM-BLLD-CRDT-INSR-AM   51950005
873093*    END-IF                                                       51960005
873094*    IF AR93-FUND-EFFBEG-DT             IS NUMERIC                51970005
873095*        MOVE AR93-FUND-EFFBEG-DT TO WS-EDIT-S9                   51980005
873096*        MOVE WS-EDIT-S9         TO AR94-FUND-EFFBEG-DT           51990005
873097*    ELSE                                                         52000005
873098*        MOVE SPACES             TO AR94-FUND-EFFBEG-DT           52010005
873099*    END-IF                                                       52020005
873100*    IF AR93-FUND-EFFEND-DT             IS NUMERIC                52030005
873101*        MOVE AR93-FUND-EFFEND-DT TO WS-EDIT-S9                   52040005
873102*        MOVE WS-EDIT-S9         TO AR94-FUND-EFFEND-DT           52050005
873103*    ELSE                                                         52060005
873104*        MOVE SPACES             TO AR94-FUND-EFFEND-DT           52070005
873105*    END-IF                                                       52080005
873106*    MOVE AR93-FUND-ACCESS-ID    TO AR94-FUND-ACCESS-ID           52090005
873107*******                                                           52100005
873108*    IF AR93-MAX-INTR-ITRO-RT    IS NUMERIC                       52110005
873109*        MOVE AR93-MAX-INTR-ITRO-RT TO  WS-EDIT-S2V999            52120005
873110*        MOVE  WS-EDIT-S2V999    TO AR94-MAX-INTR-ITRO-RT         52130005
873111*    ELSE                                                         52140005
873112*        MOVE ZEROES             TO AR94-MAX-INTR-ITRO-RT         52150005
873113*    END-IF                                                       52160005
873114*    IF AR93-MAX-INTR-RGLR-RT    IS NUMERIC                       52170005
873115*        MOVE AR93-MAX-INTR-RGLR-RT TO  WS-EDIT-S2V999            52180005
873116*        MOVE  WS-EDIT-S2V999    TO AR94-MAX-INTR-RGLR-RT         52190005
873117*    ELSE                                                         52200005
873118*       MOVE ZEROES              TO AR94-MAX-INTR-RGLR-RT         52210005
873119*    END-IF                                                       52220005
873120*********                                                         52230005
873121*    MOVE AR93-MIN-INTR-ITRO-USAG-CD                              52240005
873122*                                TO AR94-MIN-INTR-ITRO-USAG-CD    52250005
873123*    MOVE AR93-MIN-INTR-RGLR-USAG-CD                              52260005
873124*                                TO AR94-MIN-INTR-RGLR-USAG-CD    52270005
873125*    MOVE AR93-MAX-INTR-ITRO-USAG-CD                              52280005
873126*                                TO AR93-MAX-INTR-ITRO-USAG-CD    52290005
873127*    MOVE AR93-MAX-INTR-RGLR-USAG-CD                              52300005
873128*                                TO AR94-MAX-INTR-RGLR-USAG-CD    52310005
873129*    MOVE AR93-INTR-DFLT-STRT-TX                                  52320005
873130*                                TO AR94-INTR-DFLT-STRT-TX        52330005
873131********                                                          52340005
873132*                                                                 52350005
873133*    IF AR93-PRTC-BLNC-ID        IS NUMERIC                       52360005
873134*        MOVE AR93-PRTC-BLNC-ID  TO  WS-EDIT-S7                   52370005
873135*        MOVE  WS-EDIT-S7        TO AR94-PRTC-BLNC-ID             52380005
873136*    ELSE                                                         52390005
873137*        MOVE ZEROES             TO AR94-PRTC-BLNC-ID             52400005
873138*    END-IF                                                       52410005
873139*    IF AR93-ASSC-FLAP-ID        IS NUMERIC                       52420005
873140*        MOVE AR93-ASSC-FLAP-ID  TO  WS-EDIT-S7                   52430005
873141*        MOVE  WS-EDIT-S7        TO AR94-ASSC-FLAP-ID             52440005
873142*    ELSE                                                         52450005
873143*        MOVE ZEROES             TO AR94-ASSC-FLAP-ID             52460005
873144*    END-IF                                                       52470005
873145*********                                                         52480005
873146*    IF AR93-IP-STRT-DT          IS NUMERIC                       52490005
873147*        MOVE AR93-IP-STRT-DT    TO  WS-EDIT-S9                   52500005
873148*        MOVE  WS-EDIT-S9        TO AR94-IP-STRT-DT               52510005
873149*    ELSE                                                         52520005
873150*        MOVE ZEROES             TO AR94-IP-STRT-DT               52530005
873151*    END-IF                                                       52540005
873152*    IF AR93-IP-END-DT           IS NUMERIC                       52550005
873153*        MOVE AR93-IP-END-DT     TO  WS-EDIT-S9                   52560005
873154*        MOVE  WS-EDIT-S9        TO AR94-IP-END-DT                52570005
873155*    ELSE                                                         52580005
873156*        MOVE ZEROES             TO AR94-IP-END-DT                52590005
873157*    END-IF                                                       52600005
873158*    MOVE AR93-PRTC-BLNC-DT      TO AR94-PRTC-BLNC-DT             52610005
873159*    MOVE AR93-CIT-DT            TO AR94-CIT-DT                   52620005
873160*    MOVE AR93-PB-TRMS-EFFC-DT   TO AR94-PB-TRMS-EFFC-DT          52630005
873161*    IF AR93-TERM-FREZ-DT        IS NUMERIC                       52640005
873162*        MOVE AR93-TERM-FREZ-DT  TO  WS-EDIT-S9                   52650005
873163*        MOVE  WS-EDIT-S9        TO AR94-TERM-FREZ-DT             52660005
873164*    ELSE                                                         52670005
873165*       MOVE ZEROES              TO AR94-TERM-FREZ-DT             52680005
873166*    END-IF                                                       52690005
873167*    MOVE AR93-PB-MUF-TYPE-CD    TO AR94-PB-MUF-TYPE-CD           52700005
873168********                                                          52710005
873169*    IF AR93-ANNV-INTR-RT        IS NUMERIC                       52720005
873170*        MOVE AR93-ANNV-INTR-RT  TO  WS-EDIT-S2V999               52730005
873171*        MOVE  WS-EDIT-S2V999    TO AR94-ANNV-INTR-RT             52740005
873172*    ELSE                                                         52750005
873173*        MOVE ZEROES             TO AR94-ANNV-INTR-RT             52760005
873174*    END-IF                                                       52770005
873175*    IF AR93-RTR-DELY-DT         IS NUMERIC                       52780005
873176*        MOVE AR93-RTR-DELY-DT   TO  WS-EDIT-S9                   52790005
873177*        MOVE  WS-EDIT-S9        TO AR94-RTR-DELY-DT              52800005
873178*    ELSE                                                         52810005
873179*        MOVE ZEROES             TO AR94-RTR-DELY-DT              52820005
873180*    END-IF                                                       52830005
873181*    MOVE AR93-RTR-DELY-RESN-CD  TO AR94-RTR-DELY-RESN-CD         52840005
873182*    IF AR93-TERM-UNFR-DT        IS NUMERIC                       52850005
873183*        MOVE AR93-TERM-UNFR-DT  TO  WS-EDIT-S9                   52860005
873184*        MOVE  WS-EDIT-S9        TO AR94-TERM-UNFR-DT             52870005
873185*    ELSE                                                         52880005
873186*        MOVE ZEROES             TO AR94-TERM-UNFR-DT             52890005
873187*    END-IF                                                       52900005
873188*    IF AR93-GOTO-APR            IS NUMERIC                       52910005
873189*        MOVE AR93-GOTO-APR      TO  WS-EDIT-S2V999               52920005
873190*        MOVE  WS-EDIT-S2V999    TO AR94-GOTO-APR                 52930005
873191*    ELSE                                                         52940005
873192*        MOVE ZEROES             TO AR94-GOTO-APR                 52950005
873193*    END-IF                                                       52960005
873194*    IF AR93-OMPD-PL-AM          IS NUMERIC                       52970005
873195*        MOVE AR93-OMPD-PL-AM    TO  WS-EDIT-S15V99               52980005
873196*        MOVE  WS-EDIT-S15V99    TO AR94-OMPD-PL-AM               52990005
873197*    ELSE                                                         53000005
873198*        MOVE ZEROES             TO AR94-OMPD-PL-AM               53010005
873199*    END-IF                                                       53020005
873200*    IF AR93-PB-CLPS-NO-MNTHS    IS NUMERIC                       53030005
873201*        MOVE AR93-PB-CLPS-NO-MNTHS TO  WS-EDIT-S1                53040005
873202*        MOVE  WS-EDIT-S1        TO AR94-PB-CLPS-NO-MNTHS         53050005
873203*    ELSE                                                         53060005
873204*        MOVE ZEROES             TO AR94-PB-CLPS-NO-MNTHS         53070005
873205*    END-IF                                                       53080005
873206***********                                                       53090005
873207*    IF AR93-SSPN-ANN-INT-RT     IS NUMERIC                       53100005
873208*        MOVE AR93-SSPN-ANN-INT-RT  TO  WS-EDIT-S2V999            53110005
873209*        MOVE  WS-EDIT-S2V999    TO AR94-SSPN-ANN-INT-RT          53120005
873210*    ELSE                                                         53130005
873211*        MOVE ZEROES             TO AR94-SSPN-ANN-INT-RT          53140005
873212*    END-IF                                                       53150005
873213*    IF AR93-SSPN-ORIG-ANN-INT-RT IS NUMERIC                      53160005
873214*        MOVE AR93-SSPN-ORIG-ANN-INT-RT TO WS-EDIT-S2V999         53170005
873215*        MOVE  WS-EDIT-S2V999    TO AR94-SSPN-ORIG-ANN-INT-RT     53180005
873216*    ELSE                                                         53190005
873217*        MOVE ZEROES             TO AR94-SSPN-ORIG-ANN-INT-RT     53200005
873218*    END-IF                                                       53210005
873219*    IF AR93-SSPN-MIN-RGLR-ANNL-RT IS NUMERIC                     53220005
873220*        MOVE AR93-SSPN-MIN-RGLR-ANNL-RT TO  WS-EDIT-S2V999       53230005
873221*        MOVE  WS-EDIT-S2V999    TO AR94-SSPN-MIN-RGLR-ANNL-RT    53240005
873222*    ELSE                                                         53250005
873223*        MOVE ZEROES             TO AR94-SSPN-MIN-RGLR-ANNL-RT    53260005
873224*    END-IF                                                       53270005
873225*    IF AR93-SSPN-MIN-INTR-ITRO-RT IS NUMERIC                     53280005
873226*        MOVE AR93-SSPN-MIN-INTR-ITRO-RT TO  WS-EDIT-S2V999       53290005
873227*        MOVE  WS-EDIT-S2V999    TO AR94-SSPN-MIN-INTR-ITRO-RT    53300005
873228*    ELSE                                                         53310005
873229*        MOVE ZEROES             TO AR94-SSPN-MIN-INTR-ITRO-RT    53320005
873230*    END-IF                                                       53330005
873231*    IF AR93-SSPN-MAX-INTR-ITRO-RT IS NUMERIC                     53340005
873232*        MOVE AR93-SSPN-MAX-INTR-ITRO-RT TO  WS-EDIT-S2V999       53350005
873233*        MOVE  WS-EDIT-S2V999    TO AR94-SSPN-MAX-INTR-ITRO-RT    53360005
873234*    ELSE                                                         53370005
873235*        MOVE ZEROES             TO AR94-SSPN-MAX-INTR-ITRO-RT    53380005
873236*    END-IF                                                       53390005
873237*    IF AR93-SSPN-MAX-INTR-RGLR-RT IS NUMERIC                     53400005
873238*        MOVE AR93-SSPN-MAX-INTR-RGLR-RT TO  WS-EDIT-S2V999       53410005
873239*        MOVE  WS-EDIT-S2V999    TO AR94-SSPN-MAX-INTR-RGLR-RT    53420005
873240*    ELSE                                                         53430005
873241*        MOVE ZEROES             TO AR94-SSPN-MAX-INTR-RGLR-RT    53440005
873242*    END-IF                                                       53450005
873243************                                                      53460005
873244*    MOVE AR93-SSPN-MTHD-SET-NR  TO AR94-SSPN-MTHD-SET-NR         53470005
873245*    MOVE AR93-SSPN-FREZ-MPD-CD  TO AR94-SSPN-FREZ-MPD-CD         53480005
873246*    IF AR93-UNSS-DT             IS NUMERIC                       53490005
873247*        MOVE AR93-UNSS-DT       TO  WS-EDIT-S9                   53500005
873248*        MOVE  WS-EDIT-S9        TO AR94-UNSS-DT                  53510005
873249*    ELSE                                                         53520005
873250*        MOVE ZEROES             TO AR94-UNSS-DT                  53530005
873251*    END-IF                                                       53540005
873252*    MOVE AR93-SSPN-INT-RATE-CD  TO AR94-SSPN-INT-RATE-CD         53550005
873253*    MOVE AR93-SSPN-INT-MTHD-CD  TO AR94-SSPN-INT-MTHD-CD         53560005
873254*    MOVE AR93-SSPN-MPD-CD       TO AR94-SSPN-MPD-CD              53570005
873255*    MOVE AR93-SSPN-ITEM-FEES-CD TO AR94-SSPN-ITEM-FEES-CD        53580005
873256*    MOVE AR93-SSPN-PYFF-EXCP-CD TO AR94-SSPN-PYFF-EXCP-CD        53590005
873257*    MOVE AR93-SSPN-BASE-INT-CD  TO AR94-SSPN-BASE-INT-CD         53600005
873258*    IF AR93-SSPN-REBT-CD        IS NUMERIC                       53610005
873259*        MOVE AR93-SSPN-REBT-CD  TO  WS-EDIT-S1                   53620005
873260*        MOVE  WS-EDIT-S1        TO AR94-SSPN-REBT-CD             53630005
873261*    ELSE                                                         53640005
873262*        MOVE ZEROES             TO AR94-SSPN-REBT-CD             53650005
873263*    END-IF                                                       53660005
873264*    MOVE AR93-SSPN-BREK-RATE-CD TO AR94-SSPN-BREK-RATE-CD        53670005
873265*    IF AR93-SSPN-INT-ON-INT-CD IS NUMERIC                        53680005
873266*        MOVE AR93-SSPN-INT-ON-INT-CD TO AR94-SSPN-INT-ON-INT-CD  53690005
873267*    ELSE                                                         53700005
873268*        MOVE ZEROES             TO AR94-SSPN-INT-ON-INT-CD       53710005
873269*    END-IF                                                       53720005
873270*    MOVE AR93-SSPN-INTR-DFLT-CD TO AR94-SSPN-INTR-DFLT-CD        53730005
873271*    IF AR93-RTR-DSCL-CT         IS NUMERIC                       53740005
873272*        MOVE AR93-RTR-DSCL-CT   TO  WS-EDIT-S3                   53750005
873273*        MOVE  WS-EDIT-S3        TO AR94-RTR-DSCL-CT              53760005
873274*    ELSE                                                         53770005
873275*        MOVE ZEROES             TO AR94-RTR-DSCL-CT              53780005
873276*    END-IF                                                       53790005
873277*    IF AR93-POST-CLOS-DT        IS NUMERIC                       53800005
873278*       MOVE AR93-POST-CLOS-DT     TO  WS-EDIT-S9                 53810005
873279*       MOVE  WS-EDIT-S9           TO AR94-POST-CLOS-DT           53820005
873280*    ELSE                                                         53830005
873281*       MOVE ZEROES          TO AR94-POST-CLOS-DT                 53840005
873282*    END-IF                                                       53850005
873283*    IF AR93-RTR-DSCL-DT         IS NUMERIC                       53860005
873284*       MOVE AR93-RTR-DSCL-DT      TO  WS-EDIT-S9                 53870005
873285*       MOVE  WS-EDIT-S9           TO AR94-RTR-DSCL-DT            53880005
873286*    ELSE                                                         53890005
873287*       MOVE ZEROES          TO AR94-RTR-DSCL-DT                  53900005
873288*    END-IF                                                       53910005
873289************                                                      53920005
873290*    IF AR93-AMRT-MTRT-DT        IS NUMERIC                       53930005
873291*       MOVE AR93-AMRT-MTRT-DT     TO  WS-EDIT-S9                 53940005
873292*       MOVE  WS-EDIT-S9           TO AR94-AMRT-MTRT-DT           53950005
873293*    ELSE                                                         53960005
873294*       MOVE ZEROES          TO AR94-AMRT-MTRT-DT                 53970005
873295*    END-IF                                                       53980005
873296************                                                      53990005
873297*    IF AR93-DFP-FEE-SAVE-AM     IS NUMERIC                       54000005
873298*       MOVE AR93-DFP-FEE-SAVE-AM  TO  WS-EDIT-S15V99             54010005
873299*       MOVE  WS-EDIT-S15V99       TO AR94-DFP-FEE-SAVE-AM        54020005
873300*    ELSE                                                         54030005
873301*       MOVE SPACES          TO AR94-DFP-FEE-SAVE-AM              54040005
873302*    END-IF                                                       54050005
873303*    IF AR93-POB-BASE-CALC-AM    IS NUMERIC                       54060005
873304*       MOVE AR93-POB-BASE-CALC-AM TO  WS-EDIT-S15V99             54070005
873305*       MOVE  WS-EDIT-S15V99       TO AR94-POB-BASE-CALC-AM       54080005
873306*    ELSE                                                         54090005
873307*       MOVE ZEROES          TO AR94-POB-BASE-CALC-AM             54100005
873308*    END-IF                                                       54110005
873309*    IF AR93-POB-CALC-INTR-RT      IS NUMERIC                     54120005
873310*       MOVE AR93-POB-CALC-INTR-RT      TO  WS-EDIT-S2V999        54130005
873311*       MOVE  WS-EDIT-S2V999      TO AR94-POB-CALC-INTR-RT        54140005
873312*    ELSE                                                         54150005
873313*       MOVE ZEROES          TO AR94-POB-CALC-INTR-RT             54160005
873314*    END-IF                                                       54170005
873315*    IF AR93-POB-CALC-EXPR-DALY-RT IS NUMERIC                     54180005
873316*       MOVE AR93-POB-CALC-EXPR-DALY-RT TO  WS-EDIT-SV97          54190005
873317*       MOVE  WS-EDIT-SV97        TO AR94-POB-CALC-EXPR-DALY-RT   54200005
873318*    ELSE                                                         54210005
873319*       MOVE ZEROES          TO AR94-POB-CALC-EXPR-DALY-RT        54220005
873320*    END-IF                                                       54230005
873321*    IF AR93-EPO-RT                IS NUMERIC                     54240005
873322*       MOVE AR93-EPO-RT                TO  WS-EDIT-S11V94        54250005
873323*       MOVE  WS-EDIT-S11V94      TO AR94-EPO-RT                  54260005
873324*    ELSE                                                         54270005
873325*       MOVE ZEROES          TO AR94-EPO-RT                       54280005
873326*    END-IF                                                       54290005
873327*    IF AR93-EPO-AM                IS NUMERIC                     54300005
873328*       MOVE AR93-EPO-AM                TO  WS-EDIT-S13V94        54310005
873329*       MOVE  WS-EDIT-S13V94      TO AR94-EPO-AM                  54320005
873330*    ELSE                                                         54330005
873331*       MOVE ZEROES          TO AR94-EPO-AM                       54340005
873332*    END-IF                                                       54350005
873333*       MOVE AR93-VRBL-CD        TO AR94-VRBL-CD                  54360005
873334*       MOVE AR93-GOTO-VRBL-CD   TO AR94-GOTO-VRBL-CD             54370005
873335*                                                                 54380005
873336*       MOVE AR93-LOAN-TYPE-CD   TO AR94-LOAN-TYPE-CD             54390005
873337*                                                                 54400005
873338*    IF AR93-LS-HIST-INTR-AM     IS NUMERIC                       54410005
873339*       MOVE AR93-LS-HIST-INTR-AM  TO  WS-EDIT-S15V99             54420005
873340*       MOVE  WS-EDIT-S15V99       TO AR94-LS-HIST-INTR-AM        54430005
873341*    ELSE                                                         54440005
873342*       MOVE SPACES          TO AR94-LS-HIST-INTR-AM              54450005
873343*    END-IF                                                       54460005
873344*    IF AR93-LS-HIST-PRIN-AM     IS NUMERIC                       54470005
873345*       MOVE AR93-LS-HIST-PRIN-AM  TO  WS-EDIT-S15V99             54480005
873346*       MOVE  WS-EDIT-S15V99       TO AR94-LS-HIST-PRIN-AM        54490005
873347*    ELSE                                                         54500005
873348*       MOVE SPACES          TO AR94-LS-HIST-PRIN-AM              54510005
873349*    END-IF                                                       54520005
873350*    IF AR93-LS-HIST-FEE-AM      IS NUMERIC                       54530005
873351*       MOVE AR93-LS-HIST-FEE-AM   TO  WS-EDIT-S15V99             54540005
873352*       MOVE  WS-EDIT-S15V99       TO AR94-LS-HIST-FEE-AM         54550005
873353*    ELSE                                                         54560005
873354*       MOVE SPACES          TO AR94-LS-HIST-FEE-AM               54570005
873355*    END-IF                                                       54580005
873356*    IF AR93-LS-HIST-RMPD-INTR-AM IS NUMERIC                      54590005
873357*       MOVE AR93-LS-HIST-RMPD-INTR-AM TO  WS-EDIT-S15V99         54600005
873358*       MOVE  WS-EDIT-S15V99       TO AR94-LS-HIST-RMPD-INTR-AM   54610005
873359*    ELSE                                                         54620005
873360*       MOVE SPACES          TO AR94-LS-HIST-RMPD-INTR-AM         54630005
873361*    END-IF                                                       54640005
873362*    IF AR93-LS-HIST-RMPD-PRIN-AM IS NUMERIC                      54650005
873363*       MOVE AR93-LS-HIST-RMPD-PRIN-AM TO  WS-EDIT-S15V99         54660005
873364*       MOVE  WS-EDIT-S15V99       TO AR94-LS-HIST-RMPD-PRIN-AM   54670005
873365*    ELSE                                                         54680005
873366*       MOVE SPACES          TO AR94-LS-HIST-RMPD-PRIN-AM         54690005
873367*    END-IF                                                       54700005
873368*    IF AR93-LS-HIST-RMPD-FEE-AM IS NUMERIC                       54710005
873369*       MOVE AR93-LS-HIST-RMPD-FEE-AM TO  WS-EDIT-S15V99          54720005
873370*       MOVE  WS-EDIT-S15V99       TO AR94-LS-HIST-RMPD-FEE-AM    54730005
873371*    ELSE                                                         54740005
873372*       MOVE SPACES          TO AR94-LS-HIST-RMPD-FEE-AM          54750005
873373*    END-IF                                                       54760005
873374*    IF AR93-LS-HIST-DMPD-INTR-AM IS NUMERIC                      54770005
873375*       MOVE AR93-LS-HIST-DMPD-INTR-AM TO  WS-EDIT-S15V99         54780005
873376*       MOVE  WS-EDIT-S15V99       TO AR94-LS-HIST-DMPD-INTR-AM   54790005
873377*    ELSE                                                         54800005
873378*       MOVE SPACES          TO AR94-LS-HIST-DMPD-INTR-AM         54810005
873379*    END-IF                                                       54820005
873380*    IF AR93-LS-HIST-DMPD-PRIN-AM IS NUMERIC                      54830005
873381*       MOVE AR93-LS-HIST-DMPD-PRIN-AM TO  WS-EDIT-S15V99         54840005
873382*       MOVE  WS-EDIT-S15V99       TO AR94-LS-HIST-DMPD-PRIN-AM   54850005
873383*    ELSE                                                         54860005
873384*       MOVE SPACES          TO AR94-LS-HIST-DMPD-PRIN-AM         54870005
873385*    END-IF                                                       54880005
873386*    IF AR93-LS-HIST-DMPD-FEE-AM IS NUMERIC                       54890005
873387*       MOVE AR93-LS-HIST-DMPD-FEE-AM TO  WS-EDIT-S15V99          54900005
873388*       MOVE  WS-EDIT-S15V99       TO AR94-LS-HIST-DMPD-FEE-AM    54910005
873389*    ELSE                                                         54920005
873390*       MOVE SPACES          TO AR94-LS-HIST-DMPD-FEE-AM          54930005
873391*    END-IF                                                       54940005
873392*    IF AR93-LS-HIST-PYMT-INTR-AM IS NUMERIC                      54950005
873393*       MOVE AR93-LS-HIST-PYMT-INTR-AM TO  WS-EDIT-S15V99         54960005
873394*       MOVE  WS-EDIT-S15V99       TO AR94-LS-HIST-PYMT-INTR-AM   54970005
873395*    ELSE                                                         54980005
873396*       MOVE SPACES          TO AR94-LS-HIST-PYMT-INTR-AM         54990005
873397*    END-IF                                                       55000005
873398*    IF AR93-LS-HIST-PYMT-PRIN-AM IS NUMERIC                      55010005
873399*       MOVE AR93-LS-HIST-PYMT-PRIN-AM TO  WS-EDIT-S15V99         55020005
873400*       MOVE  WS-EDIT-S15V99       TO AR94-LS-HIST-PYMT-PRIN-AM   55030005
873401*    ELSE                                                         55040005
873402*       MOVE SPACES          TO AR94-LS-HIST-PYMT-PRIN-AM         55050005
873403*    END-IF                                                       55060005
873404*    IF AR93-LS-HIST-PYMT-FEE-AM IS NUMERIC                       55070005
873405*       MOVE AR93-LS-HIST-PYMT-FEE-AM TO  WS-EDIT-S15V99          55080005
873406*       MOVE  WS-EDIT-S15V99       TO AR94-LS-HIST-PYMT-FEE-AM    55090005
873407*    ELSE                                                         55100005
873408*       MOVE SPACES          TO AR94-LS-HIST-PYMT-FEE-AM          55110005
873409*    END-IF                                                       55120005
873410*    IF AR93-YTD-BLLD-INTR-AM    IS NUMERIC                       55130005
873411*       MOVE AR93-YTD-BLLD-INTR-AM TO  WS-EDIT-S15V99             55140005
873412*       MOVE  WS-EDIT-S15V99       TO AR94-YTD-BLLD-INTR-AM       55150005
873413*    ELSE                                                         55160005
873414*       MOVE SPACES          TO AR94-YTD-BLLD-INTR-AM             55170005
873415*    END-IF                                                       55180005
873416*    IF AR93-PY-BLLD-INTR-AM     IS NUMERIC                       55190005
873417*       MOVE AR93-PY-BLLD-INTR-AM  TO  WS-EDIT-S15V99             55200005
873418*       MOVE  WS-EDIT-S15V99       TO AR94-PY-BLLD-INTR-AM        55210005
873419*    ELSE                                                         55220005
873420*       MOVE SPACES          TO AR94-PY-BLLD-INTR-AM              55230005
873421*    END-IF                                                       55240005
873422*    IF AR93-LS-HIST-POB-RATE-AM IS NUMERIC                       55250005
873423*       MOVE AR93-LS-HIST-POB-RATE-AM TO  WS-EDIT-S15V99          55260005
873424*       MOVE  WS-EDIT-S15V99       TO AR94-LS-HIST-POB-RATE-AM    55270005
873425*    ELSE                                                         55280005
873426*       MOVE SPACES          TO AR94-LS-HIST-POB-RATE-AM          55290005
873427*    END-IF                                                       55300005
873428*    IF AR93-YTD-PAID-PRIN-AM    IS NUMERIC                       55310005
873429*       MOVE AR93-YTD-PAID-PRIN-AM TO  WS-EDIT-S15V99             55320005
873430*       MOVE  WS-EDIT-S15V99       TO AR94-YTD-PAID-PRIN-AM       55330005
873431*    ELSE                                                         55340005
873432*       MOVE SPACES          TO AR94-YTD-PAID-PRIN-AM             55350005
873433*    END-IF                                                       55360005
873434*       MOVE AR93-UNIQ-MNTH-BLNC-CD TO AR94-UNIQ-MNTH-BLNC-CD     55370005
873435*    IF AR93-BLNC-OPEN-DT      IS NUMERIC                         55380005
873436*        MOVE AR93-BLNC-OPEN-DT   TO  WS-EDIT-S9                  55390005
873437*        MOVE  WS-EDIT-S9        TO AR94-BLNC-OPEN-DT             55400005
873438*    ELSE                                                         55410005
873439*        MOVE SPACES             TO AR94-BLNC-OPEN-DT             55420005
873440*    END-IF                                                       55430005
873441*                                                                 55440005
873442*       MOVE AR93-CLASS-DR       TO AR94-CLASS-DR                 55450005
873443*       MOVE AR93-CLASS-DATE     TO AR94-CLASS-DATE               55460005
873444*       MOVE AR93-CLASS-DATE-5   TO AR94-CLASS-DATE-5             55470005
873445*       MOVE AR93-INT-ON-INT     TO AR94-INT-ON-INT               55480005
873446*       MOVE AR93-MUF-TYPE       TO AR94-MUF-TYPE                 55490005
873447*       MOVE AR93-PRCNG-STRAT-ID TO AR94-PRCNG-STRAT-ID           55500005
873448************                                                      55510005
873449*    IF AR93-CURR-TOTAL-DELQ     IS NUMERIC                       55520005
873450*       MOVE AR93-CURR-TOTAL-DELQ  TO  WS-EDIT-S15V99             55530005
873451*       MOVE  WS-EDIT-S15V99       TO AR94-CURR-TOTAL-DELQ        55540005
873452*    ELSE                                                         55550005
873453*       MOVE SPACES          TO AR94-CURR-TOTAL-DELQ              55560005
873454*    END-IF                                                       55570005
873455*    IF AR93-CURR-UNPAID-BPD     IS NUMERIC                       55580005
873456*       MOVE AR93-CURR-UNPAID-BPD  TO  WS-EDIT-S15V99             55590005
873457*       MOVE  WS-EDIT-S15V99       TO AR94-CURR-UNPAID-BPD        55600005
873458*    ELSE                                                         55610005
873459*       MOVE SPACES          TO AR94-CURR-UNPAID-BPD              55620005
873460*    END-IF                                                       55630005
873461*    IF AR93-CURR-UNPAID-INTSC   IS NUMERIC                       55640005
873462*       MOVE AR93-CURR-UNPAID-INTSC TO  WS-EDIT-S11V99            55650005
873463*       MOVE  WS-EDIT-S11V99       TO AR94-CURR-UNPAID-INTSC      55660005
873464*    ELSE                                                         55670005
873465*       MOVE SPACES          TO AR94-CURR-UNPAID-INTSC            55680005
873466*    END-IF                                                       55690005
873467************                                                      55700005
873468*    IF AR93-BINT                IS NUMERIC                       55710005
873469*       MOVE AR93-BINT             TO  WS-EDIT-S15V99             55720005
873470*       MOVE  WS-EDIT-S15V99       TO AR94-BINT                   55730005
873471*    ELSE                                                         55740005
873472*       MOVE SPACES          TO AR94-BINT                         55750005
873473*    END-IF                                                       55760005
873474****************                                                  55770005
873475*    IF AR93-REPORTABLE-INT      IS NUMERIC                       55780005
873476*       MOVE AR93-REPORTABLE-INT   TO  WS-EDIT-S11V99             55790005
873477*       MOVE  WS-EDIT-S11V99       TO AR94-REPORTABLE-INT         55800005
873478*    ELSE                                                         55810005
873479*       MOVE SPACES          TO AR94-REPORTABLE-INT               55820005
873480*    END-IF                                                       55830005
873481*    IF AR93-CTD-PRIN            IS NUMERIC                       55840005
873482*       MOVE AR93-CTD-PRIN         TO  WS-EDIT-S15V99             55850005
873483*       MOVE  WS-EDIT-S15V99       TO AR94-CTD-PRIN               55860005
873484*    ELSE                                                         55870005
873485*       MOVE ZEROES          TO AR94-CTD-PRIN                     55880005
873486*    END-IF                                                       55890005
873487*    IF AR93-OLD-PRIN            IS NUMERIC                       55900005
873488*       MOVE AR93-OLD-PRIN         TO  WS-EDIT-S15V99             55910005
873489*       MOVE  WS-EDIT-S15V99       TO AR94-OLD-PRIN               55920005
873490*    ELSE                                                         55930005
873491*       MOVE ZEROES          TO AR94-OLD-PRIN                     55940005
873492*    END-IF                                                       55950005
873493*    IF AR93-CTD-ITEM-FEES       IS NUMERIC                       55960005
873494*       MOVE AR93-CTD-ITEM-FEES    TO  WS-EDIT-S11V99             55970005
873495*       MOVE  WS-EDIT-S11V99       TO AR94-CTD-ITEM-FEES          55980005
873496*    ELSE                                                         55990005
873497*       MOVE ZEROES          TO AR94-CTD-ITEM-FEES                56000005
873498*    END-IF                                                       56010005
873499*    IF AR93-DISPUTE-AMOUNT      IS NUMERIC                       56020005
873500*       MOVE AR93-DISPUTE-AMOUNT   TO  WS-EDIT-S15V99             56030005
873501*       MOVE  WS-EDIT-S15V99       TO AR94-DISPUTE-AMOUNT         56040005
873502*    ELSE                                                         56050005
873503*       MOVE ZEROES          TO AR94-DISPUTE-AMOUNT               56060005
873504*    END-IF                                                       56070005
873505*    IF AR93-CRRN-BLNC-AM        IS NUMERIC                       56080005
873506*       MOVE AR93-CRRN-BLNC-AM     TO  WS-EDIT-S15V99             56090005
873507*       MOVE  WS-EDIT-S15V99       TO AR94-CRRN-BLNC-AM           56100005
873508*    ELSE                                                         56110005
873509*       MOVE SPACES          TO AR94-CRRN-BLNC-AM                 56120005
873510*    END-IF                                                       56130005
873511****************                                                  56140005
873512*    IF AR93-CTD-LATE-CHRG-AM    IS NUMERIC                       56150005
873513*       MOVE AR93-CTD-LATE-CHRG-AM TO  WS-EDIT-S15V99             56160005
873514*       MOVE  WS-EDIT-S15V99       TO AR94-CTD-LATE-CHRG-AM       56170005
873515*    ELSE                                                         56180005
873516*       MOVE SPACES          TO AR94-CTD-LATE-CHRG-AM             56190005
873517*    END-IF                                                       56200005
873518*    IF AR93AP-UNPD-LATE-CHRG-AM IS NUMERIC                       56210005
873519*       MOVE AR93AP-UNPD-LATE-CHRG-AM TO  WS-EDIT-S15V99          56220005
873520*       MOVE  WS-EDIT-S15V99       TO AR94AP-UNPD-LATE-CHRG-AM    56230005
873521*    ELSE                                                         56240005
873522*       MOVE SPACES          TO AR94AP-UNPD-LATE-CHRG-AM          56250005
873523*    END-IF                                                       56260005
873524*    IF AR93-CTD-OVRL-CHRG-AM    IS NUMERIC                       56270005
873525*       MOVE AR93-CTD-OVRL-CHRG-AM    TO  WS-EDIT-S15V99          56280005
873526*       MOVE  WS-EDIT-S15V99       TO AR94-CTD-OVRL-CHRG-AM       56290005
873527*    ELSE                                                         56300005
873528*       MOVE SPACES          TO AR94-CTD-OVRL-CHRG-AM             56310005
873529*    END-IF                                                       56320005
873530*    IF AR93AP-UNPD-OVRL-CHRG-AM IS NUMERIC                       56330005
873531*       MOVE AR93AP-UNPD-OVRL-CHRG-AM TO  WS-EDIT-S15V99          56340005
873532*       MOVE  WS-EDIT-S15V99       TO AR94AP-UNPD-OVRL-CHRG-AM    56350005
873533*    ELSE                                                         56360005
873534*       MOVE SPACES          TO AR94AP-UNPD-OVRL-CHRG-AM          56370005
873535*    END-IF                                                       56380005
873536*    IF AR93AP-UNPD-CRDT-LIFE-AM IS NUMERIC                       56390005
873537*       MOVE AR93AP-UNPD-CRDT-LIFE-AM TO  WS-EDIT-S15V99          56400005
873538*       MOVE  WS-EDIT-S15V99       TO AR94AP-UNPD-CRDT-LIFE-AM    56410005
873539*    ELSE                                                         56420005
873540*       MOVE SPACES          TO AR94AP-UNPD-CRDT-LIFE-AM          56430005
873541*    END-IF                                                       56440005
873542*    IF AR93-CTD-MSCL-CHRG-AM    IS NUMERIC                       56450005
873543*       MOVE AR93-CTD-MSCL-CHRG-AM    TO  WS-EDIT-S15V99          56460005
873544*       MOVE  WS-EDIT-S15V99       TO AR94-CTD-MSCL-CHRG-AM       56470005
873545*    ELSE                                                         56480005
873546*       MOVE SPACES          TO AR94-CTD-MSCL-CHRG-AM             56490005
873547*    END-IF                                                       56500005
873548*    IF AR93AP-UNPD-MSCL-CHRG-AM IS NUMERIC                       56510005
873549*       MOVE AR93AP-UNPD-MSCL-CHRG-AM TO  WS-EDIT-S15V99          56520005
873550*       MOVE  WS-EDIT-S15V99       TO AR94AP-UNPD-MSCL-CHRG-AM    56530005
873551*    ELSE                                                         56540005
873552*       MOVE SPACES          TO AR94AP-UNPD-MSCL-CHRG-AM          56550005
873553*    END-IF                                                       56560005
873554*    IF AR93-CTD-ANNL-CHRG-AM    IS NUMERIC                       56570005
873555*       MOVE AR93-CTD-ANNL-CHRG-AM    TO  WS-EDIT-S15V99          56580005
873556*       MOVE  WS-EDIT-S15V99       TO AR94-CTD-ANNL-CHRG-AM       56590005
873557*    ELSE                                                         56600005
873558*       MOVE SPACES          TO AR94-CTD-ANNL-CHRG-AM             56610005
873559*    END-IF                                                       56620005
873560*    IF AR94AP-UNPD-ANNL-CHRG-AM IS NUMERIC                       56630005
873561*       MOVE AR94AP-UNPD-ANNL-CHRG-AM TO  WS-EDIT-S15V99          56640005
873562*       MOVE  WS-EDIT-S15V99       TO AR94AP-UNPD-ANNL-CHRG-AM    56650005
873563*    ELSE                                                         56660005
873564*       MOVE ZEROES          TO AR94AP-UNPD-ANNL-CHRG-AM          56670005
873565*    END-IF                                                       56680005
873566*    IF AR93-CTD-SRCHG-AM        IS NUMERIC                       56690005
873567*       MOVE AR93-CTD-SRCHG-AM        TO  WS-EDIT-S15V99          56700005
873568*       MOVE  WS-EDIT-S15V99       TO AR94-CTD-SRCHG-AM           56710005
873569*    ELSE                                                         56720005
873570*       MOVE ZEROES          TO AR94-CTD-SRCHG-AM                 56730005
873571*    END-IF                                                       56740005
873572*    IF AR93AP-UNPD-SRCHG-AM     IS NUMERIC                       56750005
873573*       MOVE AR93AP-UNPD-SRCHG-AM     TO  WS-EDIT-S15V99          56760005
873574*       MOVE  WS-EDIT-S15V99       TO AR94AP-UNPD-SRCHG-AM        56770005
873575*    ELSE                                                         56780005
873576*       MOVE ZEROES          TO AR94AP-UNPD-SRCHG-AM              56790005
873577*    END-IF                                                       56800005
873578*    IF AR93AP-UNPD-ITEM-CHRG-AM IS NUMERIC                       56810005
873579*       MOVE AR93AP-UNPD-ITEM-CHRG-AM TO  WS-EDIT-S15V99          56820005
873580*       MOVE  WS-EDIT-S15V99       TO AR94AP-UNPD-ITEM-CHRG-AM    56830005
873581*    ELSE                                                         56840005
873582*       MOVE ZEROES          TO AR94AP-UNPD-ITEM-CHRG-AM          56850005
873583*    END-IF                                                       56860005
873584*    IF AR93-DLNQ-CYCL-NR        IS NUMERIC                       56870005
873585*       MOVE AR93-DLNQ-CYCL-NR   TO  WS-EDIT-S3                   56880005
873586*       MOVE WS-EDIT-S3       TO AR94-DLNQ-CYCL-NR                56890005
873587*    ELSE                                                         56900005
873588*       MOVE ZEROES          TO AR94-DLNQ-CYCL-NR                 56910005
873589*    END-IF                                                       56920005
873590*    IF AR93-PYMN-LQDT-AM  IS NUMERIC                             56930005
873591*       MOVE AR93-PYMN-LQDT-AM  TO  WS-EDIT-S15V99                56940005
873592*       MOVE  WS-EDIT-S15V99   TO AR94-PYMN-LQDT-AM               56950005
873593*    ELSE                                                         56960005
873594*       MOVE ZEROES          TO AR94-PYMN-LQDT-AM                 56970005
873595*    END-IF                                                       56980005
873596*    IF AR93-CRDT-BLNC-AM  IS NUMERIC                             56990005
873597*       MOVE AR93-CRDT-BLNC-AM  TO  WS-EDIT-S15V99                57000005
873598*       MOVE  WS-EDIT-S15V99   TO AR94-CRDT-BLNC-AM               57010005
873599*    ELSE                                                         57020005
873600*       MOVE ZEROES          TO AR94-CRDT-BLNC-AM                 57030005
873601*    END-IF                                                       57040005
873602*    IF AR93-CTD-SPCF-CRDT-AM  IS NUMERIC                         57050005
873603*       MOVE AR93-CTD-SPCF-CRDT-AM TO  WS-EDIT-S15V99             57060005
873604*       MOVE  WS-EDIT-S15V99    TO AR94-CTD-SPCF-CRDT-AM          57070005
873605*    ELSE                                                         57080005
873606*       MOVE ZEROES          TO AR94-CTD-SPCF-CRDT-AM             57090005
873607*    END-IF                                                       57100005
873608*    IF AR93-PRMT-PYMT-WAIV-INT-AM IS  NUMERIC                    57110005
873609*       MOVE AR93-PRMT-PYMT-WAIV-INT-AM TO  WS-EDIT-S15V99        57120005
873610*       MOVE  WS-EDIT-S15V99      TO AR94-PRMT-PYMT-WAIV-INT-AM   57130005
873611*    ELSE                                                         57140005
873612*       MOVE ZEROES          TO AR94-PRMT-PYMT-WAIV-INT-AM        57150005
873613*    END-IF                                                       57160005
873614*    IF AR93-FEE-INTR-BRNG-AM  IS  NUMERIC                        57170005
873615*       MOVE AR93-FEE-INTR-BRNG-AM  TO  WS-EDIT-S15V99            57180005
873616*       MOVE  WS-EDIT-S15V99    TO AR94-FEE-INTR-BRNG-AM          57190005
873617*    ELSE                                                         57200005
873618*       MOVE ZEROES          TO AR94-FEE-INTR-BRNG-AM             57210005
873619*    END-IF                                                       57220005
873620*       MOVE AR93-FULL-BAL-DSPT-CD  TO AR94-FULL-BAL-DSPT-CD      57230005
873621*       MOVE AR93-PRCH-AGRM-TYPE-ID TO AR94-PRCH-AGRM-TYPE-ID     57240005
873622*       MOVE AR93-PRCH-AGRM-SQNC-NM TO AR94-PRCH-AGRM-SQNC-NM     57250005
873623*    IF AR93-PRJC-CARD-SQNC-NR   IS NUMERIC                       57260005
873624*       MOVE AR93-PRJC-CARD-SQNC-NR TO WS-EDIT-S3                 57270005
873625*       MOVE WS-EDIT-S3       TO AR93-PRJC-CARD-SQNC-NR           57280005
873626*    ELSE                                                         57290005
873627*       MOVE ZEROES          TO AR93-PRJC-CARD-SQNC-NR            57300005
873628*    END-IF                                                       57310005
873629*    IF AR93-DSBR-AM    IS NUMERIC                                57320005
873630*       MOVE AR93-DSBR-AM  TO WS-EDIT-S15V99                      57330005
873631*       MOVE WS-EDIT-S15V99   TO AR94-DSBR-AM                     57340005
873632*    ELSE                                                         57350005
873633*       MOVE ZEROES           TO AR94-DSBR-AM                     57360005
873634*    END-IF                                                       57370005
873635*    IF AR93-DSBR-CT    IS NUMERIC                                57380005
873636*       MOVE AR93-DSBR-CT  TO WS-EDIT-S3                          57390005
873637*       MOVE WS-EDIT-S3       TO AR94-DSBR-CT                     57400005
873638*    ELSE                                                         57410005
873639*       MOVE ZEROES           TO AR94-DSBR-CT                     57420005
873640*    END-IF                                                       57430005
873641*    IF AR93-DSBR-TOTL-CT   IS  NUMERIC                           57440005
873642*       MOVE AR93-DSBR-TOTL-CT      TO WS-EDIT-S3                 57450005
873643*       MOVE WS-EDIT-S3            TO AR94-DSBR-TOTL-CT           57460005
873644*    ELSE                                                         57470005
873645*       MOVE ZEROES           TO AR94-DSBR-TOTL-CT                57480005
873646*    END-IF                                                       57490005
873647*       MOVE AR93-DSBR-LCTN-CD  TO AR94-DSBR-LCTN-CD              57500005
873648*    IF AR93-HOLD-DSPT-UNBL-INT   IS NUMERIC                      57510005
873649*       MOVE AR93-HOLD-DSPT-UNBL-INT TO  WS-EDIT-S11V99           57520005
873650*       MOVE  WS-EDIT-S11V99       TO AR94-HOLD-DSPT-UNBL-INT     57530005
873651*    ELSE                                                         57540005
873652*       MOVE SPACES          TO AR94-HOLD-DSPT-UNBL-INT           57550005
873653*    END-IF                                                       57560005
873654*    IF AR93-PREV-HOLD-DSPT-UNBL-INT IS NUMERIC                   57570005
873655*       MOVE AR93-PREV-HOLD-DSPT-UNBL-INT TO WS-EDIT-S11V99       57580005
873656*       MOVE  WS-EDIT-S11V99      TO AR94-PREV-HOLD-DSPT-UNBL-INT 57590005
873657*    ELSE                                                         57600005
873658*       MOVE SPACES          TO AR94-PREV-HOLD-DSPT-UNBL-INT      57610005
873659*    END-IF                                                       57620005
873660*       MOVE AR93-PRMT-INT-CRDT-CD  TO AR94-PRMT-INT-CRDT-CD      57630005
873661*    IF AR93-PRMT-INT-CRDT-END-DT  IS NUMERIC                     57640005
873662*       MOVE AR93-PRMT-INT-CRDT-END-DT TO WS-EDIT-S7              57650005
873663*       MOVE  WS-EDIT-S7      TO AR94-PRMT-INT-CRDT-END-DT        57660005
873664*    ELSE                                                         57670005
873665*       MOVE SPACES          TO AR94-PRMT-INT-CRDT-END-DT         57680005
873666*    END-IF                                                       57690005
873667*    IF AR93-PRMT-EXPR-DT        IS NUMERIC                       57700005
873668*       MOVE AR93-PRMT-EXPR-DT          TO WS-EDIT-S7             57710005
873669*       MOVE  WS-EDIT-S7      TO AR94-PRMT-EXPR-DT                57720005
873670*    ELSE                                                         57730005
873671*       MOVE SPACES          TO AR94-PRMT-EXPR-DT                 57740005
873672*    END-IF                                                       57750005
873673****************                                                  57760005
873674*    IF AR93LS-OLD-PRIN           IS NUMERIC                      57770005
873675*       MOVE AR93LS-OLD-PRIN        TO  WS-EDIT-S15V99            57780005
873676*       MOVE  WS-EDIT-S15V99       TO AR94LS-OLD-PRIN             57790005
873677*    ELSE                                                         57800005
873678*       MOVE SPACES          TO AR94LS-OLD-PRIN                   57810005
873679*    END-IF                                                       57820005
873680*    IF AR93LS-BILLED-INT         IS NUMERIC                      57830005
873681*       MOVE AR93LS-BILLED-INT      TO  WS-EDIT-S11V99            57840005
873682*       MOVE  WS-EDIT-S11V99       TO AR94LS-BILLED-INT           57850005
873683*    ELSE                                                         57860005
873684*       MOVE SPACES          TO AR94LS-BILLED-INT                 57870005
873685*    END-IF                                                       57880005
873686*    IF AR93LS-UNPAID-INTSC       IS NUMERIC                      57890005
873687*       MOVE AR93LS-UNPAID-INTSC    TO  WS-EDIT-S11V99            57900005
873688*       MOVE  WS-EDIT-S11V99       TO AR94LS-UNPAID-INTSC         57910005
873689*    ELSE                                                         57920005
873690*       MOVE SPACES          TO AR94LS-UNPAID-INTSC               57930005
873691*    END-IF                                                       57940005
873692*    IF AR93LS-BPD                IS NUMERIC                      57950005
873693*       MOVE AR93LS-BPD             TO  WS-EDIT-S15V99            57960005
873694*       MOVE  WS-EDIT-S15V99       TO AR94LS-BPD                  57970005
873695*    ELSE                                                         57980005
873696*       MOVE SPACES          TO AR94LS-BPD                        57990005
873697*    END-IF                                                       58000005
873698*    IF AR93LS-TOTAL-DELQ         IS NUMERIC                      58010005
873699*       MOVE AR93LS-TOTAL-DELQ      TO  WS-EDIT-S15V99            58020005
873700*       MOVE  WS-EDIT-S15V99       TO AR94LS-TOTAL-DELQ           58030005
873701*    ELSE                                                         58040005
873702*       MOVE SPACES          TO AR94LS-TOTAL-DELQ                 58050005
873703*    END-IF                                                       58060005
873704*    IF AR93LS-ACCRUED-UNBILLED-INT IS  NUMERIC                   58070005
873705*       MOVE AR93LS-ACCRUED-UNBILLED-INT TO WS-EDIT-S11V99        58080005
873706*       MOVE  WS-EDIT-S11V99     TO AR94LS-ACCRUED-UNBILLED-INT   58090005
873707*    ELSE                                                         58100005
873708*       MOVE SPACES          TO AR94LS-ACCRUED-UNBILLED-INT       58110005
873709*    END-IF                                                       58120005
873710*    IF AR93LS-ITEM-FEES        IS  NUMERIC                       58130005
873711*       MOVE AR93LS-ITEM-FEES          TO WS-EDIT-S11V99          58140005
873712*       MOVE  WS-EDIT-S11V99     TO AR94LS-ITEM-FEES              58150005
873713*    ELSE                                                         58160005
873714*       MOVE SPACES          TO AR94LS-ITEM-FEES                  58170005
873715*    END-IF                                                       58180005
873716*    IF AR93LS-REPORTABLE-INT   IS  NUMERIC                       58190005
873717*       MOVE AR93LS-REPORTABLE-INT     TO WS-EDIT-S11V99          58200005
873718*       MOVE  WS-EDIT-S11V99     TO AR94LS-REPORTABLE-INT         58210005
873719*    ELSE                                                         58220005
873720*       MOVE SPACES          TO AR94LS-REPORTABLE-INT             58230005
873721*    END-IF                                                       58240005
873722*    IF AR93LS-DEFERRED-CR-LIFE IS  NUMERIC                       58250005
873723*       MOVE AR93LS-DEFERRED-CR-LIFE   TO WS-EDIT-S11V99          58260005
873724*       MOVE  WS-EDIT-S11V99     TO AR94LS-DEFERRED-CR-LIFE       58270005
873725*    ELSE                                                         58280005
873726*       MOVE SPACES          TO AR94LS-DEFERRED-CR-LIFE           58290005
873727*    END-IF                                                       58300005
873728*    IF AR93LS-DEF-ADB          IS  NUMERIC                       58310005
873729*       MOVE AR93LS-DEF-ADB          TO WS-EDIT-S15V99            58320005
873730*       MOVE  WS-EDIT-S15V99     TO AR94LS-DEF-ADB                58330005
873731*    ELSE                                                         58340005
873732*       MOVE SPACES          TO AR94LS-DEF-ADB                    58350005
873733*    END-IF                                                       58360005
873734*    IF AR93LS-CYC-PRIN         IS  NUMERIC                       58370005
873735*       MOVE AR93LS-CYC-PRIN         TO WS-EDIT-S15V99            58380005
873736*       MOVE  WS-EDIT-S15V99     TO AR94LS-CYC-PRIN               58390005
873737*    ELSE                                                         58400005
873738*       MOVE SPACES          TO AR94LS-CYC-PRIN                   58410005
873739*    END-IF                                                       58420005
873740****************                                                  58430005
873741*    IF AR93-LS-DISPUTE-AMOUNT    IS NUMERIC                      58440005
873742*       MOVE AR93-LS-DISPUTE-AMOUNT TO  WS-EDIT-S15V99            58450005
873743*       MOVE  WS-EDIT-S15V99       TO AR94-LS-DISPUTE-AMOUNT      58460005
873744*    ELSE                                                         58470005
873745*       MOVE SPACES          TO AR94-LS-DISPUTE-AMOUNT            58480005
873746*    END-IF                                                       58490005
873747*************                                                     58500005
873748*    IF AR93LS-UNBD-ITEM-FEE-AM   IS NUMERIC                      58510005
873749*       MOVE AR93LS-UNBD-ITEM-FEE-AM TO  WS-EDIT-S11V99           58520005
873750*       MOVE  WS-EDIT-S11V99       TO AR94-LS-DISPUTE-AMOUNT      58530005
873751*    ELSE                                                         58540005
873752*       MOVE ZEROES          TO AR94LS-UNBD-ITEM-FEE-AM           58550005
873753*    END-IF                                                       58560005
873754*    IF AR93LS-TRANS-AMT       IS NUMERIC                         58570005
873755*       MOVE AR93LS-TRANS-AMT      TO  WS-EDIT-S15V99             58580005
873756*       MOVE  WS-EDIT-S15V99       TO AR93LS-TRANS-AMT            58590005
873757*    ELSE                                                         58600005
873758*       MOVE ZEROES          TO AR94LS-TRANS-AMT                  58610005
873759*    END-IF                                                       58620005
873760*    IF AR93LS-REAL-INT-AM     IS NUMERIC                         58630005
873761*       MOVE AR93LS-REAL-INT-AM    TO  WS-EDIT-S15V99             58640005
873762*       MOVE  WS-EDIT-S15V99       TO AR94LS-REAL-INT-AM          58650005
873763*    ELSE                                                         58660005
873764*       MOVE ZEROES          TO AR94LS-REAL-INT-AM                58670005
873765*    END-IF                                                       58680005
873766*       MOVE AR93-LS-RTRN-TO-RVLV-CD TO AR94-LS-RTRN-TO-RVLV-CD   58690005
873767*    IF AR93LS-DEFR-CRDT-LIFE-BASE-AM IS NUMERIC                  58700005
873768*       MOVE AR93LS-DEFR-CRDT-LIFE-BASE-AM TO WS-EDIT-S15V99      58710005
873769*       MOVE  WS-EDIT-S15V99   TO AR94LS-DEFR-CRDT-LIFE-BASE-AM   58720005
873770*    ELSE                                                         58730005
873771*       MOVE ZEROES          TO AR94LS-DEFR-CRDT-LIFE-BASE-AM     58740005
873772*    END-IF                                                       58750005
873773*    IF AR93LS-BLLD-INTR-AM       IS NUMERIC                      58760005
873774*       MOVE AR93LS-BLLD-INTR-AM      TO WS-EDIT-S11V99           58770005
873775*       MOVE  WS-EDIT-S11V99   TO AR94LS-BLLD-INTR-AM             58780005
873776*    ELSE                                                         58790005
873777*       MOVE ZEROES          TO AR94LS-BLLD-INTR-AM               58800005
873778*    END-IF                                                       58810005
873779*    IF AR93LS-FLAP-ADB-AM        IS NUMERIC                      58820005
873780*       MOVE AR93LS-FLAP-ADB-AM       TO WS-EDIT-S15V99           58830005
873781*       MOVE  WS-EDIT-S15V99   TO AR94LS-FLAP-ADB-AM              58840005
873782*    ELSE                                                         58850005
873783*       MOVE ZEROES          TO AR94LS-FLAP-ADB-AM                58860005
873784*    END-IF                                                       58870005
873785*************                                                     58880005
873786*************                                                     58890005
873787*    IF AR93-LS-BLNC-AM           IS NUMERIC                      58900005
873788*       MOVE AR93-LS-BLNC-AM        TO  WS-EDIT-S15V99            58910005
873789*       MOVE  WS-EDIT-S15V99       TO AR94-LS-BLNC-AM             58920005
873790*    ELSE                                                         58930005
873791*       MOVE ZEROES          TO AR94-LS-BLNC-AM                   58940005
873792*    END-IF                                                       58950005
873793*    IF AR93LS-LATE-CHRG-AM       IS NUMERIC                      58960005
873794*       MOVE AR93LS-LATE-CHRG-AM    TO  WS-EDIT-S15V99            58970005
873795*       MOVE  WS-EDIT-S15V99       TO AR94LS-LATE-CHRG-AM         58980005
873796*    ELSE                                                         58990005
873797*       MOVE ZEROES          TO AR94LS-LATE-CHRG-AM               59000005
873798*    END-IF                                                       59010005
873799*    IF AR93LS-UNPD-LATE-CHRG-AM  IS NUMERIC                      59020005
873800*       MOVE AR93LS-UNPD-LATE-CHRG-AM TO  WS-EDIT-S15V99          59030005
873801*       MOVE  WS-EDIT-S15V99       TO AR94LS-UNPD-LATE-CHRG-AM    59040005
873802*    ELSE                                                         59050005
873803*       MOVE ZEROES          TO AR94LS-UNPD-LATE-CHRG-AM          59060005
873804*    END-IF                                                       59070005
873805*    IF AR93LS-OVRL-CHRG-AM       IS NUMERIC                      59080005
873806*       MOVE AR93LS-OVRL-CHRG-AM      TO  WS-EDIT-S15V99          59090005
873807*       MOVE  WS-EDIT-S15V99       TO AR94LS-OVRL-CHRG-AM         59100005
873808*    ELSE                                                         59110005
873809*       MOVE ZEROES          TO AR94LS-OVRL-CHRG-AM               59120005
873810*    END-IF                                                       59130005
873811*    IF AR93LS-UNPD-OVRL-CHRG-AM  IS NUMERIC                      59140005
873812*       MOVE AR93LS-UNPD-OVRL-CHRG-AM TO  WS-EDIT-S15V99          59150005
873813*       MOVE  WS-EDIT-S15V99       TO AR94LS-UNPD-OVRL-CHRG-AM    59160005
873814*    ELSE                                                         59170005
873815*       MOVE ZEROES          TO AR94LS-UNPD-OVRL-CHRG-AM          59180005
873816*    END-IF                                                       59190005
873817*    IF AR93LS-UNPD-CRDT-LIFE-AM  IS NUMERIC                      59200005
873818*       MOVE AR93LS-UNPD-CRDT-LIFE-AM TO  WS-EDIT-S15V99          59210005
873819*       MOVE  WS-EDIT-S15V99       TO AR94LS-UNPD-CRDT-LIFE-AM    59220005
873820*    ELSE                                                         59230005
873821*       MOVE ZEROES          TO AR94LS-UNPD-CRDT-LIFE-AM          59240005
873822*    END-IF                                                       59250005
873823*    IF AR93LS-MSCL-CHRG-AM       IS NUMERIC                      59260005
873824*       MOVE AR93LS-MSCL-CHRG-AM      TO  WS-EDIT-S15V99          59270005
873825*       MOVE  WS-EDIT-S15V99       TO AR94LS-MSCL-CHRG-AM         59280005
873826*    ELSE                                                         59290005
873827*       MOVE ZEROES          TO AR94LS-MSCL-CHRG-AM               59300005
873828*    END-IF                                                       59310005
873829*    IF AR93LS-UNPD-MSCL-CHRG-AM  IS NUMERIC                      59320005
873830*       MOVE AR93LS-UNPD-MSCL-CHRG-AM TO  WS-EDIT-S15V99          59330005
873831*       MOVE  WS-EDIT-S15V99       TO AR94LS-UNPD-MSCL-CHRG-AM    59340005
873832*    ELSE                                                         59350005
873833*       MOVE ZEROES          TO AR94LS-UNPD-MSCL-CHRG-AM          59360005
873834*    END-IF                                                       59370005
873835*    IF AR93LS-ANNL-CHRG-AM       IS NUMERIC                      59380005
873836*       MOVE AR93LS-ANNL-CHRG-AM      TO  WS-EDIT-S15V99          59390005
873837*       MOVE  WS-EDIT-S15V99       TO AR94LS-ANNL-CHRG-AM         59400005
873838*    ELSE                                                         59410005
873839*       MOVE ZEROES          TO AR94LS-ANNL-CHRG-AM               59420005
873840*    END-IF                                                       59430005
873841*    IF AR93LS-UNPD-ANNL-CHRG-AM  IS NUMERIC                      59440005
873842*       MOVE AR93LS-UNPD-ANNL-CHRG-AM TO  WS-EDIT-S15V99          59450005
873843*       MOVE  WS-EDIT-S15V99       TO AR94LS-UNPD-ANNL-CHRG-AM    59460005
873844*    ELSE                                                         59470005
873845*       MOVE ZEROES          TO AR94LS-UNPD-ANNL-CHRG-AM          59480005
873846*    END-IF                                                       59490005
873847*    IF AR93LS-SRCHG-AM           IS NUMERIC                      59500005
873848*       MOVE AR93LS-SRCHG-AM          TO  WS-EDIT-S15V99          59510005
873849*       MOVE  WS-EDIT-S15V99       TO AR94LS-SRCHG-AM             59520005
873850*    ELSE                                                         59530005
873851*       MOVE ZEROES          TO AR94LS-SRCHG-AM                   59540005
873852*    END-IF                                                       59550005
873853*    IF AR93LS-UNPD-SRCHG-AM      IS NUMERIC                      59560005
873854*       MOVE AR93LS-UNPD-SRCHG-AM     TO  WS-EDIT-S15V99          59570005
873855*       MOVE  WS-EDIT-S15V99       TO AR94LS-UNPD-SRCHG-AM        59580005
873856*    ELSE                                                         59590005
873857*       MOVE ZEROES          TO AR94LS-UNPD-SRCHG-AM              59600005
873858*    END-IF                                                       59610005
873859*    IF AR93LS-UNPD-ITEM-CHRG-AM  IS NUMERIC                      59620005
873860*       MOVE AR93LS-UNPD-ITEM-CHRG-AM TO  WS-EDIT-S15V99          59630005
873861*       MOVE  WS-EDIT-S15V99       TO AR94LS-UNPD-ITEM-CHRG-AM    59640005
873862*    ELSE                                                         59650005
873863*       MOVE ZEROES          TO AR94LS-UNPD-ITEM-CHRG-AM          59660005
873864*    END-IF                                                       59670005
873865*    IF AR93LS-PYMN-LQDT-AM       IS NUMERIC                      59680005
873866*       MOVE AR93LS-PYMN-LQDT-AM      TO  WS-EDIT-S15V99          59690005
873867*       MOVE  WS-EDIT-S15V99       TO AR94LS-PYMN-LQDT-AM         59700005
873868*    ELSE                                                         59710005
873869*       MOVE ZEROES          TO AR94LS-PYMN-LQDT-AM               59720005
873870*    END-IF                                                       59730005
873871*    IF AR93LS-MIN-FIN-CHRG-AM    IS NUMERIC                      59740005
873872*       MOVE AR93LS-MIN-FIN-CHRG-AM   TO  WS-EDIT-S15V99          59750005
873873*       MOVE  WS-EDIT-S15V99       TO AR94LS-MIN-FIN-CHRG-AM      59760005
873874*    ELSE                                                         59770005
873875*       MOVE ZEROES          TO AR94LS-MIN-FIN-CHRG-AM            59780005
873876*    END-IF                                                       59790005
873877*    IF AR93LS-CRDT-LIFE-CHRG-AM  IS NUMERIC                      59800005
873878*       MOVE AR93LS-CRDT-LIFE-CHRG-AM TO  WS-EDIT-S15V99          59810005
873879*       MOVE  WS-EDIT-S15V99       TO AR94LS-CRDT-LIFE-CHRG-AM    59820005
873880*    ELSE                                                         59830005
873881*       MOVE ZEROES          TO AR94LS-CRDT-LIFE-CHRG-AM          59840005
873882*    END-IF                                                       59850005
873883*    IF AR93LS-DLNQ-CYCL-NR       IS NUMERIC                      59860005
873884*       MOVE AR93LS-DLNQ-CYCL-NR      TO  WS-EDIT-S3              59870005
873885*       MOVE  WS-EDIT-S3           TO AR94LS-DLNQ-CYCL-NR         59880005
873886*    ELSE                                                         59890005
873887*       MOVE ZEROES          TO AR94LS-DLNQ-CYCL-NR               59900005
873888*    END-IF                                                       59910005
873889*    IF AR93LS-CRDT-CRRN-CHRG-AM  IS NUMERIC                      59920005
873890*       MOVE AR93LS-CRDT-CRRN-CHRG-AM TO  WS-EDIT-S15V99          59930005
873891*       MOVE  WS-EDIT-S15V99       TO AR94LS-CRDT-CRRN-CHRG-AM    59940005
873892*    ELSE                                                         59950005
873893*       MOVE ZEROES          TO AR94LS-CRDT-CRRN-CHRG-AM          59960005
873894*    END-IF                                                       59970005
873895*    IF AR93LS-ACRD-PROMO-ADB     IS NUMERIC                      59980005
873896*       MOVE AR93LS-ACRD-PROMO-ADB    TO  WS-EDIT-S15V99          59990005
873897*       MOVE  WS-EDIT-S15V99       TO AR94LS-ACRD-PROMO-ADB       60000005
873898*    ELSE                                                         60010005
873899*       MOVE ZEROES          TO AR94LS-ACRD-PROMO-ADB             60020005
873900*    END-IF                                                       60030005
873901*    IF AR93LS-CRDT-BLNC-AM       IS NUMERIC                      60040005
873902*       MOVE AR93LS-CRDT-BLNC-AM      TO  WS-EDIT-S15V99          60050005
873903*       MOVE  WS-EDIT-S15V99       TO AR94LS-CRDT-BLNC-AM         60060005
873904*    ELSE                                                         60070005
873905*       MOVE ZEROES          TO AR94LS-CRDT-BLNC-AM               60080005
873906*    END-IF                                                       60090005
873907*    IF AR93LS-SPCF-CRDT-AM       IS NUMERIC                      60100005
873908*       MOVE AR93LS-SPCF-CRDT-AM      TO  WS-EDIT-S15V99          60110005
873909*       MOVE  WS-EDIT-S15V99       TO AR94LS-SPCF-CRDT-AM         60120005
873910*    ELSE                                                         60130005
873911*       MOVE ZEROES          TO AR94LS-SPCF-CRDT-AM               60140005
873912*    END-IF                                                       60150005
873913*    IF AR93LS-ACCM-PYMT-PRCS-AM  IS NUMERIC                      60160005
873914*       MOVE AR93LS-ACCM-PYMT-PRCS-AM TO  WS-EDIT-S15V99          60170005
873915*       MOVE  WS-EDIT-S15V99       TO AR94LS-ACCM-PYMT-PRCS-AM    60180005
873916*    ELSE                                                         60190005
873917*       MOVE ZEROES          TO AR94LS-ACCM-PYMT-PRCS-AM          60200005
873918*    END-IF                                                       60210005
873919*       MOVE AR93LS-LGCY-LINK-NM  TO AR94LS-LGCY-LINK-NM          60220005
873920*    IF AR93LS-PRMT-PYMT-WAIV-INT-AM IS NUMERIC                   60230005
873921*       MOVE AR93LS-PRMT-PYMT-WAIV-INT-AM TO WS-EDIT-S15V99       60240005
873922*       MOVE  WS-EDIT-S15V99     TO AR94LS-PRMT-PYMT-WAIV-INT-AM  60250005
873923*    ELSE                                                         60260005
873924*       MOVE ZEROES          TO AR94LS-PRMT-PYMT-WAIV-INT-AM      60270005
873925*    END-IF                                                       60280005
873926*       MOVE AR93LS-FULL-BAL-DSPT-CD  TO AR94LS-FULL-BAL-DSPT-CD  60290005
873927*    IF AR93LS-DSBR-AM       IS NUMERIC                           60300005
873928*       MOVE AR93LS-DSBR-AM         TO WS-EDIT-S15V99             60310005
873929*       MOVE  WS-EDIT-S15V99     TO AR94LS-DSBR-AM                60320005
873930*    ELSE                                                         60330005
873931*       MOVE ZEROES          TO AR94LS-DSBR-AM                    60340005
873932*    END-IF                                                       60350005
873933*    IF AR93LS-DSBR-CT       IS NUMERIC                           60360005
873934*       MOVE AR93LS-DSBR-CT         TO WS-EDIT-S15V99             60370005
873935*       MOVE  WS-EDIT-S3         TO AR94LS-DSBR-CT                60380005
873936*    ELSE                                                         60390005
873937*       MOVE ZEROES          TO AR94LS-DSBR-CT                    60400005
873938*    END-IF                                                       60410005
873939*    IF AR93LS-DSBR-TOTL-CT  IS NUMERIC                           60420005
873940*       MOVE AR93LS-DSBR-TOTL-CT    TO WS-EDIT-S3                 60430005
873941*       MOVE  WS-EDIT-S3         TO AR94LS-DSBR-TOTL-CT           60440005
873942*    ELSE                                                         60450005
873943*       MOVE ZEROES          TO AR94LS-DSBR-TOTL-CT               60460005
873944*    END-IF                                                       60470005
873945*    IF AR93LS-FRST-PERD-ADB-AM IS NUMERIC                        60480005
873946*       MOVE AR93LS-FRST-PERD-ADB-AM TO WS-EDIT-S15V99            60490005
873947*       MOVE  WS-EDIT-S15V99     TO AR94LS-FRST-PERD-ADB-AM       60500005
873948*    ELSE                                                         60510005
873949*       MOVE ZEROES          TO AR94LS-FRST-PERD-ADB-AM           60520005
873950*    END-IF                                                       60530005
873951*    IF AR93LS-FRST-PERD-APR-RT IS NUMERIC                        60540005
873952*       MOVE AR93LS-FRST-PERD-APR-RT TO WS-EDIT-S2V999            60550005
873953*       MOVE  WS-EDIT-S2V999     TO AR94LS-FRST-PERD-APR-RT       60560005
873954*    ELSE                                                         60570005
873955*       MOVE ZEROES          TO AR94LS-FRST-PERD-APR-RT           60580005
873956*    END-IF                                                       60590005
873957*    IF AR93LS-RTR-DELY-RESN-CD IS NUMERIC                        60600005
873958*       MOVE AR93LS-RTR-DELY-RESN-CD TO AR94LS-RTR-DELY-RESN-CD   60610005
873959*    ELSE                                                         60620005
873960*       MOVE ZEROES          TO AR94LS-RTR-DELY-RESN-CD           60630005
873961*    END-IF                                                       60640005
873962*       MOVE AR93LS-PYFF-1-EXCP-CODES                             60650005
873963*                           TO AR94LS-PYFF-1-EXCP-CODES           60660005
873964*       MOVE AR93LS-PYFF-2-EXCP-CODES                             60670005
873965*                           TO AR94LS-PYFF-2-EXCP-CODES           60680005
873966*       MOVE AR93LS-PYFF-3-EXCP-CODES                             60690005
873967*                           TO AR94LS-PYFF-3-EXCP-CODES           60700005
873968*       MOVE AR93LS-PYFF-EXCP-BINT-CD                             60710005
873969*                           TO AR94LS-PYFF-EXCP-BINT-CD           60720005
873970*       MOVE AR93LS-PYFF-EXCP-OLD-CD                              60730005
873971*                           TO AR94LS-PYFF-EXCP-OLD-CD            60740005
873972*       MOVE AR93LS-PYFF-EXCP-CTD-CD                              60750005
873973*                           TO AR94LS-PYFF-EXCP-CTD-CD            60760005
873974*       MOVE AR93LS-RTRN-TO-RVLV-SSPN-CD                          60770005
873975*                           TO AR94LS-RTRN-TO-RVLV-SSPN-CD        60780005
873976*    IF AR93LS-FEE-APPL-AM        IS NUMERIC                      60790005
873977*       MOVE AR93LS-FEE-APPL-AM     TO  WS-EDIT-S11V99            60800005
873978*       MOVE  WS-EDIT-S11V99       TO AR94LS-FEE-APPL-AM          60810005
873979*    ELSE                                                         60820005
873980*       MOVE SPACES          TO AR94LS-FEE-APPL-AM                60830005
873981*    END-IF                                                       60840005
873982*************                                                     60850005
873983*************                                                     60860005
873984*    IF AR93-PS-OLD-PRIN          IS NUMERIC                      60870005
873985*       MOVE AR93-PS-OLD-PRIN       TO  WS-EDIT-S15V99            60880005
873986*       MOVE  WS-EDIT-S15V99       TO AR94-PS-OLD-PRIN            60890005
873987*    ELSE                                                         60900005
873988*       MOVE SPACES          TO AR94-PS-OLD-PRIN                  60910005
873989*    END-IF                                                       60920005
873990*    IF AR93-PS-BILLED-INT        IS NUMERIC                      60930005
873991*       MOVE AR93-PS-BILLED-INT     TO  WS-EDIT-S11V99            60940005
873992*       MOVE  WS-EDIT-S11V99       TO AR94-PS-BILLED-INT          60950005
873993*    ELSE                                                         60960005
873994*       MOVE SPACES          TO AR94-PS-BILLED-INT                60970005
873995*    END-IF                                                       60980005
873996*****************                                                 60990005
873997*    IF AR93PS-UNPAID-INTSC       IS NUMERIC                      61000005
873998*       MOVE AR93PS-UNPAID-INTSC    TO  WS-EDIT-S11V99            61010005
873999*       MOVE  WS-EDIT-S11V99       TO AR94PS-UNPAID-INTSC         61020005
874000*    ELSE                                                         61030005
874001*       MOVE SPACES          TO AR94PS-UNPAID-INTSC               61040005
874002*    END-IF                                                       61050005
874003*    IF AR93PS-BPD                IS NUMERIC                      61060005
874004*       MOVE AR93PS-BPD             TO  WS-EDIT-S15V99            61070005
874005*       MOVE  WS-EDIT-S15V99       TO AR94PS-BPD                  61080005
874006*    ELSE                                                         61090005
874007*       MOVE SPACES          TO AR94PS-BPD                        61100005
874008*    END-IF                                                       61110005
874009*    IF AR93PS-TOTAL-DELQ         IS NUMERIC                      61120005
874010*       MOVE AR93PS-TOTAL-DELQ      TO  WS-EDIT-S15V99            61130005
874011*       MOVE  WS-EDIT-S15V99       TO AR94PS-TOTAL-DELQ           61140005
874012*    ELSE                                                         61150005
874013*       MOVE SPACES          TO AR94PS-TOTAL-DELQ                 61160005
874014*    END-IF                                                       61170005
874015*    IF AR93PS-ACCRUED-UNBILLED-INT IS  NUMERIC                   61180005
874016*       MOVE AR93PS-ACCRUED-UNBILLED-INT TO WS-EDIT-S11V99        61190005
874017*       MOVE  WS-EDIT-S11V99    TO AR94PS-ACCRUED-UNBILLED-INT    61200005
874018*    ELSE                                                         61210005
874019*       MOVE SPACES          TO AR94PS-ACCRUED-UNBILLED-INT       61220005
874020*    END-IF                                                       61230005
874021*    IF AR93PS-ITEM-FEES            IS  NUMERIC                   61240005
874022*       MOVE AR93PS-ITEM-FEES            TO WS-EDIT-S11V99        61250005
874023*       MOVE  WS-EDIT-S11V99    TO AR94PS-ITEM-FEES               61260005
874024*    ELSE                                                         61270005
874025*       MOVE SPACES          TO AR94PS-ITEM-FEES                  61280005
874026*    END-IF                                                       61290005
874027*    IF AR93PS-REPORTABLE-INT       IS  NUMERIC                   61300005
874028*       MOVE AR93PS-REPORTABLE-INT       TO WS-EDIT-S11V99        61310005
874029*       MOVE  WS-EDIT-S11V99    TO AR94PS-REPORTABLE-INT          61320005
874030*    ELSE                                                         61330005
874031*       MOVE SPACES          TO AR94PS-REPORTABLE-INT             61340005
874032*    END-IF                                                       61350005
874033*    IF AR93PS-DEFERRED-CR-LIFE     IS  NUMERIC                   61360005
874034*       MOVE AR93PS-DEFERRED-CR-LIFE     TO WS-EDIT-S11V99        61370005
874035*       MOVE  WS-EDIT-S11V99    TO AR94PS-DEFERRED-CR-LIFE        61380005
874036*    ELSE                                                         61390005
874037*       MOVE SPACES          TO AR94PS-DEFERRED-CR-LIFE           61400005
874038*    END-IF                                                       61410005
874039*    IF AR93PS-DEF-ADB              IS  NUMERIC                   61420005
874040*       MOVE AR93PS-DEF-ADB              TO WS-EDIT-S15V99        61430005
874041*       MOVE  WS-EDIT-S15V99    TO AR94PS-DEF-ADB                 61440005
874042*    ELSE                                                         61450005
874043*       MOVE SPACES          TO AR94PS-DEF-ADB                    61460005
874044*    END-IF                                                       61470005
874045*    IF AR93PS-CYC-PRIN             IS  NUMERIC                   61480005
874046*       MOVE AR93PS-CYC-PRIN             TO WS-EDIT-S15V99        61490005
874047*       MOVE  WS-EDIT-S15V99    TO AR94PS-CYC-PRIN                61500005
874048*    ELSE                                                         61510005
874049*       MOVE SPACES          TO AR94PS-CYC-PRIN                   61520005
874050*    END-IF                                                       61530005
874051*    IF AR93PS-DISPUTE-AMOUNT       IS  NUMERIC                   61540005
874052*       MOVE AR93PS-DISPUTE-AMOUNT       TO WS-EDIT-S15V99        61550005
874053*       MOVE  WS-EDIT-S15V99    TO AR94PS-DISPUTE-AMOUNT          61560005
874054*    ELSE                                                         61570005
874055*       MOVE SPACES          TO AR94PS-DISPUTE-AMOUNT             61580005
874056*    END-IF                                                       61590005
874057*    IF AR93PS-UNBD-ITEM-FEE-AM     IS  NUMERIC                   61600005
874058*       MOVE AR93PS-UNBD-ITEM-FEE-AM     TO WS-EDIT-S11V99        61610005
874059*       MOVE  WS-EDIT-S11V99    TO AR94PS-UNBD-ITEM-FEE-AM        61620005
874060*    ELSE                                                         61630005
874061*       MOVE SPACES          TO AR94PS-UNBD-ITEM-FEE-AM           61640005
874062*    END-IF                                                       61650005
874063*    IF AR93PS-TRANS-AMT            IS  NUMERIC                   61660005
874064*       MOVE AR93PS-TRANS-AMT            TO WS-EDIT-S15V99        61670005
874065*       MOVE  WS-EDIT-S15V99    TO AR94PS-TRANS-AMT               61680005
874066*    ELSE                                                         61690005
874067*       MOVE SPACES          TO AR94PS-TRANS-AMT                  61700005
874068*    END-IF                                                       61710005
874069*    IF AR93PS-REAL-INT-AM          IS  NUMERIC                   61720005
874070*       MOVE AR93PS-REAL-INT-AM          TO WS-EDIT-S15V99        61730005
874071*       MOVE  WS-EDIT-S15V99    TO AR94PS-REAL-INT-AM             61740005
874072*    ELSE                                                         61750005
874073*       MOVE SPACES          TO AR94PS-REAL-INT-AM                61760005
874074*    END-IF                                                       61770005
874075*       MOVE AR93-PS-RTRN-TO-RVLV-CD  TO AR94-PS-RTRN-TO-RVLV-CD  61780005
874076*    IF AR93PS-DEFR-CRDT-LIFE-BASE-AM IS  NUMERIC                 61790005
874077*       MOVE AR93PS-DEFR-CRDT-LIFE-BASE-AM TO  WS-EDIT-S15V99     61800005
874078*       MOVE  WS-EDIT-S15V99    TO AR94PS-DEFR-CRDT-LIFE-BASE-AM  61810005
874079*    ELSE                                                         61820005
874080*       MOVE SPACES          TO AR94PS-DEFR-CRDT-LIFE-BASE-AM     61830005
874081*    END-IF                                                       61840005
874082*    IF AR93PS-BLLD-INTR-AM         IS  NUMERIC                   61850005
874083*       MOVE AR93PS-BLLD-INTR-AM         TO WS-EDIT-S11V99        61860005
874084*       MOVE  WS-EDIT-S11V99    TO AR94PS-BLLD-INTR-AM            61870005
874085*    ELSE                                                         61880005
874086*       MOVE SPACES          TO AR94PS-BLLD-INTR-AM               61890005
874087*    END-IF                                                       61900005
874088*****************                                                 61910005
874089*    IF AR93-PS-FLAP-ADB-AM       IS NUMERIC                      61920005
874090*       MOVE AR93-PS-FLAP-ADB-AM    TO  WS-EDIT-S15V99            61930005
874091*       MOVE  WS-EDIT-S15V99       TO AR94-PS-FLAP-ADB-AM         61940005
874092*    ELSE                                                         61950005
874093*       MOVE SPACES          TO AR94-PS-FLAP-ADB-AM               61960005
874094*    END-IF                                                       61970005
874095*    IF AR93-PS-BLNC-AM           IS NUMERIC                      61980005
874096*       MOVE AR93-PS-BLNC-AM        TO  WS-EDIT-S15V99            61990005
874097*       MOVE  WS-EDIT-S15V99       TO AR94-PS-BLNC-AM             62000005
874098*    ELSE                                                         62010005
874099*       MOVE ZEROES          TO AR94-PS-BLNC-AM                   62020005
874100*    END-IF                                                       62030005
874101***************                                                   62040005
874102*    IF AR93PS-LATE-CHRG-AM       IS NUMERIC                      62050005
874103*       MOVE AR93PS-LATE-CHRG-AM    TO  WS-EDIT-S15V99            62060005
874104*       MOVE  WS-EDIT-S15V99       TO AR94PS-LATE-CHRG-AM         62070005
874105*    ELSE                                                         62080005
874106*       MOVE ZEROES          TO AR94PS-LATE-CHRG-AM               62090005
874107*    END-IF                                                       62100005
874108*    IF AR93PS-UNPD-LATE-CHRG-AM  IS NUMERIC                      62110005
874109*       MOVE AR93PS-UNPD-LATE-CHRG-AM TO  WS-EDIT-S15V99          62120005
874110*       MOVE  WS-EDIT-S15V99       TO AR94PS-UNPD-LATE-CHRG-AM    62130005
874111*    ELSE                                                         62140005
874112*       MOVE ZEROES          TO AR94PS-UNPD-LATE-CHRG-AM          62150005
874113*    END-IF                                                       62160005
874114*    IF AR93PS-OVRL-CHRG-AM       IS NUMERIC                      62170005
874115*       MOVE AR93PS-OVRL-CHRG-AM      TO  WS-EDIT-S15V99          62180005
874116*       MOVE  WS-EDIT-S15V99       TO AR94PS-OVRL-CHRG-AM         62190005
874117*    ELSE                                                         62200005
874118*       MOVE ZEROES          TO AR94PS-OVRL-CHRG-AM               62210005
874119*    END-IF                                                       62220005
874120*    IF AR93PS-UNPD-OVRL-CHRG-AM  IS NUMERIC                      62230005
874121*       MOVE AR93PS-UNPD-OVRL-CHRG-AM TO  WS-EDIT-S15V99          62240005
874122*       MOVE  WS-EDIT-S15V99       TO AR94PS-UNPD-OVRL-CHRG-AM    62250005
874123*    ELSE                                                         62260005
874124*       MOVE ZEROES          TO AR94PS-UNPD-OVRL-CHRG-AM          62270005
874125*    END-IF                                                       62280005
874126*    IF AR93PS-UNPD-CRDT-LIFE-AM  IS NUMERIC                      62290005
874127*       MOVE AR93PS-UNPD-CRDT-LIFE-AM TO  WS-EDIT-S15V99          62300005
874128*       MOVE  WS-EDIT-S15V99       TO AR94PS-UNPD-CRDT-LIFE-AM    62310005
874129*    ELSE                                                         62320005
874130*       MOVE ZEROES          TO AR94PS-UNPD-CRDT-LIFE-AM          62330005
874131*    END-IF                                                       62340005
874132*    IF AR93PS-MSCL-CHRG-AM       IS NUMERIC                      62350005
874133*       MOVE AR93PS-MSCL-CHRG-AM      TO  WS-EDIT-S15V99          62360005
874134*       MOVE  WS-EDIT-S15V99       TO AR94PS-MSCL-CHRG-AM         62370005
874135*    ELSE                                                         62380005
874136*       MOVE ZEROES          TO AR94PS-MSCL-CHRG-AM               62390005
874137*    END-IF                                                       62400005
874138*    IF AR93PS-UNPD-MSCL-CHRG-AM  IS NUMERIC                      62410005
874139*       MOVE AR93PS-UNPD-MSCL-CHRG-AM TO  WS-EDIT-S15V99          62420005
874140*       MOVE  WS-EDIT-S15V99       TO AR94PS-UNPD-MSCL-CHRG-AM    62430005
874141*    ELSE                                                         62440005
874142*       MOVE ZEROES          TO AR94PS-UNPD-MSCL-CHRG-AM          62450005
874143*    END-IF                                                       62460005
874144*    IF AR93PS-ANNL-CHRG-AM       IS NUMERIC                      62470005
874145*       MOVE AR93PS-ANNL-CHRG-AM      TO  WS-EDIT-S15V99          62480005
874146*       MOVE  WS-EDIT-S15V99       TO AR94PS-ANNL-CHRG-AM         62490005
874147*    ELSE                                                         62500005
874148*       MOVE ZEROES          TO AR94PS-ANNL-CHRG-AM               62510005
874149*    END-IF                                                       62520005
874150*    IF AR93PS-UNPD-ANNL-CHRG-AM  IS NUMERIC                      62530005
874151*       MOVE AR93PS-UNPD-ANNL-CHRG-AM TO  WS-EDIT-S15V99          62540005
874152*       MOVE  WS-EDIT-S15V99       TO AR94PS-UNPD-ANNL-CHRG-AM    62550005
874153*    ELSE                                                         62560005
874154*       MOVE ZEROES          TO AR94PS-UNPD-ANNL-CHRG-AM          62570005
874155*    END-IF                                                       62580005
874156*    IF AR93PS-SRCHG-AM           IS NUMERIC                      62590005
874157*       MOVE AR93PS-SRCHG-AM          TO  WS-EDIT-S15V99          62600005
874158*       MOVE  WS-EDIT-S15V99       TO AR94PS-SRCHG-AM             62610005
874159*    ELSE                                                         62620005
874160*       MOVE ZEROES          TO AR94PS-SRCHG-AM                   62630005
874161*    END-IF                                                       62640005
874162*    IF AR93PS-UNPD-SRCHG-AM      IS NUMERIC                      62650005
874163*       MOVE AR93PS-UNPD-SRCHG-AM     TO  WS-EDIT-S15V99          62660005
874164*       MOVE  WS-EDIT-S15V99       TO AR94PS-UNPD-SRCHG-AM        62670005
874165*    ELSE                                                         62680005
874166*       MOVE ZEROES          TO AR94PS-UNPD-SRCHG-AM              62690005
874167*    END-IF                                                       62700005
874168*    IF AR93PS-UNPD-ITEM-CHRG-AM  IS NUMERIC                      62710005
874169*       MOVE AR93PS-UNPD-ITEM-CHRG-AM TO  WS-EDIT-S15V99          62720005
874170*       MOVE  WS-EDIT-S15V99       TO AR94PS-UNPD-ITEM-CHRG-AM    62730005
874171*    ELSE                                                         62740005
874172*       MOVE ZEROES          TO AR94PS-UNPD-ITEM-CHRG-AM          62750005
874173*    END-IF                                                       62760005
874174*    IF AR93PS-PYMN-LQDT-AM       IS NUMERIC                      62770005
874175*       MOVE AR93PS-PYMN-LQDT-AM      TO  WS-EDIT-S15V99          62780005
874176*       MOVE  WS-EDIT-S15V99       TO AR94PS-PYMN-LQDT-AM         62790005
874177*    ELSE                                                         62800005
874178*       MOVE ZEROES          TO AR94PS-PYMN-LQDT-AM               62810005
874179*    END-IF                                                       62820005
874180*    IF AR93PS-MIN-FIN-CHRG-AM    IS NUMERIC                      62830005
874181*       MOVE AR93PS-MIN-FIN-CHRG-AM   TO  WS-EDIT-S15V99          62840005
874182*       MOVE  WS-EDIT-S15V99       TO AR94PS-MIN-FIN-CHRG-AM      62850005
874183*    ELSE                                                         62860005
874184*       MOVE ZEROES          TO AR94PS-MIN-FIN-CHRG-AM            62870005
874185*    END-IF                                                       62880005
874186*    IF AR93PS-CRDT-LIFE-CHRG-AM  IS NUMERIC                      62890005
874187*       MOVE AR93PS-CRDT-LIFE-CHRG-AM TO  WS-EDIT-S15V99          62900005
874188*       MOVE  WS-EDIT-S15V99       TO AR94PS-CRDT-LIFE-CHRG-AM    62910005
874189*    ELSE                                                         62920005
874190*       MOVE ZEROES          TO AR94PS-CRDT-LIFE-CHRG-AM          62930005
874191*    END-IF                                                       62940005
874192***************                                                   62950005
874193*    IF AR93PS-DLNQ-CYCL-NR       IS NUMERIC                      62960005
874194*       MOVE AR93PS-DLNQ-CYCL-NR      TO  WS-EDIT-S3              62970005
874195*       MOVE  WS-EDIT-S3       TO AR94PS-DLNQ-CYCL-NR             62980005
874196*    ELSE                                                         62990005
874197*       MOVE ZEROES          TO AR94PS-DLNQ-CYCL-NR               63000005
874198*    END-IF                                                       63010005
874199*    IF AR93PS-CRDT-CRRN-CHRG-AM  IS NUMERIC                      63020005
874200*       MOVE AR93PS-CRDT-CRRN-CHRG-AM TO  WS-EDIT-S15V99          63030005
874201*       MOVE  WS-EDIT-S15V99       TO AR94PS-CRDT-CRRN-CHRG-AM    63040005
874202*    ELSE                                                         63050005
874203*       MOVE ZEROES          TO AR94PS-CRDT-CRRN-CHRG-AM          63060005
874204*    END-IF                                                       63070005
874205*    IF AR93PS-ACRD-PROMO-ADB     IS NUMERIC                      63080005
874206*       MOVE AR93PS-ACRD-PROMO-ADB    TO  WS-EDIT-S15V99          63090005
874207*       MOVE  WS-EDIT-S15V99       TO AR94PS-ACRD-PROMO-ADB       63100005
874208*    ELSE                                                         63110005
874209*       MOVE ZEROES          TO AR94PS-ACRD-PROMO-ADB             63120005
874210*    END-IF                                                       63130005
874211*    IF AR93PS-CRDT-BLNC-AM       IS NUMERIC                      63140005
874212*       MOVE AR93PS-CRDT-BLNC-AM      TO  WS-EDIT-S15V99          63150005
874213*       MOVE  WS-EDIT-S15V99       TO AR94PS-CRDT-BLNC-AM         63160005
874214*    ELSE                                                         63170005
874215*       MOVE ZEROES          TO AR94PS-CRDT-BLNC-AM               63180005
874216*    END-IF                                                       63190005
874217*    IF AR93PS-SPCF-CRDT-AM       IS NUMERIC                      63200005
874218*       MOVE AR93PS-SPCF-CRDT-AM      TO  WS-EDIT-S15V99          63210005
874219*       MOVE  WS-EDIT-S15V99       TO AR94PS-SPCF-CRDT-AM         63220005
874220*    ELSE                                                         63230005
874221*       MOVE ZEROES          TO AR94PS-SPCF-CRDT-AM               63240005
874222*    END-IF                                                       63250005
874223*    IF AR93PS-ACCM-PYMT-PRCS-AM  IS NUMERIC                      63260005
874224*       MOVE AR93PS-ACCM-PYMT-PRCS-AM TO  WS-EDIT-S15V99          63270005
874225*       MOVE  WS-EDIT-S15V99       TO AR94PS-ACCM-PYMT-PRCS-AM    63280005
874226*    ELSE                                                         63290005
874227*       MOVE ZEROES          TO AR94PS-ACCM-PYMT-PRCS-AM          63300005
874228*    END-IF                                                       63310005
874229*       MOVE AR93PS-LGCY-LINK-NM  TO AR94PS-LGCY-LINK-NM          63320005
874230*    IF AR93PS-PRMT-PYMT-WAIV-INT-AM IS NUMERIC                   63330005
874231*       MOVE AR93PS-PRMT-PYMT-WAIV-INT-AM TO WS-EDIT-S15V99       63340005
874232*       MOVE  WS-EDIT-S15V99    TO AR94PS-PRMT-PYMT-WAIV-INT-AM   63350005
874233*    ELSE                                                         63360005
874234*       MOVE ZEROES          TO AR94PS-PRMT-PYMT-WAIV-INT-AM      63370005
874235*    END-IF                                                       63380005
874236*       MOVE AR93PS-FULL-BAL-DSPT-CD TO AR94PS-FULL-BAL-DSPT-CD   63390005
874237*    IF AR93PS-DSBR-AM          IS NUMERIC                        63400005
874238*       MOVE AR93PS-DSBR-AM         TO WS-EDIT-S15V99             63410005
874239*       MOVE  WS-EDIT-S15V99    TO AR94PS-DSBR-AM                 63420005
874240*    ELSE                                                         63430005
874241*       MOVE ZEROES          TO AR94PS-DSBR-AM                    63440005
874242*    END-IF                                                       63450005
874243*    IF AR93PS-DSBR-CT          IS NUMERIC                        63460005
874244*       MOVE AR93PS-DSBR-CT         TO WS-EDIT-S3                 63470005
874245*       MOVE  WS-EDIT-S3        TO AR94PS-DSBR-CT                 63480005
874246*    ELSE                                                         63490005
874247*       MOVE ZEROES          TO AR94PS-DSBR-CT                    63500005
874248*    END-IF                                                       63510005
874249*    IF AR93PS-DSBR-TOTL-CT     IS NUMERIC                        63520005
874250*       MOVE AR93PS-DSBR-TOTL-CT    TO WS-EDIT-S3                 63530005
874251*       MOVE  WS-EDIT-S3        TO AR94PS-DSBR-TOTL-CT            63540005
874252*    ELSE                                                         63550005
874253*       MOVE ZEROES          TO AR94PS-DSBR-TOTL-CT               63560005
874254*    END-IF                                                       63570005
874255*    IF AR93PS-FRST-PERD-ADB-AM IS NUMERIC                        63580005
874256*       MOVE AR93PS-FRST-PERD-ADB-AM TO WS-EDIT-S15V99            63590005
874257*       MOVE  WS-EDIT-S15V99    TO AR94PS-FRST-PERD-ADB-AM        63600005
874258*    ELSE                                                         63610005
874259*       MOVE ZEROES          TO AR94PS-FRST-PERD-ADB-AM           63620005
874260*    END-IF                                                       63630005
874261*    IF AR93PS-FRST-PERD-APR-RT IS NUMERIC                        63640005
874262*       MOVE AR93PS-FRST-PERD-APR-RT TO WS-EDIT-S2V999            63650005
874263*       MOVE  WS-EDIT-S2V999    TO AR94PS-FRST-PERD-APR-RT        63660005
874264*    ELSE                                                         63670005
874265*       MOVE ZEROES          TO AR94PS-FRST-PERD-APR-RT           63680005
874266*    END-IF                                                       63690005
874267*       MOVE AR93PS-RTR-DELY-RESN-CD  TO AR94PS-RTR-DELY-RESN-CD  63700005
874268*       MOVE AR93PS-PYFF-EXCP-CD  TO AR94PS-PYFF-EXCP-CD          63710005
874269*       MOVE AR93PS-PYFF-EXCP-BINT-CD                             63720005
874270*                        TO AR94PS-PYFF-EXCP-BINT-CD              63730005
874271*       MOVE AR93PS-PYFF-EXCP-OLD-CD                              63740005
874272*                        TO AR94PS-PYFF-EXCP-OLD-CD               63750005
874273*       MOVE AR93PS-PYFF-EXCP-CTD-CD                              63760005
874274*                        TO AR94PS-PYFF-EXCP-CTD-CD               63770005
874275*       MOVE AR93PS-RTRN-TO-RVLV-SSPN-CD                          63780005
874276*                        TO AR94PS-RTRN-TO-RVLV-SSPN-CD           63790005
874277*    IF AR93PS-FEE-APPL-AM        IS NUMERIC                      63800005
874278*       MOVE AR93PS-FEE-APPL-AM     TO  WS-EDIT-S11V99            63810005
874279*       MOVE  WS-EDIT-S11V99        TO AR94PS-FEE-APPL-AM         63820005
874280*    ELSE                                                         63830005
874281*       MOVE SPACES          TO AR94PS-FEE-APPL-AM                63840005
874282*    END-IF                                                       63850005
874283***************                                                   63860005
874284*    IF AR93-MINIMUM-MPD-AMT      IS NUMERIC                      63870005
874285*       MOVE AR93-MINIMUM-MPD-AMT   TO   WS-EDIT-S15V99           63880005
874286*       MOVE   WS-EDIT-S15V99       TO AR94-MINIMUM-MPD-AMT       63890005
874287*    ELSE                                                         63900005
874288*       MOVE SPACES          TO AR94-MINIMUM-MPD-AMT              63910005
874289*    END-IF                                                       63920005
874290*       MOVE AR93-MPD-METHOD  TO AR94-MPD-METHOD                  63930005
874291*    IF AR93-FIXED-PAYMENT-AMT    IS NUMERIC                      63940005
874292*       MOVE AR93-FIXED-PAYMENT-AMT TO   WS-EDIT-S15V99           63950005
874293*       MOVE   WS-EDIT-S15V99       TO AR94-FIXED-PAYMENT-AMT     63960005
874294*    ELSE                                                         63970005
874295*       MOVE SPACES          TO AR94-FIXED-PAYMENT-AMT            63980005
874296*    END-IF                                                       63990005
874297*    IF AR93-MPD-RATE          IS NUMERIC                         64000005
874298*       MOVE AR93-MPD-RATE          TO   WS-EDIT-S9V96            64010005
874299*       MOVE   WS-EDIT-S9V96        TO AR94-MPD-RATE              64020005
874300*    ELSE                                                         64030005
874301*       MOVE SPACES          TO AR94-MPD-RATE                     64040005
874302*    END-IF                                                       64050005
874303*       MOVE AR93-MPD-ADD-INT  TO AR94-MPD-ADD-INT                64060005
874304*       MOVE AR93-INTRO-MPD-METHOD  TO AR93-INTRO-MPD-METHOD      64070005
874305*    IF AR93-INTRO-FIXED-PAY-AMT  IS NUMERIC                      64080005
874306*       MOVE AR93-INTRO-FIXED-PAY-AMT TO WS-EDIT-S15V99           64090005
874307*       MOVE   WS-EDIT-S15V99       TO AR94-INTRO-FIXED-PAY-AMT   64100005
874308*    ELSE                                                         64110005
874309*       MOVE SPACES          TO AR94-INTRO-FIXED-PAY-AMT          64120005
874310*    END-IF                                                       64130005
874311*    IF AR93-INTRO-MPD-RATE       IS NUMERIC                      64140005
874312*       MOVE AR93-INTRO-MPD-RATE     TO WS-EDIT-S2V95             64150005
874313*       MOVE   WS-EDIT-S2V95        TO AR94-INTRO-MPD-RATE        64160005
874314*    ELSE                                                         64170005
874315*       MOVE SPACES          TO AR94-INTRO-MPD-RATE               64180005
874316*    END-IF                                                       64190005
874317*       MOVE AR93-INTRO-MPD-ADD-INT  TO AR94-INTRO-MPD-ADD-INT    64200005
874318***************                                                   64210005
874319*    IF AR93-MPD-LOAN-END-DT      IS NUMERIC                      64220005
874320*       MOVE AR93-MPD-LOAN-END-DT   TO  WS-EDIT-S9                64230005
874321*       MOVE  WS-EDIT-S9            TO AR94-MPD-LOAN-END-DT       64240005
874322*    ELSE                                                         64250005
874323*       MOVE SPACES          TO AR94-MPD-LOAN-END-DT              64260005
874324*    END-IF                                                       64270005
874325*    IF AR93-BASE-MIN-PAY-AM      IS NUMERIC                      64280005
874326*       MOVE AR93-BASE-MIN-PAY-AM   TO   WS-EDIT-S15V99           64290005
874327*       MOVE   WS-EDIT-S15V99       TO AR94-BASE-MIN-PAY-AM       64300005
874328*    ELSE                                                         64310005
874329*       MOVE SPACES          TO AR94-BASE-MIN-PAY-AM              64320005
874330*    END-IF                                                       64330005
874331*    IF AR93-RMRT-LAST-RT         IS NUMERIC                      64340005
874332*       MOVE AR93-RMRT-LAST-RT      TO   WS-EDIT-S2V999           64350005
874333*       MOVE   WS-EDIT-S2V999       TO AR94-RMRT-LAST-RT          64360005
874334*    ELSE                                                         64370005
874335*       MOVE '99.999'        TO AR94-RMRT-LAST-RT                 64380005
874336*    END-IF                                                       64390005
874337*    IF AR93-PS-MPD-HIGH-BLNC-AM  IS NUMERIC                      64400005
874338*       MOVE AR93-PS-MPD-HIGH-BLNC-AM   TO   WS-EDIT-S15V99       64410005
874339*       MOVE   WS-EDIT-S15V99       TO AR94-PS-MPD-HIGH-BLNC-AM   64420005
874340*    ELSE                                                         64430005
874341*       MOVE '0'             TO AR94-PS-MPD-HIGH-BLNC-AM          64440005
874342*    END-IF                                                       64450005
874343*       MOVE AR93M1-LGCY-LINK-NM  TO AR94M1-LGCY-LINK-NM          64460005
874344*       MOVE AR93M2-LGCY-LINK-NM  TO AR94M2-LGCY-LINK-NM          64470005
874345*    IF AR94M3-LGCY-LINK-NM      IS NUMERIC                       64480005
874346*       MOVE AR93M3-LGCY-LINK-NM  TO AR94M3-LGCY-LINK-NM          64490005
874347*    ELSE                                                         64500005
874348*       MOVE SPACES TO AR94M3-LGCY-LINK-NM                        64510005
874349*    END-IF                                                       64520005
874350*       PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 3           64530005
874351*    IF AR93-LGCY-LINK-NM (WS-I) IS NUMERIC                       64540005
874352*       MOVE AR93-LGCY-LINK-NM (WS-I)  TO AR94-LGCY-LINK-NM (WS-I)64550005
874353*    ELSE                                                         64560005
874354*       MOVE SPACES TO AR94-LGCY-LINK-NM (WS-I)                   64570005
874355*    END-IF                                                       64580005
874356*       END-PERFORM                                               64590005
874357*    IF AR93-PYMT-ALLC-BEGN-DT   IS NUMERIC                       64600005
874358*       MOVE AR93-PYMT-ALLC-BEGN-DT TO  WS-EDIT-S9                64610005
874359*       MOVE  WS-EDIT-S9           TO AR94-PYMT-ALLC-BEGN-DT      64620005
874360*    ELSE                                                         64630005
874361*       MOVE ZEROES          TO AR94-PYMT-ALLC-BEGN-DT            64640005
874362*    END-IF                                                       64650005
874363*    IF AR93-PYMT-ALLC-END-DT    IS NUMERIC                       64660005
874364*       MOVE AR93-PYMT-ALLC-END-DT TO  WS-EDIT-S9                 64670005
874365*       MOVE  WS-EDIT-S9           TO AR94-PYMT-ALLC-END-DT       64680005
874366*    ELSE                                                         64690005
874367*       MOVE ZEROES          TO AR94-PYMT-ALLC-END-DT             64700005
874368*    END-IF                                                       64710005
874369*    IF AR93-PYMT-ALLC-RT        IS NUMERIC                       64720005
874370*       MOVE AR93-PYMT-ALLC-RT     TO  WS-EDIT-S1V99              64730005
874371*       MOVE  WS-EDIT-S1V99        TO AR94-PYMT-ALLC-RT           64740005
874372*    ELSE                                                         64750005
874373*       MOVE ZEROES          TO AR94-PYMT-ALLC-RT                 64760005
874374*    END-IF                                                       64770005
874375*    IF AR93LS-PYMT-ALLC-RT      IS NUMERIC                       64780005
874376*       MOVE AR93LS-PYMT-ALLC-RT   TO  WS-EDIT-S1V99              64790005
874377*       MOVE  WS-EDIT-S1V99        TO AR94LS-PYMT-ALLC-RT         64800005
874378*    ELSE                                                         64810005
874379*       MOVE ZEROES          TO AR94LS-PYMT-ALLC-RT               64820005
874380*    END-IF                                                       64830005
874381*       PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 19          64840005
874382*         IF AR93-CTD-DELQ-AM   (WS-I) IS NUMERIC                 64850005
874383*            MOVE AR93-CTD-DELQ-AM  (WS-I) TO WS-EDIT-S15V99      64860005
874384*            MOVE WS-EDIT-S15V99 TO AR94-CTD-DELQ-AM  (WS-I)      64870005
874385*         ELSE                                                    64880005
874386*            MOVE SPACES        TO AR94-CTD-DELQ-AM  (WS-I)       64890005
874387*         END-IF                                                  64900005
874388*      END-PERFORM                                                64910005
874389*       PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 19          64920005
874390*         IF AR93LS-DELQ-AM   (WS-I) IS NUMERIC                   64930005
874391*            MOVE AR93LS-DELQ-AM    (WS-I) TO WS-EDIT-S15V99      64940005
874392*            MOVE WS-EDIT-S15V99 TO AR94LS-DELQ-AM   (WS-I)       64950005
874393*         ELSE                                                    64960005
874394*            MOVE SPACES        TO AR94LS-DELQ-AM  (WS-I)         64970005
874395*         END-IF                                                  64980005
874396*      END-PERFORM                                                64990005
874397*       PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 19          65000005
874398*         IF AR93PS-DELQ-AM (WS-I) IS NUMERIC                     65010005
874399*            MOVE AR93PS-DELQ-AM  (WS-I) TO WS-EDIT-S15V99        65020005
874400*            MOVE WS-EDIT-S15V99 TO AR94PS-DELQ-AM   (WS-I)       65030005
874401*         ELSE                                                    65040005
874402*            MOVE SPACES        TO AR94PS-DELQ-AM  (WS-I)         65050005
874403*         END-IF                                                  65060005
874404*      END-PERFORM                                                65070005
874405*    IF AR93-MTHD-OVER-RIDE-NR  IS NUMERIC                        65080005
874406*       MOVE AR93-MTHD-OVER-RIDE-NR TO WS-EDIT-S3                 65090005
874407*       MOVE  WS-EDIT-S3        TO AR94-MTHD-OVER-RIDE-NR         65100005
874408*    ELSE                                                         65110005
874409*       MOVE ZEROES          TO AR94-MTHD-OVER-RIDE-NR            65120005
874410*    END-IF                                                       65130005
874411*    IF AR93-RSTR-SGMN-NR   IS NUMERIC                            65140005
874412*       MOVE AR93-RSTR-SGMN-NR      TO WS-EDIT-S3                 65150005
874413*       MOVE  WS-EDIT-S3        TO AR94-RSTR-SGMN-NR              65160005
874414*    ELSE                                                         65170005
874415*       MOVE ZEROES          TO AR94-RSTR-SGMN-NR                 65180005
874416*    END-IF                                                       65190005
874417*                                                                 65200005
874418*METHOD OVERRIDE FIELDS IN FLAP                                   65210005
874419*    MOVE  AR93-MTHDS TO AR94-MTHDS                               65220005
874420*      MOVE AR93-ICBP-RVLV-ID       TO AR94-ICBP-RVLV-ID          65230005
874421*      MOVE AR93-ICBP-RVLV-MTHD-CD  TO AR94-ICBP-RVLV-MTHD-CD     65240005
874422*      MOVE AR93-ICBP-TYPE-CD       TO AR94-ICBP-TYPE-CD          65250005
874423*      MOVE AR93-ICBP-MTHD-NM       TO AR94-ICBP-MTHD-NM          65260005
874424*      MOVE AR93LS-ICBP-TYPE-CD     TO AR94LS-ICBP-TYPE-CD        65270005
874425*      MOVE AR93LS-ICBP-MTHD-NM     TO AR94LS-ICBP-MTHD-NM        65280005
874426*      MOVE AR93PS-ICBP-TYPE-CD     TO AR94PS-ICBP-TYPE-CD        65290005
874427*      MOVE AR93PS-ICBP-MTHD-NM     TO AR94PS-ICBP-MTHD-NM        65300005
874428*      MOVE AR93PR-ICBP-TYPE-CD     TO AR94PR-ICBP-TYPE-CD        65310005
874429*      MOVE AR93PR-ICBP-MTHD-NM     TO AR94PR-ICBP-MTHD-NM        65320005
874430*      MOVE AR93M1-ICBP-MTHD-NM     TO AR94M1-ICBP-MTHD-NM        65330005
874431*      MOVE AR93M2-ICBP-MTHD-NM     TO AR94M2-ICBP-MTHD-NM        65340005
874432*      MOVE AR93M3-ICBP-MTHD-NM     TO AR94M3-ICBP-MTHD-NM        65350005
874433*      MOVE AR93-ITRO-ICBP-RVLV-ID  TO AR94-ITRO-ICBP-RVLV-ID     65360005
874434*      MOVE AR93-ITRO-ICBP-RVLV-MTHD-CD                           65370005
874435*                      TO  AR94-ITRO-ICBP-RVLV-MTHD-CD            65380005
874436*      MOVE AR93-ITRO-ICBP-TYPE-CD   TO AR94-ITRO-ICBP-TYPE-CD    65390005
874437*      MOVE AR93-ITRO-ICBP-MTHD-NM   TO AR94-ITRO-ICBP-MTHD-NM    65400005
874438*      MOVE AR93LS-ITRO-ICBP-TYPE-CD TO AR94LS-ITRO-ICBP-TYPE-CD  65410005
874439*      MOVE AR93LS-ITRO-ICBP-MTHD-NM TO AR94LS-ITRO-ICBP-MTHD-NM  65420005
874440*      MOVE AR93PS-ITRO-ICBP-TYPE-CD TO AR94PS-ITRO-ICBP-TYPE-CD  65430005
874441*      MOVE AR93PS-ITRO-ICBP-MTHD-NM TO AR94PS-ITRO-ICBP-MTHD-NM  65440005
874442*      MOVE AR93PR-ITRO-ICBP-TYPE-CD TO AR94PR-ITRO-ICBP-TYPE-CD  65450005
874443*      MOVE AR93PR-ITRO-ICBP-MTHD-NM TO AR94PR-ITRO-ICBP-MTHD-NM  65460005
874444*      MOVE AR93M1-ITRO-ICBP-MTHD-NM TO AR94M1-ITRO-ICBP-MTHD-NM  65470005
874445*      MOVE AR93M2-ITRO-ICBP-MTHD-NM TO AR94M2-ITRO-ICBP-MTHD-NM  65480005
874446*      MOVE AR93M3-ITRO-ICBP-MTHD-NM TO AR94M3-ITRO-ICBP-MTHD-NM  65490005
874447*      MOVE AR93-ICID-RVLV-ID  TO AR94-ICID-RVLV-ID               65500005
874448*      MOVE AR93-ICID-RVLV-MTHD-CD  TO AR94-ICID-RVLV-MTHD-CD     65510005
874449*      MOVE AR93-ICID-TYPE-CD    TO AR94-ICID-TYPE-CD             65520005
874450*      MOVE AR93-ICID-MTHD-NM    TO AR94-ICID-MTHD-NM             65530005
874451*      MOVE AR93LS-ICID-TYPE-CD TO AR94LS-ICID-TYPE-CD            65540005
874452*      MOVE AR93LS-ICID-MTHD-NM TO AR94LS-ICID-MTHD-NM            65550005
874453*      MOVE AR93PS-ICID-TYPE-CD TO AR94PS-ICID-TYPE-CD            65560005
874454*      MOVE AR93PS-ICID-MTHD-NM TO AR94PS-ICID-MTHD-NM            65570005
874455*      MOVE AR93PR-ICID-TYPE-CD TO AR94PR-ICID-TYPE-CD            65580005
874456*      MOVE AR93PR-ICID-MTHD-NM TO AR94PR-ICID-MTHD-NM            65590005
874457*      MOVE AR93M1-ICID-MTHD-NM TO AR94M1-ICID-MTHD-NM            65600005
874458*      MOVE AR93M2-ICID-MTHD-NM TO AR94M2-ICID-MTHD-NM            65610005
874459*      MOVE AR93M3-ICID-MTHD-NM TO AR94M3-ICID-MTHD-NM            65620005
874460*      MOVE AR93-ITRO-ICID-RVLV-ID                                65630005
874461*                     TO AR94-ITRO-ICID-RVLV-ID                   65640005
874462*      MOVE AR93-ITRO-ICID-RVLV-MTHD-CD                           65650005
874463*                     TO AR94-ITRO-ICID-RVLV-MTHD-CD              65660005
874464*      MOVE AR93-ITRO-ICID-TYPE-CD TO AR94-ITRO-ICID-TYPE-CD      65670005
874465*      MOVE AR93-ITRO-ICID-MTHD-NM TO AR94-ITRO-ICID-MTHD-NM      65680005
874466*      MOVE AR93LS-ITRO-ICID-TYPE-CD                              65690005
874467*                           TO AR94LS-ITRO-ICID-TYPE-CD           65700005
874468*      MOVE AR93LS-ITRO-ICID-MTHD-NM                              65710005
874469*                           TO AR94LS-ITRO-ICID-MTHD-NM           65720005
874470*      MOVE AR93PS-ITRO-ICID-TYPE-CD                              65730005
874471*                           TO AR94PS-ITRO-ICID-TYPE-CD           65740005
874472*      MOVE AR93PS-ITRO-ICID-MTHD-NM                              65750005
874473*                           TO AR94PS-ITRO-ICID-MTHD-NM           65760005
874474*      MOVE AR93PR-ITRO-ICID-TYPE-CD                              65770005
874475*                           TO AR94PR-ITRO-ICID-TYPE-CD           65780005
874476*      MOVE AR93PR-ITRO-ICID-MTHD-NM                              65790005
874477*                           TO AR94PR-ITRO-ICID-MTHD-NM           65800005
874478*      MOVE AR93M1-ITRO-ICID-MTHD-NM                              65810005
874479*                           TO AR94M1-ITRO-ICID-MTHD-NM           65820005
874480*      MOVE AR93M2-ITRO-ICID-MTHD-NM                              65830005
874481*                           TO AR94M2-ITRO-ICID-MTHD-NM           65840005
874482*      MOVE AR93M3-ITRO-ICID-MTHD-NM                              65850005
874483*                           TO AR94M3-ITRO-ICID-MTHD-NM           65860005
874484*      MOVE AR93-ICII-RVLV-ID      TO AR94-ICII-RVLV-ID           65870005
874485*      MOVE AR93-ICII-RVLV-MTHD-CD TO AR94-ICII-RVLV-MTHD-CD      65880005
874486*      MOVE AR93-ICII-TYPE-CD      TO AR94-ICII-TYPE-CD           65890005
874487*      MOVE AR93-ICII-MTHD-NM      TO AR94-ICII-MTHD-NM           65900005
874488*      MOVE AR93LS-ICII-TYPE-CD    TO AR94LS-ICII-TYPE-CD         65910005
874489*      MOVE AR93LS-ICII-MTHD-NM    TO AR94LS-ICII-MTHD-NM         65920005
874490*      MOVE AR93PS-ICII-TYPE-CD    TO AR94PS-ICII-TYPE-CD         65930005
874491*      MOVE AR93PS-ICII-MTHD-NM    TO AR94PS-ICII-MTHD-NM         65940005
874492*      MOVE AR93PR-ICII-TYPE-CD    TO AR94PR-ICII-TYPE-CD         65950005
874493*      MOVE AR93PR-ICII-MTHD-NM    TO AR94PR-ICII-MTHD-NM         65960005
874494*      MOVE AR93M1-ICII-MTHD-NM    TO AR94M1-ICII-MTHD-NM         65970005
874495*      MOVE AR93M2-ICII-MTHD-NM    TO AR94M2-ICII-MTHD-NM         65980005
874496*      MOVE AR93M3-ICII-MTHD-NM    TO AR94M3-ICII-MTHD-NM         65990005
874497*      MOVE AR93-ICIM-RVLV-ID      TO AR94-ICIM-RVLV-ID           66000005
874498*      MOVE AR93-ICIM-RVLV-MTHD-CD TO AR94-ICIM-RVLV-MTHD-CD      66010005
874499*      MOVE AR93-ICIM-TYPE-CD      TO AR94-ICIM-TYPE-CD           66020005
874500*      MOVE AR93-ICIM-MTHD-NM      TO AR94-ICIM-MTHD-NM           66030005
874501*      MOVE AR93LS-ICIM-TYPE-CD    TO AR94LS-ICIM-TYPE-CD         66040005
874502*      MOVE AR93LS-ICIM-MTHD-NM    TO AR94LS-ICIM-MTHD-NM         66050005
874503*      MOVE AR93PS-ICIM-TYPE-CD    TO AR94PS-ICIM-TYPE-CD         66060005
874504*      MOVE AR93PS-ICIM-MTHD-NM    TO AR94PS-ICIM-MTHD-NM         66070005
874505*      MOVE AR93PR-ICIM-TYPE-CD    TO AR94PR-ICIM-TYPE-CD         66080005
874506*      MOVE AR93PR-ICIM-MTHD-NM    TO AR94PR-ICIM-MTHD-NM         66090005
874507*      MOVE AR93M1-ICIM-MTHD-NM    TO AR94M1-ICIM-MTHD-NM         66100005
874508*      MOVE AR93M2-ICIM-MTHD-NM    TO AR94M2-ICIM-MTHD-NM         66110005
874509*      MOVE AR93M3-ICIM-MTHD-NM    TO AR94M3-ICIM-MTHD-NM         66120005
874510*      MOVE AR93-ICIR-RVLV-ID      TO AR94-ICIR-RVLV-ID           66130005
874511*      MOVE AR93-ICIR-RVLV-MTHD-CD TO AR94-ICIR-RVLV-MTHD-CD      66140005
874512*      MOVE AR93-ICIR-TYPE-CD      TO AR94-ICIR-TYPE-CD           66150005
874513*      MOVE AR93-ICIR-MTHD-NM      TO AR94-ICIR-MTHD-NM           66160005
874514*      MOVE AR93LS-ICIR-TYPE-CD    TO AR94LS-ICIR-TYPE-CD         66170005
874515*      MOVE AR93LS-ICIR-MTHD-NM    TO AR94LS-ICIR-MTHD-NM         66180005
874516*      MOVE AR93PS-ICIR-TYPE-CD    TO AR94PS-ICIR-TYPE-CD         66190005
874517*      MOVE AR93PS-ICIR-MTHD-NM    TO AR94PS-ICIR-MTHD-NM         66200005
874518*      MOVE AR93PR-ICIR-TYPE-CD    TO AR94PR-ICIR-TYPE-CD         66210005
874519*      MOVE AR93PR-ICIR-MTHD-NM    TO AR94PR-ICIR-MTHD-NM         66220005
874520*      MOVE AR93M1-ICIR-MTHD-NM    TO AR94M1-ICIR-MTHD-NM         66230005
874521*      MOVE AR93M2-ICIR-MTHD-NM    TO AR94M2-ICIR-MTHD-NM         66240005
874522*      MOVE AR93M3-ICIR-MTHD-NM    TO AR94M3-ICIR-MTHD-NM         66250005
874523*      MOVE AR93-ITRO-ICIR-RVLV-ID TO AR94-ITRO-ICIR-RVLV-ID      66260005
874524*      MOVE AR93-ITRO-ICIR-RVLV-MTHD-CD TO                        66270005
874525*                                  AR94-ITRO-ICIR-RVLV-MTHD-CD    66280005
874526*      MOVE AR93-ITRO-ICIR-TYPE-CD TO AR94-ITRO-ICIR-TYPE-CD      66290005
874527*      MOVE AR93-ITRO-ICIR-MTHD-NM    TO AR94-ITRO-ICIR-MTHD-NM   66300005
874528*      MOVE AR93LS-ITRO-ICIR-TYPE-CD  TO AR94LS-ITRO-ICIR-TYPE-CD 66310005
874529*      MOVE AR93LS-ITRO-ICIR-MTHD-NM  TO AR94LS-ITRO-ICIR-MTHD-NM 66320005
874530*      MOVE AR93PS-ITRO-ICIR-TYPE-CD  TO AR94PS-ITRO-ICIR-TYPE-CD 66330005
874531*      MOVE AR93PS-ITRO-ICIR-MTHD-NM  TO AR94PS-ITRO-ICIR-MTHD-NM 66340005
874532*      MOVE AR93PR-ITRO-ICIR-TYPE-CD  TO AR94PR-ITRO-ICIR-TYPE-CD 66350005
874533*      MOVE AR93PR-ITRO-ICIR-MTHD-NM  TO AR94PR-ITRO-ICIR-MTHD-NM 66360005
874534*      MOVE AR93M1-ITRO-ICIR-MTHD-NM  TO AR94M1-ITRO-ICIR-MTHD-NM 66370005
874535*      MOVE AR93M2-ITRO-ICIR-MTHD-NM  TO AR94M2-ITRO-ICIR-MTHD-NM 66380005
874536*      MOVE AR93M3-ITRO-ICIR-MTHD-NM  TO AR94M3-ITRO-ICIR-MTHD-NM 66390005
874537*      MOVE AR93-ICPE-RVLV-ID         TO AR94-ICPE-RVLV-ID        66400005
874538*      MOVE AR93-ICPE-RVLV-MTHD-CD    TO AR94-ICPE-RVLV-MTHD-CD   66410005
874539*      MOVE AR93-ICPE-TYPE-CD         TO AR94-ICPE-TYPE-CD        66420005
874540*      MOVE AR93-ICPE-MTHD-NM         TO AR94-ICPE-MTHD-NM        66430005
874541*      MOVE AR93LS-ICPE-TYPE-CD       TO AR94LS-ICPE-TYPE-CD      66440005
874542*      MOVE AR93LS-ICPE-MTHD-NM       TO AR94LS-ICPE-MTHD-NM      66450005
874543*      MOVE AR93PS-ICPE-TYPE-CD       TO AR94PS-ICPE-TYPE-CD      66460005
874544*      MOVE AR93PS-ICPE-MTHD-NM       TO AR94PS-ICPE-MTHD-NM      66470005
874545*      MOVE AR93PR-ICPE-TYPE-CD       TO AR94PR-ICPE-TYPE-CD      66480005
874546*      MOVE AR93PR-ICPE-MTHD-NM       TO AR94PR-ICPE-MTHD-NM      66490005
874547*      MOVE AR93M1-ICPE-MTHD-NM       TO AR94M1-ICPE-MTHD-NM      66500005
874548*      MOVE AR93M2-ICPE-MTHD-NM       TO AR94M2-ICPE-MTHD-NM      66510005
874549*      MOVE AR93M3-ICPE-MTHD-NM       TO AR94M3-ICPE-MTHD-NM      66520005
874550*      MOVE AR93-ITRO-ICPE-RVLV-ID    TO AR94-ITRO-ICPE-RVLV-ID   66530005
874551*      MOVE AR93-ITRO-ICPE-RVLV-MTHD-CD TO                        66540005
874552*                                    AR94-ITRO-ICPE-RVLV-MTHD-CD  66550005
874553*      MOVE AR93-ITRO-ICPE-TYPE-CD    TO AR94-ITRO-ICPE-TYPE-CD   66560005
874554*      MOVE AR93-ITRO-ICPE-MTHD-NM    TO AR94-ITRO-ICPE-MTHD-NM   66570005
874555*      MOVE AR93LS-ITRO-ICPE-TYPE-CD  TO AR94LS-ITRO-ICPE-TYPE-CD 66580005
874556*      MOVE AR93LS-ITRO-ICPE-MTHD-NM  TO AR94LS-ITRO-ICPE-MTHD-NM 66590005
874557*      MOVE AR93PS-ITRO-ICPE-TYPE-CD  TO AR94PS-ITRO-ICPE-TYPE-CD 66600005
874558*      MOVE AR93PS-ITRO-ICPE-MTHD-NM  TO AR94PS-ITRO-ICPE-MTHD-NM 66610005
874559*      MOVE AR93PR-ITRO-ICPE-TYPE-CD  TO AR94PR-ITRO-ICPE-TYPE-CD 66620005
874560*      MOVE AR93PR-ITRO-ICPE-MTHD-NM  TO AR94PR-ITRO-ICPE-MTHD-NM 66630005
874561*      MOVE AR93M1-ITRO-ICPE-MTHD-NM  TO AR94M1-ITRO-ICPE-MTHD-NM 66640005
874562*      MOVE AR93M2-ITRO-ICPE-MTHD-NM  TO AR94M2-ITRO-ICPE-MTHD-NM 66650005
874563*      MOVE AR93M3-ITRO-ICPE-MTHD-NM  TO AR94M3-ITRO-ICPE-MTHD-NM 66660005
874564*      MOVE AR93-ICVI-RVLV-ID         TO AR94-ICVI-RVLV-ID        66670005
874565*      MOVE AR93-ICVI-RVLV-MTHD-CD    TO AR94-ICVI-RVLV-MTHD-CD   66680005
874566*      MOVE AR93-ICVI-TYPE-CD         TO AR94-ICVI-TYPE-CD        66690005
874567*      MOVE AR93-ICVI-MTHD-NM         TO AR94-ICVI-MTHD-NM        66700005
874568*      MOVE AR93LS-ICVI-TYPE-CD       TO AR94LS-ICVI-TYPE-CD      66710005
874569*      MOVE AR93LS-ICVI-MTHD-NM       TO AR94LS-ICVI-MTHD-NM      66720005
874570*      MOVE AR93PS-ICVI-TYPE-CD       TO AR94PS-ICVI-TYPE-CD      66730005
874571*      MOVE AR93PS-ICVI-MTHD-NM       TO AR94PS-ICVI-MTHD-NM      66740005
874572*      MOVE AR93PR-ICVI-TYPE-CD       TO AR94PR-ICVI-TYPE-CD      66750005
874573*      MOVE AR93PR-ICVI-MTHD-NM       TO AR94PR-ICVI-MTHD-NM      66760005
874574*      MOVE AR93M1-ICVI-MTHD-NM       TO AR94M1-ICVI-MTHD-NM      66770005
874575*      MOVE AR93M2-ICVI-MTHD-NM       TO AR94M2-ICVI-MTHD-NM      66780005
874576*      MOVE AR93M3-ICVI-MTHD-NM       TO AR94M3-ICVI-MTHD-NM      66790005
874577*      MOVE AR93-ITRO-ICVI-RVLV-ID    TO AR94-ITRO-ICVI-RVLV-ID   66800005
874578*      MOVE AR93-ITRO-ICVI-RVLV-MTHD-CD TO                        66810005
874579*                                    AR94-ITRO-ICVI-RVLV-MTHD-CD  66820005
874580*      MOVE AR93-ITRO-ICVI-TYPE-CD    TO AR94-ITRO-ICVI-TYPE-CD   66830005
874581*      MOVE AR93-ITRO-ICVI-MTHD-NM    TO AR94-ITRO-ICVI-MTHD-NM   66840005
874582*      MOVE AR93LS-ITRO-ICVI-TYPE-CD  TO AR94LS-ITRO-ICVI-TYPE-CD 66850005
874583*      MOVE AR93LS-ITRO-ICVI-MTHD-NM  TO AR94LS-ITRO-ICVI-MTHD-NM 66860005
874584*      MOVE AR93PS-ITRO-ICVI-TYPE-CD  TO AR94PS-ITRO-ICVI-TYPE-CD 66870005
874585*      MOVE AR93PS-ITRO-ICVI-MTHD-NM  TO AR94PS-ITRO-ICVI-MTHD-NM 66880005
874586*      MOVE AR93PR-ITRO-ICVI-TYPE-CD  TO AR94PR-ITRO-ICVI-TYPE-CD 66890005
874587*      MOVE AR93PR-ITRO-ICVI-MTHD-NM  TO AR94PR-ITRO-ICVI-MTHD-NM 66900005
874588*      MOVE AR93M1-ITRO-ICVI-MTHD-NM  TO AR94M1-ITRO-ICVI-MTHD-NM 66910005
874589*      MOVE AR93M2-ITRO-ICVI-MTHD-NM  TO AR94M2-ITRO-ICVI-MTHD-NM 66920005
874590*      MOVE AR93M3-ITRO-ICVI-MTHD-NM  TO AR94M3-ITRO-ICVI-MTHD-NM 66930005
874591*      MOVE AR93-IOCI-RVLV-ID         TO AR94-IOCI-RVLV-ID        66940005
874592*      MOVE AR93-IOCI-RVLV-MTHD-CD    TO AR94-IOCI-RVLV-MTHD-CD   66950005
874593*      MOVE AR93-IOCI-TYPE-CD         TO AR94-IOCI-TYPE-CD        66960005
874594*      MOVE AR93-IOCI-MTHD-NM         TO AR94-IOCI-MTHD-NM        66970005
874595*      MOVE AR93LS-IOCI-TYPE-CD       TO AR94LS-IOCI-TYPE-CD      66980005
874596*      MOVE AR93LS-IOCI-MTHD-NM       TO AR94LS-IOCI-MTHD-NM      66990005
874597*      MOVE AR93PS-IOCI-TYPE-CD       TO AR94PS-IOCI-TYPE-CD      67000005
874598*      MOVE AR93PS-IOCI-MTHD-NM       TO AR94PS-IOCI-MTHD-NM      67010005
874599*      MOVE AR93PR-IOCI-TYPE-CD       TO AR94PR-IOCI-TYPE-CD      67020005
874600*      MOVE AR93PR-IOCI-MTHD-NM       TO AR94PR-IOCI-MTHD-NM      67030005
874601*      MOVE AR93M1-IOCI-MTHD-NM       TO AR94M1-IOCI-MTHD-NM      67040005
874602*      MOVE AR93M2-IOCI-MTHD-NM       TO AR94M2-IOCI-MTHD-NM      67050005
874603*      MOVE AR93-IOMI-RVLV-ID         TO AR94-IOMI-RVLV-ID        67060005
874604*      MOVE AR93-IOMI-RVLV-MTHD-CD    TO AR94-IOMI-RVLV-MTHD-CD   67070005
874605*      MOVE AR93-IOMI-TYPE-CD         TO AR94-IOMI-TYPE-CD        67080005
874606*      MOVE AR93-IOMI-MTHD-NM         TO AR94-IOMI-MTHD-NM        67090005
874607*      MOVE AR93LS-IOMI-TYPE-CD       TO AR94LS-IOMI-TYPE-CD      67100005
874608*      MOVE AR93LS-IOMI-MTHD-NM       TO AR94LS-IOMI-MTHD-NM      67110005
874609*      MOVE AR93PS-IOMI-TYPE-CD       TO AR94PS-IOMI-TYPE-CD      67120005
874610*      MOVE AR93PS-IOMI-MTHD-NM       TO AR94PS-IOMI-MTHD-NM      67130005
874611*      MOVE AR93PR-IOMI-TYPE-CD       TO AR94PR-IOMI-TYPE-CD      67140005
874612*      MOVE AR93PR-IOMI-MTHD-NM       TO AR94PR-IOMI-MTHD-NM      67150005
874613*      MOVE AR93M1-IOMI-MTHD-NM       TO AR94M1-IOMI-MTHD-NM      67160005
874614*      MOVE AR93M2-IOMI-MTHD-NM  TO AR94M2-IOMI-MTHD-NM           67170005
874615*      MOVE AR93M3-IOMI-MTHD-NM  TO AR94M3-IOMI-MTHD-NM           67180005
874616*      MOVE AR93-OCRB-RVLV-ID    TO AR94-OCRB-RVLV-ID             67190005
874617*      MOVE AR93-OCRB-RVLV-MTHD-CD TO AR94-OCRB-RVLV-MTHD-CD      67200005
874618*      MOVE AR93-OCRB-TYPE-CD      TO AR94-OCRB-TYPE-CD           67210005
874619*      MOVE AR93-OCRB-MTHD-NM      TO AR94-OCRB-MTHD-NM           67220005
874620*      MOVE AR93LS-OCRB-TYPE-CD    TO AR94LS-OCRB-TYPE-CD         67230005
874621*      MOVE AR93LS-OCRB-MTHD-NM    TO AR94LS-OCRB-MTHD-NM         67240005
874622*      MOVE AR93PS-OCRB-TYPE-CD    TO AR94PS-OCRB-TYPE-CD         67250005
874623*      MOVE AR93PS-OCRB-MTHD-NM    TO AR94PS-OCRB-MTHD-NM         67260005
874624*      MOVE AR93PR-OCRB-TYPE-CD    TO AR94PR-OCRB-TYPE-CD         67270005
874625*      MOVE AR93PR-OCRB-MTHD-NM    TO AR94PR-OCRB-MTHD-NM         67280005
874626*      MOVE AR93M1-OCRB-MTHD-NM    TO AR94M1-OCRB-MTHD-NM         67290005
874627*      MOVE AR93M2-OCRB-MTHD-NM    TO AR94M2-OCRB-MTHD-NM         67300005
874628*      MOVE AR93M3-OCRB-MTHD-NM    TO AR94M3-OCRB-MTHD-NM         67310005
874629*      MOVE AR93-RTMP-RVLV-ID      TO AR94-RTMP-RVLV-ID           67320005
874630*      MOVE AR93-RTMP-RVLV-MTHD-CD TO AR94-RTMP-RVLV-MTHD-CD      67330005
874631*      MOVE AR93-RTMP-TYPE-CD  TO AR94-RTMP-TYPE-CD               67340005
874632*      MOVE AR93-RTMP-MTHD-NM  TO AR94-RTMP-MTHD-NM               67350005
874633*      MOVE AR93LS-RTMP-TYPE-CD  TO AR94LS-RTMP-TYPE-CD           67360005
874634*      MOVE AR93LS-RTMP-MTHD-NM  TO AR94LS-RTMP-MTHD-NM           67370005
874635*      MOVE AR93PS-RTMP-TYPE-CD  TO AR94PS-RTMP-TYPE-CD           67380005
874636*      MOVE AR93PS-RTMP-MTHD-NM  TO AR94PS-RTMP-MTHD-NM           67390005
874637*      MOVE AR93PR-RTMP-TYPE-CD  TO AR94PR-RTMP-TYPE-CD           67400005
874638*      MOVE AR93PR-RTMP-MTHD-NM  TO AR94PR-RTMP-MTHD-NM           67410005
874639*      MOVE AR93M1-RTMP-MTHD-NM  TO AR94M1-RTMP-MTHD-NM           67420005
874640*      MOVE AR93M2-RTMP-MTHD-NM  TO AR94M2-RTMP-MTHD-NM           67430005
874641*      MOVE AR93M3-RTMP-MTHD-NM  TO AR94M3-RTMP-MTHD-NM           67440005
874642*                                                                 67450005
874643*    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 16             67460005
874644*      MOVE AR93-RVLV-ID  (WS-I) TO AR94-RVLV-ID (WS-I)           67470005
874645*      MOVE AR93-RVLV-MTHD-CD (WS-I) TO AR94-RVLV-MTHD-CD (WS-I)  67480005
874646*      MOVE AR93-RVLV-MTHD-TX (WS-I)  TO AR94-RVLV-MTHD-TX (WS-I) 67490005
874647*      MOVE AR93-TYPE-CD (WS-I)   TO AR94-TYPE-CD (WS-I)          67500005
874648*      MOVE AR93-CRRN-MTHD-NM (WS-I) TO AR94-CRRN-MTHD-NM (WS-I)  67510005
874649*      MOVE AR93LS-TYPE-CD (WS-I)    TO AR94LS-TYPE-CD (WS-I)     67520005
874650*      MOVE AR93LS-MTHD-NM (WS-I)   TO AR94LS-MTHD-NM (WS-I)      67530005
874651*      MOVE AR93PS-TYPE-CD (WS-I)   TO AR94PS-TYPE-CD (WS-I)      67540005
874652*      MOVE AR93PS-MTHD-NM (WS-I)   TO AR94PS-MTHD-NM (WS-I)      67550005
874653*      MOVE AR93PR-TYPE-CD  (WS-I)  TO AR94PR-TYPE-CD (WS-I)      67560005
874654*      MOVE AR93PR-MTHD-NM (WS-I)   TO AR94PR-MTHD-NM (WS-I)      67570005
874655*      MOVE AR93M1-MTHD-NM (WS-I)  TO AR94M1-MTHD-NM (WS-I)       67580005
874656*      MOVE AR93M2-MTHD-NM (WS-I) TO AR94M2-MTHD-NM (WS-I)        67590005
874657*      MOVE AR93M3-MTHD-NM (WS-I)  TO AR94M3-MTHD-NM (WS-I)       67600005
874658*    END-PERFORM                                                  67610005
874659*                                                                 67620005
874660*    IF AR93-RSTR-RGLR-INTR-RT  IS NUMERIC                        67630005
874661*       MOVE AR93-RSTR-RGLR-INTR-RT  TO WS-EDIT-S2V999            67640005
874662*       MOVE  WS-EDIT-S2V999    TO AR94-RSTR-RGLR-INTR-RT         67650005
874663*    ELSE                                                         67660005
874664*       MOVE ZEROES          TO AR94-RSTR-RGLR-INTR-RT            67670005
874665*    END-IF                                                       67680005
874666*    IF AR93-RSTR-ITRO-INTR-RT  IS NUMERIC                        67690005
874667*       MOVE AR93-RSTR-ITRO-INTR-RT  TO WS-EDIT-S2V999            67700005
874668*       MOVE  WS-EDIT-S2V999    TO AR94-RSTR-ITRO-INTR-RT         67710005
874669*    ELSE                                                         67720005
874670*       MOVE ZEROES          TO AR94-RSTR-ITRO-INTR-RT            67730005
874671*    END-IF                                                       67740005
874672*    IF AR93-RSTR-MIN-INTR-RT   IS NUMERIC                        67750005
874673*       MOVE AR93-RSTR-MIN-INTR-RT   TO WS-EDIT-S2V999            67760005
874674*       MOVE  WS-EDIT-S2V999    TO AR94-RSTR-MIN-INTR-RT          67770005
874675*    ELSE                                                         67780005
874676*       MOVE ZEROES          TO AR94-RSTR-MIN-INTR-RT             67790005
874677*    END-IF                                                       67800005
874678*    IF AR93-RSTR-MAX-INTR-RT   IS NUMERIC                        67810005
874679*       MOVE AR93-RSTR-MAX-INTR-RT   TO WS-EDIT-S2V999            67820005
874680*       MOVE  WS-EDIT-S2V999    TO AR94-RSTR-MAX-INTR-RT          67830005
874681*    ELSE                                                         67840005
874682*       MOVE ZEROES          TO AR94-RSTR-MAX-INTR-RT             67850005
874683*    END-IF                                                       67860005
874684*      MOVE AR93-RSTR-PRMT-NM     TO AR94-RSTR-PRMT-NM            67870005
874685*    IF AR93-RSTR-DELY-INTR-END-DT IS NUMERIC                     67880005
874686*       MOVE AR93-RSTR-DELY-INTR-END-DT TO WS-EDIT-S7             67890005
874687*       MOVE WS-EDIT-S7       TO AR94-RSTR-DELY-INTR-END-DT       67900005
874688*    ELSE                                                         67910005
874689*       MOVE ZEROES          TO AR94-RSTR-DELY-INTR-END-DT        67920005
874690*    END-IF                                                       67930005
874691*    IF AR93-RSTR-DELY-PAY-END-DT IS NUMERIC                      67940005
874692*       MOVE AR93-RSTR-DELY-PAY-END-DT TO WS-EDIT-S7              67950005
874693*       MOVE WS-EDIT-S7      TO AR94-RSTR-DELY-PAY-END-DT         67960005
874694*    ELSE                                                         67970005
874695*       MOVE ZEROES          TO AR94-RSTR-DELY-PAY-END-DT         67980005
874696*    END-IF                                                       67990005
874697*    IF AR93-RSTR-CASH-OPTN-END-DT IS NUMERIC                     68000005
874698*       MOVE AR93-RSTR-CASH-OPTN-END-DT TO WS-EDIT-S7             68010005
874699*       MOVE WS-EDIT-S7      TO AR94-RSTR-CASH-OPTN-END-DT        68020005
874700*    ELSE                                                         68030005
874701*       MOVE ZEROES          TO AR94-RSTR-CASH-OPTN-END-DT        68040005
874702*    END-IF                                                       68050005
874703*      MOVE AR93-RSTR-RVLV-SWTC-CD TO AR94-RSTR-RVLV-SWTC-CD      68060005
874704*      MOVE AR93-RSTR-RVLV-SWTC-TWO-CD TO                         68070005
874705*                                  AR94-RSTR-RVLV-SWTC-TWO-CD     68080005
874706*      MOVE AR93-RSTR-ICID-TYPE-CD TO AR94-RSTR-ICID-TYPE-CD      68090005
874707*      MOVE AR93-RSTR-ICID-MTHD-NM TO AR94-RSTR-ICID-MTHD-NM      68100005
874708*      MOVE AR93-RSTR-ITRO-ICVI-MTHD-NM TO                        68110005
874709*                                  AR94-RSTR-ITRO-ICVI-MTHD-NM    68120005
874710*      MOVE AR93-RSTR-FLAP-CLSS-DR-CD TO                          68130005
874711*                                  AR94-RSTR-FLAP-CLSS-DR-CD      68140005
874712*      MOVE AR93-RSTR-FLAP-CLSS-DT TO AR94-RSTR-FLAP-CLSS-DT      68150005
874713*      MOVE AR93-RSTR-RTRN-TO-RVLV-CD TO AR94-RSTR-RTRN-TO-RVLV-CD68160005
874714*    IF AR93-RSTR-RTRN-TO-RVLV-DT IS NUMERIC                      68170005
874715*       MOVE AR93-RSTR-RTRN-TO-RVLV-DT TO WS-EDIT-S9              68180005
874716*       MOVE WS-EDIT-S9      TO AR94-RSTR-RTRN-TO-RVLV-DT         68190005
874717*    ELSE                                                         68200005
874718*       MOVE ZEROES          TO AR94-RSTR-RTRN-TO-RVLV-DT         68210005
874719*    END-IF                                                       68220005
874720*    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 3              68230005
874721*          MOVE AR93-ICID-RSTR-MST-ITEM(WS-I)                     68240005
874722*                             TO AR94-ICID-RSTR-MST-ITEM(WS-I)    68250005
874723*      MOVE AR93M1-RSTR-ICID-MTHD-NM  TO                          68260005
874724*                              AR94M1-RSTR-ICID-MTHD-NM           68270005
874725*      MOVE AR93M2-RSTR-ICID-MTHD-NM  TO                          68280005
874726*                                  AR94M2-RSTR-ICID-MTHD-NM       68290005
874727*      MOVE AR93M3-RSTR-ICID-MTHD-NM TO                           68300005
874728*                                  AR94M3-RSTR-ICID-MTHD-NM       68310005
874729*    END-PERFORM                                                  68320005
874730*    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 3              68330005
874731*          MOVE AR93-ICIM-RSTR-MST-ITEM (WS-I)                    68340005
874732*                             TO AR94-ICIM-RSTR-MST-ITEM (WS-I)   68350005
874733*    END-PERFORM                                                  68360005
874734*      MOVE AR93M1-RSTR-ICIM-MTHD-NM  TO                          68370005
874735*                                  AR94M1-RSTR-ICIM-MTHD-NM       68380005
874736*      MOVE AR93M2-RSTR-ICIM-MTHD-NM  TO                          68390005
874737*                                  AR94M2-RSTR-ICIM-MTHD-NM       68400005
874738*      MOVE AR93M3-RSTR-ICIM-MTHD-NM  TO                          68410005
874739*                                  AR94M3-RSTR-ICIM-MTHD-NM       68420005
874740*    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 3              68430005
874741*          MOVE AR93-ICVI-RSTR-MST-ITEM (WS-I)                    68440005
874742*                             TO AR94-ICVI-RSTR-MST-ITEM (WS-I)   68450005
874743*    END-PERFORM                                                  68460005
874744*      MOVE AR93M1-RSTR-ICVI-MTHD-NM  TO                          68470005
874745*                                  AR94M1-RSTR-ICVI-MTHD-NM       68480005
874746*      MOVE AR93M2-RSTR-ICVI-MTHD-NM  TO                          68490005
874747*                                  AR94M2-RSTR-ICVI-MTHD-NM       68500005
874748*      MOVE AR93M3-RSTR-ICVI-MTHD-NM  TO                          68510005
874749*                                  AR94M3-RSTR-ICVI-MTHD-NM       68520005
874750*    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 3              68530005
874751*          MOVE AR93-ICBP-RSTR-MST-ITEM (WS-I)                    68540005
874752*                             TO AR94-ICBP-RSTR-MST-ITEM (WS-I)   68550005
874753*    END-PERFORM                                                  68560005
874754*      MOVE AR93M1-RSTR-ICBP-MTHD-NM  TO                          68570005
874755*                                  AR94M1-RSTR-ICBP-MTHD-NM       68580005
874756*      MOVE AR93M2-RSTR-ICBP-MTHD-NM  TO                          68590005
874757*                                  AR94M2-RSTR-ICBP-MTHD-NM       68600005
874758*      MOVE AR93M3-RSTR-ICBP-MTHD-NM  TO                          68610005
874759*                                  AR94M3-RSTR-ICBP-MTHD-NM       68620005
874760*    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 3              68630005
874761*          MOVE AR93-ICII-RSTR-MST-ITEM (WS-I)                    68640005
874762*                             TO  AR94-ICII-RSTR-MST-ITEM (WS-I)  68650005
874763*    END-PERFORM                                                  68660005
874764*                                                                 68670005
874765*      MOVE AR93M1-RSTR-ICII-MTHD-NM  TO AR94M1-RSTR-ICII-MTHD-NM 68680005
874766*      MOVE AR93M2-RSTR-ICII-MTHD-NM  TO AR94M2-RSTR-ICII-MTHD-NM 68690005
874767*      MOVE AR93M3-RSTR-ICII-MTHD-NM  TO AR94M3-RSTR-ICII-MTHD-NM 68700005
874768*      MOVE AR93-RSTR-ICIP-MTHD-NM TO AR94-RSTR-ICIP-MTHD-NM      68710005
874769*      MOVE AR93-RSTR-ICIV-MTHD-NM TO AR94-RSTR-ICIV-MTHD-NM      68720005
874770*      MOVE AR93-RSTR-ICIB-MTHD-NM TO AR94-RSTR-ICIB-MTHD-NM      68730005
874771*    PERFORM 8000-JUNK-VALUE-CHK-PARA                             68740005
874772*      WRITE FLAP-PROMO-OUT-REC  FROM AR94-RECORD                 68750005
874773*      ADD 1                       TO PV-FLAP-COUNT.              68760005
874774******************************************************************68770005
874775* Z050 - INITIALIZE                                               68780005
874776******************************************************************68790005
874777 Z050-INITIALIZE.                                                 68800005
874778                                                                  68810005
874779     OPEN INPUT  CARD-MASTER-IN-FILE.                             68820005
874780     OPEN OUTPUT CARD-MASTER-OUT-FILE.                            68830005
874781*                METHOD-OVERRIDE-OUT-FILE                         68840005
874782*                FLAP-PROMO-OUT-FILE.                             68850005
874783     INITIALIZE AR97-MASTER-DATA.                                 68860005
874784                                                                  68870005
874785******************************************************************68880005
874786* Z100 - PREFORMS TASK TERMINATION PROCESSING                     68890005
874787******************************************************************68900005
874788 Z100-END-PROC.                                                   68910005
874789     DISPLAY ' '.                                                 68920005
874790     DISPLAY '**********************'.                            68930005
874791     DISPLAY '   ARKUT120 CONTROLS  '.                            68940005
874792     DISPLAY '**********************'.                            68950005
874793     DISPLAY ' '.                                                 68960005
874794     DISPLAY 'RECORDS READ   : ' PV-READ-COUNT.                   68970005
874795     DISPLAY 'MSTR REC WRITES: ' PV-MSTR-COUNT.                   68980005
874796                                                                  68990005
874797     IF PV-READ-COUNT = 0                                         69000005
874798        DISPLAY ' '                                               69010005
874799        DISPLAY '*** NO CARD MASTER RECORDS TO REFORMAT ***'      69020005
874800     END-IF.                                                      69030005
874801                                                                  69040005
874802     CLOSE CARD-MASTER-IN-FILE                                    69050005
874803           CARD-MASTER-OUT-FILE.                                  69060005
874804                                                                  69070005
874805******************************************************************69080005
874806* Z999 - ABEND ROUTINE                                            69090005
874807******************************************************************69100005
874808 Z999-ABEND.                                                      69110005
874809                                                                  69120005
874810     CALL 'ILBOABN0' USING ABEND-CODE.                            69130005
874820                                                                  69140005
874900******************************************************************69150005
