      *****************************************************************         
       IDENTIFICATION DIVISION.                                                 
      *****************************************************************         
                                                                                
       PROGRAM-ID.             ARKUT134.                                        
       AUTHOR.                 COGNIZANT.                                       
       INSTALLATION.           KOHLS DEPARTMENT STORES.                         
       DATE-WRITTEN            JULY 2019.                                       
       DATE-COMPILED.                                                           
                                                                                
      *****************************************************************         
      *  PURPOSE:                                                               
      *  THIS PROGRAM WILL TOKENIZE THE ACCOUNT NUMBER FIELD IN THE             
      *  INPUT FILE.                                                            
      *  PROTEGRITY MODULE WILL BE INVOKED TO TOKENIZE THE ACCOUNT              
      *  NUMBER                                                                 
      *                                                                         
      *  INPUT FILES :   DEFEDGE-FAD-FILE          DDNAME = INP01               
      *  OUTPUT FILES:   DEFEDGE-FAD-TOKEN-FILE    DDNAME = OUT01               
      *                                                                         
      *****************************************************************         
      *----------------------------------------------------------------*        
      *                                                                *        
      * DATE:        07/24/2019                                        *        
      * WR/IR#:      CHG0230275                                        *        
      * PROGRAMMER:  COGNIZANT                                         *        
      * DESCRIPTION: INITIAL VERSION CREATED FOR FD FILE TRANSFER      *        
      *              PROJECT                                           *        
      *                                                                *        
      *----------------------------------------------------------------*        
      *****************************************************************         
       ENVIRONMENT DIVISION.                                                    
      *****************************************************************         
                                                                                
       CONFIGURATION SECTION.                                                   
                                                                                
       SOURCE-COMPUTER.        IBM-3090.                                        
                                                                                
       OBJECT-COMPUTER.        IBM-3090.                                        
                                                                                
       INPUT-OUTPUT SECTION.                                                    
                                                                                
       FILE-CONTROL.                                                            
                                                                                
           SELECT DEFEDGE-FAD-FILE                                              
               ASSIGN TO INP01.                                                 
                                                                                
           SELECT DEFEDGE-FAD-TOKEN-FILE                                        
               ASSIGN TO OUT01.                                                 
                                                                                
      ******************************************************************        
       DATA DIVISION.                                                           
      ******************************************************************        
                                                                                
       FILE SECTION.                                                            
                                                                                
       FD  DEFEDGE-FAD-FILE                                                     
           RECORDING MODE IS F                                                  
           BLOCK CONTAINS 0 RECORDS                                             
           LABEL RECORDS ARE STANDARD.                                          
                                                                                
       01  DEFEDGE-FAD-RECORD          PIC X(7000).                             
                                                                                
       FD  DEFEDGE-FAD-TOKEN-FILE                                               
           RECORDING MODE IS F                                                  
           BLOCK CONTAINS 0 RECORDS                                             
           LABEL RECORDS ARE STANDARD.                                          
                                                                                
       01  DEFEDGE-FAD-TOKEN-RECORD    PIC X(7000).                             
                                                                                
      ******************************************************************        
       WORKING-STORAGE SECTION.                                                 
      ******************************************************************        
       01  FILLER                            PIC X(50)  VALUE                   
           ' *** WORKING STORAGE STARTS HERE FOR ARKUT134 *** '.                
                                                                                
       01  PS-PROGRAM-SWITCHES.                                                 
           05  PS-END-OF-FILE-SW          PIC X(01)  VALUE 'N'.                 
               88  PS-NOT-END-OF-FILE                VALUE 'N'.                 
               88  PS-END-OF-FILE                    VALUE 'Y'.                 
           05  PS-ACCT-SSN                PIC X(08)  VALUE SPACES.              
               88  PS-ACCT-NBR                       VALUE 'ACCT NBR'.          
                                                                                
       01  PC-CONSTANTS.                                                        
           05  PC-PROGRAM-NAME               PIC  X(08) VALUE                   
                                                       'ARKUT134'.              
       01  PV-PROGRAM-VARIABLES.                                                
           05  PV-READ-COUNT                 PIC  9(09) VALUE ZEROES.           
           05  PV-WRITE-COUNT                PIC  9(09) VALUE ZEROES.           
           05  PV-INPUT-LENGTH               PIC  9(09) VALUE ZEROES.           
           05  PV-OUTPUT-RECORD              PIC  X(7000) VALUE SPACES.         
           05  PV-ACCT-NBR                   PIC  X(16) VALUE SPACES.           
           05  PV-INST-ID                    PIC  X(19) VALUE SPACES.           
           05  PV-FDR-PI-ID                  PIC  X(19) VALUE SPACES.           
                                                                                
       01  ABEND-CODE                        PIC S9(04) VALUE ZERO              
                                                        COMP SYNC.              
                                                                                
      ******************************************************************        
      * RECORD LAYOUT FOR DATALINK ACCOUNT FILE - INPUT AND OUTPUT     *        
      ******************************************************************        
           COPY ARRD134.                                                        
                                                                                
      ******************************************************************        
      * LAYOUT THAT DEFINES THE PARAMETERS NEEDED TO INVOKE PROTEGRITY *        
      * MODULE                                                         *        
      ******************************************************************        
           COPY PTYCCSIP.                                                       
                                                                                
      ******************************************************************        
      * LAYOUT THAT DEFINES THE WORKING VARIABLES TO INVOKE PROTEGRITY *        
      * MODULE                                                         *        
      ******************************************************************        
           COPY DPWS031.                                                        
                                                                                
      ******************************************************************        
                                                                                
       PROCEDURE DIVISION.                                                      
                                                                                
      ******************************************************************        
      * 0000-MAINLINE-PARA                                                      
      *   1. PROCESS THE RECORDS IN THE INPUT FILE                              
      *   2. CALL TOKENIZE PARA TO TOKENIZE ACCOUNT AND SSN NUMBER              
      *   3. WRITE OUTPUT RECORDS                                               
      ******************************************************************        
       0000-MAINLINE-PARA.                                                      
                                                                                
           PERFORM 1000-INITIALIZE.                                             
                                                                                
           PERFORM 2000-PROCESS-PARA                                            
                 UNTIL PS-END-OF-FILE.                                          
                                                                                
           PERFORM 9000-EOJ-ROUTINE.                                            
                                                                                
           STOP RUN.                                                            
                                                                                
      ******************************************************************        
      * 1000-INITIALIZE                                                         
      *     INITIALIZE THE VARIABLES, OPEN THE INPUT AND OUTPUT FILES           
      *     AND READ THE INPUT FILE                                             
      ******************************************************************        
       1000-INITIALIZE.                                                         
                                                                                
           DISPLAY 'PROGRAM - ' PC-PROGRAM-NAME.                                
           INITIALIZE PV-PROGRAM-VARIABLES.                                     
           MOVE PC-PROGRAM-NAME               TO DP031-PROGRAM-NAME.            
                                                                                
           OPEN INPUT  DEFEDGE-FAD-FILE                                         
                OUTPUT DEFEDGE-FAD-TOKEN-FILE.                                  
                                                                                
           PERFORM 2100-READ-FILE.                                              
                                                                                
      ******************************************************************        
      * 2000-PROCESS-PARA                                                       
      *   1. PROCESS THE RECORDS IN THE INPUT FILE                              
      *   2. CALL TOKENIZE PARA                                                 
      *   3. WRITE OUTPUT RECORDS                                               
      ******************************************************************        
       2000-PROCESS-PARA.                                                       
                                                                                
           IF AR134-FFSL-ACCOUNT-NUMBER NOT EQUAL SPACES                        
                                                                                
              INITIALIZE PV-ACCT-NBR                                            
                         PV-INPUT-LENGTH                                        
                                                                                
              SET PS-ACCT-NBR          TO TRUE                                  
              MOVE AR134-FFSL-ACCOUNT-NUMBER TO PV-ACCT-NBR                     
                                                                                
              INSPECT FUNCTION REVERSE (PV-ACCT-NBR)                            
                   TALLYING PV-INPUT-LENGTH FOR LEADING SPACES                  
              COMPUTE PV-INPUT-LENGTH =                                         
                   LENGTH OF PV-ACCT-NBR - PV-INPUT-LENGTH                      
                                                                                
              PERFORM 2300-TOKENIZE-FFSL-ACCNT-NMBR                             
                                                                                
           END-IF.                                                              
                                                                                
           IF AR134-FFSL-PRSN-INST-ID NOT EQUAL SPACES                          
                                                                                
              INITIALIZE PV-INST-ID                                             
                         PV-INPUT-LENGTH                                        
              MOVE AR134-FFSL-PRSN-INST-ID   TO PV-INST-ID                      
                                                                                
              INSPECT FUNCTION REVERSE (PV-INST-ID)                             
                   TALLYING PV-INPUT-LENGTH FOR LEADING SPACES                  
              COMPUTE PV-INPUT-LENGTH =                                         
                   LENGTH OF PV-INST-ID  - PV-INPUT-LENGTH                      
                                                                                
              PERFORM 2400-TOKENIZE-INST-ID                                     
                                                                                
           END-IF.                                                              
                                                                                
           IF AR134-FFSL-FDR-PI-ID NOT EQUAL SPACES                             
                                                                                
              INITIALIZE PV-FDR-PI-ID                                           
                         PV-INPUT-LENGTH                                        
              MOVE AR134-FFSL-FDR-PI-ID   TO PV-FDR-PI-ID                       
                                                                                
              INSPECT FUNCTION REVERSE (PV-FDR-PI-ID)                           
                   TALLYING PV-INPUT-LENGTH FOR LEADING SPACES                  
              COMPUTE PV-INPUT-LENGTH =                                         
                   LENGTH OF PV-FDR-PI-ID  - PV-INPUT-LENGTH                    
                                                                                
              PERFORM 2500-TOKENIZE-FDR-PI-ID                                   
                                                                                
           END-IF.                                                              
                                                                                
           PERFORM 2200-WRITE-FILE.                                             
           PERFORM 2100-READ-FILE.                                              
                                                                                
      ******************************************************************        
      * 2100-READ-FILE                                                          
      *      READ THE INPUT RECORDS                                             
      ******************************************************************        
       2100-READ-FILE.                                                          
                                                                                
           READ DEFEDGE-FAD-FILE INTO AR134-RECORDS                             
              AT END                                                            
                 SET PS-END-OF-FILE  TO TRUE                                    
              NOT AT END                                                        
                 ADD 1               TO PV-READ-COUNT                           
           END-READ.                                                            
                                                                                
      ******************************************************************        
      * 2200-WRITE-FILE                                                         
      *      WRITE THE RECORDS TO OUTPUT                                        
      ******************************************************************        
       2200-WRITE-FILE.                                                         
                                                                                
           INITIALIZE PV-OUTPUT-RECORD.                                         
           MOVE AR134-RECORDS            TO PV-OUTPUT-RECORD.                   
                                                                                
           WRITE DEFEDGE-FAD-TOKEN-RECORD FROM PV-OUTPUT-RECORD.                
           ADD 1                         TO PV-WRITE-COUNT.                     
                                                                                
      ******************************************************************        
      * 2300-TOKENIZE-FFSL-ACCNT-NMBR                                           
      *    TOKENIZE ACCOUNT NUMBER                                              
      ******************************************************************        
       2300-TOKENIZE-FFSL-ACCNT-NMBR.                                           
                                                                                
           INITIALIZE CSI-PARAMETERS                                            
                      DP031-PROTEG-PGM-PARAMETERS.                              
                                                                                
           MOVE 'ACCT-NBR'              TO DP031-FIELD                          
           MOVE PV-ACCT-NBR             TO DP031-CLEAR-TEXT                     
           MOVE PV-INPUT-LENGTH         TO DP031-INPUT-LEN                      
           SET DP031-ACCTNBR            TO TRUE                                 
                                                                                
           SET CSI-ENCRYPT-FUNCTION     TO TRUE.                                
           PERFORM DP031-0000-PROTG-TOKEN-DETOKEN.                              
                                                                                
           IF CSI-RETURN-CODE = ZERO                                            
              MOVE DP031-CIPHER-TEXT    TO PV-ACCT-NBR                          
              MOVE PV-ACCT-NBR          TO AR134-FFSL-ACCOUNT-NUMBER            
           ELSE                                                                 
              DISPLAY 'ISSUE IN RECORD# : ' PV-READ-COUNT                       
              PERFORM DP031-9999-ABEND                                          
           END-IF.                                                              
                                                                                
      ******************************************************************        
      * 2400-TOKENIZE-INST-ID                                                   
      *    TOKENIZE INST ID                                                     
      ******************************************************************        
       2400-TOKENIZE-INST-ID.                                                   
                                                                                
           INITIALIZE CSI-PARAMETERS                                            
                      DP031-PROTEG-PGM-PARAMETERS.                              
                                                                                
           MOVE 'ACCT-NBR'              TO DP031-FIELD                          
           MOVE PV-INST-ID              TO DP031-CLEAR-TEXT                     
           MOVE PV-INPUT-LENGTH         TO DP031-INPUT-LEN                      
           SET DP031-ACCTNBR            TO TRUE                                 
                                                                                
           SET CSI-ENCRYPT-FUNCTION     TO TRUE.                                
           PERFORM DP031-0000-PROTG-TOKEN-DETOKEN.                              
                                                                                
           IF CSI-RETURN-CODE = ZERO                                            
              MOVE DP031-CIPHER-TEXT    TO PV-INST-ID                           
              MOVE PV-INST-ID           TO AR134-FFSL-PRSN-INST-ID              
           ELSE                                                                 
              DISPLAY 'ISSUE IN RECORD# : ' PV-READ-COUNT                       
              PERFORM DP031-9999-ABEND                                          
           END-IF.                                                              
                                                                                
      ******************************************************************        
      * 2500-TOKENIZE-FDR-PI-ID                                                 
      *    TOKENIZE FDR PI ID                                                   
      ******************************************************************        
       2500-TOKENIZE-FDR-PI-ID.                                                 
                                                                                
           INITIALIZE CSI-PARAMETERS                                            
                      DP031-PROTEG-PGM-PARAMETERS.                              
                                                                                
           MOVE 'ACCT-NBR'              TO DP031-FIELD                          
           MOVE PV-FDR-PI-ID            TO DP031-CLEAR-TEXT                     
           MOVE PV-INPUT-LENGTH         TO DP031-INPUT-LEN                      
           SET DP031-ACCTNBR            TO TRUE                                 
                                                                                
           SET CSI-ENCRYPT-FUNCTION     TO TRUE.                                
           PERFORM DP031-0000-PROTG-TOKEN-DETOKEN.                              
                                                                                
           IF CSI-RETURN-CODE = ZERO                                            
              MOVE DP031-CIPHER-TEXT    TO PV-FDR-PI-ID                         
              MOVE PV-FDR-PI-ID         TO AR134-FFSL-FDR-PI-ID                 
           ELSE                                                                 
              DISPLAY 'ISSUE IN RECORD# : ' PV-READ-COUNT                       
              PERFORM DP031-9999-ABEND                                          
           END-IF.                                                              
                                                                                
      ******************************************************************        
      * 9000-EOJ-ROUTINE                                                        
      *      CLOSE THE INPUT AND OUTPUT FILES, DISPLAY THE MESSAGES             
      *      AND TERMINATE THE PROCESS.                                         
      ******************************************************************        
       9000-EOJ-ROUTINE.                                                        
                                                                                
           CLOSE DEFEDGE-FAD-FILE                                               
                 DEFEDGE-FAD-TOKEN-FILE.                                        
                                                                                
           IF PV-READ-COUNT = 0                                                 
              DISPLAY 'INPUT FILE IS EMPTY'                                     
           ELSE                                                                 
              DISPLAY 'RECORDS READ   : ' PV-READ-COUNT                         
              DISPLAY 'RECORDS WRITTEN: ' PV-WRITE-COUNT                        
           END-IF.                                                              
                                                                                
      ******************************************************************        
      *      COPY MEMBER DPPD031 CONTAINS STATEMENTS NEEDED TO INVOKE           
      *      PROTEGRITY MODULE FOR PROTECTION/UNPROTECTION                      
      ******************************************************************        
            COPY DPPD031.                                                       
                                                                                
      ******************************************************************        
