00001 *                                                                 02/06/89
00002 *  THIS IS THE RECORD DEFINITION FOR THE MAINTENANCE LOG OF       ARRD506O
00003 *  THE ACCOUNTS RECEIVABLE EMPLOYEE DISCOUNT SYSTEM.  THE            LV001
00004 *  RECORD LENGTH IS 160 BYTES.                                       CL**2
00005 *                                                                    CL**2
00006  01  AR506O-MAINTENANCE-LOG-RECORD.                                  CL**3
00007      05  AR506O-TRANSACTION-DATE    PIC 9(6)       VALUE ZERO.       CL**3
00008      05  FILLER                     REDEFINES                        CL**2
00009                                         AR506O-TRANSACTION-DATE.     CL**3
00010          10  AR506O-TRANSACTION-YEAR                                 CL**3
00011                                     PIC 9(2).                        CL**2
00012          10  AR506O-TRANSACTION-MONTH                                CL**3
00013                                     PIC 9(2).                        CL**2
00014          10  AR506O-TRANSACTION-DAY PIC 9(2).                        CL**3
00015      05  AR506O-TRANSACTION-TIME    PIC 9(6)       VALUE ZERO.       CL**3
00016      05  FILLER                     REDEFINES                        CL**2
00017                                         AR506O-TRANSACTION-TIME.     CL**3
00018          10  AR506O-TRANSACTION-HOUR                                 CL**3
00019                                     PIC 9(2).                        CL**2
00020          10  AR506O-TRANSACTION-MINUTE                               CL**3
00021                                     PIC 9(2).                        CL**2
00022          10  AR506O-TRANSACTION-SECOND                               CL**3
00023                                     PIC 9(2).                        CL**2
00024      05  AR506O-PROGRAM-NAME        PIC X(8)       VALUE SPACES.     CL**3
00025      05  AR506O-TRANSACTION-ID      PIC X(4)       VALUE SPACES.     CL**3
00026      05  AR506O-VSAM-FILE-ID        PIC 9(2)       VALUE ZERO.       CL**3
00027          88  AR506O-EMPLOYEE-ACCOUNT-FILE          VALUE 01.         CL**4
00028          88  AR506O-DEPARTMENT-FILE                VALUE 02.         CL**3
00029          88  AR506O-ACTIVE-KOHLS-ACCT-FILE         VALUE 03.         CL**4
00030          88  AR506O-FORCED-KOHLS-ACCT-FILE         VALUE 04.         CL**4
00031      05  AR506O-FILE-KEY-VALUE      PIC X(17)      VALUE SPACES.     CL**5
00032      05  AR506O-FILE-01-KEY-VALUE   REDEFINES                        CL**3
00033                                         AR506O-FILE-KEY-VALUE.       CL**6
00034          10  AR506O-ACCOUNT-NUMBER-01                                CL**3
00035                                     PIC 9(10).                       CL**2
00036          10  FILLER                 PIC X(7).                        CL**2
00037      05  AR506O-FILE-02-KEY-VALUE   REDEFINES                        CL**3
00038                                         AR506O-FILE-KEY-VALUE.       CL**6
00039          10  AR506O-DEPARTMENT-NUMBER-02                             CL**3
00040                                     PIC 9(3).                        CL**2
00041          10  FILLER                 PIC X(14).                       CL**2
00042      05  AR506O-FILE-03-KEY-VALUE   REDEFINES                        CL**3
00043                                         AR506O-FILE-KEY-VALUE.       CL**6
00044          10  AR506O-ACCOUNT-NUMBER-03                                CL**3
00045                                     PIC 9(10).                       CL**2
00046          10  FILLER                 PIC X(7).                        CL**2
00047      05  AR506O-FILE-04-KEY-VALUE   REDEFINES                        CL**3
00048                                         AR506O-FILE-KEY-VALUE.       CL**6
00049          10  AR506O-ACCOUNT-NUMBER-04                                CL**3
00050                                     PIC 9(10).                       CL**2
00051          10  FILLER                 PIC X(7).                        CL**2
00052      05  AR506O-USER-ID             PIC X(8)       VALUE SPACES.     CL**3
00053      05  AR506O-TERMINAL-ID         PIC X(4)       VALUE SPACES.     CL**3
00054      05  AR506O-FUNCTION-CODE       PIC X(1)       VALUE SPACES.     CL**3
00055          88  AR506O-ADD-CODE                       VALUE 'A'.        CL**3
00056          88  AR506O-CHANGE-CODE                    VALUE 'C'.        CL**3
00057          88  AR506O-DELETE-CODE                    VALUE 'D'.        CL**3
00058          88  AR506O-TRANSFER-CODE                  VALUE 'T'.        CL**2
00059      05  AR506O-OUTPUT-MESSAGE-AREA.                                 CL**3
00060          10  AR506O-OUTPUT-MESSAGE-SEQ                               CL**3
00061                                     PIC 9(2)       VALUE ZERO.       CL**2
00062          10  AR506O-OUTPUT-MESSAGE  PIC X(102)     VALUE SPACES.     CL**3
