000100******************************************************************00010000
000200* RECORD LAYOUT FOR FIRST DATA'S EVOLVE PROMISE TO PAY FILE       00020000
000300* FILE RCVD FROM FIRST DATA IS PKMO.AR.FD.EVD0010.K11.SASPTP(+0)  00030000
000400******************************************************************00040000
000500 01  AR090-PTP-RECORD.                                            00050000
000600     05  AR090-RECORD-TYPE             PIC  X(03).                00060000
000700         88  AR090-88-HEADER           VALUE 'HDR'.               00070000
000800         88  AR090-88-TRAILER          VALUE 'TRL'.               00080000
000900     05  FILLER                        PIC  X(189).               00090000
001000 01  AR090-PTP-HEADER.                                            00100000
001100     05  AR090-HDR-TYPE                PIC  X(03).                00110000
001200     05  FILLER                        PIC  X(06).                00120000
001300     05  AR090-HDR-DT                  PIC  X(08).                00130000
001400     05  AR090-HDR-DT-R REDEFINES AR090-HDR-DT.                   00140000
001500         10  AR090-HDR-YEAR            PIC  X(04).                00150000
001600         10  AR090-HDR-MONTH           PIC  X(02).                00160000
001700         10  AR090-HDR-DAY             PIC  X(02).                00170000
001800     05  FILLER                        PIC  X(02).                00180000
001900     05  AR090-HDR-COUNT               PIC  9(15).                00190000
002000     05  FILLER                        PIC  X(158).               00200000
002100 01  AR090-PTP-DETAIL.                                            00210000
002200     05  AR090-ACCT                    PIC  X(16).                00220000
002300     05  AR090-ACCT-R REDEFINES AR090-ACCT.                       00230000
002400         10  AR090-ACCT-PREFIX         PIC  X(06).                00240000
002500         10  AR090-ACCT-NUMBER         PIC  X(10).                00250000
002600     05  AR090-OPER                    PIC  X(08).                00260000
002700     05  AR090-PROM-DT                 PIC  X(08).                00270000
002800     05  AR090-PROM-DT-R REDEFINES AR090-PROM-DT.                 00280000
002900         10  AR090-PROM-MONTH          PIC  X(02).                00290000
003000         10  AR090-PROM-DAY            PIC  X(02).                00300000
003100         10  AR090-PROM-YEAR           PIC  X(04).                00310000
003200     05  AR090-PTYPE                   PIC  X(02).                00320000
003300     05  AR090-PAMT                    PIC S9(11)V9(02).          00330000
003400     05  AR090-PMTHD                   PIC  X(02).                00340000
003500     05  AR090-STATUS                  PIC  9(01).                00350000
003600     05  AR090-AMT-PAID                PIC S9(11)V9(02).          00360000
003700     05  AR090-RECUR-COUNT             PIC  9(02).                00370000
003800     05  AR090-RECUR-INTRVAL           PIC  9(02).                00380000
003900     05  AR090-HOST-CD                 PIC  X(03).                00390000
004000     05  AR090-UPD-DT-TM               PIC  X(14).                00400000
004100     05  AR090-UPD-DT-TM-R REDEFINES AR090-UPD-DT-TM.             00410000
004200         10  AR090-UPD-DT              PIC  X(08).                00420000
004300         10  AR090-UPD-DT-R REDEFINES AR090-UPD-DT.               00430000
004400             15  AR090-UPD-MONTH       PIC  X(02).                00440000
004500             15  AR090-UPD-DAY         PIC  X(02).                00450000
004600             15  AR090-UPD-YEAR        PIC  X(04).                00460000
004700         10  AR090-UPD-TM              PIC  X(06).                00470000
004800         10  AR090-UPD-TM-R REDEFINES AR090-UPD-TM.               00480000
004900             15  AR090-UPD-HOUR        PIC  X(02).                00490000
005000             15  AR090-UPD-MINUTES     PIC  X(02).                00500000
005100             15  AR090-UPD-SECONDS     PIC  X(02).                00510000
005200     05  AR090-ENTR-DT-TM              PIC  X(14).                00520000
005300     05  AR090-ENTR-DT-TM-R REDEFINES AR090-ENTR-DT-TM.           00530000
005400         10  AR090-ENTR-DT             PIC  X(08).                00540000
005500         10  AR090-ENTR-DT-R REDEFINES AR090-ENTR-DT.             00550000
005600             15  AR090-ENTR-MONTH      PIC  X(02).                00560000
005700             15  AR090-ENTR-DAY        PIC  X(02).                00570000
005800             15  AR090-ENTR-YEAR       PIC  X(04).                00580000
005900         10  AR090-ENTR-TM             PIC  X(06).                00590000
006000         10  AR090-ENTR-TM-R REDEFINES AR090-ENTR-TM.             00600000
006100             15  AR090-ENTR-HOUR       PIC  X(02).                00610000
006200             15  AR090-ENTR-MINUTES    PIC  X(02).                00620000
006300             15  AR090-ENTR-SECONDS    PIC  X(02).                00630000
006400     05  AR090-HOST-MSG                PIC  X(75).                00640000
006500     05  AR090-PFRQ                    PIC  X(02).                00650000
006600     05  AR090-CURBAL                  PIC S9(15)V9(02).          00660000
006700 01  AR090-PTP-TRAILER.                                           00670000
006800     05  AR090-TRL-TYPE                PIC  X(03).                00680000
006900     05  FILLER                        PIC  X(06).                00690000
007000     05  AR090-TRL-DT                  PIC  X(08).                00700000
007100     05  AR090-TRL-DT-R REDEFINES AR090-TRL-DT.                   00710000
007200         10  AR090-TRL-YEAR            PIC  X(04).                00720000
007300         10  AR090-TRL-MONTH           PIC  X(02).                00730000
007400         10  AR090-TRL-DAY             PIC  X(02).                00740000
007500     05  FILLER                        PIC  X(02).                00750000
007600     05  AR090-TRL-COUNT               PIC  9(15).                00760000
007700     05  FILLER                        PIC  X(158).               00770000
