      ******************************************************************        
      *   ARRD143.                                                     *        
      *   FIRST DATA FILE FOR PROGRAM ARKUT143                         *        
      *   LRECL: 241                                                   *        
      ******************************************************************        
       01 AR143-RECORDS.                                                        
           05 FILLER                       PIC X(40)   VALUE SPACE.             
           05 AR143-CHD-ACCOUNT-NUMBER     PIC X(16)   VALUE SPACE.             
           05 FILLER                       PIC X(185)  VALUE SPACE.             
