      ******************************************************************        
      *   ARRD136.                                                     *        
      *   FIRST DATA FILE FOR PROGRAM ARKUT136                         *        
      *   LRECL: 276                                                   *        
      ******************************************************************        
       01 AR136-RECORDS.                                                        
           05 FILLER                        PIC X(26)   VALUE SPACE.            
           05 AR136-NOMN-CHD-ACCOUNT-NUMBER PIC X(16)   VALUE SPACE.            
           05 FILLER                        PIC X(208)  VALUE SPACE.            
           05 AR136-NOMN-PIID-NUMBER        PIC X(19)   VALUE SPACE.            
           05 FILLER                        PIC X(07)   VALUE SPACE.            
