      ******************************************************************        
      *   ARRD147.                                                     *        
      *   FIRST DATA FILE FOR PROGRAM ARKUT147                         *        
      *   LRECL: 84                                                    *        
      ******************************************************************        
       01 AR147-RECORDS.                                                        
           05 FILLER                       PIC X(05)  VALUE SPACE.              
           05 AR147-CC1729RD-ACCT-ID       PIC X(16)  VALUE SPACE.              
           05 FILLER                       PIC X(63)  VALUE SPACE.              
