      ****************************************************************  00010000
      * RECORD LAYOUT FOR FD NON-MON UPDATES                            00011000
      ****************************************************************  00012000
      * ARRD068 (I/O) - REC LENGTH: 80                                  00013000
      * NOTES:                                                          00014000
      *   -                                                             00015000
      ****************************************************************  00016000
                                                                        00017000
       01  AR068-EMP-DISC-UPD-HDR-REC.                                  00018000
           05  AR068-FILLER-1              PIC  X(32)    VALUE SPACES.  00018102
           05  AR068-BTCH-TYP-CDE          PIC  9(1)     VALUE 9.       00018202
           05  AR068-FILLER-2              PIC  X(2)     VALUE SPACES.  00018302
           05  AR068-BTCH-NBR              PIC  9(5)     VALUE ZEROES.  00018402
           05  AR068-BTCH-NBR-R REDEFINES AR068-BTCH-NBR.               00018501
               10  AR068-TICKET-FIL-NBR    PIC  X(1).                   00018601
               10  AR068-FIL-BTCH-DTE      PIC  X(4).                   00033001
           05  AR068-FILLER-3              PIC  X(2)     VALUE SPACES.  00033102
           05  AR068-SYSTEM-NBR            PIC  9(4)     VALUE 9368.    00034002
           05  AR068-FILLER-4              PIC  X(2)     VALUE SPACES.  00035002
           05  AR068-PRCNPL-USER-NBR       PIC  9(4)     VALUE ZEROES.  00036002
           05  AR068-FILLER-5              PIC  X(22)    VALUE SPACES.  00037002
           05  AR068-HDR-TERMINAL-ID       PIC  X(4)     VALUE 'ACCT'.  00038002
           05  AR068-HDR-OPERATOR-ID       PIC  X(2)     VALUE 'MT'.    00039003
                                                                        00039100
       01  AR068-EMP-DISC-UPDATE-REC.                                   00040004
           05  AR068-ACCT-NBR              PIC  X(16)    VALUE ZEROES.  00051002
           05  AR068-TXN-CDE               PIC  X(03)    VALUE '602'.   00052002
           05  AR068-DISC-STAT-CDE         PIC  X(01)    VALUE 'N'.     00053002
           05  AR068-FILLER-6              PIC  X(50)    VALUE SPACES.  00060005
           05  AR068-KOHLS-SORT-PRIN       PIC  X(04)    VALUE SPACES.  00061005
           05  AR068-TERMINAL-ID           PIC  X(04)    VALUE 'ACCT'.  00070002
           05  AR068-OPERATOR-ID           PIC  X(02)    VALUE 'MT'.    00080003
