      ******************************************************************        
      *   ARRD142.                                                     *        
      *   FIRST DATA FILE FOR PROGRAM ARKUT142                         *        
      *   LRECL: 364                                                   *        
      ******************************************************************        
       01 AR142-RECORDS.                                                        
           05 FILLER                       PIC X(34)   VALUE SPACE.             
           05 AR142-ECS-ACCT-ID            PIC X(16)   VALUE SPACE.             
           05 FILLER                       PIC X(314)  VALUE SPACE.             
