      ****************************************************************  00010000
      *                                                              *  00020000
      * ARRD060                                                      *  00030000
      * THIS IS THE RECORD LAYOUT FOR THE EMPLOYEE DISCOUNT RATE     *  00040001
      * CONTROL FILE.                                                *  00050001
      ****************************************************************  00090000
                                                                        00100000
       01  AR060-EMPL-DISCOUNT-RTE-RECORD.                              00110001
           05  AR060-STORE-NUMBER              PIC   X(04).             00120001
               88 AR060-DEFAULT-RATE-RECORD          VALUE 'ALL '.      00130001
           05  FILLER                          PIC   X(01).             00140001
           05  AR060-START-DATE                PIC   X(10).             00170001
           05  FILLER                          PIC   X(01).             00140001
           05  AR060-END-DATE                  PIC   X(10).             00171001
           05  FILLER                          PIC   X(01).             00140001
           05  AR060-DEPT-STORE-VALUES.                                 00171001
               10  AR060-DS-LITERAL            PIC   X(02).                     
               10  FILLER                      PIC   X(01).                     
               10  AR060-DS-HRD-LINE-LIT       PIC   X(01).                     
               10  AR060-DS-HRD-LINE-PCT       PIC   9(03).                     
               10  FILLER                      PIC   X(01).                     
               10  AR060-DS-SFT-LINE-LIT       PIC   X(01).                     
               10  AR060-DS-SFT-LINE-PCT       PIC   9(03).                     
           05  FILLER                          PIC   X(01).             00140001
           05  AR060-FOOD-STORE-VALUES.                                 00171001
               10  AR060-FS-LITERAL            PIC   X(02).                     
               10  FILLER                      PIC   X(01).                     
               10  AR060-FS-HRD-LINE-LIT       PIC   X(01).                     
               10  AR060-FS-HRD-LINE-PCT       PIC   9(03).                     
               10  FILLER                      PIC   X(01).                     
               10  AR060-FS-SFT-LINE-LIT       PIC   X(01).                     
               10  AR060-FS-SFT-LINE-PCT       PIC   9(03).                     
           05  FILLER                          PIC   X(28).                     
