      ******************************************************************        
      *   ARRD130.                                                     *        
      *   FIRST DATA FILE FOR PROGRAM ARKUT130                         *        
      *   LRECL: 700                                                   *        
      ******************************************************************        
       01 AR130-RECORDS.                                                        
           05 FILLER                       PIC X(02)  VALUE SPACE.              
           05 AR130-DAT-CHD-NUM            PIC X(19)  VALUE SPACE.              
           05 FILLER                       PIC X(94)  VALUE SPACE.              
           05 AR130-DAT-ENTERED-ACCT       PIC X(19)  VALUE SPACE.              
           05 FILLER                       PIC X(566) VALUE SPACE.              
