*CR   **************************************************************            
*CR   *      (C)COPYRIGHT FIRST DATA RESOURCES, INC.               *            
*CRDAT*      1971 - 2010                                           *            
*CR   *      ALL RIGHTS RESERVED.                                  *            
*CR   *      THIS MEDIA CONTAINS UNPUBLISHED, CONFIDENTIAL AND     *            
*CR   *      PROPRIETARY INFORMATION OF FIRST DATA RESOURCES, INC. *            
*CR   *      NO DISCLOSURE OR USE OF ANY PORTION OF THE CONTENTS   *            
*CR   *      OF THESE MATERIALS MAY BE MADE WITHOUT THE EXPRESS    *            
*CR   *      WRITTEN CONSENT OF FIRST DATA RESOURCES, INC          *            
*CR   **************************************************************            
10022A*   REL 10 VER 022    01/22/2010     CCMTHOVW    TEAM 26M    *            
      **************************************************************            
      *                     COPYBOOK: CCMTHOVW                     *            
      *                   DOWNLOADED: 11/23/2009                   *            
      *                    EFFECTIVE: 01/22/2010                   *            
      *                 RELEASE VERSION INFORMATION                *            
      *                       10022A = B9A0005C                   *             
      **************************************************************            
C86513******************************************************************        
C86513* 17/07/2014  COGNIZANT   CHG0086513                                      
C86513*  - ADDED NEW FIELDS IN THE CARD MASTER FILE AS PART OF THE              
C86513*    FD JULY MAJOR RELEASE                                                
C86513******************************************************************        
       01  AR71-OVRR-RECORD.                                                    
           02  AR71-KEY.                                                        
               03  AR71-FULL-ACCT-ID.                                           
                   04  AR71-SYS-PRIN-AGNT-ID.                                   
                       05  AR71-SYS-ID           PIC X(6).                      
                       05  AR71-SYS-CNT          PIC S9(7)V COMP-3.             
                       05  AR71-PRIN-AGNT.                                      
                           06  AR71-PRIN-ID      PIC S9(3)V COMP-3.             
                           06  AR71-AGNT-ID      PIC X(4).                      
                           06  FILLER            PIC X(6).                      
           02  FILLER                            PIC X(16).                     
           02  AR71-ACCT-ID                      PIC X(16).                     
           02  FILLER                            PIC X(5).                      
           02  AR71-OCCR-CT.                                                    
               03  AR71-OVERRIDES-CT             PIC S9(3)V COMP-3.             
               03  AR71-LAST-DFFR-CT             PIC S9(3)V COMP-3.             
           02  AR71-METHOD-OVRR-SEG.                                            
09289A         03  AR71-METHOD-OVRR-DATA OCCURS 0 TO 48 TIMES                   
                    DEPENDING ON AR71-OVERRIDES-CT.                             
                   04  AR71-CRRN-OVRR-TYPE-ID    PIC X(6).                      
                   04  AR71-CRRN-OVRR-ID         PIC X(8).                      
                   04  AR71-CRRN-OVRR-DT         PIC S9(9)V   COMP-3.           
                   04  AR71-CRRN-OVRR-WHOC-ID    PIC X(8).                      
                   04  AR71-CRRN-OVRR-WHYC-ID    PIC X(2).                      
                   04  AR71-CRRN-OVRR-LOCK-CD    PIC X.                         
                   04  AR71-CRRN-OVRR-LOCK-DT    PIC S9(9)V COMP-3.             
                   04  AR71-CRRN-OVRR-UNLC-DT    PIC S9(9)V COMP-3.             
                   04  AR71-CRRN-OVRR-RLUL-CD    PIC X.                         
                   04  AR71-CRRN-OVRR-AQTB-ID    PIC X(8).                      
                   04  AR71-CRRN-OVRR-BA-CD      PIC X.                         
08025A             04  AR71-CRRN-AQTB-REVW-IN    PIC X.                         
08025A             04  AR71-CRRN-OVRR-REVW-IN    PIC X.                         
08025A             04  AR71-CYCL-OVRR-ID         PIC X(8).                      
08025A             04  AR71-CYCL-OVRR-AQTB-ID    PIC X(8).                      
                   04  AR71-LS-OVRR-ID           PIC X(8).                      
                   04  AR71-LS-AQTB-ID           PIC X(8).                      
                   04  AR71-LS-BA-CD             PIC X.                         
                   04  AR71-NEXT-OVRR-ID         PIC X(8).                      
                   04  AR71-NEXT-OVRR-DT         PIC S9(9)V   COMP-3.           
                   04  AR71-NEXT-OVRR-WHYC-ID    PIC X(2).                      
                   04  AR71-NEXT-OVRR-BA-CD      PIC X.                         
10022A             04  AR71-NEXT-OVRR-REVW-IN    PIC X.                         
                   04  AR71-NEXT-MTHD-HONR-ID    PIC X.                         
10022A             04  AR71-NEXT-OVRR-TMNG-CD    PIC X.                         
10022A             04  AR71-NEXT-CIT-MTHD-ID     PIC X(8).                      
10022A             04  AR71-NEXT-EVNT-DT         PIC S9(9)V   COMP-3.           
10022A             04  AR71-NXT2-OVRR-ID         PIC X(8).                      
10022A             04  AR71-NXT2-OVRR-DT         PIC S9(9)V   COMP-3.           
10022A             04  AR71-NXT2-OVRR-WHYC-ID    PIC X(2).                      
10022A             04  AR71-NXT2-OVRR-BA-CD      PIC X.                         
10022A             04  AR71-NXT2-OVRR-REVW-IN    PIC X.                         
10022A             04  AR71-NXT2-MTHD-HONR-ID    PIC X.                         
10022A             04  AR71-NXT2-OVRR-TMNG-CD    PIC X.                         
10022A             04  AR71-NXT2-CIT-MTHD-ID     PIC X(8).                      
10022A             04  AR71-NXT2-EVNT-DT         PIC S9(9)V   COMP-3.           
10022A             04  AR71-CRRN-OVRR-TMNG-CD    PIC X.                         
10022A             04  AR71-CRRN-CIT-MTHD-ID     PIC X(8).                      
10022A             04  AR71-CRRN-EVNT-DT         PIC S9(9)V   COMP-3.           
10022A             04  AR71-CRRN-OVRR-ALLC-DT    PIC S9(9)V   COMP-3.           
10022A             04  AR71-MIDC-OVRR-MTHD-ID    PIC X(8).                      
10022A             04  AR71-CRRN-MTHD-CYCL-CT    PIC S9(3)V   COMP-3.           
10022A             04  AR71-LS-MTHD-CYCL-CT      PIC S9(3)V   COMP-3.           
10022A             04  AR71-LS-NEXT-OVRR-ID      PIC X(8).                      
10022A             04  AR71-LS-NEXT-OVRR-DT      PIC S9(9)V   COMP-3.           
10022A             04  AR71-LS-NEXT-OVRR-WHYC-ID PIC X(2).                      
10022A             04  AR71-LS-NEXT-OVRR-BA-CD   PIC X.                         
10022A             04  AR71-LS-NEXT-MTHD-HONR-ID PIC X.                         
10022A             04  AR71-LS-NEXT-OVRR-TMNG-CD PIC X.                         
10022A             04  AR71-LS-NEXT-CIT-MTHD-ID  PIC X(8).                      
10022A             04  AR71-LS-NXT2-OVRR-ID      PIC X(8).                      
10022A             04  AR71-LS-NXT2-OVRR-DT      PIC S9(9)V   COMP-3.           
10022A             04  AR71-LS-NXT2-OVRR-WHYC-ID PIC X(2).                      
10022A             04  AR71-LS-NXT2-OVRR-BA-CD   PIC X.                         
10022A             04  AR71-LS-NXT2-MTHD-HONR-ID PIC X.                         
10022A             04  AR71-LS-NXT2-OVRR-TMNG-CD PIC X.                         
10022A             04  AR71-LS-NXT2-CIT-MTHD-ID  PIC X(8).                      
                   04  AR71-CURR-DSCL-DT         PIC S9(9)V   COMP-3.           
                   04  AR71-CURR-DSCL-CT         PIC S9(3)V   COMP-3.           
                   04  AR71-NEXT-DSCL-DT         PIC S9(9)V   COMP-3.           
                   04  AR71-NEXT-DSCL-CT         PIC S9(3)V   COMP-3.           
                   04  AR71-NXT2-DSCL-DT         PIC S9(9)V   COMP-3.           
                   04  AR71-NXT2-DSCL-CT         PIC S9(3)V   COMP-3.           
C86513             04  AR71-LOCK-UNLK-SOON-CD    PIC X.                         
C86513             04  AR71-NEXT-DAY-ALLC-CD     PIC X.                         
C86513             04  FILLER                    PIC X(91).                     
C86513*            04  FILLER                    PIC X(93).                     
09289A         03  AR71-LAST-DFFR-OVRR-DATA OCCURS 0 TO 48 TIMES                
                          DEPENDING ON AR71-LAST-DFFR-CT.                       
                   04  AR71-LAST-DFFR-TYPE-ID    PIC X(6).                      
                   04  AR71-LAST-DFFR-OVRR-ID    PIC X(8).                      
                   04  AR71-LAST-DFFR-CHNG-DT    PIC S9(9)V   COMP-3.           
                   04  AR71-LAST-DFFR-WHYC-ID    PIC X(2).                      
                                                                                
                                                                               
                                                                                
