10022A*   REL 10 VER 022    03/18/2012     ARRD088                 *    00010001
      **************************************************************    00020000
      *                     COPYBOOK: ARRD088                      *    00030001
      *                   DOWNLOADED: 03/18/2012                   *    00040001
      *                 RELEASE VERSION INFORMATION                *    00050000
      ******************************************************************00060000
       01  AR088-NONMON-RECORD.                                         00080002
           05  AR088-ACCT-ID               PIC X(16).                   00150002
           05  AR088-TRAN-CDE              PIC X(3).                    00160002
           05  AR088-SUB-TRAN-CDE          PIC X(2).                    00161002
      *        UD-CONTROL-12 S/B YYMMDD                                 00161101
           05  AR088-UD-CONTROL-12         PIC X(6).                    00162002
           05  FILLER                      PIC X(47).                   00830001
           05  AR088-TERMINAL-ID           PIC X(4).                    00840002
           05  AR088-OPERATOR-CDE          PIC X(2).                    00850002
       01  AR088-HEADER-RECORD REDEFINES                                00850102
               AR088-NONMON-RECORD.                                     00850202
           05 FILLER                       PIC X(32).                   00852002
           05 AR088-HDR-BTCH-TYP-CDE       PIC 9(01).                   00853005
           05 FILLER                       PIC X(02).                   00854002
           05 AR088-HDR-BTCH-NBR           PIC 9(05).                   00855005
           05 FILLER                       PIC X(02).                   00858002
           05 AR088-HDR-SYS-NBR            PIC 9(04).                   00859005
           05 FILLER                       PIC X(02).                   00859102
           05 AR088-HDR-PRIN-USE-NBR       PIC 9(04).                   00859205
           05 FILLER                       PIC X(22).                   00859302
           05 AR088-HDR-TERM-ID            PIC X(04).                   00859402
           05 AR088-HDR-OPER-CDE           PIC X(02).                   00859502
                                                                        01020002
