000100******RESERVED FOR CMDM PROJECT *****************************     00010000
000200**************************************************************    00020000
000300*    FDR CARDHOLDER MASTER COPYBOOK - UNPACKED FOR CMDM      *    00030000
000400*    THIS COPYBOOK IS BASED ON FDR ARRD070                   *    00040000
      *    LENGTH - 6070                                                00041000
000500**************************************************************    00042000
000600**************************************************************    00043000
000700*  CREATED - NEHA BAGRODIA -06-29-16                         *    00044000
000800**************************************************************    00045000
FD1704******************************************************************00046000
FD1704* 04/21/2017  COGNIZANT   CHG0166796                              00047000
FD1704* - ADDED NEW FIELDS AS A PART OF APR'17 RELEASE                  00048000
FD1704* - CHANGES ARE TAGGED WITH FD1704                                00049000
FD1704******************************************************************00050000
000900******************************************************************00060000
12065 * 01/21/2018  BARB SCHULTZ  CHG0186257                            00070000
12065 * - ADDED NEW HISTORY FIELDS TO THE END OF ARRD097                00080000
12065 * - PROJECT ID - 12065 PROJECT NAME - MTP - ADDITIONAL ATTRIBUTES 00081000
000900******************************************************************00082000
001000******************************************************************00083000
001100 01 AR97-MASTER-DATA.                                             00084000
001200    02  AR97-RECORD-IDENTIFIER.                                   00085000
001300        03  AR97-RECORD-ID                PIC X(6).               00086000
001400        03  AR97-RECORD-SQNC-CT           PIC 9(7).               00087000
001500     02  AR97-FORMAT-4.                                           00088000
001600      03  AR97-FORMAT-3.                                          00089000
001700       04  AR97-FORMAT-2.                                         00090000
001800        05  AR97-FORMAT-1.                                        00100000
001900            06  AR97-BASE-DATA-SEGMENT.                           00110000
002000                07  AR97-NEW-FILE-TYPE          PIC X.            00120000
002100                07  AR97-RECORD-FORMAT          PIC 9(2).         00130000
002200                07  FILLER                PIC X(4) VALUE SPACES.  00140000
002300                07  AR97-CUSTOMER-IDENT.                          00150000
002400                    08  AR97-BRANCH-NO          PIC XX.           00160000
002500                    08  AR97-CUSTOMER-NO.                         00170000
002600                        09  AR97-CUST-NO-BS     PIC XX.           00180000
002700                        09  AR97-CUST-NO-AL     PIC XX.           00190000
002800                07  AR97-CLIENT-NUMBER          PIC X(4).         00200000
002900                07  AR97-CLIENT-NUMBER-9                          00210000
003000                                   REDEFINES AR97-CLIENT-NUMBER   00220000
003100                                                PIC 9(4).         00230000
003200                07  AR97-SYSTEM-NO-EXPN                           00240000
003300                                  REDEFINES AR97-CLIENT-NUMBER    00250000
003400                                                PIC X(4).         00260000
003500                07  AR97-FULL-ACCT-NO.                            00270000
003600                    08  AR97-SYSTEM-BANK.                         00280000
003700                        09  AR97-SYSTEM-NO.                       00290000
003800                            10  AR97-THOUSAND-SERIES   PIC X.     00300000
003900                            10  FILLER          PIC XXX.          00310000
004000                        09  AR97-BANK-NO.                         00320000
004100                            10  AR97-PRIN-BANK  PIC XXXX.         00330000
004200                            10  AR97-AGENT-BANK PIC XXXX.         00340000
004300                    08  FILLER REDEFINES AR97-SYSTEM-BANK.        00350000
004400                        09  AR97-SYSTEM-PRIN    PIC X(8).         00360000
004500                        09  FILLER              PIC XXXX.         00370000
004600                    08  AR97-ACCOUNT-NUMBER     PIC X(16).        00380000
004700                07  AR97-ACCOUNT-NO-EXPN        PIC XXX.          00390000
004800                07  FILLER                  PIC X(2) VALUE SPACES.00400000
004900                07  AR97-SEGMENT-OCCURS-NR.                       00410000
005000                    08  AR97-CIT-TOTL-CT       PIC 9(4).          00420000
005100                    08  AR97-NO-DEL-ITEMS      PIC 9(4).          00430000
005200                    08  AR97-NO-BEHAVIOR-SEGS  PIC 9(4).          00440000
005300                    08  AR97-NO-CUSTOMER-SEGS  PIC 9(4).          00450000
005400                    08  AR97-NO-HRSK-ACS-SEGS  PIC 9(4).          00460000
005500*                   08  AR97-FUTURE-SMALL-SEGS PIC X(6).          00470000
005600*                   08  FILLER                 PIC X(6).          00480000
005600                    08  FILLER-1               PIC X(6).          00490000
005700                    08  AR97-NO-SMALL-SEGS     PIC 9(4).          00500000
005800                    08  AR97-NO-ALP-STAG-SEGS  PIC 9(4).          00510000
005900                    08  AR97-NO-NEW-MISC-SEGS  PIC 9(4).          00520000
006000                    08  AR97-NO-NEW-MISC2-SEGS PIC 9(4).          00530000
006100                    08  AR97-NO-NEW-MISC3-SEGS PIC 9(4).          00540000
006200                    08  AR97-NO-SLS-SYD-SEGS   PIC 9(4).          00550000
006300*                   08  AR97-FUTURE-LARGE-SEGS PIC 9(4).          00560000
006400*                   08  FILLER                 PIC X(4).          00570000
006400                    08  FILLER-2               PIC X(4).          00580000
006500                    08  AR97-NO-LARGE-SEGS     PIC 9(4).          00590000
006600*                   08  AR97-NO-SUPER-LARGE-SEGS                  00600000
006700*                                                 PIC 9(4).       00610000
006800*                   08  FILLER                    PIC X(4).       00620000
006800                    08  FILLER-3                  PIC X(4).       00630000
006900                    08  AR97-NO-FLAP-SEGS         PIC 9(8).       00640000
007000                    08  AR97-NO-CHECKPOINTS       PIC 9(8).       00650000
007100                    08  AR97-NO-TLP-BONUS-SEGS    PIC 9(8).       00660000
007200                    08  AR97-NO-GLOBAL-NAME-CT    PIC X(5).       00670000
007300                    08  AR97-NO-GLOBAL-ADDRESS-CT PIC X(5).       00680000
007400                    08  AR97-NO-GLOBAL-PHONE-CT   PIC X(5).       00690000
007500                    08  AR97-NO-MMB-ITEM-CT       PIC X(5).       00700000
007600                    08  AR97-NO-PYST-ITEM-CT      PIC X(5).       00710000
007700                    08  AR97-NMBR-DSPT-ITEM-CT    PIC X(5).       00720000
007800                07  AR97-ALT-FIN-KEY.                             00730000
007900                    08  AR97-AFK-ENTITY        PIC X(4).          00740000
008000                    08  AR97-AFK-CARD-NOCARD   PIC X(4).          00750000
008100                    08  AR97-AFK-BRANCH-PORTFO PIC X(6).          00760000
008200                    08  AR97-AFK-OTHER1        PIC X(6).          00770000
008300                07  AR97-STATUS-BYTES.                            00780000
008400                    08  AR97-STATUS-CODES.                        00790000
008500                        09  AR97-EXTERNAL-STATUS  PIC X.          00800000
008600                        09  AR97-INTERNAL-STATUS  PIC X.          00810000
008700                    08  AR97-PREV-EXT-STATUS   PIC X.             00820000
008800                    08  AR97-CYCLE-CODE.                          00830000
008900                        09  AR97-CYCLE-CODE-99 PIC 99.            00840000
009000                    08  AR97-DATE-LAST-NONMON  PIC X(8).          00850000
009100                    08  AR97-PREVIOUS-CYCLE-CODE.                 00860000
009200                        09  AR97-PREVIOUS-CYCLE-CODE-99 PIC 99.   00870000
009300                07  AR97-ADDT-ADDR-NR.                            00880000
009400                    08  AR97-DLVR-PONT-NR       PIC X(9).         00890000
009500                    08  AR97-DLVR-BAR1-NR       PIC X(19).        00900000
009600                    08  AR97-DLVR-BAR2-NR       PIC X(19).        00910000
009700                07  AR97-EXTRA-PRSNL-DATA-BASE.                   00920000
009800                    08  AR97-EP-DATA-2.                           00930000
009900                        09  AR97-CHARGE-DDA-CODE PIC X.           00940000
010000                        09  AR97-TRANSIT-ROUTING-NO               00950000
010100                                             PIC X(10).           00960000
010200                        09  AR97-CHECKING-ACCT-NO PIC X(17).      00970000
010300                        09  AR97-SAVINGS-ACCT-NO PIC X(17).       00980000
010400                        09  FILLER REDEFINES                      00990000
010500                                            AR97-SAVINGS-ACCT-NO. 01000000
010600                            10  AR97-TEMP-BONUS-LIMIT PIC 99.     01010000
010700                            10  FILLER             PIC X(15).     01020000
010800                    08  AR97-SECURITY-CODE-1.                     01030000
010900                        09  AR97-SEC-CODE-NUM-1 PIC 9(6).         01040000
011000                    08  AR97-SECURITY-CODE-2.                     01050000
011100                        09  AR97-SEC-CODE-NUM-2 PIC 9(6).         01060000
011200                    08  AR97-SCRT-3-CD.                           01070000
011300                        09  AR97-SCRT-3-NMRC-CD PIC 9(6).         01080000
011400                    08  AR97-SCRT-4-CD.                           01090000
011500                        09  AR97-SCRT-4-NMRC-CD PIC 9(6).         01100000
011600                    08  AR97-PIN-VERIFY-1      PIC X(6).          01110000
011700                    08  AR97-PIN-VERIFY-2      PIC X(6).          01120000
011800                    08  AR97-PIN-VRFY-3-NR     PIC X(6).          01130000
011900                    08  AR97-PIN-VRFY-4-NR     PIC X(6).          01140000
012000            07  AR97-PIN-TRANSFER-FLAG         PIC X.             01150000
012100            07  AR97-TEMP-PROMO-NMDSREC.                          01160000
012200                08  AR97-TEMP-PI-CODE.                            01170000
012300                     09  AR97-TEMP-PI-TYPE     PIC X.             01180000
012400                     09  AR97-TEMP-PI-STMT     PIC X.             01190000
012500                08  AR97-TEMP-PROMO-START-DATE PIC X(8).          01200000
012600                08  AR97-TEMP-PROMO-END-DATE   PIC X(8).          01210000
012700            07  AR97-INTEREST-RATES.                              01220000
012800                08  AR97-INT-RATE-NMDSREC.                        01230000
012900                    09  AR97-ANN-RATE-CASH    PIC X(7).           01240000
013000                    09  AR97-ANN-RATE-MRCH    PIC X(7).           01250000
013100                    09  AR97-OLD-ANN-RATE     PIC X(7).           01260000
013200                    09  AR97-OLD-ANN-RATE-CASH                    01270000
013300                                               PIC X(7).          01280000
013400                    09  AR97-ANN-RATE-CASH-MAX                    01290000
013500                                               PIC X(7).          01300000
013600                    09  AR97-ANN-RATE-MRCH-MAX                    01310000
013700                                               PIC X(7).          01320000
013800                    09 AR97-ANN-RATE-MRCH-FUTURE                  01330000
013900                                               PIC X(7).          01340000
014000                    09 AR97-ANN-RATE-CASH-FUTURE                  01350000
014100                                               PIC X(7).          01360000
014200                08  AR97-MONTHLY-RATE-CASH    PIC X(7).           01370000
014300                08  AR97-DAILY-RATE-CASH      PIC X(9).           01380000
014400                08  AR97-MONTHLY-RATE         PIC X(7).           01390000
014500                08  AR97-DAILY-RATE-MRCH      PIC X(9).           01400000
014600                08  AR97-ANN-RATE-CRDINT      PIC X(7).           01410000
014700                08  AR97-MONTHLY-RATE-CRDINT  PIC X(9).           01420000
014800                08  AR97-DAILY-RATE-CRDINT    PIC X(7).           01430000
014900                08  AR97-MTH-RATE-CASH-MAX    PIC X(7).           01440000
015000                08  AR97-MTH-RATE-MRCH-MAX    PIC X(7).           01450000
015100                08  AR97-ANN-RATE-DATA-NMDSREC.                   01460000
015200                    09  AR97-ANN-RATE-CASH-MIN                    01470000
015300                                               PIC X(7).          01480000
015400                    09  AR97-ANN-RATE-MRCH-MIN                    01490000
015500                                               PIC X(7).          01500000
015600                08  AR97-MTH-RATE-CASH-MIN    PIC X(7).           01510000
015700                08  AR97-MTH-RATE-MRCH-MIN    PIC X(7).           01520000
015800            07  AR97-RESERVE-FOR-SOCIETY.                         01530000
015900                08  AR97-SOCIETY-LS-MRCH-RATE PIC X(7).           01540000
016000                08  AR97-SOCIETY-LS-CASH-RATE PIC X(7).           01550000
016100            07  AR97-COLLECTION-DATA.                             01560000
016200                08  AR97-BEHAVIOR-SCORE       PIC X(4).           01570000
016300                08  AR97-PREV-BHVR-SCORE      PIC X(4).           01580000
016400                08  AR97-SIX-DAY-DEBIT-COUNTS.                    01590000
016500                    09  AR97-DAY-1-DEBITS     PIC X(2).           01600000
016600                    09  AR97-DAY-2-DEBITS     PIC X(2).           01610000
016700                    09  AR97-DAY-3-DEBITS     PIC X(2).           01620000
016800                    09  AR97-DAY-4-DEBITS     PIC X(2).           01630000
016900                    09  AR97-DAY-5-DEBITS     PIC X(2).           01640000
017000                    09  AR97-DAY-6-DEBITS     PIC X(2).           01650000
017100                08  FILLER REDEFINES AR97-SIX-DAY-DEBIT-COUNTS.   01660000
017200                    09  AR97-DAY-1-6-DEBITS OCCURS 6 TIMES        01670000
017300                                            PIC X(2).             01680000
017400                08  AR97-COLLECTION-DATA-NMDSREC.                 01690000
017500                    09  AR97-CR-SCORE-DATE    PIC X(5).           01700000
017600                    09  AR97-CREDIT-SCORE     PIC XXX.            01710000
017700                    09  AR97-COLLECTION-CODE  PIC X(4).           01720000
017800                    09  AR97-COFF-REASON-CODE PIC 99.             01730000
017900                    09  AR97-STATUS-REASON-CODE                   01740000
018000                        REDEFINES AR97-COFF-REASON-CODE PIC 99.   01750000
018100                    09  AR97-RECOURSE-FLAG    PIC X.              01760000
018200                    09  AR97-RECOURSE-MERCHANT PIC X(6).          01770000
018300                    09  AR97-WB-TRAN-TYPE     PIC X.              01780000
018400                    09  AR97-WB-PURGE-DATE    PIC X(6).           01790000
018500                    09  AR97-CREDIT-BUREAU-FLAG PIC X.            01800000
018600                08  AR97-COLL-PROC-FLAG       PIC X(2).           01810000
018700            07  AR97-RECOVERY-IND             PIC X(1).           01820000
018800            07  AR97-REISSUE-DATA.                                01830000
018900                08  AR97-REISSUE-DATA-NMDSREC.                    01840000
019000                    09  AR97-RENEWAL-CODE     PIC X(2).           01850000
019100                    09  AR97-NO-PLASTICS      PIC X(4).           01860000
019200                    09  AR97-PLASTICS-GROUP.                      01870000
019300                        10  AR97-TYPE-PLASTIC        PIC X.       01880000
019400                        10  AR97-SPOUSE-TYPE-PLASTIC PIC X.       01890000
019500                        10  AR97-DUAL-TYPE-PLASTIC   PIC X.       01900000
019600                        10  AR97-DUAL-SPOUSE-TYPE-PLASTIC PIC X.  01910000
019700                    09  AR97-NEWCARD-FLAG             PIC X.      01920000
019800                    09  AR97-ANNUAL-CHARGE-FLAG       PIC X.      01930000
019900                    09  AR97-ANNUAL-CHG-DATE     PIC X(5).        01940000
020000                    09  AR97-MAIL-CONTROL.                        01950000
020100                        10  AR97-MAIL-CODE   PIC X(4).            01960000
020200                        10  AR97-MAIL-CODE-FLAG PIC 9.            01970000
020300                08  AR97-PRTC-BLNC-CD        PIC X.               01980000
020400                08  AR97-OPEN-DATE           PIC X(8).            01990000
020500                08  AR97-MEMBER-SINCE-DATE   PIC X(5).            02000000
020600                08  AR97-FILLER-B5B022MS-2   PIC X(3).            02010000
020700                08  AR97-EXPIRATION-DATE     PIC X(8).            02020000
020800                08  AR97-REISSUE-CONTROL     PIC X(2).            02030000
020900                08  AR97-DATE-LAST-PLASTIC   PIC X(8).            02040000
021000            07  AR97-SMRT-CARD-DATA.                              02050000
021100                08  AR97-SMRT-CARD-ICC-CD    PIC X.               02060000
021200            07  AR97-CREDIT-LINE-DATA.                            02070000
021300                08  AR97-CREDIT-LINE         PIC X(16).           02080000
021400                08  AR97-CREDIT-LINE-DATA-NMDSREC.                02090000
021500                    09  AR97-TYPE-CRED-LINE-CHG PIC X.            02100000
021600                    09  AR97-CR-LINE-DATE    PIC X(5).            02110000
021700                    09  AR97-DATE-LAST-REVIEW PIC X(5).           02120000
021800                    09  AR97-DATE-NEXT-REVIEW PIC X(5).           02130000
021900            07  AR97-SPECIAL-CONTROL-FLAGS.                       02140000
022000                08  AR97-EXPANDED-CUST-USE-FLAGS.                 02150000
022100                    09  AR97-CUST-FLG-1        PIC X.             02160000
022200                    09  AR97-CUST-FLG-2        PIC X.             02170000
022300                    09  AR97-CUST-FLG-3        PIC X.             02180000
022400                    09  AR97-CUST-FLG-4        PIC X.             02190000
022500                08  FILLER REDEFINES                              02200000
022600                                    AR97-EXPANDED-CUST-USE-FLAGS. 02210000
022700                    09  AR97-EXP-CUST-USE-FLAG                    02220000
022800                                             OCCURS 4 TIMES PIC X.02230000
022900                08  AR97-SPECIAL-CODES.                           02240000
023000                    09  AR97-SC-1              PIC X.             02250000
023100                    09  AR97-SC-2              PIC X.             02260000
023200                    09  AR97-SC-3              PIC X.             02270000
023300                    09  AR97-SC-4              PIC X.             02280000
023400                    09  AR97-SC-5-8-NMDSREC.                      02290000
023500                        10  AR97-SC-5          PIC X.             02300000
023600                        10  AR97-SC-6          PIC X.             02310000
023700                        10  AR97-SC-7          PIC X.             02320000
023800                        10  AR97-SC-8          PIC X.             02330000
023900                08  FILLER REDEFINES AR97-SPECIAL-CODES.          02340000
024000                    09  AR97-SPECIAL-CONTROL                      02350000
024100                                 OCCURS 8 TIMES PIC X.            02360000
024200            07  AR97-MISCELLANEOUS-FIELDS.                        02370000
024300                08  AR97-MISCELLANEOUS-FIELD-1  PIC X(4).         02380000
024400                08  AR97-AMWAY-PENDING-AUTH REDEFINES             02390000
024500                    AR97-MISCELLANEOUS-FIELD-1  PIC 9(4).         02400000
024600                08  AR97-MISCELLANEOUS-FIELD-2  PIC X(5).         02410000
024700                08  AR97-AMWAY-CREDIT-LINE REDEFINES              02420000
024800                    AR97-MISCELLANEOUS-FIELD-2  PIC 9(5).         02430000
024900                08  AR97-MYRIAD-INCREASE-AMT REDEFINES            02440000
025000                    AR97-MISCELLANEOUS-FIELD-2  PIC 9(5).         02450000
025100                08  AR97-MISCELLANEOUS-FIELD-3  PIC X(8).         02460000
025200                08  AR97-AMWAY-BALANCE REDEFINES                  02470000
025300                    AR97-MISCELLANEOUS-FIELD-3  PIC X(8).         02480000
025400                08  AR97-MISCELLANEOUS-FIELD-4  PIC X(11).        02490000
025500                08  AR97-AMWAY-LS-BAL REDEFINES                   02500000
025600                    AR97-MISCELLANEOUS-FIELD-4  PIC X(11).        02510000
025700                08  FILLER REDEFINES                              02520000
025800                    AR97-MISCELLANEOUS-FIELD-4.                   02530000
025900                    09  AR97-MISC-FLD4-CD       PIC X(2).         02540000
026000*                   09  FILLER                  PIC X(6).         02550000
026000                    09  FILLER-4                PIC X(6).         02560000
026100                    09  AR97-MISC-4-LAST3       PIC X(3).         02570000
026200                08  AR97-MYRIAD-RELATED-ACCT-NO REDEFINES         02580000
026300                    AR97-MISCELLANEOUS-FIELD-4  PIC X(11).        02590000
026400                08  AR97-MISCELLANEOUS-FIELD-5.                   02600000
026500                    09  AR97-MISC-5-POS1-ID     PIC X.            02610000
026600                    09  AR97-MISC-5-POS2        PIC X(1).         02620000
026700                    09  FILLER-5                PIC X(16).        02630000
026700*                   09  FILLER                  PIC X(6).         02640000
026800                08  FILLER REDEFINES AR97-MISCELLANEOUS-FIELD-5.  02650000
026900                    09  AR97-PREV-PYMT-AMT   PIC X(9).            02660000
027000                    09  AR97-EARLY-PYMT-AMT  PIC X(9).            02670000
027100                08  AR97-MISCELLANEOUS-FIELD-6.                   02680000
027200*                  09  FILLER                   PIC X(11).        02690000
027200                    09  FILLER-6                 PIC X(11).       02700000
027300                    09  AR97-MISC6-POSITION12   PIC X(1).         02710000
027300                    09  FILLER-6-1              PIC X(12).        02720000
027400                08  FILLER REDEFINES AR97-MISCELLANEOUS-FIELD-6.  02730000
027500                    09  AR97-OVLMT-START-YYJJJ PIC X(6).          02740000
027600                    09  AR97-OVLMT-END-YYJJJ   PIC X(6).          02750000
027700                    09  AR97-OVLMT-HIGH-BAL    PIC X(6).          02760000
027800                    09  AR97-OVLMT-CR-LIMIT    PIC X(6).          02770000
027900                08  FILLER REDEFINES AR97-MISCELLANEOUS-FIELD-6.  02780000
028000                    09  AR97-MYRIAD-AMT-PAID    PIC  X(10).       02790000
028100                    09  FILLER-6-2               PIC  X.          02800000
028200                    09  AR97-MYRIAD-NO-PYMTS    PIC  99.          02810000
028100                    09  FILLER-6-3               PIC  X(11).      02820000
028300*               08  AR97-MISCELLANEOUS-FIELD-7 PIC X(10).         02830000
028300                08  AR97-MISCELLANEOUS-FIELD-7 PIC X(19).         02831000
028400                08  FILLER REDEFINES AR97-MISCELLANEOUS-FIELD-7.  02832000
028500                    09  AR97-LAST-CR-LIMIT     PIC X(6).          02833000
028600                    09  AR97-PREV-PYMT-YYJJJ   PIC X(6).          02834000
028700                    09  AR97-EARLY-PYMT-YYJJJ  PIC X(6).          02835000
028800                    09  FILLER-7               PIC X.             02836000
028900                08  FILLER REDEFINES AR97-MISCELLANEOUS-FIELD-7.  02837000
029000                    09  AR97-MYRIAD-ANN-CASH-ADV-INT PIC 9(5).    02838000
029100                    09  AR97-MYRIAD-INSURANCE-PREM   PIC 9(5).    02839000
                          09  FILLER-7-1                   PIC X(9).    02840000
029200*               08  AR97-MISCELLANEOUS-FIELD-8       PIC X(10).   02850000
029200                08  AR97-MISCELLANEOUS-FIELD-8       PIC X(19).   02860000
029300                08  FILLER REDEFINES AR97-MISCELLANEOUS-FIELD-8.  02870000
029400                    09  AR97-FIX-PAY-YYJJJ     PIC X(6).          02880000
029500                    09  AR97-PREV-STAT-YYJJJ   PIC X(6).          02890000
029600                    09  AR97-LAST-RET-CHECK    PIC X(6).          02900000
029700                    09  AR97-PREV-EXT-STAT     PIC X.             02910000
029800                08  FILLER REDEFINES AR97-MISCELLANEOUS-FIELD-8.  02920000
029900                    09  AR97-NW-OVLMT-START-YYJJJ                 02930000
030000                                                PIC X(6).         02940000
030100                    09  AR97-NW-OVLMT-END-YYJJJ                   02950000
030200                                                PIC X(6).         02960000
030300                    09 AR97-NW-DATE-HIGH-BAL-YYJJJ                02970000
030400                                                PIC X(6).         02980000
030500                    09  FILLER-8                 PIC X.           02990000
030600                08  FILLER REDEFINES AR97-MISCELLANEOUS-FIELD-8.  03000000
030700                    09  AR97-MSCL-FLD8-PSTN1    PIC X.            03010000
030800                    09  AR97-MSCL-FLD8-PSTN2    PIC X.            03020000
030900                    09  AR97-MSCL-FLD8-PSTN3    PIC X.            03030000
031000                    09  AR97-MSCL-FLD8-PSTN4    PIC X.            03040000
031100                    09  AR97-MSCL-FLD8-PSTN5    PIC X.            03050000
031200                    09  AR97-MSCL-FLD8-PSTN6    PIC X.            03060000
031300                    09  AR97-MSCL-FLD8-PSTN7    PIC X.            03070000
031400                    09  AR97-MSCL-FLD8-PSTN8    PIC X.            03080000
031500                    09  AR97-MSCL-FLD8-PSTN9    PIC X.            03090000
031600                    09  AR97-MSCL-FLD8-PSTN10   PIC X.            03100000
                          09  FILLER-8-1              PIC X(9).         03110000
031700                08  FILLER REDEFINES AR97-MISCELLANEOUS-FIELD-8.  03120000
031800                    09  FILLER-8-2               PIC X(3).        03130000
031900                    09  AR97-MSCL-FLD8-PSTN4-6  PIC 9(3).         03140000
032000*                   09  FILLER                   PIC X(4).        03150000
032000                    09  FILLER-8-3               PIC X(13).       03160000
032100                08  FILLER REDEFINES AR97-MISCELLANEOUS-FIELD-8.  03170000
032200*                   09  FILLER                   PIC X(4).        03180000
032200                    09  FILLER-8-4               PIC X(4).        03190000
032300                    09  AR97-MSCL-FLD8-CHG-DATE PIC X(6).         03200000
032200                    09  FILLER-8-5               PIC X(9).        03210000
032400            07  AR97-ADDL-MISC-FIELDS-NMDSREC.                    03220000
032500*               08  AR97-MISC-FIELD-9           PIC X(10).        03230000
032500                08  AR97-MISC-FIELD-9           PIC X(11).        03240000
032600                08  FILLER REDEFINES AR97-MISC-FIELD-9.           03250000
032700                    09  AR97-MISCELLANEOUS-FIELD-9 PIC X(11).     03260000
032800                08  FILLER REDEFINES AR97-MISC-FIELD-9.           03270000
032900                    09  FILLER-9-1               PIC X(5).        03280000
033000                    09  AR97-MISC9-POS6-ID      PIC X.            03290000
033100*                   09  FILLER                   PIC X(4).        03300000
033100                    09  FILLER-9-2               PIC X(5).        03310000
033200                08  AR97-MISC-FIELD-10          PIC X(10).        03320000
033300            07  AR97-MISC-FIELDS.                                 03330000
033400                08  AR97-MISC-FIELD-11-TX      PIC X(26).         03340000
033500                08  AR97-MISC-FIELD-12-TX      PIC X(26).         03350000
033600            07  AR97-MISC-DATES-NMDSREC.                          03360000
033700                08  AR97-DATE-LAST-PIN-MAILER  PIC X(8).          03370000
033800            07  AR97-DESIGNATED-AUTOPAY-AMT PIC X(19).            03380000
033900            07  AR97-CRLIFE-ORIG-NUM-STATE  PIC X(4).             03390000
034000            07  AR97-FDR-USE-MISC-FIELD-1       PIC X(10).        03400000
034100            07  FILLER REDEFINES AR97-FDR-USE-MISC-FIELD-1.       03410000
034200*               08  FILLER                       PIC X.           03420000
034200                08  FILLER-10                    PIC X.           03421000
034300                08  AR97-CRD-BUR-FLAG-2         PIC X.            03422000
034400                08  AR97-BTI-USE-FLAG           PIC X.            03423000
034500                08  AR97-STI-USE-FLAG           PIC X.            03424000
034600                08  AR97-REFUND-INDICATOR       PIC X.            03425000
034700                08  AR97-EXTD-REISSUE-BYPASS-FLAG PIC 9.          03426000
034800                08  AR97-CRLIFE-ORIG-STATE      PIC X(2).         03427000
034900                08  AR97-CRBR-CNSM-INFR-CD      PIC X(2).         03428000
035000            07  AR97-CROSS-REFERENCE-ACCT-NO  PIC X(18).          03429000
035100            07  AR97-NEW-XREF-NO-1            PIC X(18).          03430000
035200            07  AR97-NEW-XREF-NO-2            PIC X(18).          03440000
035300*           07  AR97-CUST-XREF-ID             PIC X(16).          03450000
035300            07  AR97-CUST-XREF-ID             PIC X(32).          03460000
035400            07  FILLER REDEFINES AR97-CUST-XREF-ID.               03470000
035500                08  AR97-OLD-CR-LIFE-DATE     PIC X(8).           03480000
035600                08  AR97-OLD-CR-LIFE-STAT-DATE PIC X(8).          03490000
035700                08  AR97-OLD-CR-LIFE-PAID-AMT                     03500000
035800                                             PIC X(15).           03510000
035900*               08  FILLER                   PIC X.               03520000
035900                08  FILLER-11                PIC X.               03530000
036000            07  AR97-CR-LIFE-STAT-DATE      PIC X(8).             03540000
036100            07  AR97-CR-LIFE-PAID-AMT       PIC X(15).            03550000
036200            07  AR97-TERMS-PROCESSING.                            03560000
036300                08  AR97-LS-TERMS-FLAG      PIC X(2).             03570000
036400                08  AR97-CTD-TERMS-FLAG     PIC X(2).             03580000
036500                08  AR97-TERMS-DATE         PIC X(8).             03590000
036600            07  AR97-TRANSFER-PROCESSING.                         03600000
036700                08  AR97-TRANSFER-FLAG      PIC X(2).             03610000
036800                08  AR97-DATE-LOST-STOLEN   PIC X(8).             03620000
036900                08  AR97-ACCT-TRANSFER      PIC X.                03630000
037000                08  AR97-ACCT-XFOOT         PIC X.                03640000
037100            07  AR97-BONUS-ACTIVITY.                              03650000
037200                08  AR97-BONUS-ACTIVITY-NMDS.                     03660000
037300                    09  AR97-ACCUM-BONUS-AMT                      03670000
037400                                             PIC X(19).           03680000
037500                    09  AR97-CTD-BONUS-CREDIT                     03690000
037600                                             PIC X(19).           03700000
037700                    09  AR97-CTD-BONUS-DEBIT                      03710000
037800                                             PIC X(19).           03720000
037900                    09  AR97-BONUS-QUALIFIED-PURCH                03730000
038000                                             PIC X(19).           03740000
038100                    09  AR97-BONUS-SELECT-DISBURSE-MTH   PIC X.   03750000
038200                    09  AR97-BONUS-ACTUAL-DISBURSE-MTH   PIC X.   03760000
038300                08  AR97-STMT-FEE-FLAG            PIC X.          03770000
038400                08  AR97-BONUS-PREV-YR-QUAL-PUR                   03780000
038500                                             PIC X(19).           03790000
038600                08  AR97-BONUS-PREV-YR-DOLLARS                    03800000
038700                                             PIC X(19).           03810000
038800                08  AR97-LAST-CALC-BONUS-AMT                      03820000
038900                                             PIC X(19).           03830000
039000            07  AR97-FIXED-PAYMENT-AMOUNTS.                       03840000
039100                08  AR97-FIXED-PAYMENT-AMT                        03850000
039200                                             PIC X(19).           03860000
039300                08  AR97-CASH-FIXED-PAYMENT                       03870000
039400                                             PIC X(19).           03880000
039500            07  AR97-SPECIAL-PROCESSING-FLAGS.                    03890000
039600                08  AR97-SPEC-PROC-FLAGS-NMDSREC.                 03900000
039700                    09  AR97-ANN-ACTIVITY-SUMM-FLAG   PIC X(2).   03910000
039800                    09  AR97-90-DAY-FLAG    PIC X(2).             03920000
039900                    09  AR97-DEFER-PAY-FLAG     PIC X(2).         03930000
040000                    09  AR97-PAY-AHEAD-FLAG     PIC X(2).         03940000
040100                    09  AR97-CREDIT-LIFE-FLAG.                    03950000
040200                        10  AR97-CREDIT-LIFE-FLAG-N PIC 9.        03960000
040300                    09  AR97-MAX-REBATE-AMT                       03970000
040400                                             PIC X(15).           03980000
040500                    09  AR97-DELETE-FLAG        PIC X.            03990000
040600                    09  AR97-DUALITY-FLAG       PIC X(2).         04000000
040700                    09  AR97-TYPE-LAST-NONMON  PIC X(4).          04010000
040800*                   09  AR97-CC-LEVEL1         PIC X(6).          04020000
040900*                   09  AR97-CC-LEVEL2         PIC X(6).          04030000
041000                    09  FILLER                  PIC X(12).        04040000
041100                08  AR97-SPEC-STMT-FLAG         PIC X(2).         04050000
041200                08  AR97-PORTFOLIO-NO-OLD       PIC X(4).         04060000
041300                08  AR97-AUTOPAY-SKIP-FLAG      PIC X(1).         04070000
041400                08  AR97-GROSS-ACTIVE           PIC X.            04080000
041500                08  AR97-DEBIT-ACTIVE           PIC X.            04090000
041600                08  AR97-BASIC-ACTIVE           PIC X.            04100000
041700                08  AR97-AUTH-FLAG              PIC X.            04110000
041800                08  AR97-INTEREST-SWITCH        PIC X.            04120000
041900                08  AR97-STMT-HOLD-FLAG         PIC X.            04130000
042000                08  AR97-MULTRAN-FLAG           PIC X.            04140000
042100                08  AR97-PREM-SUPPLE-INS-FLAG   PIC X.            04150000
042200                08  AR97-SPECIAL-RATE-FLAG      PIC X.            04160000
042300                08  AR97-DEBIT-BALANCE-CYCLE    PIC X(2).         04170000
042400                08  AR97-CASH-MOVE-DATE         PIC X(8).         04180000
042500                08  AR97-PINOFFSET-SECCODE-CHG-SW PIC X(2).       04190000
042600                08  AR97-LS-CASH-MOVE-DATE     PIC X(4).          04200000
042700                08  AR97-INT-ON-INT-FLAG        PIC X.            04210000
042800                08  AR97-ADD-STMT-FLAG          PIC 9.            04220000
042900            07  AR97-DEBIT-RATIFICATION.                          04230000
043000                08  AR97-DEBIT-RAT-TYPE         PIC X.            04240000
043100            07  AR97-REST-BASE-NMDSREC.                           04250000
043200                08  AR97-ICHG-DATE             PIC X(8).          04260000
043300                08  AR97-SORT-DISTRIBUTION     PIC X(4).          04270000
043400                08  AR97-IRS-HOME-EQUITY-FLAG  PIC 9.             04280000
043500                08  AR97-WAIV-OVERLATE-FEES    PIC X.             04290000
043600                08  AR97-DATE-FUTURE-TERMS     PIC X(8).          04300000
043700                08  AR97-CR-LIFE-STATUS        PIC X.             04310000
043800                08  AR97-CHECK-ORDER-FLAG      PIC X.             04320000
043900                08  AR97-CHECK-ORD-SPEC-FLAG   PIC X.             04330000
044000                08  AR97-LAST-CHECK-NUM-ISSUED PIC X(6).          04340000
044100                08  AR97-PHONE-CHARGE-FLAG     PIC X.             04350000
044200            07  AR97-CB-SCORE                  PIC X(4).          04360000
044300            07  AR97-CB-DATA-NMDSREC.                             04370000
044400                08  AR97-CB-ID                 PIC X.             04380000
044500                08  AR97-CB-CODE                PIC X(4).         04390000
044600                08  AR97-CB-ATTR1               PIC X.            04400000
044700                08  AR97-CB-ATTR2               PIC X.            04410000
044800                08  AR97-CB-ATTR3               PIC X.            04420000
044900                08  AR97-CB-SCORE-DATE         PIC X(8).          04430000
045000            07  AR97-CB-REASON1                 PIC XX.           04440000
045100            07  AR97-CB-REASON2                 PIC XX.           04450000
045200            07  AR97-CB-REASON3                 PIC XX.           04460000
045300            07  AR97-CB-REASON4                 PIC XX.           04470000
045400            07  AR97-RANDOM-DIGITS              PIC XX.           04480000
045500            07  AR97-CORRESPOND-FLAG            PIC 9.            04490000
045600            07  AR97-WAIV-OVLMT-RESET           PIC X.            04500000
045700            07  AR97-BTI-FIRST-USE-FLAGS.                         04510000
045800                08  AR97-BTI-FIRST-USE-FLAG     PIC X.            04520000
045900                08  AR97-STI-FIRST-USE-FLAG     PIC X.            04530000
046000            07  AR97-DEF-CR-LIFE-FLAG          PIC 9.             04540000
046100            07  AR97-MO-CHARGE-INT-ONLY        PIC X(4).          04550000
046200            07  AR97-PRE-ANNUAL-CHG-MESSAGE    PIC X.             04560000
046300            07  AR97-PINPOINT-CTD-COUNT        PIC X(4).          04570000
046400            07  AR97-ANN-FEE-CHARGED           PIC X(2).          04580000
046500            07  AR97-SERVICES-MATRIX           PIC X(5).          04590000
046600            07  AR97-CHDSELCT-SEQ-NO           PIC XXX.           04600000
046700            07  AR97-APPLICATION-SCORE         PIC X(6).          04610000
046800            07  AR97-DATE-STATUS-CHG           PIC X(8).          04620000
046900            07  AR97-RISK-PREDICTOR-SCORE      PIC X(5).          04630000
047000            07  AR97-RISK-PREDICTOR-BUREAU     PIC X(1).          04640000
047100            07  AR97-RISK-PREDICTOR-MODEL      PIC X(1).          04650000
047200            07  AR97-REGION-OF-DOMICILE.                          04660000
047300                08  AR97-VISA-REGION           PIC X.             04670000
047400                08  AR97-MC-REGION             PIC X.             04680000
047500            07  AR97-ACCT-TRANSFER-DATE        PIC X(6).          04690000
047600            07  AR97-ACCT-TRANSFER-FLAG        PIC X.             04700000
047700            07  AR97-CASH-CREDIT-LINE-CHG-DT   PIC X(8).          04710000
047800            07  AR97-CASH-CREDIT-LINE-CHG-TYP  PIC X.             04720000
047900            07  AR97-ADD-ON-RATE-FLAG          PIC X.             04730000
048000            07  AR97-CURR-PRICING-PORTFOLIO    PIC 9(4).          04740000
048100            07  AR97-CURR-PRICING-STRATEGY     PIC X(8).          04750000
048200            07  AR97-CURR-PRICE-STRATEGY-DATE  PIC X(8).          04760000
048300            07  AR97-CURR-STRAT-CYCLE-FLAG     PIC X(1).          04770000
048400            07  AR97-LS-PRCN-PORT-ID           PIC 9(4).          04780000
048500            07  AR97-OLD-NEXT-PRICING-STRATEGY PIC X(8).          04790000
048600            07  AR97-NEXT-PRICE-STRATEGY-DATE  PIC X(5).          04800000
048700            07  AR97-OLD-NEXT-STRAT-CYCLE-FLAG PIC X(1).          04810000
048800            07  AR97-OLD-NEXT-STRT-STAGE-RSN   PIC X(1).          04820000
048900            07  AR97-LS-PRICING-STRATEGY       PIC X(8).          04830000
049000            07  AR97-LAST-STRATEGY-CHANGE-DATE PIC X(8).          04840000
049100            07  AR97-PROCESSING-LEVEL          PIC X(1).          04850000
049200            07  AR97-UD-GEO-CODE               PIC X(4).          04860000
049300            07  AR97-UD-RISK-SCORE             PIC X(4).          04870000
049400            07  AR97-UD-PRODUCT-TYPE           PIC X(4).          04880000
049500            07  AR97-RSRVD-FILLER-PRDT-TYP     PIC X.             04890000
049600            07  AR97-UD-SOURCE-CODE            PIC X(4).          04900000
049700            07  AR97-UD-PROFITABILITY-INDEX    PIC X(4).          04910000
049800            07  AR97-UD-FINANCIAL-INSTITUTION  PIC X(8).          04920000
049900            07  AR97-UD-BANK-RELATION-CODE     PIC X(4).          04930000
050000            07  AR97-UD-ATTRITION-INDEX        PIC X(4).          04940000
050100            07  AR97-UD-APPROVAL-OFFICER-CODE  PIC X(8).          04950000
050200            07  AR97-UD-LIFESTYLE-IND          PIC X(8).          04960000
050300            07  AR97-UD-RPT1                   PIC X(4).          04970000
050400            07  AR97-UD-RPT2                   PIC X(4).          04980000
050500            07  AR97-UD-RPT3                   PIC X(4).          04990000
050600            07  AR97-UD-RPT4                   PIC X(4).          05000000
050700            07  AR97-UD-AD-MESSAGE-FLAG        PIC X(4).          05010000
050800            07  AR97-UD-PRICING-CONTROLS.                         05020000
050900                08  AR97-UPC-1                 PIC X(1).          05030000
051000                08  AR97-UPC-2                 PIC X(1).          05040000
051100                08  AR97-UPC-3                 PIC X(1).          05050000
051200                08  AR97-UPC-4                 PIC X(1).          05060000
051300                08  AR97-UPC-5                 PIC X(1).          05070000
051400                08  AR97-UPC-6                 PIC X(2).          05080000
051500                08  AR97-UPC-7                 PIC X(2).          05090000
051600                08  AR97-UPC-8                 PIC X(3).          05100000
051700                08  AR97-UPC-9                 PIC X(3).          05110000
051800                08  AR97-UPC-10                PIC X(4).          05120000
051900                08  AR97-UPC-11                PIC X(5).          05130000
052000                08  AR97-UPC-12                PIC X(6).          05140000
052100            07  AR97-JFRAUD-FIELDS-NMDSREC.                       05150000
052200                08  AR97-FRAUD-PORT-ID         PIC 99.            05160000
052300                08  AR97-FRAUD-ASSG-STRATEGY   PIC XX.            05170000
052400                08  AR97-FRAUD-STRAT-CHANGE-DATE                  05180000
052500                                                PIC X(8).         05190000
052600                08  AR97-FRAUD-SUSPEND-STRATEGY PIC XX.           05200000
052700                08  AR97-FRAUD-SUSP-STRATEGY-DATE                 05210000
052800                                                PIC X(8).         05220000
052900                08  AR97-LAST-PLASTIC-SOURCE   PIC X.             05230000
053000                08  AR97-FRAUD-SCORE-CHANGE-DATE                  05240000
053100                                                PIC X(8).         05250000
053200            07  AR97-MORE-JFRAUD-FIELDS.                          05260000
053300                08 AR97-FRAUD-SCORE            PIC X(4).          05270000
053400            07  AR97-DATE-LAST-ACL-LTR         PIC X(8).          05280000
053500            07  AR97-DISCOUNT-CODE             PIC X(01).         05290000
053600            07  AR97-DATE-ONE-DAY-PURCH-ELIG   PIC X(8).          05300000
053700            07  AR97-NO-DAYS-CLR-ONE-DAY-PURCH PIC X(4).          05310000
053800            07  AR97-DATE-ONE-DAY-PRCH-APPLIED                    05320000
053900                                                PIC X(8).         05330000
054000            07  AR97-ONE-DAY-PURCH-DISC-PCT    PIC X(5).          05340000
054100            07  AR97-ONE-DAY-PURCH-PROMO-ID    PIC X(05).         05350000
054200            07  AR97-MBR-BNFT-CD.                                 05360000
054300                08  AR97-MBR-BNFT-01-CD        PIC X.             05370000
054400                08  AR97-MBR-BNFT-02-CD        PIC X.             05380000
054500                08  AR97-MBR-BNFT-03-CD        PIC X.             05390000
054600                08  AR97-MBR-BNFT-04-CD        PIC X.             05400000
054700                08  AR97-MBR-BNFT-05-CD        PIC X.             05410000
054800                08  AR97-MBR-BNFT-06-CD        PIC X.             05420000
054900                08  AR97-MBR-BNFT-07-CD        PIC X.             05430000
055000                08  AR97-MBR-BNFT-08-CD        PIC X.             05440000
055100                08  AR97-MBR-BNFT-09-CD        PIC X.             05450000
055200                08  AR97-MBR-BNFT-10-CD        PIC X.             05460000
055300                08  AR97-MBR-BNFT-11-CD        PIC X.             05470000
055400                08  AR97-MBR-BNFT-12-CD        PIC X.             05480000
055500                08  AR97-MBR-BNFT-13-CD        PIC X.             05490000
055600                08  AR97-MBR-BNFT-14-CD        PIC X.             05500000
055700                08  AR97-MBR-BNFT-15-CD        PIC X.             05510000
055800                08  AR97-MBR-BNFT-16-CD        PIC X.             05520000
055900                08  AR97-MBR-BNFT-17-CD        PIC X.             05530000
056000                08  AR97-MBR-BNFT-18-CD        PIC X.             05540000
056100                08  AR97-MBR-BNFT-19-CD        PIC X.             05550000
056200                08  AR97-MBR-BNFT-20-CD        PIC X.             05560000
056300                08  AR97-MBR-BNFT-21-CD        PIC X.             05570000
056400                08  AR97-MBR-BNFT-22-CD        PIC X.             05580000
056500                08  AR97-MBR-BNFT-23-CD        PIC X.             05590000
056600                08  AR97-MBR-BNFT-24-CD        PIC X.             05600000
056700                08  AR97-MBR-BNFT-25-CD        PIC X.             05610000
056800                08  AR97-MBR-BNFT-26-CD        PIC X.             05620000
056900                08  AR97-MBR-BNFT-27-CD        PIC X.             05630000
057000                08  AR97-MBR-BNFT-28-CD        PIC X.             05640000
057100                08  AR97-MBR-BNFT-29-CD        PIC X.             05650000
057200                08  AR97-MBR-BNFT-30-CD        PIC X.             05660000
057300*           07  AR97-CC-LEVEL3                 PIC X(6).          05670000
057400*           07  AR97-CC-LEVEL4                 PIC X(6).          05680000
057500*           07  AR97-CC-LEVEL5                 PIC X(6).          05690000
057600*           07  FILLER                         PIC X(18).         05700000
FD1704*           07  FILLER                         PIC X(08).         05710000
FD1801            07  FILLER                         PIC X(07).         05711000
FD1801            07  AR97-ANNL-FEE-REVERSED-CD      PIC X.             05712000
FD1704            07  AR97-UPGR-DT                   PIC X(10).         05713000
057700            07  AR97-NO-MAIL-FLAG              PIC X(2).          05714000
057800            07  AR97-RMRT-TYPE-CD              PIC X(1).          05715000
057900            07  AR97-LS-PRMT-PRCH-STMT-IN      PIC X(1).          05716000
058000            07  AR97-STRATEGY-LOCKS-NMDSREC.                      05717000
058100                08  AR97-PRICING-STRATEGY-STATUS  PIC X.          05718000
058200                08  AR97-PRICING-STRATEGY-LOCK-BEG                05719000
058300                                                PIC X(8).         05720000
058400                08  AR97-PRICING-STRATEGY-LOCK-END                05730000
058500                                                PIC X(8).         05740000
058600            07  AR97-CTD-PARTNER-DEBITS     PIC X(19).            05750000
058700            07  AR97-YTD-UNUSD-PRTNR-REBATES                      05760000
058800                                             PIC X(19).           05770000
058900            07  AR97-LSTYR-UNUSD-PRTNR-REBT PIC X(19).            05780000
059000            07  AR97-YTD-PARTNER-EARNED     PIC X(19).            05790000
059100            07  AR97-LIFTIME-PRTNR-EARNED   PIC X(19).            05800000
059200            07  AR97-BONUS-STRATEGY            PIC X(8).          05810000
059300            07  AR97-LS-BONUS-STRATEGY         PIC X(8).          05820000
059400            07  AR97-ADJ-EXPIRATION-DATE       PIC X(5).          05830000
059500            07  AR97-ADJ-REISSUE-INTVL         PIC X(5).          05840000
059600            07  AR97-LAST-ANNUAL-CHARGE-FLAG   PIC X.             05850000
059700            07  AR97-HOME-BANK-IND             PIC X.             05860000
059800            07  AR97-HIGH-BAL-LIFE          PIC X(19).            05870000
059900            07  AR97-MIN-DAYS-DELQ-NR          PIC X(4).          05880000
060000            07  AR97-BSCORE-ACS-CLNT-PRT-FLDS.                    05890000
060100                08  AR97-ACS-CLNT-ID           PIC 9(4).          05900000
060200                08  AR97-ACS-CURR-PORT         PIC 9(4).          05910000
060300                08  AR97-ACS-RNDM-DGT          PIC X(4).          05920000
060400                08  AR97-ACS-PORT-CHG-DATE     PIC X(10).         05930000
060500                08  AR97-ACS-OVERRIDE-PORT     PIC 9(4).          05940000
060600            07  AR97-ALTERNATE-LANGUAGE-FLAG   PIC XX.            05950000
060700            07  AR97-XCEPT-CHARGE-OFF-FLAG     PIC X.             05960000
060800            07  AR97-NOTE-OF-NEG-RPT           PIC 9.             05970000
060900            07  AR97-PREV-INTERNAL-STATUS      PIC X.             05980000
061000            07  AR97-DATE-IN-COLLECTION        PIC X(10).         05990000
061100            07  AR97-START-DATE-OF-DELQ        PIC X(10).         06000000
061200            07  AR97-RECOVER-DOLLARS-FACTOR   PIC X(7).           06010000
061300            07  AR97-PRIMARY-PEF               PIC X(26).         06020000
061400            07  AR97-SECONDARY-PEF             PIC X(26).         06030000
061500            07  AR97-LATE-FEE-WAIVER-CT        PIC 9.             06040000
061600            07  AR97-COV-STRATEGY-ID           PIC X(4).          06050000
061700            07  AR97-CREDIT-LIFE-INSURANCE OCCURS 6 TIMES.        06060000
061800                08  AR97-CLI-PRODUCT-CODE      PIC X(2).          06070000
061900                08  AR97-CLI-EFFECTIVE-DATE    PIC X(8).          06080000
062000                08  AR97-CLI-RATE-STATE        PIC X(2).          06090000
062100                08  AR97-CLI-STATUS-CODE       PIC X.             06100000
062200                08  AR97-CLI-FREE-CYCLES-REMAIN PIC X(4).         06110000
062300            07  AR97-LAST-PARTNER-EARNED    PIC X(19).            06120000
062400            07  AR97-CTD-PRTNR-SALE-ADJ     PIC X(19).            06130000
062500            07  AR97-CTD-PRTNR-RTRN-ADJ     PIC X(19).            06140000
062600            07  AR97-BS-REASON-CODE-1          PIC X(8).          06150000
062700            07  AR97-BS-REASON-CODE-2          PIC X(8).          06160000
062800            07  AR97-BS-REASON-CODE-3          PIC X(8).          06170000
062900            07  AR97-BS-REASON-CODE-4          PIC X(8).          06180000
063000            07  AR97-LIFTIME-REBATE-PTS     PIC X(19).            06190000
063100            07  AR97-TESR-QLFD-IN              PIC X.             06200000
063200            07  AR97-PRTNR-BONUS-QUAL-PURCH PIC X(19).            06210000
063300            07  AR97-CTD-PRTNR-RETURNS      PIC X(19).            06220000
063400            07  AR97-CACS-COLLECTION-DATA.                        06230000
063500                08  AR97-CACS-REASON           PIC X.             06240000
063600                08  AR97-CACS-USER-ROUTING     PIC X(2).          06250000
063700                08  AR97-CACS-COLLECTOR        PIC X(4).          06260000
063800            07  AR97-ADMIN-HISTORY.                               06270000
063900                08  AR97-REQ-CLOSED-DATE       PIC X(10).         06280000
064000                08  AR97-PIN-CHANGE-DATE       PIC X(10).         06290000
064100                08  AR97-PREV-CRLINE-CHANGE-DATE                  06300000
064200                                               PIC X(5).          06310000
064300                08  AR97-CRLINE-CHANGE-AMT     PIC X(16).         06320000
064400            07  AR97-MISC-ADMIN-HISTORY.                          06330000
064500                08  AR97-PHONE-CARD-ID         PIC X.             06340000
064600            07  AR97-IP-START-DATE             PIC X(10).         06350000
064700            07  FILLER REDEFINES AR97-IP-START-DATE.              06360000
064800                08 FILLER                      PIC X.             06370000
064900                08  AR97-IP-START-DATE-YMD     PIC X(7).          06380000
065000            07  AR97-IP-EFF-END-DATE           PIC X(10).         06390000
065100            07  FILLER REDEFINES AR97-IP-EFF-END-DATE.            06400000
065200                08 FILLER                      PIC X.             06410000
065300                08 AR97-IP-EFF-END-DATE-YMD    PIC X(7).          06420000
065400            07  AR97-IP-PLANNED-END-DATE       PIC X(10).         06430000
065500            07  FILLER REDEFINES AR97-IP-PLANNED-END-DATE.        06440000
065600                08 FILLER                      PIC X.             06450000
065700                08  AR97-IP-PLANNED-END-DATE-YMD                  06460000
065800                                               PIC X(7).          06470000
065900            07  AR97-IP-CASH-RATE-ANN          PIC X(7).          06480000
066000            07  AR97-IP-CASH-RATE-MONTHLY      PIC X(7).          06490000
066100            07  AR97-IP-CASH-RATE-DAILY        PIC X(9).          06500000
066200            07  AR97-IP-MRCH-RATE-ANN          PIC X(7).          06510000
066300            07  AR97-IP-MRCH-RATE-MONTHLY      PIC X(7).          06520000
066400            07  AR97-IP-MRCH-RATE-DAILY        PIC X(9).          06530000
066500            07  AR97-PP-EXCL-ADD-ON-FLAG       PIC X(3).          06540000
066600            07  AR97-PP-EXCL-MPD-FLAG          PIC X(3).          06550000
066700            07  AR97-PP-CURE-FLAG              PIC X.             06560000
066800            07  AR97-DATE-LAST-RSNCD-CHNG      PIC X(10).         06570000
066900            07  AR97-AT-AUTH-AGAINST-NEW       PIC 9.             06580000
067000            07  AR97-CIMS-PRODUCT-CODE         PIC X(3).          06590000
067100            07  AR97-LOST-ACCUM                PIC X(4).          06600000
067200            07  AR97-STOLEN-ACCUM              PIC X(4).          06610000
067300            07  AR97-TEMP-PLASTIC-IND          PIC 9.             06620000
067400            07  AR97-SKIP-PAY-HISTORY          PIC X(12).         06630000
067500            07  FILLER REDEFINES AR97-SKIP-PAY-HISTORY.           06640000
067600                08  AR97-SP-1-12          PIC X  OCCURS 12 TIMES. 06650000
067700            07  AR97-LAST-CRDT-BURE-IN         PIC X.             06660000
067800            07  AR97-SKIP-ELGB-IN              PIC X.             06670000
067900            07  AR97-AUTO-STRT-DT              PIC X(10).         06680000
068000            07  FILLER REDEFINES AR97-AUTO-STRT-DT.               06690000
068100                08 FILLER                       PIC X.            06700000
068200                08 AR97-AUTO-STRT-DT-YMD       PIC X(7).          06710000
068300            07  AR97-AUTO-END-DT               PIC X(10).         06720000
068400            07  FILLER REDEFINES AR97-AUTO-END-DT.                06730000
068500                08 FILLER                       PIC X.            06740000
068600                08  AR97-AUTO-END-DT-YMD       PIC X(7).          06750000
068700            07  AR97-CASH-CRDT-LINE-AM        PIC X(16).          06760000
068800            07  AR97-CASH-LINE-ADJS-CD         PIC X.             06770000
068900            07  AR97-CASH-LINE-REVW-DT         PIC X(8).          06780000
069000            07  AR97-PLST-DLAY-DAY-CT          PIC 9(2).          06790000
069100            07  AR97-MIN-PMNT-DUE-STRT-DT      PIC X(10).         06800000
069200            07  FILLER REDEFINES AR97-MIN-PMNT-DUE-STRT-DT.       06810000
069300                08 FILLER                       PIC X.            06820000
069400                08  AR97-MIN-PMNT-STRT-DT-YMD  PIC X(7).          06830000
069500            07  AR97-MIN-PMNT-DUE-END-DT       PIC X(10).         06840000
069600            07  FILLER REDEFINES AR97-MIN-PMNT-DUE-END-DT.        06850000
069700                08 FILLER                       PIC X.            06860000
069800                08  AR97-MIN-PMNT-END-DT-YMD   PIC X(7).          06870000
069900            07  AR97-MIN-PMNT-DUE-OVRR-CD      PIC X.             06880000
070000            07  AR97-MIN-PMNT-DUE-RT          PIC X(9).           06890000
070100            07  AR97-FIXD-PMNT-FUTR-AM      PIC X(19).            06900000
070200            07  AR97-SHDW-LINE-AM           PIC X(19).            06910000
070300            07  AR97-SHDW-LINE-EXPR-DT         PIC X(10).         06920000
070400            07  AR97-SHDW-LINE-CHNG-DT         PIC X(10).         06930000
070500            07  AR97-SHDW-LINE-REVW-DT         PIC X(8).          06940000
070600            07  AR97-LS-OVRL-FEE-WAVR-ID       PIC X.             06950000
070700            07  AR97-LAST-SKIP-PAY-CD          PIC X.             06960000
070800            07  AR97-RSRV-CRDT-LINE-PRCN-RT    PIC X(5).          06970000
070900            07  AR97-RSRV-CRDT-LINE-AVLB-AM PIC X(19).            06980000
071000            07  AR97-AMEX-AIRF-INSR-CD         PIC X.             06990000
071100            07  AR97-AMEX-FATO-ANNV-DT         PIC X(10).         07000000
071200            07  AR97-AMEX-BAGG-INSR-CD         PIC X.             07010000
071300            07  AR97-USAV-GROP-ID              PIC X.             07020000
071400            07  AR97-PREV-USAV-GROP-ID         PIC X.             07030000
071500            07  AR97-USAV-GROP-ID-LAST-CHNG-DT PIC X(10).         07040000
071600            07  AR97-USAV-OPT-OUT-CD           PIC X.             07050000
071700            07  AR97-REGN-CD                   PIC X.             07060000
071800            07  AR97-ANNL-CHRG-CASH-ADVN-CT    PIC X(4).          07070000
071900            07  AR97-NON-REISSUE-LETTER-DATA   PIC  X(9).         07080000
072000            07  FILLER REDEFINES AR97-NON-REISSUE-LETTER-DATA.    07090000
072100                08  AR97-NON-REISSUE-LETTER-NO PIC  X(4).         07100000
072200                08  AR97-NON-REISSUE-LETTER-DATE                  07110000
072300                                                PIC X(8).         07120000
072400                08  AR97-NON-REISSUE-LETTER-TYPE PIC X(1).        07130000
072500            07  AR97-PYMNT-REAG-REFNO-NR       PIC X(17).         07140000
072600            07  AR97-PYMNT-REAG-CCYYMMDD-DT    PIC X(10).         07150000
072700            07  AR97-PYMNT-REAG-LAST-YYMM-DT   PIC X(6).          07160000
072800            07  AR97-PYMNT-REAG-NEXT-YYMM-DT   PIC X(6).          07170000
072900            07  AR97-PRTN-ID                   PIC X(17).         07180000
073000            07  AR97-TLP-CLT-ID                PIC X(8).          07190000
073100            07  AR97-TLP-CLT-EXPR-DT           PIC X(10).         07200000
073200            07  AR97-ACCT-CT                   PIC X(4).          07210000
073300            07  AR97-USER-TX                   PIC  X(24).        07220000
073400            07  FILLER  REDEFINES AR97-USER-TX.                   07230000
073500                08  AR97-ORGN-ACCT             PIC  X(16).        07240000
073600                08  AR97-ORGN-ACCT-DT          PIC  X(8).         07250000
073700            07  AR97-UNPD-ANNL-FEE-AM       PIC X(15).            07260000
073800            07  AR97-UNPD-ANNL-FEE-REB-BON-CD  PIC  X(1).         07270000
073900            07  AR97-FLGH-RWRD-CD              PIC  X(1).         07280000
074000            07  AR97-PREV-CLT-ID               PIC  X(8).         07290000
074100            07  AR97-CLT-CHG-DT                PIC X(10).         07300000
074200            07  AR97-PFST-ATTR-SCOR-NR         PIC 9(4).          07310000
074300            07  AR97-PFST-CRDT-SCOR-NR         PIC 9(4).          07320000
074400            07  AR97-PFST-REVN-PRDC-AM      PIC X(19).            07330000
074500            07  AR97-PFST-PRFT-PRDC-AM      PIC X(19).            07340000
074600            07  AR97-PFST-CRDT-RSN1-CD         PIC 9(4).          07350000
074700            07  AR97-PFST-CRDT-RSN2-CD         PIC 9(4).          07360000
074800            07  AR97-PFST-CRDT-RSN3-CD         PIC 9(4).          07370000
074900            07  AR97-PFST-SCOR-LAST-DT         PIC 9(9).          07380000
075000            07  AR97-ACS-WB-STTS-CD            PIC X.             07390000
075100            07  AR97-CAYR-REBT-ERND-AM      PIC X(19).            07400000
075200            07  AR97-LAYR-REBT-ERND-AM      PIC X(19).            07410000
075300            07  AR97-REBT-EXPR-AM           PIC X(19).            07420000
075400            07  AR97-XCSV-INT-CT               PIC X(4).          07430000
075500            07  AR97-OTST-CHCK-CT              PIC X(4).          07440000
075600            07  AR97-CRRN-ANNL-CASH-RT        PIC X(7).           07450000
075700            07  AR97-CRRN-ANNL-MRCH-RT        PIC X(7).           07460000
075800            07  AR97-HIGH-NOM-MRCH-APPLIED-RT PIC X(7).           07470000
075900            07  AR97-LOW-NOM-MRCH-APPLIED-RT  PIC X(7).           07480000
076000            07  AR97-HIGH-NOM-CASH-APPLIED-RT PIC X(7).           07490000
076100            07  AR97-LOW-NOM-CASH-APPLIED-RT  PIC X(7).           07500000
076200            07  AR97-NO-DELT-CD                PIC X.             07510000
076300            07  AR97-E1-DATE                   PIC X(10).         07520000
076400            07  AR97-EQTY-ACCT-MTRT-DT         PIC X(10).         07530000
076500            07  AR97-SKIP-CHRG-OFF-DAYS-NR     PIC X(4).          07540000
076600            07  AR97-LAST-STMT-RELJUL          PIC X(4).          07550000
076700            07  AR97-USAV-CTD-TOTL-AM       PIC X(19).            07560000
076800            07  AR97-NO-FEES-CD                PIC X.             07570000
076900            07  AR97-CTD-AUTH-AM            PIC X(19).            07580000
077000            07  AR97-SUB-ACCT-CD               PIC X(01).         07590000
077100            07  AR97-CMPN-ID                   PIC X(08).         07600000
077200            07  AR97-ACCT-MRKT-STRT-NM         PIC X(8).          07610000
077300            07  AR97-ACCT-MRKT-PRCS-CD         PIC X.             07620000
077400            07  AR97-ACCT-MRKT-STRT-DT         PIC X(10).         07630000
077500            07  AR97-REIS-STRT-NM              PIC X(8).          07640000
077600            07  AR97-REIS-PRCS-CD              PIC X.             07650000
077700            07  AR97-REIS-STRT-DT              PIC X(10).         07660000
077800            07  AR97-PRMR-PLST-STRT-NM         PIC X(8).          07670000
077900            07  AR97-PLST-PRCS-CD              PIC X.             07680000
078000            07  AR97-PLST-STRT-DT              PIC X(10).         07690000
078100            07  AR97-CARD-ISSN-STRT-NM         PIC X(8).          07700000
078200            07  AR97-CARD-ISSN-PRCS-CD         PIC X.             07710000
078300            07  AR97-CARD-ISSN-STRT-DT         PIC X(10).         07720000
078400            07  AR97-TMPR-AUTO-PAY-AM PIC X(15).                  07730000
078500            07  AR97-PRCN-STRT-UNLC-DT-RLLC-CD PIC X.             07740000
078600            07  AR97-SCOR-FLDS.                                   07750000
078700                08  AR97-SCOR-ONE-NR           PIC X(8).          07760000
078800                08  AR97-SCOR-ONE-DT           PIC X(10).         07770000
078900                08  AR97-SCOR-ONE-RESN-ONE-NR  PIC X(8).          07780000
079000                08  AR97-SCOR-ONE-RESN-TWO-NR  PIC X(8).          07790000
079100                08  AR97-SCOR-ONE-RESN-THRE-NR PIC X(8).          07800000
079200                08  AR97-SCOR-TWO-NR           PIC X(8).          07810000
079300                08  AR97-SCOR-TWO-DT           PIC X(10).         07820000
079400                08  AR97-SCOR-TWO-RESN-ONE-NR  PIC X(8).          07830000
079500                08  AR97-SCOR-TWO-RESN-TWO-NR  PIC X(8).          07840000
079600                08  AR97-SCOR-TWO-RESN-THRE-NR PIC X(8).          07850000
079700                08  AR97-SCOR-THRE-NR          PIC X(8).          07860000
079800                08  AR97-SCOR-THRE-DT          PIC X(10).         07870000
079900                08  AR97-SCOR-FOUR-NR          PIC X(8).          07880000
080000                08  AR97-SCOR-FOUR-DT          PIC X(10).         07890000
080100                08  AR97-SCOR-FIVE-NR          PIC X(8).          07900000
080200                08  AR97-SCOR-FIVE-DT          PIC X(10).         07910000
080300                08  AR97-SCOR-SIX-NR           PIC X(8).          07920000
080400                08  AR97-SCOR-SIX-DT           PIC X(10).         07930000
080500                08  AR97-SCOR-SIX-RESN-ONE-NR  PIC X(8).          07940000
080600                08  AR97-SCOR-SIX-RESN-TWO-NR  PIC X(8).          07950000
080700                08  AR97-SCOR-SIX-RESN-THRE-NR PIC X(8).          07960000
080800                08  AR97-SCOR-SEVN-NR          PIC X(8).          07970000
080900                08  AR97-SCOR-SEVN-DT          PIC X(10).         07980000
081000                08  AR97-SCOR-SEVN-RESN-ONE-NR PIC X(8).          07990000
081100                08  AR97-SCOR-SEVN-RESN-TWO-NR PIC X(8).          08000000
081200                08  AR97-SCOR-SEVN-RESN-THRE-NR                   08010000
081300                                                PIC X(8).         08020000
081400                08  AR97-SCOR-EGHT-NR          PIC X(8).          08030000
081500                08  AR97-SCOR-EGHT-DT          PIC X(10).         08040000
081600                08  AR97-SCOR-NINE-NR          PIC X(8).          08050000
081700                08  AR97-SCOR-NINE-DT          PIC X(10).         08060000
081800                08  AR97-SCOR-TEN-NR           PIC X(8).          08070000
081900                08  AR97-SCOR-TEN-DT           PIC X(10).         08080000
082000                08  AR97-BHVR-SCOR-PRTF-ID     PIC X(6).          08090000
082100            07  AR97-PFST-REVN-RSN1-CD         PIC 9(4).          08100000
082200            07  AR97-PFST-REVN-RSN2-CD         PIC 9(4).          08110000
082300            07  AR97-PFST-REVN-RSN3-CD         PIC 9(4).          08120000
082400            07  AR97-PFST-ATTR-RSN1-CD         PIC 9(4).          08130000
082500            07  AR97-PFST-ATTR-RSN2-CD         PIC 9(4).          08140000
082600            07  AR97-PFST-ATTR-RSN3-CD         PIC 9(4).          08150000
082700            07  AR97-ANNV-CASH-INTR-RT        PIC X(7).           08160000
082800            07  AR97-ANNV-MDSE-INTR-RT        PIC X(7).           08170000
082900            07  AR97-ACTV-DSPT-CT              PIC X(4).          08180000
083000            07  AR97-JONT-INSR-CD              PIC X.             08190000
083100            07  AR97-TRMN-INCN-PRCN-CD         PIC X.             08200000
083200            07  AR97-ALL-DVRT-FEES-CD.                            08210000
083300                08  AR97-DVRT-LATE-FEES-CD     PIC X.             08220000
083400                08  AR97-DVRT-CASH-ITEM-FEES-CD PIC X.            08230000
083500                08  AR97-DVRT-OVER-LIMT-FEES-CD PIC X.            08240000
083600                08  AR97-DVRT-STMT-FEES-CD     PIC X.             08250000
083700                08  AR97-DVRT-MRCH-ITEM-FEES-CD PIC X.            08260000
083800                08  AR97-DVRT-INTR-MTHD-FEES-CD PIC X.            08270000
083900                08  AR97-DVRT-CRDT-LIFE-FEES-CD PIC X.            08280000
084000            07  AR97-OTST-PLST-CT              PIC X(4).          08290000
084100            07  AR97-FAMILY-CARD-DATA.                            08300000
084200                08  AR97-ACCT-GROP-ID          PIC X(13).         08310000
084300                08  AR97-GROP-MMBR-TYPE-CD     PIC X.             08320000
084400                08  AR97-DPND-STRT-ID          PIC X(4).          08330000
084500            07  AR97-ALWY-REFR-CD              PIC X.             08340000
084600            07  AR97-STMT-FORM-ID              PIC X(3).          08350000
084700            07  AR97-STMT-FRMT-ID              PIC X(3).          08360000
084800            07  AR97-STMT-DSCL-ID              PIC X(2).          08370000
084900            07  AR97-ATPY-BAL-RT            PIC X(8).             08380000
085000            07  AR97-ATPY-CLNG-AM           PIC X(15).            08390000
085100            07  AR97-DDA-NM                    PIC X(22).         08400000
085200            07  AR97-INTL-VISA-PHONE-CD        PIC X(1).          08410000
085300            07  AR97-INTL-VISA-PHONE-DT        PIC X(10).         08420000
085400            07  AR97-UPC-19-NR                 PIC X(4).          08430000
085500            07  AR97-UPC-20-NR                 PIC X(10).         08440000
085600            07  AR97-UPC-21-AM              PIC X(19).            08450000
085700            07  AR97-UPC-22-NR                PIC X(16).          08460000
085800            07  AR97-REBATE-PENDG-IND          PIC X.             08470000
085900            07  AR97-MTHD-OVRR-SEGS-NR         PIC X(4).          08480000
086000            07  AR97-UD-PRICING-CONTROLS-ADD.                     08490000
086100                08  AR97-UPC-13                PIC X(2).          08500000
086200                08  AR97-UPC-14                PIC X(2).          08510000
086300                08  AR97-UPC-15                PIC X(2).          08520000
086400                08  AR97-UPC-16                PIC X(2).          08530000
086500                08  AR97-UPC-17                PIC X(2).          08540000
086600            07  AR97-FCLT-GRAD-NR              PIC 9.             08550000
086700            07  AR97-FCLT-GRAD-CHNG-DT         PIC X(10).         08560000
086800            07  AR97-INT-IN-SUSP-AMT        PIC X(19).            08570000
086900            07  AR97-INT-BEF-SUSP-AMT       PIC X(19).            08580000
087000            07  AR97-PY-INT-IN-SUSP-AMT     PIC X(19).            08590000
087100            07  AR97-LTR-CATGRY-GRP-CD.                           08600000
087200                08  AR97-LTR-CATGRY-GRP-A-CD   PIC X.             08610000
087300                08  AR97-LTR-CATGRY-GRP-B-CD   PIC X.             08620000
087400                08  AR97-LTR-CATGRY-GRP-C-CD   PIC X.             08630000
087500                08  AR97-LTR-CATGRY-GRP-D-CD   PIC X.             08640000
087600                08  AR97-LTR-CATGRY-GRP-E-CD   PIC X.             08650000
087700                08  AR97-LTR-CATGRY-GRP-F-CD   PIC X.             08660000
087800                08  AR97-LTR-CATGRY-GRP-G-CD   PIC X.             08670000
087900                08  AR97-LTR-CATGRY-GRP-H-CD   PIC X.             08680000
088000                08  AR97-LTR-CATGRY-GRP-I-CD   PIC X.             08690000
088100                08  AR97-LTR-CATGRY-GRP-J-CD   PIC X.             08700000
088200                08  AR97-LTR-CATGRY-GRP-K-CD   PIC X.             08710000
088300                08  AR97-LTR-CATGRY-GRP-L-CD   PIC X.             08720000
088400                08  AR97-LTR-CATGRY-GRP-M-CD   PIC X.             08730000
088500                08  AR97-LTR-CATGRY-GRP-N-CD   PIC X.             08740000
088600                08  AR97-LTR-CATGRY-GRP-O-CD   PIC X.             08750000
088700                08  AR97-LTR-CATGRY-GRP-P-CD   PIC X.             08760000
088800                08  AR97-LTR-CATGRY-GRP-Q-CD   PIC X.             08770000
088900                08  AR97-LTR-CATGRY-GRP-T-CD   PIC X.             08780000
089000                08  AR97-LTR-CATGRY-GRP-U-CD   PIC X.             08790000
089100                08  AR97-LTR-CATGRY-GRP-V-CD   PIC X.             08800000
089200                08  AR97-LTR-CATGRY-GRP-Z-CD   PIC X.             08810000
089300            07  AR97-ANNL-FEE-WAVR-AM       PIC X(15).            08820000
089400            07  AR97-ANNL-FEE-WAVR-DT          PIC X(10).         08830000
089500            07  AR97-ANNL-FEE-WAVR-CD          PIC X(2).          08840000
089600            07  AR97-LAST-ANNL-FEE-WAVR-CD     PIC X(2).          08850000
089700            07  AR97-TLR-CLT-ID                PIC X(8).          08860000
089800            07  AR97-TLR-CLT-EXPR-DT           PIC X(10).         08870000
089900            07  AR97-PREV-CLT-TLR-ID           PIC X(8).          08880000
090000            07  AR97-CLT-TLR-CHG-DT            PIC X(10).         08890000
090100            07  AR97-TMPR-CRDT-LINE-STRT-DT    PIC X(10).         08900000
090200            07  AR97-TMPR-CRDT-LINE-END-DT     PIC X(10).         08910000
090300            07  AR97-TMPR-CRDT-LINE-AM        PIC X(18).          08920000
090400            07  AR97-TMPR-CRDT-LINE-CD         PIC XXX.           08930000
090500            07  AR97-PDAY-INTR-IN-SSPN-AM   PIC X(19).            08940000
090600            07  AR97-PDAY-INTR-BEFR-SSPN-AM PIC X(19).            08950000
090700            07  AR97-CTD-CASH-MEMO-AM       PIC X(19).            08960000
090800            07  AR97-CNTL-ACCT-EXTR-STAT-CD    PIC X.             08970000
090900            07  AR97-FLEX-BLLN-CD              PIC X.             08980000
091000            07  AR97-PRFT-SCR1-CD              PIC X(3).          08990000
091100            07  AR97-PRFT-SCR2-CD              PIC X(3).          09000000
091200            07  AR97-PRFT-SCR3-CD              PIC X(3).          09010000
091300            07  AR97-PRFT-SCR4-CD              PIC X(3).          09020000
091400            07  AR97-TRNS-PYMT-DUE-CT          PIC X(4).          09030000
091500            07  AR97-TRNS-PYFF-EXCP-CT         PIC X(4).          09040000
091600            07  AR97-LAST-TRNS-PYFF-EXCP-CT    PIC X(4).          09050000
091700            07  AR97-PREV-TRNS-PYFF-EXCP-CT    PIC X(4).          09060000
091800            07  AR97-LAST-TRNS-PYMT-DUE-CT     PIC X(4).          09070000
091900            07  AR97-PREV-TRNS-PYMT-DUE-CT     PIC X(4).          09080000
092000            07  AR97-OTST-AUTH-BAL-AM       PIC X(19).            09090000
092100            07  AR97-SKIP-PMNT-PRTF-ID         PIC X(6).          09100000
092200            07  AR97-SKIP-PMNT-OVRD-PRTF-ID    PIC X(6).          09110000
092300            07  AR97-SKIP-PMNT-OVRD-PRTF-DT    PIC X(10).         09120000
092400            07  AR97-SKIP-PMNT-OFFR-NR         PIC X(4).          09130000
092500            07  AR97-SKIP-PMNT-ACCP-NR         PIC X(4).          09140000
092600            07  AR97-EPMT-PART-IND-ID          PIC X.             09150000
092700            07  AR97-EPMT-UNIQ-ID              PIC 9(10).         09160000
092800            07  AR97-EPMT-STRT-DT              PIC X(10).         09170000
092900            07  AR97-EPMT-END-DT               PIC X(10).         09180000
093000            07  AR97-PORTFOLIO-NO              PIC X(6).          09190000
093100            07  AR97-ALL-TRANSFER-FLAG         PIC X.             09200000
093200            07  AR97-CTD-PRTN-PRCH-AM       PIC X(19).            09210000
093300            07  AR97-MON-RJCT-CD               PIC X.             09220000
093400            07  AR97-NON-AUTH-ACTV-ACCT-CD     PIC X.             09230000
093500            07  AR97-ACCT-CURED-CD             PIC X.             09240000
093600            07  AR97-DPST-CRDT-LINE-CHG-DT     PIC X(8).          09250000
093700            07  AR97-RVRS-ANNL-FEE-CD          PIC X.             09260000
093800            07  AR97-RVRS-ANNL-FEE-DT          PIC X(10).         09270000
093900            07  AR97-REIM-BACK-DATE-CD         PIC 9.             09280000
094000            07  AR97-STMT-LATE-DAYS-NR         PIC 99.            09290000
094100            07  AR97-ACS-AUTH-OVRR-STRT-ID     PIC X(2).          09300000
094200            07  AR97-ACS-AUTH-OVRR-STRT-DT     PIC X(10).         09310000
094300            07  AR97-REIS-MSSG-ID              PIC 9(3).          09320000
094400            07  AR97-WRBL-MSSG-ID              PIC 9(3).          09330000
094500            07  AR97-AVLB-FUND-MSSG-ID         PIC 9(3).          09340000
094600            07  AR97-SSPN-CYCL-CD              PIC 99.            09350000
094700            07  AR97-TLF-TABL-ID               PIC X(8).          09360000
094800            07  AR97-TLP-TQ-TABL-ID            PIC X(8).          09370000
094900            07  AR97-PYMN-DUE-DT               PIC X(10).         09380000
095000            07  AR97-NEWCRD-FLAG-RETN-DT       PIC X(10).         09390000
095100            07  AR97-NEXT-CYCL-DT              PIC X(10).         09400000
095200            07  AR97-LAST-MON-TRAN-CD          PIC X(4).          09410000
095300            07  AR97-LAST-EMBS-ADDR-CHNG-DT    PIC X(10).         09420000
095400            07  AR97-DBT-RTFC-NTFC-MNTH-CT     PIC X(2).          09430000
095500            07  AR97-DBT-RTFC-GRAC-MNTH-CT     PIC X(2).          09440000
095600            07  AR97-DBT-RTFC-LAST-NTFC-DT     PIC X(10).         09450000
095700            07  AR97-OVRL-NMN-ENTR-TYPE-ID     PIC X.             09460000
095800            07  AR97-PRCN-FLDS.                                   09470000
095900                08 AR97-PRCN-STRT-CT           PIC X(4).          09480000
096000                08 AR97-PRCN-STRT-RSET-IN      PIC X.             09490000
096100            07  AR97-NMN-ENTR-ID               PIC X.             09500000
096200            07  AR97-DALY-INTR-CALC-MTHD-CD    PIC 9.             09510000
096300            07  AR97-CC-FLET-RSTR-CD           PIC X.             09520000
096400            07  AR97-CC-FLET-PRMP-CD           PIC X.             09530000
096500            07  AR97-CR-LIFE-STATUS-DT         PIC X(10).         09540000
096600            07  AR97-SCOR-FLDS-TWO.                               09550000
096700                08  AR97-SCOR-ONE-RESN-FOUR-NR PIC X(8).          09560000
096800                08  AR97-SCOR-TWO-RESN-FOUR-NR PIC X(8).          09570000
096900                08  AR97-SCOR-THRE-RESN-ONE-NR PIC X(8).          09580000
097000                08  AR97-SCOR-THRE-RESN-TWO-NR PIC X(8).          09590000
097100                08  AR97-SCOR-THRE-RESN-THRE-NR                   09600000
097200                                                PIC X(8).         09610000
097300                08  AR97-SCOR-THRE-RESN-FOUR-NR                   09620000
097400                                                PIC X(8).         09630000
097500                08  AR97-SCOR-FOUR-RESN-ONE-NR PIC X(8).          09640000
097600                08  AR97-SCOR-FOUR-RESN-TWO-NR PIC X(8).          09650000
097700                08  AR97-SCOR-FOUR-RESN-THRE-NR                   09660000
097800                                                PIC X(8).         09670000
097900                08  AR97-SCOR-FOUR-RESN-FOUR-NR                   09680000
098000                                                PIC X(8).         09690000
098100                08  AR97-SCOR-FIVE-RESN-ONE-NR PIC X(8).          09700000
098200                08  AR97-SCOR-FIVE-RESN-TWO-NR PIC X(8).          09710000
098300                08  AR97-SCOR-FIVE-RESN-THRE-NR                   09720000
098400                                                PIC X(8).         09730000
098500                08  AR97-SCOR-FIVE-RESN-FOUR-NR                   09740000
098600                                                PIC X(8).         09750000
098700                08  AR97-SCOR-SIX-RESN-FOUR-NR PIC X(8).          09760000
098800                08  AR97-SCOR-SEVN-RESN-FOUR-NR                   09770000
098900                                                PIC X(8).         09780000
099000                08  AR97-SCOR-EGHT-RESN-ONE-NR PIC X(8).          09790000
099100                08  AR97-SCOR-EGHT-RESN-TWO-NR PIC X(8).          09800000
099200                08  AR97-SCOR-EGHT-RESN-THRE-NR                   09810000
099300                                                PIC X(8).         09820000
099400                08  AR97-SCOR-EGHT-RESN-FOUR-NR                   09830000
099500                                                PIC X(8).         09840000
099600                08  AR97-SCOR-NINE-RESN-ONE-NR PIC X(8).          09850000
099700                08  AR97-SCOR-NINE-RESN-TWO-NR PIC X(8).          09860000
099800                08  AR97-SCOR-NINE-RESN-THRE-NR                   09870000
099900                                                PIC X(8).         09880000
100000                08  AR97-SCOR-NINE-RESN-FOUR-NR                   09890000
100100                                                PIC X(8).         09900000
100200                08  AR97-SCOR-TEN-RESN-ONE-NR  PIC X(8).          09910000
100300                08  AR97-SCOR-TEN-RESN-TWO-NR  PIC X(8).          09920000
100400                08  AR97-SCOR-TEN-RESN-THRE-NR PIC X(8).          09930000
100500                08  AR97-SCOR-TEN-RESN-FOUR-NR PIC X(8).          09940000
100600            07  AR97-SCOR-FLDS-TWO-R REDEFINES AR97-SCOR-FLDS-TWO.09950000
100700                08  AR97-SCOR-1TO10            PIC X(8)           09960000
100800                    OCCURS 28 TIMES.                              09970000
100900            07  AR97-LAST-LTTR-ID              PIC X(4).          09980000
101000            07  AR97-LAST-LTTR-DT              PIC X(10).         09990000
101100            07  AR97-CRRS-ADDR-CD              PIC X(3).          10000000
101200            07  AR97-MLP-CD                    PIC X.             10010000
101300            07  AR97-AVLB-CRDT-AMT             PIC X(19).         10020000
101400            07  AR97-EBP-STOP-PAPR-DT          PIC X(10).         10030000
101500            07  AR97-GRCE-NGRC-OVRD-CD         PIC X(1).          10040000
101600            07  FILLER         OCCURS 6 TIMES.                    10050000
101700                08  AR97-CRDT-PRTC-PRMM-DT     PIC X(8).          10060000
101800            07  AR97-ACS-AVLB-FUND-PRTF-ID     PIC X(4).          10070000
101900            07  AR97-ACS-AVLB-FUND-CAT-DT      PIC X(10).         10080000
102000            07  AR97-MLTP-LIKE-UNIQ-CD         PIC X.             10090000
102100            07  AR97-MLTP-UNIQ-OVRR-CD         PIC X.             10100000
102200            07  AR97-SSR-IN                    PIC X.             10110000
102300            07  AR97-CRBR-LAST-RPRT-ID         PIC X(19).         10120000
102400            07  AR97-LOST-STLN-PI-CT           PIC X(4).          10130000
102500            07  AR97-NORM-RATES.                                  10140000
102600                 08  AR97-CALC-NORM-CASH-RT    PIC X(9).          10150000
102700                 08  AR97-CALC-NORM-MRCH-RT    PIC X(9).          10160000
102800                 08  AR97-CALC-NORM-CASH-MNTH-RT                  10170000
102900                                                PIC X(7).         10180000
103000                 08  AR97-CALC-NORM-MRCH-MNTH-RT                  10190000
103100                                               PIC X(7).          10200000
103200                 08  AR97-CALC-NORM-CASH-ANN-RT                   10210000
103300                                               PIC X(7).          10220000
103400                 08  AR97-CALC-NORM-MRCH-ANN-RT                   10230000
103500                                               PIC X(7).          10240000
103600            07  AR97-PAYMENT-DUE-DAYS-NR       PIC X(4).          10250000
103700            07  AR97-HRSK-PRMN-CLLC-ID         PIC X(4).          10260000
103800            07  AR97-LAST-TRMS-CHNG-NTFC-DT    PIC X(10).         10270000
103900            07  AR97-PREV-TRMS-CHNG-NTFC-DT    PIC X(10).         10280000
104000            07  AR97-PRMT-PRCN-VOID-IN         PIC X(01).         10290000
104100            07  AR97-GRND-FTHR-WAVR-CD         PIC X.             10300000
104200            07  AR97-CRRN-ARBT.                                   10310000
104300                08  AR97-CRRN-ARBT-CD          PIC X(2).          10320000
104400                08  AR97-CRRN-ARBT-NTFC-DT     PIC X(10).         10330000
104500                08  AR97-CRRN-ARBT-EFFC-DT     PIC X(10).         10340000
104600            07  AR97-PREV-ARBT.                                   10350000
104700                08  AR97-PREV-ARBT-CD          PIC X(2).          10360000
104800                08  AR97-PREV-ARBT-NTFC-DT     PIC X(10).         10370000
104900                08  AR97-PREV-ARBT-EFFC-DT     PIC X(10).         10380000
105000            07  AR97-MISC-FIELD-13-TX.                            10390000
105100                08  AR97-MISC-13-PSTN-1-10-TX  PIC X(10).         10400000
105200                08  AR97-MISC-13-PSTN-11-15-TX PIC X(5).          10410000
105300                08  AR97-MISC-13-PSTN-16-20-TX PIC X(5).          10420000
105400                08  AR97-MISC-13-PSTN-21-25-TX PIC X(5).          10430000
105500                08  AR97-MISC-13-PSTN-26-TX    PIC X(1).          10440000
105600                08  AR97-MISC-13-PSTN-27-TX    PIC X(1).          10450000
105700                08  AR97-MISC-13-PSTN-28-TX    PIC X(1).          10460000
105800                08  AR97-MISC-13-PSTN-29-TX    PIC X(1).          10470000
105900                08  AR97-MISC-13-PSTN-30-TX    PIC X(1).          10480000
106000                08  AR97-MISC-13-PSTN-31-TX    PIC X(1).          10490000
106100                08  AR97-MISC-13-PSTN-32-TX    PIC X(1).          10500000
106200                08  AR97-MISC-13-PSTN-33-TX    PIC X(1).          10510000
106300                08  AR97-MISC-13-PSTN-34-TX    PIC X(1).          10520000
106400                08  AR97-MISC-13-PSTN-35-TX    PIC X(1).          10530000
106500                08  AR97-MISC-13-PSTN-36-TX    PIC X(1).          10540000
106600                08  AR97-MISC-13-PSTN-37-TX    PIC X(1).          10550000
106700                08  AR97-MISC-13-PSTN-38-TX    PIC X(1).          10560000
106800                08  AR97-MISC-13-PSTN-39-TX    PIC X(1).          10570000
106900                08  AR97-MISC-13-PSTN-40-TX    PIC X(1).          10580000
107000                08  AR97-MISC-13-PSTN-41-TX    PIC X(1).          10590000
107100                08  AR97-MISC-13-PSTN-42-TX    PIC X(1).          10600000
107200                08  AR97-MISC-13-PSTN-43-TX    PIC X(1).          10610000
107300                08  AR97-MISC-13-PSTN-44-TX    PIC X(1).          10620000
107400                08  AR97-MISC-13-PSTN-45-TX    PIC X(1).          10630000
107500                08  AR97-MISC-13-PSTN-46-TX    PIC X(1).          10640000
107600                08  AR97-MISC-13-PSTN-47-TX    PIC X(1).          10650000
107700                08  AR97-MISC-13-PSTN-48-TX    PIC X(1).          10660000
107800                08  AR97-MISC-13-PSTN-49-TX    PIC X(1).          10670000
107900                08  AR97-MISC-13-PSTN-50-TX    PIC X(1).          10680000
108000            07  AR97-RULE-COLLECTION-DATA.                        10690000
108100                08    AR97-RULE-DIALER-ID      PIC X(6).          10700000
108200                08    FILLER REDEFINES AR97-RULE-DIALER-ID.       10710000
108300                      09    AR97-DIALER-SITE-ID                   10720000
108400                                                PIC X.            10730000
108500                      09    FILLER              PIC X(5).         10740000
108600                08  AR97-RULE-NEXT-DAY-1-CT    PIC X(6).          10750000
108700                08  AR97-RULE-NEXT-DAY-2-CT    PIC X(6).          10760000
108800            07  AR97-FUND-DMM-OVRD-ID          PIC X(08).         10770000
108900            07  AR97-PRCN-ST-OF-ORGN-CD        PIC X(2).          10780000
109000            07  AR97-MECH-PULL-PRCS-RESN-CD    PIC X(4).          10790000
109100            07  AR97-LAST-PRCN-PRTF-CD         PIC  9(4).         10800000
109200            07  AR97-LAST-PRCN-PRTF-CHNG-DT    PIC X(10).         10810000
109300            07  AR97-HOLD-CYCL-CD.                                10820000
109400                08  AR97-HOLD-CYCL-CD-99       PIC 99.            10830000
109500            07  AR97-FEE-MDSE-INTR-BRNG-AM                        10840000
109600                                            PIC X(19).            10850000
109700            07  AR97-FEE-CASH-INTR-BRNG-AM                        10860000
109800                                            PIC X(19).            10870000
109900            07  AR97-POB-CMPND-CD              PIC X(2).          10880000
110000            07  AR97-SCRX-AUTH-OVRR-CRDT-CD    PIC X.             10890000
110100            07  AR97-SCRX-AUTH-OVRR-FRD-CD     PIC X.             10900000
110200            07  AR97-SCRX-AUTH-OVRR-BHVR-CD    PIC X.             10910000
110300            07  AR97-SCRX-AUTH-OVRR-RISK-CD    PIC X.             10920000
110400            07  AR97-SCRX-AUTH-OVRR-INCR-CD    PIC X.             10930000
110500            07  AR97-SCRX-AUTH-OVRR-DECR-CD    PIC X.             10940000
110600            07  AR97-SCRX-AUTH-OVRR-OVLM-CD    PIC X.             10950000
110700            07  AR97-SCRX-AUTH-OVRR-CRDT-DT    PIC X(10).         10960000
110800            07  AR97-SCRX-AUTH-OVRR-FRD-DT     PIC X(10).         10970000
110900            07  AR97-SCRX-AUTH-OVRR-BHVR-DT    PIC X(10).         10980000
111000            07  AR97-SCRX-AUTH-OVRR-RISK-DT    PIC X(10).         10990000
111100            07  AR97-SCRX-AUTH-OVRR-INCR-DT    PIC X(10).         11000000
111200            07  AR97-SCRX-AUTH-OVRR-DECR-DT    PIC X(10).         11010000
111300            07  AR97-SCRX-AUTH-OVRR-OVLM-DT    PIC X(10).         11020000
111400            07  AR97-BHVR-SCOR-DT              PIC X(10).         11030000
111500            07  AR97-CRDT-BUR-ALRT-CD          PIC X.             11040000
111600            07  AR97-DBT-ACTV-ID               PIC X.             11050000
111700            07  AR97-RULS-RESS-PRTF-ID         PIC 9(4).          11060000
111800            07  AR97-RULS-RESS-OVRR-PRTF-ID    PIC 9(4).          11070000
111900            07  AR97-RULS-RESS-OVRR-PRTF-DT    PIC X(10).         11080000
112000            07  AR97-LATE-FEE-TIRD-BAL-AM  PIC X(19).             11090000
112100            07  AR97-ALTR-STMT-FRMT-CD         PIC X(01).         11100000
112200            07  AR97-PRMR-ACCT-CD              PIC X(01).         11110000
112300            07  AR97-PRMR-ACCT-CHNG-DT         PIC X(10).         11120000
112400            07  AR97-DLNQ-STRT-OVRR-DT         PIC X(10).         11130000
112500            07  FILLER  OCCURS 6 TIMES.                           11140000
112600                08  AR97-CLI-FREE-DAYS-RMNN-CT PIC X(4).          11150000
112700            07  AR97-PRJC-CARD-SQNC-NR         PIC X(4).          11160000
112800            07  AR97-DFLT-BAL-ADMN-GRP.                           11170000
112900                10  AR97-DFLT-PLAN-ID          PIC X(8).          11180000
113000                10  AR97-PLAN-LOCK-BEGN-DT     PIC X(10).         11190000
113100                10  AR97-PLAN-LOCK-END-DT      PIC X(10).         11200000
113200            07  AR97-CNSM-ACCT-CLSD-DT         PIC X(10).         11210000
113300            07  AR97-CRDT-LINE-CHNG-DT         PIC X(10).         11220000
113400            07  AR97-PREV-CRDT-LINE-CHNG-DT    PIC X(10).         11230000
113500            07  AR97-CRDT-BUR-BKCY-DT          PIC X(10).         11240000
113600            07  AR97-QUAL-FUTR-LATE-FEE-CD     PIC X.             11250000
113700            07  AR97-PREV-STTS-RESN-CD         PIC 99.            11260000
113800            07  AR97-NO-MMB-LEVL-CT            PIC X(10).         11270000
113900            07  AR97-STRT-REVW-IN              PIC X.             11280000
114000            07  AR97-CYCL-PRCN-STRT-ID         PIC X(8).          11290000
114100            07  AR97-CYCL-PRCN-PORT-ID         PIC 9(4).          11300000
114200            07  AR97-PORT-REVW-IN              PIC X.             11310000
114300            07  AR97-PRCN-REPOST-IN            PIC X.             11320000
114400            07  AR97-PRMT-ITRO-RATE.                              11330000
114500                10 AR97-PRMT-MRCH-ANNL-ITRO-RT                    11340000
114600                                               PIC X(7).          11350000
114700                10 AR97-PRMT-CASH-ANNL-ITRO-RT                    11360000
114800                                               PIC X(7).          11370000
114900            07  AR97-PRMT-RGLR-RATE.                              11380000
115000                10 AR97-PRMT-MRCH-ANNL-RGLR-RT                    11390000
115100                                               PIC X(7).          11400000
115200                10 AR97-PRMT-CASH-ANNL-RGLR-RT                    11410000
115300                                               PIC X(7).          11420000
115400            07  AR97-PLAN-RATE.                                   11430000
115500                10 AR97-PLAN-MRCH-ANNL-RGLR-RT                    11440000
115600                                               PIC X(7).          11450000
115700                10 AR97-PLAN-CASH-ANNL-RGLR-RT                    11460000
115800                                               PIC X(7).          11470000
115900            07  AR97HD-1098-YTD-INTR-THRD-AM                      11480000
116000                                            PIC X(19).            11490000
116100            07  AR97HD-1098-YTD-INTR-TOTL-AM                      11500000
116200                                            PIC X(19).            11510000
116300            07  AR97HD-1098-PREV-INTR-THRD-AM                     11520000
116400                                            PIC X(19).            11530000
116500            07  AR97HD-1098-PREV-INTR-TOTL-AM                     11540000
116600                                            PIC X(19).            11550000
116700            07  AR97-CLLT-RELS-IN          PIC X.                 11560000
116800            07  AR97-CMBN-LTV-RT           PIC X(4).              11570000
116900            07  AR97-DRAW-PERD-END-DT      PIC X(10).             11580000
117000            07  AR97-CLSN-CSTS-AM          PIC X(15).             11590000
117100            07  AR97-AVOD-FINC-CHRG-AM     PIC X(19).             11600000
117200            07  AR97-ASSC-PRDT-TYPE-CD     PIC X(3).              11610000
117300            07  AR97-HOME-EQTY-CHNG-DT     PIC X(10).             11620000
117400            07  AR97-DCLN-AVLB-CRDT-OPTN-CD                       11630000
117500                                            PIC X(1).             11640000
117600            07  AR97-CLSN-CSTS-BLLD-DT     PIC X(10).             11650000
117700            07  AR97-ERLY-TRMN-FEE-IN      PIC X(1).              11660000
117800            07  AR97-LFTM-CASH-AND-MRCH-AM PIC X(19).             11670000
117900            07  AR97-FLIP-TRAN-SSPN-ST-CD  PIC X(1).              11680000
118000            07  AR97-TNSLT-XFER-CD         PIC X(1).              11690000
118100            07  FILLER  OCCURS 6 TIMES.                           11700000
118200                08  AR97-CLI-CNCL-DT       PIC X(8).              11710000
118300                08  AR97-CLI-CNCL-RESN-CD  PIC X.                 11720000
118400                08  AR97-CLI-RNST-DT       PIC X(8).              11730000
118500                08  AR97-CLI-RFND-CD       PIC X.                 11740000
118600                08  AR97LS-CLI-STTS-CD     PIC X.                 11750000
118700                08  AR97PS-CLI-STTS-CD     PIC X.                 11760000
118800            07  AR97-07-DAY-PYMT-CT        PIC 99.                11770000
118900            07  AR97-15-DAY-PYMT-CT        PIC 99.                11780000
119000            07  AR97-CRD-BUR-DROP-IN       PIC X.                 11790000
119100            07  AR97-CRD-BUR-DROP-AM       PIC X(19).             11800000
119200            07  AR97-CRD-BUR-DROP-DT       PIC X(10).             11810000
119300            07  AR97BPS-RULS-DATA-1-AM     PIC X(17).             11820000
119400            07  AR97BPS-RULS-DATA-2-AM     PIC X(17).             11830000
119500            07  AR97BPS-RULS-DATA-3-AM     PIC X(17).             11840000
119600            07  AR97BPS-RULS-DATA-4-AM     PIC X(17).             11850000
119700            07  AR97BPS-1-RULS-DATA-1-AM   PIC X(17).             11860000
119800            07  AR97BPS-1-RULS-DATA-2-AM   PIC X(17).             11870000
119900            07  AR97BPS-1-RULS-DATA-3-AM   PIC X(17).             11880000
120000            07  AR97BPS-1-RULS-DATA-4-AM   PIC X(17).             11890000
120100            07  AR97-RULS-DATA-1-CD        PIC X.                 11900000
120200            07  AR97-ATPY-ENRL-TYPE-CD     PIC X.                 11910000
120300            07  AR97-1STY-MXFE-ALLW-AM     PIC X(19).             11920000
120400            07  AR97-RECOVERY-CD           PIC 9(2).              11930000
120500                                                                  11940000
120600        06  AR97-CUSTOMER-DATA-SEGMENT OCCURS 1 TIMES.            11950000
120700***                       OCCURS 0 TO 1 TIMES                     11960000
120800***                        DEPENDING ON AR97-NO-CUSTOMER-SEGS.    11970000
120900           07  AR97-NAME-ADDR-SEGMENT.                            11980000
121000                08  AR97-PRINCIPAL-DATA-NMDSREC.                  11990000
121100                    09  AR97-PRINCIPAL-NAME.                      12000000
121200                        10  AR97-SHORT-NAME.                      12010000
121300                            11  AR97-NAME-CHAR-1 PIC X.           12020000
121400                            11  FILLER          PIC X(9).         12030000
121500                        10  FILLER              PIC X(16).        12040000
121600                    09  AR97-SPOUSE-NAME       PIC X(26).         12050000
121700                    09  AR97-ADDR-LINE-1       PIC X(26).         12060000
121800                    09  AR97-ADDR-LINE-2       PIC X(26).         12070000
121900                    09  AR97-CITY-STATE-LINE.                     12080000
122000                        10  AR97-CITY          PIC X(18).         12090000
122100*                       10  FILLER              PIC X.            12100000
122100                        10  FILLER1             PIC X.            12110000
122200                        10  AR97-STATE         PIC X(2).          12120000
122300                08  AR97-ZIP-CODE-ALPHA.                          12130000
122400                    09  AR97-ZIP-CODE          PIC X(10).         12140000
122500                08  AR97-NUMERIC-STATE         PIC X(4).          12150000
122600                08  AR97-DELIVERY-POINT        PIC X(2).          12160000
122700            07  AR97-PRIMARY-DATA.                                12170000
122800                08  AR97-PD-PREFIX             PIC X(4).          12180000
122900                08  AR97-PD-SUFFIX             PIC X(4).          12190000
123000                08  AR97-PD-ADDRESS-DATA.                         12200000
123100                    09  AR97-PD-ADDRESS-FORMAT PIC X(2).          12210000
123200                    09  AR97-PRIM-DATA-NMDSREC.                   12220000
123300                        10  AR97-PD-ADDR-LINE-3 PIC X(26).        12230000
123400                        10  AR97-PD-COUNTY     PIC X(18).         12240000
123500            07  AR97-PD-POSTCODE.                                 12250000
123600                08  AR97-PD-POST-FIRST-5-A.                       12260000
123700                    09  AR97-PD-FIRST-5 PIC 9(5).                 12270000
123800                08  AR97-PD-POST-LAST-5.                          12280000
123900                    09  AR97-PD-DASH           PIC X.             12290000
124000                    09  AR97-PD-POST-LAST-4-A.                    12300000
124100                        10  AR97-PD-POST-LAST-4 PIC 9(4).         12310000
124200            07  AR97-SECONDARY-DATA.                              12320000
124300                08  AR97-SD-PREFIX             PIC X(4).          12330000
124400                08  AR97-SD-SUFFIX             PIC X(4).          12340000
124500            07  AR97-EXTRA-PRSNAL-DATA.                           12350000
124600                08  AR97-EP-DATA-NMDSREC.                         12360000
124700                    09  AR97-SEX-CODE          PIC X.             12370000
124800                    09  AR97-SOC-SECURITY-NO   PIC X(10).         12380000
124900                    09  AR97-TELEPHONE-NUMBER                     12390000
125000                                               PIC X(12).         12400000
125100                    09  AR97-SECOND-TELEPHONE-NUMBER              12410000
125200                                                PIC X(12).        12420000
125300                    09  AR97-HOME-PHONE-FORMAT PIC X(5).          12430000
125400                    09  AR97-BUS-PHONE-FORMAT  PIC X(5).          12440000
125500                    09  AR97-MOTHERS-MAIDEN-NAME PIC X(8).        12450000
125600                    09  AR97-SECONDARY-SOC-SEC-NO                 12460000
125700                                                PIC X(10).        12470000
125800                    09  AR97-DATE-LAST-ADDR-CHANGE                12480000
125900                                                PIC X(8).         12490000
126000                    09  AR97-NAME-ADDR-CHG     PIC X(2).          12500000
126100            07  AR97-ADDRESS-FLAG              PIC X.             12510000
126200            07  AR97-HOME-PHONE-FLAG           PIC X.             12520000
126300            07  AR97-BUSINESS-PHONE-FLAG       PIC X.             12530000
126400            07  AR97-DECEASED-FLAG             PIC X.             12540000
126500            07  AR97-SOLICITATION-FLAG         PIC X.             12550000
126600            07  AR97-EMPL-ACCT-CD              PIC X.             12560000
126700            07  AR97-ALT-CUSTOMER-NO           PIC X(23).         12570000
126800            07  AR97-DATE-OF-BIRTH             PIC X(10).         12580000
126900            07  AR97-SECONDARY-DATE-OF-BIRTH   PIC X(10).         12590000
127000            07  AR97-FIXD-MPD-USAG-CD          PIC X(2).          12600000
127100            07  AR97-MPW-APR-OVRR-USAG-CD      PIC X(2).          12610000
127200            07  AR97-MPW-APR-OVRR-USAG-DT      PIC X(10).         12620000
127300            07  AR97-FIX-PAY-GRP               OCCURS 4 TIMES.    12630000
127400                08  AR97-FIXD-MPD-OVRR-AM                         12640000
127500                                             PIC X(19).           12650000
127600                08  AR97-FIXD-MPD-OVRR-DT                         12660000
127700                                             PIC X(10).           12670000
127800            07  FILLER                       PIC X(41).           12680000
12065         06  AR97-PAYMENT-HISTORY.                                 12690000
12065             07  AR97-PH-1-11.                                     12700000
12065                 08  AR97-PH-LAST-STMT      PIC X.                 12710000
12065                 08  AR97-PH-PREV-STMT-CD PIC X.                   12720000
12065                 08  AR97-PH-BPS1-CD        PIC X.                 12730000
12065                 08  AR97-PH-BPS2-CD        PIC X.                 12740000
12065                 08  AR97-PH-BPS3-CD        PIC X.                 12750000
12065                 08  AR97-PH-BPS4-CD        PIC X.                 12760000
12065                 08  AR97-PH-BPS5-CD        PIC X.                 12770000
12065                 08  AR97-PH-BPS6-CD        PIC X.                 12780000
12065                 08  AR97-PH-BPS7-CD        PIC X.                 12790000
12065                 08  AR97-PH-BPS8-CD        PIC X.                 12800000
12065                 08  AR97-PH-BPS9-CD        PIC X.                 12810000
12065             07  FILLER                     PIC X.                 12820000
12065         06  FILLER    REDEFINES AR97-PAYMENT-HISTORY.             12830000
12065             07  AR97-PH-1-12    PIC X     OCCURS 12 TIMES.        12840000
12065         06  AR97-PAY-HIST-13-24.                                  12850000
12065             07  AR97-PH-13-23              PIC X(11).             12860000
12065             07  FILLER                     PIC X.                 12870000
12065         06  FILLER    REDEFINES AR97-PAY-HIST-13-24.              12880000
12065             07  AR97-PH-13-24   PIC X     OCCURS 12 TIMES.        12890000
