      *      03/18/2012     ARRD089                                *    00010000
      **************************************************************    00020000
      *                     COPYBOOK: ARRD089                      *    00030000
      *                   DOWNLOADED: 02/18/2012                   *    00040000
      *                 RELEASE VERSION INFORMATION                *    00050000
      ******************************************************************00060000
C86513******************************************************************00061022
C86513* 17/07/2014  COGNIZANT   CHG0086513                              00062023
C86513*  - ADDED NEW FIELDS IN THE CARD MASTER FILE AS PART OF THE      00063022
C86513*    FD JULY MAJOR RELEASE                                        00064022
C86513******************************************************************00065022
       01  AR089-CRF-RECORD.                                            00070000
           02  AR089-RECORD-ID                     PIC X(02).           00090000
           02  AR089-CLIENT-ID                     PIC X(04).           00100000
           02  AR089-FULL-ACCT-ID.                                      00110000
              03 AR089-ACCT-SYS-NO                 PIC X(04).           00120000
              03 AR089-ACCT-PRIN                   PIC X(04).           00130000
              03 AR089-ACCT-AGENT                  PIC X(04).           00140000
              03 AR089-ACCT-NO                     PIC X(16).           00150000
              03 FILLER                            PIC X(09).           00160000
           02  AR089-ACCT-SQNC-ID                  PIC X(08).           00170000
           02  AR089-SUB-ACCT-ID                   PIC X(25).           00180000
           02  AR089-CYCLE-CODE                    PIC X(02).           00190000
      *        RUN DATE IS IN THE CCYYMMDD                              00200000
           02  AR089-RUN-DATE                      PIC X(08).           00210000
      *        RUN TIME IS IN THE HHMM                                  00220000
           02  AR089-RUN-TIME                      PIC X(04).           00230000
      *       DATE IS IN THE CCYYMMDD                                   00240000
           02  AR089-ACCT-CYCLE-DTE                PIC X(08).           00250000
           02  AR089-PRINT-FORM-CDE                PIC X(08).           00260000
           02  AR089-PHYS-FORM-CDE                 PIC X(08).           00270000
           02  AR089-FIRST-CHK-NO                  PIC 9(05).           00280000
           02  AR089-CHK-ISSU-CNT                  PIC 9(03).           00290000
           02  AR089-PRNT-FLAG-CDE                 PIC 9(02).           00300000
           02  AR089-PRNT-HOLD-CDE                 PIC X(01).           00310000
           02  AR089-STMT-TYPE-CDE                 PIC X(02).           00320000
           02  AR089-LGCL-PAGE-CNT                 PIC 9(08).           00330000
           02  AR089-PHYS-PAGE-CNT                 PIC 9(08).           00340000
           02  AR089-CHK-ACCT-NUM                  PIC X(17).           00350000
           02  AR089-CHK-PAYEE-NAME                PIC X(50).           00360000
           02  AR089-COUPON-ISS-CNT                PIC 9(03).           00370000
           02  AR089-STMT-INSRT-CNT                PIC 9(03).           00380000
           02  AR089-INSRT-WGHT-CDE                PIC X(02).           00390000
           02  AR089-PRNT-DSCL-ID                  PIC X(02).           00400000
           02  AR089-STMT-FRMT-CDE                 PIC 9(03).           00410000
           02  AR089-STMT-ENVL-ID                  PIC X(08).           00420000
           02  AR089-RMIT-ENVL-ID                  PIC X(08).           00430000
C86513     02  AR089-ITEM-THICKNESS-NR             PIC X(05).           00440022
C86513     02  AR089-THCK-MGMT-CD                  PIC X(01).           00450022
C86513     02  FILLER                              PIC X(20).           00460022
           02  AR089-DQ-AREA-CDE                   PIC X(01).           00470000
           02  AR089-DQ-STMT-CATG-CT               PIC 9(03).           00480000
           02  AR089-MTHD-RSLT-CT                  PIC 9(03).           00490000
           02  AR089-DQ-CRIT-ID                    PIC X(30).           00500000
           02  AR089-RESULT-GROUP OCCURS 0 TO 200 TIMES                 00510000
                          DEPENDING ON AR089-MTHD-RSLT-CT.              00520000
              04  AR089-MTHD-TYPE-CDE              PIC 9(03).           00530000
              04  AR089-MTHD-NAME                  PIC X(08).           00540000
              04  AR089-MTHD-TEXT-ID               PIC X(08).           00550000
              04  AR089-MTHD-OPT-CDE               PIC X(01).           00560000
              04  AR089-MTHD-TYP-CDE               PIC X(01).           00570000
              04  AR089-MTHD-SENT-CDE              PIC X(01).           00580000
              04  AR089-MTHD-PCKT-NO               PIC 9(02).           00590000
              04  AR089-MTHD-OCCR-NO               PIC 9(03).           00600000
              04  AR089-MTHD-OCCR-SENT-NO          PIC 9(03).           00610000
      * THIS IS HERE AS A COMMENT.                                      00620000
      *01  AR089-HEADER-RECORD REDEFINES                                00630000
      *        AR089-OVRR-RECORD.                                       00640000
      *    05  AR089-HDR-ID                        PIC X(03).           00650000
      *      DATE IS IN THE CCYYMMDD                                    00660000
      *    05  AR089-HDR-TRANS-DTE                 PIC 9(08).           00670000
      *      TIME IS IN THE HHMMSS                                      00680000
      *    05  AR089-HDR-RUN-TIME                  PIC 9(06).           00690000
      *    05  FILLER                              PIC X(02).           00700000
      *      DATE IS IN THE CCYYMMDD                                    00710000
      *    05  AR089-HDR-CYC-DTE                   PIC 9(08).           00720000
      *    05  FILLER                              PIC X(01).           00730000
      *    05  AR089-HDR-TRANS-NO                  PIC X(08).           00740000
      *01  AR089-TRAILER-RECORD REDEFINES                               00750000
      *        AR089-OVRR-RECORD.                                       00760000
      *    05  AR089-TRLR-ID                        PIC X(02).          00770000
      *      DATE IS IN THE CCYYMMDD                                    00780000
      *    05  AR089-TRLR-RUN-DTE                  PIC 9(08).           00790000
      *      TIME IS IN THE HHMMSS                                      00800000
      *    05  AR089-TRLR-RUN-TIME                 PIC 9(06).           00810000
      *    05  FILLER                              PIC X(01).           00820000
      *      DATE IS IN THE CCYYMMDD                                    00830000
      *    05  AR089-TRLR-CYC-DTE                  PIC 9(08).           00840000
      *    05  FILLER                              PIC X(01).           00850000
      *    05  AR089-TRLR-TRANS-JOB-NM             PIC X(08).           00860000
      *    05  FILLER                              PIC X(01).           00870000
      *    05  AR089-TRLR-RECORD-ID OCCURS 6 TIMES.                     00880000
      *       10  AR089-TRLR-REC-ID                PIC X(02).           00890000
      *       10  AR089-TRLR-REC-CNT               PIC 9(09).           00900000
      *       10  FILLER                           PIC X(20).           00910000
                                                                        00920000
