00001 *                                                                 12/01/88
00002 *  THIS IS THE LAYOUT FOR THE EMPLOYEE VSAM FILE USED FOR         ARRD501I
00003 *  EMPLOYEE DISCOUNT CALCULATIONS.  THE RECORD LENGTH IS             LV001
00004 *  225 BYTES.                                                        CL**2
00005 *                                                                    CL*13
00006 *  NOTE:   ALL DATE FIELDS ARE IN MMDDYY FORMAT                      CL**2
00007 *                                                                    CL**2
00008  01  AR501I-EMPLOYEE-DISC-RECORD.                                    CL*14
00009      05  AR501I-EMPLOYEE-ACCOUNT-NUMBER                              CL**2
00010                                  PIC X(10)    VALUE SPACES.          CL**2
00011      05  FILLER                  REDEFINES                           CL**2
00012                                   AR501I-EMPLOYEE-ACCOUNT-NUMBER.    CL**2
00013          10  AR501I-ACCOUNT-NUMBER-1-3                               CL**2
00014                                  PIC 9(3).                           CL**2
00015          10  AR501I-ACCOUNT-NUMBER-4-6                               CL**2
00016                                  PIC 9(3).                           CL**2
00017          10  AR501I-ACCOUNT-NUMBER-7-9                               CL**2
00018                                  PIC 9(3).                           CL**2
00019          10  AR501I-ACCOUNT-NUMBER-10                                CL**2
00020                                  PIC 9(1).                           CL**2
00021      05  AR501I-EMPLOYEE-NAME    PIC X(30)    VALUE SPACES.          CL**2
00022      05  AR501I-CRS-EMPLOYEE-CODE                                    CL**2
00023                                  PIC X(1)     VALUE SPACES.          CL**2
00024          88  AR501I-DEPT-STORE-EMPLOYEE       VALUE '5'.             CL**2
00025          88  AR501I-DEPT-STORE-EXECUTIVE      VALUE '6'.             CL**2
00026          88  AR501I-DEPT-STORE-RETIREE        VALUE '7'.             CL**2
00027          88  AR501I-FOOD-STORE-EMPLOYEE       VALUE '8'.             CL**2
00028      05  AR501I-EMPLOYEE-DISC-STATUS                                 CL**2
00029                                  PIC X(1)     VALUE SPACES.          CL**2
00030          88  AR501I-ACTIVE-EMPLOYEE           VALUE 'A'.             CL**2
00031          88  AR501I-TERMINATED-EMPLOYEE       VALUE 'T'.             CL**2
00032      05  AR501I-STREET-ADDRESS   PIC X(25)    VALUE SPACES.          CL**2
00033      05  AR501I-CITY-NAME        PIC X(20)    VALUE SPACES.          CL**2
00034      05  AR501I-STATE-ABBREV     PIC X(2)     VALUE SPACES.          CL**2
00035      05  AR501I-ZIP-CODE         PIC X(5)     VALUE SPACES.          CL**2
00036      05  AR501I-SOCIAL-SECURITY-NUMBER                               CL**2
00037                                  PIC 9(9)     VALUE ZERO.            CL**2
00038      05  FILLER                  REDEFINES                           CL**3
00039                                   AR501I-SOCIAL-SECURITY-NUMBER.     CL**3
00040          10  AR501I-SOC-SEC-NUMBER-1-3                               CL**3
00041                                  PIC 9(3).                           CL**3
00042          10  AR501I-SOC-SEC-NUMBER-4-5                               CL**3
00043                                  PIC 9(2).                           CL**3
00044          10  AR501I-SOC-SEC-NUMBER-6-9                               CL**4
00045                                  PIC 9(4).                           CL**3
00046      05  AR501I-STORE-NUMBER     PIC 9(3)     VALUE ZERO.            CL**2
00047      05  AR501I-ACCOUNT-NOTES-1  PIC X(40)    VALUE SPACES.          CL**2
00048      05  AR501I-ACCOUNT-NOTES-2  PIC X(40)    VALUE SPACES.          CL**2
00049      05  AR501I-DATE-PUT-ON-DISCOUNT                                 CL**2
00050                                  PIC 9(6)     VALUE ZERO.            CL**2
00051      05  AR501I-DATE-DISCOUNT-EFFECTIVE                              CL**2
00052                                  PIC 9(6)     VALUE ZERO.            CL**2
00053      05  AR501I-DATE-TERMINATION-EFFECT                              CL**2
00054                                  PIC 9(6)     VALUE ZERO.            CL**2
00055      05  AR501I-DATE-LAST-CHANGED                                    CL**2
00056                                  PIC 9(6)     VALUE ZERO.            CL**2
00057      05  FILLER                  PIC X(15)    VALUE SPACES.          CL**2
