       01 AR099-FD-PURGE-ACCT-HDR-TRL.                                  00010001
          05  AR099-SYS-ID-HDR             PIC X(04).                   00010105
          05  FILLER                       PIC X(05).                   00010205
          05  AR099-HDR-DATE               PIC X(10).                   00010305
       01 AR099-FD-PURGE-ACCT-DATA.                                     00011003
          05  AR099-SYS-ID                 PIC X(4).                    00020005
          05  AR099-PRIN-ID                PIC X(4).                    00030005
          05  AR099-FULL-ACCT-NO           PIC X(16).                   00040005
          05  AR099-CHD-NM                 PIC X(26).                   00050005
          05  AR099-SSN-NR                 PIC X(9).                    00060005
          05  AR099-FILLER                 PIC X(1).                    00070005
          05  AR099-DLY-INT-RT             PIC X(7).                    00080005
          05  AR099-FILLER                 PIC X(1).                    00090005
          05  AR099-MNTH-SRVC-CHG-RT       PIC X(5).                    00100005
          05  AR099-FILLER                 PIC X(1).                    00110005
          05  AR099-DLY-SRVC-CHG-RT        PIC X(7).                    00120005
          05  AR099-CRDT-LIFE-IN           PIC X(1).                    00130005
          05  AR099-BILL-CYCL-CD           PIC X(2).                    00140005
          05  AR099-OPEN-DT                PIC X(4).                    00150005
          05  AR099-RENW-CD                PIC X(1).                    00160005
          05  AR099-EXP-DT                 PIC X(4).                    00170005
          05  AR099-CARD-NR                PIC X(3).                    00180005
          05  AR099-TYPE-PLST-CD           PIC X(1).                    00190005
          05  AR099-CRDT-SCOR-NR           PIC X(3).                    00200005
          05  AR099-CRDT-DT                PIC X(4).                    00210005
          05  AR099-AUTH-FLAG-CD           PIC X(1).                    00220005
          05  AR099-BRTH-DT                PIC X(8).                    00230005
          05  AR099-CHG-DDA-CD             PIC X(1).                    00240005
          05  AR099-DLTY-FL                PIC X(1).                    00250005
          05  AR099-MAN-DEL-TX             PIC X(10).                   00260005
          05  AR099-CHD-ADDR-1-TX          PIC X(34).                   00270005
          05  AR099-CK-ACCT-NR             PIC X(17).                   00280005
          05  AR099-HOME-PHON-NR           PIC X(12).                   00290005
          05  AR099-CRDT-LIMT-AM           PIC X(15).                   00300005
          05  AR099-CHD-ADDR-2-TX          PIC X(34).                   00310005
          05  AR099-SPEC-CNTL-FLG1-CD      PIC X(1).                    00320005
          05  AR099-SPEC-CNTL-FLG2-CD      PIC X(1).                    00330005
          05  AR099-SPEC-CNTL-FLG3-CD      PIC X(1).                    00340005
          05  AR099-SPEC-CNTL-FLG4-CD      PIC X(1).                    00350005
          05  AR099-SPEC-CNTL-FLG5-CD      PIC X(1).                    00360005
          05  AR099-SPEC-CNTL-FLG6-CD      PIC X(1).                    00370005
          05  AR099-SPEC-CNTL-FLG7-CD      PIC X(1).                    00380005
          05  AR099-SPEC-CNTL-FLG8-CD      PIC X(1).                    00390005
          05  AR099-CHD-ADDR-3-TX          PIC X(34).                   00400005
          05  AR099-EXT-STAT-CD            PIC X(1).                    00410005
          05  AR099-MERCH-INT-RT           PIC X(23).                   00420005
          05  AR099-CRED-INT-RT            PIC X(23).                   00430005
          05  AR099-OVLM-CHG-YTD-AM        PIC X(23).                   00440005
          05  AR099-LATE-CHG-YTD-AM        PIC X(23).                   00450005
          05  AR099-SPEC-FINC-CHG-YTD-AM   PIC X(23).                   00460005
          05  AR099-CASH-INT-YTD-AM        PIC X(23).                   00470005
          05  AR099-CASH-ITEM-YTD-AM       PIC X(23).                   00480005
          05  AR099-SALE-ITEM-YTD-AM       PIC X(23).                   00490005
          05  AR099-PRIC-STRT-ID           PIC X(8).                    00500005
          05  AR099-UPC6-11-CD             PIC X(5).                    00510005
          05  AR099-SPOS-NM                PIC X(34).                   00520005
          05  AR099-CYC-DEL-1-CD           PIC X(3).                    00530005
          05  AR099-CYC-DEL-2-CD           PIC X(3).                    00540005
          05  AR099-CYC-DEL-3-CD           PIC X(3).                    00550005
          05  AR099-GRS-ACCT-NR            PIC X(3).                    00560005
          05  AR099-LAST-MON-DT            PIC X(8).                    00570005
          05  AR099-LAST-NMON-DT           PIC X(8).                    00580005
          05  AR099-ADD-NME-CT             PIC 9(2).                    00590005
          05  ADD-NME OCCURS 0 TO 99 TIMES                              00600001
               DEPENDING ON AR099-ADD-NME-CT.                           00610000
              10  AR099-ROLE-LIT-TX        PIC X(16).                   00620005
              10  AR099-ROLE-NM            PIC X(24).                   00630005
              10  AR099-EXT-CUST-ID        PIC X(24).                   00640005
              10  AR099-PI-ID              PIC X(19).                   00650005
              10  AR099-PI-STAT-CD         PIC X(1).                    00660005
          05  AR099-EXPN-CITY-TX           PIC X(25).                   00670005
          05  AR099-EXPN-ADDR-1-TX         PIC X(50).                   00680005
          05  AR099-EXPN-ADDR-SUB-DVSN-TX  PIC X(25).                   00690005
          05  AR099-EXPN-ADDR-2-TX         PIC X(50).                   00700005
          05  AR099-EXPN-ADDR-PSTL-CD      PIC X(14).                   00710005
          05  AR099-EXPN-ADDR-CNTY-CD      PIC X(3).                    00720005
          05  AR099-EXPN-ADDR-3-TX         PIC X(50).                   00730005
          05  AR099-EXPN-ADDR-HOME-PH-NR   PIC X(19).                   00740005
          05  AR099-EXPN-ADDR-4-TX         PIC X(50).                   00750005
          05  AR099-EXPN-ADDR-WORK-PH-NR   PIC X(19).                   00760005
          05  AR099-EXPN-ADDR-ATTN-LINE-TX PIC X(50).                   00770001
