000100******************************************************************00010022
000200* RECORD LAYOUT FOR CONTROL DATE FILE                             00020030
000300* FILE IS USED TO STORE PREVIOUS HEADER DATES FROM THE EVOLVE     00030034
000400* ACTIVITY AND WORLD FILES                                        00040034
000500******************************************************************00050022
000600 01  AR092-RECORD.                                                00060032
000700     05  AR092-ACTVTY-DATE             PIC  X(08).                00070034
000800     05  AR092-ACTVTY-DATE-R REDEFINES AR092-ACTVTY-DATE.         00080034
000900         10 AR092-ACTVTY-CCYY          PIC  9(04).                00090034
001000         10 AR092-ACTVTY-CCYY-R REDEFINES AR092-ACTVTY-CCYY.      00100034
001100            15 AR092-ACTVTY-CC         PIC  9(02).                00110034
001200            15 AR092-ACTVTY-YY         PIC  9(02).                00120034
001300         10 AR092-ACTVTY-MM            PIC  9(02).                00130034
001400         10 AR092-ACTVTY-DD            PIC  9(02).                00140034
001500     05  AR092-FILLER                  PIC  X(02).                00150035
001600     05  AR092-WORLD-DATE              PIC  X(08).                00160034
001700     05  AR092-WORLD-DATE-R REDEFINES AR092-WORLD-DATE.           00170034
001800         10 AR092-WORLD-CCYY           PIC  9(04).                00180034
001900         10 AR092-WORLD-CCYY-R REDEFINES AR092-WORLD-CCYY.        00190034
002000            15 AR092-WORLD-CC          PIC  9(02).                00200034
002100            15 AR092-WORLD-YY          PIC  9(02).                00210034
002200         10 AR092-WORLD-MM             PIC  9(02).                00220034
002300         10 AR092-WORLD-DD             PIC  9(02).                00230034
002400     05  AR092-FUTURE-USE              PIC  X(62).                00240035
