      **************************************************************            
      *    FDR CARDHOLDER MASTER COPYBOOK - UNPACKED FOR SAS       *            
      *    THIS COPYBOOK IS BASED ON FDR CCCHDMSW                  *            
      **************************************************************            
      **************************************************************            
      *  CREATED - M.REIGH - 2012-02-23                            *            
      **************************************************************            
C86513******************************************************************        
C86513* 17/07/2014  COGNIZANT   CHG0086513                                      
C86513*  - ADDED NEW FIELDS IN THE CARD MASTER FILE AS PART OF THE              
C86513*    FD JULY MAJOR RELEASE                                                
C86513******************************************************************        
C00020******************************************************************        
C00020* 01/20/2015  COGNIZANT   CHG0100020                                      
C00020* - ADDED NEW FIELDS AS A PART OF JAN'15 RELEASE                          
C00020******************************************************************        
FD1601******************************************************************        
FD1601* 01/22/2015  COGNIZANT   CHG0131733                                      
FD1601* - ADDED NEW FIELDS AS A PART OF JAN'16 RELEASE                          
FD1601* - CHANGES ARE TAGGED WITH FD1601                                        
FD1601******************************************************************        
FD1607******************************************************************        
FD1607* 07/15/2016  COGNIZANT   CHG0146102                                      
FD1607* - ADDED NEW FIELDS AS A PART OF JUL'16 RELEASE                          
FD1607* - CHANGES ARE TAGGED WITH FD1607                                        
FD1607******************************************************************        
FD1704******************************************************************        
FD1704* 04/21/2017  COGNIZANT   CHG0166796                                      
FD1704* - ADDED NEW FIELDS AS A PART OF APR'17 RELEASE                          
FD1704* - CHANGES ARE TAGGED WITH FD1704                                        
FD1704******************************************************************        
FD1707******************************************************************        
FD1707* 07/21/2017  COGNIZANT   CHG0173282                                      
FD1707* - ADDED NEW FIELDS AS A PART OF JUL'17 RELEASE                          
FD1707* - CHANGES ARE TAGGED WITH FD1707                                        
FD1707******************************************************************        
4.0100 01 AR70-MASTER-DATA.                                                     
MCR       02  AR70-RECORD-IDENTIFIER.                                           
MCR           03  AR70-RECORD-ID                PIC X(6).                       
MCR           03  AR70-RECORD-SQNC-CT           PIC 9(7).                       
00287A     02  AR70-FORMAT-4.                                                   
00287A      03  AR70-FORMAT-3.                                                  
00287A       04  AR70-FORMAT-2.                                                 
00287A        05  AR70-FORMAT-1.                                                
4.0100            06  AR70-BASE-DATA-SEGMENT.                                   
                      07  AR70-NEW-FILE-TYPE          PIC X.                    
4.0100                07  AR70-RECORD-FORMAT          PIC 9(2).                 
00287A                07  FILLER                      PIC X(4).                 
                      07  AR70-CUSTOMER-IDENT.                                  
                          08  AR70-BRANCH-NO          PIC XX.                   
                          08  AR70-CUSTOMER-NO.                                 
00287A                        09  AR70-CUST-NO-BS     PIC XX.                   
00287A                        09  AR70-CUST-NO-AL     PIC XX.                   
4.054B                07  AR70-CLIENT-NUMBER          PIC X(4).                 
4.058A                07  AR70-CLIENT-NUMBER-9                                  
4.058A                                   REDEFINES AR70-CLIENT-NUMBER           
4.058A                                                PIC 9(4).                 
4.054B                07  AR70-SYSTEM-NO-EXPN                                   
4.054B                                  REDEFINES AR70-CLIENT-NUMBER            
4.054B                                                PIC X(4).                 
4.0100                07  AR70-FULL-ACCT-NO.                                    
4.0100                    08  AR70-SYSTEM-BANK.                                 
4.1500                        09  AR70-SYSTEM-NO.                               
4.1500                            10  AR70-THOUSAND-SERIES   PIC X.             
4.1500                            10  FILLER          PIC XXX.                  
4.0100                        09  AR70-BANK-NO.                                 
4.0100                            10  AR70-PRIN-BANK  PIC XXXX.                 
4.0100                            10  AR70-AGENT-BANK PIC XXXX.                 
4.0100                    08  FILLER REDEFINES AR70-SYSTEM-BANK.                
4.0100                        09  AR70-SYSTEM-PRIN    PIC X(8).                 
4.0100                        09  FILLER              PIC XXXX.                 
4.0100                    08  AR70-ACCOUNT-NUMBER     PIC X(16).                
4.0210                07  AR70-ACCOUNT-NO-EXPN        PIC XXX.                  
02235A                07  FILLER                      PIC X(2).                 
00287A                07  AR70-SEGMENT-OCCURS-NR.                               
10022D                    08  AR70-CIT-TOTL-CT       PIC 9(4).                  
00287A                    08  AR70-NO-DEL-ITEMS      PIC 9(4).                  
00287A                    08  AR70-NO-BEHAVIOR-SEGS  PIC 9(4).                  
00287A                    08  AR70-NO-CUSTOMER-SEGS  PIC 9(4).                  
00287A                    08  AR70-NO-HRSK-ACS-SEGS  PIC 9(4).                  
FD1507*                   08  AR70-FUTURE-SMALL-SEGS PIC X(6).                  
FD1507                    08  FILLER                 PIC X(6).                  
00287A                    08  AR70-NO-SMALL-SEGS     PIC 9(4).                  
10022C                    08  AR70-NO-ALP-STAG-SEGS  PIC 9(4).                  
10204B                    08  AR70-NO-NEW-MISC-SEGS  PIC 9(4).                  
11287A                    08  AR70-NO-NEW-MISC2-SEGS PIC 9(4).                  
11287A                    08  AR70-NO-NEW-MISC3-SEGS PIC 9(4).                  
09289C                    08  AR70-NO-SLS-SYD-SEGS   PIC 9(4).                  
FD1507*                   08  AR70-FUTURE-LARGE-SEGS PIC 9(4).                  
FD1507                    08  FILLER                 PIC X(4).                  
00287A                    08  AR70-NO-LARGE-SEGS     PIC 9(4).                  
FD1507*                   08  AR70-NO-SUPER-LARGE-SEGS                          
FD1507*                                                 PIC 9(4).               
FD1507                    08  FILLER                    PIC X(4).               
02235A                    08  AR70-NO-FLAP-SEGS         PIC 9(8).               
02235A                    08  AR70-NO-CHECKPOINTS       PIC 9(8).               
02235A                    08  AR70-NO-TLP-BONUS-SEGS    PIC 9(8).               
02235A                    08  AR70-NO-GLOBAL-NAME-CT    PIC X(5).               
02235A                    08  AR70-NO-GLOBAL-ADDRESS-CT PIC X(5).               
02235A                    08  AR70-NO-GLOBAL-PHONE-CT   PIC X(5).               
07285A                    08  AR70-NO-MMB-ITEM-CT       PIC X(5).               
04226D                    08  AR70-NO-PYST-ITEM-CT      PIC X(5).               
05224D                    08  AR70-NMBR-DSPT-ITEM-CT    PIC X(5).               
4.033B                07  AR70-ALT-FIN-KEY.                                     
4.033B                    08  AR70-AFK-ENTITY        PIC X(4).                  
4.033B                    08  AR70-AFK-CARD-NOCARD   PIC X(4).                  
4.033B                    08  AR70-AFK-BRANCH-PORTFO PIC X(6).                  
4.033B                    08  AR70-AFK-OTHER1        PIC X(6).                  
4.0100                07  AR70-STATUS-BYTES.                                    
4.0100                    08  AR70-STATUS-CODES.                                
4.0100                        09  AR70-EXTERNAL-STATUS  PIC X.                  
4.0100                        09  AR70-INTERNAL-STATUS  PIC X.                  
4.037A                    08  AR70-PREV-EXT-STATUS   PIC X.                     
4.037A                    08  AR70-CYCLE-CODE.                                  
4.037A                        09  AR70-CYCLE-CODE-99 PIC 99.                    
4.037A                    08  AR70-DATE-LAST-NONMON  PIC X(8).                  
4.065A                    08  AR70-PREVIOUS-CYCLE-CODE.                         
4.065A                        09  AR70-PREVIOUS-CYCLE-CODE-99 PIC 99.           
00287A                07  AR70-ADDT-ADDR-NR.                                    
00287A                    08  AR70-DLVR-PONT-NR       PIC X(9).                 
00287A                    08  AR70-DLVR-BAR1-NR       PIC X(19).                
00287A                    08  AR70-DLVR-BAR2-NR       PIC X(19).                
00287A                07  AR70-EXTRA-PRSNL-DATA-BASE.                           
00287A                    08  AR70-EP-DATA-2.                                   
00287A                        09  AR70-CHARGE-DDA-CODE PIC X.                   
00287A                        09  AR70-TRANSIT-ROUTING-NO                       
00287A                                             PIC X(10).                   
00287A                        09  AR70-CHECKING-ACCT-NO PIC X(17).              
00287A                        09  AR70-SAVINGS-ACCT-NO PIC X(17).               
00287A                        09  FILLER REDEFINES                              
00287A                                            AR70-SAVINGS-ACCT-NO.         
00287A                            10  AR70-TEMP-BONUS-LIMIT PIC 99.             
00287A                            10  FILLER             PIC X(15).             
4.037A                    08  AR70-SECURITY-CODE-1.                             
4.037A                        09  AR70-SEC-CODE-NUM-1 PIC 9(6).                 
4.037A                    08  AR70-SECURITY-CODE-2.                             
4.037A                        09  AR70-SEC-CODE-NUM-2 PIC 9(6).                 
00287A                    08  AR70-SCRT-3-CD.                                   
00287A                        09  AR70-SCRT-3-NMRC-CD PIC 9(6).                 
00287A                    08  AR70-SCRT-4-CD.                                   
00287A                        09  AR70-SCRT-4-NMRC-CD PIC 9(6).                 
4.037A                    08  AR70-PIN-VERIFY-1      PIC X(6).                  
4.037A                    08  AR70-PIN-VERIFY-2      PIC X(6).                  
00287A                    08  AR70-PIN-VRFY-3-NR     PIC X(6).                  
00287A                    08  AR70-PIN-VRFY-4-NR     PIC X(6).                  
4.065A            07  AR70-PIN-TRANSFER-FLAG         PIC X.                     
4.054A            07  AR70-TEMP-PROMO-NMDSREC.                                  
4.054A                08  AR70-TEMP-PI-CODE.                                    
4.054A                     09  AR70-TEMP-PI-TYPE     PIC X.                     
4.054A                     09  AR70-TEMP-PI-STMT     PIC X.                     
4.054A                08  AR70-TEMP-PROMO-START-DATE PIC X(8).                  
4.054A                08  AR70-TEMP-PROMO-END-DATE   PIC X(8).                  
4.037A            07  AR70-INTEREST-RATES.                                      
4.037A                08  AR70-INT-RATE-NMDSREC.                                
4.037A                    09  AR70-ANN-RATE-CASH    PIC X(7).                   
4.037A                    09  AR70-ANN-RATE-MRCH    PIC X(7).                   
00287A                    09  AR70-OLD-ANN-RATE     PIC X(7).                   
00287A                    09  AR70-OLD-ANN-RATE-CASH                            
00287A                                               PIC X(7).                  
4.037A                    09  AR70-ANN-RATE-CASH-MAX                            
4.037A                                               PIC X(7).                  
4.037A                    09  AR70-ANN-RATE-MRCH-MAX                            
4.037A                                               PIC X(7).                  
4.037A                    09 AR70-ANN-RATE-MRCH-FUTURE                          
00287A                                               PIC X(7).                  
4.037A                    09 AR70-ANN-RATE-CASH-FUTURE                          
00287A                                               PIC X(7).                  
4.037A                08  AR70-MONTHLY-RATE-CASH    PIC X(7).                   
4.037A                08  AR70-DAILY-RATE-CASH      PIC X(9).                   
4.037A                08  AR70-MONTHLY-RATE         PIC X(7).                   
4.037A                08  AR70-DAILY-RATE-MRCH      PIC X(9).                   
4.037A                08  AR70-ANN-RATE-CRDINT      PIC X(7).                   
4.037A                08  AR70-MONTHLY-RATE-CRDINT  PIC X(9).                   
4.037A                08  AR70-DAILY-RATE-CRDINT    PIC X(7).                   
4.037A                08  AR70-MTH-RATE-CASH-MAX    PIC X(7).                   
4.037A                08  AR70-MTH-RATE-MRCH-MAX    PIC X(7).                   
4.054A                08  AR70-ANN-RATE-DATA-NMDSREC.                           
4.054A                    09  AR70-ANN-RATE-CASH-MIN                            
4.054A                                               PIC X(7).                  
4.054A                    09  AR70-ANN-RATE-MRCH-MIN                            
4.054A                                               PIC X(7).                  
4.037A                08  AR70-MTH-RATE-CASH-MIN    PIC X(7).                   
4.037A                08  AR70-MTH-RATE-MRCH-MIN    PIC X(7).                   
4.065A            07  AR70-RESERVE-FOR-SOCIETY.                                 
4.065A                08  AR70-SOCIETY-LS-MRCH-RATE PIC X(7).                   
4.065A                08  AR70-SOCIETY-LS-CASH-RATE PIC X(7).                   
4.037A            07  AR70-COLLECTION-DATA.                                     
4.037A                08  AR70-BEHAVIOR-SCORE       PIC X(4).                   
4.065A                08  AR70-PREV-BHVR-SCORE      PIC X(4).                   
4.037A                08  AR70-SIX-DAY-DEBIT-COUNTS.                            
4.037A                    09  AR70-DAY-1-DEBITS     PIC X(2).                   
4.037A                    09  AR70-DAY-2-DEBITS     PIC X(2).                   
4.037A                    09  AR70-DAY-3-DEBITS     PIC X(2).                   
4.037A                    09  AR70-DAY-4-DEBITS     PIC X(2).                   
4.037A                    09  AR70-DAY-5-DEBITS     PIC X(2).                   
4.037A                    09  AR70-DAY-6-DEBITS     PIC X(2).                   
00287A                08  FILLER REDEFINES AR70-SIX-DAY-DEBIT-COUNTS.           
00287A                    09  AR70-DAY-1-6-DEBITS OCCURS 6 TIMES                
00287A                                            PIC X(2).                     
4.037A                08  AR70-COLLECTION-DATA-NMDSREC.                         
4.037A                    09  AR70-CR-SCORE-DATE    PIC X(5).                   
4.037A                    09  AR70-CREDIT-SCORE     PIC XXX.                    
4.037A                    09  AR70-COLLECTION-CODE  PIC X(4).                   
4.037A                    09  AR70-COFF-REASON-CODE PIC 99.                     
4.051A                    09  AR70-STATUS-REASON-CODE                           
4.051A                        REDEFINES AR70-COFF-REASON-CODE PIC 99.           
4.037A                    09  AR70-RECOURSE-FLAG    PIC X.                      
4.037A                    09  AR70-RECOURSE-MERCHANT PIC X(6).                  
4.037A                    09  AR70-WB-TRAN-TYPE     PIC X.                      
4.037A                    09  AR70-WB-PURGE-DATE    PIC X(6).                   
4.037A                    09  AR70-CREDIT-BUREAU-FLAG PIC X.                    
4.037A                08  AR70-COLL-PROC-FLAG       PIC X(2).                   
4.065A            07  AR70-RECOVERY-IND             PIC X(1).                   
4.037A            07  AR70-REISSUE-DATA.                                        
4.037A                08  AR70-REISSUE-DATA-NMDSREC.                            
4.037A                    09  AR70-RENEWAL-CODE     PIC X(2).                   
4.037A                    09  AR70-NO-PLASTICS      PIC X(4).                   
4.037A                    09  AR70-PLASTICS-GROUP.                              
4.037A                        10  AR70-TYPE-PLASTIC        PIC X.               
4.037A                        10  AR70-SPOUSE-TYPE-PLASTIC PIC X.               
4.037A                        10  AR70-DUAL-TYPE-PLASTIC   PIC X.               
4.037A                        10  AR70-DUAL-SPOUSE-TYPE-PLASTIC PIC X.          
4.037A                    09  AR70-NEWCARD-FLAG             PIC X.              
4.037A                    09  AR70-ANNUAL-CHARGE-FLAG       PIC X.              
4.037A                    09  AR70-ANNUAL-CHG-DATE     PIC X(5).                
4.037A                    09  AR70-MAIL-CONTROL.                                
4.037A                        10  AR70-MAIL-CODE   PIC X(4).                    
4.037A                        10  AR70-MAIL-CODE-FLAG PIC 9.                    
10204A                08  AR70-PRTC-BLNC-CD        PIC X.                       
4.037A                08  AR70-OPEN-DATE           PIC X(8).                    
00287A                08  AR70-MEMBER-SINCE-DATE   PIC X(5).                    
00287A                08  AR70-FILLER-B5B022MS-2   PIC X(3).                    
4.037A                08  AR70-EXPIRATION-DATE     PIC X(8).                    
4.037A                08  AR70-REISSUE-CONTROL     PIC X(2).                    
4.037A                08  AR70-DATE-LAST-PLASTIC   PIC X(8).                    
00287A            07  AR70-SMRT-CARD-DATA.                                      
00287A                08  AR70-SMRT-CARD-ICC-CD    PIC X.                       
4.037A            07  AR70-CREDIT-LINE-DATA.                                    
98023G                08  AR70-CREDIT-LINE         PIC X(16).                   
4.037A                08  AR70-CREDIT-LINE-DATA-NMDSREC.                        
4.037A                    09  AR70-TYPE-CRED-LINE-CHG PIC X.                    
4.037A                    09  AR70-CR-LINE-DATE    PIC X(5).                    
4.037A                    09  AR70-DATE-LAST-REVIEW PIC X(5).                   
4.037A                    09  AR70-DATE-NEXT-REVIEW PIC X(5).                   
4.037A            07  AR70-SPECIAL-CONTROL-FLAGS.                               
4.037A                08  AR70-EXPANDED-CUST-USE-FLAGS.                         
4.037A                    09  AR70-CUST-FLG-1        PIC X.                     
4.037A                    09  AR70-CUST-FLG-2        PIC X.                     
4.037A                    09  AR70-CUST-FLG-3        PIC X.                     
4.037A                    09  AR70-CUST-FLG-4        PIC X.                     
4.037A                08  FILLER REDEFINES                                      
4.037A                                    AR70-EXPANDED-CUST-USE-FLAGS.         
4.037A                    09  AR70-EXP-CUST-USE-FLAG                            
4.037A                                             OCCURS 4 TIMES PIC X.        
4.037A                08  AR70-SPECIAL-CODES.                                   
4.037A                    09  AR70-SC-1              PIC X.                     
4.037A                    09  AR70-SC-2              PIC X.                     
4.037A                    09  AR70-SC-3              PIC X.                     
4.037A                    09  AR70-SC-4              PIC X.                     
4.037A                    09  AR70-SC-5-8-NMDSREC.                              
4.037A                        10  AR70-SC-5          PIC X.                     
4.037A                        10  AR70-SC-6          PIC X.                     
4.037A                        10  AR70-SC-7          PIC X.                     
4.037A                        10  AR70-SC-8          PIC X.                     
4.037A                08  FILLER REDEFINES AR70-SPECIAL-CODES.                  
4.037A                    09  AR70-SPECIAL-CONTROL                              
4.037A                                 OCCURS 8 TIMES PIC X.                    
4.037A            07  AR70-MISCELLANEOUS-FIELDS.                                
00287A                08  AR70-MISCELLANEOUS-FIELD-1  PIC X(4).                 
00287A                08  AR70-AMWAY-PENDING-AUTH REDEFINES                     
4.037A                    AR70-MISCELLANEOUS-FIELD-1  PIC 9(4).                 
00287A                08  AR70-MISCELLANEOUS-FIELD-2  PIC X(5).                 
00287A                08  AR70-AMWAY-CREDIT-LINE REDEFINES                      
4.037A                    AR70-MISCELLANEOUS-FIELD-2  PIC 9(5).                 
00287A                08  AR70-MYRIAD-INCREASE-AMT REDEFINES                    
4.054R                    AR70-MISCELLANEOUS-FIELD-2  PIC 9(5).                 
00287A                08  AR70-MISCELLANEOUS-FIELD-3  PIC X(8).                 
00287A                08  AR70-AMWAY-BALANCE REDEFINES                          
4.037A                    AR70-MISCELLANEOUS-FIELD-3  PIC X(8).                 
00287A                08  AR70-MISCELLANEOUS-FIELD-4  PIC X(11).                
00287A                08  AR70-AMWAY-LS-BAL REDEFINES                           
4.037A                    AR70-MISCELLANEOUS-FIELD-4  PIC X(11).                
00287A                08  FILLER REDEFINES                                      
4.037A                    AR70-MISCELLANEOUS-FIELD-4.                           
00287A                    09  AR70-MISC-FLD4-CD       PIC X(2).                 
00287A                    09  FILLER                  PIC X(6).                 
00287A                    09  AR70-MISC-4-LAST3       PIC X(3).                 
00287A                08  AR70-MYRIAD-RELATED-ACCT-NO REDEFINES                 
4.054R                    AR70-MISCELLANEOUS-FIELD-4  PIC X(11).                
00287A                08  AR70-MISCELLANEOUS-FIELD-5.                           
00287A                    09  AR70-MISC-5-POS1-ID     PIC X.                    
00287A                    09  AR70-MISC-5-POS2        PIC X(1).                 
00287A                    09  FILLER                  PIC X(6).                 
00287A                08  FILLER REDEFINES AR70-MISCELLANEOUS-FIELD-5.          
00287A                    09  AR70-PREV-PYMT-AMT   PIC X(9).                    
00287A                    09  AR70-EARLY-PYMT-AMT  PIC X(9).                    
00287A                08  AR70-MISCELLANEOUS-FIELD-6.                           
00287A                    09  FILLER                   PIC X(11).               
00287A                    09  AR70-MISC6-POSITION12   PIC X(1).                 
00287A                08  FILLER REDEFINES AR70-MISCELLANEOUS-FIELD-6.          
00287A                    09  AR70-OVLMT-START-YYJJJ PIC X(6).                  
00287A                    09  AR70-OVLMT-END-YYJJJ   PIC X(6).                  
00287A                    09  AR70-OVLMT-HIGH-BAL    PIC X(6).                  
00287A                    09  AR70-OVLMT-CR-LIMIT    PIC X(6).                  
00287A                08  FILLER REDEFINES AR70-MISCELLANEOUS-FIELD-6.          
00287A                    09  AR70-MYRIAD-AMT-PAID    PIC  X(10).               
00287A                    09  FILLER                   PIC  X.                  
00287A                    09  AR70-MYRIAD-NO-PYMTS    PIC  99.                  
00287A                08  AR70-MISCELLANEOUS-FIELD-7 PIC X(10).                 
00287A                08  FILLER REDEFINES AR70-MISCELLANEOUS-FIELD-7.          
00287A                    09  AR70-LAST-CR-LIMIT     PIC X(6).                  
00287A                    09  AR70-PREV-PYMT-YYJJJ   PIC X(6).                  
00287A                    09  AR70-EARLY-PYMT-YYJJJ  PIC X(6).                  
00287A                    09  FILLER                  PIC X.                    
00287A                08  FILLER REDEFINES AR70-MISCELLANEOUS-FIELD-7.          
00287A                    09  AR70-MYRIAD-ANN-CASH-ADV-INT PIC 9(5).            
00287A                    09  AR70-MYRIAD-INSURANCE-PREM   PIC 9(5).            
00287A                08  AR70-MISCELLANEOUS-FIELD-8       PIC X(10).           
00287A                08  FILLER REDEFINES AR70-MISCELLANEOUS-FIELD-8.          
00287A                    09  AR70-FIX-PAY-YYJJJ     PIC X(6).                  
00287A                    09  AR70-PREV-STAT-YYJJJ   PIC X(6).                  
00287A                    09  AR70-LAST-RET-CHECK    PIC X(6).                  
00287A                    09  AR70-PREV-EXT-STAT     PIC X.                     
00287A                08  FILLER REDEFINES AR70-MISCELLANEOUS-FIELD-8.          
00287A                    09  AR70-NW-OVLMT-START-YYJJJ                         
00287A                                                PIC X(6).                 
00287A                    09  AR70-NW-OVLMT-END-YYJJJ                           
00287A                                                PIC X(6).                 
00287A                    09 AR70-NW-DATE-HIGH-BAL-YYJJJ                        
00287A                                                PIC X(6).                 
00287A                    09  FILLER                   PIC X.                   
11105A                08  FILLER REDEFINES AR70-MISCELLANEOUS-FIELD-8.          
11105A                    09  AR70-MSCL-FLD8-PSTN1    PIC X.                    
11105A                    09  AR70-MSCL-FLD8-PSTN2    PIC X.                    
11105A                    09  AR70-MSCL-FLD8-PSTN3    PIC X.                    
11105A                    09  AR70-MSCL-FLD8-PSTN4    PIC X.                    
11105A                    09  AR70-MSCL-FLD8-PSTN5    PIC X.                    
11105A                    09  AR70-MSCL-FLD8-PSTN6    PIC X.                    
11105A                    09  AR70-MSCL-FLD8-PSTN7    PIC X.                    
11105A                    09  AR70-MSCL-FLD8-PSTN8    PIC X.                    
11105A                    09  AR70-MSCL-FLD8-PSTN9    PIC X.                    
11105A                    09  AR70-MSCL-FLD8-PSTN10   PIC X.                    
11105A                08  FILLER REDEFINES AR70-MISCELLANEOUS-FIELD-8.          
11105A                    09  FILLER                   PIC X(3).                
11105A                    09  AR70-MSCL-FLD8-PSTN4-6  PIC 9(3).                 
11105A                    09  FILLER                   PIC X(4).                
00287A                08  FILLER REDEFINES AR70-MISCELLANEOUS-FIELD-8.          
11105A                    09  FILLER                   PIC X(4).                
00287A                    09  AR70-MSCL-FLD8-CHG-DATE PIC X(6).                 
00287A            07  AR70-ADDL-MISC-FIELDS-NMDSREC.                            
00287A                08  AR70-MISC-FIELD-9           PIC X(10).                
00287A                08  FILLER REDEFINES AR70-MISC-FIELD-9.                   
00287A                    09  AR70-MISCELLANEOUS-FIELD-9 PIC X(11).             
00287A                08  FILLER REDEFINES AR70-MISC-FIELD-9.                   
00287A                    09  FILLER                   PIC X(5).                
00287A                    09  AR70-MISC9-POS6-ID      PIC X.                    
00287A                    09  FILLER                   PIC X(4).                
00287A                08  AR70-MISC-FIELD-10          PIC X(10).                
00287A            07  AR70-MISC-FIELDS.                                         
00287A                08  AR70-MISC-FIELD-11-TX      PIC X(26).                 
00287A                08  AR70-MISC-FIELD-12-TX      PIC X(26).                 
4.054A            07  AR70-MISC-DATES-NMDSREC.                                  
00287A                08  AR70-DATE-LAST-PIN-MAILER  PIC X(8).                  
98023G            07  AR70-DESIGNATED-AUTOPAY-AMT PIC X(19).                    
4.037A            07  AR70-CRLIFE-ORIG-NUM-STATE  PIC X(4).                     
00287A            07  AR70-FDR-USE-MISC-FIELD-1       PIC X(10).                
4.037A            07  FILLER REDEFINES AR70-FDR-USE-MISC-FIELD-1.               
03038B                08  FILLER                       PIC X.                   
00287A                08  AR70-CRD-BUR-FLAG-2         PIC X.                    
00287A                08  AR70-BTI-USE-FLAG           PIC X.                    
00287A                08  AR70-STI-USE-FLAG           PIC X.                    
00287A                08  AR70-REFUND-INDICATOR       PIC X.                    
00287A                08  AR70-EXTD-REISSUE-BYPASS-FLAG PIC 9.                  
00287A                08  AR70-CRLIFE-ORIG-STATE      PIC X(2).                 
00287A                08  AR70-CRBR-CNSM-INFR-CD      PIC X(2).                 
4.037A            07  AR70-CROSS-REFERENCE-ACCT-NO  PIC X(18).                  
4.037A            07  AR70-NEW-XREF-NO-1            PIC X(18).                  
4.037A            07  AR70-NEW-XREF-NO-2            PIC X(18).                  
4.037A            07  AR70-CUST-XREF-ID             PIC X(16).                  
4.054K            07  FILLER REDEFINES AR70-CUST-XREF-ID.                       
4.054K                08  AR70-OLD-CR-LIFE-DATE     PIC X(8).                   
4.054K                08  AR70-OLD-CR-LIFE-STAT-DATE PIC X(8).                  
98023G                08  AR70-OLD-CR-LIFE-PAID-AMT                             
98023G                                             PIC X(15).                   
98023G                08  FILLER                   PIC X.                       
4.065A            07  AR70-CR-LIFE-STAT-DATE      PIC X(8).                     
98023G            07  AR70-CR-LIFE-PAID-AMT       PIC X(15).                    
4.037A            07  AR70-TERMS-PROCESSING.                                    
4.037A                08  AR70-LS-TERMS-FLAG      PIC X(2).                     
4.037A                08  AR70-CTD-TERMS-FLAG     PIC X(2).                     
4.037A                08  AR70-TERMS-DATE         PIC X(8).                     
4.037A            07  AR70-TRANSFER-PROCESSING.                                 
4.037A                08  AR70-TRANSFER-FLAG      PIC X(2).                     
4.037A                08  AR70-DATE-LOST-STOLEN   PIC X(8).                     
4.037A                08  AR70-ACCT-TRANSFER      PIC X.                        
4.037A                08  AR70-ACCT-XFOOT         PIC X.                        
4.037A            07  AR70-BONUS-ACTIVITY.                                      
4.037A                08  AR70-BONUS-ACTIVITY-NMDS.                             
98023G                    09  AR70-ACCUM-BONUS-AMT                              
98023G                                             PIC X(19).                   
98023G                    09  AR70-CTD-BONUS-CREDIT                             
98023G                                             PIC X(19).                   
98023G                    09  AR70-CTD-BONUS-DEBIT                              
98023G                                             PIC X(19).                   
98023G                    09  AR70-BONUS-QUALIFIED-PURCH                        
98023G                                             PIC X(19).                   
4.037A                    09  AR70-BONUS-SELECT-DISBURSE-MTH   PIC X.           
4.037A                    09  AR70-BONUS-ACTUAL-DISBURSE-MTH   PIC X.           
4.063E                08  AR70-STMT-FEE-FLAG            PIC X.                  
00287A                08  AR70-BONUS-PREV-YR-QUAL-PUR                           
00287A                                             PIC X(19).                   
98023G                08  AR70-BONUS-PREV-YR-DOLLARS                            
98023G                                             PIC X(19).                   
98023G                08  AR70-LAST-CALC-BONUS-AMT                              
98023G                                             PIC X(19).                   
4.037A            07  AR70-FIXED-PAYMENT-AMOUNTS.                               
98023G                08  AR70-FIXED-PAYMENT-AMT                                
98023G                                             PIC X(19).                   
98023G                08  AR70-CASH-FIXED-PAYMENT                               
98023G                                             PIC X(19).                   
4.037A            07  AR70-SPECIAL-PROCESSING-FLAGS.                            
4.037A                08  AR70-SPEC-PROC-FLAGS-NMDSREC.                         
4.037A                    09  AR70-ANN-ACTIVITY-SUMM-FLAG   PIC X(2).           
4.037A                    09  AR70-90-DAY-FLAG    PIC X(2).                     
4.037A                    09  AR70-DEFER-PAY-FLAG     PIC X(2).                 
4.037A                    09  AR70-PAY-AHEAD-FLAG     PIC X(2).                 
4.037A                    09  AR70-CREDIT-LIFE-FLAG.                            
4.037A                        10  AR70-CREDIT-LIFE-FLAG-N PIC 9.                
98023G                    09  AR70-MAX-REBATE-AMT                               
98023G                                             PIC X(15).                   
4.037A                    09  AR70-DELETE-FLAG        PIC X.                    
4.037A                    09  AR70-DUALITY-FLAG       PIC X(2).                 
4.037A                    09  AR70-TYPE-LAST-NONMON  PIC X(4).                  
C00020*                   09  AR70-CC-LEVEL1         PIC X(6).                  
C00020*                   09  AR70-CC-LEVEL2         PIC X(6).                  
C00020                    09  FILLER                  PIC X(12).                
4.038A                08  AR70-SPEC-STMT-FLAG         PIC X(2).                 
99022H                08  AR70-PORTFOLIO-NO-OLD       PIC X(4).                 
4.048A                08  AR70-AUTOPAY-SKIP-FLAG      PIC X(1).                 
4.037A                08  AR70-GROSS-ACTIVE           PIC X.                    
4.037A                08  AR70-DEBIT-ACTIVE           PIC X.                    
4.037A                08  AR70-BASIC-ACTIVE           PIC X.                    
4.037A                08  AR70-AUTH-FLAG              PIC X.                    
4.037A                08  AR70-INTEREST-SWITCH        PIC X.                    
4.037A                08  AR70-STMT-HOLD-FLAG         PIC X.                    
4.037A                08  AR70-MULTRAN-FLAG           PIC X.                    
4.037A                08  AR70-PREM-SUPPLE-INS-FLAG   PIC X.                    
4.037A                08  AR70-SPECIAL-RATE-FLAG      PIC X.                    
4.037A                08  AR70-DEBIT-BALANCE-CYCLE    PIC X(2).                 
4.037A                08  AR70-CASH-MOVE-DATE         PIC X(8).                 
4.037A                08  AR70-PINOFFSET-SECCODE-CHG-SW PIC X(2).               
4.037A                08  AR70-LS-CASH-MOVE-DATE     PIC X(4).                  
4.037A                08  AR70-INT-ON-INT-FLAG        PIC X.                    
4.037A                08  AR70-ADD-STMT-FLAG          PIC 9.                    
4.065A            07  AR70-DEBIT-RATIFICATION.                                  
4.065A                08  AR70-DEBIT-RAT-TYPE         PIC X.                    
4.037A            07  AR70-REST-BASE-NMDSREC.                                   
4.037A                08  AR70-ICHG-DATE             PIC X(8).                  
4.037A                08  AR70-SORT-DISTRIBUTION     PIC X(4).                  
4.037A                08  AR70-IRS-HOME-EQUITY-FLAG  PIC 9.                     
4.037A                08  AR70-WAIV-OVERLATE-FEES    PIC X.                     
4.037A                08  AR70-DATE-FUTURE-TERMS     PIC X(8).                  
4.037A                08  AR70-CR-LIFE-STATUS        PIC X.                     
4.037A                08  AR70-CHECK-ORDER-FLAG      PIC X.                     
4.037A                08  AR70-CHECK-ORD-SPEC-FLAG   PIC X.                     
4.037A                08  AR70-LAST-CHECK-NUM-ISSUED PIC X(6).                  
4.037A                08  AR70-PHONE-CHARGE-FLAG     PIC X.                     
4.043A            07  AR70-CB-SCORE                  PIC X(4).                  
4.054A            07  AR70-CB-DATA-NMDSREC.                                     
4.054A                08  AR70-CB-ID                 PIC X.                     
4.054A                08  AR70-CB-CODE                PIC X(4).                 
4.054A                08  AR70-CB-ATTR1               PIC X.                    
4.054A                08  AR70-CB-ATTR2               PIC X.                    
4.054A                08  AR70-CB-ATTR3               PIC X.                    
4.054A                08  AR70-CB-SCORE-DATE         PIC X(8).                  
4.065A            07  AR70-CB-REASON1                 PIC XX.                   
4.065A            07  AR70-CB-REASON2                 PIC XX.                   
4.065A            07  AR70-CB-REASON3                 PIC XX.                   
4.065A            07  AR70-CB-REASON4                 PIC XX.                   
4.044A            07  AR70-RANDOM-DIGITS              PIC XX.                   
4.045C            07  AR70-CORRESPOND-FLAG            PIC 9.                    
4.045B            07  AR70-WAIV-OVLMT-RESET           PIC X.                    
4.037A            07  AR70-BTI-FIRST-USE-FLAGS.                                 
4.037A                08  AR70-BTI-FIRST-USE-FLAG     PIC X.                    
4.037A                08  AR70-STI-FIRST-USE-FLAG     PIC X.                    
4.037A            07  AR70-DEF-CR-LIFE-FLAG          PIC 9.                     
4.037A            07  AR70-MO-CHARGE-INT-ONLY        PIC X(4).                  
4.037A            07  AR70-PRE-ANNUAL-CHG-MESSAGE    PIC X.                     
4.037A            07  AR70-PINPOINT-CTD-COUNT        PIC X(4).                  
4.037A            07  AR70-ANN-FEE-CHARGED           PIC X(2).                  
4.037A            07  AR70-SERVICES-MATRIX           PIC X(5).                  
4.037A            07  AR70-CHDSELCT-SEQ-NO           PIC XXX.                   
4.037A            07  AR70-APPLICATION-SCORE         PIC X(6).                  
4.037A            07  AR70-DATE-STATUS-CHG           PIC X(8).                  
4.049C            07  AR70-RISK-PREDICTOR-SCORE      PIC X(5).                  
4.049C            07  AR70-RISK-PREDICTOR-BUREAU     PIC X(1).                  
4.049C            07  AR70-RISK-PREDICTOR-MODEL      PIC X(1).                  
4.050B            07  AR70-REGION-OF-DOMICILE.                                  
4.050B                08  AR70-VISA-REGION           PIC X.                     
4.050B                08  AR70-MC-REGION             PIC X.                     
4.051C            07  AR70-ACCT-TRANSFER-DATE        PIC X(6).                  
4.051C            07  AR70-ACCT-TRANSFER-FLAG        PIC X.                     
4.052A            07  AR70-CASH-CREDIT-LINE-CHG-DT   PIC X(8).                  
4.052A            07  AR70-CASH-CREDIT-LINE-CHG-TYP  PIC X.                     
4.053B            07  AR70-ADD-ON-RATE-FLAG          PIC X.                     
4.054B            07  AR70-CURR-PRICING-PORTFOLIO    PIC 9(4).                  
4.054B            07  AR70-CURR-PRICING-STRATEGY     PIC X(8).                  
4.054B            07  AR70-CURR-PRICE-STRATEGY-DATE  PIC X(8).                  
4.054B            07  AR70-CURR-STRAT-CYCLE-FLAG     PIC X(1).                  
08025B            07  AR70-LS-PRCN-PORT-ID           PIC 9(4).                  
10022B            07  AR70-OLD-NEXT-PRICING-STRATEGY PIC X(8).                  
4.054B            07  AR70-NEXT-PRICE-STRATEGY-DATE  PIC X(5).                  
10022B            07  AR70-OLD-NEXT-STRAT-CYCLE-FLAG PIC X(1).                  
10022B            07  AR70-OLD-NEXT-STRT-STAGE-RSN   PIC X(1).                  
4.054B            07  AR70-LS-PRICING-STRATEGY       PIC X(8).                  
4.054B            07  AR70-LAST-STRATEGY-CHANGE-DATE PIC X(8).                  
4.054B            07  AR70-PROCESSING-LEVEL          PIC X(1).                  
4.054B            07  AR70-UD-GEO-CODE               PIC X(4).                  
4.054B            07  AR70-UD-RISK-SCORE             PIC X(4).                  
4.054B            07  AR70-UD-PRODUCT-TYPE           PIC X(4).                  
00287A            07  AR70-RSRVD-FILLER-PRDT-TYP     PIC X.                     
4.054B            07  AR70-UD-SOURCE-CODE            PIC X(4).                  
4.054B            07  AR70-UD-PROFITABILITY-INDEX    PIC X(4).                  
4.054B            07  AR70-UD-FINANCIAL-INSTITUTION  PIC X(8).                  
4.054B            07  AR70-UD-BANK-RELATION-CODE     PIC X(4).                  
4.054B            07  AR70-UD-ATTRITION-INDEX        PIC X(4).                  
4.054B            07  AR70-UD-APPROVAL-OFFICER-CODE  PIC X(8).                  
4.054B            07  AR70-UD-LIFESTYLE-IND          PIC X(8).                  
4.054B            07  AR70-UD-RPT1                   PIC X(4).                  
4.054B            07  AR70-UD-RPT2                   PIC X(4).                  
4.054B            07  AR70-UD-RPT3                   PIC X(4).                  
4.054B            07  AR70-UD-RPT4                   PIC X(4).                  
4.054B            07  AR70-UD-AD-MESSAGE-FLAG        PIC X(4).                  
4.054B            07  AR70-UD-PRICING-CONTROLS.                                 
4.054B                08  AR70-UPC-1                 PIC X(1).                  
4.054B                08  AR70-UPC-2                 PIC X(1).                  
4.054B                08  AR70-UPC-3                 PIC X(1).                  
4.054B                08  AR70-UPC-4                 PIC X(1).                  
4.054B                08  AR70-UPC-5                 PIC X(1).                  
4.054B                08  AR70-UPC-6                 PIC X(2).                  
4.054B                08  AR70-UPC-7                 PIC X(2).                  
4.054B                08  AR70-UPC-8                 PIC X(3).                  
4.054B                08  AR70-UPC-9                 PIC X(3).                  
4.054B                08  AR70-UPC-10                PIC X(4).                  
4.054B                08  AR70-UPC-11                PIC X(5).                  
4.054B                08  AR70-UPC-12                PIC X(6).                  
4.058A            07  AR70-JFRAUD-FIELDS-NMDSREC.                               
4.058A                08  AR70-FRAUD-PORT-ID         PIC 99.                    
4.058A                08  AR70-FRAUD-ASSG-STRATEGY   PIC XX.                    
4.058A                08  AR70-FRAUD-STRAT-CHANGE-DATE                          
4.058A                                                PIC X(8).                 
4.058A                08  AR70-FRAUD-SUSPEND-STRATEGY PIC XX.                   
4.058A                08  AR70-FRAUD-SUSP-STRATEGY-DATE                         
4.058A                                                PIC X(8).                 
4.058A                08  AR70-LAST-PLASTIC-SOURCE   PIC X.                     
4.058A                08  AR70-FRAUD-SCORE-CHANGE-DATE                          
4.058A                                                PIC X(8).                 
4.058A            07  AR70-MORE-JFRAUD-FIELDS.                                  
4.058A                08 AR70-FRAUD-SCORE            PIC X(4).                  
4.063C            07  AR70-DATE-LAST-ACL-LTR         PIC X(8).                  
4.054D            07  AR70-DISCOUNT-CODE             PIC X(01).                 
4.054D            07  AR70-DATE-ONE-DAY-PURCH-ELIG   PIC X(8).                  
4.054D            07  AR70-NO-DAYS-CLR-ONE-DAY-PURCH PIC X(4).                  
4.054D            07  AR70-DATE-ONE-DAY-PRCH-APPLIED                            
4.054D                                                PIC X(8).                 
4.054D            07  AR70-ONE-DAY-PURCH-DISC-PCT    PIC X(5).                  
4.054D            07  AR70-ONE-DAY-PURCH-PROMO-ID    PIC X(05).                 
95258             07  AR70-MBR-BNFT-CD.                                         
95258                 08  AR70-MBR-BNFT-01-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-02-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-03-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-04-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-05-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-06-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-07-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-08-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-09-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-10-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-11-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-12-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-13-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-14-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-15-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-16-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-17-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-18-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-19-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-20-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-21-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-22-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-23-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-24-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-25-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-26-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-27-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-28-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-29-CD        PIC X.                     
95258                 08  AR70-MBR-BNFT-30-CD        PIC X.                     
C00020*           07  AR70-CC-LEVEL3                 PIC X(6).                  
C00020*           07  AR70-CC-LEVEL4                 PIC X(6).                  
C00020*           07  AR70-CC-LEVEL5                 PIC X(6).                  
FD1704            07  FILLER                         PIC X(08).                 
FD1704            07  AR70-UPGR-DT                   PIC X(10).                 
4.065A            07  AR70-NO-MAIL-FLAG              PIC X(2).                  
04093A            07  AR70-RMRT-TYPE-CD              PIC X(1).                  
04226A            07  AR70-LS-PRMT-PRCH-STMT-IN      PIC X(1).                  
4.065C            07  AR70-STRATEGY-LOCKS-NMDSREC.                              
4.065C                08  AR70-PRICING-STRATEGY-STATUS  PIC X.                  
4.065C                08  AR70-PRICING-STRATEGY-LOCK-BEG                        
4.065C                                                PIC X(8).                 
4.065C                08  AR70-PRICING-STRATEGY-LOCK-END                        
4.065C                                                PIC X(8).                 
98023G            07  AR70-CTD-PARTNER-DEBITS     PIC X(19).                    
98023G            07  AR70-YTD-UNUSD-PRTNR-REBATES                              
98023G                                             PIC X(19).                   
98023G            07  AR70-LSTYR-UNUSD-PRTNR-REBT PIC X(19).                    
98023G            07  AR70-YTD-PARTNER-EARNED     PIC X(19).                    
98023G            07  AR70-LIFTIME-PRTNR-EARNED   PIC X(19).                    
4.068A            07  AR70-BONUS-STRATEGY            PIC X(8).                  
4.068A            07  AR70-LS-BONUS-STRATEGY         PIC X(8).                  
4.067A            07  AR70-ADJ-EXPIRATION-DATE       PIC X(5).                  
4.067A            07  AR70-ADJ-REISSUE-INTVL         PIC X(5).                  
4.067B            07  AR70-LAST-ANNUAL-CHARGE-FLAG   PIC X.                     
4.067C            07  AR70-HOME-BANK-IND             PIC X.                     
98023G            07  AR70-HIGH-BAL-LIFE          PIC X(19).                    
98268A            07  AR70-MIN-DAYS-DELQ-NR          PIC X(4).                  
4.068B            07  AR70-BSCORE-ACS-CLNT-PRT-FLDS.                            
4.068B                08  AR70-ACS-CLNT-ID           PIC 9(4).                  
4.068B                08  AR70-ACS-CURR-PORT         PIC 9(4).                  
4.068B                08  AR70-ACS-RNDM-DGT          PIC X(4).                  
4.068B                08  AR70-ACS-PORT-CHG-DATE     PIC X(10).                 
4.068B                08  AR70-ACS-OVERRIDE-PORT     PIC 9(4).                  
4.068C            07  AR70-ALTERNATE-LANGUAGE-FLAG   PIC XX.                    
4.068D            07  AR70-XCEPT-CHARGE-OFF-FLAG     PIC X.                     
4.068E            07  AR70-NOTE-OF-NEG-RPT           PIC 9.                     
4.068E            07  AR70-PREV-INTERNAL-STATUS      PIC X.                     
4.068C            07  AR70-DATE-IN-COLLECTION        PIC X(10).                 
4.068E            07  AR70-START-DATE-OF-DELQ        PIC X(10).                 
4.068B            07  AR70-RECOVER-DOLLARS-FACTOR   PIC X(7).                   
4.068H            07  AR70-PRIMARY-PEF               PIC X(26).                 
4.068H            07  AR70-SECONDARY-PEF             PIC X(26).                 
4.071C            07  AR70-LATE-FEE-WAIVER-CT        PIC 9.                     
4.071B            07  AR70-COV-STRATEGY-ID           PIC X(4).                  
4.071C            07  AR70-CREDIT-LIFE-INSURANCE OCCURS 6 TIMES.                
4.071C                08  AR70-CLI-PRODUCT-CODE      PIC X(2).                  
4.071C                08  AR70-CLI-EFFECTIVE-DATE    PIC X(8).                  
4.071C                08  AR70-CLI-RATE-STATE        PIC X(2).                  
4.071C                08  AR70-CLI-STATUS-CODE       PIC X.                     
4.072H                08  AR70-CLI-FREE-CYCLES-REMAIN PIC X(4).                 
98023G            07  AR70-LAST-PARTNER-EARNED    PIC X(19).                    
98023G            07  AR70-CTD-PRTNR-SALE-ADJ     PIC X(19).                    
98023G            07  AR70-CTD-PRTNR-RTRN-ADJ     PIC X(19).                    
95223A            07  AR70-BS-REASON-CODE-1          PIC X(8).                  
95223A            07  AR70-BS-REASON-CODE-2          PIC X(8).                  
95223A            07  AR70-BS-REASON-CODE-3          PIC X(8).                  
95223A            07  AR70-BS-REASON-CODE-4          PIC X(8).                  
98023G            07  AR70-LIFTIME-REBATE-PTS     PIC X(19).                    
95314E            07  AR70-TESR-QLFD-IN              PIC X.                     
98023G            07  AR70-PRTNR-BONUS-QUAL-PURCH PIC X(19).                    
98023G            07  AR70-CTD-PRTNR-RETURNS      PIC X(19).                    
4.071C            07  AR70-CACS-COLLECTION-DATA.                                
4.071C                08  AR70-CACS-REASON           PIC X.                     
4.071C                08  AR70-CACS-USER-ROUTING     PIC X(2).                  
4.071C                08  AR70-CACS-COLLECTOR        PIC X(4).                  
4.071C            07  AR70-ADMIN-HISTORY.                                       
4.071C                08  AR70-REQ-CLOSED-DATE       PIC X(10).                 
4.071C                08  AR70-PIN-CHANGE-DATE       PIC X(10).                 
4.071C                08  AR70-PREV-CRLINE-CHANGE-DATE                          
4.071C                                               PIC X(5).                  
98023G                08  AR70-CRLINE-CHANGE-AMT     PIC X(16).                 
4.071C            07  AR70-MISC-ADMIN-HISTORY.                                  
4.071C                08  AR70-PHONE-CARD-ID         PIC X.                     
4.071D            07  AR70-IP-START-DATE             PIC X(10).                 
4.017D            07  FILLER REDEFINES AR70-IP-START-DATE.                      
4.017D                08 FILLER                      PIC X.                     
4.017D                08  AR70-IP-START-DATE-YMD     PIC X(7).                  
4.071D            07  AR70-IP-EFF-END-DATE           PIC X(10).                 
4.071D            07  FILLER REDEFINES AR70-IP-EFF-END-DATE.                    
4.071D                08 FILLER                      PIC X.                     
4.071D                08 AR70-IP-EFF-END-DATE-YMD    PIC X(7).                  
4.071D            07  AR70-IP-PLANNED-END-DATE       PIC X(10).                 
97220F            07  FILLER REDEFINES AR70-IP-PLANNED-END-DATE.                
97220F                08 FILLER                      PIC X.                     
97220F                08  AR70-IP-PLANNED-END-DATE-YMD                          
97220F                                               PIC X(7).                  
4.071D            07  AR70-IP-CASH-RATE-ANN          PIC X(7).                  
4.071D            07  AR70-IP-CASH-RATE-MONTHLY      PIC X(7).                  
4.071D            07  AR70-IP-CASH-RATE-DAILY        PIC X(9).                  
4.071D            07  AR70-IP-MRCH-RATE-ANN          PIC X(7).                  
4.071D            07  AR70-IP-MRCH-RATE-MONTHLY      PIC X(7).                  
4.071D            07  AR70-IP-MRCH-RATE-DAILY        PIC X(9).                  
4.071D            07  AR70-PP-EXCL-ADD-ON-FLAG       PIC X(3).                  
4.071D            07  AR70-PP-EXCL-MPD-FLAG          PIC X(3).                  
4.071D            07  AR70-PP-CURE-FLAG              PIC X.                     
4.072D            07  AR70-DATE-LAST-RSNCD-CHNG      PIC X(10).                 
4.072G            07  AR70-AT-AUTH-AGAINST-NEW       PIC 9.                     
4.073C            07  AR70-CIMS-PRODUCT-CODE         PIC X(3).                  
95167A            07  AR70-LOST-ACCUM                PIC X(4).                  
95167A            07  AR70-STOLEN-ACCUM              PIC X(4).                  
96271K            07  AR70-TEMP-PLASTIC-IND          PIC 9.                     
95167C            07  AR70-SKIP-PAY-HISTORY          PIC X(12).                 
95167C            07  FILLER REDEFINES AR70-SKIP-PAY-HISTORY.                   
95167C                08  AR70-SP-1-12          PIC X  OCCURS 12 TIMES.         
95314A            07  AR70-LAST-CRDT-BURE-IN         PIC X.                     
95314B            07  AR70-SKIP-ELGB-IN              PIC X.                     
95314B            07  AR70-AUTO-STRT-DT              PIC X(10).                 
95314B            07  FILLER REDEFINES AR70-AUTO-STRT-DT.                       
95314B                08 FILLER                       PIC X.                    
95314B                08 AR70-AUTO-STRT-DT-YMD       PIC X(7).                  
95314B            07  AR70-AUTO-END-DT               PIC X(10).                 
95314B            07  FILLER REDEFINES AR70-AUTO-END-DT.                        
95314B                08 FILLER                       PIC X.                    
95314B                08  AR70-AUTO-END-DT-YMD       PIC X(7).                  
98023G            07  AR70-CASH-CRDT-LINE-AM        PIC X(16).                  
95314C            07  AR70-CASH-LINE-ADJS-CD         PIC X.                     
95314C            07  AR70-CASH-LINE-REVW-DT         PIC X(8).                  
95314D            07  AR70-PLST-DLAY-DAY-CT          PIC 9(2).                  
95314F            07  AR70-MIN-PMNT-DUE-STRT-DT      PIC X(10).                 
95314F            07  FILLER REDEFINES AR70-MIN-PMNT-DUE-STRT-DT.               
95314F                08 FILLER                       PIC X.                    
95314F                08  AR70-MIN-PMNT-STRT-DT-YMD  PIC X(7).                  
95314F            07  AR70-MIN-PMNT-DUE-END-DT       PIC X(10).                 
95314F            07  FILLER REDEFINES AR70-MIN-PMNT-DUE-END-DT.                
95314F                08 FILLER                       PIC X.                    
95314F                08  AR70-MIN-PMNT-END-DT-YMD   PIC X(7).                  
95314F            07  AR70-MIN-PMNT-DUE-OVRR-CD      PIC X.                     
95314F            07  AR70-MIN-PMNT-DUE-RT          PIC X(9).                   
98023G            07  AR70-FIXD-PMNT-FUTR-AM      PIC X(19).                    
95314G            07  AR70-SHDW-LINE-AM           PIC X(19).                    
95314G            07  AR70-SHDW-LINE-EXPR-DT         PIC X(10).                 
95314G            07  AR70-SHDW-LINE-CHNG-DT         PIC X(10).                 
95314G            07  AR70-SHDW-LINE-REVW-DT         PIC X(8).                  
95314J            07  AR70-LS-OVRL-FEE-WAVR-ID       PIC X.                     
95314K            07  AR70-LAST-SKIP-PAY-CD          PIC X.                     
96040A            07  AR70-RSRV-CRDT-LINE-PRCN-RT    PIC X(5).                  
98023G            07  AR70-RSRV-CRDT-LINE-AVLB-AM PIC X(19).                    
96040B            07  AR70-AMEX-AIRF-INSR-CD         PIC X.                     
96040B            07  AR70-AMEX-FATO-ANNV-DT         PIC X(10).                 
96040B            07  AR70-AMEX-BAGG-INSR-CD         PIC X.                     
96089A            07  AR70-USAV-GROP-ID              PIC X.                     
96089A            07  AR70-PREV-USAV-GROP-ID         PIC X.                     
96089A            07  AR70-USAV-GROP-ID-LAST-CHNG-DT PIC X(10).                 
96089A            07  AR70-USAV-OPT-OUT-CD           PIC X.                     
96159C            07  AR70-REGN-CD                   PIC X.                     
96159E            07  AR70-ANNL-CHRG-CASH-ADVN-CT    PIC X(4).                  
96271B            07  AR70-NON-REISSUE-LETTER-DATA   PIC  X(9).                 
96271B            07  FILLER REDEFINES AR70-NON-REISSUE-LETTER-DATA.            
96271B                08  AR70-NON-REISSUE-LETTER-NO PIC  X(4).                 
96271B                08  AR70-NON-REISSUE-LETTER-DATE                          
96271B                                                PIC X(8).                 
96271B                08  AR70-NON-REISSUE-LETTER-TYPE PIC X(1).                
96220A            07  AR70-PYMNT-REAG-REFNO-NR       PIC X(17).                 
96220A            07  AR70-PYMNT-REAG-CCYYMMDD-DT    PIC X(10).                 
96220A            07  AR70-PYMNT-REAG-LAST-YYMM-DT   PIC X(6).                  
96220A            07  AR70-PYMNT-REAG-NEXT-YYMM-DT   PIC X(6).                  
96220B            07  AR70-PRTN-ID                   PIC X(17).                 
96220C            07  AR70-TLP-CLT-ID                PIC X(8).                  
96220C            07  AR70-TLP-CLT-EXPR-DT           PIC X(10).                 
96271C            07  AR70-ACCT-CT                   PIC X(4).                  
96271D            07  AR70-USER-TX                   PIC  X(24).                
96271D            07  FILLER  REDEFINES AR70-USER-TX.                           
96271D                08  AR70-ORGN-ACCT             PIC  X(16).                
96271D                08  AR70-ORGN-ACCT-DT          PIC  X(8).                 
98023G            07  AR70-UNPD-ANNL-FEE-AM       PIC X(15).                    
96271E            07  AR70-UNPD-ANNL-FEE-REB-BON-CD  PIC  X(1).                 
96271F            07  AR70-FLGH-RWRD-CD              PIC  X(1).                 
96271F            07  AR70-PREV-CLT-ID               PIC  X(8).                 
96271F            07  AR70-CLT-CHG-DT                PIC X(10).                 
96271G            07  AR70-PFST-ATTR-SCOR-NR         PIC 9(4).                  
96271G            07  AR70-PFST-CRDT-SCOR-NR         PIC 9(4).                  
98023G            07  AR70-PFST-REVN-PRDC-AM      PIC X(19).                    
98023G            07  AR70-PFST-PRFT-PRDC-AM      PIC X(19).                    
96271G            07  AR70-PFST-CRDT-RSN1-CD         PIC 9(4).                  
96271G            07  AR70-PFST-CRDT-RSN2-CD         PIC 9(4).                  
96271G            07  AR70-PFST-CRDT-RSN3-CD         PIC 9(4).                  
96271G            07  AR70-PFST-SCOR-LAST-DT         PIC 9(9).                  
96271H            07  AR70-ACS-WB-STTS-CD            PIC X.                     
98023G            07  AR70-CAYR-REBT-ERND-AM      PIC X(19).                    
98023G            07  AR70-LAYR-REBT-ERND-AM      PIC X(19).                    
98023G            07  AR70-REBT-EXPR-AM           PIC X(19).                    
96271J            07  AR70-XCSV-INT-CT               PIC X(4).                  
96320A            07  AR70-OTST-CHCK-CT              PIC X(4).                  
96320B            07  AR70-CRRN-ANNL-CASH-RT        PIC X(7).                   
96320B            07  AR70-CRRN-ANNL-MRCH-RT        PIC X(7).                   
96320C            07  AR70-HIGH-NOM-MRCH-APPLIED-RT PIC X(7).                   
96320C            07  AR70-LOW-NOM-MRCH-APPLIED-RT  PIC X(7).                   
96320C            07  AR70-HIGH-NOM-CASH-APPLIED-RT PIC X(7).                   
96320C            07  AR70-LOW-NOM-CASH-APPLIED-RT  PIC X(7).                   
96320D            07  AR70-NO-DELT-CD                PIC X.                     
96320E            07  AR70-E1-DATE                   PIC X(10).                 
97017B            07  AR70-EQTY-ACCT-MTRT-DT         PIC X(10).                 
97017E            07  AR70-SKIP-CHRG-OFF-DAYS-NR     PIC X(4).                  
97094A            07  AR70-LAST-STMT-RELJUL          PIC X(4).                  
97094B            07  AR70-USAV-CTD-TOTL-AM       PIC X(19).                    
97094C            07  AR70-NO-FEES-CD                PIC X.                     
98023G            07  AR70-CTD-AUTH-AM            PIC X(19).                    
97157A            07  AR70-SUB-ACCT-CD               PIC X(01).                 
97157A            07  AR70-CMPN-ID                   PIC X(08).                 
97157B            07  AR70-ACCT-MRKT-STRT-NM         PIC X(8).                  
97157B            07  AR70-ACCT-MRKT-PRCS-CD         PIC X.                     
97157B            07  AR70-ACCT-MRKT-STRT-DT         PIC X(10).                 
97157B            07  AR70-REIS-STRT-NM              PIC X(8).                  
97157B            07  AR70-REIS-PRCS-CD              PIC X.                     
97157B            07  AR70-REIS-STRT-DT              PIC X(10).                 
97157B            07  AR70-PRMR-PLST-STRT-NM         PIC X(8).                  
97157B            07  AR70-PLST-PRCS-CD              PIC X.                     
97157B            07  AR70-PLST-STRT-DT              PIC X(10).                 
97157B            07  AR70-CARD-ISSN-STRT-NM         PIC X(8).                  
97157B            07  AR70-CARD-ISSN-PRCS-CD         PIC X.                     
97157B            07  AR70-CARD-ISSN-STRT-DT         PIC X(10).                 
97157C            07  AR70-TMPR-AUTO-PAY-AM PIC X(15).                          
97157D            07  AR70-PRCN-STRT-UNLC-DT-RLLC-CD PIC X.                     
97157E            07  AR70-SCOR-FLDS.                                           
97157E                08  AR70-SCOR-ONE-NR           PIC X(8).                  
97157E                08  AR70-SCOR-ONE-DT           PIC X(10).                 
97157E                08  AR70-SCOR-ONE-RESN-ONE-NR  PIC X(8).                  
97157E                08  AR70-SCOR-ONE-RESN-TWO-NR  PIC X(8).                  
97157E                08  AR70-SCOR-ONE-RESN-THRE-NR PIC X(8).                  
97157E                08  AR70-SCOR-TWO-NR           PIC X(8).                  
97157E                08  AR70-SCOR-TWO-DT           PIC X(10).                 
97157E                08  AR70-SCOR-TWO-RESN-ONE-NR  PIC X(8).                  
97157E                08  AR70-SCOR-TWO-RESN-TWO-NR  PIC X(8).                  
97157E                08  AR70-SCOR-TWO-RESN-THRE-NR PIC X(8).                  
97157E                08  AR70-SCOR-THRE-NR          PIC X(8).                  
97157E                08  AR70-SCOR-THRE-DT          PIC X(10).                 
97157E                08  AR70-SCOR-FOUR-NR          PIC X(8).                  
97157E                08  AR70-SCOR-FOUR-DT          PIC X(10).                 
97157E                08  AR70-SCOR-FIVE-NR          PIC X(8).                  
97157E                08  AR70-SCOR-FIVE-DT          PIC X(10).                 
97157E                08  AR70-SCOR-SIX-NR           PIC X(8).                  
97157E                08  AR70-SCOR-SIX-DT           PIC X(10).                 
97157E                08  AR70-SCOR-SIX-RESN-ONE-NR  PIC X(8).                  
97157E                08  AR70-SCOR-SIX-RESN-TWO-NR  PIC X(8).                  
97157E                08  AR70-SCOR-SIX-RESN-THRE-NR PIC X(8).                  
97157E                08  AR70-SCOR-SEVN-NR          PIC X(8).                  
97157E                08  AR70-SCOR-SEVN-DT          PIC X(10).                 
97157E                08  AR70-SCOR-SEVN-RESN-ONE-NR PIC X(8).                  
97157E                08  AR70-SCOR-SEVN-RESN-TWO-NR PIC X(8).                  
97157E                08  AR70-SCOR-SEVN-RESN-THRE-NR                           
97157E                                                PIC X(8).                 
97157E                08  AR70-SCOR-EGHT-NR          PIC X(8).                  
97157E                08  AR70-SCOR-EGHT-DT          PIC X(10).                 
97157E                08  AR70-SCOR-NINE-NR          PIC X(8).                  
97157E                08  AR70-SCOR-NINE-DT          PIC X(10).                 
97157E                08  AR70-SCOR-TEN-NR           PIC X(8).                  
97157E                08  AR70-SCOR-TEN-DT           PIC X(10).                 
97157E                08  AR70-BHVR-SCOR-PRTF-ID     PIC X(6).                  
97157F            07  AR70-PFST-REVN-RSN1-CD         PIC 9(4).                  
97157F            07  AR70-PFST-REVN-RSN2-CD         PIC 9(4).                  
97157F            07  AR70-PFST-REVN-RSN3-CD         PIC 9(4).                  
97157F            07  AR70-PFST-ATTR-RSN1-CD         PIC 9(4).                  
97157F            07  AR70-PFST-ATTR-RSN2-CD         PIC 9(4).                  
97157F            07  AR70-PFST-ATTR-RSN3-CD         PIC 9(4).                  
97220C            07  AR70-ANNV-CASH-INTR-RT        PIC X(7).                   
97220C            07  AR70-ANNV-MDSE-INTR-RT        PIC X(7).                   
97220D            07  AR70-ACTV-DSPT-CT              PIC X(4).                  
97220E            07  AR70-JONT-INSR-CD              PIC X.                     
97220F            07  AR70-TRMN-INCN-PRCN-CD         PIC X.                     
97220G            07  AR70-ALL-DVRT-FEES-CD.                                    
97220G                08  AR70-DVRT-LATE-FEES-CD     PIC X.                     
97220G                08  AR70-DVRT-CASH-ITEM-FEES-CD PIC X.                    
97220G                08  AR70-DVRT-OVER-LIMT-FEES-CD PIC X.                    
97220G                08  AR70-DVRT-STMT-FEES-CD     PIC X.                     
97220G                08  AR70-DVRT-MRCH-ITEM-FEES-CD PIC X.                    
97220G                08  AR70-DVRT-INTR-MTHD-FEES-CD PIC X.                    
97220G                08  AR70-DVRT-CRDT-LIFE-FEES-CD PIC X.                    
97220A            07  AR70-OTST-PLST-CT              PIC X(4).                  
97318C            07  AR70-FAMILY-CARD-DATA.                                    
97318C                08  AR70-ACCT-GROP-ID          PIC X(13).                 
97318C                08  AR70-GROP-MMBR-TYPE-CD     PIC X.                     
97318C                08  AR70-DPND-STRT-ID          PIC X(4).                  
97269B            07  AR70-ALWY-REFR-CD              PIC X.                     
97269C            07  AR70-STMT-FORM-ID              PIC X(3).                  
97269C            07  AR70-STMT-FRMT-ID              PIC X(3).                  
97269C            07  AR70-STMT-DSCL-ID              PIC X(2).                  
97318A            07  AR70-ATPY-BAL-RT            PIC X(8).                     
97318A            07  AR70-ATPY-CLNG-AM           PIC X(15).                    
97318A            07  AR70-DDA-NM                    PIC X(22).                 
98023F            07  AR70-INTL-VISA-PHONE-CD        PIC X(1).                  
98023F            07  AR70-INTL-VISA-PHONE-DT        PIC X(10).                 
98023D            07  AR70-UPC-19-NR                 PIC X(4).                  
98023D            07  AR70-UPC-20-NR                 PIC X(10).                 
98023D            07  AR70-UPC-21-AM              PIC X(19).                    
98023D            07  AR70-UPC-22-NR                PIC X(16).                  
98023C            07  AR70-REBATE-PENDG-IND          PIC X.                     
98023E            07  AR70-MTHD-OVRR-SEGS-NR         PIC X(4).                  
98023E            07  AR70-UD-PRICING-CONTROLS-ADD.                             
98023E                08  AR70-UPC-13                PIC X(2).                  
98023E                08  AR70-UPC-14                PIC X(2).                  
98023E                08  AR70-UPC-15                PIC X(2).                  
98023E                08  AR70-UPC-16                PIC X(2).                  
98023E                08  AR70-UPC-17                PIC X(2).                  
98023H            07  AR70-FCLT-GRAD-NR              PIC 9.                     
98023H            07  AR70-FCLT-GRAD-CHNG-DT         PIC X(10).                 
98023H            07  AR70-INT-IN-SUSP-AMT        PIC X(19).                    
98023H            07  AR70-INT-BEF-SUSP-AMT       PIC X(19).                    
98023H            07  AR70-PY-INT-IN-SUSP-AMT     PIC X(19).                    
98023I            07  AR70-LTR-CATGRY-GRP-CD.                                   
98023I                08  AR70-LTR-CATGRY-GRP-A-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-B-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-C-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-D-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-E-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-F-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-G-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-H-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-I-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-J-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-K-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-L-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-M-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-N-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-O-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-P-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-Q-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-T-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-U-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-V-CD   PIC X.                     
98023I                08  AR70-LTR-CATGRY-GRP-Z-CD   PIC X.                     
98023J            07  AR70-ANNL-FEE-WAVR-AM       PIC X(15).                    
98023J            07  AR70-ANNL-FEE-WAVR-DT          PIC X(10).                 
98023J            07  AR70-ANNL-FEE-WAVR-CD          PIC X(2).                  
98023J            07  AR70-LAST-ANNL-FEE-WAVR-CD     PIC X(2).                  
98086A            07  AR70-TLR-CLT-ID                PIC X(8).                  
98086A            07  AR70-TLR-CLT-EXPR-DT           PIC X(10).                 
98086A            07  AR70-PREV-CLT-TLR-ID           PIC X(8).                  
98086A            07  AR70-CLT-TLR-CHG-DT            PIC X(10).                 
98086B            07  AR70-TMPR-CRDT-LINE-STRT-DT    PIC X(10).                 
98086B            07  AR70-TMPR-CRDT-LINE-END-DT     PIC X(10).                 
98086B            07  AR70-TMPR-CRDT-LINE-AM        PIC X(18).                  
98086B            07  AR70-TMPR-CRDT-LINE-CD         PIC XXX.                   
98086C            07  AR70-PDAY-INTR-IN-SSPN-AM   PIC X(19).                    
98086C            07  AR70-PDAY-INTR-BEFR-SSPN-AM PIC X(19).                    
98163B            07  AR70-CTD-CASH-MEMO-AM       PIC X(19).                    
98163B            07  AR70-CNTL-ACCT-EXTR-STAT-CD    PIC X.                     
98163B            07  AR70-FLEX-BLLN-CD              PIC X.                     
98219A            07  AR70-PRFT-SCR1-CD              PIC X(3).                  
98219A            07  AR70-PRFT-SCR2-CD              PIC X(3).                  
98219A            07  AR70-PRFT-SCR3-CD              PIC X(3).                  
98219A            07  AR70-PRFT-SCR4-CD              PIC X(3).                  
98268B            07  AR70-TRNS-PYMT-DUE-CT          PIC X(4).                  
98268B            07  AR70-TRNS-PYFF-EXCP-CT         PIC X(4).                  
98268B            07  AR70-LAST-TRNS-PYFF-EXCP-CT    PIC X(4).                  
98268B            07  AR70-PREV-TRNS-PYFF-EXCP-CT    PIC X(4).                  
98268B            07  AR70-LAST-TRNS-PYMT-DUE-CT     PIC X(4).                  
98268B            07  AR70-PREV-TRNS-PYMT-DUE-CT     PIC X(4).                  
98268C            07  AR70-OTST-AUTH-BAL-AM       PIC X(19).                    
99022A            07  AR70-SKIP-PMNT-PRTF-ID         PIC X(6).                  
99022A            07  AR70-SKIP-PMNT-OVRD-PRTF-ID    PIC X(6).                  
99022A            07  AR70-SKIP-PMNT-OVRD-PRTF-DT    PIC X(10).                 
99022A            07  AR70-SKIP-PMNT-OFFR-NR         PIC X(4).                  
99022A            07  AR70-SKIP-PMNT-ACCP-NR         PIC X(4).                  
99022B            07  AR70-EPMT-PART-IND-ID          PIC X.                     
99022B            07  AR70-EPMT-UNIQ-ID              PIC 9(10).                 
99022B            07  AR70-EPMT-STRT-DT              PIC X(10).                 
99022B            07  AR70-EPMT-END-DT               PIC X(10).                 
99022H            07  AR70-PORTFOLIO-NO              PIC X(6).                  
99022I            07  AR70-ALL-TRANSFER-FLAG         PIC X.                     
99099A            07  AR70-CTD-PRTN-PRCH-AM       PIC X(19).                    
99099C            07  AR70-MON-RJCT-CD               PIC X.                     
99162B            07  AR70-NON-AUTH-ACTV-ACCT-CD     PIC X.                     
99162C            07  AR70-ACCT-CURED-CD             PIC X.                     
99218B            07  AR70-DPST-CRDT-LINE-CHG-DT     PIC X(8).                  
99218C            07  AR70-RVRS-ANNL-FEE-CD          PIC X.                     
99218C            07  AR70-RVRS-ANNL-FEE-DT          PIC X(10).                 
99218G            07  AR70-REIM-BACK-DATE-CD         PIC 9.                     
99218G            07  AR70-STMT-LATE-DAYS-NR         PIC 99.                    
99218H            07  AR70-ACS-AUTH-OVRR-STRT-ID     PIC X(2).                  
99218H            07  AR70-ACS-AUTH-OVRR-STRT-DT     PIC X(10).                 
99281A            07  AR70-REIS-MSSG-ID              PIC 9(3).                  
99281A            07  AR70-WRBL-MSSG-ID              PIC 9(3).                  
99281A            07  AR70-AVLB-FUND-MSSG-ID         PIC 9(3).                  
00084B            07  AR70-SSPN-CYCL-CD              PIC 99.                    
00084D            07  AR70-TLF-TABL-ID               PIC X(8).                  
00084G            07  AR70-TLP-TQ-TABL-ID            PIC X(8).                  
00084H            07  AR70-PYMN-DUE-DT               PIC X(10).                 
00287A            07  AR70-NEWCRD-FLAG-RETN-DT       PIC X(10).                 
00287A            07  AR70-NEXT-CYCL-DT              PIC X(10).                 
00287A            07  AR70-LAST-MON-TRAN-CD          PIC X(4).                  
00287A            07  AR70-LAST-EMBS-ADDR-CHNG-DT    PIC X(10).                 
00287A            07  AR70-DBT-RTFC-NTFC-MNTH-CT     PIC X(2).                  
00287A            07  AR70-DBT-RTFC-GRAC-MNTH-CT     PIC X(2).                  
00287A            07  AR70-DBT-RTFC-LAST-NTFC-DT     PIC X(10).                 
00287A            07  AR70-OVRL-NMN-ENTR-TYPE-ID     PIC X.                     
00287D            07  AR70-PRCN-FLDS.                                           
00287D                08 AR70-PRCN-STRT-CT           PIC X(4).                  
00287D                08 AR70-PRCN-STRT-RSET-IN      PIC X.                     
00287A            07  AR70-NMN-ENTR-ID               PIC X.                     
00287E            07  AR70-DALY-INTR-CALC-MTHD-CD    PIC 9.                     
01026A            07  AR70-CC-FLET-RSTR-CD           PIC X.                     
01026A            07  AR70-CC-FLET-PRMP-CD           PIC X.                     
01026C            07  AR70-CR-LIFE-STATUS-DT         PIC X(10).                 
01026G            07  AR70-SCOR-FLDS-TWO.                                       
01026G                08  AR70-SCOR-ONE-RESN-FOUR-NR PIC X(8).                  
01026G                08  AR70-SCOR-TWO-RESN-FOUR-NR PIC X(8).                  
01026G                08  AR70-SCOR-THRE-RESN-ONE-NR PIC X(8).                  
01026G                08  AR70-SCOR-THRE-RESN-TWO-NR PIC X(8).                  
01026G                08  AR70-SCOR-THRE-RESN-THRE-NR                           
01026G                                                PIC X(8).                 
01026G                08  AR70-SCOR-THRE-RESN-FOUR-NR                           
01026G                                                PIC X(8).                 
01026G                08  AR70-SCOR-FOUR-RESN-ONE-NR PIC X(8).                  
01026G                08  AR70-SCOR-FOUR-RESN-TWO-NR PIC X(8).                  
01026G                08  AR70-SCOR-FOUR-RESN-THRE-NR                           
01026G                                                PIC X(8).                 
01026G                08  AR70-SCOR-FOUR-RESN-FOUR-NR                           
01026G                                                PIC X(8).                 
01026G                08  AR70-SCOR-FIVE-RESN-ONE-NR PIC X(8).                  
01026G                08  AR70-SCOR-FIVE-RESN-TWO-NR PIC X(8).                  
01026G                08  AR70-SCOR-FIVE-RESN-THRE-NR                           
01026G                                                PIC X(8).                 
01026G                08  AR70-SCOR-FIVE-RESN-FOUR-NR                           
01026G                                                PIC X(8).                 
01026G                08  AR70-SCOR-SIX-RESN-FOUR-NR PIC X(8).                  
01026G                08  AR70-SCOR-SEVN-RESN-FOUR-NR                           
01026G                                                PIC X(8).                 
01026G                08  AR70-SCOR-EGHT-RESN-ONE-NR PIC X(8).                  
01026G                08  AR70-SCOR-EGHT-RESN-TWO-NR PIC X(8).                  
01026G                08  AR70-SCOR-EGHT-RESN-THRE-NR                           
01026G                                                PIC X(8).                 
01026G                08  AR70-SCOR-EGHT-RESN-FOUR-NR                           
01026G                                                PIC X(8).                 
01026G                08  AR70-SCOR-NINE-RESN-ONE-NR PIC X(8).                  
01026G                08  AR70-SCOR-NINE-RESN-TWO-NR PIC X(8).                  
01026G                08  AR70-SCOR-NINE-RESN-THRE-NR                           
01026G                                                PIC X(8).                 
01026G                08  AR70-SCOR-NINE-RESN-FOUR-NR                           
01026G                                                PIC X(8).                 
01026G                08  AR70-SCOR-TEN-RESN-ONE-NR  PIC X(8).                  
01026G                08  AR70-SCOR-TEN-RESN-TWO-NR  PIC X(8).                  
01026G                08  AR70-SCOR-TEN-RESN-THRE-NR PIC X(8).                  
01026G                08  AR70-SCOR-TEN-RESN-FOUR-NR PIC X(8).                  
BASK              07  AR70-SCOR-FLDS-TWO-R REDEFINES AR70-SCOR-FLDS-TWO.        
BASK                  08  AR70-SCOR-1TO10            PIC X(8)                   
BASK                      OCCURS 28 TIMES.                                      
01096A            07  AR70-LAST-LTTR-ID              PIC X(4).                  
01096A            07  AR70-LAST-LTTR-DT              PIC X(10).                 
01096A            07  AR70-CRRS-ADDR-CD              PIC X(3).                  
01096B            07  AR70-MLP-CD                    PIC X.                     
01222A            07  AR70-AVLB-CRDT-AMT             PIC X(19).                 
01285A            07  AR70-EBP-STOP-PAPR-DT          PIC X(10).                 
01285E            07  AR70-GRCE-NGRC-OVRD-CD         PIC X(1).                  
02095A            07  FILLER         OCCURS 6 TIMES.                            
02095A                08  AR70-CRDT-PRTC-PRMM-DT     PIC X(8).                  
02095B            07  AR70-ACS-AVLB-FUND-PRTF-ID     PIC X(4).                  
02095B            07  AR70-ACS-AVLB-FUND-CAT-DT      PIC X(10).                 
02095C            07  AR70-MLTP-LIKE-UNIQ-CD         PIC X.                     
02095C            07  AR70-MLTP-UNIQ-OVRR-CD         PIC X.                     
02095C            07  AR70-SSR-IN                    PIC X.                     
02095C            07  AR70-CRBR-LAST-RPRT-ID         PIC X(19).                 
02095C            07  AR70-LOST-STLN-PI-CT           PIC X(4).                  
02235A            07  AR70-NORM-RATES.                                          
02235A                 08  AR70-CALC-NORM-CASH-RT    PIC X(9).                  
02235A                 08  AR70-CALC-NORM-MRCH-RT    PIC X(9).                  
02235A                 08  AR70-CALC-NORM-CASH-MNTH-RT                          
02235A                                                PIC X(7).                 
02235A                 08  AR70-CALC-NORM-MRCH-MNTH-RT                          
02235A                                               PIC X(7).                  
02235A                 08  AR70-CALC-NORM-CASH-ANN-RT                           
02235A                                               PIC X(7).                  
02235A                 08  AR70-CALC-NORM-MRCH-ANN-RT                           
02235A                                               PIC X(7).                  
02235A            07  AR70-PAYMENT-DUE-DAYS-NR       PIC X(4).                  
03038C            07  AR70-HRSK-PRMN-CLLC-ID         PIC X(4).                  
03094A            07  AR70-LAST-TRMS-CHNG-NTFC-DT    PIC X(10).                 
03094A            07  AR70-PREV-TRMS-CHNG-NTFC-DT    PIC X(10).                 
03276C            07  AR70-PRMT-PRCN-VOID-IN         PIC X(01).                 
03276D            07  AR70-GRND-FTHR-WAVR-CD         PIC X.                     
04037C            07  AR70-CRRN-ARBT.                                           
04037C                08  AR70-CRRN-ARBT-CD          PIC X(2).                  
04037C                08  AR70-CRRN-ARBT-NTFC-DT     PIC X(10).                 
04037C                08  AR70-CRRN-ARBT-EFFC-DT     PIC X(10).                 
04037C            07  AR70-PREV-ARBT.                                           
04037C                08  AR70-PREV-ARBT-CD          PIC X(2).                  
04037C                08  AR70-PREV-ARBT-NTFC-DT     PIC X(10).                 
04037C                08  AR70-PREV-ARBT-EFFC-DT     PIC X(10).                 
04163A            07  AR70-MISC-FIELD-13-TX.                                    
04163A                08  AR70-MISC-13-PSTN-1-10-TX  PIC X(10).                 
04163A                08  AR70-MISC-13-PSTN-11-15-TX PIC X(5).                  
04163A                08  AR70-MISC-13-PSTN-16-20-TX PIC X(5).                  
04163A                08  AR70-MISC-13-PSTN-21-25-TX PIC X(5).                  
04163A                08  AR70-MISC-13-PSTN-26-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-27-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-28-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-29-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-30-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-31-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-32-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-33-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-34-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-35-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-36-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-37-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-38-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-39-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-40-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-41-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-42-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-43-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-44-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-45-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-46-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-47-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-48-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-49-TX    PIC X(1).                  
04163A                08  AR70-MISC-13-PSTN-50-TX    PIC X(1).                  
04226C            07  AR70-RULE-COLLECTION-DATA.                                
04226C                08    AR70-RULE-DIALER-ID      PIC X(6).                  
04226C                08    FILLER REDEFINES AR70-RULE-DIALER-ID.               
04226C                      09    AR70-DIALER-SITE-ID                           
04226C                                                PIC X.                    
04226C                      09    FILLER              PIC X(5).                 
04226C                08  AR70-RULE-NEXT-DAY-1-CT    PIC X(6).                  
04226C                08  AR70-RULE-NEXT-DAY-2-CT    PIC X(6).                  
04226E            07  AR70-FUND-DMM-OVRD-ID          PIC X(08).                 
04226F            07  AR70-PRCN-ST-OF-ORGN-CD        PIC X(2).                  
04275A            07  AR70-MECH-PULL-PRCS-RESN-CD    PIC X(4).                  
04275A            07  AR70-LAST-PRCN-PRTF-CD         PIC  9(4).                 
04275A            07  AR70-LAST-PRCN-PRTF-CHNG-DT    PIC X(10).                 
04275D            07  AR70-HOLD-CYCL-CD.                                        
04275D                08  AR70-HOLD-CYCL-CD-99       PIC 99.                    
05035A            07  AR70-FEE-MDSE-INTR-BRNG-AM                                
05035A                                            PIC X(19).                    
05035A            07  AR70-FEE-CASH-INTR-BRNG-AM                                
05035A                                            PIC X(19).                    
05035A            07  AR70-POB-CMPND-CD              PIC X(2).                  
05035B            07  AR70-SCRX-AUTH-OVRR-CRDT-CD    PIC X.                     
05035B            07  AR70-SCRX-AUTH-OVRR-FRD-CD     PIC X.                     
05035B            07  AR70-SCRX-AUTH-OVRR-BHVR-CD    PIC X.                     
05035B            07  AR70-SCRX-AUTH-OVRR-RISK-CD    PIC X.                     
05035B            07  AR70-SCRX-AUTH-OVRR-INCR-CD    PIC X.                     
05035B            07  AR70-SCRX-AUTH-OVRR-DECR-CD    PIC X.                     
05035B            07  AR70-SCRX-AUTH-OVRR-OVLM-CD    PIC X.                     
05035B            07  AR70-SCRX-AUTH-OVRR-CRDT-DT    PIC X(10).                 
05035B            07  AR70-SCRX-AUTH-OVRR-FRD-DT     PIC X(10).                 
05035B            07  AR70-SCRX-AUTH-OVRR-BHVR-DT    PIC X(10).                 
05035B            07  AR70-SCRX-AUTH-OVRR-RISK-DT    PIC X(10).                 
05035B            07  AR70-SCRX-AUTH-OVRR-INCR-DT    PIC X(10).                 
05035B            07  AR70-SCRX-AUTH-OVRR-DECR-DT    PIC X(10).                 
05035B            07  AR70-SCRX-AUTH-OVRR-OVLM-DT    PIC X(10).                 
05035B            07  AR70-BHVR-SCOR-DT              PIC X(10).                 
05061A            07  AR70-CRDT-BUR-ALRT-CD          PIC X.                     
05161A            07  AR70-DBT-ACTV-ID               PIC X.                     
05161B            07  AR70-RULS-RESS-PRTF-ID         PIC 9(4).                  
05161B            07  AR70-RULS-RESS-OVRR-PRTF-ID    PIC 9(4).                  
05161B            07  AR70-RULS-RESS-OVRR-PRTF-DT    PIC X(10).                 
05224B            07  AR70-LATE-FEE-TIRD-BAL-AM  PIC X(19).                     
05273A            07  AR70-ALTR-STMT-FRMT-CD         PIC X(01).                 
05273A            07  AR70-PRMR-ACCT-CD              PIC X(01).                 
05273A            07  AR70-PRMR-ACCT-CHNG-DT         PIC X(10).                 
06034B            07  AR70-DLNQ-STRT-OVRR-DT         PIC X(10).                 
06034A            07  FILLER  OCCURS 6 TIMES.                                   
06034A                08  AR70-CLI-FREE-DAYS-RMNN-CT PIC X(4).                  
06034C            07  AR70-PRJC-CARD-SQNC-NR         PIC X(4).                  
06097A            07  AR70-DFLT-BAL-ADMN-GRP.                                   
06097A                10  AR70-DFLT-PLAN-ID          PIC X(8).                  
06097A                10  AR70-PLAN-LOCK-BEGN-DT     PIC X(10).                 
06097A                10  AR70-PLAN-LOCK-END-DT      PIC X(10).                 
06097B            07  AR70-CNSM-ACCT-CLSD-DT         PIC X(10).                 
06216A            07  AR70-CRDT-LINE-CHNG-DT         PIC X(10).                 
06216A            07  AR70-PREV-CRDT-LINE-CHNG-DT    PIC X(10).                 
06286B            07  AR70-CRDT-BUR-BKCY-DT          PIC X(10).                 
07026B            07  AR70-QUAL-FUTR-LATE-FEE-CD     PIC X.                     
07026C            07  AR70-PREV-STTS-RESN-CD         PIC 99.                    
07285A            07  AR70-NO-MMB-LEVL-CT            PIC X(10).                 
08025B            07  AR70-STRT-REVW-IN              PIC X.                     
08025B            07  AR70-CYCL-PRCN-STRT-ID         PIC X(8).                  
08025B            07  AR70-CYCL-PRCN-PORT-ID         PIC 9(4).                  
08025B            07  AR70-PORT-REVW-IN              PIC X.                     
08025B            07  AR70-PRCN-REPOST-IN            PIC X.                     
08025C            07  AR70-PRMT-ITRO-RATE.                                      
08025C                10 AR70-PRMT-MRCH-ANNL-ITRO-RT                            
08025C                                               PIC X(7).                  
08025C                10 AR70-PRMT-CASH-ANNL-ITRO-RT                            
08025C                                               PIC X(7).                  
08025C            07  AR70-PRMT-RGLR-RATE.                                      
08025C                10 AR70-PRMT-MRCH-ANNL-RGLR-RT                            
08025C                                               PIC X(7).                  
08025C                10 AR70-PRMT-CASH-ANNL-RGLR-RT                            
08025C                                               PIC X(7).                  
08025C            07  AR70-PLAN-RATE.                                           
08025C                10 AR70-PLAN-MRCH-ANNL-RGLR-RT                            
08025C                                               PIC X(7).                  
08025C                10 AR70-PLAN-CASH-ANNL-RGLR-RT                            
08025C                                               PIC X(7).                  
08025F            07  AR70HD-1098-YTD-INTR-THRD-AM                              
08025F                                            PIC X(19).                    
08025F            07  AR70HD-1098-YTD-INTR-TOTL-AM                              
08025F                                            PIC X(19).                    
08025F            07  AR70HD-1098-PREV-INTR-THRD-AM                             
08025F                                            PIC X(19).                    
08025F            07  AR70HD-1098-PREV-INTR-TOTL-AM                             
08025F                                            PIC X(19).                    
08095A            07  AR70-CLLT-RELS-IN          PIC X.                         
08095B            07  AR70-CMBN-LTV-RT           PIC X(4).                      
08095B            07  AR70-DRAW-PERD-END-DT      PIC X(10).                     
08095B            07  AR70-CLSN-CSTS-AM          PIC X(15).                     
08193A            07  AR70-AVOD-FINC-CHRG-AM     PIC X(19).                     
08193B            07  AR70-ASSC-PRDT-TYPE-CD     PIC X(3).                      
08277A            07  AR70-HOME-EQTY-CHNG-DT     PIC X(10).                     
08277A            07  AR70-DCLN-AVLB-CRDT-OPTN-CD                               
08277A                                            PIC X(1).                     
08277A            07  AR70-CLSN-CSTS-BLLD-DT     PIC X(10).                     
08277A            07  AR70-ERLY-TRMN-FEE-IN      PIC X(1).                      
08277A            07  AR70-LFTM-CASH-AND-MRCH-AM PIC X(19).                     
08277C            07  AR70-FLIP-TRAN-SSPN-ST-CD  PIC X(1).                      
08277C            07  AR70-TNSLT-XFER-CD         PIC X(1).                      
09023A            07  FILLER  OCCURS 6 TIMES.                                   
09023A                08  AR70-CLI-CNCL-DT       PIC X(8).                      
09023A                08  AR70-CLI-CNCL-RESN-CD  PIC X.                         
09023A                08  AR70-CLI-RNST-DT       PIC X(8).                      
09023A                08  AR70-CLI-RFND-CD       PIC X.                         
09023A                08  AR70LS-CLI-STTS-CD     PIC X.                         
09023A                08  AR70PS-CLI-STTS-CD     PIC X.                         
09023B            07  AR70-07-DAY-PYMT-CT        PIC 99.                        
09023B            07  AR70-15-DAY-PYMT-CT        PIC 99.                        
09107A            07  AR70-CRD-BUR-DROP-IN       PIC X.                         
09107A            07  AR70-CRD-BUR-DROP-AM       PIC X(19).                     
09107A            07  AR70-CRD-BUR-DROP-DT       PIC X(10).                     
09205A            07  AR70BPS-RULS-DATA-1-AM     PIC X(17).                     
09205A            07  AR70BPS-RULS-DATA-2-AM     PIC X(17).                     
09205A            07  AR70BPS-RULS-DATA-3-AM     PIC X(17).                     
09205A            07  AR70BPS-RULS-DATA-4-AM     PIC X(17).                     
09205A            07  AR70BPS-1-RULS-DATA-1-AM   PIC X(17).                     
09205A            07  AR70BPS-1-RULS-DATA-2-AM   PIC X(17).                     
09205A            07  AR70BPS-1-RULS-DATA-3-AM   PIC X(17).                     
09205A            07  AR70BPS-1-RULS-DATA-4-AM   PIC X(17).                     
09205A            07  AR70-RULS-DATA-1-CD        PIC X.                         
09205B            07  AR70-ATPY-ENRL-TYPE-CD     PIC X.                         
09289B            07  AR70-1STY-MXFE-ALLW-AM     PIC X(19).                     
10022L            07  AR70-RECOVERY-CD           PIC 9(2).                      
4.068A                                                                          
00287A        06  AR70-CUSTOMER-DATA-SEGMENT OCCURS 1 TIMES.                    
MCR   ***                       OCCURS 0 TO 1 TIMES                             
MCR   ***                        DEPENDING ON AR70-NO-CUSTOMER-SEGS.            
0287A            07  AR70-NAME-ADDR-SEGMENT.                                    
00287A                08  AR70-PRINCIPAL-DATA-NMDSREC.                          
00287A                    09  AR70-PRINCIPAL-NAME.                              
00287A                        10  AR70-SHORT-NAME.                              
00287A                            11  AR70-NAME-CHAR-1 PIC X.                   
00287A                            11  FILLER          PIC X(9).                 
00287A                        10  FILLER              PIC X(16).                
00287A                    09  AR70-SPOUSE-NAME       PIC X(26).                 
00287A                    09  AR70-ADDR-LINE-1       PIC X(26).                 
00287A                    09  AR70-ADDR-LINE-2       PIC X(26).                 
00287A                    09  AR70-CITY-STATE-LINE.                             
00287A                        10  AR70-CITY          PIC X(18).                 
00287A                        10  FILLER              PIC X.                    
00287A                        10  AR70-STATE         PIC X(2).                  
00287A                08  AR70-ZIP-CODE-ALPHA.                                  
00287A                    09  AR70-ZIP-CODE          PIC X(10).                 
00287A                08  AR70-NUMERIC-STATE         PIC X(4).                  
04226B                08  AR70-DELIVERY-POINT        PIC X(2).                  
00287A            07  AR70-PRIMARY-DATA.                                        
00287A                08  AR70-PD-PREFIX             PIC X(4).                  
00287A                08  AR70-PD-SUFFIX             PIC X(4).                  
00287A                08  AR70-PD-ADDRESS-DATA.                                 
00287A                    09  AR70-PD-ADDRESS-FORMAT PIC X(2).                  
00287A                    09  AR70-PRIM-DATA-NMDSREC.                           
00287A                        10  AR70-PD-ADDR-LINE-3 PIC X(26).                
00287A                        10  AR70-PD-COUNTY     PIC X(18).                 
00287A            07  AR70-PD-POSTCODE.                                         
00287A                08  AR70-PD-POST-FIRST-5-A.                               
00287A                    09  AR70-PD-FIRST-5 PIC 9(5).                         
00287A                08  AR70-PD-POST-LAST-5.                                  
00287A                    09  AR70-PD-DASH           PIC X.                     
00287A                    09  AR70-PD-POST-LAST-4-A.                            
00287A                        10  AR70-PD-POST-LAST-4 PIC 9(4).                 
00287A            07  AR70-SECONDARY-DATA.                                      
00287A                08  AR70-SD-PREFIX             PIC X(4).                  
00287A                08  AR70-SD-SUFFIX             PIC X(4).                  
00287A            07  AR70-EXTRA-PRSNAL-DATA.                                   
00287A                08  AR70-EP-DATA-NMDSREC.                                 
00287A                    09  AR70-SEX-CODE          PIC X.                     
00287A                    09  AR70-SOC-SECURITY-NO   PIC X(10).                 
00287A                    09  AR70-TELEPHONE-NUMBER                             
00287A                                               PIC X(12).                 
00287A                    09  AR70-SECOND-TELEPHONE-NUMBER                      
00287A                                                PIC X(12).                
00287A                    09  AR70-HOME-PHONE-FORMAT PIC X(5).                  
00287A                    09  AR70-BUS-PHONE-FORMAT  PIC X(5).                  
00287A                    09  AR70-MOTHERS-MAIDEN-NAME PIC X(8).                
00287A                    09  AR70-SECONDARY-SOC-SEC-NO                         
00287A                                                PIC X(10).                
00287A                    09  AR70-DATE-LAST-ADDR-CHANGE                        
00287A                                                PIC X(8).                 
00287A                    09  AR70-NAME-ADDR-CHG     PIC X(2).                  
00287A            07  AR70-ADDRESS-FLAG              PIC X.                     
00287A            07  AR70-HOME-PHONE-FLAG           PIC X.                     
00287A            07  AR70-BUSINESS-PHONE-FLAG       PIC X.                     
00287A            07  AR70-DECEASED-FLAG             PIC X.                     
00287A            07  AR70-SOLICITATION-FLAG         PIC X.                     
00287A            07  AR70-EMPL-ACCT-CD              PIC X.                     
00287A            07  AR70-ALT-CUSTOMER-NO           PIC X(23).                 
00287A            07  AR70-DATE-OF-BIRTH             PIC X(10).                 
00287A            07  AR70-SECONDARY-DATE-OF-BIRTH   PIC X(10).                 
11287B            07  AR70-FIXD-MPD-USAG-CD          PIC X(2).                  
11287B            07  AR70-MPW-APR-OVRR-USAG-CD      PIC X(2).                  
11287B            07  AR70-MPW-APR-OVRR-USAG-DT      PIC X(10).                 
11287B            07  AR70-FIX-PAY-GRP               OCCURS 4 TIMES.            
11287B                08  AR70-FIXD-MPD-OVRR-AM                                 
11287B                                             PIC X(19).                   
11287B                08  AR70-FIXD-MPD-OVRR-DT                                 
11287B                                             PIC X(10).                   
11287B            07  FILLER                       PIC X(41).                   
00287A                                                                          
00287A        06  AR70-HRSK-ACS-SEGMENT OCCURS 1 TIMES.                         
MCR   **                         OCCURS 0 TO 1 TIMES                            
MCR   **                         DEPENDING ON AR70-NO-HRSK-ACS-SEGS.            
00287A            07  AR70ACS-HRSK-PRTF-ID           PIC X(6).                  
00287A            07  AR70ACS-HRSK-OVRR-PRTF-ID      PIC X(6).                  
00287A            07  AR70ACS-HRSK-OVRR-PRTF-DT      PIC X(10).                 
00287A            07  AR70ACS-HRSK-CRDT-LINE-STGY-ID PIC X(5).                  
00287A            07  AR70ACS-HRSK-EXTR-STTS-CD      PIC X.                     
00287A            07  AR70ACS-HRSK-STTS-RESN-CD      PIC X(3).                  
00287A            07  AR70ACS-HRSK-LTTR-NR           PIC X(4).                  
00287A            07  AR70ACS-HRSK-CIS-MEMO-ID       PIC 9(4).                  
03038C            07  FILLER                         PIC XXX.                   
00287A            07  AR70ACS-HRSK-LTTR-TAPE-ID      PIC X(4).                  
00287A            07  AR70ACS-HRSK-MSSG-NR           PIC 9(3).                  
00287A            07  AR70ACS-HRSK-CRDT-LINE-STGY-DT PIC X(10).                 
00287A            07  AR70ACS-HRSK-EXTR-STTS-DT      PIC X(10).                 
00287A            07  AR70ACS-HRSK-STTS-RESN-DT      PIC X(10).                 
00287A            07  AR70ACS-HRSK-LTTR-DT           PIC X(10).                 
00287A            07  AR70ACS-HRSK-CIS-MEMO-DT       PIC X(10).                 
03038C            07  FILLER                         PIC X(5).                  
00287A            07  AR70ACS-HRSK-LTTR-TAPE-DT      PIC X(10).                 
00287A            07  AR70ACS-HRSK-MSSG-DT           PIC X(10).                 
00287A            07  AR70ACS-PREV-PFST-ATTR-SCOR-NR PIC X(5).                  
00287A            07  AR70ACS-PREV-PFST-CRDT-SCOR-NR PIC X(5).                  
00287A            07  AR70ACS-PREV-PFST-REVN-PRDC-AM                            
00287A                                             PIC X(19).                   
01026F            07  AR70ACS-PREV-PFST-PRFT-PRDC-AM                            
01026F                                             PIC X(19).                   
00287A            07  AR70ACS-PREV-SCOR-NR         PIC X(8)                     
00287A                    OCCURS 10 TIMES.                                      
00287A            07  FILLER                          PIC X(62).                
00287A       06  AR70-CLIENT-PRODUCT-SMALL-1         PIC X(100)                 
MCR                              OCCURS      4 TIMES.                           
MCR   **                         DEPENDING ON AR70-NO-SMALL-SEGS.               
10022C                                                                          
10022C       06  AR70-ALP-STAG-SEG OCCURS 1 TIMES.                              
MCR   **                         OCCURS 0 TO 1 TIMES                            
MCR   **                         DEPENDING ON AR70-NO-ALP-STAG-SEGS.            
10022C            07 AR70-CURR-STRT-CIT-MTHD-ID    PIC X(8).                    
10022C            07 AR70-CURR-STRT-EVNT-DT        PIC X(10).                   
10022C            07 AR70-CURR-STRT-ALLC-DT        PIC X(10).                   
10022E            07 AR70-CURR-STRT-TMNG-CD        PIC X.                       
10022C            07 AR70-MID-CYC-STRT-ID          PIC X(8).                    
10022E            07 AR70-MID-CYC-STRT-DT          PIC X(10).                   
10022B            07 AR70-NEXT-STRT.                                            
10022B                08 AR70-NEXT-PRICING-STRATEGY PIC X(8).                   
10022B                08 AR70-NEXT-STRT-DT          PIC X(10).                  
10022B                08 AR70-NEXT-STRAT-CYCLE-FLAG PIC X(1).                   
10022B                08 AR70-NEXT-STRT-HONR-ID     PIC X(1).                   
10022B                08 AR70-NEXT-STRT-CIT-MTHD-ID PIC X(8).                   
10022B                08 AR70-NEXT-STRT-TMNG-CD     PIC X(1).                   
10022B                08 AR70-NEXT-STRT-EVNT-DT     PIC X(10).                  
10022B                08 AR70-NEXT-STRT-REVW-IN     PIC X(1).                   
10022B            07 AR70-NXT2-STRT.                                            
10022B                08 AR70-NXT2-STRT-ID         PIC X(8).                    
10022B                08 AR70-NXT2-STRT-DT         PIC X(10).                   
10022B                08 AR70-NXT2-STRT-BA-CD      PIC X(1).                    
10022B                08 AR70-NXT2-STRT-HONR-ID    PIC X(1).                    
10022B                08 AR70-NXT2-STRT-CIT-MTHD-ID PIC X(8).                   
10022B                08 AR70-NXT2-STRT-TMNG-CD    PIC X(1).                    
10022B                08 AR70-NXT2-STRT-EVNT-DT    PIC X(10).                   
10022B                08 AR70-NXT2-STRT-REVW-IN    PIC X(1).                    
10022C            07 AR70-STOP-CYCL-CODE-CHNG-CD   PIC X.                       
10022C            07 AR70-LAST-DFFR-STRT-ID        PIC X(8).                    
10022C            07 AR70LS-PRCN-STRT-CT           PIC X(4).                    
10022B            07 AR70LS-NEXT-STRT.                                          
10022B                08 AR70LS-NEXT-PRICING-STRATEGY PIC X(8).                 
10022B                08 AR70LS-NEXT-STRT-DT        PIC X(10).                  
10022B                08 AR70LS-NEXT-STRAT-CYCLE-FLAG PIC X(1).                 
10022B                08 AR70LS-NEXT-STRT-HONR-ID     PIC X(1).                 
10022B                08 AR70LS-NEXT-STRT-CIT-MTHD-ID PIC X(8).                 
10022B                08 AR70LS-NEXT-STRT-TMNG-CD     PIC X(1).                 
10022B            07 AR70LS-NXT2-STRT.                                          
10022B                08 AR70LS-NXT2-STRT-ID          PIC X(8).                 
10022B                08 AR70LS-NXT2-STRT-DT        PIC X(10).                  
10022B                08 AR70LS-NXT2-STRT-BA-CD       PIC X(1).                 
10022B                08 AR70LS-NXT2-STRT-HONR-ID     PIC X(1).                 
10022B                08 AR70LS-NXT2-STRT-CIT-MTHD-ID PIC X(8).                 
10022B                08 AR70LS-NXT2-STRT-TMNG-CD     PIC X(1).                 
10022F            07 AR70-PP-ADD-ON-DELY-DT         PIC X(10).                  
10022G            07 AR70-LAST-DSCL-DT              PIC X(10).                  
10022J            07 AR70-LAST-CIT-CHNG-DT          PIC X(10).                  
10022I            07 AR70-INCT-CIT-PB-CD            PIC X(1).                   
10106C            07 AR70-ICIP-TERM-UNFR-DT         PIC X(10).                  
10106C            07 AR70-ICML-TERM-UNFR-DT         PIC X(10).                  
11021D            07 AR70-PP-ADD-ON-DELY-CD         PIC X(01).                  
11203B            07 AR70-ANNL-PRNT-DT              PIC X(10).                  
11203B            07 AR70-ANNL-PRNT-AM          PIC X(19).                      
C86513            07 FILLER                          PIC X(28).                 
C86513            07 AR70-NO-INACTV-CD               PIC X.                     
C86513            07 AR70-ALP-LOCK-UNLK-SOON-CD      PIC X.                     
C86513            07 AR70-ALP-NEXT-DAY-ALLC-CD       PIC X.                     
C86513            07 AR70-VRFY-CIT-EFFC-DT-CD        PIC X.                     
C86513            07 FILLER                          PIC X(26).                 
C86513*           07 FILLER                          PIC X(58).                 
10022C                                                                          
10204B       06  AR70-NEW-MISC-SEG OCCURS 1 TIMES.                              
MCR   **                         OCCURS 0 TO 1 TIMES                            
MCR   **                         DEPENDING ON AR70-NO-NEW-MISC-SEGS.            
10204B            07  AR70-SARG-NORM-CASH-RATE   PIC X(7).                      
10204B            07  AR70-SARG-NORM-MRCH-RATE   PIC X(7).                      
10204B            07  AR70-RVLV-CASH-BLNC-AM   PIC X(19).                       
10204B            07  AR70-RVLV-MRCH-BLNC-AM   PIC X(19).                       
10204B            07  AR70-RVLV-NINT-BLNC-AM   PIC X(19).                       
10204B            07  AR70-CASH-OMPD-PL-AM       PIC X(19).                     
10204B            07  AR70-MRCH-OMPD-PL-AM       PIC X(19).                     
10204B            07  AR70-NINT-OMPD-PL-AM       PIC X(19).                     
10204C            07  AR70-HIST-LS-NDLQ-MPD-AM   PIC X(19).                     
10204C            07  AR70-HIST-LS-FULL-MPD-AM   PIC X(19).                     
10204C            07  AR70-HIST-PS-NDLQ-MPD-AM   PIC X(19).                     
10204C            07  AR70-HIST-PS-FULL-MPD-AM   PIC X(19).                     
10204D            07  AR70-FIFO-FEE-CD           PIC X(01).                     
10288A            07  AR70-FRST-DATE-PAST-MPD-DT PIC X(10).                     
10288A            07  AR70-CURR-DAYS-PAST-MPD-NR PIC X(4).                      
10288A            07  AR70-HIGH-DAYS-PAST-MPD-NR PIC X(4).                      
10288A            07  AR70-CURR-DAYS-TO-PDD-NR   PIC X(4).                      
10288A            07  AR70-LS-DAYS-TO-PDD-NR     PIC X(4).                      
10288A            07  AR70-PS-DAYS-TO-PDD-NR     PIC X(4).                      
10288A            07  AR70BPS-DAYS-TO-PDD-NR     PIC X(4)                       
10288A                                            OCCURS 10 TIMES.              
11203E            07  AR70-E-LETR-IN             PIC X(1).                      
11203C            07  AR70-DLNQ-STRT-OVRR-UPDT-DT PIC X(10).                    
11203C            07  AR70-HIGH-BAL-LIFE-UPDT-DT  PIC X(10).                    
11203C            07  AR70-CNSM-ACCT-CLSD-UPDT-DT PIC X(10).                    
11287C            07  AR70-ELTR-STRT-DT          PIC X(10).                     
11287C            07  AR70-ELTR-END-DT           PIC X(10).                     
11287C            07  AR70-ELTR-STOP-PAPR-DT     PIC X(10).                     
10204E            07  AR70-CPICSP-MTHD-NM        PIC X(08).                     
10204E            07  AR70-WRKN-SCHD-ID          PIC X(02).                     
10204C            07  AR70-HIST-BPS-NDLQ-MPD-AM  PIC X(19).                     
10204C            07  AR70-HIST-BPS-FULL-MPD-AM  PIC X(19).                     
10288B            07  AR70-CPTL-LOAN-CD          PIC X(01).                     
10288C            07  AR70-RULE-NEXT-DAY-3-CT    PIC X(6).                      
10288C            07  AR70-RULE-NEXT-DAY-4-CT    PIC X(6).                      
10251A            07  AR70-HIST-BPS-PAY-AHEAD-AM PIC X(19).                     
11021A            07  AR70HD-RTRN-CHCK-CHRG-CTD  PIC X.                         
11021A            07  AR70HD-RTRN-CHCK-CHRG-HSTR.                               
11021A                 08  AR70HD-RCC-1-11.                                     
11021A                      09  AR70HD-RCC-LS      PIC X.                       
11021A                      09  FILLER              PIC X(10).                  
11021A                 08  FILLER                  PIC X.                       
11021A            07  FILLER REDEFINES AR70HD-RTRN-CHCK-CHRG-HSTR.              
11021A                 08  AR70HD-RCC-1-12       PIC X OCCURS 12 TIMES.         
11021A            07  FILLER REDEFINES AR70HD-RTRN-CHCK-CHRG-HSTR.              
11021A                 08  AR70HD-RCC-1           PIC X(1).                     
11021A                 08  AR70HD-RCC-2           PIC X(1).                     
11021A                 08  AR70HD-RCC-3           PIC X(1).                     
11021A                 08  AR70HD-RCC-4           PIC X(1).                     
11021A                 08  AR70HD-RCC-5           PIC X(1).                     
11021A                 08  AR70HD-RCC-6           PIC X(1).                     
11021A                 08  AR70HD-RCC-7           PIC X(1).                     
11021A                 08  AR70HD-RCC-8           PIC X(1).                     
11021A                 08  AR70HD-RCC-9           PIC X(1).                     
11021A                 08  AR70HD-RCC-10          PIC X(1).                     
11021A                 08  AR70HD-RCC-11          PIC X(1).                     
11021A                 08  AR70HD-RCC-12          PIC X(1).                     
11021B            07  AR70-LATE-CHRG-PNDG-IN     PIC X(01).                     
11021C            07  AR70-MECH-PULL-PRCS-UPDT-DT PIC X(4).                     
11173A            07  AR70-CB-REASON5             PIC XX.                       
11173A            07  AR70-SCOR-ONE-RESN-FIVE-TX  PIC XX.                       
11173A            07  AR70-SCOR-TWO-RESN-FIVE-TX  PIC XX.                       
11173A            07  AR70-SCOR-THRE-RESN-FIVE-TX PIC XX.                       
11173A            07  AR70-SCOR-FOUR-RESN-FIVE-TX PIC XX.                       
11173A            07  AR70-SCOR-FIVE-RESN-FIVE-TX PIC XX.                       
11173A            07  AR70-SCOR-SIX-RESN-FIVE-TX  PIC XX.                       
11173A            07  AR70-SCOR-SEVN-RESN-FIVE-TX PIC XX.                       
11173A            07  AR70-SCOR-EGHT-RESN-FIVE-TX PIC XX.                       
11173A            07  AR70-SCOR-NINE-RESN-FIVE-TX PIC XX.                       
11173A            07  AR70-SCOR-TEN-RESN-FIVE-TX  PIC XX.                       
11287D            07  AR70-LS-BLCK-LATE-FEE-IN    PIC X.                        
11287D            07  AR70-NS-BLCK-LATE-FEE-IN    PIC X.                        
11287D            07  AR70-ANS-BLCK-LATE-FEE-IN   PIC X.                        
FD1607            07  AR70-MLTP-LEVL-AUTH-OVRR-CD PIC X.                        
FD1607            07  AR70-FLIP-STTS-CD           PIC X.                        
11287D*           07  FILLER                       PIC X(02).                   
11287A       06  AR70-NEW-MISC2-SEG OCCURS 1 TIMES.                             
MCR   **                         OCCURS 0 TO 1 TIMES                            
MCR   **                         DEPENDING ON AR70-NO-NEW-MISC2-SEGS.           
11287A            07  AR70-MBR-ACTV-CD           PIC X.                         
11287A            07  AR70-FRAUD-INDX-CD         PIC 9(02).                     
11287A            07  AR70-CRDT-INDX-CD          PIC 9(02).                     
11287A            07  AR70-PS-PYMT-CT            PIC X(4).                      
11287A            07  AR70-3CYC-PYMT-CT          PIC X(4).                      
11287A            07  AR70-4CYC-PYMT-CT          PIC X(4).                      
11287A            07  AR70-5CYC-PYMT-CT          PIC X(4).                      
11287A            07  AR70-6CYC-PYMT-CT          PIC X(4).                      
11287C            07  AR70-ELTR-UNIQ-ID          PIC 9(10).                     
C86513            07  FILLER                     PIC X(217).                    
C86513            07  AR70-PREV-STMT-DT-RELJUL   PIC X(04).                     
C86513            07  FILLER                     PIC X(04).                     
C86513*           07  FILLER                     PIC X(225).                    
C86513       06  AR70-NEW-MISC3-SEG   OCCURS 1 TIMES.                           
MCR   **                         OCCURS 0 TO 1 TIMES                            
MCR   **                         DEPENDING ON AR70-NO-NEW-MISC3-SEGS.           
11287A**          07  FILLER                      PIC X(250).                   
C86513            07  FILLER                      PIC X(242).                   
C86513            07  AR70-CASH-VRBL-CD           PIC X(1).                     
C86513            07  AR70-MRCH-VRBL-CD           PIC X(1).                     
C86513            07  AR70-CASH-GOTO-VRBL-CD      PIC X(1).                     
C86513            07  AR70-MRCH-GOTO-VRBL-CD      PIC X(1).                     
FD1601            07  AR70-ACH-GNRT-LEVL-CD       PIC X(1).                     
FD1601            07  AR70-RWD-ENRL-FEE-CD        PIC S9(1).                    
FD1707            07  AR70-UPC-23-TX              PIC X(01).                    
FD1707            07  FILLER                      PIC X(01).                    
C86513*           07  FILLER                      PIC X(04).                    
09289C       06  AR70-SLS-SYD-SEGMENT OCCURS 1 TIMES.                           
MCR   **                         OCCURS 0 TO 1 TIMES                            
MCR   **                         DEPENDING ON AR70-NO-SLS-SYD-SEGS.             
09289C             07  AR70-ID-NAME               PIC X(08).                    
09289C             07  AR70-SLS-ANNL-CHRG         PIC X(19).                    
09289C             07  AR70-SLS-CASH-INTR-CHRG    PIC X(19).                    
09289C             07  AR70-SLS-CASH-ITEM-CHRG    PIC X(19).                    
09289C             07  AR70-SLS-CRDT-LIFE-INTR    PIC X(19).                    
09289C             07  AR70-SLS-CRDT-LIFE-FEES    PIC X(19).                    
09289C             07  AR70-SLS-CSTM-INTR         PIC X(19).                    
09289C             07  AR70-SLS-CSTM-FEES         PIC X(19).                    
09289C             07  AR70-SLS-DCLN-AUTH-CHRG    PIC X(19).                    
09289C             07  AR70-SLS-LATE-CHRG         PIC X(19).                    
09289C             07  AR70-SLS-MIN-FIN-CHRG      PIC X(19).                    
09289C             07  AR70-SLS-MISC-INTR         PIC X(19).                    
09289C             07  AR70-SLS-MISC-FEES         PIC X(19).                    
09289C             07  AR70-SLS-MMB-INTR          PIC X(19).                    
09289C             07  AR70-SLS-MMB-FEES          PIC X(19).                    
09289C             07  AR70-SLS-MRCH-INTR-CHRG    PIC X(19).                    
09289C             07  AR70-SLS-MRCH-ITEM-CHRG    PIC X(19).                    
09289C             07  AR70-SLS-NSF-CHRG          PIC X(19).                    
09289C             07  AR70-SLS-OIF-CHRG          PIC X(19).                    
09289C             07  AR70-SLS-OVRL-CHRG         PIC X(19).                    
09289C             07  AR70-SLS-STMT-CHRG         PIC X(19).                    
09289C             07  AR70-SYD-ANNL-CHRG         PIC X(19).                    
09289C             07  AR70-SYD-CASH-INTR-CHRG    PIC X(19).                    
09289C             07  AR70-SYD-CASH-ITEM-CHRG    PIC X(19).                    
09289C             07  AR70-SYD-CRDT-LIFE-INTR    PIC X(19).                    
09289C             07  AR70-SYD-CRDT-LIFE-FEES    PIC X(19).                    
09289C             07  AR70-SYD-CSTM-INTR         PIC X(19).                    
09289C             07  AR70-SYD-CSTM-FEES         PIC X(19).                    
09289C             07  AR70-SYD-DCLN-AUTH-CHRG    PIC X(19).                    
09289C             07  AR70-SYD-LATE-CHRG         PIC X(19).                    
09289C             07  AR70-SYD-MIN-FIN-CHRG      PIC X(19).                    
09289C             07  AR70-SYD-MISC-INTR         PIC X(19).                    
09289C             07  AR70-SYD-MISC-FEES         PIC X(19).                    
09289C             07  AR70-SYD-MMB-INTR          PIC X(19).                    
09289C             07  AR70-SYD-MMB-FEES          PIC X(19).                    
09289C             07  AR70-SYD-MRCH-INTR-CHRG    PIC X(19).                    
09289C             07  AR70-SYD-MRCH-ITEM-CHRG    PIC X(19).                    
09289C             07  AR70-SYD-NSF-CHRG          PIC X(19).                    
09289C             07  AR70-SYD-OIF-CHRG          PIC X(19).                    
09289C             07  AR70-SYD-OVRL-CHRG         PIC X(19).                    
09289C             07  AR70-SYD-STMT-CHRG         PIC X(19).                    
10022K             07  AR70-SYD-HOLD-LS-STMT-CHRG                               
                                                   PIC X(19).                   
10022K             07  FILLER                      PIC X(23).                   
FD1507     06  AR70-TOTAL-LARGE-AREA-DEF.                                       
FD1507       08  AR70-CLIENT-PRODUCT-LARGE-1         PIC X(400)                 
FD1507                           OCCURS      6 TIMES.                           
MCR   **                         DEPENDING ON AR70-NO-LARGE-SEGS.               
FD1507*      06  AR70-CLIENT-PRODUCT-XLARGE-1        PIC X(1200).               
FD1507*                                 OCCURS 1.                               
MCR   *                          OCCURS 0 TO 1 TIMES                            
MCR   *                          DEPENDING ON AR70-NO-SUPER-LARGE-SEGS.         
FD1507*    06  AR70--TOTAL-LARGE-AREA-DEF.                                      
FD1507*          07  AR70HD-CLIENT-PRODUCT-LARGE-1    PIC X(400).               
FD1507*          07  AR70DLS-HIGH-BAL-LIFE-AM     PIC X(19).                    
FD1507*          07  AR70DPS-HIGH-BAL-LIFE-AM     PIC X(19).                    
FD1507*          07  AR70-CARD-ACTD-DT            PIC S9(9)V COMP-3.            
FD1507*          07  AR70-AT-HIST-LS-BLNC-AM      PIC S9(15)V99 COMP-3.         
FD1507*          07  AR70-AT-HIST-PS-BLNC-AM      PIC S9(15)V99 COMP-3.         
FD1507*          07  FILLER                       PIC X(359).                   
FD1507*          07  AR70HD-LARGE-SEG-2           PIC X(400).                   
FD1507*          07  AR70HD-LARGE-SEG-3           PIC X(400).                   
FD1507*          07  AR70HD-LARGE-SEG-4           PIC X(400).                   
FD1507*          07  AR70HD-LARGE-SEG-5           PIC X(400).                   
FD1507*          07  AR70HD-LARGE-SEG-6           PIC X(400).                   
                                                                                
4.0100     05  AR70-HISTORY-DATA.                                               
4.0100         06  AR70HD-VIDEO-DISPLAY-HISTORY.                                
4.0100             07  AR70HD-VD-NMO-ACT-GROSS    PIC X(4).                     
4.0100             07  AR70HD-VD-NMO-TOP-LINE     PIC X(4).                     
4.0100             07  AR70HD-VD-DELQ-HIST.                                     
4.0100                 08  AR70HD-VD-NMO-DELIN    PIC X(4).                     
4.0100                 08  AR70HD-VD-NO-1CYC-DEL  PIC X(4).                     
4.0100                 08  AR70HD-VD-NO-2CYC-DEL  PIC X(4).                     
4.0100                 08  AR70HD-VD-NO-3CYC-DEL  PIC X(4).                     
4.0100             07  FILLER REDEFINES AR70HD-VD-DELQ-HIST.                    
4.0100                 08  FILLER                PIC X(4).                      
4.0100                 08  AR70HD-VD-NO-CYC-DEL                                 
4.0100                     OCCURS 3                PIC X(4).                    
4.0100             07  AR70HD-VD-NMO-EARNINGS     PIC X(4).                     
4.0100             07  AR70HD-VD-NO-DISPUTES      PIC X(4).                     
98023G             07  AR70HD-VD-TOTAL-EARNINGS   PIC X(15).                    
98023G             07  AR70HD-VD-HIGH-BALANCE     PIC X(16).                    
98023G             07  AR70HD-VD-HIGH-ARREARS     PIC X(16).                    
4.0100             07  AR70HD-VD-REAGE            PIC X(4).                     
4.0100         06  AR70HD-PREVIOUS-YEAR.                                        
4.0100             07  AR70HD-PY-NET-NO-PURCH     PIC X(4).                     
4.0100             07  AR70HD-PY-NET-NO-CASH      PIC X(4).                     
98023G             07  AR70HD-PY-NET-AMT-PURCH    PIC X(19).                    
98023G             07  AR70HD-PY-NET-AMT-CASH     PIC X(19).                    
98023G             07  AR70HD-PY-NET-AMT-LOAN     PIC X(19).                    
4.0100             07  AR70HD-PY-NMO-ACT-GROSS    PIC X(4).                     
4.0100             07  AR70HD-PY-NMO-TOP-LINE     PIC X(4).                     
4.0100             07  AR70HD-PY-DELQ-HIST.                                     
4.0100                 08  AR70HD-PY-NMO-DELIN    PIC X(4).                     
4.0100                 08  AR70HD-PY-NO-1CYC-DEL  PIC X(4).                     
4.0100                 08  AR70HD-PY-NO-2CYC-DEL  PIC X(4).                     
4.0100                 08  AR70HD-PY-NO-3CYC-DEL  PIC X(4).                     
4.0100             07  FILLER REDEFINES AR70HD-PY-DELQ-HIST.                    
4.0100                 08  FILLER                  PIC X(4).                    
4.0100                 08  AR70HD-PY-NO-CYC-DEL                                 
4.0100                     OCCURS 3                PIC X(4).                    
4.0100             07  AR70HD-PY-NMO-EARNINGS     PIC X(4).                     
4.0100             07  AR70HD-PY-NO-DISPUTES      PIC X(4).                     
98023G             07  AR70HD-PY-TOTAL-EARNINGS   PIC X(15).                    
98023G             07  AR70HD-PY-CHD-INTEREST     PIC X(15).                    
98023G             07  AR70HD-PY-CREDIT-INT       PIC X(15).                    
98023G             07  AR70HD-PY-HIGH-BALANCE     PIC X(16).                    
98023G             07  AR70HD-PY-HIGH-ARREARS     PIC X(16).                    
4.0100             07  AR70HD-PY-REAGE            PIC X(4).                     
98023G             07  AR70HD-PY-START-UNPAID-INT PIC X(15).                    
98023G             07  AR70HD-PY-END-UNPAID-INT   PIC X(15).                    
4.0100         06  AR70HD-YEAR-TO-DATE.                                         
4.0100             07  AR70HD-YTD-NET-NO-PURCH    PIC X(4).                     
4.0100             07  AR70HD-YTD-NET-NO-CASH     PIC X(4).                     
98023G             07  AR70HD-YTD-NET-AMT-PURCH   PIC X(19).                    
98023G             07  AR70HD-YTD-NET-AMT-CASH    PIC X(19).                    
98023G             07  AR70HD-YTD-NET-AMT-LOAN    PIC X(19).                    
4.0100             07  AR70HD-YTD-NMO-ACT-GROSS   PIC X(4).                     
4.0100             07  AR70HD-YTD-NMO-TOP-LINE    PIC X(4).                     
4.0100             07  AR70HD-YTD-DELQ-HIST.                                    
4.0100                 08  AR70HD-YTD-NMO-DELIN   PIC X(4).                     
4.0100                 08  AR70HD-YTD-NO-1CYC-DEL PIC X(4).                     
4.0100                 08  AR70HD-YTD-NO-2CYC-DEL PIC X(4).                     
4.0100                 08  AR70HD-YTD-NO-3CYC-DEL PIC X(4).                     
4.0100             07  FILLER REDEFINES AR70HD-YTD-DELQ-HIST.                   
4.0100                 08  FILLER                  PIC XXXX.                    
4.0100                 08  AR70HD-YTD-NO-CYC-DEL                                
4.0100                     OCCURS 3                PIC X(4).                    
4.0100             07  AR70HD-YTD-NMO-EARNINGS    PIC X(4).                     
4.0100             07  AR70HD-YTD-NO-DISPUTES     PIC X(4).                     
98023G             07  AR70HD-YTD-HIGH-BALANCE    PIC X(16).                    
98023G             07  AR70HD-YTD-HIGH-ARREARS    PIC X(16).                    
98023G             07  AR70HD-YTD-BILLED-CASH-INT PIC X(15).                    
98023G             07  AR70HD-YTD-BILLED-MRCH-INT PIC X(15).                    
98023G             07  AR70HD-YTD-BILLED-CR-LIFE  PIC X(15).                    
98023G             07  AR70HD-YTD-BILLED-LATE-CHG PIC X(15).                    
98023G             07  AR70HD-YTD-BILLED-ITEM-CHG PIC X(15).                    
98023G             07  AR70HD-YTD-OVERLIMIT-CHG   PIC X(15).                    
98023G             07  AR70HD-YTD-ANNUAL-CHG      PIC X(15).                    
98023G             07  AR70HD-YTD-CREDIT-INT      PIC X(15).                    
98023G             07  AR70HD-YTD-STMT-CHG        PIC X(15).                    
98023G             07  AR70HD-YTD-SALE-CHG        PIC X(19).                    
4.0100             07  AR70HD-YTD-REAGE           PIC X(4).                     
98023G             07  AR70HD-YTD-AMT-REBATE      PIC X(19).                    
00287A             07  AR70-YTD-CBR-PRTN-QLFD-PRCH-NR                           
00287A                                             PIC X(4).                    
00287A             07  AR70-YTD-CBR-PRTN-QLFD-PRCH-AM                           
00287A                                             PIC X(19).                   
4.0100         06  AR70HD-LAST-TRAN-DATA.                                       
4.0100             07  AR70-TYPE-LAST-MON-TRAN    PIC X.                        
4.0100             07  AR70-DATE-LAST-MON-TRAN    PIC X(8).                     
4.0100             07  AR70-DATE-LAST-PAYMENT     PIC X(8).                     
4.0100             07  AR70-DATE-LAST-STMT        PIC X(8).                     
4.0100             07  AR70-DATE-FIRST-ACT        PIC X(8).                     
98023G             07  AR70-AMT-LAST-PAYMENT      PIC X(19).                    
4.0100             07  AR70-DATE-PREV-STMT        PIC X(8).                     
4.0100             07  AR70-CHGOFF-INDIC          PIC X(5).                     
98023G             07  AR70-HIST-LS-BAL           PIC X(19).                    
98023G             07  AR70-AUTH-TOTAL-AMT        PIC X(16).                    
4.0100         06  AR70HD-DISPUTE-DATA.                                         
4.0100             07  AR70-DISPUTE-DATE          PIC X(8).                     
98023G             07 AR70-DISPUTE-AMOUNT         PIC X(19).                    
4.0100         06  AR70HD-PAYMENT-HISTORY.                                      
4.0100             07  AR70HD-PH-1-11.                                          
4.0100                 08  AR70HD-PH-LAST-STMT    PIC X.                        
07103A                 08  AR70HD-PH-PREV-STMT-CD PIC X.                        
07103A                 08  AR70HD-PH-BPS1-CD      PIC X.                        
07103A                 08  AR70HD-PH-BPS2-CD      PIC X.                        
07103A                 08  AR70HD-PH-BPS3-CD      PIC X.                        
07103A                 08  AR70HD-PH-BPS4-CD      PIC X.                        
07103A                 08  AR70HD-PH-BPS5-CD      PIC X.                        
07103A                 08  AR70HD-PH-BPS6-CD      PIC X.                        
07103A                 08  AR70HD-PH-BPS7-CD      PIC X.                        
07103A                 08  AR70HD-PH-BPS8-CD      PIC X.                        
07103A                 08  AR70HD-PH-BPS9-CD      PIC X.                        
4.0100             07  FILLER                      PIC X.                       
4.0100         06  FILLER    REDEFINES AR70HD-PAYMENT-HISTORY.                  
4.0100             07  AR70HD-PH-1-12  PIC X     OCCURS 12 TIMES.               
4.068B         06  AR70HD-PAY-HIST-13-24.                                       
4.068B             07  AR70HD-PH-13-23            PIC X(11).                    
4.068B             07  FILLER                      PIC X.                       
4.068B         06  AR70HD-PH-13-24 REDEFINES AR70HD-PAY-HIST-13-24              
4.068B                             OCCURS 12 TIMES PIC X.                       
4.0100         06  AR70-DAYS-LAST-STMT            PIC X(4).                     
4.0100         06  AR70-WB-LST-DEBT-DATE          PIC X(6).                     
               06  AR70HD-AVERAGE-DAILY-BALANCES.                               
98023G             07  AR70HD-VD-ADB              PIC X(19).                    
98023G             07  AR70HD-PY-ADB              PIC X(19).                    
98023G             07  AR70HD-YTD-ADB             PIC X(19).                    
4.032A         06  AR70-HIST-LS-SMBAL-PRINS       PIC X(7).                     
4.032A         06  AR70-HIST-LS-SMBAL-INTSC       PIC X(7).                     
4.0300         06  AR70-HIST-LS-CTD-DEF-INT       PIC X(7).                     
4.0400         06  AR70-DAYS-PREV-STMT            PIC X(4).                     
98023G         06  AR70-HIST-PS-BAL               PIC X(19).                    
98023G         06  AR70HD-YTD-AMT-DEBIT           PIC X(19).                    
98023G         06  AR70HD-YTD-SPEC-CHG-FIN-CHG    PIC X(19).                    
98023G         06  AR70HD-YTD-AMT-MISC-CHGS       PIC X(19).                    
4.039A         06  AR70-LAST-AUTOPAY-DATE         PIC X(4).                     
4.037A         06  AR70HD-REAGE-NUM-PAYMENTS      PIC X(2).                     
4.037A         06  AR70HD-HIST-DATA-NMDSREC.                                    
4.037A             07  AR70HD-REAGE-NEXT-DATE     PIC X(6).                     
00287A             07  AR70HD-ANNIVERSARY-YEAR-INT                              
00287A                                             PIC X(15).                   
98023G             07  AR70HD-AMOUNT-TO-DEFER     PIC X(19).                    
04037A             07  AR70HD-DATE-LAST-REAGE-OLD PIC X(6).                     
4.037A             07  AR70HD-PYMT-FLOAT-DATE     PIC X(6).                     
4.037A         06  AR70HD-COLLECTOR-ASSIGNED      PIC X(4).                     
98023G         06  AR70HD-CHG-OFF-AMT             PIC X(19).                    
4.037A         06  AR70HD-CHG-OFF-DATE            PIC X(8).                     
4.037A         06  AR70HD-STATUSES-MET            PIC X.                        
4.037A         06  AR70HD-BS-SCORECARD-ID         PIC X(4).                     
4.063A         06  AR70HD-BS-DELQ-SCENARIO        PIC 9(4).                     
4.063A         06  AR70HD-OLDBS-DELQ-SCENARIO REDEFINES                         
4.063A             AR70HD-BS-DELQ-SCENARIO        PIC X(4).                     
4.037A         06  AR70HD-BS-TEMP-COLL-CODE       PIC X(4).                     
4.041B         06  AR70-LAST-PYMT-EFFECTIVE-DATE  PIC X(8).                     
4.054A         06  AR70-CASH-ADV-DATA-NMDSREC.                                  
4.054A             07  AR70-LAST-CASH-ADVANCE-DATE PIC X(6).                    
4.054A             07  AR70-LAST-CASH-ADVANCE-TYPE PIC X(1).                    
98023G         06  AR70HD-PY-CHGOFF-RPTABLE-INT   PIC X(15).                    
98023G         06  AR70HD-YTD-CHGOFF-RPTABLE-INT  PIC X(15).                    
98023G         06  AR70-CTD-BONUS-EXCLUDE-AMT     PIC X(15).                    
4.054A         06  AR70-AP-RTC-DATA-NMDSREC.                                    
4.054A             07  AR70-LS-STIPULATED-AUTOPAY-AMT                           
98023G                                            PIC X(19).                    
4.054A             07  AR70HD-LAST-RTC-DATE       PIC X(8).                     
4.054A             07  AR70HD-RTC-COUNT           PIC X(4).                     
4.050B         06  AR70HD-VELOCITY-TABLE.                                       
4.050B             07  AR70HD-APP-AUTH-TABLE.                                   
98023G                 08  AR70HD-APP-AUTH-DAY1   PIC X(16).                    
98023G                 08  AR70HD-APP-AUTH-DAY2   PIC X(16).                    
98023G                 08  AR70HD-APP-AUTH-DAY3   PIC X(16).                    
98023G                 08  AR70HD-APP-AUTH-DAY4   PIC X(16).                    
98023G                 08  AR70HD-APP-AUTH-DAY5   PIC X(16).                    
98023G                 08  AR70HD-APP-AUTH-DAY6   PIC X(16).                    
4.050B             07  FILLER               REDEFINES                           
4.050B                 AR70HD-APP-AUTH-TABLE OCCURS 6 TIMES.                    
98023G                 08  AR70HD-APP-AUTH-AMT    PIC X(16).                    
4.050B             07  AR70HD-DEC-AUTH-TABLE.                                   
98023G                 08  AR70HD-DEC-AUTH-DAY1   PIC X(16).                    
98023G                 08  AR70HD-DEC-AUTH-DAY2   PIC X(16).                    
98023G                 08  AR70HD-DEC-AUTH-DAY3   PIC X(16).                    
98023G                 08  AR70HD-DEC-AUTH-DAY4   PIC X(16).                    
98023G                 08  AR70HD-DEC-AUTH-DAY5   PIC X(16).                    
98023G                 08  AR70HD-DEC-AUTH-DAY6   PIC X(16).                    
4.050B             07  FILLER               REDEFINES                           
4.050B                 AR70HD-DEC-AUTH-TABLE OCCURS 6 TIMES.                    
98023G                 08  AR70HD-DEC-AUTH-AMT    PIC X(16).                    
4.050B             07  AR70HD-MONETARY-TABLE.                                   
98023G                 08  AR70HD-MONETARY-DAY1   PIC X(16).                    
98023G                 08  AR70HD-MONETARY-DAY2   PIC X(16).                    
98023G                 08  AR70HD-MONETARY-DAY3   PIC X(16).                    
98023G                 08  AR70HD-MONETARY-DAY4   PIC X(16).                    
98023G                 08  AR70HD-MONETARY-DAY5   PIC X(16).                    
98023G                 08  AR70HD-MONETARY-DAY6   PIC X(16).                    
4.050B             07  FILLER               REDEFINES                           
4.050B                 AR70HD-MONETARY-TABLE OCCURS 6 TIMES.                    
98023G                 08  AR70HD-MONETARY-AMT    PIC X(16).                    
4.068G         06  AR70HD-REGION-ACTIVITY-TABLE.                                
4.068G             07  AR70HD-USA-REGION-TABLE.                                 
4.068G                 08  AR70HD-ACTIVITY-REGION-01 PIC X(4).                  
4.068G             07  AR70HD-VS-FOREIGN-REGION-TABLE.                          
4.068G                 08  AR70HD-ACTIVITY-REGION-02 PIC X(4).                  
4.068G                 08  AR70HD-ACTIVITY-REGION-03 PIC X(4).                  
4.068G                 08  AR70HD-ACTIVITY-REGION-04 PIC X(4).                  
4.068G                 08  AR70HD-ACTIVITY-REGION-05 PIC X(4).                  
4.068G                 08  AR70HD-ACTIVITY-REGION-06 PIC X(4).                  
4.068G                 08  AR70HD-ACTIVITY-REGION-07 PIC X(4).                  
4.068G             07  AR70HD-MC-FOREIGN-REGION-TABLE.                          
4.068G                 08  AR70HD-ACTIVITY-REGION-08 PIC X(4).                  
4.068G                 08  AR70HD-ACTIVITY-REGION-09 PIC X(4).                  
4.068G                 08  AR70HD-ACTIVITY-REGION-10 PIC X(4).                  
4.068G                 08  AR70HD-ACTIVITY-REGION-11 PIC X(4).                  
4.068G                 08  AR70HD-ACTIVITY-REGION-12 PIC X(4).                  
97017C                 08  AR70HD-ACTIVITY-REGION-13 PIC X(4).                  
99022D             07  AR70HD-INTR-REGION-TABLE.                                
00287A                08 AR70HD-ACTIVITY-REGION-14-CD                           
00287A                                             PIC X(4).                    
4.068G         06  FILLER REDEFINES AR70HD-REGION-ACTIVITY-TABLE.               
4.068G             07  AR70HD-ACTIVITY-REGION     PIC X(4)                      
99022D                                              OCCURS 14 TIMES.            
99022D         06  AR70HD-REGION-FUTURE-RSRVD     PIC X(8).                     
98023G         06  AR70HD-ANN-CHG-YEAR-INT        PIC X(15).                    
98023G         06  AR70-HIST-INTERIM-STMT-BAL     PIC X(19).                    
4.054U         06  AR70-DEBIT-ACTIVITY-COUNTER    PIC X(4).                     
98023G         06  AR70-CTD-DISCOUNT-SAVINGS      PIC X(19).                    
98023G         06  AR70-YTD-DISCOUNT-SAVINGS      PIC X(19).                    
98023G         06  AR70-CURR-ANNIV-REBATE         PIC X(15).                    
98023G         06  AR70-LAST-ANNIV-REBATE         PIC X(15).                    
98023G         06  AR70-CURR-ANNIV-REBATE-USED    PIC X(15).                    
98023G         06  AR70-LAST-ANNIV-REBATE-USED    PIC X(15).                    
4.060B         06  AR70-ANN-FEE-WAVE-CNTRS        PIC 9(3).                     
4.060B         06  FILLER  REDEFINES AR70-ANN-FEE-WAVE-CNTRS.                   
4.060B             07  AR70-ANN-FEE-WAVE-CUR-CNTR PIC 9.                        
4.060B             07  AR70-ANN-FEE-WAVE-TOT-CNTR PIC 9(2).                     
4.060B         06  AR70-ANN-FEE-WAVE-P-YR-CNTR    PIC X(2).                     
4.060B         06  AR70-ANN-FEE-WAVE-2P-YTD-CNTR  PIC X(4).                     
4.063A         06  AR70HD-VD-NO-RTRN-CHECKS       PIC 9.                        
4.063A         06  AR70HD-PY-NO-RTRN-CHECKS       PIC 9.                        
4.063A         06  AR70HD-YTD-NO-RTRN-CHECKS      PIC 9.                        
4.063A         06  AR70HD-MTHS-RTRN-CHECKS        PIC 9(2).                     
98023G         06  AR70LS-ADB                     PIC X(19).                    
4.068F         06  AR70HD-MONTHLY-POST-HISTORY    PIC X(12).                    
4.068F         06  AR70HD-DATE-LAST-SALE-ADVANCE  PIC X(8).                     
98023G         06  AR70HD-CM-FIRST-PMT-AMT        PIC X(19).                    
4.072F         06  AR70HD-REAGE-TYPE              PIC X.                        
4.071A         06  AR70HD-ANN-CHG-YEAR-NO-PURCH   PIC X(4).                     
4.072I         06  AR70HD-LAST-TRAN-DATA-2.                                     
4.071C             07  AR70-DATE-LAST-SALE        PIC X(10).                    
98023G             07  AR70HD-AMT-LAST-SALE       PIC X(15).                    
4.071C             07  AR70HD-DATE-LAST-CASH      PIC X(10).                    
98023G             07  AR70HD-AMT-LAST-CASH       PIC X(15).                    
4.071C             07  AR70HD-DATE-LAST-DR        PIC X(10).                    
4.071C         06  AR70HD-DATE-LAST-DELINQUENT    PIC X(10).                    
4.071C         06  AR70HD-DATE-HI-BALANCE         PIC X(10).                    
00287A         06  AR70-CREDBAL-START-DATE        PIC X(8).                     
00287A         06  AR70-LST-PYMT-RVRS-DT          PIC X(10).                    
00287A         06  AR70-LAST-40-DAY-DLNQ-DT       PIC X(10).                    
00287A         06  AR70-LAST-50-DAY-DLNQ-DT       PIC X(10).                    
00287A         06  AR70-NMBR-TIMS-50-DAY-DLQ-CT   PIC X(4).                     
00287A         06  AR70-MXMM-CASH-BLNC-LFTM-AM    PIC X(19).                    
00287A         06  AR70-TOTL-CASH-ADVN-LFTM-AM    PIC X(19).                    
4.071C         06  AR70HD-TOTAL-REAGE-NO          PIC X(4).                     
4.071C         06  AR70HD-TOTAL-RTRN-CHECKS-NO    PIC X(4).                     
06286A         06  AR70HD-YTD-TRIP-CT             PIC X(6).                     
07026A         06  AR70HD-PY-TRIP-CT              PIC X(6).                     
07026A         06  FILLER                         PIC X(03).                    
98023B         06  AR70-ACS-AVLB-FUND-STRT-ID     PIC X(04).                    
98023B         06  AR70-ACS-AVLB-FUND-AM          PIC X(14).                    
98023B         06  AR70-PREV-PYMT-DT              PIC X(10).                    
98023B         06  AR70-RTRN-CHECK-DT             PIC X(10).                    
98163A         06  AR70LS-GROSS-ADB-CASH          PIC X(19).                    
98163A         06  AR70LS-GROSS-ADB-MRCH          PIC X(19).                    
98317A         06  AR70HD-LATE-FEE-CTD            PIC X.                        
98317A         06  AR70HD-LATE-FEE-HSTR.                                        
98317A             07  AR70HD-LF-1-11.                                          
98317A                 08  AR70HD-LF-LS           PIC X.                        
98317A                 08  FILLER                  PIC X(10).                   
98317A             07  FILLER                      PIC X.                       
98317A         06  FILLER REDEFINES AR70HD-LATE-FEE-HSTR.                       
98317A             07  AR70HD-LF-1-12            PIC X OCCURS 12 TIMES.         
08025E         06  FILLER REDEFINES AR70HD-LATE-FEE-HSTR.                       
08025E             07  AR70HD-LF-1               PIC X(1).                      
08025E             07  AR70HD-LF-2               PIC X(1).                      
08025E             07  AR70HD-LF-3               PIC X(1).                      
08025E             07  AR70HD-LF-4               PIC X(1).                      
08025E             07  AR70HD-LF-5               PIC X(1).                      
08025E             07  AR70HD-LF-6               PIC X(1).                      
08025E             07  AR70HD-LF-7               PIC X(1).                      
08025E             07  AR70HD-LF-8               PIC X(1).                      
08025E             07  AR70HD-LF-9               PIC X(1).                      
08025E             07  AR70HD-LF-10              PIC X(1).                      
08025E             07  AR70HD-LF-11              PIC X(1).                      
08025E             07  AR70HD-LF-12              PIC X(1).                      
99099B         06  AR70-LIFE-CYCLE-DELQ-COUNTS.                                 
99099B             07  AR70-LIFE-1-CYCLE-DELQ-CT  PIC X(4).                     
99099B             07  AR70-LIFE-2-CYCLE-DELQ-CT  PIC X(4).                     
99099B             07  AR70-LIFE-3-CYCLE-DELQ-CT  PIC X(4).                     
99099B             07  AR70-LIFE-4-CYCLE-DELQ-CT  PIC X(4).                     
99099B             07  AR70-LIFE-5-CYCLE-DELQ-CT  PIC X(4).                     
99099B             07  AR70-LIFE-6-CYCLE-DELQ-CT  PIC X(4).                     
99099B             07  AR70-LIFE-7-CYCLE-DELQ-CT  PIC X(4).                     
99099B         06  AR70-LIFE-CYCLE-DELQ-CT REDEFINES                            
99099B                AR70-LIFE-CYCLE-DELQ-COUNTS                               
99099B                                          PIC X(4)                        
99099B                    OCCURS 7 TIMES.                                       
99099B         06  AR70-LIFE-OVERLIMIT-CT       PIC X(4).                       
99099B         06  AR70-LIFE-SALES-ACTIVITY-CT  PIC X(4).                       
99099B         06  AR70-LIFE-CYCLES-DELQ-CT     PIC X(4).                       
99099B         06  AR70-LIFE-MAX-DELQ-AM        PIC X(16).                      
99162E         06  AR70HD-FRST-OVRL-DT          PIC X(10).                      
99162E         06  AR70HD-CHNG-TO-NEXT-RESN-DT  PIC X(10).                      
99162E         06  AR70HD-NEXT-STTS-RESN-CD     PIC 9(2).                       
99218A         06  AR70HD-YTD-CRDT-LINE-UTLZ-RT PIC X(4).                       
99218A         06  AR70HD-PY-CRDT-LINE-UTLZ-RT  PIC X(4).                       
               06  AR70BS-BHVR-SCOR-NR          PIC X(4)                        
                            OCCURS 2 TIMES.                                     
99281C         06  AR70-PY-LAST-STMT-BAL-AM     PIC X(19).                      
00287A         06  AR70HD-LAST-TRUE-REAG-CD     PIC X.                          
04037A         06  AR70HD-PRVS-REAG-DT-OLD      PIC X(8).                       
00287A         06  AR70HD-PRVS-TRUE-REAG-CD     PIC X.                          
04037A         06  AR70HD-PRIR-REAG-DT-OLD      PIC X(8).                       
00287A         06  AR70HD-PRIR-TRUE-REAG-CD     PIC X.                          
00287A         06  AR70-PP-DELINQ-LEVEL         PIC X(2).                       
00287A         06  AR70-PP-CYCS-DELQ-DATES.                                     
00287A             07  AR70-PP-1CYC-DELQ-DATE   PIC X(10).                      
00287A             07  AR70-PP-2CYC-DELQ-DATE   PIC X(10).                      
00287A             07  AR70-PP-3CYC-DELQ-DATE   PIC X(10).                      
00287A         06  FILLER REDEFINES AR70-PP-CYCS-DELQ-DATES.                    
00287A             07  AR70-PP-CYCS-DELQ-DATE OCCURS 3 TIMES                    
00287A                                          PIC X(10).                      
00287A         06  AR70-LFTM-NET-PRCH-AM        PIC X(16).                      
00287A         06  AR70HD-USAV-YTD-TOTL-AM      PIC X(19).                      
00287A         06  AR70HD-USAV-PY-TOTL-AM       PIC X(19).                      
00287A         06  AR70HD-USAV-PTD-TOTL-AM      PIC X(19).                      
00287A         06  AR70-LAST-ANNUAL-CHG-DATE    PIC X(5).                       
02235A         06  AR70-HIGH-BAL-SINC-RESET-AM  PIC X(19).                      
04037A         06  AR70HD-LAST-WRKT-DT-OLD      PIC X(8).                       
01026D         06  AR70HD-LAST-TRUE-WRKT-CD     PIC X.                          
04037A         06  AR70HD-PREV-WRKT-DT-OLD      PIC X(8).                       
01026D         06  AR70HD-PREV-TRUE-WRKT-CD     PIC X.                          
01026D         06  AR70-WRKT-EXPR-DT            PIC X(10).                      
01159A         06  AR70HD-OVRL-TABLE.                                           
01159A             07  AR70HD-1-12-TBL          PIC 9(12).                      
01159A             07  AR70HD-13-24-TBL         PIC 9(12).                      
01159A         06  FILLER REDEFINES AR70HD-OVRL-TABLE.                          
01159A             07  AR70HD-1-24-IN OCCURS 24 TIMES  PIC 9.                   
01285D         06  AR70HD-WRKT-PLAN-STRT-DT     PIC X(10).                      
01285D         06  AR70HD-WRKT-PLAN-STRT-BAL-AM PIC X(15).                      
01285D         06  AR70HD-WRKT-PLAN-END-DT      PIC X(10).                      
01285D         06  AR70HD-WRKT-PLAN-TYPE-CD     PIC X(2).                       
02095F         06  AR70HD-PY-BILL-LATE-CHRG-AM  PIC X(19).                      
02095F         06  AR70HD-PY-BILL-CR-LIFE-AM    PIC X(19).                      
02235A         06  AR70HD-BPS-FOR-BLNC-CD       PIC X.                          
03157A         06  AR70HD-REAG-NON-QLFY-PYMT-AM PIC X(19).                      
03227A         06  FILLER                        PIC X(04).                     
03227B         06  AR70HD-POC-AM                PIC X(19).                      
03227B         06  AR70HD-POC-DT                PIC X(10).                      
04037A         06  AR70HD-DATE-LAST-REAGE       PIC X(10).                      
04037A         06  AR70HD-PRVS-REAG-DT          PIC X(10).                      
04037A         06  AR70HD-PRIR-REAG-DT          PIC X(10).                      
04037A         06  AR70HD-LAST-WRKT-DT          PIC X(10).                      
04037A         06  AR70HD-PREV-WRKT-DT          PIC X(10).                      
04163B         06  AR70HD-HIGH-CASH-SINC-REST-AM PIC X(19).                     
04163B         06  AR70HD-HIGH-MDSE-SINC-REST-AM PIC X(19).                     
04163C         06  AR70HD-LS-MDSE-ADB-AM        PIC X(19).                      
04163C         06  AR70HD-LS-CASH-ADB-AM        PIC X(19).                      
04163C         06  AR70HD-PS-MDSE-ADB-AM        PIC X(19).                      
04163C         06  AR70HD-PS-CASH-ADB-AM        PIC X(19).                      
04163C         06  AR70HD-LS-RVLV-HSTR-CASH-AM  PIC X(19).                      
04163C         06  AR70HD-PS-RVLV-HSTR-CASH-AM  PIC X(19).                      
05224A         06  AR70-ANNL-CHRG-BLLD-LAST-AM  PIC X(19).                      
05224A         06  AR70-ANNL-CHRG-BLLD-LAST-DT  PIC X(10).                      
05224C         06  AR70HD-LS-EXTR-STTS-CD       PIC X.                          
05224C         06  AR70HD-LS-INRL-STTS-CD       PIC X.                          
05224D         06  AR70-FULL-BAL-DSPT-AM        PIC X(19).                      
05224D         06  AR70-FULL-BAL-DSPT-BEGN-DT   PIC X(10).                      
05224D         06  AR70-FULL-BAL-DSPT-END-DT    PIC X(10).                      
05224D         06  AR70-DSPT-TOTL-BCKT-CT       PIC X(10).                      
06097C         06  AR70-AMRT-LTTR-SENT-DT       PIC X(10).                      
06097C         06  AR70-BPS-BLLD-UNBL-ACCR-AM   PIC X(17).                      
06097D         06  AR70-MPD-STBL-CD             PIC X.                          
06097D         06  AR70LS-MPD-STBL-CD           PIC X.                          
06286C         06  AR70-CUST-SRVC-REAG-DT       PIC X(10).                      
07103A         06  AR70-BPS-LATE-FEES.                                          
07103A             07  AR70-BPS-LATE-FEE-AM     PIC X(19)                       
07103A                                               OCCURS 3 TIMES.            
07103A         06  FILLER REDEFINES AR70-BPS-LATE-FEES.                         
07103A             07  AR70-BPS1-LATE-FEE-AM    PIC X(19).                      
07103A             07  AR70-BPS2-LATE-FEE-AM    PIC X(19).                      
07103A             07  AR70-BPS3-LATE-FEE-AM    PIC X(19).                      
07103A         06  AR70-BPS-OVRL-FEES.                                          
07103A             07  AR70-BPS-OVRL-FEE-AM     PIC X(19)                       
07103A                                               OCCURS 3 TIMES.            
07103A         06  FILLER REDEFINES AR70-BPS-OVRL-FEES.                         
07103A             07  AR70-BPS1-OVRL-FEE-AM    PIC X(19).                      
07103A             07  AR70-BPS2-OVRL-FEE-AM    PIC X(19).                      
07103A             07  AR70-BPS3-OVRL-FEE-AM    PIC X(19).                      
08025D         06  AR70HD-OVLM-FEE-HSTR.                                        
08025D             07  AR70HD-OVLM-FEE-1-12.                                    
08025D                 08  AR70HD-OF-LS         PIC X.                          
08025D                 08  AR70HD-OF-PS         PIC X.                          
08025D                 08  AR70HD-OF-BPS-1      PIC X.                          
08025D                 08  AR70HD-OF-BPS-2      PIC X.                          
08025D                 08  AR70HD-OF-BPS-3      PIC X.                          
08025D                 08  AR70HD-OF-BPS-4      PIC X.                          
08025D                 08  AR70HD-OF-BPS-5      PIC X.                          
08025D                 08  AR70HD-OF-BPS-6      PIC X.                          
08025D                 08  AR70HD-OF-BPS-7      PIC X.                          
08025D                 08  AR70HD-OF-BPS-8      PIC X.                          
08025D                 08  AR70HD-OF-BPS-9      PIC X.                          
08025D                 08  AR70HD-OF-BPS-10     PIC X.                          
08025D             07  AR70HD-OVLM-FEE-TABLE REDEFINES                          
08025D                     AR70HD-OVLM-FEE-1-12.                                
08025D                 08  AR70HD-FEE-TABLE-OCCR OCCURS 12 TIMES                
08025D                                           PIC X.                         
08025G         06  AR70HD-FORB-PLAN-CD          PIC X(02).                      
08025G         06  AR70HD-FORB-STRT-DT          PIC X(10).                      
08025G         06  AR70HD-FORB-END-DT           PIC X(10).                      
08277B         06  AR70HD-OVLM-FEE-CTD-CD       PIC X.                          
09289A         06  AR70HD-MISS-PAY-HSTR.                                        
09289A             07  AR70HD-MISS-PAY-CTD      PIC X.                          
09289A             07  AR70HD-MP-1-5.                                           
09289A                 08  AR70HD-MP-LS         PIC X.                          
09289A                 08  FILLER                PIC X(04).                     
09289A         06  FILLER REDEFINES AR70HD-MISS-PAY-HSTR.                       
09289A             07  AR70HD-MP-1-6            PIC X                           
09289A                                           OCCURS 6  TIMES.               
09289B         06  AR70HD-1STY-MXFE-PSTD-AM     PIC X(19).                      
10288D         06  AR70HD-REAG-RSLT-CD          PIC X(01).                      
10288D         06  AR70HD-REAG-PREV-RSLT-CD     PIC X(01).                      
4.0210     05  AR70-BEHAVIOR-SCORE-HISTORY OCCURS 1 TIMES.                      
MCR   **                         OCCURS 0 TO 1 TIMES                            
MCR   **                         DEPENDING ON AR70-NO-BEHAVIOR-SEGS.            
4.0210         06  AR70BS-PREV-STMT-FIELDS.                                     
98023G             07  AR70BS-PS-CASH           PIC X(19).                      
98023G             07  AR70BS-PS-SALES          PIC X(19).                      
98023G             07  AR70BS-PS-RETURNS        PIC X(19).                      
98023G             07  AR70BS-PS-PAYMENTS       PIC X(19).                      
4.054A         06  AR70BS-BEFORE-PREV-STMT OCCURS 11 TIMES.                     
4.0210             07  AR70BS-BPS-FIELDS.                                       
98023G                 08  AR70BS-BPS-CASH      PIC X(19).                      
98023G                 08  AR70BS-BPS-SALES     PIC X(19).                      
98023G                 08  AR70BS-BPS-RETURNS   PIC X(19).                      
98023G                 08  AR70BS-BPS-PAYMENTS  PIC X(19).                      
98023G             07  AR70BS-BPS-STMT-BAL      PIC X(19).                      
98023G             07  AR70BS-BPS-MIN-PAY-DUE   PIC X(19).                      
98023G             07  AR70BS-BPS-PAST-DUE      PIC X(19).                      
4.0210             07  AR70BS-BPS-STMT-DATE     PIC X(8).                       
98023G         06  AR70BS-PREV-CASH-BALS.                                       
98023G             07  AR70BS-CASH-BAL-3CYC     PIC X(19).                      
98023G             07  AR70BS-CASH-BAL-4CYC     PIC X(19).                      
98023G             07  AR70BS-CASH-BAL-5CYC     PIC X(19).                      
98023G             07  AR70BS-CASH-BAL-6CYC     PIC X(19).                      
98023G             07  AR70BS-CASH-BAL-7CYC     PIC X(19).                      
00287A         06  AR70BS-BPS-REVERSALS-CT      PIC X(4)                        
00287A                      OCCURS 11 TIMES.                                    
00287A         06  AR70BS-FINC-CHRG-AM          PIC X(15)                       
00287A                      OCCURS 4 TIMES.                                     
00287A         06  AR70BS-CRDT-LINE-AM          PIC X(16)                       
00287A                      OCCURS 5 TIMES.                                     
00300A         06  AR70BS-PS-PYMT-ONLY-AM      PIC X(19).                       
00300A         06  AR70BS-BPS-PYMT-ONLY-AM     PIC X(19)                        
00300A                      OCCURS 11 TIMES.                                    
04163C         06  AR70BS-PS-RVLV-MRCH-DBT-AM   PIC X(19).                      
04163C         06  AR70BS-PS-RVLV-CASH-DBT-AM   PIC X(19).                      
04163C         06  AR70BS-PS-RVLV-MRCH-CRDT-AM  PIC X(19).                      
04163C         06  AR70BS-PS-RVLV-CASH-CRDT-AM  PIC X(19).                      
06097C         06  AR70BS-BPS-NGTV-AMRT-AM      PIC X(19)                       
06097C                                           OCCURS 7 TIMES.                
06097C         06  FILLER                        PIC X.                         
           04  AR70-CURRENT-ACTIVITY-SEGMENT.                                   
98023G         05  AR70-CURRENT-BALANCE         PIC X(19).                      
04037B         05  AR70-REBT-PRIN-AM            PIC X(17).                      
04037B         05  FILLER                        PIC X(02).                     
4.0100         05  AR70-CRED-BAL-MIN-LEVEL-FLAG PIC X(2).                       
4.0100         05  AR70-CURR-BAL-MIN-LEVEL-FLAG PIC X.                          
02235A         05  AR70-CTD-DEF-INT             PIC X(19).                      
4.0100         05  AR70-AGG-CYCLE-DAYS          PIC X(4).                       
4.032A         05  AR70-SMBAL-MONTHS            PIC X(4).                       
4.032A         05  AR70-CHGMEOFF-TOMORROW       PIC X(2).                       
4.0100         05  AR70-CYCLE-TO-DATE-DATA.                                     
4.0100             06  AR70-CTD-COUNTS-AMTS.                                    
4.1800                 07  AR70-CTD-XCPT-ANN-CHG.                               
4.1800                     08  AR70-CTD-NO-SALE PIC X(4).                       
4.1800                     08  AR70-CTD-NO-CASH PIC X(4).                       
4.1800                     08  AR70-CTD-NO-RETURN PIC X(4).                     
4.1800                     08  AR70-CTD-NO-PAYMENT PIC X(4).                    
4.1800                     08  AR70-CTD-NO-ADJ  PIC X(4).                       
4.032A                     08  AR70-CTD-NO-ATESI PIC X(4).                      
4.1800                     08  AR70-CTD-NO-LOAN PIC X(4).                       
00287A                     08 AR70-CTD-REVERSALS-CT PIC X(4).                   
00287A                     08  AR70-CTD-RCNC-NR     PIC 9.                      
98023G                     08  AR70-CTD-AMT-SALE PIC X(19).                     
98023G                     08  AR70-CTD-AMT-CASH PIC X(19).                     
00287A                     08  AR70-CTD-AMT-RETURN                              
00287A                                            PIC X(19).                    
98023G                     08  AR70-CTD-AMT-PAYMENT                             
00287A                                            PIC X(19).                    
98023G                     08  AR70-CTD-AMT-LOAN PIC X(19).                     
98023G                 07  AR70-CTD-ANNUAL-CHARGE PIC X(19).                    
4.0100             06  AR70-CTD-UNPAID-BPDS.                                    
98023G                 07  AR70-CTD-UNPAID-BPD   PIC X(19).                     
00287A                 07 AR70-CTD-UNPAID-CASH-BPD                              
00287A                                            PIC X(19).                    
00287A                 07 AR70-CTD-UNPAID-LOAN-BPD                              
00287A                                            PIC X(19).                    
98023G                 07  AR70-CTD-PAY-AHEAD-AMT PIC X(19).                    
4.0101                 07  AR70-CTD-NO-MOS-PAY-AHEAD PIC X(2).                  
4.0100         05  AR70-CTD-CHARGES.                                            
02235A             06  AR70-CTD-AMT-LATE-CHG      PIC X(19).                    
02235A             06  AR70-CTD-AMT-ITEM-CHG      PIC X(19).                    
02235A             06  AR70-CTD-SALE-ITEM-CHGS    PIC X(19).                    
02235A             06  AR70-CTD-OVERLIMIT-CHG     PIC X(19).                    
98023G             06  AR70-CTD-AMT-DEBITS        PIC X(19).                    
98023G             06  AR70-CTD-EMP-DISC-AMT      PIC X(19).                    
02235A             06  AR70-CTD-AMT-MISC-CHGS     PIC X(19).                    
4.0100         05  AR70-INTEREST-ADD-ON-RATES.                                  
4.0100             06  AR70-CAINT-LS-RATE        PIC X(9).                      
4.0100             06  AR70-CAINT-CTD-RATE       PIC X(9).                      
4.0100             06  AR70-MRCHINT-RATE         PIC X(9).                      
4.0100             06  AR70-CREDINT-RATE         PIC X(9).                      
4.0100         05  AR70-INTEREST-AMOUNTS.                                       
98023G             06  AR70-CAINT-LS-AMT        PIC X(17).                      
98023G             06  AR70-CAINT-CTD-AMT       PIC X(17).                      
98023G             06  AR70-MRCHINT-AMT         PIC X(17).                      
98023G             06  AR70-CRDINT-AMT          PIC X(17).                      
4.0100         05  AR70-PAY-OFF-BAL-AMOUNTS.                                    
98023G             06  AR70-POB-RATE            PIC X(17).                      
98023G             06  AR70-POB-AMOUNT          PIC X(19).                      
00287A         05  AR70-CPO-PAY-OFF-BAL-FIELDS.                                 
00287A             06  AR70-CPO-POB-RATE        PIC X(17).                      
00287A             06  AR70-CPO-POB-AMOUNT      PIC X(19).                      
4.0100         05  AR70-APPLY-PAYMENT-SEGMENT.                                  
02235A             06  AR70AP-OPEN-CYC-INTSC      PIC X(19).                    
02235A             06  AR70AP-OPEN-CYC-CASH-INTSC PIC X(19).                    
98023G             06  AR70AP-OPEN-CYC-CASH-PRIN  PIC X(19).                    
98023G             06  AR70AP-OPEN-CYC-MRCH-NBINT PIC X(19).                    
98023G             06  AR70AP-OPEN-CYC-MRCH-BINT  PIC X(19).                    
98023G             06  AR70AP-OPEN-CYC-LOAN-PRIN  PIC X(19).                    
98023G             06  AR70AP-CURR-CTD-CASH-PRIN  PIC X(19).                    
98023G             06  AR70AP-CURR-CTD-MRCH-PRIN  PIC X(19).                    
98023G             06  AR70AP-DISPUTED-AMOUNT     PIC X(19).                    
98023G             06  AR70AP-MISCELLANEOUS       PIC X(19).                    
98023G             06  AR70TAP-BINT               PIC X(19).                    
98023G             06  AR70TAP-CASH               PIC X(19).                    
98023G             06  AR70-OVERPAYMENT-AMT       PIC X(19).                    
98023G             06  AR70AP-MISC-CHGS           PIC X(19).                    
00287A             06 AR70AP-REPORTABLE-UNPAID-INT                              
02235A                                             PIC X(19).                   
00287A*        05  AR70AP-OTHER-FIELDS.                                         
00287A             06  AR70AP-OPEN-CYC-FLAP-PRIN  PIC X(19).                    
00287A             06  AR70AP-SRCHG-FIELDS.                                     
00287A                 07  AR70AP-SRCHG-AM        PIC X(19).                    
00287A             06  AR70TAP-NBINT              PIC X(19).                    
00287A             06  AR70TAP-CYC-CASH           PIC X(19).                    
00287A             06  AR70TAP-CYC-MRCH           PIC X(19).                    
00287A             06  AR70AP-UNPD-FLDS.                                        
00287A                 07  AR70AP-UNPD-ANNL-CHRG-AM                             
00287A                                             PIC X(19).                   
00287A                 07  AR70AP-UNPD-LATE-CHRG-AM                             
00287A                                             PIC X(19).                   
00287A                 07  AR70AP-UNPD-CASH-ITEM-AM                             
00287A                                             PIC X(19).                   
00287A                 07  AR70AP-UNPD-SALE-ITEM-AM                             
00287A                                             PIC X(19).                   
00287A                 07  AR70AP-UNPD-OVRL-CHRG-AM                             
00287A                                             PIC X(19).                   
00287A                 07  AR70AP-UNPD-CRDLF-PRMM-AM                            
00287A                                             PIC X(19).                   
00287A             06  AR70AP-MUF-FIELDS.                                       
00287A                 07  AR70AP-MRCH-MUF        PIC X(19).                    
00287A                 07  AR70AP-CASH-MUF        PIC X(19).                    
02235A                 07  AR70AP-MUF-MRCH-INTSC  PIC X(19).                    
02235A                 07  AR70AP-MUF-CASH-INTSC  PIC X(19).                    
00287A                 07  AR70AP-MUF-DISPUTE     PIC X(19).                    
00287A                 07  AR70AP-MUF-FILLER1                                   
02235A                                             PIC X(19).                   
00287A                 07  AR70AP-MUF-FILLER2                                   
02235A                                             PIC X(19).                   
00287A             06  AR70-CTD-SRCHG-FIELDS.                                   
00287A                 07  AR70-CTD-SRCHG-AM OCCURS 5 TIMES                     
02235A                                             PIC X(19).                   
11203D             06  AR70-CTD-MXMZ-INTR-AM      PIC X(19).                    
4.032A         05  AR70-BKDT-AGG-FIELDS.                                        
98023G             06  AR70-BKDT-AGG-CURR-SALES   PIC X(19).                    
98023G             06  AR70-BKDT-AGG-CURR-CASH    PIC X(19).                    
98023G             06  AR70-BKDT-AGG-LS-SALES     PIC X(19).                    
98023G             06  AR70-BKDT-AGG-LS-CASH      PIC X(19).                    
4.0100         05  AR70-FIXED-PAYMENT-SCHEDULE.                                 
4.037A             06  AR70-FPS-NMDSREC.                                        
98023G                 07  AR70-FPS-PAY-1         PIC X(19).                    
98023G                 07  AR70-FPS-PAY-2         PIC X(19).                    
98023G                 07  AR70-FPS-PAY-3         PIC X(19).                    
98023G             06  AR70-FPS-PAY-4             PIC X(19).                    
98023G             06  AR70-FPS-PAY-5             PIC X(19).                    
98023G             06  AR70-FPS-PAY-6             PIC X(19).                    
4.031A         05  AR70-OVERLIMIT-TYPE-FLAG       PIC X.                        
4.033D         05  AR70-DEBIT-TRAN-POSTED         PIC X.                        
98023G         05  AR70-CTD-UNPAID-FLAP-BPD       PIC X(19).                    
4.065A         05  AR70-CUR-LATE-PYMT-DAYS        PIC X(4).                     
4.071D         05  AR70LS-PP-DELINQ-LEVEL         PIC X(2).                     
4.071E         05  AR70-ASSOC-CTD-NO-ADJ          PIC X(4).                     
00084A         05  AR70-GROP-OFEE-NEXT-DAY-CD     PIC X(1).                     
00287A         05  AR70-CURR-ANNUAL-CHARGES-BILD                                
02235A                                             PIC X(19).                   
02235A         05  AR70-CURR-OTHER-CHARGES-BILLED PIC X(19).                    
02235A         05  AR70-CTD-AMT-IVA               PIC X(19).                    
98023G         05  AR70-CURR-REVOLV-AMT           PIC X(19).                    
98023G         05  AR70-LAST-REVOLV-AMT           PIC X(19).                    
98023G         05  AR70-CTD-SALE-ADJ              PIC X(19).                    
98023G         05  AR70-CTD-CASH-ADJ              PIC X(19).                    
98023G         05  AR70-CTD-RTRN-ADJ              PIC X(19).                    
00287A         05  AR70-CTD-CBR-PRTN-QLFD-PRCH-NR PIC X(4).                     
00287A         05  AR70-CTD-CBR-PRTN-QLFD-PRCH-AM                               
00287A                                             PIC X(19).                   
00287A         05  AR70-PYMT-DUE-RLJL-DT          PIC X(4).                     
00287A         05  AR70-LATE-CHRG-RLJL-DT         PIC X(4).                     
02235A         05  AR70-PAY-AHED-ACTN-CD          PIC X.                        
03038A         05  AR70AP-FLAP-SUMMARY.                                         
03038A             06  AR70-MUF-CTD-LATE-CHRG-AM     PIC X(19).                 
03038A             06  AR70AP-MUF-UNPD-LATE-CHRG-AM  PIC X(19).                 
03038A             06  AR70-MUF-CTD-OVRL-CHRG-AM     PIC X(19).                 
03038A             06  AR70AP-MUF-UNPD-OVRL-CHRG-AM  PIC X(19).                 
03038A             06  FILLER                        PIC X(19).                 
03038A             06  AR70AP-MUF-UNPD-CRDT-LIFE-AM  PIC X(19).                 
03038A             06  AR70-MUF-CTD-MSCL-CHRG-AM     PIC X(19).                 
03038A             06  AR70AP-MUF-UNPD-MSCL-CHRG-AM  PIC X(19).                 
03038A             06  AR70-MUF-CTD-ANNL-CHRG-AM     PIC X(19).                 
03038A             06  AR70AP-MUF-UNPD-ANNL-CHRG-AM  PIC X(19).                 
03038A             06  AR70-MUF-CTD-SRCH-AM          PIC X(19).                 
03038A             06  AR70AP-MUF-UNPD-SRCH-AM       PIC X(19).                 
03038A             06  AR70-MUF-CTD-ITEM-CHRG-AM     PIC X(19).                 
03038A             06  AR70AP-MUF-UNPD-ITEM-CHRG-AM  PIC X(19).                 
03038A             06  FILLER                        PIC X(19).                 
03276B             06  FILLER                        PIC X(19).                 
03276B             06  AR70AP-MUF-CRDT-BLNC-AM       PIC X(19).                 
03276A         05  AR70-CTD-FRGN-CNCY-CHRG-AM     PIC X(19).                    
05273C         05  AR70-CTD-LATE-CHRG-CNSC-CT     PIC X(4).                     
05273C         05  AR70-CTD-OVRL-CHRG-CNSC-CT     PIC X(4).                     
06097C         05  AR70-CTD-LATE-FEE-NNSS-IN      PIC X.                        
06097C         05  AR70-CTD-OVRL-FEE-NNSS-IN      PIC X.                        
06097C         05  AR70-CTD-LATE-FEE-NNSS-DT      PIC X(10).                    
06097C         05  AR70-CTD-OVRL-FEE-NNSS-DT      PIC X(10).                    
07285A         05  AR70AP-TOTL-MMB-AM             PIC X(19).                    
07285C         05  AR70-CTD-XTRN-FEES-AM          PIC X(19).                    
08025A         05  AR70-CTD-PYMT-ONLY-AM          PIC X(19).                    
10106A         05  AR70AP-UNPD-FRGN-CHRG-AM       PIC X(19).                    
11105B         05  AR70-FLAP-SSPN-CD              PIC 9.                        
11105B         05  FILLER                          PIC X(05).                   
4.0100         05  AR70-LAST-STATEMENT.                                         
98023G             06  AR70-LAST-STATEMENTED-BAL  PIC X(19).                    
4.0100             06  AR70LS-PRINCIPALS.                                       
02235A                 07  AR70LS-UNPAID-INTSC    PIC X(19).                    
00287A                 07  AR70LS-UNPAID-CASH-INTSC                             
02235A                                             PIC X(19).                   
98023G                 07  AR70LS-END-CASH        PIC X(19).                    
98023G                 07  AR70LS-END-MRCH-NBINT  PIC X(19).                    
98023G                 07  AR70LS-END-MRCH-BINT   PIC X(19).                    
98023G                 07  AR70LS-END-LOAN        PIC X(19).                    
98023G                 07  AR70LS-CYC-CASH        PIC X(19).                    
98023G                 07  AR70LS-CYC-MRCH        PIC X(19).                    
98023G                 07  AR70LS-DISPUTED-AMOUNT PIC X(19).                    
98023G                 07  AR70LS-MISCELLANEOUS   PIC X(19).                    
98023G                 07  AR70LS-TEMP-BINT       PIC X(19).                    
98023G                 07  AR70LS-TEMP-CASH       PIC X(19).                    
98023G                 07  AR70LS-OVERPAYMENT-AMT PIC X(19).                    
98023G                 07  AR70LS-MISC-CHGS       PIC X(19).                    
00287A                 07  AR70LS-REPORT-UNPAID-INT                             
02235A                                             PIC X(19).                   
00287A                 07  AR70LS-FLAP-BALANCE    PIC X(19).                    
00287A                 07  AR70LS-SRCHG-AP-FIELDS.                              
00287A                     08 AR70LS-UNPD-SRCHG-AM                              
00287A                                             PIC X(19).                   
00287A                 07  AR70LS-TEMP-NBINT      PIC X(19).                    
00287A                 07  AR70LS-TEMP-CYC-CASH   PIC X(19).                    
00287A                 07  AR70LS-TEMP-CYC-MRCH   PIC X(19).                    
00287A                 07  AR70LS-UNPD-FLDS.                                    
00287A                     08  AR70LS-UNPD-ANNL-CHRG-AM                         
00287A                                             PIC X(19).                   
00287A                     08  AR70LS-UNPD-LATE-CHRG-AM                         
00287A                                             PIC X(19).                   
00287A                     08  AR70LS-UNPD-CASH-ITEM-AM                         
00287A                                             PIC X(19).                   
00287A                     08  AR70LS-UNPD-SALE-ITEM-AM                         
00287A                                             PIC X(19).                   
00287A                     08  AR70LS-UNPD-OVRL-CHRG-AM                         
00287A                                             PIC X(19).                   
00287A                     08  AR70LS-UNPD-CRDLF-PRMM-AM                        
00287A                                             PIC X(19).                   
00287A                 07  AR70LS-MUF-FIELDS.                                   
00287A                     08  AR70LS-MRCH-MUF    PIC X(19).                    
00287A                     08  AR70LS-CASH-MUF    PIC X(19).                    
00287A                     08  AR70LS-MUF-MRCH-INTSC                            
02235A                                             PIC X(19).                   
00287A                     08  AR70LS-MUF-CASH-INTSC                            
02235A                                             PIC X(19).                   
00287A                     08  AR70LS-MUF-DISPUTE PIC X(19).                    
00287A                     08  AR70LS-MRCH-MUF-INT                              
02235A                                             PIC X(19).                   
00287A                     08  AR70LS-CASH-MUF-INT                              
02235A                                             PIC X(19).                   
00287A                 07  AR70LS-SRCHG-FIELDS.                                 
02235A                     08  AR70LS-SRCHG-AM    PIC X(19)                     
00287A                             OCCURS 5 TIMES.                              
00287A                 07  AR70LS-REAL-INT-AM     PIC X(19).                    
4.0100             06  AR70LS-PRINCIPALS-R REDEFINES AR70LS-PRINCIPALS.         
                       07  AR70LS-PRINCIPAL-AMTS  PIC X(19)                     
                           OCCURS 39 TIMES.                                     
                   06  AR70LS-DEFERRED-AVERAGES.                                
98023G                 07  AR70LS-DEF-AVE         PIC X(19).                    
98023G                 07  AR70LS-DEF-AVE-2       PIC X(19).                    
4.0100             06  AR70LS-FINANCE-CHGS.                                     
02235A                 07  AR70LS-CASH-INT        PIC X(19).                    
02235A                 07  AR70LS-MRCH-INT        PIC X(19).                    
02235A                 07  AR70LS-CREDIT-INT      PIC X(19).                    
02235A                 07  AR70LS-LATE-CHG        PIC X(19).                    
02235A                 07  AR70LS-CR-LIFE-CHG     PIC X(19).                    
02235A                 07  AR70LS-ITEM-CHG        PIC X(19).                    
02235A                 07  AR70LS-OVERLIMIT-CHG   PIC X(19).                    
02235A                 07  AR70LS-MIN-CHG         PIC X(19).                    
02235A                 07  AR70LS-SALE-ITEM-CHGS  PIC X(19).                    
BASK               06  AR70LS-FINANCE-CHGS-R REDEFINES                          
BASK                   AR70LS-FINANCE-CHGS.                                     
BASK                   07  AR70LS-FIN-CHRG-AMTS   PIC X(19)                     
BASK                       OCCURS 9 TIMES.                                      
4.0100             06  AR70LS-MISC-DATA.                                        
98023G                 07  AR70LS-BILLED-PAY-DUE  PIC X(19).                    
98023G                 07  AR70LS-CASH-BPD        PIC X(19).                    
98023G                 07  AR70LS-LOAN-BPD        PIC X(19).                    
98023G                 07  AR70LS-PAY-AHEAD-AMT   PIC X(19).                    
4.0101                 07  AR70LS-NO-MOS-PAY-AHEAD PIC X(2).                    
4.0100                 07  AR70LS-CHGOFF-INDIC    PIC X(5).                     
4.0100                 07  AR70LS-SPEC-RATE-FLAG  PIC X.                        
00287A                 07  AR70LS-CRED-BAL-MIN-LEVEL-FLAG                       
00287A                                             PIC X(2).                    
4.0100                 07  AR70LS-CURR-BAL-MIN-LEVEL-FLAG PIC X.                
02235A                 07  AR70LS-REBATE-AMT      PIC X(19).                    
00287A                 07  AR70-LS-REVERSALS-CT   PIC X(4).                     
00287A                 07  AR70-LS-RCNC-NR        PIC 9.                        
00287A                 07  AR70LS-CRDT-LIFE-BASE-AM                             
00287A                                             PIC X(19).                   
98023G             06  AR70LS-CASH-IPP            PIC X(19).                    
98023G             06  AR70LS-MRCH-IPP            PIC X(19).                    
02235A             06  AR70LS-FLAP-INT            PIC X(19).                    
98023G             06  AR70LS-FLAP-BPD            PIC X(19).                    
98023G             06  AR70LS-TEMP-DEF-AVE-MRCH   PIC X(19).                    
98023G             06  AR70LS-TEMP-DEF-AVE-CASH   PIC X(19).                    
4.065A             06  AR70-LS-LATE-PYMT-DAYS      PIC X(4).                    
98023G             06  AR70LS-ADJUSTED-BALANCE    PIC X(19).                    
4.073B             06  AR70LS-CREDIT-MONTHS       PIC X(2).                     
02235A             06  AR70LS-DVRS-FEES-AM        PIC X(19).                    
00287A             06 AR70LS-ANNUAL-CHARGES-BILLED                              
02235A                                             PIC X(19).                   
00287A             06  AR70LS-OTHER-CHARGES-BILLED                              
02235A                                             PIC X(19).                   
02235A             06  AR70LS-AMT-IVA             PIC X(19).                    
4.072H             06  AR70LS-CREDIT-LIFE-INSURANCE OCCURS 6 TIMES.             
02235A                 07  AR70LS-CLI-PREMIUM     PIC X(19).                    
4.072H                 07  AR70LS-CLI-COMPL-WAIVED PIC X.                       
00287A         05  AR70LS-REMAINING-FIELDS.                                     
00287A             06  AR70LS-NO-FEES-CD          PIC X.                        
00287A             06  AR70-LS-INTEREST-SWITCH    PIC X.                        
00287A             06  AR70-LS-ANN-INT-RATES.                                   
00287A                 07  AR70-LS-MRCH-APR       PIC X(7).                     
00287A                 07  AR70-LS-CASH-APR       PIC X(7).                     
00287A                 07  AR70-LS-TEMP-MRCH-APR  PIC X(7).                     
00287A                 07  AR70-LS-TEMP-CASH-APR  PIC X(7).                     
00287A             06  AR70LS-ADD-TIMING-CD       PIC X.                        
00287A             06  AR70LS-USED-BRKPTS-CD      PIC X.                        
02235A             06  AR70LS-BONUS-EXCLUDE-AMT   PIC X(19).                    
00287A             06  AR70-LS-CASH-SALE-AM.                                    
00287A                 07  AR70-LS-AMT-CASH-AM    PIC X(19).                    
00287A                 07  AR70-LS-AMT-SALE-AM    PIC X(19).                    
00287A             06  AR70-LS-CBRN-PRTN-QLFD-PRCH-NR                           
00287A                                             PIC X(4).                    
00287A             06  AR70-LS-CBRN-PRTN-QLFD-PRCH-AM                           
00287A                                             PIC X(19).                   
00287A             06  AR70LS-IP-FLAG             PIC X.                        
00287A             06  AR70LS-IP-CASH-RATE-ANN    PIC X(7).                     
00287A             06  AR70LS-IP-MRCH-RATE-ANN    PIC X(7).                     
00287A             06  AR70-LS-NO-SALE            PIC X(4).                     
00287A             06  AR70-LS-NO-CASH            PIC X(4).                     
00287A             06  AR70-LS-NO-RETURN          PIC X(4).                     
00287A             06  AR70-LS-NO-PAYMENT         PIC X(4).                     
00287A             06  AR70-LS-AMT-RETURN         PIC X(19).                    
00287A             06  AR70-LS-AMT-PAYMENT        PIC X(19).                    
00287A             06  AR70LS-PYMT-DUE-RLJL-DT    PIC X(4).                     
02235A             06  AR70LS-BILL-FOR-BLNC-CD    PIC X.                        
03038A         05  AR70LS-FLAP-SUMMARY.                                         
03038A             06  AR70LS-MUF-LATE-CHRG-AM       PIC X(19).                 
03038A             06  AR70LS-MUF-UNPD-LATE-CHRG-AM  PIC X(19).                 
03038A             06  AR70LS-MUF-OVRL-CHRG-AM       PIC X(19).                 
03038A             06  AR70LS-MUF-UNPD-OVRL-CHRG-AM  PIC X(19).                 
03038A             06  AR70LS-MUF-CRDT-LIFE-AM       PIC X(19).                 
03038A             06  AR70LS-MUF-UNPD-CRDT-LIFE-AM  PIC X(19).                 
03038A             06  AR70LS-MUF-CTD-MSCL-CHRG-AM   PIC X(19).                 
03038A             06  AR70LS-MUF-UNPD-MSCL-CHRG-AM  PIC X(19).                 
03038A             06  AR70LS-MUF-CTD-ANNL-CHRG-AM   PIC X(19).                 
03038A             06  AR70LS-MUF-UNPD-ANNL-CHRG-AM  PIC X(19).                 
03038A             06  AR70LS-MUF-CTD-SRCH-AM        PIC X(19).                 
03038A             06  AR70LS-MUF-UNPD-SRCH-AM       PIC X(19).                 
03038A             06  AR70LS-MUF-CTD-ITEM-CHRG-AM   PIC X(19).                 
03038A             06  AR70LS-MUF-UNPD-ITEM-CHRG-AM  PIC X(19).                 
03038A             06  AR70LS-MUF-MIN-FIN-CHRG-AM    PIC X(19).                 
03157B             06  AR70LS-CRDT-CRRN-CHRG-AM      PIC X(19).                 
03276B             06  AR70LS-MUF-CRDT-BLNC-AM       PIC X(19).                 
BASK           05  AR70LS-FLAP-SUMMARY-R REDEFINES                              
BASK               AR70LS-FLAP-SUMMARY.                                         
BASK               06  AR70LS-FLAP-SUMMARY-AMTS      PIC X(19)                  
BASK                   OCCURS 17 TIMES.                                         
03276A         05  AR70LS-FRGN-CNCY-CHRG-AM      PIC X(19).                     
04275C         05  AR70LS-PTNT-RWRD-AM           PIC X(19).                     
04275B         05  AR70LS-OVRL-CNSC-CYCL-CT      PIC X(4).                      
05273C         05  AR70LS-LATE-CHRG-CNSC-CT  PIC X(4).                          
05273C         05  AR70LS-OVRL-CHRG-CNSC-CT  PIC X(4).                          
06034D         05  AR70LS-PYFF-EXCP-18-CD    PIC X.                             
06097C         05  AR70-LS-LATE-FEE-NNSS-IN      PIC X.                         
06097C         05  AR70-LS-OVRL-FEE-NNSS-IN      PIC X.                         
06097C         05  AR70-LS-LATE-FEE-NNSS-DT      PIC X(10).                     
06097C         05  AR70-LS-OVRL-FEE-NNSS-DT      PIC X(10).                     
06097C         05  AR70-LS-NGTV-AMRT-AM          PIC X(19).                     
06097C         05  AR70-LS-LONG-NGTV-AMRT-AM     PIC X(19).                     
06097C         05  AR70-LS-SHRT-TERM-AMRT-CT     PIC X(4).                      
06097C         05  AR70-LS-LONG-TERM-AMRT-CT     PIC X(4).                      
07285A         05  AR70-LS-TOTL-MMB-AM           PIC X(19).                     
07285C         05  AR70LS-XTRN-FEES-AM           PIC X(19).                     
07285C         05  AR70LS-MXCP-EAPR-CRDT-AM      PIC X(19).                     
07285C         05  AR70LS-MXCP-EAPR-PRIN-AM      PIC X(19).                     
08025A         05  AR70LS-PYMT-ONLY-AM           PIC X(19).                     
08025F         05  AR70LS-1098-INTR-PAID-THRD-AM PIC X(19).                     
08025F         05  AR70LS-1098-INTR-PAID-TOTL-AM PIC X(19).                     
09023A         05  AR70LS-CLI-CONT OCCURS 6 TIMES.                              
09023A             06  AR70LS-CLI-PRMM-ADJ-AM    PIC X(19).                     
09023A             06  AR70LS-CLI-ADJ-DAYS-CT    PIC X(4).                      
09205A         05  AR70LS-RULS-DATA-1-AM         PIC X(17).                     
09205A         05  AR70LS-RULS-DATA-2-AM         PIC X(17).                     
09205A         05  AR70LS-RULS-DATA-3-AM         PIC X(17).                     
09205A         05  AR70LS-RULS-DATA-4-AM         PIC X(17).                     
09205A         05  AR70LS-RULS-DATA-5-AM         PIC X(17).                     
10022A         05  AR70-LS-FRST-PERD-DAYS-CT      PIC X(4).                     
10022A         05  AR70-LS-FRST-PERD-MRCH-ANNL-RT PIC X(7).                     
10022A         05  AR70-LS-FRST-PERD-CASH-ANNL-RT PIC X(7).                     
10022A         05  AR70-LS-FRST-PERD-MRCH-ADB-AM  PIC X(19).                    
10022A         05  AR70-LS-FRST-PERD-CASH-ADB-AM  PIC X(19).                    
10022H         05  AR70-LS-PYFF-EXCP-CODES.                                     
10022H            10  AR70-LS-PYFF-EXCP-RVLV-CD  PIC X OCCURS 5 TIMES.          
10022H         05  FILLER REDEFINES AR70-LS-PYFF-EXCP-CODES.                    
10022H            10 AR70-LS-PYFF-EXCP-BINT-CD      PIC X.                      
10022H            10 AR70-LS-PYFF-EXCP-NBINT-CD     PIC X.                      
10022H            10 AR70-LS-PYFF-EXCP-CTD-MRCH-CD  PIC X.                      
10022H            10 AR70-LS-PYFF-EXCP-OLD-CASH-CD  PIC X.                      
10022H            10 AR70-LS-PYFF-EXCP-CTD-CASH-CD  PIC X.                      
10106A         05  AR70LS-UNPD-FRGN-CHRG-AM      PIC X(19).                     
10106B         05  AR70LS-RULS-DATA-1-CD          PIC X.                        
11105B         05  AR70LS-FLAP-SSPN-CD           PIC 9.                         
11203A         05  AR70LS-AVOD-FINC-CHRG-AM      PIC X(19).                     
11203B         05  AR70HD-ANNL-PRNT-DT           PIC X(10).                     
11203B         05  AR70HD-ANNL-PRNT-AM           PIC X(19).                     
11203D         05  AR70LS-MXMZ-INTR-AM           PIC X(19).                     
11203D         05  FILLER                         PIC X(14).                    
4.0100         05  AR70-PREVIOUS-STATEMENT.                                     
98023G             06  AR70PS-BALANCE             PIC X(19).                    
4.0100             06  AR70PS-PRINCIPALS.                                       
02235A                 07  AR70PS-UNPAID-INTSC    PIC X(19).                    
00287A                 07  AR70PS-UNPAID-CASH-INTSC                             
02235A                                             PIC X(19).                   
98023G                 07  AR70PS-END-CASH        PIC X(19).                    
98023G                 07  AR70PS-END-MRCH-NBINT  PIC X(19).                    
98023G                 07  AR70PS-END-MRCH-BINT   PIC X(19).                    
98023G                 07  AR70PS-END-LOAN        PIC X(19).                    
98023G                 07  AR70PS-CYC-CASH        PIC X(19).                    
98023G                 07  AR70PS-CYC-MRCH        PIC X(19).                    
98023G                 07  AR70PS-DISPUTED-AMOUNT PIC X(19).                    
98023G                 07  AR70PS-MISCELLANEOUS   PIC X(19).                    
98023G                 07  AR70PS-TEMP-BINT       PIC X(19).                    
98023G                 07  AR70PS-TEMP-CASH       PIC X(19).                    
98023G                 07  AR70PS-OVERPAYMENT-AMT PIC X(19).                    
98023G                 07  AR70PS-MISC-CHGS       PIC X(19).                    
00287A                 07  AR70PS-REPORT-UNPAID-INT                             
02235A                                             PIC X(19).                   
00287A                 07  AR70PS-FLAP-BALANCE    PIC X(19).                    
00287A                 07  AR70PS-SRCHG-AP-FIELDS.                              
00287A                     08  AR70PS-UNPD-SRCHG-AM                             
00287A                                             PIC X(19).                   
00287A                 07  AR70PS-TEMP-NBINT      PIC X(19).                    
00287A                 07  AR70PS-TEMP-CYC-CASH   PIC X(19).                    
00287A                 07  AR70PS-TEMP-CYC-MRCH   PIC X(19).                    
00287A                 07  AR70PS-UNPD-FLDS.                                    
00287A                     08  AR70PS-UNPD-ANNL-CHRG-AM                         
00287A                                             PIC X(19).                   
00287A                     08  AR70PS-UNPD-LATE-CHRG-AM                         
00287A                                             PIC X(19).                   
00287A                     08  AR70PS-UNPD-CASH-ITEM-AM                         
00287A                                             PIC X(19).                   
00287A                     08  AR70PS-UNPD-SALE-ITEM-AM                         
00287A                                             PIC X(19).                   
00287A                     08  AR70PS-UNPD-OVRL-CHRG-AM                         
00287A                                             PIC X(19).                   
00287A                     08  AR70PS-UNPD-CRDLF-PRMM-AM                        
00287A                                             PIC X(19).                   
00287A                 07  AR70PS-MUF-FIELDS.                                   
00287A                     08  AR70PS-MRCH-MUF    PIC X(19).                    
00287A                     08  AR70PS-CASH-MUF    PIC X(19).                    
00287A                     08  AR70PS-MUF-MRCH-INTSC                            
02235A                                             PIC X(19).                   
00287A                     08  AR70PS-MUF-CASH-INTSC                            
02235A                                             PIC X(19).                   
00287A                     08  AR70PS-MUF-DISPUTE PIC X(19).                    
00287A                     08  AR70PS-MRCH-MUF-INT                              
02235A                                             PIC X(19).                   
00287A                     08  AR70PS-CASH-MUF-INT                              
02235A                                             PIC X(19).                   
00287A                 07  AR70PS-SRCHG-FIELDS.                                 
02235A                     08  AR70PS-SRCHG-AM    PIC X(19)                     
00287A                             OCCURS 5 TIMES.                              
00287A                 07  AR70PS-REAL-INT-AM     PIC X(19).                    
BASKA              06  AR70PS-PRINCIPALS-R REDEFINES AR70PS-PRINCIPALS.         
BASKA                  07  AR70PS-PRINCIPALS-AMTS PIC X(19)                     
BASKA                      OCCURS 39 TIMES.                                     
BASKA              06  AR70PS-DEFERRED-AVERAGES.                                
98023G                 07  AR70PS-DEF-AVE         PIC X(19).                    
98023G                 07  AR70PS-DEF-AVE-2       PIC X(19).                    
4.0100             06  AR70PS-FINANCE-CHGS.                                     
02235A                 07  AR70PS-CASH-INT        PIC X(19).                    
02235A                 07  AR70PS-MRCH-INT        PIC X(19).                    
02235A                 07  AR70PS-CREDIT-INT      PIC X(19).                    
02235A                 07  AR70PS-LATE-CHG        PIC X(19).                    
02235A                 07  AR70PS-CR-LIFE-CHG     PIC X(19).                    
02235A                 07  AR70PS-ITEM-CHG        PIC X(19).                    
02235A                 07  AR70PS-OVERLIMIT-CHG   PIC X(19).                    
02235A                 07  AR70PS-MIN-CHG         PIC X(19).                    
02235A                 07  AR70PS-SALE-ITEM-CHGS  PIC X(19).                    
BASK               06  AR70PS-FINANCE-CHGS-R REDEFINES                          
BASK                   AR70PS-FINANCE-CHGS.                                     
BASK                   07  AR70PS-FIN-CHRG-AMTS   PIC X(19)                     
BASK                       OCCURS 9 TIMES.                                      
                   06  AR70PS-MISC-DATA.                                        
98023G                 07  AR70PS-BILLED-PAY-DUE  PIC X(19).                    
98023G                 07  AR70PS-CASH-BPD        PIC X(19).                    
98023G                 07  AR70PS-LOAN-BPD        PIC X(19).                    
98023G                 07  AR70PS-PAY-AHEAD-AMT   PIC X(19).                    
4.0101                 07  AR70PS-NO-MOS-PAY-AHEAD PIC X(2).                    
4.0100                 07  AR70PS-CHGOFF-INDIC    PIC X(5).                     
4.0100                 07  AR70PS-SPEC-RATE-FLAG  PIC X.                        
00287A                 07  AR70PS-CRED-BAL-MIN-LEVEL-FLAG                       
00287A                                             PIC X(2).                    
4.0100                 07  AR70PS-CURR-BAL-MIN-LEVEL-FLAG PIC X.                
02235A                 07  AR70PS-REBATE-AMT      PIC X(19).                    
00287A                 07  AR70BS-PS-REVERSALS-CT PIC X(4).                     
00287A                 07  AR70-PS-RCNC-NR        PIC 9.                        
00287A                 07  AR70PS-CRDT-LIFE-BASE-AM                             
00287A                                             PIC X(19).                   
98023G             06  AR70PS-CASH-IPP            PIC X(19).                    
98023G             06  AR70PS-MRCH-IPP            PIC X(19).                    
02235A             06  AR70PS-FLAP-INT            PIC X(19).                    
98023G             06  AR70PS-FLAP-BPD            PIC X(19).                    
98023G             06  AR70PS-TEMP-DEF-AVE-MRCH   PIC X(19).                    
98023G             06  AR70PS-TEMP-DEF-AVE-CASH   PIC X(19).                    
4.065A             06  AR70-PS-LATE-PYMT-DAYS     PIC X(4).                     
98023G             06  AR70PS-ADJUSTED-BALANCE    PIC X(19).                    
4.073B             06  AR70PS-CREDIT-MONTHS       PIC X(2).                     
02235A             06  AR70PS-DVRS-FEES-AM        PIC X(19).                    
00287A             06  AR70PS-ANNUAL-CHARGES-BILLED                             
02235A                                             PIC X(19).                   
00287A             06  AR70PS-OTHER-CHARGES-BILLED                              
02235A                                             PIC X(19).                   
02235A             06  AR70PS-AMT-IVA             PIC X(19).                    
00287A             06  AR70PS-CREDIT-LIFE-INSURANCE OCCURS 6 TIMES.             
02235A                 07  AR70PS-CLI-PREMIUM     PIC X(19).                    
00287A                 07  AR70PS-CLI-COMPL-WAIVED PIC X.                       
00287A         05  AR70PS-REMAINING-FIELDS.                                     
00287C             06  AR70PS-CASH-APR-RT         PIC X(7).                     
00287C             06  AR70PS-MRCH-APR-RT         PIC X(7).                     
00287A             06  AR70PS-PYMT-DUE-RLJL-DT    PIC X(4).                     
02235A             06  AR70PS-BILL-FOR-BLNC-CD    PIC X.                        
02235B             06  AR70-PS-CASH-SALE-AM.                                    
02235B                 07  AR70-PS-AMT-CASH-AM    PIC X(19).                    
02235B                 07  AR70-PS-AMT-SALE-AM    PIC X(19).                    
03038A         05  AR70PS-FLAP-SUMMARY.                                         
03038A             06  AR70PS-MUF-LATE-CHRG-AM       PIC X(19).                 
03038A             06  AR70PS-MUF-UNPD-LATE-CHRG-AM  PIC X(19).                 
03038A             06  AR70PS-MUF-OVRL-CHRG-AM       PIC X(19).                 
03038A             06  AR70PS-MUF-UNPD-OVRL-CHRG-AM  PIC X(19).                 
03038A             06  AR70PS-MUF-CRDT-LIFE-AM       PIC X(19).                 
03038A             06  AR70PS-MUF-UNPD-CRDT-LIFE-AM  PIC X(19).                 
03038A             06  AR70PS-MUF-CTD-MSCL-CHRG-AM   PIC X(19).                 
03038A             06  AR70PS-MUF-UNPD-MSCL-CHRG-AM  PIC X(19).                 
03038A             06  AR70PS-MUF-CTD-ANNL-CHRG-AM   PIC X(19).                 
03038A             06  AR70PS-MUF-UNPD-ANNL-CHRG-AM  PIC X(19).                 
03038A             06  AR70PS-MUF-CTD-SRCH-AM        PIC X(19).                 
03038A             06  AR70PS-MUF-UNPD-SRCH-AM       PIC X(19).                 
03038A             06  AR70PS-MUF-CTD-ITEM-CHRG-AM   PIC X(19).                 
03038A             06  AR70PS-MUF-UNPD-ITEM-CHRG-AM  PIC X(19).                 
03038A             06  AR70PS-MUF-MIN-FIN-CHRG-AM    PIC X(19).                 
03157B             06  AR70PS-CRDT-CRRN-CHRG-AM      PIC X(19).                 
03276B             06  AR70PS-MUF-CRDT-BLNC-AM       PIC X(19).                 
BASK           05  AR70PS-FLAP-SUMMARY-R REDEFINES                              
BASK               AR70PS-FLAP-SUMMARY.                                         
BASK               06  AR70PS-FLAP-SUMMARY-AMTS      PIC X(19)                  
BASK                   OCCURS 17 TIMES.                                         
03276A         05  AR70PS-FRGN-CNCY-CHRG-AM       PIC X(19).                    
04275C         05  AR70PS-PTNT-RWRD-AM            PIC X(19).                    
07285A         05  AR70-PS-TOTL-MMB-AM            PIC X(19).                    
07285C         05  AR70PS-XTRN-FEES-AM            PIC X(19).                    
07285C         05  AR70PS-MXCP-EAPR-CRDT-AM       PIC X(19).                    
07285C         05  AR70PS-MXCP-EAPR-PRIN-AM       PIC X(19).                    
08025F         05  AR70PS-1098-INTR-PAID-THRD-AM  PIC X(19).                    
08025F         05  AR70PS-1098-INTR-PAID-TOTL-AM  PIC X(19).                    
09023A         05  AR70PS-CLI-CONT OCCURS 6 TIMES.                              
09023A             06  AR70PS-CLI-PRMM-ADJ-AM     PIC X(19).                    
09023A             06  AR70PS-CLI-ADJ-DAYS-CT     PIC X(4).                     
09205A         05  AR70PS-RULS-DATA-1-AM          PIC X(17).                    
09205A         05  AR70PS-RULS-DATA-2-AM          PIC X(17).                    
09205A         05  AR70PS-RULS-DATA-3-AM          PIC X(17).                    
09205A         05  AR70PS-RULS-DATA-4-AM          PIC X(17).                    
09205A         05  AR70PS-RULS-DATA-5-AM          PIC X(17).                    
10022A         05  AR70-PS-FRST-PERD-DAYS-CT      PIC X(4).                     
10022A         05  AR70-PS-FRST-PERD-MRCH-ANNL-RT PIC X(7).                     
10022A         05  AR70-PS-FRST-PERD-CASH-ANNL-RT PIC X(7).                     
10022A         05  AR70-PS-FRST-PERD-MRCH-ADB-AM  PIC X(19).                    
10022A         05  AR70-PS-FRST-PERD-CASH-ADB-AM  PIC X(19).                    
10022H         05  AR70-PS-PYFF-EXCP-CODES.                                     
10022H            10  AR70-PS-PYFF-EXCP-RVLV-CD  PIC X OCCURS 5 TIMES.          
10022H         05  FILLER REDEFINES AR70-PS-PYFF-EXCP-CODES.                    
10022H            10 AR70-PS-PYFF-EXCP-BINT-CD      PIC X.                      
10022H            10 AR70-PS-PYFF-EXCP-NBINT-CD     PIC X.                      
10022H            10 AR70-PS-PYFF-EXCP-CTD-MRCH-CD  PIC X.                      
10022H            10 AR70-PS-PYFF-EXCP-OLD-CASH-CD  PIC X.                      
10022H            10 AR70-PS-PYFF-EXCP-CTD-CASH-CD  PIC X.                      
10106B         05  AR70PS-RULS-DATA-1-CD          PIC X.                        
11203A         05  AR70PS-AVOD-FINC-CHRG-AM       PIC X(19).                    
11203D         05  AR70PS-MXMZ-INTR-AM            PIC X(19).                    
11203D         05  FILLER                          PIC X(70).                   
97017A         05  AR70-REAG-ELGB-CD              PIC 9(1).                     
00287A         05  AR70-PRMT-FIXD-PYMT-AM         PIC X(19).                    
02291A         05  AR70LS-TEMP-PLAN-BLNC-AM       PIC X(19).                    
02291A         05  AR70PS-TEMP-PLAN-BLNC-AM       PIC X(19).                    
02291A         05  AR70LS-TEMP-PLAN-MPD-AM        PIC X(19).                    
02291A         05  AR70PS-TEMP-PLAN-MPD-AM        PIC X(19).                    
04275B         05  AR70PS-OVRL-CNSC-CYCL-CT       PIC X(4).                     
05273B         05  AR70PS-HIGH-BAL-SINC-RESET-AM  PIC X(19).                    
05273B         05  AR70PS-HIGH-CASH-SINC-REST-AM  PIC X(19).                    
05273B         05  AR70PS-HIGH-MDSE-SINC-REST-AM  PIC X(19).                    
05273C         05  AR70PS-LATE-CHRG-CNSC-CT  PIC X(4).                          
05273C         05  AR70PS-OVRL-CHRG-CNSC-CT  PIC X(4).                          
06034D         05  AR70PS-PYFF-EXCP-18-CD    PIC X.                             
06097C         05  AR70-PS-LATE-FEE-NNSS-IN       PIC X.                        
06097C         05  AR70-PS-OVRL-FEE-NNSS-IN       PIC X.                        
06097C         05  AR70-PS-LATE-FEE-NNSS-DT       PIC X(10).                    
06097C         05  AR70-PS-OVRL-FEE-NNSS-DT       PIC X(10).                    
06097C         05  AR70-PS-NGTV-AMRT-AM           PIC X(19).                    
06097C         05  AR70-PS-LONG-NGTV-AMRT-AM      PIC X(19).                    
06097C         05  AR70-PS-SHRT-TERM-AMRT-CT      PIC X(4).                     
06097C         05  AR70-PS-LONG-TERM-AMRT-CT      PIC X(4).                     
10106A         05  AR70PS-UNPD-FRGN-CHRG-AM       PIC X(19).                    
11105B         05  AR70PS-FLAP-SSPN-CD            PIC 9.                        
11105B         05  FILLER                          PIC X(19).                   
4.0100     03  AR70-DELINQUENCY-DATA.                                           
               04  AR70-DELQ-CONTROL.                                           
                   05  AR70-CURR-DELQ-CONTROL.                                  
                       06  AR70-DEL-NMO-CONT      PIC X(4).                     
                       06  AR70-DEL-NO-DAYS       PIC X(4).                     
                       06  AR70-DEL-MSG-DAYS      PIC X(4).                     
                       06  AR70-DEL-MSG-CNTL      PIC X(4).                     
4.037A                 06  AR70-DEL-NO-CYCLES     PIC X(4).                     
4.037A             05  AR70-DEL-LS-NO-CYCLES      PIC X(4).                     
4.037A             05  AR70-DEL-PS-NO-CYCLES      PIC X(4).                     
                   05  AR70-DEL-DEFER-FLAG        PIC X.                        
00287A             05  FILLER                     PIC X(100).                   
4.0100         04  AR70-DELINQUENT-ITEMS.                                       
4.037A             05  AR70-DEL-ITEM          OCCURS 180 TIMES.                 
      ***                                    INDEXED BY AR70-DELQ-INDX.         
4.0100                 06  AR70-DEL-INDEX         PIC 9(4).                     
98023G                 06  AR70-DEL-AMT           PIC X(19).                    
                                                                                
