      ******************************************************************        
      *   ARRD140.                                                     *        
      *   FIRST DATA FILE FOR PROGRAM ARKUT140,ARKUT141                *        
      *   LRECL: 13442                                                 *        
      ******************************************************************        
       01 AR140-RECORDS.                                                        
           05 FILLER                       PIC X(38)     VALUE SPACE.           
           05 AR140-EMSR-CKEY-ACCT-NO      PIC X(16)     VALUE SPACE.           
           05 FILLER                       PIC X(11035)  VALUE SPACE.           
