000100******************************************************************10/07/94
000200*    COPY MEMBER:  ARRD100                       LRECL = 200     *RCRD001 
000300*                                                                *   LV001
000400*    THIS MEMBER IS USED AS THE FILE LAYOUT FOR THE INPUT        *RCRD001 
000500*    FROM WORKDAY FOR THE ASSOCIATE DISCOUNT PROCESS             *RCRD001 
000700******************************************************************RCRD001 
00001  01  AR100-WD-EMPLOYEE-REC.                                       12/15/95
00002      10 AR100-EMP-ID                  PIC   X(07).                RCRD010 
00003      10 AR100-SSN-NBR                 PIC   X(09).                   LV006
00004      10 AR100-EMP-STAT-CDE            PIC   X(01).                RCRD010 
00005      10 AR100-EMP-NM                  PIC   X(88).                RCRD010 
00006      10 AR100-EMP-TYP-CDE             PIC   X(01).                RCRD010 
00007      10 AR100-DISC-DTE                PIC   X(10).                RCRD010 
00008      10 AR100-TERM-DTE                PIC   X(10).                RCRD010 
00009      10 AR100-LOC-NBR                 PIC   9(04).                RCRD010 
00010      10 AR100-LIFETIME-DISC-ACTV      PIC   X(01).                RCRD010 
00010      10 FILLER                        PIC   X(69).                RCRD010 
