      ****************************************************************  00010000
      * RECORD LAYOUT FOR KC EMPL DISC ACCOUNT FILE                     00011000
      ****************************************************************  00012000
      * ARRD053 (I/O) - REC LENGTH: 32                                  00013003
      * NOTES:                                                          00014000
      *   -                                                             00015000
      ****************************************************************  00016000
                                                                        00017000
       01  AR053-EMPLOYEE-ACCOUNT-REC.                                  00018002
           05  AR053-ACCT-NBR              PIC  X(10).                  00019002
           05  AR053-SS-NBR                PIC  X(9).                   00020002
           05  AR053-ASSOC-ID              PIC  X(11).                  00030002
           05  AR053-EMP-STAT-CDE          PIC  X(1).                   00040002
           05  AR053-DISC-STAT-CDE         PIC  X(1).                   00050002
