00001 ****************************************************************  08/11/95
00002 * ACCOUNTS RECEIVABLE - CREDIT - CONSTANTS                     *  ARWS004 
00003 *     THIS COPYLIB CONTAINS ALL THE ACCOUNTS RECEIVABLE -      *     LV001
00004 *     CREDIT RELATED - CONSTANTS AND THEIR VALUES.             *  ARWS004 
00005 ****************************************************************  ARWS004 
00006  01  AR004-OPERCO-NBR.                                            ARWS004 
00007      05  AR004-OPERCO-NBR-03             PIC  X(02)  VALUE '03'.  ARWS004 
00008                                                                   ARWS004 
00009  01  AR004-COMPANY-NBR.                                           ARWS004 
00010      05  AR004-COMPANY-NBR-KOHLS         PIC  X(04)  VALUE '0039'.ARWS004 
00011                                                                   ARWS004 
00012  01  AR004-GL-SOURCE-CODES.                                       ARWS004 
00013      05  AR004-GL-SOURCE-KOHLS-CREDIT    PIC  X(01)  VALUE 'K'.   ARWS004 
00014                                                                   ARWS004 
00015  01  AR004-TSTR000-TYPE-CODE.                                     ARWS004 
00016      05  AR004-TYPE-CODE-DEPTST          PIC  X(02)  VALUE 'DS'.  ARWS004 
00017                                                                   ARWS004 
00018  01  AR004-POSTING-TRANS-TYPES.                                   ARWS004 
00019      05  AR004-TRANS-STORE-SLS.                                   ARWS004 
00020          10  AR004-TRANS-STORE-SLS-CD    PIC S9(04)  VALUE 8105.  ARWS004 
00021          10  AR004-TRANS-STORE-SLS-DS    PIC  X(34)  VALUE        ARWS004 
00022              'SALE                              '.                ARWS004 
00023      05  AR004-TRANS-STORE-RET.                                   ARWS004 
00024          10  AR004-TRANS-STORE-RET-CD    PIC S9(04)  VALUE 8115.  ARWS004 
00025          10  AR004-TRANS-STORE-RET-DS    PIC  X(34)  VALUE        ARWS004 
00026              'RETURN                            '.                ARWS004 
00027      05  AR004-TRANS-DEBIT-ADJ.                                   ARWS004 
00028          10  AR004-TRANS-DEBIT-ADJ-CD    PIC S9(04)  VALUE 8135.  ARWS004 
00029          10  AR004-TRANS-DEBIT-ADJ-DS    PIC  X(34)  VALUE        ARWS004 
00030              'DEBIT ADJUSTMENT                  '.                ARWS004 
00031      05  AR004-TRANS-CREDIT-ADJ.                                  ARWS004 
00032          10  AR004-TRANS-CREDIT-ADJ-CD   PIC S9(04)  VALUE 8140.  ARWS004 
00033          10  AR004-TRANS-CREDIT-ADJ-DS   PIC  X(34)  VALUE        ARWS004 
00034              'CREDIT ADJUSTMENT                 '.                ARWS004 
00035      05  AR004-TRANS-SLS-AUD-SLS-ADJ.                             ARWS004 
00036          10  AR004-TRANS-SLS-AUD-SLS-ADJ-CD                       ARWS004 
00037                                          PIC S9(04)  VALUE 8141.  ARWS004 
00038          10  AR004-TRANS-SLS-AUD-SLS-ADJ-DS                       ARWS004 
00039                                          PIC  X(34)  VALUE        ARWS004 
00040              'SALES AUDIT SALE ADJUSTMENT       '.                ARWS004 
00041      05  AR004-TRANS-SLS-AUD-RET-ADJ.                             ARWS004 
00042          10  AR004-TRANS-SLS-AUD-RET-ADJ-CD                       ARWS004 
00043                                          PIC S9(04)  VALUE 8136.  ARWS004 
00044          10  AR004-TRANS-SLS-AUD-RET-ADJ-DS                       ARWS004 
00045                                          PIC  X(34)  VALUE        ARWS004 
00046              'SALES AUDIT RETURN ADJUSTMENT     '.                ARWS004 
00047      05  AR004-TRANS-EMPL-DISC-SLS.                               ARWS004 
00048          10  AR004-TRANS-EMPL-DISC-SLS-CD                         ARWS004 
00049                                          PIC S9(04)  VALUE 8155.  ARWS004 
00050          10  AR004-TRANS-EMPL-DISC-SLS-DS                         ARWS004 
00051                                          PIC  X(34)  VALUE        ARWS004 
00052              'EMPLOYEE DISCOUNT SALE            '.                ARWS004 
00053      05  AR004-TRANS-EMPL-DISC-RET.                               ARWS004 
00054          10  AR004-TRANS-EMPL-DISC-RET-CD                         ARWS004 
00055                                          PIC S9(04)  VALUE 8165.  ARWS004 
00056          10  AR004-TRANS-EMPL-DISC-RET-DS                         ARWS004 
00057                                          PIC  X(34)  VALUE        ARWS004 
00058              'EMPLOYEE DISCOUNT RETURN          '.                ARWS004 
00059      05  AR004-TRANS-STORE-PAYMENT.                               ARWS004 
00060          10  AR004-TRANS-STORE-PAYMENT-CD                         ARWS004 
00061                                          PIC S9(04)  VALUE 8125.  ARWS004 
00062          10  AR004-TRANS-STORE-PAYMENT-DS                         ARWS004 
00063                                          PIC  X(34)  VALUE        ARWS004 
00064              'PAYMENT                           '.                ARWS004 
00065      05  AR004-TRANS-SA-EMP-DIS-SL.                               ARWS004 
00066          10  AR004-TRANS-SA-EMP-DIS-SL-CD                         ARWS004 
00067                                          PIC S9(04)  VALUE 8156.  ARWS004 
00068          10  AR004-TRANS-SA-EMP-DIS-SL-DS                         ARWS004 
00069                                          PIC  X(34)  VALUE        ARWS004 
00070              'SALES AUDIT EMPL DISCOUNT SALE    '.                ARWS004 
00071      05  AR004-TRANS-SA-EMP-DIS-RT.                               ARWS004 
00072          10  AR004-TRANS-SA-EMP-DIS-RT-CD                         ARWS004 
00073                                          PIC S9(04)  VALUE 8166.  ARWS004 
00074          10  AR004-TRANS-SA-EMP-DIS-RT-DS                         ARWS004 
00075                                          PIC  X(34)  VALUE        ARWS004 
00076              'SALES AUDIT EMPL DISCOUNT RETURN  '.                ARWS004 
00077      05  AR004-TRANS-SA-PAY-CR-ADJ.                               ARWS004 
00078          10  AR004-TRANS-SA-PAY-CR-ADJ-CD                         ARWS004 
00079                                          PIC S9(04)  VALUE 8137.  ARWS004 
00080          10  AR004-TRANS-SA-PAY-CR-ADJ-DS                         ARWS004 
00081                                          PIC  X(34)  VALUE        ARWS004 
00082              'SALES AUDIT PAYMENT CREDIT ADJUST '.                ARWS004 
00083      05  AR004-TRANS-LATE-VOID.                                   ARWS004 
00084          10  AR004-TRANS-LATE-VOID-CD    PIC  S9(04) VALUE 8120.  ARWS004 
00085          10  AR004-TRANS-LATE-VOID-DS    PIC  X(34)  VALUE        ARWS004 
00086              'LATE VOID                         '.                ARWS004 
00087                                                                   ARWS004 
00083      05  AR004-TRANS-OTHER.                                       ARWS004 
00084          10  AR004-TRANS-OTHER-DS        PIC  X(34)  VALUE        ARWS004 
00085              'OTHER                             '.                ARWS004 
00086                                                                   ARWS004 
00087  01  AR004-ACCOUNT-PREFIX.                                        ARWS004 
00088      05  AR004-KOHLS-ACCT-PREFIX-BEGIN   PIC  9(03)  VALUE 000.   ARWS004 
00089      05  AR004-KOHLS-ACCT-PREFIX-BEG-X   PIC  X(03)  VALUE '000'. ARWS004 
00090      05  AR004-OLD-KOHLS-ACCT-PREFIX     PIC  9(03)  VALUE 000.   ARWS004 
00091      05  AR004-CONVERT-OLD-ACCT-PREFIX   PIC  9(03)  VALUE 019.   ARWS004 
00092                                                                   ARWS004 
00093  01  AR004-POSTING-FILE-CONSTANTS.                                ARWS004 
00094      05  AR004-ISSUER                    PIC  S9(04) VALUE 0001.  ARWS004 
00095      05  AR004-CARD-AGREEMENT            PIC  S9(04) VALUE 1010.  ARWS004 
00096                                                                   ARWS004 
00097  01  AR004-SKU-CONSTANTS.                                         ARWS004 
00098      05  AR004-SENIOR-DISCOUNT-SKU       PIC  X(08)  VALUE        ARWS004 
00099                                               '55555100'.         ARWS004 
00100                                                                   ARWS004 
00101  01  AR004-ACCOUNT-TYPES.                                         ARWS004 
00102      05  AR004-DEFAULT-ACCOUNT-TYPE      PIC  X(02)  VALUE '52'.  ARWS004 
00103                                                                   ARWS004 
