000100******************************************************************00010003
000200* CONTAINS CREDIT BALANCE REFUND INFORMATION FOR EACH ACCOUNT.    00020003
000300* RECORD LENGTH IS 231 BYTES.                                     00030003
000400******************************************************************00040003
000500 01 AR051-CREDIT-BALANCE-RECORD.                                  00050003
000600    05 AR051-REFUND-DUE-DATE.                                     00060003
000700       10 AR051-REFUND-DUE-YYYY        PIC 9(04)    VALUE ZEROES. 00070003
000800       10 AR051-REFUND-DUE-MM          PIC 9(02)    VALUE ZEROES. 00080003
000900       10 AR051-REFUND-DUE-DD          PIC 9(02)    VALUE ZEROES. 00090003
001000    05 AR051-ACCOUNT-NBR.                                         00100003
001100       10 AR051-ACCOUNT-10             PIC 9(10)    VALUE ZEROES. 00110003
001200    05 FILLER                          PIC X(02)    VALUE SPACES. 00120005
001300    05 AR051-CUST-NAME                 PIC X(36)    VALUE SPACES. 00130003
001400    05 AR051-CUST-ADDRESS.                                        00140003
001500       10 AR051-CUST-ADDR-LINE-1       PIC X(30)    VALUE SPACES. 00150003
001600       10 AR051-CUST-ADDR-LINE-2       PIC X(42)    VALUE SPACES. 00160003
001700       10 AR051-CUST-ADDR-LINE-3       PIC X(42)    VALUE SPACES. 00170003
001800       10 AR051-CUST-ADDR-LINE-4       PIC X(30)    VALUE SPACES. 00180003
001900       10 AR051-PHONE-NO.                                         00190003
002000          15 AR051-AREA-CODE           PIC X(03)    VALUE SPACES. 00200003
002100          15 AR051-PHONE-CODE.                                    00210003
002200             20 AR051-PHONE-CODE-1     PIC X(03)    VALUE SPACES. 00220003
002300             20 AR051-PHONE-CODE-2     PIC X(04)    VALUE SPACES. 00230003
002400          15 AR051-PH-VALIDITY-CODE    PIC X(01)    VALUE SPACES. 00240003
002500    05 AR051-REFUND-AMT                PIC S9(14)V9(4)            00250003
002600                                       SIGN IS LEADING SEPARATE   00260003
002700                                                    VALUE ZEROES. 00270003
002800    05 AR051-STAFF-FLAG                PIC X(01)    VALUE SPACES. 00280003
002900    05 AR051-ENTITY-NBR                PIC 9(10)    VALUE ZEROES. 00290004
