00001 ******                                   ******                   12/18/88
00002 **    DISPLAY IN HEX TO SEE ACTUAL VALUES    **                   ATTRIB  
00003 ******                                   ******                      LV002
00004  01  ATTRIBUTES.                                                  ATTRIB  
00005      02   UNPROTECT              PIC X VALUE IS ' '.              ATTRIB  
00006      02   UNPRT-MDT              PIC X VALUE IS 'A'.              ATTRIB  
00007      02   UNPRT-BRI              PIC X VALUE IS 'H'.              ATTRIB  
00008      02   UNBRI-MDT              PIC X VALUE IS 'I'.              ATTRIB  
00009      02   UNPRT-DARK             PIC X VALUE IS '<'.              ATTRIB  
00010      02   UNPRT-DARK-MDT         PIC X VALUE IS '('.              ATTRIB  
00011      02   UNPRT-SKIP             PIC X VALUE IS '&'.              ATTRIB  
00012      02   UNPRT-NUM-MDT          PIC X VALUE IS 'J'.              ATTRIB  
00013      02   UNPRT-NUM-BRI          PIC X VALUE IS 'Q'.              ATTRIB  
00014      02   UNPRT-NUM-BRI-MDT      PIC X VALUE IS 'R'.              ATTRIB  
00015      02   UNPRT-NUM-DARK         PIC X VALUE IS '*'.              ATTRIB  
00016      02   UNPRT-NUM-DARK-MDT     PIC X VALUE IS ')'.              ATTRIB  
00017                                                                   ATTRIB  
00018      02   PROTECT                PIC X VALUE IS '-'.              ATTRIB  
00019      02   PROT-MDT               PIC X VALUE IS '/'.              ATTRIB  
00020      02   PROT-BRI               PIC X VALUE IS 'Y'.              ATTRIB  
00021      02   PROT-BRI-MDT           PIC X VALUE IS 'Z'.              ATTRIB  
00022      02   PROT-DARK              PIC X VALUE IS '%'.              ATTRIB  
00023      02   PROT-DARK-MDT          PIC X VALUE IS '['.              ATTRIB  
00024      02   PROT-SKIP              PIC X VALUE IS '0'.              ATTRIB  
00025      02   PROT-SKIP-MDT          PIC X VALUE IS '1'.              ATTRIB  
00026      02   PROT-SKIP-BRI          PIC X VALUE IS '8'.              ATTRIB  
00027      02   PROT-SKIP-BRI-MDT      PIC X VALUE IS '9'.              ATTRIB  
00028      02   PROT-SKIP-DARK         PIC X VALUE IS '@'.              ATTRIB  
00029      02   PROT-SKIP-DARK-MDT     PIC X VALUE IS QUOTE.            ATTRIB  
00030      02   FIELD-ERASED           PIC X VALUE IS 'ø'.              ATTRIB  
00031      02   FIELD-DETECTED         PIC X VALUE IS 'ÿ'.              ATTRIB  
00032      02   NORMAL                 PIC X VALUE IS ' '.              ATTRIB  
00033      02   AUTOSKIP               PIC X VALUE IS '0'.              ATTRIB  
00034      02   BRIGHT                 PIC X VALUE IS 'H'.              ATTRIB  
00035      02   MANDATORY-FILL         PIC X VALUE IS ''.                 CL**2
00036      02   MANDATORY-ENTER        PIC X VALUE IS ''.              ATTRIB  
00037      02   MANDATORY-FILL-ENTER   PIC X VALUE IS ''.              ATTRIB  
00038      02   UNPRT-NONDIS-NONPRT-NONDET-MDT                          ATTRIB  
00039                                  PIC X VALUE IS '('.              ATTRIB  
00040      02   UNPRT-BRI-PEN-DETEC-MDT                                 ATTRIB  
00041                                  PIC X VALUE IS 'I'.              ATTRIB  
00042                                                                   ATTRIB  
00043  01  COLOR-EXTENDED-ATTRIBUTES.                                   ATTRIB  
00044      02   BLUE                   PIC X VALUE IS '1'.              ATTRIB  
00045      02   RED                    PIC X VALUE IS '2'.              ATTRIB  
00046      02   PINK                   PIC X VALUE IS '3'.              ATTRIB  
00047      02   GREEN                  PIC X VALUE IS '4'.              ATTRIB  
00048      02   TURQUOISE              PIC X VALUE IS '5'.              ATTRIB  
00049      02   YELLOW                 PIC X VALUE IS '6'.              ATTRIB  
00050      02   NEUTRAL                PIC X VALUE IS '7'.              ATTRIB  
00051                                                                   ATTRIB  
00052  01  HIGHLIGHT-EXTENDED-ATTRIBUTES.                               ATTRIB  
00053      02   BLINK                  PIC X VALUE IS '1'.              ATTRIB  
00054      02   REVERSE-VIDEO          PIC X VALUE IS '2'.              ATTRIB  
00055      02   UNDERSCORE             PIC X VALUE IS '4'.              ATTRIB  
