000100******************************************************************00010000
000200*  BLACKHAWK EXTRACT FILE DETAIL                                 *00020000
000300*  LRECL = 80                                                    *00030003
000400******************************************************************00040000
000500 01  AU012-DETAIL-TRANS.                                          00050000
000600     05  AU012-GIFT-CARD-NBR             PIC  X(19).              00060000
000800     05  AU012-SLS-DTE                   PIC  X(10).              00080001
001000     05  AU012-STR-NBR                   PIC  S9(04)   COMP.      00100008
001100     05  AU012-RGST-ID                   PIC  S9(04)   COMP.      00110008
001110     05  AU012-TRN-NBR                   PIC  S9(04)   COMP.      00111008
001120     05  AU012-STRT-TM                   PIC  X(08).              00112001
001140     05  AU012-LNE-ITM-SEQ-NBR           PIC  S9(04)   COMP.      00114008
001200     05  AU012-TRANSACTION-AMT           PIC S9(07)V99 COMP-3.    00120000
001210     05  AU012-UPC-NBR                   PIC S9(15)    COMP-3.    00121014
001300     05  FILLER                          PIC  X(22).              00130014
