000100*****************************************************************         
000200*    RECORD PURPOSE: GIFT CARD AUTHORIZATION RESPONSE           *         
000300*                    WRITTEN TO TEMP STORAGE QUEUE              *         
000400*    RECORD LENGTH:  4120 BYTES                                 *         
000500*    RECORD FORMAT:  SEQUENTIAL HEADER, SAFEWAY ISO 8583 DATA   *         
000600* ------------------------------------------------------------- *         
000800* DATE     ANALYST       CHANGE DESCRIPTION                     *         
000900* 8/17/03  TKMA557       WRITTEN                                *         
001000*****************************************************************         
001100 01  AURD004-GC-RESP-TSQ-RECORD.                                          
001200     05 AURD004-TOT-REC-LENGTH         PIC 9(04) VALUE ZEROS.             
001300     05 AURD004-MATCHING-NBR-FIELD     PIC 9(08) VALUE ZEROS.             
           05 AURD004-RESPONSE-MESSAGE.                                         
              10 AURD004-DATA-LEN-HEX        PIC X(02)   VALUE SPACES.          
001400        10 AURD004-DATA-BUF            PIC X(4106) VALUE SPACES.          
