000100***************************************************************** 00010000
000200*    RECORD PURPOSE: STORED VALUE GIFT CARD INQUIRY REQUEST     * 00020009
000300*                    PASSED TO CHILD PROGRAM FROM TCP/IP        * 00030015
      *                    LISTENER                                   * 00031015
000400*    RECORD LENGTH:  4121 BYTES                                 * 00040015
000500*    RECORD FORMAT:  SEQUENTIAL HEADER, COMMA DELIMTED DATA     * 00050009
000600*---------------------------------------------------------------* 00060011
000700* DATE     ANALYST       CHANGE DESCRIPTION                     * 00070011
000800* 4/29/03  TKMA557       WRITTEN                                * 00080011
000900***************************************************************** 00090000
001000 01  AU001-GC-AUTH-REQ-RECORD.                                    00100009
001100     05  AU001-TOT-REC-LENGTH            PIC  9(04)  VALUE ZEROS. 00110009
001200     05  AU001-MATCHING-NBR-FIELD        PIC  9(08)  VALUE ZEROS. 00120009
001300     05  AU001-LISTENER-CODE             PIC  X(01)  VALUE SPACE. 00130009
           05  AU001-DATA-LENGTH-HEX           PIC  X(02)  VALUE SPACE. 00131016
001400     05  AU001-DATA-BUF                  PIC X(4106) VALUE SPACE. 00140014
