000100*****************************************************************         
000200*    RECORD PURPOSE: GIFT CARD AUTHORIZATION RESPONSE           *         
000300*                    WRITTEN TO TEMP STORAGE QUEUE              *         
000400*    RECORD LENGTH:  20583 BYTES                                 *        
000500*    RECORD FORMAT:  VARIABLE LENGTH BASED ON FIELDS           *          
000600* ------------------------------------------------------------- *         
000800* DATE     ANALYST       CHANGE DESCRIPTION                     *         
000900* 6/17/12  TKMAN89       WRITTEN                                *         
001000*****************************************************************         
001100 01  AURD018-GC-RESP-TSQ-RECORD.                                          
001200     05 AURD018-TOT-REC-LENGTH         PIC 9(04) VALUE ZEROS.             
001300     05 AURD018-MATCHING-NBR-FIELD     PIC 9(08) VALUE ZEROS.             
           05 AURD018-RESPONSE-MESSAGE.                                         
             10 AURD018-DATA-LEN-HEX        PIC X(02)   VALUE SPACES.           
             10  AURD018-MESSAGE-ID            PIC  9(4) VALUE ZEROS.           
                 88 AURD018-MID-0110           VALUE 0110.                      
                 88 AURD018-MID-0210           VALUE 0210.                      
                 88 AURD018-MID-0410           VALUE 0410.                      
                 88 AURD018-MID-0810           VALUE 0810.                      
             10  AURD018-BITMAP-PRIMARY        PIC X(16)   VALUE SPACE.         
             10  AURD018-DATA                  PIC X(9964) VALUE SPACE.         
