000100***************************************************************** 00010000
000200*    RECORD PURPOSE: STORED VALUE GIFT CARD INQUIRY REQUEST     * 00020000
000300*                    PASSED TO CHILD PROGRAM FROM TCP/IP        * 00030000
      *                    LISTENER                                   * 00040000
000400*    RECORD LENGTH:  20582 BYTES                                 *00050007
000500*    RECORD FORMAT:  VARIABLE LENGTH BASED ON FIELDS           *  00060007
000600*---------------------------------------------------------------* 00070000
000700* DATE     ANALYST       CHANGE DESCRIPTION                     * 00080000
000800* 6/17/12  TKMAN89       WRITTEN                                * 00090003
000900***************************************************************** 00100000
001000 01  AURD017-GC-AUTH-REQ-RECORD.                                  00110001
001100     05  AURD017-TOT-REC-LENGTH          PIC  9(04)  VALUE ZEROS. 00120015
001200     05  AURD017-MATCHING-NBR-FIELD      PIC  9(08)  VALUE ZEROS. 00130001
001300     05  AURD017-LISTENER-CODE           PIC  X(01)  VALUE SPACE. 00140001
001400     05  AURD017-DATA-BUF.                                        00150001
             10  AURD017-DATA-LENGTH-HEX       PIC  X(02)  VALUE SPACE. 00160009
             10  AURD017-MESSAGE-ID            PIC  X(4)   VALUE SPACE. 00170001
                 88 AURD017-MID-0100           VALUE '0100'.            00180001
                 88 AURD017-MID-0200           VALUE '0200'.            00190001
                 88 AURD017-MID-0400           VALUE '0400'.            00200001
                 88 AURD017-MID-0800           VALUE '0800'.            00210001
             10  AURD017-BITMAP-PRIMARY        PIC X(16)   VALUE SPACE. 00220011
             10  AURD017-DATA                  PIC X(9964) VALUE SPACE. 00230015
