000100******************************************************************00010000
000200*  BLACKHAWK DAILY RECONCILIATION FILE DETAIL                    *00020000
000300*  LRECL = 100                                                   *00030002
000400******************************************************************00040000
000500 01  AU011-DETAIL-TRANS.                                          00050000
000600     05  AU011-GIFT-CARD-NBR             PIC  X(19).              00060000
000700*  DATE IN FORMAT CCYYMMDD                                        00070000
000800     05  AU011-TRANSACTION-DATE          PIC  X(10).              00080004
000900*  TIME IN FORMAT HHMMSS                                          00090000
001000     05  AU011-TRANSACTION-TIME          PIC  X(06).              00100000
001100     05  AU011-TRANSACTION-NBR           PIC  X(04).              00110000
001200     05  AU011-TRANSACTION-AMT           PIC S9(07)V99 COMP-3.    00120000
001300     05  AU011-BLACKHAWK-IDENTIFIER      PIC  X(28).              00130000
001400     05  AU011-BLACKHAWK-ID REDEFINES  AU011-BLACKHAWK-IDENTIFIER.00140000
001500         10  AU011-INTERNAL-SEQ-NBR      PIC  X(12).              00150000
001600         10  AU011-BLACKHAWK-STORE-NBR   PIC  X(04).              00160000
001700         10  AU011-BLACKHAWK-RGST-NBR    PIC  X(04).              00170000
001800         10  AU011-BLACKHAWK-DIVISION    PIC  X(02).              00180000
001810         10  FILLER                      PIC  X(01).              00181000
001820         10  AU011-LAST-4-UPC            PIC  X(04).              00182000
001900         10  FILLER                      PIC  X(01).              00190000
002000     05  AU011-PARTNER-NAME              PIC  X(08).              00200003
002100     05  AU011-RESPONSE-CODE             PIC  X(03).              00210003
002101         88  AU011-RESPONSE-APPROVE      VALUE '000',             00210105
002102                                               '001',             00210205
002103                                               '158'.             00210305
002110     05  AU011-AUTH-TYPE-CODE            PIC  X(01).              00211001
002120         88  AU011-AUTH-TYPE-NORMAL      VALUE ' '.               00212000
002130         88  AU011-AUTH-TYPE-SAF         VALUE 'S'.               00213000
002200     05  AU011-APPROVAL-CDE              PIC  X(06).              00220000
002300     05  FILLER                          PIC  X(10).              00230004
