000100******************************************************************00010000
000200*  BLACKHAWK RECONCILIATION UPDATE/REPORT                        *00020001
000300*  LRECL = 150                                                   *00030003
000400******************************************************************00040000
000500 01  AU013-DETAIL-TRANS.                                          00050000
000600     05  AU013-GIFT-CARD-NBR             PIC  X(19).              00060000
000610     05  AU013-UPC                       PIC S9(15) COMP-3.       00061005
000700     05  AU013-SLS-DTE                   PIC  X(10).              00070000
000800     05  AU013-STR-NBR                   PIC S9(04) COMP.         00080004
000900     05  AU013-RGST-ID                   PIC S9(04) COMP.         00090004
001000     05  AU013-TRN-NBR                   PIC S9(04) COMP.         00100004
001100     05  AU013-STRT-TM                   PIC  X(08).              00110000
001120     05  AU013-LNE-ITM-SEQ-NBR           PIC S9(04) COMP.         00112004
001130     05  AU013-TRANSACTION-AMT           PIC S9(07)V99 COMP-3.    00113000
001131     05  AU013-REPORT-TYPE               PIC  X.                  00113101
001132         88  AU013-POSTING               VALUE 'P'.               00113201
001133         88  AU013-MISSING-KOHLS         VALUE 'K'.               00113301
001134         88  AU013-MISSING-BLACKHAWK     VALUE 'B'.               00113401
001135         88  AU013-MULTIPLE-RECON        VALUE 'M'.               00113503
001136         88  AU013-DECLINED-AUTH         VALUE 'D'.               00113609
001137     05  AU013-PARTNER                   PIC  X(08).              00113703
001138     05  AU013-BLACKHAWK-TRAN-NBR        PIC  X(04).              00113803
001139     05  AU013-TRN-ID                    PIC  X(30).              00113903
001140     05  AU013-RESPONSE-CODE             PIC  X(03).              00114003
001141     05  AU013-TYPE-CODE                 PIC  X(01).              00114103
001142     05  AU013-APPROVAL-CDE              PIC  X(06).              00114206
001143     05  AU013-PREV-RECON-DTE            PIC  X(10).              00114303
001150     05  FILLER                          PIC  X(29).              00115008
