      ***************************************************************** 00010000
      * AUWS001 -  WORKING STORAGE FOR DETERMINING LISTENER QUEUE     * 00020003
      *            NAME                                               * 00021000
      ***************************************************************** 00030000
       01  AUWS001-QUEUE-NAME-TABLE.                                    00040004
           05  AUWS001-QUEUE-PARM      PIC X(1).                        00041004
               88  AUWS001-VALID-PARM  VALUE '1' THRU '9'.              00042004
           05  AUWS001-QUEUE-PARM-N REDEFINES                           00043004
                 AUWS001-QUEUE-PARM    PIC 9(1).                        00044004
           05  AUWS001-QUEUE-NAMES.                                     00050004
               10  FILLER              PIC X(8)  VALUE 'AUTCPPR1'.      00060003
               10  FILLER              PIC X(8)  VALUE 'AUTCPPR2'.      00070003
               10  FILLER              PIC X(8)  VALUE 'AUTCPPR3'.      00080003
               10  FILLER              PIC X(8)  VALUE 'AUTCPPR4'.      00090003
               10  FILLER              PIC X(8)  VALUE 'AUTCPPR5'.      00100003
               10  FILLER              PIC X(8)  VALUE 'AUTCPPR6'.      00110003
               10  FILLER              PIC X(8)  VALUE 'AUTCPPR7'.      00120003
               10  FILLER              PIC X(8)  VALUE 'AUTCPPR8'.      00130003
               10  FILLER              PIC X(8)  VALUE 'AUTCPPR9'.      00140003
           05  AUWS001-QUEUE-NAME-R REDEFINES AUWS001-QUEUE-NAMES.      00160004
               10  AUWS001-QUEUE-NAME  OCCURS 9 TIMES                   00170004
                                       PIC X(8).                        00171002
