000100******************************************************************00010000
000200* AUWS010 COPYBOOK                                               *00020000
000300* WRITTEN 9/1/2006 BY DEANNA BRANTER  TKMA660                     00030000
000400*    SAFEWAY GIFT CARD REVERSAL MESSAGE RESPONSE FORMAT           00040000
001000******************************************************************00050000
000700 01  AU010-SAFEWAY-REVERSAL-RSP-MSG.                              00060000
000800     05  AU010-ISO-HEADER-FIELDS.                                 00070000
001000         10  AU010-IH-HEADER-LENGTH  PIC S9(4)  COMP VALUE ZEROS. 00080000
001200         10  AU010-IH-HEADER-LENGTH-X  REDEFINES                  00090000
001400                              AU010-IH-HEADER-LENGTH  PIC X(2).   00100000
001600     05  AU010-SAFEWAY-RVSL-RSP-DATA.                             00110000
001700         10  AU010-B24-ISO-HEADER-MSG.                            00120002
001800             15 AU010-B24-ISO        PIC X(11).                   00130001
001800             15 AU010-B24-ISO-VALUE  PIC X(01).                   00140001
001900                88  AU010-B24-REQ             VALUE '0'.          00150001
002000                88  AU010-B24-RESP            VALUE '7'.          00160001
002100         10  AU010-ISO-MESSAGE-ID    PIC 9(4)     VALUE ZEROS.    00170000
002200             88  AU010-MI-ISO-RVSL-REQUEST        VALUE 0420.     00180000
002300             88  AU010-MI-ISO-RVSL-RESPONSE       VALUE 0430.     00190000
002600             88  AU010-MI-ISO-NET-MGMT-REQUEST    VALUE 0800.     00200000
002700             88  AU010-MI-ISO-NET-MGMT-RESPONSE   VALUE 0810.     00210000
002800             88  AU010-MI-ISO-REQUEST           VALUE 0420, 0800. 00220000
002900             88  AU010-MI-ISO-RESPONSE          VALUE 0430, 0810. 00230000
003000         10  AU010-PRIMARY-BIT-MAP   PIC X(16)  VALUE ZEROS.      00240000
043811             88 AU010-PRI-BIT-MAP-DFLT   VALUE 'B23840812E808010'.00250000
003100         10  AU010-SECONDARY-BIT-MAP PIC X(16)  VALUE ZEROS.      00260000
043840             88 AU010-SEC-BIT-MAP-DFLT   VALUE '0000000000060000'.00270000
003200         10  AU010-P3-PROCESSING-CODE.                            00280000
003300             15  AU010-P3-PC-TRAN-CODE       PIC 9(2) VALUE ZEROS.00290000
003500             15  AU010-P3-PC-TYPE-OF-ACCOUNT PIC 9(2) VALUE ZEROS.00300000
003700             15  AU010-P3-PC-TO-ACCT         PIC 9(2) VALUE ZEROS.00310000
003900         10  AU010-P4-TRANSACTION-AMOUNT PIC 9(10)V99 VALUE ZEROS.00320000
004100         10  AU010-P4-TRANS-AMOUNT-CENTS     REDEFINES            00330000
004300                        AU010-P4-TRANSACTION-AMOUNT PIC 9(12).    00340000
004500         10  AU010-P7-TRANSMIT-DATE-TIME.                         00350000
004600             15  AU010-P7-TRANSMIT-MONTH     PIC 9(2) VALUE ZEROS.00360000
004800             15  AU010-P7-TRANSMIT-DAY       PIC 9(2) VALUE ZEROS.00370000
010000             15  AU010-P7-TRANSMIT-TIME-HMS  PIC 9(6) VALUE ZEROS.00380000
010200         10  AU010-P11-SYS-TRACE-AUDIT-NBR   PIC 9(6) VALUE ZEROS.00390000
010400         10  AU010-P12-LOCAL-TRAN-TIME       PIC 9(6) VALUE ZEROS.00400000
010600         10  AU010-P13-LOCAL-TRAN-DATE.                           00410000
010700             15  AU010-P13-LD-MM             PIC 9(2) VALUE ZEROS.00420000
010800             15  AU010-P13-LD-DD             PIC 9(2) VALUE ZEROS.00430000
010900         10  AU010-P18-MERCHANT-CODE         PIC 9(4) VALUE ZEROS.00440000
007300         10  AU010-P25-POS-CONDITION-CODE    PIC 9(2) VALUE ZEROS.00450000
007500             88  AU010-P25-PC-SAFEWAY            VALUE 53.        00460000
007600             88  AU010-P25-PC-AHOLD              VALUE 54.        00470000
007700             88  AU010-P25-PC-RETAIL-ALLIANCE    VALUE 55.        00480000
007700             88  AU010-P25-PC-RELOAD             VALUE 82.        00490000
007800         10  AU010-P32-ACQR-INST-ID.                              00500000
008600             15  AU010-P32-ACQR-INST-2     PIC 9(02) VALUE 11.    00510000
 08800             15  AU010-P32-ACQR-INST-6     PIC 9(06) VALUE 603000.00520000
 08800             15  AU010-P32-ACQR-INST-5     PIC 9(05) VALUE ZEROES.00530000
007800         10  AU010-P35-TRACK-2-DATA-LEN      PIC 9(2) VALUE ZEROS.00540000
           05  AU010-SAFEWAY-RVSL-TRACK2-DATA.                          00550000
008500         10  AU010-P35-TRACK-2-DATA.                              00560000
008600             15  AU010-P35-START-SENTINEL   PIC X(1) VALUE SPACES.00570000
 08800             15  AU010-P35-ACCOUNT-NBR     PIC X(36) VALUE SPACES.00580000
      *  NOTE: ACCOUNT-NBR HAS MORE THAN JUST THE ACCT# IN IT.          00590000
      *        ALTHOUGH THE TRACK 2 DATA IS VARIABLE, THE               00600000
      *        FORMAT IS TYPICALLY LIKE THIS:                           00610000
      *          START SENTINEL X(1)   ";"                              00620000
      *          ACCOUNT NBR    9(19)                                   00630000
      *          SEPARATOR      X(1)   "="                              00640000
010000*          EXP DATE       X(4)                                    00650000
010100*          END-SENTINEL   X(1)   "?"                              00660000
010800     05  AU010-ADDL-RESPONSE-DATA.                                00670000
010600         10  AU010-P37-RETRIEVAL-REF-NBR  PIC X(12) VALUE SPACES. 00680000
054600         10  AU010-P38-AUTHORIZATION-CODE PIC X(6)  VALUE SPACES. 00690000
054800         10  AU010-P39-RESPONSE-CODE      PIC 9(2)  VALUE ZEROS.  00700000
055000             88  AU010-P39-APPROVAL           VALUE ZEROS.        00710000
055100             88  AU010-P39-NSF                VALUE 01.           00720000
055200             88  AU010-P39-ACCOUNT-CLOSED     VALUE 02.           00730000
055400             88  AU010-P39-UNKNOWN-ACCOUNT    VALUE 03.           00740000
055500             88  AU010-P39-INACTIVE-ACCOUNT   VALUE 04.           00750000
055600             88  AU010-P39-EXPIRED-CARD       VALUE 05.           00760000
055700             88  AU010-P39-INVALID-TRAN-CD    VALUE 06.           00770000
055800             88  AU010-P39-INVALID-MERCHANT   VALUE 07.           00780000
055810             88  AU010-P39-ALREADY-ACTIVE     VALUE 08.           00790000
055820             88  AU010-P39-SYSTEM-ERROR       VALUE 09.           00800000
055830             88  AU010-P39-LOST-STOLEN-CARD   VALUE 10.           00810000
055840             88  AU010-P39-NOT-LOST-STOLEN    VALUE 11.           00820000
055850             88  AU010-P39-INVALID-TRAN-FMT   VALUE 12.           00830000
055860             88  AU010-P39-BAD-MAG-STRIPE     VALUE 15.           00840000
055870             88  AU010-P39-INCORRECT-LOC      VALUE 16.           00850000
055880             88  AU010-P39-MAX-BAL-EXCEEDED   VALUE 17.           00860000
055890             88  AU010-P39-INVALID-AMT        VALUE 18.           00870000
055900             88  AU010-P39-INC-TRAN-FMT       VALUE 26.           00880000
056000             88  AU010-P39-ACCT-REQ-NOT-PER   VALUE 27.           00890000
056100             88  AU010-P39-LOC-REQ-NOT-PER    VALUE 28.           00900000
056200             88  AU010-P39-BAD-REPLAY-DATE    VALUE 29.           00910000
056300             88  AU010-P39-BAD-CHECKSUM       VALUE 30.           00920000
056400             88  AU010-P39-BALANCE-NOT-AVAIL  VALUE 31.           00930000
056500             88  AU010-P39-ACCOUNT-LOCKED     VALUE 32.           00940000
056600             88  AU010-P39-NO-PREV-TRAN       VALUE 33.           00950000
056700             88  AU010-P39-ALREADY-REVERSED   VALUE 34.           00960000
056800             88  AU010-P39-GENERIC-DENIAL     VALUE 35.           00970000
056900             88  AU010-P39-BAD-AUTH-CODE      VALUE 36.           00980000
057000             88  AU010-P39-TOO-MNY-ATTEMPTS   VALUE 37.           00990000
057100             88  AU010-P39-NO-TRANS-AVAIL     VALUE 38.           01000000
057200             88  AU010-P39-TRAN-HIST-NOT-AV   VALUE 39.           01010000
057300             88  AU010-P39-NEW-PASSWORD-REQ   VALUE 40.           01020000
057400             88  AU010-P39-INV-STATUS-CHG     VALUE 41.           01030000
057500             88  AU010-P39-VOID-AFTER-ACVTY   VALUE 42.           01040000
057600             88  AU010-P39-NO-SERVICE         VALUE 43.           01050000
057700             88  AU010-P39-ACCESS-DECLINED    VALUE 44.           01060000
057800             88  AU010-P39-BAD-EAN            VALUE 45.           01070000
057900             88  AU010-P39-BAD-MERCH-KEY      VALUE 46.           01080000
058000             88  AU010-P39-PROMO-DECLINED     VALUE 47.           01090000
058100             88  AU010-P39-INV-TRAN-SOURCE    VALUE 48.           01100000
058200             88  AU010-P39-ACCT-LINKED        VALUE 49.           01110000
058300             88  AU010-P39-ALREADY-ACTIVE-50  VALUE 50.           01120000
058400             88  AU010-P39-RESERVED-51        VALUE 51.           01130000
058500             88  AU010-P39-RESERVED-52        VALUE 52.           01140000
058600             88  AU010-P39-RESERVED-53        VALUE 53.           01150000
058700             88  AU010-P39-CURRENCY-FLAG      VALUE 54.           01160000
058800             88  AU010-P39-INV-CURRENCY       VALUE 55.           01170000
058900             88  AU010-P39-BAD-CURRENCY-CD    VALUE 56.           01180000
059000             88  AU010-P39-CURRENCY-CONV-ERR  VALUE 57.           01190000
010900         10  AU010-P41-CARD-ACCEPTOR-TERM.                        01200000
010000             15  AU010-P41-STORE-NBR     PIC X(04) VALUE SPACES.  01210000
010100             15  AU010-P41-TERMINAL-ID   PIC X(04) VALUE SPACES.  01220000
010200             15  AU010-P41-DIVISION      PIC X(02) VALUE SPACES.  01230000
010300             15  AU010-P41-FILLER        PIC X(06) VALUE SPACES.  01240000
011300         10  AU010-P49-CURRENCY-CODE        PIC 9(3) VALUE ZEROS. 01250000
011500         10  AU010-P60-TERM-DIVISION.                             01260000
011600             15  AU010-P60-LEN              PIC X(3) VALUE SPACES.01270000
011800             15  AU010-P60-TERM-DIV-ID.                           01280000
011900                 20  AU010-P60-TERM-FIID   PIC X(4) VALUE SPACES. 01290000
012100                 20  AU010-P60-TERM-LNET   PIC X(4) VALUE SPACES. 01300000
012300                 20  AU010-P60-TERM-ID     PIC X(8) VALUE SPACES. 01310000
012500         10  AU010-S110-ORIGINAL-INFO.                            01320000
012600             15  AU010-S110-OI-LEN         PIC 9(3)  VALUE ZEROS. 01330000
012800             15  AU010-S110-OI-DATA        PIC X(28) VALUE SPACES.01340000
013000         10  AU010-S111-UPC.                                      01350000
013100             15  AU010-S111-UPC-LEN        PIC 9(3)  VALUE ZEROS. 01360000
013300             15  AU010-S111-UPC-DATA       PIC X(10) VALUE SPACES.01370000
