      ***************************************************************** 00010007
      * AUWS013 -  WORKING STORAGE FOR DETERMINING LISTENER QUEUE     * 00020007
      *            NAME                                               * 00030007
      ***************************************************************** 00040007
       01  AUWS013-QUEUE-NAME-TABLE.                                    00050007
           05  AUWS013-QUEUE-PARM      PIC X(1).                        00060007
               88  AUWS013-VALID-PARM  VALUE '1' THRU '9'.              00070007
           05  AUWS013-QUEUE-PARM-N REDEFINES                           00080007
                 AUWS013-QUEUE-PARM    PIC 9(1).                        00090007
           05  AUWS013-QUEUE-NAMES.                                     00100007
               10  FILLER              PIC X(8)  VALUE 'AUINCPR1'.      00110007
               10  FILLER              PIC X(8)  VALUE 'AUINCPR2'.      00120007
               10  FILLER              PIC X(8)  VALUE 'AUINCPR3'.      00130007
               10  FILLER              PIC X(8)  VALUE 'AUINCPR4'.      00140007
               10  FILLER              PIC X(8)  VALUE 'AUINCPR5'.      00150007
               10  FILLER              PIC X(8)  VALUE 'AUINCPR6'.      00160007
               10  FILLER              PIC X(8)  VALUE 'AUINCPR7'.      00170007
               10  FILLER              PIC X(8)  VALUE 'AUINCPR8'.      00180007
               10  FILLER              PIC X(8)  VALUE 'AUINCPR9'.      00190007
           05  AUWS013-QUEUE-NAME-R REDEFINES AUWS013-QUEUE-NAMES.      00200007
               10  AUWS013-QUEUE-NAME  OCCURS 9 TIMES                   00210007
                                       PIC X(8).                        00220007
