      ******************************************************************00010024
      * AUWS014 COPYBOOK                                               *00020024
      *    INCOMM GIFT CARD BITMAP WORKING STORAGE                      00030024
      ******************************************************************00040024
                                                                        00050024
       01  AU014-PRI-BITFLD-SETTINGS.                                   00060015
           05  AU014-BITSF-1-8.                                         00070015
               10  AU014-PRI-BITF-1      PIC X(01).                     00080015
               10  AU014-PRI-BITF-2      PIC X(01).                     00090015
               10  AU014-PRI-BITF-3      PIC X(01).                     00100015
               10  AU014-PRI-BITF-4      PIC X(01).                     00110015
               10  AU014-PRI-BITF-5      PIC X(01).                     00120015
               10  AU014-PRI-BITF-6      PIC X(01).                     00130015
               10  AU014-PRI-BITF-7      PIC X(01).                     00140015
               10  AU014-PRI-BITF-8      PIC X(01).                     00150015
           05  AU014-BITSF-9-16.                                        00160015
               10  AU014-PRI-BITF-9      PIC X(01).                     00170015
               10  AU014-PRI-BITF-10     PIC X(01).                     00180015
               10  AU014-PRI-BITF-11     PIC X(01).                     00190015
               10  AU014-PRI-BITF-12     PIC X(01).                     00200015
               10  AU014-PRI-BITF-13     PIC X(01).                     00210015
               10  AU014-PRI-BITF-14     PIC X(01).                     00220015
               10  AU014-PRI-BITF-15     PIC X(01).                     00230015
               10  AU014-PRI-BITF-16     PIC X(01).                     00240015
           05  AU014-BITSF-17-24.                                       00250015
               10  AU014-PRI-BITF-17     PIC X(01).                     00260015
               10  AU014-PRI-BITF-18     PIC X(01).                     00270015
               10  AU014-PRI-BITF-19     PIC X(01).                     00280015
               10  AU014-PRI-BITF-20     PIC X(01).                     00290015
               10  AU014-PRI-BITF-21     PIC X(01).                     00300015
               10  AU014-PRI-BITF-22     PIC X(01).                     00310015
               10  AU014-PRI-BITF-23     PIC X(01).                     00320015
               10  AU014-PRI-BITF-24     PIC X(01).                     00330015
           05  AU014-BITSF-25-32.                                       00340015
               10  AU014-PRI-BITF-25     PIC X(01).                     00350015
               10  AU014-PRI-BITF-26     PIC X(01).                     00360015
               10  AU014-PRI-BITF-27     PIC X(01).                     00370015
               10  AU014-PRI-BITF-28     PIC X(01).                     00380015
               10  AU014-PRI-BITF-29     PIC X(01).                     00390015
               10  AU014-PRI-BITF-30     PIC X(01).                     00400015
               10  AU014-PRI-BITF-31     PIC X(01).                     00410015
               10  AU014-PRI-BITF-32     PIC X(01).                     00420015
           05  AU014-BITSF-33-40.                                       00430015
               10  AU014-PRI-BITF-33     PIC X(01).                     00440015
               10  AU014-PRI-BITF-34     PIC X(01).                     00450015
               10  AU014-PRI-BITF-35     PIC X(01).                     00460015
               10  AU014-PRI-BITF-36     PIC X(01).                     00470015
               10  AU014-PRI-BITF-37     PIC X(01).                     00480015
               10  AU014-PRI-BITF-38     PIC X(01).                     00490015
               10  AU014-PRI-BITF-39     PIC X(01).                     00500015
               10  AU014-PRI-BITF-40     PIC X(01).                     00510015
           05  AU014-BITSF-41-48.                                       00520015
               10  AU014-PRI-BITF-41     PIC X(01).                     00530015
               10  AU014-PRI-BITF-42     PIC X(01).                     00540015
               10  AU014-PRI-BITF-43     PIC X(01).                     00550015
               10  AU014-PRI-BITF-44     PIC X(01).                     00560015
               10  AU014-PRI-BITF-45     PIC X(01).                     00570015
               10  AU014-PRI-BITF-46     PIC X(01).                     00580015
               10  AU014-PRI-BITF-47     PIC X(01).                     00590015
               10  AU014-PRI-BITF-48     PIC X(01).                     00600015
           05  AU014-BITSF-49-56.                                       00610015
               10  AU014-PRI-BITF-49     PIC X(01).                     00620015
               10  AU014-PRI-BITF-50     PIC X(01).                     00630015
               10  AU014-PRI-BITF-51     PIC X(01).                     00640015
               10  AU014-PRI-BITF-52     PIC X(01).                     00650015
               10  AU014-PRI-BITF-53     PIC X(01).                     00660015
               10  AU014-PRI-BITF-54     PIC X(01).                     00670015
               10  AU014-PRI-BITF-55     PIC X(01).                     00680015
               10  AU014-PRI-BITF-56     PIC X(01).                     00690015
           05  AU014-BITSF-57-64.                                       00700015
               10  AU014-PRI-BITF-57     PIC X(01).                     00710015
               10  AU014-PRI-BITF-58     PIC X(01).                     00720015
               10  AU014-PRI-BITF-59     PIC X(01).                     00730015
               10  AU014-PRI-BITF-60     PIC X(01).                     00740015
               10  AU014-PRI-BITF-61     PIC X(01).                     00750015
               10  AU014-PRI-BITF-62     PIC X(01).                     00760015
               10  AU014-PRI-BITF-63     PIC X(01).                     00770015
               10  AU014-PRI-BITF-64     PIC X(01).                     00780015
                                                                        00790015
       01  AU014-PRI-BITFLD-RESET        PIC X(64).                     00800021
      * IF AU014-PRI-BIT-1 IS ON "1", THEN YOU NEED TO CHECK            00810015
      * THE BIT MAP SECONDARY FOR VALUES AFTER BIT 64.                  00820015
      *                                                                 00830015
       01  AU014-SEC-BIT-SETTINGS.                                      00840015
           05  AU014-BITS-SEC-72-65.                                    00850017
               10  AU014-SEC-BIT-72      PIC X(01).                     00860015
               10  AU014-SEC-BIT-71      PIC X(01).                     00870015
               10  AU014-SEC-BIT-70      PIC X(01).                     00880015
               10  AU014-SEC-BIT-69      PIC X(01).                     00890015
               10  AU014-SEC-BIT-68      PIC X(01).                     00900015
               10  AU014-SEC-BIT-67      PIC X(01).                     00910015
               10  AU014-SEC-BIT-66      PIC X(01).                     00920015
               10  AU014-SEC-BIT-65      PIC X(01).                     00930015
           05  AU014-BITS-SEC-80-73.                                    00940017
               10  AU014-SEC-BIT-80      PIC X(01).                     00950015
               10  AU014-SEC-BIT-79      PIC X(01).                     00960015
               10  AU014-SEC-BIT-78      PIC X(01).                     00970015
               10  AU014-SEC-BIT-77      PIC X(01).                     00980015
               10  AU014-SEC-BIT-76      PIC X(01).                     00990015
               10  AU014-SEC-BIT-75      PIC X(01).                     01000015
               10  AU014-SEC-BIT-74      PIC X(01).                     01010015
               10  AU014-SEC-BIT-73      PIC X(01).                     01020015
           05  AU014-BITS-SEC-88-81.                                    01030017
               10  AU014-SEC-BIT-88      PIC X(01).                     01040015
               10  AU014-SEC-BIT-87      PIC X(01).                     01050015
               10  AU014-SEC-BIT-86      PIC X(01).                     01060015
               10  AU014-SEC-BIT-85      PIC X(01).                     01070015
               10  AU014-SEC-BIT-84      PIC X(01).                     01080015
               10  AU014-SEC-BIT-83      PIC X(01).                     01090015
               10  AU014-SEC-BIT-82      PIC X(01).                     01100015
               10  AU014-SEC-BIT-81      PIC X(01).                     01110015
           05  AU014-BITS-SEC-89-96.                                    01120017
               10  AU014-SEC-BIT-96      PIC X(01).                     01130015
               10  AU014-SEC-BIT-95      PIC X(01).                     01140015
               10  AU014-SEC-BIT-94      PIC X(01).                     01150015
               10  AU014-SEC-BIT-93      PIC X(01).                     01160015
               10  AU014-SEC-BIT-92      PIC X(01).                     01170015
               10  AU014-SEC-BIT-91      PIC X(01).                     01180015
               10  AU014-SEC-BIT-90      PIC X(01).                     01190015
               10  AU014-SEC-BIT-89      PIC X(01).                     01200015
           05  AU014-BITS-SEC-97-104.                                   01210017
               10  AU014-SEC-BIT-104     PIC X(01).                     01220015
               10  AU014-SEC-BIT-103     PIC X(01).                     01230015
               10  AU014-SEC-BIT-102     PIC X(01).                     01240015
               10  AU014-SEC-BIT-101     PIC X(01).                     01250015
               10  AU014-SEC-BIT-100     PIC X(01).                     01260015
               10  AU014-SEC-BIT-99      PIC X(01).                     01270015
               10  AU014-SEC-BIT-98      PIC X(01).                     01280015
               10  AU014-SEC-BIT-97      PIC X(01).                     01290015
           05  AU014-BITS-SEC-105-112.                                  01300017
               10  AU014-SEC-BIT-112     PIC X(01).                     01310015
               10  AU014-SEC-BIT-111     PIC X(01).                     01320015
               10  AU014-SEC-BIT-110     PIC X(01).                     01330015
               10  AU014-SEC-BIT-109     PIC X(01).                     01340015
               10  AU014-SEC-BIT-108     PIC X(01).                     01350015
               10  AU014-SEC-BIT-107     PIC X(01).                     01360015
               10  AU014-SEC-BIT-106     PIC X(01).                     01370015
               10  AU014-SEC-BIT-105     PIC X(01).                     01380015
           05  AU014-BITS-SEC-113-120.                                  01390017
               10  AU014-SEC-BIT-120     PIC X(01).                     01400015
               10  AU014-SEC-BIT-119     PIC X(01).                     01410015
               10  AU014-SEC-BIT-118     PIC X(01).                     01420015
               10  AU014-SEC-BIT-117     PIC X(01).                     01430015
               10  AU014-SEC-BIT-116     PIC X(01).                     01440015
               10  AU014-SEC-BIT-115     PIC X(01).                     01450015
               10  AU014-SEC-BIT-114     PIC X(01).                     01460015
               10  AU014-SEC-BIT-113     PIC X(01).                     01470015
           05  AU014-BITS-SEC-121-128.                                  01480017
               10  AU014-SEC-BIT-128     PIC X(01).                     01490015
               10  AU014-SEC-BIT-127     PIC X(01).                     01500015
               10  AU014-SEC-BIT-126     PIC X(01).                     01510015
               10  AU014-SEC-BIT-125     PIC X(01).                     01520015
               10  AU014-SEC-BIT-124     PIC X(01).                     01530015
               10  AU014-SEC-BIT-123     PIC X(01).                     01540015
               10  AU014-SEC-BIT-122     PIC X(01).                     01550015
               10  AU014-SEC-BIT-121     PIC X(01).                     01560015
                                                                        01570015
       01  AU014-SEC-BITFLD-SETTINGS     PIC X(64).                     01580017
       01  FILLER REDEFINES AU014-SEC-BITFLD-SETTINGS.                  01590017
           05  AU014-BITSF-SEC-65-72.                                   01600017
               10  AU014-SEC-BITF-65     PIC X(01).                     01610017
               10  AU014-SEC-BITF-66     PIC X(01).                     01620017
               10  AU014-SEC-BITF-67     PIC X(01).                     01630017
               10  AU014-SEC-BITF-68     PIC X(01).                     01640017
               10  AU014-SEC-BITF-69     PIC X(01).                     01650017
               10  AU014-SEC-BITF-70     PIC X(01).                     01660017
               10  AU014-SEC-BITF-71     PIC X(01).                     01670017
               10  AU014-SEC-BITF-72     PIC X(01).                     01680017
           05  AU014-BITSF-SEC-REMAIN    PIC X(56).                     01690017
                                                                        01700017
       01  AU014-SEC-BITFLD-RESET        PIC X(08).                     01710021
       01  AU014-BITMAP16                PIC X(16).                     01720022
                                                                        01730020
       01  AU014-MSG-REQUESTS.                                          01740015
           05  AU014-REQ100-BIT-VALIDATION          PIC 9(02).          01750015
               88  PV-REQ100-REQUIRED        VALUE 01, 02, 03, 4, 7, 11,01760015
                                                  12, 13, 41, 42, 49.   01770015
               88  PV-REQ100-OPT-ECHO        VALUE 32, 37, 54, 59.      01780015
               88  PV-REQ100-OPTIONAL        VALUE 22, 25, 35, 36,      01790015
                                                   36, 45.              01800015
               88  PV-REQ100-ALL             VALUE 01, 02, 03, 04, 05,  01810015
                                                   06, 07, 08, 11, 12,  01820015
                                                   13, 22, 25, 32, 35,  01830015
                                                   36, 37, 38, 39, 41,  01840015
                                                   42, 44, 45, 49, 54,  01850015
                                                   59.                  01860015
                                                                        01870015
           05  AU014-RES110-BIT-VALIDATION          PIC 9(02).          01880015
               88  PV-RES110-REQUIRED        VALUE 38, 39.              01890016
               88  PV-RES110-REQ-ECHO        VALUE 01, 03, 04, 07,      01900016
                                                   11, 41, 49.          01910016
               88  PV-RES110-OPT-ECHO        VALUE 32, 37, 54, 59.      01920015
               88  PV-RES110-OPTIONAL        VALUE 02, 05, 06, 08, 44,  01930015
                                                   45.                  01940015
                                                                        01950015
           05  AU014-REQ200-BIT-VALIDATION          PIC 9(02).          01960015
               88  PV-REQ200-REQUIRED        VALUE 2, 3, 4, 7, 11, 12,  01970015
                                                   13, 41, 42, 49.      01980015
               88  PV-REQ200-OPT-ECHO        VALUE 32, 37, 44, 53, 54,  01990015
                                                   59.                  02000015
               88  PV-REQ200-OPTIONAL        VALUE 22, 25, 35, 36,      02010015
                                                   45, 46, 47, 48.      02020015
                                                                        02030015
           05  AU014-RES210-BIT-VALIDATION          PIC 9(02).          02040015
               88  PV-RES210-REQUIRED        VALUE 5, 38, 39.           02050015
               88  PV-RES210-REQ-ECHO        VALUE 3, 4, 7, 11, 41, 49. 02060015
               88  PV-RES210-OPT-ECHO        VALUE 32, 37, 44, 53, 54,  02070015
                                                   59.                  02080015
               88  PV-RES210-OPTIONAL        VALUE 2, 6, 8, 46, 47,     02090015
                                                   48, 61, 62.          02100015
                                                                        02110015
           05  AU014-REQ400-BIT-VALIDATION          PIC 9(02).          02120015
               88  PV-REQ400-REQUIRED        VALUE 2, 3, 4, 7, 11,      02130015
                                                   12, 13, 22, 25,      02140015
                                                   32, 38, 39           02150015
                                                   41, 42, 49.          02160015
               88  PV-REQ400-OPT-ECHO        VALUE 35, 37, 44, 48, 53,  02170015
                                                   54, 59.              02180015
               88  PV-REQ400-OPTIONAL        VALUE 45, 46, 47,          02190015
                                                   61, 62.              02200015
                                                                        02210015
           05  AU014-RES410-BIT-VALIDATION          PIC 9(02).          02220015
               88  PV-RES410-REQUIRED        VALUE 5, 38, 39.           02230015
               88  PV-RES410-REQ-ECHO        VALUE 2, 3, 4, 7, 11       02240015
                                                   41, 49.              02250015
               88  PV-RES410-OPT-ECHO        VALUE 32, 35, 37, 44,      02260015
                                                   48, 53, 54, 59.      02270015
               88  PV-RES410-OPTIONAL        VALUE 6, 8, 46, 47,        02280015
                                                   61, 62.              02290015
                                                                        02300015
           05  AU014-REQ800-BIT-VALIDATION          PIC 9(02).          02310015
               88  PV-REQ800-REQUIRED        VALUE 7, 11, 70.           02320015
               88  PV-REQ800-OPT-ECHO        VALUE 1, 59.               02330015
                                                                        02340015
           05  AU014-RES810-BIT-VALIDATION          PIC 9(02).          02350015
               88  PV-RES810-REQUIRED        VALUE 39.                  02360015
               88  PV-RES810-REQ-ECHO        VALUE 7, 11, 70.           02370015
               88  PV-RES810-OPT-ECHO        VALUE 1, 59.               02380015
                                                                        02390015
