000100*************************                                         00010001
000200 IDENTIFICATION DIVISION.                                         00020001
000300*************************                                         00030001
000400 PROGRAM-ID.      BCKUT006.                                       00040001
000500 AUTHOR.          MIKE SOMMERS.                                   00050001
000600 DATE-WRITTEN.    MARCH 2002.                                     00060001
000700                                                                  00070001
000800*    READ FILE OF EMPLOYEE INFO FORMATTED FOR BC AND CREATE       00080019
000900*    A COMMA DELIMITED FILE.                                      00090001
001000                                                                  00100001
001100 ENVIRONMENT DIVISION.                                            00110001
001200 CONFIGURATION SECTION.                                           00120001
001300 SOURCE-COMPUTER. IBM-3090.                                       00130001
001400 OBJECT-COMPUTER. IBM-3090.                                       00140001
001500                                                                  00150001
001600 INPUT-OUTPUT SECTION.                                            00160001
001700 FILE-CONTROL.                                                    00170001
001800     SELECT EMPLOYEE-FILE              ASSIGN TO INP01.           00180001
001900     SELECT BC-IMPORT-FILE             ASSIGN TO OUT01.           00190019
002000                                                                  00200012
002100***************                                                   00210001
002200 DATA DIVISION.                                                   00220001
002300***************                                                   00230001
002400 FILE SECTION.                                                    00240001
002500 FD  EMPLOYEE-FILE                                                00250001
002510                             BLOCK CONTAINS 0 RECORDS,            00251001
002520                             RECORD CONTAINS 740 CHARACTERS,      00252023
002530                             RECORDING MODE IS F,                 00253001
002540                             LABEL RECORDS ARE STANDARD,          00254001
002550                             DATA RECORD IS EMPLOYEE-REC.         00255001
002560 01  EMPLOYEE-REC            PIC X(740).                          00256023
002570                                                                  00257001
002580 FD  BC-IMPORT-FILE                                               00258018
002590                             BLOCK CONTAINS 0 RECORDS,            00259001
002600                             RECORD CONTAINS 600 CHARACTERS,      00260023
002700                             RECORDING MODE IS F,                 00270001
002800                             LABEL RECORDS ARE STANDARD,          00280001
002900                             DATA RECORD IS BC-REC.               00290018
003000 01  BC-REC                  PIC X(600).                          00300023
003100                                                                  00310012
003200*************************                                         00320001
003300 WORKING-STORAGE SECTION.                                         00330001
003400*************************                                         00340001
003410                                                                  00341012
003420 01  PS-PROGRAM-SWITCHES.                                         00342012
003430     05  PS-END-OF-EMPLOYEE-FILE-SW                               00343012
003440                                 PIC X(1)     VALUE 'N'.          00344012
003450         88  PS-END-OF-EMPLOYEE-FILE          VALUE 'Y'.          00345012
003460                                                                  00346012
003500 01  PC-PROGRAM-CONSTANTS.                                        00350001
003501     05  PC-CURRENT-PROGRAM-NAME PIC X(8)     VALUE 'BCKUT006'.   00350112
003502     05  PC-COMMA                PIC X(1)     VALUE ','.          00350212
003503     05  PC-DOUBLE-QUOTE         PIC X(1)     VALUE '"'.          00350312
003504     05  PC-AT-DOMAIN-REFERENCE  PIC X(1)     VALUE '@'.          00350412
003505     05  PC-DOMAIN-EXTENSION     PIC X(1)     VALUE '.'.          00350524
003506                                                                  00350612
003507 01  PV-PROGRAM-VARIABLES.                                        00350717
003508     05  PV-TALLY                PIC S9(4)    VALUE ZEROS         00350812
003509                                              COMP SYNC.          00350912
003514                                                                  00351412
003515*                                                                 00351512
003516*  MERGED EMPLOYEE FILE RECORD LAYOUT                             00351612
003517*                                                                 00351712
003520     COPY BCRD002.                                                00352004
005965                                                                  00596501
005966 01  BIR-BC-IMPORT-RECORD.                                        00596618
005967     05  BIR-EMPLOYEE-NUMBER         PIC 9(7)      VALUE ZEROES.  00596718
005968     05  FILLER                      PIC X(1)      VALUE ','.     00596801
005969     05  BIR-LAST-NAME               PIC X(18)     VALUE SPACES.  00596918
005970     05  FILLER                      PIC X(1)      VALUE ','.     00597001
005971     05  BIR-FIRST-NAME              PIC X(22)     VALUE SPACES.  00597118
005972     05  FILLER                      PIC X(1)      VALUE ','.     00597201
005973     05  BIR-ADDRESS                 PIC X(35)     VALUE SPACES.  00597318
005974     05  FILLER                      PIC X(1)      VALUE ','.     00597401
005975     05  BIR-CITY                    PIC X(20)     VALUE SPACES.  00597518
005976     05  FILLER                      PIC X(1)      VALUE ','.     00597601
005977     05  BIR-STATE                   PIC X(2)      VALUE SPACES.  00597718
005978     05  FILLER                      PIC X(1)      VALUE ','.     00597801
005979     05  BIR-ZIP                     PIC 9(5)      VALUE ZEROES.  00597918
005980     05  FILLER                      PIC X(1)      VALUE ','.     00598001
005990     05  BIR-PHONE                   PIC X(12)     VALUE SPACES.  00599018
006000     05  FILLER                      PIC X(1)      VALUE ','.     00600001
006100     05  BIR-LOCATION-TYPE           PIC X(2)      VALUE SPACES.  00610021
006110     05  FILLER                      PIC X(1)      VALUE ','.     00611021
006120     05  BIR-LOCATION                PIC X(4)      VALUE SPACES.  00612021
006200     05  FILLER                      PIC X(1)      VALUE ','.     00620001
006300     05  BIR-LOCATION-NAME           PIC X(30)     VALUE SPACES.  00630018
006400     05  FILLER                      PIC X(1)      VALUE ','.     00640001
006500     05  BIR-DEPARTMENT              PIC X(7)      VALUE SPACES.  00650018
006600     05  FILLER                      PIC X(1)      VALUE ','.     00660001
006700     05  BIR-DEPARTMENT-NAME         PIC X(30)     VALUE SPACES.  00670018
006800     05  FILLER                      PIC X(1)      VALUE ','.     00680001
007100     05  BIR-EMP-PERSON-TYPE         PIC X(16)     VALUE SPACES.  00710018
007200     05  FILLER                      PIC X(1)      VALUE ','.     00720001
007500     05  BIR-EMP-STATUS              PIC X(1)      VALUE SPACES.  00750018
007600     05  FILLER                      PIC X(1)      VALUE ','.     00760001
007700     05  BIR-EMP-TYPE                PIC X(1)      VALUE SPACES.  00770018
008900     05  FILLER                      PIC X(1)      VALUE ','.     00890001
009000     05  BIR-EMPLOYEE-USER-ID        PIC X(7)      VALUE SPACES.  00900018
009100     05  FILLER                      PIC X(1)      VALUE ','.     00910001
009200     05  BIR-JOB-TITLE               PIC X(75)     VALUE SPACES.  00920018
009300     05  FILLER                      PIC X(1)      VALUE ','.     00930001
009400     05  BIR-WORK-PHONE              PIC X(12)     VALUE SPACES.  00940018
009500     05  FILLER                      PIC X(1)      VALUE ','.     00950001
009600     05  BIR-CELL-PHONE              PIC X(16)     VALUE SPACES.  00960018
009700     05  FILLER                      PIC X(1)      VALUE ','.     00970001
010000     05  BIR-WORK-EMAIL-ADDRESS      PIC X(60)     VALUE SPACES.  01000023
010100     05  FILLER                      PIC X(1)      VALUE ','.     01010001
010110     05  BIR-HOME-EMAIL-ADDRESS      PIC X(60)     VALUE SPACES.  01011023
010120     05  FILLER                      PIC X(1)      VALUE ','.     01012018
010130     05  BIR-HOME-EMAIL-ADDRESS-2    PIC X(60)     VALUE SPACES.  01013023
010140     05  FILLER                      PIC X(1)      VALUE ','.     01014020
010200     05  BIR-SUPERVISOR              PIC X(60)     VALUE SPACES.  01020018
010210     05  FILLER                      PIC X(1)      VALUE ','.     01021004
010220     05  BIR-DIST-NBR                PIC X(4)      VALUE SPACES.  01022018
010230     05  FILLER                      PIC X(1)      VALUE ','.     01023004
010240     05  BIR-REGN-NBR                PIC X(4)      VALUE SPACES.  01024018
010250     05  FILLER                      PIC X(1)      VALUE ','.     01025004
010260     05  BIR-TERR-NBR                PIC X(4)      VALUE SPACES.  01026018
010400                                                                  01040001
010500 01  BIR-BC-IMPORT-HEADER.                                        01050018
010600     05  FILLER                      PIC X(7)      VALUE          01060001
010700         'EMP NBR'.                                               01070001
010800     05  FILLER                      PIC X(1)      VALUE ','.     01080001
010900     05  FILLER                      PIC X(18)     VALUE          01090001
011000         'LAST NAME         '.                                    01100001
011100     05  FILLER                      PIC X(1)      VALUE ','.     01110001
011200     05  FILER                       PIC X(22)     VALUE          01120001
011300         'FIRST NAME            '.                                01130001
011400     05  FILLER                      PIC X(1)      VALUE ','.     01140001
011500     05  FILLER                      PIC X(35)     VALUE          01150001
011600         'ADDRESS                            '.                   01160001
011700     05  FILLER                      PIC X(1)      VALUE ','.     01170001
011800     05  FILLER                      PIC X(20)     VALUE          01180001
011900         'CITY                '.                                  01190001
012000     05  FILLER                      PIC X(1)      VALUE ','.     01200001
012100     05  FILLER                      PIC X(2)      VALUE          01210001
012200         'ST'.                                                    01220001
012300     05  FILLER                      PIC X(1)      VALUE ','.     01230001
012400     05  FILLER                      PIC X(5)      VALUE          01240001
012500         ' ZIP '.                                                 01250001
012600     05  FILLER                      PIC X(1)      VALUE ','.     01260001
012700     05  FILLER                      PIC X(12)     VALUE          01270001
012800         'HOME PHONE  '.                                          01280001
012900     05  FILLER                      PIC X(1)      VALUE ','.     01290001
013000     05  FILLER                      PIC X(2)      VALUE          01300021
013100         'LT'.                                                    01310021
013110     05  FILLER                      PIC X(1)      VALUE ','.     01311021
013120     05  FILLER                      PIC X(4)      VALUE          01312021
013130         'LOC '.                                                  01313021
013200     05  FILLER                      PIC X(1)      VALUE ','.     01320001
013300     05  FILLER                      PIC X(30)     VALUE          01330001
013400         'LOCATION NAME                 '.                        01340001
013500     05  FILLER                      PIC X(1)      VALUE ','.     01350001
013600     05  FILLER                      PIC X(7)      VALUE          01360001
013700         'DEPT   '.                                               01370001
013800     05  FILLER                      PIC X(1)      VALUE ','.     01380001
013900     05  FILLER                      PIC X(30)     VALUE          01390001
014000         'DEPARTMENT NAME               '.                        01400001
014100     05  FILLER                      PIC X(1)      VALUE ','.     01410001
014500     05  FILLER                      PIC X(16)     VALUE          01450001
014600         'TYPE OF PERSON  '.                                      01460001
014700     05  FILLER                      PIC X(1)      VALUE ','.     01470001
015100     05  FILLER                      PIC X(1)      VALUE          01510001
015200         'S'.                                                     01520001
015300     05  FILLER                      PIC X(1)      VALUE ','.     01530001
015400     05  FILLER                      PIC X(1)      VALUE          01540001
015500         'E'.                                                     01550001
016800     05  FILLER                      PIC X(1)      VALUE ','.     01680001
016900     05  FILLER                      PIC X(7)      VALUE          01690001
017000         'USER ID'.                                               01700001
017100     05  FILLER                      PIC X(1)      VALUE ','.     01710001
017200     05  FILLER                      PIC X(54)     VALUE          01720001
017300         'JOB TITLE                                             '.01730001
017400     05  FILLER                      PIC X(21)     VALUE          01740001
017500         '                     '.                                 01750001
017600     05  FILLER                      PIC X(1)      VALUE ','.     01760001
017700     05  FILLER                      PIC X(12)     VALUE          01770001
017800         'WORK PHONE  '.                                          01780001
017900     05  FILLER                      PIC X(1)      VALUE ','.     01790001
018000     05  FILLER                      PIC X(16)     VALUE          01800001
018100         'CELL PHONE      '.                                      01810001
018200     05  FILLER                      PIC X(1)      VALUE ','.     01820001
018800     05  FILLER                      PIC X(60)     VALUE          01880023
018900         'WORK E-MAIL ADDRESS                     '.              01890001
019000     05  FILLER                      PIC X(1)      VALUE ','.     01900001
019010     05  FILLER                      PIC X(60)     VALUE          01901023
019020         'HOME E-MAIL ADDRESS                     '.              01902018
019030     05  FILLER                      PIC X(1)      VALUE ','.     01903018
019040     05  FILLER                      PIC X(60)     VALUE          01904023
019050         'ADDITIONAL HOME E-MAIL ADDRESS          '.              01905020
019060     05  FILLER                      PIC X(1)      VALUE ','.     01906020
019100     05  FILLER                      PIC X(54)     VALUE          01910001
019200         'SUPERVISOR                                            '.01920001
019300     05  FILLER                      PIC X(6)      VALUE          01930001
019400         '    '.                                                  01940001
019410     05  FILLER                      PIC X(1)      VALUE ','.     01941004
019420     05  FILLER                      PIC X(4)      VALUE 'DIST'.  01942004
019430     05  FILLER                      PIC X(1)      VALUE ','.     01943004
019440     05  FILLER                      PIC X(4)      VALUE 'REGN'.  01944004
019450     05  FILLER                      PIC X(1)      VALUE ','.     01945004
019460     05  FILLER                      PIC X(4)      VALUE 'TERR'.  01946004
020400                                                                  02040012
022510********************                                              02251001
022520 PROCEDURE DIVISION.                                              02252001
022530********************                                              02253001
022590     OPEN INPUT  EMPLOYEE-FILE.                                   02259001
022600     OPEN OUTPUT BC-IMPORT-FILE.                                  02260018
022620     WRITE BC-REC FROM BIR-BC-IMPORT-HEADER                       02262018
022700     PERFORM Z100-READ-EMP-FILE.                                  02270004
022710     PERFORM A100-PROCESS-EMP-FILE                                02271004
022800         UNTIL PS-END-OF-EMPLOYEE-FILE.                           02280004
022900     CLOSE EMPLOYEE-FILE                                          02290001
023000           BC-IMPORT-FILE.                                        02300018
023600     STOP RUN.                                                    02360001
024900                                                                  02490001
025000***********************                                           02500001
025100 A100-PROCESS-EMP-FILE.                                           02510004
025200***********************                                           02520001
025300     MOVE BC002-EMPLOYEE-NUMBER                                   02530004
025310                             TO BIR-EMPLOYEE-NUMBER.              02531018
025400     MOVE BC002-LAST-NAME    TO BIR-LAST-NAME.                    02540018
025410     INSPECT BIR-LAST-NAME                                        02541018
025420         REPLACING ALL PC-COMMA BY SPACES                         02542002
025430                       PC-DOUBLE-QUOTE BY SPACES.                 02543002
025440                                                                  02544002
025500     MOVE BC002-FIRST-NAME   TO BIR-FIRST-NAME.                   02550018
025600                                                                  02560001
025700     MOVE BC002-ADDRESS      TO BIR-ADDRESS.                      02570018
025800     INSPECT BIR-ADDRESS                                          02580018
025900         REPLACING ALL PC-COMMA BY SPACES                         02590001
025910                       PC-DOUBLE-QUOTE BY SPACES.                 02591001
026000                                                                  02600001
026100     MOVE BC002-CITY         TO BIR-CITY.                         02610018
026200     INSPECT BIR-CITY                                             02620018
026300         REPLACING ALL PC-COMMA BY SPACES                         02630002
026310                       PC-DOUBLE-QUOTE BY SPACES.                 02631002
026400                                                                  02640001
026500     MOVE BC002-STATE        TO BIR-STATE.                        02650018
026600     MOVE BC002-ZIP          TO BIR-ZIP.                          02660018
026700     MOVE BC002-PHONE        TO BIR-PHONE.                        02670018
026800     MOVE BC002-LOCATION-TYPE                                     02680021
026801                             TO BIR-LOCATION-TYPE.                02680121
026810     MOVE BC002-LOCATION     TO BIR-LOCATION.                     02681021
026900     MOVE BC002-LOCATION-NAME                                     02690004
026901                             TO BIR-LOCATION-NAME.                02690118
026910     INSPECT BIR-LOCATION-NAME                                    02691018
026920         REPLACING ALL PC-COMMA BY SPACES                         02692002
026930                       PC-DOUBLE-QUOTE BY SPACES.                 02693002
027000     MOVE BC002-DEPARTMENT   TO BIR-DEPARTMENT.                   02700018
027100     MOVE BC002-DEPARTMENT-NAME                                   02710004
027110                             TO BIR-DEPARTMENT-NAME.              02711018
027120     INSPECT BIR-DEPARTMENT-NAME                                  02712018
027130         REPLACING ALL PC-COMMA BY SPACES                         02713011
027140                       PC-DOUBLE-QUOTE BY SPACES.                 02714011
027300     MOVE BC002-EMP-PERSON-TYPE                                   02730004
027310                             TO BIR-EMP-PERSON-TYPE.              02731018
027500     MOVE BC002-EMP-STATUS   TO BIR-EMP-STATUS.                   02750018
027600     MOVE BC002-EMP-TYPE     TO BIR-EMP-TYPE.                     02760018
030000     MOVE BC002-EMPLOYEE-USER-ID(1:7)                             03000004
030100                             TO BIR-EMPLOYEE-USER-ID.             03010018
030200     MOVE BC002-JOB-TITLE    TO BIR-JOB-TITLE.                    03020018
030210     INSPECT BIR-JOB-TITLE                                        03021018
030220         REPLACING ALL PC-COMMA BY SPACES                         03022003
030230                       PC-DOUBLE-QUOTE BY SPACES.                 03023003
030300     MOVE BC002-WORK-PHONE   TO BIR-WORK-PHONE.                   03030018
030400     MOVE BC002-CELL-PHONE   TO BIR-CELL-PHONE.                   03040018
030401     INITIALIZE BIR-WORK-EMAIL-ADDRESS.                           03040127
030402     IF (BC002-WORK-EMAIL-ADDRESS NOT = SPACES)                   03040227
030410         INITIALIZE PV-TALLY                                      03041027
030500         INSPECT BC002-WORK-EMAIL-ADDRESS                         03050027
030510             TALLYING PV-TALLY                                    03051027
030520             FOR ALL PC-AT-DOMAIN-REFERENCE                       03052027
030530         IF (PV-TALLY = 1)                                        03053027
030540             INITIALIZE PV-TALLY                                  03054027
030550             INSPECT BC002-WORK-EMAIL-ADDRESS                     03055027
030560                 TALLYING PV-TALLY                                03056027
030570                 FOR ALL PC-DOMAIN-EXTENSION                      03057027
030580                 AFTER INITIAL PC-AT-DOMAIN-REFERENCE             03058027
030590             IF (PV-TALLY >= 1)                                   03059027
030591                 MOVE BC002-WORK-EMAIL-ADDRESS                    03059127
030592                             TO BIR-WORK-EMAIL-ADDRESS            03059225
030595                 INSPECT BC002-WORK-EMAIL-ADDRESS                 03059527
030596                     REPLACING ALL PC-COMMA BY SPACES             03059627
030597                                   PC-DOUBLE-QUOTE BY SPACES      03059727
030598             ELSE                                                 03059827
030599                 DISPLAY PC-CURRENT-PROGRAM-NAME ' - INVALID '    03059927
030600                           'WORK EMAIL ADDRESS FOR '              03060027
030601                           BC002-EMPLOYEE-NUMBER ' OF '           03060127
030602                           BC002-WORK-EMAIL-ADDRESS               03060227
030608             END-IF                                               03060827
030710         ELSE                                                     03071027
030722             DISPLAY PC-CURRENT-PROGRAM-NAME ' - INVALID WORK '   03072213
030723                       'EMAIL ADDRESS FOR '                       03072327
030724                       BC002-EMPLOYEE-NUMBER ' OF '               03072427
030725                       BC002-WORK-EMAIL-ADDRESS                   03072527
030730         END-IF                                                   03073013
030740     END-IF.                                                      03074013
030741     INITIALIZE BIR-HOME-EMAIL-ADDRESS.                           03074127
030742     IF (BC002-HOME-EMAIL-ADDRESS NOT = SPACES)                   03074227
030750         INITIALIZE PV-TALLY                                      03075027
030760         INSPECT BC002-HOME-EMAIL-ADDRESS                         03076027
030770             TALLYING PV-TALLY                                    03077027
030780             FOR ALL PC-AT-DOMAIN-REFERENCE                       03078027
030790         IF (PV-TALLY = 1)                                        03079027
030791             INITIALIZE PV-TALLY                                  03079127
030792             INSPECT BC002-HOME-EMAIL-ADDRESS                     03079227
030793                 TALLYING PV-TALLY                                03079327
030794                 FOR ALL PC-DOMAIN-EXTENSION                      03079427
030795                 AFTER INITIAL PC-AT-DOMAIN-REFERENCE             03079527
030796             IF (PV-TALLY >= 1)                                   03079627
030797                 MOVE BC002-HOME-EMAIL-ADDRESS                    03079727
030798                             TO BIR-HOME-EMAIL-ADDRESS            03079825
030799                 INSPECT BC002-HOME-EMAIL-ADDRESS                 03079927
030800                     REPLACING ALL PC-COMMA BY SPACES             03080027
030801                                   PC-DOUBLE-QUOTE BY SPACES      03080127
030802             ELSE                                                 03080227
030803                 DISPLAY PC-CURRENT-PROGRAM-NAME ' - INVALID '    03080327
030804                           'HOME EMAIL ADDRESS FOR '              03080427
030805                           BC002-EMPLOYEE-NUMBER ' OF '           03080527
030806                           BC002-HOME-EMAIL-ADDRESS               03080627
030808             END-IF                                               03080827
030809         ELSE                                                     03080927
030812             DISPLAY PC-CURRENT-PROGRAM-NAME ' - INVALID HOME '   03081218
030813                       'EMAIL ADDRESS FOR '                       03081327
030814                       BC002-EMPLOYEE-NUMBER ' OF '               03081427
030815                       BC002-HOME-EMAIL-ADDRESS                   03081527
030816         END-IF                                                   03081618
030817     END-IF.                                                      03081718
030818     INITIALIZE BIR-HOME-EMAIL-ADDRESS-2.                         03081827
030819     IF (BC002-HOME-EMAIL-ADDRESS-2 NOT = SPACES)                 03081927
030820         INITIALIZE PV-TALLY                                      03082027
030821         INSPECT BC002-HOME-EMAIL-ADDRESS-2                       03082127
030822             TALLYING PV-TALLY                                    03082227
030823             FOR ALL PC-AT-DOMAIN-REFERENCE                       03082327
030824         IF (PV-TALLY = 1)                                        03082427
030825             INITIALIZE PV-TALLY                                  03082527
030826             INSPECT BC002-HOME-EMAIL-ADDRESS-2                   03082627
030827                 TALLYING PV-TALLY                                03082727
030828                 FOR ALL PC-DOMAIN-EXTENSION                      03082827
030829                 AFTER INITIAL PC-AT-DOMAIN-REFERENCE             03082927
030830             IF (PV-TALLY >= 1)                                   03083027
030831                 MOVE BC002-HOME-EMAIL-ADDRESS-2                  03083127
030832                                 TO BIR-HOME-EMAIL-ADDRESS-2      03083227
030833                 INSPECT BC002-HOME-EMAIL-ADDRESS-2               03083327
030834                     REPLACING ALL PC-COMMA BY SPACES             03083427
030835                                   PC-DOUBLE-QUOTE BY SPACES      03083527
030836             ELSE                                                 03083627
030837                 DISPLAY PC-CURRENT-PROGRAM-NAME ' - INVALID '    03083727
030838                           'HOME EMAIL ADDRESS #2 FOR '           03083827
030839                           BC002-EMPLOYEE-NUMBER ' OF '           03083927
030840                           BC002-HOME-EMAIL-ADDRESS-2             03084027
030841             END-IF                                               03084127
030842         ELSE                                                     03084227
030844             DISPLAY PC-CURRENT-PROGRAM-NAME ' - INVALID HOME '   03084425
030845                       'EMAIL ADDRESS #2 FOR '                    03084525
030846                       BC002-EMPLOYEE-NUMBER ' OF '               03084625
030847                       BC002-HOME-EMAIL-ADDRESS-2                 03084725
030848         END-IF                                                   03084825
030849     END-IF.                                                      03084925
030850                                                                  03085020
030900     MOVE BC002-SUPERVISOR   TO BIR-SUPERVISOR.                   03090018
030910     INSPECT BIR-SUPERVISOR                                       03091018
030920         REPLACING ALL PC-COMMA BY SPACES                         03092002
030930                       PC-DOUBLE-QUOTE BY SPACES.                 03093002
030940     MOVE BC002-DIST-NBR     TO BIR-DIST-NBR.                     03094018
030950     MOVE BC002-REGN-NBR     TO BIR-REGN-NBR.                     03095018
030960     MOVE BC002-TERR-NBR     TO BIR-TERR-NBR.                     03096018
031200                                                                  03120001
031300     PERFORM D100-WRITE-OUTPUT.                                   03130001
031500     PERFORM Z100-READ-EMP-FILE.                                  03150004
038400                                                                  03840001
038500*******************                                               03850001
038600 D100-WRITE-OUTPUT.                                               03860001
038700*******************                                               03870001
039100     WRITE BC-REC FROM BIR-BC-IMPORT-RECORD.                      03910018
039200                                                                  03920004
039300********************                                              03930004
039400 Z100-READ-EMP-FILE.                                              03940004
039500********************                                              03950004
039600     READ EMPLOYEE-FILE INTO BC002-EMPLOYEE-RECORD                03960004
039700         AT END                                                   03970004
039800            SET PS-END-OF-EMPLOYEE-FILE TO TRUE.                  03980006
