000100******************************************************************00010000
000200*  COPYBOOK BCRD002            RECORD LENGTH = 660                00020005
000300*  THIS IS THE FILE LAYOUT FOR THE MERGED HR/NOTES FILE WITH      00030000
000310*  ORGANIZATION HIERARCHY INFORMATION                             00031000
000400******************************************************************00040000
000500 01  BC002-EMPLOYEE-RECORD.                                       00050002
000600     05  BC002-EMPLOYEE-NUMBER       PIC 9(7)      VALUE ZEROES.  00060000
000700     05  BC002-LAST-NAME             PIC X(18)     VALUE SPACES.  00070000
000800     05  BC002-FIRST-NAME            PIC X(22)     VALUE SPACES.  00080000
000900     05  BC002-ADDRESS               PIC X(35)     VALUE SPACES.  00090000
001000     05  BC002-CITY                  PIC X(20)     VALUE SPACES.  00100000
001100     05  BC002-STATE                 PIC X(2)      VALUE SPACES.  00110000
001200     05  BC002-ZIP                   PIC X(5)      VALUE ZEROES.  00120000
001300     05  BC002-PHONE                 PIC X(12)     VALUE SPACES.  00130000
001400     05  BC002-LOCATION              PIC X(4)      VALUE SPACES.  00140000
001500     05  BC002-LOCATION-NAME         PIC X(30)     VALUE SPACES.  00150000
001600     05  BC002-DEPARTMENT            PIC X(7)      VALUE SPACES.  00160000
001700     05  BC002-DEPARTMENT-NAME       PIC X(30)     VALUE SPACES.  00170000
001800     05  BC002-TERM-DATE             PIC X(10)     VALUE SPACES.  00180000
001900     05  BC002-EMP-PERSON-TYPE       PIC X(16)     VALUE SPACES.  00190000
002000     05  BC002-EMP-CODE              PIC X(1)      VALUE SPACES.  00200000
002100     05  BC002-EMP-STATUS            PIC X(1)      VALUE SPACES.  00210000
002200     05  BC002-EMP-TYPE              PIC X(1)      VALUE SPACES.  00220000
002300     05  BC002-EMERGENCY-CONTACT-NAME                             00230000
002400                                     PIC X(30)    VALUE SPACES.   00240000
002500     05  BC002-EMERGENCY-CONTACT-PHONE1                           00250000
002600                                     PIC X(12)     VALUE SPACES.  00260000
002700     05  BC002-EMERGENCY-CONTACT-PHONE2                           00270000
002800                                     PIC X(12)     VALUE SPACES.  00280000
002900     05  BC002-EMERGENCY-CONTACT-RELATN                           00290000
003000                                     PIC X(12)     VALUE SPACES.  00300000
003100     05  BC002-EMPLOYEE-USER-ID      PIC X(8)      VALUE SPACES.  00310000
003200     05  BC002-JOB-TITLE             PIC X(75)     VALUE SPACES.  00320000
003300     05  BC002-WORK-PHONE            PIC X(12)     VALUE SPACES.  00330000
003400     05  BC002-CELL-PHONE            PIC X(16)     VALUE SPACES.  00340000
003500     05  BC002-PAGER-PIN             PIC X(60)     VALUE SPACES.  00350000
003600     05  BC002-WORK-EMAIL-ADDRESS    PIC X(60)     VALUE SPACES.  00360005
003610     05  BC002-HOME-EMAIL-ADDRESS    PIC X(60)     VALUE SPACES.  00361005
003620     05  BC002-HOME-EMAIL-ADDRESS-2  PIC X(60)     VALUE SPACES.  00362005
003700     05  BC002-SUPERVISOR            PIC X(60)     VALUE SPACES.  00370000
003800     05  BC002-MARKET                PIC X(28)     VALUE SPACES.  00380000
003900     05  BC002-LOCATION-TYPE         PIC X(2)      VALUE SPACES.  00390000
004000     05  BC002-DIST-NBR              PIC X(4)      VALUE SPACES.  00400001
004100     05  BC002-REGN-NBR              PIC X(4)      VALUE SPACES.  00410001
004200     05  BC002-TERR-NBR              PIC X(4)      VALUE SPACES.  00420001
