000100******************************************************************00010003
000200*  COPYBOOK BCRD001            RECORD LENGTH = 648                00020013
000300*  THIS IS THE FILE LAYOUT FOR THE MERGED HR/EMAIL FILE           00030013
000400******************************************************************00040003
000500 01  BC001-MERGED-RECORD.                                         00050004
000600     05  BC001-EMPLOYEE-NUMBER       PIC 9(7)      VALUE ZEROES.  00060005
000700     05  BC001-LAST-NAME             PIC X(18)     VALUE SPACES.  00070003
000800     05  BC001-FIRST-NAME            PIC X(22)     VALUE SPACES.  00080003
000900     05  BC001-ADDRESS               PIC X(35)     VALUE SPACES.  00090003
001000     05  BC001-CITY                  PIC X(20)     VALUE SPACES.  00100003
001100     05  BC001-STATE                 PIC X(2)      VALUE SPACES.  00110003
001200     05  BC001-ZIP                   PIC X(5)      VALUE ZEROES.  00120003
001300     05  BC001-PHONE                 PIC X(12)     VALUE SPACES.  00130003
001400     05  BC001-LOCATION              PIC X(4)      VALUE SPACES.  00140003
001500     05  BC001-LOCATION-NAME         PIC X(30)     VALUE SPACES.  00150003
001600     05  BC001-DEPARTMENT            PIC X(7)      VALUE SPACES.  00160003
001700     05  BC001-DEPARTMENT-NAME       PIC X(30)     VALUE SPACES.  00170003
001800     05  BC001-TERM-DATE             PIC X(10)     VALUE SPACES.  00180003
001900     05  BC001-EMP-PERSON-TYPE       PIC X(16)     VALUE SPACES.  00190003
002000     05  BC001-EMP-CODE              PIC X(1)      VALUE SPACES.  00200003
002100     05  BC001-EMP-STATUS            PIC X(1)      VALUE SPACES.  00210003
002200     05  BC001-EMP-TYPE              PIC X(1)      VALUE SPACES.  00220003
002300     05  BC001-EMERGENCY-CONTACT-NAME                             00230003
002400                                     PIC X(30)    VALUE SPACES.   00240003
002500     05  BC001-EMERGENCY-CONTACT-PHONE1                           00250003
002600                                     PIC X(12)     VALUE SPACES.  00260003
002700     05  BC001-EMERGENCY-CONTACT-PHONE2                           00270003
002800                                     PIC X(12)     VALUE SPACES.  00280003
002900     05  BC001-EMERGENCY-CONTACT-RELATN                           00290003
003000                                     PIC X(12)     VALUE SPACES.  00300003
003100     05  BC001-EMPLOYEE-USER-ID      PIC X(8)      VALUE SPACES.  00310006
003200     05  BC001-JOB-TITLE             PIC X(75)     VALUE SPACES.  00320003
003300     05  BC001-WORK-PHONE            PIC X(12)     VALUE SPACES.  00330003
003400     05  BC001-CELL-PHONE            PIC X(16)     VALUE SPACES.  00340008
003500     05  BC001-PAGER-PIN             PIC X(60)     VALUE SPACES.  00350003
003600     05  BC001-WORK-EMAIL-ADDRESS    PIC X(60)     VALUE SPACES.  00360013
003610     05  BC001-HOME-EMAIL-ADDRESS    PIC X(60)     VALUE SPACES.  00361013
003620     05  BC001-HOME-EMAIL-ADDRESS-2  PIC X(60)     VALUE SPACES.  00362013
003700     05  BC001-SUPERVISOR            PIC X(60)     VALUE SPACES.  00370003
003800     05  BC001-MARKET                PIC X(28)     VALUE SPACES.  00380009
003900     05  BC001-LOCATION-TYPE         PIC X(2)      VALUE SPACES.  00390009
