      *****************************************************************         
      *    BPRD205 - WEEKLY DEPT/CLASS/CHANNEL PLANNING FACT EXTRACT  *         
      *    LENGTH  - 209 BYTES                                        *         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
      * WR39512 8-2011     MARK FRAMNESS CREATE VIA CLONING MWRD161             
      * ------- ---------- ----------- --------------------------------         
C54778* C254778 03/05/2021 SRINIVASAN  CHANGED THE AMOUNT LENGTH FROM           
C54778*                                +9(9) TO +9(11) TO ACCOMODATE            
C54778*                                AMOUNT UP TO 99 BILLION                  
C54778*****************************************************************         
      *                                                                         
       01  BP205-WEEKLY-PLN-FCT-RECORD.                                         
           05  FILLER                    PIC X(01) VALUE '_'.                   
           05  BP205-DEPT-NBR            PIC X(03) VALUE SPACES.                
           05  FILLER                    PIC X(03) VALUE '_,_'.                 
           05  BP205-MAJ-CL-NBR          PIC X(02) VALUE SPACES.                
           05  FILLER                    PIC X(03) VALUE '_,_'.                 
           05  BP205-CHNL-CDE            PIC X(01) VALUE SPACES.                
           05  FILLER                    PIC X(03) VALUE '_,_'.                 
           05  BP205-TM-DIM-KY-DTE       PIC X(10) VALUE SPACES.                
           05  FILLER                    PIC X(02) VALUE '_,'.                  
C54778     05  BP205-EOPINV-COST-AMT     PIC +9(11).9(2).                       
           05  FILLER                    PIC X(01) VALUE ','.                   
C54778     05  BP205-SLS-COST-AMT        PIC +9(11).9(2).                       
           05  FILLER                    PIC X(01) VALUE ','.                   
C54778     05  BP205-PROMO-MKDN-AMT      PIC +9(11).9(2).                       
           05  FILLER                    PIC X(01) VALUE ','.                   
C54778     05  BP205-PERM-MKDN-AMT       PIC +9(11).9(2).                       
           05  FILLER                    PIC X(01) VALUE ','.                   
C54778     05  BP205-RCPT-COST-AMT       PIC +9(11).9(2).                       
           05  FILLER                    PIC X(01) VALUE ','.                   
C54778     05  BP205-RCPT-RTL-AMT        PIC +9(11).9(2).                       
           05  FILLER                    PIC X(01) VALUE ','.                   
C54778     05  BP205-PADJ-COST-AMT       PIC +9(11).9(2).                       
           05  FILLER                    PIC X(01) VALUE ','.                   
C54778     05  BP205-PADJ-RTL-AMT        PIC +9(11).9(2).                       
           05  FILLER                    PIC X(01) VALUE ','.                   
C54778     05  BP205-FRT-COST-AMT        PIC +9(11).9(2).                       
           05  FILLER                    PIC X(01) VALUE ','.                   
C54778     05  BP205-SLS-AMT             PIC +9(11).9(2).                       
           05  FILLER                    PIC X(01) VALUE ','.                   
C54778     05  BP205-BOPINV-RTL-AMT      PIC +9(11).9(2).                       
           05  FILLER                    PIC X(01) VALUE ','.                   
C54778     05  BP205-EOPINV-RTL-AMT      PIC +9(11).9(2).                       
           05  FILLER                    PIC X(01) VALUE ','.                   
C54778     05  BP205-GRO-RCPT-QTY        PIC +9(11).9(2).                       
