00001 ***************************************************************** 01/02/96
00002 *    THESE RECORDS DETAIL THE CONTROL CARD FOR MERCHANDISE        BPRD045 
00003 *    PLANNING.                                                       LV009
00004 *                                                                 BPRD045 
00005 *    RECORD LENGTH:  50 BYTES                                        CL**9
00006 ***************************************************************** BPRD045 
00007  01  BP045-REC.                                                   BPRD045 
00008      05  BP045-SEASON-START-DATE.                                 BPRD045 
00009          10  BP045-SEASON-START-YEAR.                             BPRD045 
00010              15  BP045-SEASON-START-CC  PIC X(02)  VALUE SPACES.  BPRD045 
00011              15  BP045-SEASON-START-YY  PIC X(02)  VALUE SPACES.  BPRD045 
00012          10  BP045-SEASON-START-MONTH   PIC X(02)  VALUE SPACES.  BPRD045 
00013          10  BP045-SEASON-START-DAY     PIC X(02)  VALUE SPACES.  BPRD045 
00014      05  FILLER                         PIC X(01)  VALUE SPACES.     CL**2
00015      05  BP045-RUN-MODE                 PIC X(02)  VALUE SPACES.     CL**2
00016          88  BP045-LY-RUN-MODE                     VALUE 'LY'.       CL**2
00017          88  BP045-TY-RUN-MODE                     VALUE 'TY'.       CL**2
00018          88  BP045-VALID-RUN-MODE                  VALUE 'LY'        CL**2
00019                                                          'TY'.       CL**3
00020      05  FILLER                         PIC X(01)  VALUE SPACES.     CL**4
00021      05  BP045-RUN-DATE.                                             CL**4
00022          10  BP045-RUN-DATE-YEAR.                                    CL**4
00023              15  BP045-RUN-DATE-CC      PIC X(02)  VALUE SPACES.     CL**4
00024              15  BP045-RUN-DATE-YY      PIC X(02)  VALUE SPACES.     CL**4
00025          10  FILLER                     PIC X(01)  VALUE SPACE.      CL**4
00026          10  BP045-RUN-DATE-MONTH       PIC X(02)  VALUE SPACES.     CL**4
00027          10  FILLER                     PIC X(01)  VALUE SPACE.      CL**4
00028          10  BP045-RUN-DATE-DAY         PIC X(02)  VALUE SPACES.     CL**4
00029      05  FILLER                         PIC X(01)  VALUE SPACES.     CL**5
00030      05  BP045-LY-SEASON-START-DATE.                                 CL**5
00031          10  BP045-LY-SEASON-START-YEAR.                             CL**5
00032              15  BP045-LY-SEASON-START-CC PIC X(02)  VALUE SPACES.   CL**6
00033              15  BP045-LY-SEASON-START-YY PIC X(02)  VALUE SPACES.   CL**6
00034          10  FILLER                       PIC X(01)  VALUE SPACE.    CL**7
00035          10  BP045-LY-SEASON-START-MONTH  PIC X(02)  VALUE SPACES.   CL**6
00036          10  FILLER                       PIC X(01)  VALUE SPACE.    CL**7
00037          10  BP045-LY-SEASON-START-DAY    PIC X(02)  VALUE SPACES.   CL**6
00038      05  FILLER                           PIC X(17)  VALUE SPACES.   CL**9
