       01  BP420-RECORD.                                                00010000
           10 BP420-FSCL-WK-END-DTE         PIC X(10).                  00020000
           10 BP420-DEPT-NBR                PIC X(03).                  00030000
           10 BP420-MAJ-CL-NBR              PIC X(01).                  00040000
           10 BP420-PO-TYP-CDE              PIC X(02).                  00050000
           10 BP420-RCPT-RTL-AMT            PIC S9(11)V9(2) COMP-3.     00060000
           10 BP420-RCPT-NET-COST-AMT       PIC S9(11)V9(2) COMP-3.     00070000
                                                                        00080000
