      ***************************************************************** 00010000
      *   BPRD150 - OUTPUT RECORD LAYOUT FOR SEASONAL EXTRACT.        * 00020002
      *                                                               * 00030002
      *    RECORD LENGTH - 700 BYTES                                   *00040007
      *                                                               * 00050000
      *CHANGE HISTORY:                                                * 00060000
      *                                                               * 00070000
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES         * 00080000
      *                                                               * 00090000
      *------- ---------- ----------- --------------------------------* 00100000
      *                                                               * 00110000
      * EP UPG 04-21-2010 CTS NEW COPY BOOK FOR EP SEASONAL EXTRACT   * 00120002
      *                                                               * 00130000
      ***************************************************************** 00140000
      *                                                               * 00141000
       01  BP150-RECORD.                                                00150002
           03 BP150-ACTUAL-SALES.                                       00151002
               05 BP150-TRANS-ID1             PIC 9(09).                00152013
               05 BP150-SEQ1                  PIC 9(09).                00153013
               05 BP150-PRODUCT-NAME1.                                  00154002
                  10 FILLER1                  PIC X.                    00154126
                  10 BP150-DEPARTMENT-NBR1    PIC X(03).                00155013
                  10 FILLER2                  PIC X.                    00156026
                  10 BP150-CLASS-NBR1         PIC X(02).                00157013
                  10 FILLER3                  PIC X.                    00190026
               05 BP150-ORGANIZATION-NAME1    PIC X(30).                00200013
               05 BP150-CALENDAR-NAME1.                                 00210002
                  10 BP150-SEASON1            PIC X.                    00220004
                  10 BP150-YEAR1              PIC X(4).                 00230004
                  10 FILLER4                  PIC X.                    00240026
                  10 BP150-WEEK-NBR1          PIC X(02).                00250004
                  10 FILLER5                  PIC X(22).                00260026
                05 BP150-C-SLS-DLR            PIC S9(11)V9(5).          00270027
                05 BP150-N-SLS-DLR            PIC S9(11)V9(5).          00280027
                05 BP150-N-SLS10-DLR          PIC S9(11)V9(5).          00290027
                05 BP150-N-SLS11-DLR          PIC S9(11)V9(5).          00300027
                05 BP150-N-SLS12-DLR          PIC S9(11)V9(5).          00310027
                05 BP150-N-SLS1-DLR           PIC S9(11)V9(5).          00320027
                05 BP150-N-SLS2-DLR           PIC S9(11)V9(5).          00330027
                05 BP150-N-SLS3-DLR           PIC S9(11)V9(5).          00340027
                05 BP150-N-SLS4-DLR           PIC S9(11)V9(5).          00350027
                05 BP150-N-SLS5-DLR           PIC S9(11)V9(5).          00360027
                05 BP150-N-SLS6-DLR           PIC S9(11)V9(5).          00370027
                05 BP150-N-SLS7-DLR           PIC S9(11)V9(5).          00380027
                05 BP150-N-SLS8-DLR           PIC S9(11)V9(5).          00390027
                05 BP150-N-SLS9-DLR           PIC S9(11)V9(5).          00400027
                05 BP150-SLS-DLR              PIC S9(11)V9(5).          00410027
            03 BP150-ACTUAL-RECEIPTS REDEFINES BP150-ACTUAL-SALES.      00420002
               05 BP150-TRANS-ID2             PIC 9(09).                00430004
               05 BP150-SEQ2                  PIC 9(09).                00440004
               05 BP150-PRODUCT-NAME2.                                  00450002
                  10 FILLER6                  PIC X.                    00451026
                  10 BP150-DEPARTMENT-NBR2    PIC X(03).                00460004
                  10 FILLER7                  PIC X.                    00470026
                  10 BP150-CLASS-NBR2         PIC X(02).                00480004
                  10 FILLER8                  PIC X.                    00490026
               05 BP150-ORGANIZATION-NAME2    PIC X(30).                00500004
               05 BP150-CALENDAR-NAME2.                                 00510002
                  10 BP150-SEASON2            PIC X.                    00520004
                  10 BP150-YEAR2              PIC X(4).                 00530004
                  10 FILLER9                  PIC X.                    00540026
                  10 BP150-WEEK-NBR2          PIC X(02).                00550004
                  10 FILLER10                 PIC X(22).                00560026
               05 BP150-ACCTPAY-CST           PIC S9(11)V9(5).          00570027
               05 BP150-ACCTPAY-DLR           PIC S9(11)V9(5).          00580027
               05 BP150-CONSIGN-CST           PIC S9(11)V9(5).          00590027
               05 BP150-CONSIGN-DLR           PIC S9(11)V9(5).          00600027
               05 BP150-CONVERT-CST           PIC S9(11)V9(5).          00610027
               05 BP150-CONVERT-DLR           PIC S9(11)V9(5).          00620027
               05 BP150-CUST-DIR-CST          PIC S9(11)V9(5).          00630027
               05 BP150-CUST-DIR-DLR          PIC S9(11)V9(5).          00640027
               05 BP150-DECOM-CST             PIC S9(11)V9(5).          00650027
               05 BP150-DECOM-DLR             PIC S9(11)V9(5).          00660027
               05 BP150-FLBACK-CST            PIC S9(11)V9(5).          00670027
               05 BP150-FLBACK-DLR            PIC S9(11)V9(5).          00680027
               05 BP150-GREC-UNT              PIC S9(11)V9(5).          00730027
               05 BP150-I-FLBACK-CST          PIC S9(11)V9(5).          00740027
               05 BP150-I-FLBACK-DLR          PIC S9(11)V9(5).          00750027
               05 BP150-IECOM-CST             PIC S9(11)V9(5).          00760027
               05 BP150-IECOM-DLR              PIC S9(11)V9(5).         00770027
               05 BP150-IMPORT-CST             PIC S9(11)V9(5).         00780027
               05 BP150-IMPORT-DLR             PIC S9(11)V9(5).         00790027
               05 BP150-INFOREM-CST            PIC S9(11)V9(5).         00800027
               05 BP150-INFOREM-DLR            PIC S9(11)V9(5).         00810027
               05 BP150-LANDED-CST             PIC S9(11)V9(5).         00820027
               05 BP150-LANDED-DLR             PIC S9(11)V9(5).         00830027
               05 BP150-MODSTK-CST             PIC S9(11)V9(5).         00840027
               05 BP150-MODSTK-DLR             PIC S9(11)V9(5).         00850027
               05 BP150-SAMPLES-CST            PIC S9(11)V9(5).         00860027
               05 BP150-SAMPLES-DLR            PIC S9(11)V9(5).         00870027
               05 BP150-SPECIAL-CST            PIC S9(11)V9(5).         00880027
               05 BP150-SPECIAL-DLR            PIC S9(11)V9(5).         00890027
               05 BP150-STANDARD-CST           PIC S9(11)V9(5).         00900027
               05 BP150-STANDARD-DLR           PIC S9(11)V9(5).         00910027
               05 BP150-VENGEN-CST             PIC S9(11)V9(5).         00920027
               05 BP150-VENGEN-DLR             PIC S9(11)V9(5).         00930027
               05 BP150-GREC-EFC-CST           PIC S9(11)V9(5).         00931027
               05 BP150-GREC-EFC-DLR           PIC S9(11)V9(5).         00932027
           03 BP150-ACTUAL-OTHINV-CC REDEFINES BP150-ACTUAL-SALES.      00940020
               05 BP150-TRANS-ID3              PIC 9(09).               00950004
               05 BP150-SEQ3                   PIC 9(09).               00960004
               05 BP150-PRODUCT-NAME3.                                  00970002
                  10 FILLER11                  PIC X.                   00971026
                  10 BP150-DEPARTMENT-NBR3     PIC X(03).               00980004
                  10 FILLER12                  PIC X.                   00990026
                  10 BP150-CLASS-NBR3          PIC X(02).               01000004
                  10 FILLER13                  PIC X.                   01010026
               05 BP150-ORGANIZATION-NAME3     PIC X(30).               01020004
               05 BP150-CALENDAR-NAME3.                                 01030002
                  10 BP150-SEASON3             PIC X.                   01040004
                  10 BP150-YEAR3               PIC X(4).                01050004
                  10 FILLER14                  PIC X.                   01060026
                  10 BP150-WEEK-NBR3           PIC X(02).               01070004
                  10 FILLER15                  PIC X(22).               01080026
               05 BP150-GREC-CST               PIC S9(11)V9(5).         01101027
               05 BP150-GOTH-CST               PIC S9(11)V9(5).         01102027
           03 BP150-ACTUAL-SALES-LY REDEFINES BP150-ACTUAL-SALES.       01130006
               05 BP150-TRANS-ID4              PIC 9(09).               01140006
               05 BP150-SEQ4                   PIC 9(09).               01150006
               05 BP150-PRODUCT-NAME4.                                  01160006
                  10 FILLER16                  PIC X.                   01161026
                  10 BP150-DEPARTMENT-NBR4     PIC X(03).               01170006
                  10 FILLER17                  PIC X.                   01180026
                  10 BP150-CLASS-NBR4          PIC X(02).               01190006
                  10 FILLER18                  PIC X.                   01200026
               05 BP150-ORGANIZATION-NAME4     PIC X(30).               01210006
               05 BP150-CALENDAR-NAME4.                                 01220006
                  10 BP150-SEASON4             PIC X.                   01230006
                  10 BP150-YEAR4               PIC X(4).                01240006
                  10 FILLER19                  PIC X.                   01250026
                  10 BP150-WEEK-NBR4           PIC X(02).               01260006
                  10 FILLER20                  PIC X(22).               01270026
               05 BP150-C-SLS-DLR-LY           PIC S9(11)V9(5).         01280027
               05 BP150-N-SLS-DLR-LY           PIC S9(11)V9(5).         01300027
           03 BP150-ACTUAL-MKDNS-BV REDEFINES BP150-ACTUAL-SALES.       01310016
               05 BP150-TRANS-ID5              PIC 9(09).               01320016
               05 BP150-SEQ5                   PIC 9(09).               01330016
               05 BP150-PRODUCT-NAME5.                                  01340016
                  10 FILLER21                  PIC X.                   01350026
                  10 BP150-DEPARTMENT-NBR5     PIC X(03).               01360016
                  10 BP150-CLASS-NBR5          PIC X(02).               01380016
                  10 FILLER22                  PIC X(24).               01390026
               05 BP150-ORGANIZATION-NAME5     PIC X(30).               01400016
               05 BP150-CALENDAR-NAME5.                                 01410016
                  10 BP150-SEASON5             PIC X.                   01420016
                  10 BP150-YEAR5               PIC X(4).                01430016
                  10 FILLER23                  PIC X.                   01440026
                  10 BP150-WEEK-NBR5           PIC X(02).               01450016
                  10 FILLER24                  PIC X(22).               01460026
               05 BP150-ASSC-DISC-DLR          PIC S9(11)V9(5).         01470027
               05 BP150-PERM-DLR               PIC S9(11)V9(5).         01480027
               05 BP150-GOLDSTAR-DLR           PIC S9(11)V9(5).         01490027
               05 BP150-PLUMD-DLR              PIC S9(11)V9(5).         01510028
               05 BP150-MKTOFF-DLR             PIC S9(11)V9(5).         01520027
               05 BP150-OTHRMKDN-DLR           PIC S9(11)V9(5).         01530027
           03 BP150-ACTUAL-OTHINV-BV REDEFINES BP150-ACTUAL-SALES.      01540016
               05 BP150-TRANS-ID6              PIC 9(09).               01550016
               05 BP150-SEQ6                   PIC 9(09).               01560016
               05 BP150-PRODUCT-NAME6.                                  01570016
                  10 FILLER25                  PIC X.                   01580026
                  10 BP150-DEPARTMENT-NBR6     PIC X(03).               01590016
                  10 BP150-CLASS-NBR6          PIC X(02).               01610016
                  10 FILLER26                  PIC X(24).               01611026
               05 BP150-ORGANIZATION-NAME6     PIC X(30).               01630016
               05 BP150-CALENDAR-NAME6.                                 01640016
                  10 BP150-SEASON6             PIC X.                   01650016
                  10 BP150-YEAR6               PIC X(4).                01660016
                  10 FILLER27                  PIC X.                   01670026
                  10 BP150-WEEK-NBR6           PIC X(02).               01680016
                  10 FILLER28                  PIC X(22).               01690026
               05 BP150-BO-ADJ-CST             PIC S9(11)V9(5).         01700027
               05 BP150-DA-ADJ-CST             PIC S9(11)V9(5).         01710027
               05 BP150-DA-ADJ-DLR             PIC S9(11)V9(5).         01720027
               05 BP150-FRT-CST                PIC S9(11)V9(5).         01730027
               05 BP150-LIC-FEE-CST            PIC S9(11)V9(5).         01740027
               05 BP150-OTHER-ADJ-CST          PIC S9(11)V9(5).         01750027
               05 BP150-OTHER-ADJ-DLR          PIC S9(11)V9(5).         01760027
               05 BP150-RTV-ADJ-CST            PIC S9(11)V9(5).         01780027
               05 BP150-RTV-ADJ-DLR            PIC S9(11)V9(5).         01790027
               05 BP150-SHR-DLR                PIC S9(11)V9(5).         01800027
               05 BP150-DA-REV-ADJ-CST         PIC S9(11)V9(5).         01810027
               05 BP150-DA-REV-ADJ-DLR         PIC S9(11)V9(5).         01820027
           03 BP150-ACTUAL-INVBAL-BOP-CT REDEFINES BP150-ACTUAL-SALES.  01860025
               05 BP150-TRANS-ID7              PIC 9(09).               01870024
               05 BP150-SEQ7                   PIC 9(09).               01880024
               05 BP150-PRODUCT-NAME7.                                  01890024
                  10 FILLER29                  PIC X.                   01900026
                  10 BP150-DEPARTMENT-NBR7     PIC X(03).               01910024
                  10 FILLER30                  PIC X.                   01920026
                  10 BP150-CLASS-NBR7          PIC X(02).               01930024
                  10 FILLER31                  PIC X.                   01940026
               05 BP150-ORGANIZATION-NAME7     PIC X(30).               01950024
               05 BP150-CALENDAR-NAME7.                                 01960024
                  10 BP150-SEASON7             PIC X.                   01970024
                  10 BP150-YEAR7               PIC X(4).                01980024
                  10 FILLER32                  PIC X.                   01990026
                  10 BP150-WEEK-NBR7           PIC X(02).               02000024
                  10 FILLER33                  PIC X(22).               02010026
               05 BP150-BOP-CST                PIC S9(11)V9(5).         02020027
               05 BP150-BOP-DLR                PIC S9(11)V9(5).         02030027
           03 BP150-ACTUAL-INVBAL-EOP-CT REDEFINES BP150-ACTUAL-SALES.  02040025
               05 BP150-TRANS-ID8              PIC 9(09).               02050024
               05 BP150-SEQ8                   PIC 9(09).               02060024
               05 BP150-PRODUCT-NAME8.                                  02070024
                  10 FILLER34                  PIC X.                   02080026
                  10 BP150-DEPARTMENT-NBR8     PIC X(03).               02090024
                  10 FILLER35                  PIC X.                   02100026
                  10 BP150-CLASS-NBR8          PIC X(02).               02110024
                  10 FILLER36                  PIC X.                   02120026
               05 BP150-ORGANIZATION-NAME8     PIC X(30).               02130024
               05 BP150-CALENDAR-NAME8.                                 02140024
                  10 BP150-SEASON8             PIC X.                   02150024
                  10 BP150-YEAR8               PIC X(4).                02160024
                  10 FILLER37                  PIC X.                   02170026
                  10 BP150-WEEK-NBR8           PIC X(02).               02180024
                  10 FILLER38                  PIC X(22).               02190026
               05 BP150-EOP-CST                PIC S9(11)V9(5).         02200027
               05 BP150-EOP-DLR                PIC S9(11)V9(5).         02210027
               05 BP150-EOP-UNT                PIC S9(11)V9(5).         02220029
