      *****************************************************************         
      *    BPRD209 - WEEKLY PLANNING COST DEPT/CHANNEL ROLLUP EXTRACT *         
      *    LENGTH  - 50 BYTES                                         *         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
      * WR39512 8-2011     MARK FRAMNESS CREATE VIA CLONING MWRD164             
C55777* C255777 04/09/2021 SRINIVASAN  CHANGED THE AMOUNT LENGTH FROM           
C55777*                                +9(9) TO +9(11) TO ACCOMODATE            
C55777*                                AMOUNT UP TO 99 BILLION                  
      *****************************************************************         
      *                                                                         
       01  BP209-WKLY-PLN-CST-DPTCHL-REC.                                       
           05  FILLER                    PIC X(01) VALUE '_'.                   
           05  BP209-DEPT-NBR            PIC X(03) VALUE SPACES.                
           05  FILLER                    PIC X(03) VALUE '_,_'.                 
           05  BP209-CHNL-CDE            PIC X(01) VALUE SPACES.                
           05  FILLER                    PIC X(03) VALUE '_,_'.                 
           05  BP209-TM-DIM-KY-DTE       PIC X(10) VALUE SPACES.                
           05  FILLER                    PIC X(02) VALUE '_,'.                  
C55777     05  BP209-EOPINV-COST-AMT     PIC +9(11).9(2).                       
           05  FILLER                    PIC X(01) VALUE ','.                   
C55777     05  BP209-SLS-COST-AMT        PIC +9(11).9(2).                       
