      ****************************************************************          
      * BPRD102 OUTPUT RECORD LAYOUT.                                           
      ****************************************************************          
       01  BP102-RECORD.                                                        
           05 FILLER                    PIC X(01) VALUE 'C'.                    
           05 BP102-DEPT-NBR            PIC X(03).                              
           05 FILLER                    PIC X(01) VALUE '_'.                    
           05 BP102-MAJOR-CLASS-NBR     PIC X(01).                              
           05 FILLER                    PIC X(02) VALUE '0,'.                   
           05 BP102-CHANNEL             PIC X(07) VALUE 'PHYSSTR'.              
           05 FILLER                    PIC X(01) VALUE ','.                    
           05 BP102-LOCATION            PIC X(04) VALUE 'TOT1'.                 
           05 FILLER                    PIC X(01) VALUE ','.                    
           05 BP102-SEASON              PIC X(08).                              
           05 FILLER                    PIC X(01) VALUE ','.                    
           05 BP102-VARIABLE            PIC X(08).                              
           05 FILLER                    PIC X(01) VALUE '_'.                    
           05 BP102-VARIABLE-TYPE       PIC X(03).                              
           05 FILLER                    PIC X(01) VALUE ','.                    
           05 BP102-VERSION             PIC X(03) VALUE 'MTD'.                  
           05 FILLER                    PIC X(01) VALUE ','.                    
           05 BP102-VALUE               PIC +9(6).99999.                        
           05 FILLER                    PIC X(140) VALUE SPACES.                
                                                                                
