      *****************************************************************         
      *    BPRD204 - SEASONAL PLANNING DATA                           *         
      *    LENGTH  -  600 BYTES                                       *         
SB0504*  UPDATED: 05/25/04 - STACY BIESZK ADDED OVER FLOW FIELD       *         
      *   CLONED: 05/26/11 - MARK FRAMNESS FROM MWRD050               *         
C54778*  UPDATED: 03/04/21 - REMOVED OVERFLOW FIELD AND INCREASED PLAN*         
C54778*                      AMOUNT LENGTH FROM 12 TO 18              *         
      *****************************************************************         
      *                                                                         
       01  BP204-PLANNING-RTL-RECORD.                                           
           05  FILLER                    PIC X(01) VALUE SPACES.                
           05  BP204-DEPT-NBR            PIC X(03) VALUE SPACES.                
           05  FILLER                    PIC X(01) VALUE SPACES.                
           05  BP204-MAJ-CL-NBR          PIC X(02) VALUE SPACES.                
           05  FILLER                    PIC X(29) VALUE SPACES.                
           05  BP204-CHNL-CDE            PIC X(07) VALUE SPACES.                
           05  FILLER                    PIC X(11) VALUE SPACES.                
           05  BP204-PLN-ELEMENT         PIC X(10) VALUE SPACES.                
           05  FILLER                    PIC X(08) VALUE SPACES.                
           05  BP204-PLN-ELEMENT-TYPE    PIC X(02) VALUE SPACES.                
           05  FILLER                    PIC X(16) VALUE SPACES.                
           05  FILLER OCCURS 27 TIMES.                                          
               10 BP204-PLN-AMT          PIC X(18) VALUE SPACES.                
C54778*        10 BP204-OVER-FLOW        PIC X(06) VALUE SPACES.                
           05  FILLER                    PIC X(24) VALUE SPACES.                
