      *****************************************************************         
      *    BPRD206 - WEEKLY DEPT/CLASS/CHANNEL PLANNING COST EXTRACT  *         
      *    LENGTH  - 51 BYTES                                         *         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
      * WR39512 8-2011     MARK FRAMNESS CREATE VIA CLONING MWRD162             
C54778* C254778 03/05/2021 SRINIVASAN  CHANGED THE AMOUNT LENGTH FROM           
C54778*                                +9(9) TO +9(11) TO ACCOMODATE            
C54778*                                AMOUNT UP TO 99 BILLION                  
C54778*****************************************************************         
      *                                                                         
       01  BP206-WEEKLY-PLN-CST-RECORD.                                         
           05  FILLER                    PIC X(01) VALUE '_'.                   
           05  BP206-DEPT-NBR            PIC X(03) VALUE SPACES.                
           05  FILLER                    PIC X(03) VALUE '_,_'.                 
           05  BP206-MAJ-CL-NBR          PIC X(02) VALUE SPACES.                
           05  FILLER                    PIC X(03) VALUE '_,_'.                 
           05  BP206-TM-DIM-KY-DTE       PIC X(10) VALUE SPACES.                
           05  FILLER                    PIC X(02) VALUE '_,'.                  
C54778     05  BP206-EOPINV-COST-AMT     PIC +9(11).9(2).                       
           05  FILLER                    PIC X(01) VALUE ','.                   
C54778     05  BP206-SLS-COST-AMT        PIC +9(11).9(2).                       
