000100******************************************************************00010000
000200*   THIS IS THE RECORD LAYOUT FOR THE LP CHECK FILE SENT         *00020000
000300*   TO THE BANK                                                  *00030000
000400*                                                                *00040000
000500*   RECORD LENGTH:  200 BYTES                                    *00050000
000700******************************************************************00060000
000800 01  BR003-DETAIL-RECORD.                                         00061000
000900     05  BR003-RECORD-TYPE      PIC  X(01).                       00062000
001000     05  BR-SPACE-1             PIC  X(01).                       00063001
001100* ACCOUNT NUMBER - RIGHT JUSTIFIED - ZERO FILLED                  00064000
001100     05  BR003-ACCOUNT-NUMBER   PIC  X(20).                       00065000
001200     05  BR-SPACE-2             PIC  X(01).                       00066001
001100* CHECK NUMBER - RIGHT JUSTIFIED - ZERO FILLED                    00067000
001300     05  BR003-CHECK-NUMBER     PIC  X(18).                       00068000
001200     05  BR-SPACE-3             PIC  X(01).                       00069001
001100* CHECK AMOUNT - RIGHT JUSTIFIED - ZERO FILLED                    00070000
001400     05  BR003-CHECK-AMOUNT     PIC  9(16)V99.                    00080000
001200     05  BR-SPACE-4             PIC  X(01).                       00090001
001100* YYYYMMDD                                                        00100000
001500     05  BR003-ISSUE-DATE       PIC  X(08).                       00110000
001200     05  BR-SPACE-5             PIC  X(01).                       00120001
001100* YYYYMMDD - SPACES IF ISSUED CHECKS                              00121000
001600     05  BR003-PAID-DATE        PIC  X(08).                       00122000
001700     05  BR-SPACE-6             PIC  X(01).                       00123001
001100* SPACES FOR LP CHECKS                                            00124000
001800     05  BR003-ADDL-DATA-1      PIC  X(15).                       00125000
001100* NAME ON THE CHECK                                               00126000
001800     05  BR003-NAME             PIC  X(50).                       00127000
001800     05  BR003-NAME-2           PIC  X(50).                       00128000
001100* ZERO FILL FOR LP CHECKS                                         00129000
001800     05  BR003-BANK-NUMBER      PIC  9(06).                       00130000
