*********************************************************************** 00010030
*                                                                       00020030
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00030030
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00040030
*********************************************************************** 00050030
        PRINT  NOGEN                                                    00060030
CEKM615 DFHMSD TYPE=DSECT,                                             X00070030
               LANG=COBOL,                                             X00080030
               MODE=INOUT,                                             X00090030
               STORAGE=AUTO,                                           X00100030
               TERM=3270-2,                                            X00110030
               TIOAPFX=YES                                              00120030
*****************************************************************       00130030
CE615A  DFHMDI LINE=2,COLUMN=1,                                        X00140030
               SIZE=(19,80),                                           X00150030
               CTRL=(FREEKB),                                          X00160030
               MAPATTS=(COLOR,HILIGHT),                                X00170030
               DSATTS=(COLOR,HILIGHT)                                   00180030
*****************************************************************       00190030
        DFHMDF POS=(02,01),                                            X00200030
               LENGTH=13,                                              X00210030
               ATTRB=(ASKIP,NORM),                                     X00220030
               COLOR=NEUTRAL,                                          X00230030
               INITIAL='CS LOCATION.:'                                  00240030
ALOCID  DFHMDF POS=(02,20),                                            X00250030
               LENGTH=04,                                              X00260030
               ATTRB=(ASKIP,NORM),                                     X00270030
               COLOR=BLUE                                               00280030
        DFHMDF POS=(02,28),                                            X00290030
               LENGTH=11,                                              X00300030
               ATTRB=(ASKIP,NORM),                                     X00310030
               COLOR=NEUTRAL,                                          X00320030
               INITIAL='SKU NUMBER:'                                    00330030
ASKU    DFHMDF POS=(02,40),                                            X00340030
               LENGTH=08,                                              X00350030
               ATTRB=(ASKIP,NORM),                                     X00360030
               COLOR=BLUE                                               00370030
        DFHMDF POS=(02,53),                                            X00380030
               LENGTH=15,                                              X00390030
               ATTRB=(ASKIP,NORM),                                     X00400030
               COLOR=NEUTRAL,                                          X00410030
               INITIAL='MANIFEST UNITS:'                                00420030
AMFUNT  DFHMDF POS=(02,72),                                            X00430030
               LENGTH=07,                                              X00440030
               ATTRB=(ASKIP,NORM),                                     X00450030
               PICOUT='Z(6)9',                                         X00460030
               COLOR=BLUE                                               00470030
*****************************************************************       00480030
        DFHMDF POS=(03,01),                                            X00490030
               LENGTH=14,                                              X00500030
               ATTRB=(ASKIP,NORM),                                     X00510030
               COLOR=NEUTRAL,                                          X00520030
               INITIAL='STORE NUMBER:'                                  00530030
ASTRNO  DFHMDF POS=(03,20),                                            X00540030
               LENGTH=04,                                              X00550030
               ATTRB=(ASKIP,NORM),                                     X00560030
               COLOR=BLUE                                               00570030
        DFHMDF POS=(03,28),                                            X00580030
               LENGTH=11,                                              X00590030
               ATTRB=(ASKIP,NORM),                                     X00600030
               COLOR=NEUTRAL,                                          X00610030
               INITIAL='SKU RETAIL:'                                    00620030
ASKRET  DFHMDF POS=(03,40),                                            X00630030
               LENGTH=08,                                              X00640030
               ATTRB=(ASKIP,NORM),                                     X00650030
               PICOUT='Z,ZZZ.99',                                      X00660030
               COLOR=BLUE                                               00670030
        DFHMDF POS=(03,53),                                            X00680030
               LENGTH=15,                                              X00690030
               ATTRB=(ASKIP,NORM),                                     X00700030
               COLOR=NEUTRAL,                                          X00710030
               INITIAL='ADJUSTED UNITS:'                                00720030
AADJUNT DFHMDF POS=(03,72),                                            X00730030
               LENGTH=08,                                              X00740032
               ATTRB=(ASKIP,NORM),                                     X00750030
               PICOUT='Z(6)9-',                                        X00760032
               COLOR=BLUE                                               00770030
*****************************************************************       00780030
        DFHMDF POS=(04,01),                                            X00790030
               LENGTH=13,                                              X00800030
               ATTRB=(ASKIP,NORM),                                     X00810030
               COLOR=NEUTRAL,                                          X00820030
               INITIAL='PULL NUMBER.:'                                  00830030
APULNO  DFHMDF POS=(04,15),                                            X00840030
               LENGTH=09,                                              X00850030
               ATTRB=(ASKIP,NORM),                                     X00860030
               PICOUT='Z(8)9',                                         X00870030
               COLOR=BLUE                                               00880030
        DFHMDF POS=(04,53),                                            X00890030
               LENGTH=15,                                              X00900030
               ATTRB=(ASKIP,NORM),                                     X00910030
               COLOR=NEUTRAL,                                          X00920030
               INITIAL='DISTRB UNITS..:'                                00930030
ADSUNT  DFHMDF POS=(04,72),                                            X00940030
               LENGTH=07,                                              X00950030
               ATTRB=(ASKIP,NORM),                                     X00960030
               PICOUT='Z(6)9',                                         X00970030
               COLOR=BLUE                                               00980030
*****************************************************************       00990030
        DFHMDF POS=(05,01),                                            X01000030
               LENGTH=13,                                              X01010030
               ATTRB=(ASKIP,NORM),                                     X01020030
               COLOR=NEUTRAL,                                          X01030030
               INITIAL='LINE NUMBER.:'                                  01040030
ALNENO  DFHMDF POS=(05,20),                                            X01050030
               LENGTH=04,                                              X01060030
               ATTRB=(ASKIP,NORM),                                     X01070030
               PICOUT='Z(3)9',                                         X01080030
               COLOR=BLUE                                               01090030
        DFHMDF POS=(05,53),                                            X01100030
               LENGTH=15,                                              X01110030
               ATTRB=(ASKIP,NORM),                                     X01120030
               COLOR=NEUTRAL,                                          X01130030
               INITIAL='DISTRB RETAIL.:'                                01140030
ADSRTL  DFHMDF POS=(05,69),                                            X01150030
               LENGTH=10,                                              X01160030
               ATTRB=(ASKIP,NORM),                                     X01170030
               PICOUT='ZZZ,ZZZ.99',                                    X01180030
               COLOR=BLUE                                               01190030
******************************************************************      01200030
        DFHMDF POS=(07,01),                                            X01210030
               LENGTH=16,                                              X01220030
               ATTRB=(ASKIP,NORM),                                     X01230030
               COLOR=NEUTRAL,                                          X01240030
               INITIAL='ADJ UNITS......:'                               01250030
AADJ    DFHMDF POS=(07,18),                                            X01260030
               LENGTH=06,                                              X01270032
               ATTRB=(ASKIP,NORM),                                     X01280030
               PICOUT='ZZZZ9-',                                        X01290032
               COLOR=BLUE                                               01300030
******************************************************************      01310030
        DFHMDF POS=(08,01),                                            X01320030
               LENGTH=16,                                              X01330030
               ATTRB=(ASKIP,NORM),                                     X01340030
               COLOR=NEUTRAL,                                          X01350030
               INITIAL='BEFORE UNITS...:'                               01360030
AADJB   DFHMDF POS=(08,18),                                            X01370030
               LENGTH=05,                                              X01380030
               ATTRB=(ASKIP,NORM),                                     X01390030
               PICOUT='ZZZZ9',                                         X01400030
               COLOR=BLUE                                               01410030
******************************************************************      01420030
        DFHMDF POS=(09,01),                                            X01430030
               LENGTH=16,                                              X01440030
               ATTRB=(ASKIP,NORM),                                     X01450030
               COLOR=NEUTRAL,                                          X01460030
               INITIAL='AFTER UNITS....:'                               01470030
AADJA   DFHMDF POS=(09,18),                                            X01480030
               LENGTH=05,                                              X01490030
               ATTRB=(ASKIP,NORM),                                     X01500030
               PICOUT='ZZZZ9',                                         X01510030
               COLOR=BLUE                                               01520030
******************************************************************      01530030
        DFHMDF POS=(10,01),                                            X01540030
               LENGTH=16,                                              X01550030
               ATTRB=(ASKIP,NORM),                                     X01560030
               COLOR=NEUTRAL,                                          X01570030
               INITIAL='EXTRACT BATCH #:'                               01580030
ABTCH   DFHMDF POS=(10,20),                                            X01590030
               LENGTH=03,                                              X01600030
               ATTRB=(ASKIP,NORM),                                     X01610030
               COLOR=BLUE                                               01620030
******************************************************************      01630030
        DFHMDF POS=(11,01),                                            X01640031
               LENGTH=16,                                              X01650031
               ATTRB=(ASKIP,NORM),                                     X01660031
               COLOR=NEUTRAL,                                          X01670031
               INITIAL='ADJ DATE/TIME..:'                               01680031
ADATE   DFHMDF POS=(11,18),                                            X01690031
               LENGTH=16,                                              X01700031
               ATTRB=(ASKIP,NORM),                                     X01710031
               COLOR=BLUE                                               01720031
******************************************************************      01730031
        DFHMDF POS=(12,01),                                            X01740031
               LENGTH=16,                                              X01750030
               ATTRB=(ASKIP,NORM),                                     X01760030
               COLOR=NEUTRAL,                                          X01770030
               INITIAL='ADJUSTED BY....:'                               01780030
AADJTK  DFHMDF POS=(12,18),                                            X01790031
               LENGTH=08,                                              X01800030
               ATTRB=(ASKIP,NORM),                                     X01810030
               COLOR=BLUE                                               01820030
AADJNM  DFHMDF POS=(12,28),                                            X01830031
               LENGTH=40,                                              X01840030
               ATTRB=(ASKIP,NORM),                                     X01850030
               COLOR=NEUTRAL                                            01860030
******************************************************************      01870030
        DFHMDF POS=(13,01),                                            X01880031
               LENGTH=16,                                              X01890030
               ATTRB=(ASKIP,NORM),                                     X01900030
               COLOR=NEUTRAL,                                          X01910030
               INITIAL='REASON.........:'                               01920030
ARSN01  DFHMDF POS=(13,18),                                            X01930031
               LENGTH=50,                                              X01940030
               ATTRB=(ASKIP,NORM),                                     X01950030
               COLOR=BLUE                                               01960030
ARSN02  DFHMDF POS=(14,18),                                            X01970031
               LENGTH=50,                                              X01980030
               ATTRB=(ASKIP,NORM),                                     X01990030
               COLOR=BLUE                                               02000030
ARSN03  DFHMDF POS=(15,18),                                            X02010031
               LENGTH=50,                                              X02020030
               ATTRB=(ASKIP,NORM),                                     X02030030
               COLOR=BLUE                                               02040030
ARSN04  DFHMDF POS=(16,18),                                            X02050031
               LENGTH=50,                                              X02060030
               ATTRB=(ASKIP,NORM),                                     X02070030
               COLOR=BLUE                                               02080030
ARSN05  DFHMDF POS=(17,18),                                            X02090031
               LENGTH=50,                                              X02100030
               ATTRB=(ASKIP,NORM),                                     X02110030
               COLOR=BLUE                                               02120030
*                                                                       02130030
        DFHMSD TYPE=FINAL                                               02140030
        END                                                             02150030
