*********************************************************************** 00010000
*                                                                       00020000
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00030000
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00040000
*********************************************************************** 00050000
        PRINT  NOGEN                                                    00060000
CEKM603 DFHMSD TYPE=DSECT,                                             X00070000
               LANG=COBOL,                                             X00080000
               MODE=INOUT,                                             X00090000
               STORAGE=AUTO,                                           X00100000
               TERM=3270-2,                                            X00110000
               TIOAPFX=YES                                              00120000
*****************************************************************       00130000
CE603A  DFHMDI LINE=2,COLUMN=1,                                        X00140000
               SIZE=(19,80),                                           X00150000
               CTRL=(FREEKB),                                          X00160000
               MAPATTS=(COLOR,HILIGHT),                                X00170000
               DSATTS=(COLOR,HILIGHT)                                   00180000
*****************************************************************       00190000
        DFHMDF POS=(02,01),                                            X00200000
               LENGTH=12,                                              X00210000
               ATTRB=(ASKIP,NORM),                                     X00220000
               COLOR=NEUTRAL,                                          X00230000
               INITIAL='CS LOCATION:'                                   00240000
ALOCID  DFHMDF POS=(02,20),                                            X00250000
               LENGTH=04,                                              X00260000
               ATTRB=(ASKIP,NORM),                                     X00270000
               COLOR=BLUE                                               00280000
        DFHMDF POS=(02,54),                                            X00290000
               LENGTH=14,                                              X00300000
               ATTRB=(ASKIP,NORM),                                     X00310000
               COLOR=NEUTRAL,                                          X00320000
               INITIAL='REQ PL UNITS.:'                                 00330000
ARQUNT  DFHMDF POS=(02,72),                                            X00340000
               LENGTH=07,                                              X00350000
               ATTRB=(ASKIP,NORM),                                     X00360000
               PICOUT='Z(6)9',                                         X00370000
               COLOR=BLUE                                               00380000
*****************************************************************       00390000
        DFHMDF POS=(03,01),                                            X00400000
               LENGTH=12,                                              X00410000
               ATTRB=(ASKIP,NORM),                                     X00420000
               COLOR=NEUTRAL,                                          X00430000
               INITIAL='PULL NUMBER:'                                   00440000
APULNO  DFHMDF POS=(03,15),                                            X00450000
               LENGTH=09,                                              X00460000
               ATTRB=(ASKIP,NORM),                                     X00470000
               PICOUT='Z(8)9',                                         X00480000
               COLOR=BLUE                                               00490000
        DFHMDF POS=(03,31),                                            X00500000
               LENGTH=12,                                              X00510000
               ATTRB=(ASKIP,NORM),                                     X00520000
               COLOR=NEUTRAL,                                          X00530000
               INITIAL='LINE NUMBER:'                                   00540000
ALNENO  DFHMDF POS=(03,48),                                            X00550000
               LENGTH=04,                                              X00560000
               ATTRB=(ASKIP,NORM),                                     X00570000
               PICOUT='ZZZ9',                                          X00580000
               COLOR=BLUE                                               00590000
        DFHMDF POS=(03,54),                                            X00600000
               LENGTH=14,                                              X00610000
               ATTRB=(ASKIP,NORM),                                     X00620000
               COLOR=NEUTRAL,                                          X00630000
               INITIAL='MANIFEST UNTS:'                                 00640000
AMFUNT  DFHMDF POS=(03,72),                                            X00650000
               LENGTH=07,                                              X00660000
               ATTRB=(ASKIP,NORM),                                     X00670000
               PICOUT='Z(6)9',                                         X00680000
               COLOR=BLUE                                               00690000
*****************************************************************       00700000
        DFHMDF POS=(04,01),                                            X00710000
               LENGTH=12,                                              X00720000
               ATTRB=(ASKIP,NORM),                                     X00730000
               COLOR=NEUTRAL,                                          X00740000
               INITIAL='PULL STATUS:'                                   00750000
APULST  DFHMDF POS=(04,16),                                            X00760000
               LENGTH=08,                                              X00770000
               ATTRB=(ASKIP,NORM),                                     X00780000
               COLOR=BLUE                                               00790000
        DFHMDF POS=(04,31),                                            X00800000
               LENGTH=12,                                              X00810000
               ATTRB=(ASKIP,NORM),                                     X00820000
               COLOR=NEUTRAL,                                          X00830000
               INITIAL='LINE STATUS:'                                   00840000
ALNEST  DFHMDF POS=(04,44),                                            X00850000
               LENGTH=08,                                              X00860000
               ATTRB=(ASKIP,NORM),                                     X00870000
               COLOR=BLUE                                               00880000
        DFHMDF POS=(04,54),                                            X00890000
               LENGTH=14,                                              X00900000
               ATTRB=(ASKIP,NORM),                                     X00910000
               COLOR=NEUTRAL,                                          X00920000
               INITIAL='ADJ UNITS....:'                                 00930000
AADJUNT DFHMDF POS=(04,74),                                            X00940000
               LENGTH=06,                                              X00950000
               ATTRB=(ASKIP,NORM),                                     X00960000
               COLOR=BLUE                                               00980000
*****************************************************************       00990000
        DFHMDF POS=(05,01),                                            X01000000
               LENGTH=12,                                              X01010000
               ATTRB=(ASKIP,NORM),                                     X01020000
               COLOR=NEUTRAL,                                          X01030000
               INITIAL='REF NUMBER.:'                                   01040000
AREFNO  DFHMDF POS=(05,14),                                            X01050000
               LENGTH=15,                                              X01060000
               ATTRB=(ASKIP,NORM),                                     X01070000
               COLOR=BLUE                                               01080000
        DFHMDF POS=(05,31),                                            X01090000
               LENGTH=12,                                              X01100000
               ATTRB=(ASKIP,NORM),                                     X01110000
               COLOR=NEUTRAL,                                          X01120000
               INITIAL='SKU NUMBER.:'                                   01130000
ASKU    DFHMDF POS=(05,44),                                            X01140000
               LENGTH=08,                                              X01150000
               ATTRB=(ASKIP,NORM),                                     X01160000
               COLOR=BLUE                                               01170000
        DFHMDF POS=(05,54),                                            X01180000
               LENGTH=14,                                              X01190000
               ATTRB=(ASKIP,NORM),                                     X01200000
               COLOR=NEUTRAL,                                          X01210000
               INITIAL='DISTRB UNITS.:'                                 01220000
ADSUNT  DFHMDF POS=(05,72),                                            X01230000
               LENGTH=08,                                              X01240000
               ATTRB=(ASKIP,NORM),                                     X01250000
               PICOUT='Z(6)9-',                                        X01260000
               COLOR=BLUE                                               01270000
**************************************************************          01280000
        DFHMDF POS=(06,31),                                            X01290000
               LENGTH=12,                                              X01300000
               ATTRB=(ASKIP,NORM),                                     X01310000
               COLOR=NEUTRAL,                                          X01320000
               INITIAL='SKU RETAIL.:'                                   01330000
ASKRET  DFHMDF POS=(06,44),                                            X01340000
               LENGTH=08,                                              X01350000
               ATTRB=(ASKIP,NORM),                                     X01360000
               PICOUT='Z,ZZZ.99',                                      X01370000
               COLOR=BLUE                                               01380000
        DFHMDF POS=(06,54),                                            X01390000
               LENGTH=14,                                              X01400000
               ATTRB=(ASKIP,NORM),                                     X01410000
               COLOR=NEUTRAL,                                          X01420000
               INITIAL='DISTRB RETAIL:'                                 01430000
ADSRTL  DFHMDF POS=(06,69),                                            X01440000
               LENGTH=10,                                              X01450000
               ATTRB=(ASKIP,NORM),                                     X01460000
               PICOUT='ZZZ,ZZZ.99',                                    X01470000
               COLOR=BLUE                                               01480000
******************************************************************      01481000
        DFHMDF POS=(07,54),                                            X01482000
               LENGTH=14,                                              X01483000
               ATTRB=(ASKIP,NORM),                                     X01484000
               COLOR=NEUTRAL,                                          X01485000
               INITIAL='POSTED UNITS.:'                                 01486000
APOSTD  DFHMDF POS=(07,72),                                            X01487000
               LENGTH=08,                                              X01488000
               ATTRB=(ASKIP,NORM),                                     X01489000
               PICOUT='Z(6)9-',                                        X01490000
               COLOR=BLUE                                               01500000
******************************************************************      01510000
        DFHMDF POS=(08,14),                                            X01520000
               LENGTH=03,                                              X01530000
               ATTRB=(ASKIP,NORM),                                     X01540000
               COLOR=NEUTRAL,                                          X01550000
               INITIAL='UPD'                                            01560000
        DFHMDF POS=(08,36),                                            X01570000
               LENGTH=05,                                              X01580000
               ATTRB=(ASKIP,NORM),                                     X01590000
               COLOR=NEUTRAL,                                          X01600000
               INITIAL='TOTAL'                                          01610000
        DFHMDF POS=(08,45),                                            X01620000
               LENGTH=05,                                              X01630000
               ATTRB=(ASKIP,NORM),                                     X01640000
               COLOR=NEUTRAL,INITIAL='ITEMS'                            01650000
ASTRTIT DFHMDF POS=(08,51),                                            X01660000
               LENGTH=05,                                              X01670000
               ATTRB=(NUM,UNPROT,NORM),                                X01680000
               COLOR=GREEN,                                            X01690000
               PICOUT='ZZZZ9',                                         X01700000
               HILIGHT=UNDERLINE                                        01710000
        DFHMDF POS=(08,57),                                            X01720000
               LENGTH=02,                                              X01730000
               ATTRB=(ASKIP,NORM),                                     X01740000
               COLOR=NEUTRAL,                                          X01750000
               INITIAL='TO'                                             01760000
AENDIT  DFHMDF POS=(08,60),                                            X01770000
               LENGTH=05,                                              X01780000
               ATTRB=(ASKIP,NORM),                                     X01790000
               COLOR=BLUE,                                             X01800000
               PICOUT='ZZZZ9'                                           01810000
        DFHMDF POS=(08,66),                                            X01820000
               LENGTH=02,                                              X01830000
               ATTRB=(ASKIP,NORM),                                     X01840000
               COLOR=NEUTRAL,                                          X01850000
               INITIAL='OF'                                             01860000
ATOTIT  DFHMDF POS=(08,69),                                            X01870000
               LENGTH=05,                                              X01880000
               ATTRB=(ASKIP,NORM),                                     X01890000
               COLOR=BLUE,                                             X01900000
               PICOUT='ZZZZ9'                                           01910000
******************************************************************      01920000
        DFHMDF POS=(09,12),                                            X01930000
               LENGTH=06,                                              X01940000
               ATTRB=(ASKIP,NORM),                                     X01950000
               COLOR=NEUTRAL,                                          X01960000
               INITIAL='DISTRB'                                         01970000
        DFHMDF POS=(09,21),                                            X01980000
               LENGTH=05,                                              X01990000
               ATTRB=(ASKIP,NORM),                                     X02000000
               COLOR=NEUTRAL,                                          X02010000
               INITIAL='STORE'                                          02020000
        DFHMDF POS=(09,29),                                            X02030000
               LENGTH=03,                                              X02040000
               ATTRB=(ASKIP,NORM),                                     X02050000
               COLOR=NEUTRAL,                                          X02060000
               INITIAL='REQ'                                            02070000
        DFHMDF POS=(09,35),                                            X02080000
               LENGTH=06,                                              X02090000
               ATTRB=(ASKIP,NORM),                                     X02100000
               COLOR=NEUTRAL,                                          X02110000
               INITIAL='DISTRB'                                         02120000
        DFHMDF POS=(09,43),                                            X02130000
               LENGTH=08,                                              X02140000
               ATTRB=(ASKIP,NORM),                                     X02150000
               COLOR=NEUTRAL,                                          X02160000
               INITIAL='MANIFEST'                                       02170000
        DFHMDF POS=(09,53),                                            X02180000
               LENGTH=03,                                              X02190000
               ATTRB=(ASKIP,NORM),                                     X02200000
               COLOR=NEUTRAL,                                          X02210000
               INITIAL='ADJ'                                            02220000
        DFHMDF POS=(09,59),                                            X02230000
               LENGTH=06,                                              X02240000
               ATTRB=(ASKIP,NORM),                                     X02250000
               COLOR=NEUTRAL,                                          X02260000
               INITIAL='POSTED'                                         02270000
******************************************************************      02280000
        DFHMDF POS=(10,01),                                            X02290000
               LENGTH=03,                                              X02300000
               ATTRB=(ASKIP,NORM),                                     X02310000
               COLOR=NEUTRAL,                                          X02320000
               INITIAL='SEL'                                            02330000
        DFHMDF POS=(10,07),                                            X02340000
               LENGTH=03,                                              X02350000
               ATTRB=(ASKIP,NORM),                                     X02360000
               COLOR=NEUTRAL,                                          X02370000
               INITIAL='ACT'                                            02380000
        DFHMDF POS=(10,13),                                            X02390000
               LENGTH=05,                                              X02400000
               ATTRB=(ASKIP,NORM),                                     X02410000
               COLOR=NEUTRAL,                                          X02420000
               INITIAL='UNITS'                                          02430000
        DFHMDF POS=(10,22),                                            X02440000
               LENGTH=03,                                              X02450000
               ATTRB=(ASKIP,NORM),                                     X02460000
               COLOR=NEUTRAL,                                          X02470000
               INITIAL='NBR'                                            02480000
        DFHMDF POS=(10,28),                                            X02490000
               LENGTH=05,                                              X02500000
               ATTRB=(ASKIP,NORM),                                     X02510000
               COLOR=NEUTRAL,                                          X02520000
               INITIAL='UNITS'                                          02530000
        DFHMDF POS=(10,36),                                            X02540000
               LENGTH=05,                                              X02550000
               ATTRB=(ASKIP,NORM),                                     X02560000
               COLOR=NEUTRAL,                                          X02570000
               INITIAL='UNITS'                                          02580000
        DFHMDF POS=(10,44),                                            X02590000
               LENGTH=05,                                              X02600000
               ATTRB=(ASKIP,NORM),                                     X02610000
               COLOR=NEUTRAL,                                          X02620000
               INITIAL='UNITS'                                          02630000
        DFHMDF POS=(10,52),                                            X02640000
               LENGTH=05,                                              X02650000
               ATTRB=(ASKIP,NORM),                                     X02660000
               COLOR=NEUTRAL,                                          X02670000
               INITIAL='UNITS'                                          02680000
        DFHMDF POS=(10,59),                                            X02690000
               LENGTH=05,                                              X02700000
               ATTRB=(ASKIP,NORM),                                     X02710000
               COLOR=NEUTRAL,                                          X02720000
               INITIAL='UNITS'                                          02721000
******************************************************************      02722000
ASEL01  DFHMDF POS=(11,02),                                            X02723000
               LENGTH=01,                                              X02724000
               ATTRB=(UNPROT,NORM),                                    X02725000
               HILIGHT=UNDERLINE,                                      X02726000
               COLOR=GREEN                                              02727000
        DFHMDF POS=(11,04),                                            X02728000
               LENGTH=01,                                              X02729000
               ATTRB=(ASKIP)                                            02730000
AACT01  DFHMDF POS=(11,07),                                            X02740000
               LENGTH=03,                                              X02750000
               ATTRB=(ASKIP,NORM),                                     X02760000
               COLOR=BLUE                                               02770000
AUPUT01 DFHMDF POS=(11,13),                                            X02780000
               LENGTH=05,                                              X02790000
               ATTRB=(UNPROT,NORM),                                    X02800000
               PICOUT='ZZZZZ',                                         X02810000
               HILIGHT=UNDERLINE,                                      X02820000
               COLOR=GREEN                                              02830000
        DFHMDF POS=(11,19),                                            X02840000
               LENGTH=01,                                              X02850000
               ATTRB=(ASKIP)                                            02860000
ASTR01  DFHMDF POS=(11,21),                                            X02870000
               LENGTH=04,                                              X02880000
               ATTRB=(ASKIP,NORM),                                     X02890000
               PICOUT='ZZZZ',                                          X02900000
               COLOR=BLUE                                               02910000
ARUNT01 DFHMDF POS=(11,28),                                            X02920000
               LENGTH=05,                                              X02930000
               ATTRB=(ASKIP,NORM),                                     X02940000
               PICOUT='ZZZZZ',                                         X02950000
               COLOR=BLUE                                               02960000
ADUNT01 DFHMDF POS=(11,36),                                            X02970000
               LENGTH=06,                                              X02980000
               ATTRB=(ASKIP,NORM),                                     X02990000
               COLOR=BLUE                                               03000000
AMUNT01 DFHMDF POS=(11,44),                                            X03010000
               LENGTH=05,                                              X03020000
               ATTRB=(ASKIP,NORM),                                     X03030000
               COLOR=BLUE                                               03040000
AAUNT01 DFHMDF POS=(11,52),                                            X03050000
               LENGTH=06,                                              X03060000
               ATTRB=(ASKIP,NORM),                                     X03070000
               COLOR=BLUE                                               03080000
AAPST01 DFHMDF POS=(11,59),                                            X03090000
               LENGTH=06,                                              X03100000
               ATTRB=(ASKIP,NORM),                                     X03110000
               COLOR=BLUE                                               03120000
******************************************************************      03130000
ASEL02  DFHMDF POS=(12,02),                                            X03140000
               LENGTH=01,                                              X03150000
               ATTRB=(UNPROT,NORM),                                    X03160000
               HILIGHT=UNDERLINE,                                      X03170000
               COLOR=GREEN                                              03180000
        DFHMDF POS=(12,04),                                            X03190000
               LENGTH=01,                                              X03200000
               ATTRB=(ASKIP)                                            03210000
AACT02  DFHMDF POS=(12,07),                                            X03220000
               LENGTH=03,                                              X03230000
               ATTRB=(ASKIP,NORM),                                     X03240000
               COLOR=BLUE                                               03250000
AUPUT02 DFHMDF POS=(12,13),                                            X03260000
               LENGTH=05,                                              X03270000
               ATTRB=(UNPROT,NORM),                                    X03280000
               PICOUT='ZZZZZ',                                         X03290000
               HILIGHT=UNDERLINE,                                      X03300000
               COLOR=GREEN                                              03310000
        DFHMDF POS=(12,19),                                            X03320000
               LENGTH=01,                                              X03330000
               ATTRB=(ASKIP)                                            03340000
ASTR02  DFHMDF POS=(12,21),                                            X03350000
               LENGTH=04,                                              X03360000
               ATTRB=(ASKIP,NORM),                                     X03370000
               PICOUT='ZZZZ',                                          X03380000
               COLOR=BLUE                                               03390000
ARUNT02 DFHMDF POS=(12,28),                                            X03400000
               LENGTH=05,                                              X03410000
               ATTRB=(ASKIP,NORM),                                     X03420000
               PICOUT='ZZZZZ',                                         X03430000
               COLOR=BLUE                                               03440000
ADUNT02 DFHMDF POS=(12,36),                                            X03450000
               LENGTH=06,                                              X03460000
               ATTRB=(ASKIP,NORM),                                     X03470000
               COLOR=BLUE                                               03480000
AMUNT02 DFHMDF POS=(12,44),                                            X03490000
               LENGTH=05,                                              X03500000
               ATTRB=(ASKIP,NORM),                                     X03510000
               COLOR=BLUE                                               03520000
AAUNT02 DFHMDF POS=(12,52),                                            X03530000
               LENGTH=06,                                              X03540000
               ATTRB=(ASKIP,NORM),                                     X03550000
               COLOR=BLUE                                               03560000
AAPST02 DFHMDF POS=(12,59),                                            X03570000
               LENGTH=06,                                              X03580000
               ATTRB=(ASKIP,NORM),                                     X03590000
               COLOR=BLUE                                               03600000
******************************************************************      03610000
ASEL03  DFHMDF POS=(13,02),                                            X03620000
               LENGTH=01,                                              X03630000
               ATTRB=(UNPROT,NORM),                                    X03640000
               HILIGHT=UNDERLINE,                                      X03650000
               COLOR=GREEN                                              03660000
        DFHMDF POS=(13,04),                                            X03670000
               LENGTH=01,                                              X03680000
               ATTRB=(ASKIP)                                            03690000
AACT03  DFHMDF POS=(13,07),                                            X03700000
               LENGTH=03,                                              X03710000
               ATTRB=(ASKIP,NORM),                                     X03720000
               COLOR=BLUE                                               03730000
AUPUT03 DFHMDF POS=(13,13),                                            X03740000
               LENGTH=05,                                              X03750000
               ATTRB=(UNPROT,NORM),                                    X03760000
               PICOUT='ZZZZZ',                                         X03770000
               HILIGHT=UNDERLINE,                                      X03780000
               COLOR=GREEN                                              03790000
        DFHMDF POS=(13,19),                                            X03800000
               LENGTH=01,                                              X03810000
               ATTRB=(ASKIP)                                            03820000
ASTR03  DFHMDF POS=(13,21),                                            X03830000
               LENGTH=04,                                              X03840000
               ATTRB=(ASKIP,NORM),                                     X03850000
               PICOUT='ZZZZ',                                          X03860000
               COLOR=BLUE                                               03870000
ARUNT03 DFHMDF POS=(13,28),                                            X03880000
               LENGTH=05,                                              X03890000
               ATTRB=(ASKIP,NORM),                                     X03900000
               PICOUT='ZZZZZ',                                         X03910000
               COLOR=BLUE                                               03920000
ADUNT03 DFHMDF POS=(13,36),                                            X03930000
               LENGTH=06,                                              X03940000
               ATTRB=(ASKIP,NORM),                                     X03950000
               COLOR=BLUE                                               03960000
AMUNT03 DFHMDF POS=(13,44),                                            X03970000
               LENGTH=05,                                              X03980000
               ATTRB=(ASKIP,NORM),                                     X03990000
               COLOR=BLUE                                               04000000
AAUNT03 DFHMDF POS=(13,52),                                            X04010000
               LENGTH=06,                                              X04020000
               ATTRB=(ASKIP,NORM),                                     X04030000
               COLOR=BLUE                                               04040000
AAPST03 DFHMDF POS=(13,59),                                            X04041000
               LENGTH=06,                                              X04042000
               ATTRB=(ASKIP,NORM),                                     X04043000
               COLOR=BLUE                                               04044000
******************************************************************      04045000
ASEL04  DFHMDF POS=(14,02),                                            X04046000
               LENGTH=01,                                              X04047000
               ATTRB=(UNPROT,NORM),                                    X04048000
               HILIGHT=UNDERLINE,                                      X04049000
               COLOR=GREEN                                              04050000
        DFHMDF POS=(14,04),                                            X04060000
               LENGTH=01,                                              X04070000
               ATTRB=(ASKIP)                                            04080000
AACT04  DFHMDF POS=(14,07),                                            X04090000
               LENGTH=03,                                              X04100000
               ATTRB=(ASKIP,NORM),                                     X04110000
               COLOR=BLUE                                               04120000
AUPUT04 DFHMDF POS=(14,13),                                            X04130000
               LENGTH=05,                                              X04140000
               ATTRB=(UNPROT,NORM),                                    X04150000
               PICOUT='ZZZZZ',                                         X04160000
               HILIGHT=UNDERLINE,                                      X04170000
               COLOR=GREEN                                              04180000
        DFHMDF POS=(14,19),                                            X04190000
               LENGTH=01,                                              X04200000
               ATTRB=(ASKIP)                                            04210000
ASTR04  DFHMDF POS=(14,21),                                            X04220000
               LENGTH=04,                                              X04230000
               ATTRB=(ASKIP,NORM),                                     X04240000
               PICOUT='ZZZZ',                                          X04250000
               COLOR=BLUE                                               04260000
ARUNT04 DFHMDF POS=(14,28),                                            X04270000
               LENGTH=05,                                              X04280000
               ATTRB=(ASKIP,NORM),                                     X04290000
               PICOUT='ZZZZZ',                                         X04300000
               COLOR=BLUE                                               04310000
ADUNT04 DFHMDF POS=(14,36),                                            X04320000
               LENGTH=06,                                              X04330000
               ATTRB=(ASKIP,NORM),                                     X04340000
               COLOR=BLUE                                               04350000
AMUNT04 DFHMDF POS=(14,44),                                            X04360000
               LENGTH=05,                                              X04370000
               ATTRB=(ASKIP,NORM),                                     X04380000
               COLOR=BLUE                                               04390000
AAUNT04 DFHMDF POS=(14,52),                                            X04400000
               LENGTH=06,                                              X04410000
               ATTRB=(ASKIP,NORM),                                     X04420000
               COLOR=BLUE                                               04430000
AAPST04 DFHMDF POS=(14,59),                                            X04440000
               LENGTH=06,                                              X04450000
               ATTRB=(ASKIP,NORM),                                     X04460000
               COLOR=BLUE                                               04470000
******************************************************************      04480000
ASEL05  DFHMDF POS=(15,02),                                            X04490000
               LENGTH=01,                                              X04500000
               ATTRB=(UNPROT,NORM),                                    X04510000
               HILIGHT=UNDERLINE,                                      X04520000
               COLOR=GREEN                                              04530000
        DFHMDF POS=(15,04),                                            X04540000
               LENGTH=01,                                              X04550000
               ATTRB=(ASKIP)                                            04560000
AACT05  DFHMDF POS=(15,07),                                            X04570000
               LENGTH=03,                                              X04580000
               ATTRB=(ASKIP,NORM),                                     X04590000
               COLOR=BLUE                                               04600000
AUPUT05 DFHMDF POS=(15,13),                                            X04610000
               LENGTH=05,                                              X04620000
               ATTRB=(UNPROT,NORM),                                    X04630000
               PICOUT='ZZZZZ',                                         X04640000
               HILIGHT=UNDERLINE,                                      X04650000
               COLOR=GREEN                                              04660000
        DFHMDF POS=(15,19),                                            X04670000
               LENGTH=01,                                              X04680000
               ATTRB=(ASKIP)                                            04690000
ASTR05  DFHMDF POS=(15,21),                                            X04700000
               LENGTH=04,                                              X04710000
               ATTRB=(ASKIP,NORM),                                     X04720000
               PICOUT='ZZZZ',                                          X04730000
               COLOR=BLUE                                               04740000
ARUNT05 DFHMDF POS=(15,28),                                            X04750000
               LENGTH=05,                                              X04760000
               ATTRB=(ASKIP,NORM),                                     X04770000
               PICOUT='ZZZZZ',                                         X04780000
               COLOR=BLUE                                               04790000
ADUNT05 DFHMDF POS=(15,36),                                            X04800000
               LENGTH=06,                                              X04810000
               ATTRB=(ASKIP,NORM),                                     X04820000
               COLOR=BLUE                                               04830000
AMUNT05 DFHMDF POS=(15,44),                                            X04840000
               LENGTH=05,                                              X04850000
               ATTRB=(ASKIP,NORM),                                     X04860000
               COLOR=BLUE                                               04870000
AAUNT05 DFHMDF POS=(15,52),                                            X04880000
               LENGTH=06,                                              X04890000
               ATTRB=(ASKIP,NORM),                                     X04900000
               COLOR=BLUE                                               04910000
AAPST05 DFHMDF POS=(15,59),                                            X04920000
               LENGTH=06,                                              X04921000
               ATTRB=(ASKIP,NORM),                                     X04922000
               COLOR=BLUE                                               04923000
******************************************************************      04924000
ASEL06  DFHMDF POS=(16,02),                                            X04925000
               LENGTH=01,                                              X04926000
               ATTRB=(UNPROT,NORM),                                    X04927000
               HILIGHT=UNDERLINE,                                      X04928000
               COLOR=GREEN                                              04929000
        DFHMDF POS=(16,04),                                            X04930000
               LENGTH=01,                                              X04940000
               ATTRB=(ASKIP)                                            04950000
AACT06  DFHMDF POS=(16,07),                                            X04960000
               LENGTH=03,                                              X04970000
               ATTRB=(ASKIP,NORM),                                     X04980000
               COLOR=BLUE                                               04990000
AUPUT06 DFHMDF POS=(16,13),                                            X05000000
               LENGTH=05,                                              X05010000
               ATTRB=(UNPROT,NORM),                                    X05020000
               PICOUT='ZZZZZ',                                         X05030000
               HILIGHT=UNDERLINE,                                      X05040000
               COLOR=GREEN                                              05050000
        DFHMDF POS=(16,19),                                            X05060000
               LENGTH=01,                                              X05070000
               ATTRB=(ASKIP)                                            05080000
ASTR06  DFHMDF POS=(16,21),                                            X05090000
               LENGTH=04,                                              X05100000
               ATTRB=(ASKIP,NORM),                                     X05110000
               PICOUT='ZZZZ',                                          X05120000
               COLOR=BLUE                                               05130000
ARUNT06 DFHMDF POS=(16,28),                                            X05140000
               LENGTH=05,                                              X05150000
               ATTRB=(ASKIP,NORM),                                     X05160000
               PICOUT='ZZZZZ',                                         X05170000
               COLOR=BLUE                                               05180000
ADUNT06 DFHMDF POS=(16,36),                                            X05190000
               LENGTH=06,                                              X05200000
               ATTRB=(ASKIP,NORM),                                     X05210000
               COLOR=BLUE                                               05220000
AMUNT06 DFHMDF POS=(16,44),                                            X05230000
               LENGTH=05,                                              X05240000
               ATTRB=(ASKIP,NORM),                                     X05250000
               COLOR=BLUE                                               05260000
AAUNT06 DFHMDF POS=(16,52),                                            X05270000
               LENGTH=06,                                              X05280000
               ATTRB=(ASKIP,NORM),                                     X05290000
               COLOR=BLUE                                               05300000
AAPST06 DFHMDF POS=(16,59),                                            X05310000
               LENGTH=06,                                              X05320000
               ATTRB=(ASKIP,NORM),                                     X05330000
               COLOR=BLUE                                               05340000
******************************************************************      05350000
ASEL07  DFHMDF POS=(17,02),                                            X05360000
               LENGTH=01,                                              X05370000
               ATTRB=(UNPROT,NORM),                                    X05380000
               HILIGHT=UNDERLINE,                                      X05390000
               COLOR=GREEN                                              05400000
        DFHMDF POS=(17,04),                                            X05410000
               LENGTH=01,                                              X05420000
               ATTRB=(ASKIP)                                            05430000
AACT07  DFHMDF POS=(17,07),                                            X05440000
               LENGTH=03,                                              X05450000
               ATTRB=(ASKIP,NORM),                                     X05460000
               COLOR=BLUE                                               05470000
AUPUT07 DFHMDF POS=(17,13),                                            X05480000
               LENGTH=05,                                              X05490000
               ATTRB=(UNPROT,NORM),                                    X05500000
               PICOUT='ZZZZZ',                                         X05510000
               HILIGHT=UNDERLINE,                                      X05520000
               COLOR=GREEN                                              05530000
        DFHMDF POS=(17,19),                                            X05540000
               LENGTH=01,                                              X05550000
               ATTRB=(ASKIP)                                            05560000
ASTR07  DFHMDF POS=(17,21),                                            X05570000
               LENGTH=04,                                              X05580000
               ATTRB=(ASKIP,NORM),                                     X05590000
               PICOUT='ZZZZ',                                          X05600000
               COLOR=BLUE                                               05610000
ARUNT07 DFHMDF POS=(17,28),                                            X05620000
               LENGTH=05,                                              X05630000
               ATTRB=(ASKIP,NORM),                                     X05640000
               PICOUT='ZZZZZ',                                         X05650000
               COLOR=BLUE                                               05660000
ADUNT07 DFHMDF POS=(17,36),                                            X05670000
               LENGTH=06,                                              X05680000
               ATTRB=(ASKIP,NORM),                                     X05690000
               COLOR=BLUE                                               05700000
AMUNT07 DFHMDF POS=(17,44),                                            X05710000
               LENGTH=05,                                              X05720000
               ATTRB=(ASKIP,NORM),                                     X05730000
               COLOR=BLUE                                               05740000
AAUNT07 DFHMDF POS=(17,52),                                            X05750000
               LENGTH=06,                                              X05760000
               ATTRB=(ASKIP,NORM),                                     X05770000
               COLOR=BLUE                                               05780000
AAPST07 DFHMDF POS=(17,59),                                            X05790000
               LENGTH=06,                                              X05800000
               ATTRB=(ASKIP,NORM),                                     X05801000
               COLOR=BLUE                                               05802000
******************************************************************      05803000
ASEL08  DFHMDF POS=(18,02),                                            X05804000
               LENGTH=01,                                              X05805000
               ATTRB=(UNPROT,NORM),                                    X05806000
               HILIGHT=UNDERLINE,                                      X05807000
               COLOR=GREEN                                              05808000
        DFHMDF POS=(18,04),                                            X05809000
               LENGTH=01,                                              X05810000
               ATTRB=(ASKIP)                                            05820000
AACT08  DFHMDF POS=(18,07),                                            X05830000
               LENGTH=03,                                              X05840000
               ATTRB=(ASKIP,NORM),                                     X05850000
               COLOR=BLUE                                               05860000
AUPUT08 DFHMDF POS=(18,13),                                            X05870000
               LENGTH=05,                                              X05880000
               ATTRB=(UNPROT,NORM),                                    X05890000
               PICOUT='ZZZZZ',                                         X05900000
               HILIGHT=UNDERLINE,                                      X05910000
               COLOR=GREEN                                              05920000
        DFHMDF POS=(18,19),                                            X05930000
               LENGTH=01,                                              X05940000
               ATTRB=(ASKIP)                                            05950000
ASTR08  DFHMDF POS=(18,21),                                            X05960000
               LENGTH=04,                                              X05970000
               ATTRB=(ASKIP,NORM),                                     X05980000
               PICOUT='ZZZZ',                                          X05990000
               COLOR=BLUE                                               06000000
ARUNT08 DFHMDF POS=(18,28),                                            X06010000
               LENGTH=05,                                              X06020000
               ATTRB=(ASKIP,NORM),                                     X06030000
               PICOUT='ZZZZZ',                                         X06040000
               COLOR=BLUE                                               06050000
ADUNT08 DFHMDF POS=(18,36),                                            X06060000
               LENGTH=06,                                              X06070000
               ATTRB=(ASKIP,NORM),                                     X06080000
               COLOR=BLUE                                               06090000
AMUNT08 DFHMDF POS=(18,44),                                            X06100000
               LENGTH=05,                                              X06110000
               ATTRB=(ASKIP,NORM),                                     X06120000
               COLOR=BLUE                                               06130000
AAUNT08 DFHMDF POS=(18,52),                                            X06140000
               LENGTH=06,                                              X06150000
               ATTRB=(ASKIP,NORM),                                     X06160000
               COLOR=BLUE                                               06170000
AAPST08 DFHMDF POS=(18,59),                                            X06180000
               LENGTH=06,                                              X06190000
               ATTRB=(ASKIP,NORM),                                     X06200000
               COLOR=BLUE                                               06210000
******************************************************************      06220000
******************************************************************      06230000
        DFHMDF POS=(19,45),                                            X06240000
               LENGTH=25,                                              X06250000
               ATTRB=(ASKIP,NORM),                                     X06260000
               COLOR=NEUTRAL,                                          X06270000
               INITIAL='NUMBER OF SELECTED ITEMS:'                      06280000
ASELIT  DFHMDF POS=(19,72),                                            X06290000
               LENGTH=07,                                              X06300000
               ATTRB=(ASKIP,NORM),                                     X06310000
               COLOR=BLUE,                                             X06320000
               PICOUT='ZZZ,ZZ9'                                         06330000
        DFHMSD TYPE=FINAL                                               06340000
        END                                                             06350000
