***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT NOGEN                                                             
CEKM600 DFHMSD TYPE=MAP,                                               X        
               MODE=INOUT,                                             X        
               LANG=COBOL,                                             X        
               TIOAPFX=YES                                                      
CE600A  DFHMDI SIZE=(19,80),                                           X        
               CTRL=(FREEKB,FRSET),                                    X        
               LINE=2,                                                 X        
               COLUMN=1,                                               X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
***********************************************************************         
        DFHMDF POS=(03,02),                                            X        
               LENGTH=39,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='ENTER THE FOLLOWING TO CREATE A LIST OF'                
        DFHMDF POS=(03,42),                                            X        
               LENGTH=21,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CENTRAL STOCK PULLS:'                                   
***********************************************************************         
        DFHMDF POS=(05,06),                                            X        
               LENGTH=25,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CENTRAL STOCK LOCATION..:'                              
MLOCID  DFHMDF POS=(05,32),                                            X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,FSET)                                               
        DFHMDF POS=(05,37),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP)                                                    
MLOCDES DFHMDF POS=(05,39),                                            X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=25                                                        
***********************************************************************         
        DFHMDF POS=(07,06),                                            X        
               LENGTH=25,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CENTRAL STOCK PRINTER ID:'                              
MPRTID  DFHMDF POS=(07,32),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(07,41),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP)                                                    
***********************************************************************         
        DFHMDF POS=(09,02),                                            X        
               LENGTH=34,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='SELECT FROM THE FOLLOWING OPTIONS:'                     
***********************************************************************         
        DFHMDF POS=(11,06),                                            X        
               LENGTH=17,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='PULL NUMBER.....:'                                      
MPULLNO DFHMDF POS=(11,24),                                            X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(11,34),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP)                                                    
MPULDES DFHMDF POS=(11,39),                                            X        
               LENGTH=18,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP)                                                    
**********************************************************************          
        DFHMDF POS=(12,06),                                            X        
               LENGTH=17,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='REFERENCE NUMBER:'                                      
MREFNO  DFHMDF POS=(12,24),                                            X        
               LENGTH=15,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(12,40),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP)                                                    
**********************************************************************          
        DFHMDF POS=(13,06),                                            X        
               LENGTH=17,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='DEPT-MCL-SCL....:'                                      
MDEPTNO DFHMDF POS=(13,24),                                            X        
               LENGTH=03,                                              X        
               PICOUT='ZZZ',                                           X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
MMCLASS DFHMDF POS=(13,28),                                            X        
               LENGTH=02,                                              X        
               PICOUT='ZZ',                                            X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
MSCLASS DFHMDF POS=(13,31),                                            X        
               LENGTH=02,                                              X        
               PICOUT='ZZ',                                            X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
MDPTDES DFHMDF POS=(13,34),                                            X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=25                                                        
**********************************************************************          
        DFHMDF POS=(14,06),                                            X        
               LENGTH=17,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='PULL STATUS.....:'                                      
MPULLST DFHMDF POS=(14,24),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(14,26),                                            X        
               LENGTH=40,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' (Z-NEW/IN PROCESS, A-ALL, C-CANCELLED, '               
**********************************************************************          
        DFHMDF POS=(15,27),                                            X        
               LENGTH=41,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' D-DISTRIBUTED, I-IN PROCESS, N-NEW PULL,'              
        DFHMDF POS=(15,69),                                            X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='P-POSTED)'                                              
**********************************************************************          
        DFHMDF POS=(16,06),                                            X        
               LENGTH=17,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='PULL CREATE DATE:'                                      
MFROMMM DFHMDF POS=(16,24),                                            X        
               LENGTH=02,                                              X        
               PICOUT='99',                                            X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(16,27),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='/'                                                      
MFROMDD DFHMDF POS=(16,29),                                            X        
               LENGTH=02,                                              X        
               PICOUT='99',                                            X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(16,32),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='/'                                                      
MFROMYY DFHMDF POS=(16,34),                                            X        
               LENGTH=04,                                              X        
               PICOUT='9999',                                          X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(16,39),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' TO:'                                                   
MTOMM   DFHMDF POS=(16,44),                                            X        
               LENGTH=02,                                              X        
               PICOUT='99',                                            X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(16,47),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='/'                                                      
MTODD   DFHMDF POS=(16,49),                                            X        
               LENGTH=02,                                              X        
               PICOUT='99',                                            X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(16,52),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='/'                                                      
MTOYY   DFHMDF POS=(16,54),                                            X        
               LENGTH=04,                                              X        
               PICOUT='9999',                                          X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(16,59),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP)                                                    
**********************************************************************          
        DFHMDF POS=(17,06),                                            X        
               LENGTH=17,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='PULL SOURCE TYPE:'                                      
MSRCTYP DFHMDF POS=(17,24),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(17,26),                                            X        
               LENGTH=36,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' (A-ALL D-ALLOCATION I-REPLENISHMENT'                   
        DFHMDF POS=(17,63),                                            X        
               LENGTH=17,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='M-MANUAL X-WMXFR)'                                      
**********************************************************************          
        DFHMDF POS=(18,06),                                            X        
               LENGTH=17,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='LIST SEQUENCE...:'                                      
MLSTSEQ DFHMDF POS=(18,24),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(18,26),                                            X        
               LENGTH=39,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' (P-PULL NBR, D-CREATE DATE OLD TO NEW)'                
**********************************************************************          
        DFHMSD TYPE=FINAL                                                       
        PRINT NOGEN                                                             
        END                                                                     
