***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT NOGEN                                                             
CEKM604 DFHMSD TYPE=MAP,                                               X        
               MODE=INOUT,                                             X        
               LANG=COBOL,                                             X        
               TIOAPFX=YES                                                      
CE604A  DFHMDI SIZE=(19,80),                                           X        
               CTRL=(FREEKB,FRSET),                                    X        
               LINE=2,                                                 X        
               COLUMN=1,                                               X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
***********************************************************************         
        DFHMDF POS=(03,02),                                            X        
               LENGTH=35,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='ENTER THE FOLLOWING TO CREATE A NEW'                    
        DFHMDF POS=(03,38),                                            X        
               LENGTH=20,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CENTRAL STOCK PULL:'                                    
***********************************************************************         
        DFHMDF POS=(05,06),                                            X        
               LENGTH=29,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CENTRAL STOCK LOCATION......:'                          
MLOCID  DFHMDF POS=(05,36),                                            X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,FSET),                                     X        
               PICOUT='ZZZZ'                                                    
        DFHMDF POS=(05,41),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP)                                                    
MLOCDES DFHMDF POS=(05,45),                                            X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=25                                                        
***********************************************************************         
        DFHMDF POS=(07,06),                                            X        
               LENGTH=29,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='PULL NUMBER.................:'                          
MPULLNO DFHMDF POS=(07,36),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,FSET),                                     X        
               PICOUT='ZZZZZZZZ',                                      X        
               COLOR=BLUE                                                       
MPULDES DFHMDF POS=(07,45),                                            X        
               LENGTH=18,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP)                                                    
***********************************************************************         
        DFHMDF POS=(09,06),                                            X        
               LENGTH=29,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='STORE TO BE DISTRIBUTED TO..:'                          
MSTORNO DFHMDF POS=(09,36),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZ',                                          X        
               COLOR=GREEN                                                      
        DFHMDF POS=(09,41),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP)                                                    
MSTRNME DFHMDF POS=(09,45),                                            X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=25                                                        
***********************************************************************         
        DFHMDF POS=(11,06),                                            X        
               LENGTH=29,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='REFERENCE NUMBER............:'                          
MREFNO  DFHMDF POS=(11,36),                                            X        
               LENGTH=15,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
        DFHMDF POS=(11,52),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP)                                                    
**********************************************************************          
        DFHMDF POS=(13,06),                                            X        
               LENGTH=29,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='PULL CREATE DATE............:'                          
MCREDTE DFHMDF POS=(13,36),                                            X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(13,48),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='BY:'                                                    
MUSERID DFHMDF POS=(13,52),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
***********************************************************************         
        DFHMDF POS=(15,06),                                            X        
               LENGTH=29,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CENTRAL STOCK PRINTER NUMBER:'                          
MPRTID  DFHMDF POS=(15,36),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(15,45),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP)                                                    
***********************************************************************         
        DFHMSD TYPE=FINAL                                                       
        PRINT NOGEN                                                             
        END                                                                     
