*****************************************************************       00006**5
*       MAPSET  - CEKM621                                               00007**5
*       MAP     - CE621A                                                00008**5
*       PROGRAM - CEKCS621                                              00009**5
*       TRANSID - S621                                                  00010**5
*****************************************************************       00011**5
  PRINT  NOGEN                                                          00012**5
*                                                                       00013**5
CEKM621  DFHMSD TYPE=&&SYSPARM,                                        X00014**5
               LANG=COBOL,                                             X00015**5
               MODE=INOUT,                                             X00016**5
               STORAGE=AUTO,                                           X00017**5
               TERM=3270-2,                                            X00018**5
               TIOAPFX=YES                                              00019**5
CE621A   DFHMDI SIZE=(19,080),                                         X00020**5
               MAPATTS=(COLOR,HILIGHT),                                X00021**5
               DSATTS=(COLOR,HILIGHT),                                 X00022**5
               LINE=02,                                                X00023**5
               COLUMN=01,                                              X00024**5
               CTRL=(FREEKB)                                            00025**5
         DFHMDF POS=(01,004),                                          X00058**5
               COLOR=NEUTRAL,                                          X00059**5
               ATTRB=(ASKIP,NORM),                                     X00060**5
               LENGTH=019,                                             X00061**5
               INITIAL='PULL NUMBER.......:'                            00062**5
APULNBR  DFHMDF POS=(01,024),                                          X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=009,                                             X00066**5
               PICOUT='ZZZZZZZZZ'                                       00067**5
         DFHMDF POS=(01,040),                                          X00068*18
               COLOR=NEUTRAL,                                          X00069**5
               ATTRB=(ASKIP,NORM),                                     X00070**5
               LENGTH=034,                                             X00071*18
               INITIAL='TOTAL PULLED UNITS...............:'             00072*18
APULUNT  DFHMDF POS=(01,075),                                          X00073**6
               COLOR=YELLOW,                                           X00074*10
               ATTRB=(ASKIP,PROT),                                     X00075*10
               LENGTH=005,                                             X00076**6
               PICOUT='ZZZZ9'                                           00077**6
*                                                                       00078*12
         DFHMDF POS=(02,004),                                          X00079**6
               COLOR=NEUTRAL,                                          X00080**6
               ATTRB=(ASKIP,NORM),                                     X00081**6
               LENGTH=019,                                             X00082**6
               INITIAL='PULL CREATE DATE..:'                            00083*14
APCRTDT  DFHMDF POS=(02,024),                                          X00084**6
               COLOR=BLUE,                                             X00085**6
               ATTRB=(ASKIP,PROT),                                     X00086*10
               LENGTH=008                                               00087**6
         DFHMDF POS=(02,040),                                          X00088*18
               COLOR=NEUTRAL,                                          X00089**6
               ATTRB=(ASKIP,NORM),                                     X00090**6
               LENGTH=034,                                             X00091*18
               INITIAL='TOTAL UNITS SHIPPED TO STORE.....:'             00092*18
AUNTSHPD DFHMDF POS=(02,075),                                          X00093**6
               COLOR=BLUE,                                             X00094*10
               ATTRB=(ASKIP,PROT),                                     X00095*10
               LENGTH=005,                                             X00096**6
               PICOUT='ZZZ9-'                                           00097**6
*                                                                       00098*12
         DFHMDF POS=(03,004),                                          X00099*14
               COLOR=NEUTRAL,                                          X00100*14
               ATTRB=(ASKIP,NORM),                                     X00101*14
               LENGTH=019,                                             X00102*14
               INITIAL='PULL COMPLETE DATE:'                            00103*15
APCMPDT  DFHMDF POS=(03,024),                                          X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=008                                               00107*14
*                                                                       00108*14
         DFHMDF POS=(03,040),                                          X00109*20
               COLOR=NEUTRAL,                                          X00110*15
               ATTRB=(ASKIP,NORM),                                     X00111*15
               LENGTH=034,                                             X00112*15
               INITIAL='PERCENT OF UNITS SHIPPED TO STORE:'             00113*15
PCTUNTS  DFHMDF POS=(03,075),                                          X00114*20
               COLOR=BLUE,                                             X00115*15
               ATTRB=(ASKIP,PROT),                                     X00116*15
               LENGTH=004,                                             X00117*15
               PICOUT='ZZZZ'                                            00097**6
*                                                                       00118*15
         DFHMDF POS=(04,042),                                          X00026**5
               COLOR=NEUTRAL,                                          X00027**5
               ATTRB=(ASKIP,NORM),                                     X00028**5
               LENGTH=005,                                             X00029**5
               INITIAL='ITEMS'                                          00030**5
ASTRTIT  DFHMDF POS=(04,049),                                          X00031**5
               COLOR=GREEN,                                            X00032**5
               ATTRB=(UNPROT,NUM,NORM),                                X00033**5
               HILIGHT=UNDERLINE,                                      X00034**5
               LENGTH=007,                                             X00035**5
               PICOUT='ZZZ,ZZ9'                                         00036**5
         DFHMDF POS=(04,057),                                          X00037**5
               COLOR=NEUTRAL,                                          X00038**5
               ATTRB=(ASKIP,NORM),                                     X00039**5
               LENGTH=002,                                             X00040**5
               INITIAL='TO'                                             00041**5
AENDIT   DFHMDF POS=(04,061),                                          X00042**5
               COLOR=BLUE,                                             X00043**5
               ATTRB=(ASKIP,PROT),                                     X00044*10
               LENGTH=007,                                             X00045**5
               PICOUT='ZZZ,ZZ9'                                         00046**5
         DFHMDF POS=(04,069),                                          X00047**5
               COLOR=NEUTRAL,                                          X00048**5
               ATTRB=(ASKIP,NORM),                                     X00049**5
               LENGTH=002,                                             X00050**5
               INITIAL='OF'                                             00051**5
ATOTIT   DFHMDF POS=(04,072),                                          X00052**5
               COLOR=BLUE,                                             X00053**5
               ATTRB=(ASKIP,PROT),                                     X00054*10
               LENGTH=007,                                             X00055**5
               PICOUT='ZZZ,ZZ9'                                         00056**5
*                                                                       00057*12
         DFHMDF POS=(06,007),                                          X00144*12
               COLOR=NEUTRAL,                                          X00145**5
               ATTRB=(ASKIP,NORM),                                     X00146**5
               LENGTH=003,                                             X00147**5
               INITIAL='CRT'                                            00148**5
         DFHMDF POS=(06,012),                                          X00144*12
               COLOR=NEUTRAL,                                          X00145**5
               ATTRB=(ASKIP,NORM),                                     X00146**5
               LENGTH=003,                                             X00147**5
               INITIAL='PRC'                                            00148**5
         DFHMDF POS=(06,023),                                          X00144*12
               COLOR=NEUTRAL,                                          X00145**5
               ATTRB=(ASKIP,NORM),                                     X00146**5
               LENGTH=013,                                             X00147**5
               INITIAL='---ARRIVAL---'                                  00148**5
         DFHMDF POS=(06,040),                                          X00149*12
               COLOR=NEUTRAL,                                          X00150**5
               ATTRB=(ASKIP,NORM),                                     X00151**5
               LENGTH=028,                                             X00152**5
               INITIAL='----DC SHIPPED TO STORE-----'                   00153**5
         DFHMDF POS=(06,070),                                          X00154*12
               COLOR=NEUTRAL,                                          X00155**5
               ATTRB=(ASKIP,NORM),                                     X00156**5
               LENGTH=003,                                             X00157**5
               INITIAL='REQ'                                            00158**5
         DFHMDF POS=(06,076),                                          X00159*12
               COLOR=NEUTRAL,                                          X00160**5
               ATTRB=(ASKIP,NORM),                                     X00161**5
               LENGTH=003,                                             X00162**5
               INITIAL='PCT'                                            00163**5
*                                                                       00169*12
         DFHMDF POS=(07,002),                                          X00170*12
               COLOR=NEUTRAL,                                          X00171**5
               ATTRB=(ASKIP,NORM),                                     X00172**5
               LENGTH=003,                                             X00173**5
               INITIAL='SEL'                                            00174**5
         DFHMDF POS=(07,007),                                          X00175*12
               COLOR=NEUTRAL,                                          X00176**5
               ATTRB=(ASKIP,NORM),                                     X00177**5
               LENGTH=003,                                             X00178**5
               INITIAL='FOR'                                            00179**5
         DFHMDF POS=(07,012),                                          X00180*12
               COLOR=NEUTRAL,                                          X00181**5
               ATTRB=(ASKIP,NORM),                                     X00182**5
               LENGTH=002,                                             X00183**5
               INITIAL='BY'                                             00184**5
         DFHMDF POS=(07,016),                                          X00185*12
               COLOR=NEUTRAL,                                          X00186**5
               ATTRB=(ASKIP,NORM),                                     X00187**5
               LENGTH=004,                                             X00188**5
               INITIAL='STAT'                                           00189**5
         DFHMDF POS=(07,022),                                          X00190*12
               COLOR=NEUTRAL,                                          X00191**5
               ATTRB=(ASKIP,NORM),                                     X00192**5
               LENGTH=004,                                             X00193**5
               INITIAL='DATE'                                           00194**5
         DFHMDF POS=(07,031),                                          X00195*12
               COLOR=NEUTRAL,                                          X00196**5
               ATTRB=(ASKIP,NORM),                                     X00197**5
               LENGTH=004,                                             X00198**5
               INITIAL='TIME'                                           00199**5
         DFHMDF POS=(07,040),                                          X00200*12
               COLOR=NEUTRAL,                                          X00201**5
               ATTRB=(ASKIP,NORM),                                     X00202**5
               LENGTH=004,                                             X00203**5
               INITIAL='DATE'                                           00204**5
         DFHMDF POS=(07,048),                                          X00205*12
               COLOR=NEUTRAL,                                          X00206**5
               ATTRB=(ASKIP,NORM),                                     X00207**5
               LENGTH=004,                                             X00208**5
               INITIAL='TIME'                                           00209**5
         DFHMDF POS=(07,055),                                          X00210*12
               COLOR=NEUTRAL,                                          X00211**5
               ATTRB=(ASKIP,NORM),                                     X00212**5
               LENGTH=005,                                             X00213**5
               INITIAL='UNITS'                                          00214**5
         DFHMDF POS=(07,061),                                          X00215*12
               COLOR=NEUTRAL,                                          X00216**5
               ATTRB=(ASKIP,NORM),                                     X00217**5
               LENGTH=007,                                             X00218**5
               INITIAL='CTN CNT'                                        00219**5
         DFHMDF POS=(07,070),                                          X00220*12
               COLOR=NEUTRAL,                                          X00221**5
               ATTRB=(ASKIP,NORM),                                     X00222**5
               LENGTH=005,                                             X00223**5
               INITIAL='UNITS'                                          00224**5
*                                                                       00225**5
         DFHMDF POS=(07,076),                                          X00220*12
               COLOR=NEUTRAL,                                          X00221**5
               ATTRB=(ASKIP,NORM),                                     X00222**5
               LENGTH=004,                                             X00223**5
               INITIAL='SHPD'                                           00224**5
*                                                                       00225**5
ASEL01   DFHMDF POS=(08,002),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
         DFHMDF POS=(08,004),                                          X00231**5
               ATTRB=(ASKIP,PROT),                                     X00232**5
               LENGTH=001                                               00233**5
AACT01   DFHMDF POS=(08,006),                                          X00234*12
               COLOR=BLUE,                                             X00235**5
               ATTRB=(ASKIP,PROT),                                     X00236**5
               LENGTH=004,                                             X00237**5
               PICOUT='ZZZZ'                                            00238**5
ADC01    DFHMDF POS=(08,011),                                          X00239*12
               COLOR=BLUE,                                             X00240**5
               ATTRB=(ASKIP,PROT),                                     X00241**5
               LENGTH=004,                                             X00242**5
               PICOUT='ZZZZ'                                            00243**5
ARST01   DFHMDF POS=(08,017),                                          X00244*12
               COLOR=BLUE,                                             X00245**5
               ATTRB=(ASKIP,PROT),                                     X00246**5
               LENGTH=004                                               00247**5
AADAT01  DFHMDF POS=(08,022),                                          X00248*12
               COLOR=BLUE,                                             X00249**5
               ATTRB=(ASKIP,PROT),                                     X00250**5
               LENGTH=008                                               00251**5
AATIM01  DFHMDF POS=(08,031),                                          X00252*12
               COLOR=BLUE,                                             X00253**5
               ATTRB=(ASKIP,PROT),                                     X00254**5
               LENGTH=005                                               00255**5
AVDAT01  DFHMDF POS=(08,038),                                          X00256*12
               COLOR=BLUE,                                             X00257**5
               ATTRB=(ASKIP,PROT),                                     X00258**5
               LENGTH=008                                               00259**5
AVTIM01  DFHMDF POS=(08,047),                                          X00260*12
               COLOR=BLUE,                                             X00261**5
               ATTRB=(ASKIP,PROT),                                     X00262**5
               LENGTH=005                                               00263**5
ASUNT01  DFHMDF POS=(08,054),                                          X00264*12
               COLOR=BLUE,                                             X00265**5
               ATTRB=(ASKIP,PROT),                                     X00266**5
               LENGTH=006,                                             X00267**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ACCNT01  DFHMDF POS=(08,062),                                          X00269*12
               COLOR=BLUE,                                             X00270**5
               ATTRB=(ASKIP,PROT),                                     X00271**5
               LENGTH=006,                                             X00272**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ARUNT01  DFHMDF POS=(08,070),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=005,                                             X00276**5
               PICOUT='ZZZZZ'                                           00290**5
APSHP01  DFHMDF POS=(08,076),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=003,                                             X00276**5
               PICOUT='ZZZ'                                             00290**5
*                                                                       00277**5
ASEL02   DFHMDF POS=(09,002),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
         DFHMDF POS=(09,004),                                          X00231**5
               ATTRB=(ASKIP,PROT),                                     X00232**5
               LENGTH=001                                               00233**5
AACT02   DFHMDF POS=(09,006),                                          X00234*12
               COLOR=BLUE,                                             X00235**5
               ATTRB=(ASKIP,PROT),                                     X00236**5
               LENGTH=004,                                             X00237**5
               PICOUT='ZZZZ'                                            00238**5
ADC02    DFHMDF POS=(09,011),                                          X00239*12
               COLOR=BLUE,                                             X00240**5
               ATTRB=(ASKIP,PROT),                                     X00241**5
               LENGTH=004,                                             X00242**5
               PICOUT='ZZZZ'                                            00243**5
ARST02   DFHMDF POS=(09,017),                                          X00244*12
               COLOR=BLUE,                                             X00245**5
               ATTRB=(ASKIP,PROT),                                     X00246**5
               LENGTH=004                                               00247**5
AADAT02  DFHMDF POS=(09,022),                                          X00248*12
               COLOR=BLUE,                                             X00249**5
               ATTRB=(ASKIP,PROT),                                     X00250**5
               LENGTH=008                                               00251**5
AATIM02  DFHMDF POS=(09,031),                                          X00252*12
               COLOR=BLUE,                                             X00253**5
               ATTRB=(ASKIP,PROT),                                     X00254**5
               LENGTH=005                                               00255**5
AVDAT02  DFHMDF POS=(09,038),                                          X00256*12
               COLOR=BLUE,                                             X00257**5
               ATTRB=(ASKIP,PROT),                                     X00258**5
               LENGTH=008                                               00259**5
AVTIM02  DFHMDF POS=(09,047),                                          X00260*12
               COLOR=BLUE,                                             X00261**5
               ATTRB=(ASKIP,PROT),                                     X00262**5
               LENGTH=005                                               00263**5
ASUNT02  DFHMDF POS=(09,054),                                          X00264*12
               COLOR=BLUE,                                             X00265**5
               ATTRB=(ASKIP,PROT),                                     X00266**5
               LENGTH=006,                                             X00267**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ACCNT02  DFHMDF POS=(09,062),                                          X00269*12
               COLOR=BLUE,                                             X00270**5
               ATTRB=(ASKIP,PROT),                                     X00271**5
               LENGTH=006,                                             X00272**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ARUNT02  DFHMDF POS=(09,070),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=005,                                             X00276**5
               PICOUT='ZZZZZ'                                           00290**5
APSHP02  DFHMDF POS=(09,076),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=003,                                             X00276**5
               PICOUT='ZZZ'                                             00290**5
*                                                                       00277**5
ASEL03   DFHMDF POS=(10,002),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
         DFHMDF POS=(10,004),                                          X00231**5
               ATTRB=(ASKIP,PROT),                                     X00232**5
               LENGTH=001                                               00233**5
AACT03   DFHMDF POS=(10,006),                                          X00234*12
               COLOR=BLUE,                                             X00235**5
               ATTRB=(ASKIP,PROT),                                     X00236**5
               LENGTH=004,                                             X00237**5
               PICOUT='ZZZZ'                                            00238**5
ADC03    DFHMDF POS=(10,011),                                          X00239*12
               COLOR=BLUE,                                             X00240**5
               ATTRB=(ASKIP,PROT),                                     X00241**5
               LENGTH=004,                                             X00242**5
               PICOUT='ZZZZ'                                            00243**5
ARST03   DFHMDF POS=(10,017),                                          X00244*12
               COLOR=BLUE,                                             X00245**5
               ATTRB=(ASKIP,PROT),                                     X00246**5
               LENGTH=004                                               00247**5
AADAT03  DFHMDF POS=(10,022),                                          X00248*12
               COLOR=BLUE,                                             X00249**5
               ATTRB=(ASKIP,PROT),                                     X00250**5
               LENGTH=008                                               00251**5
AATIM03  DFHMDF POS=(10,031),                                          X00252*12
               COLOR=BLUE,                                             X00253**5
               ATTRB=(ASKIP,PROT),                                     X00254**5
               LENGTH=005                                               00255**5
AVDAT03  DFHMDF POS=(10,038),                                          X00256*12
               COLOR=BLUE,                                             X00257**5
               ATTRB=(ASKIP,PROT),                                     X00258**5
               LENGTH=008                                               00259**5
AVTIM03  DFHMDF POS=(10,047),                                          X00260*12
               COLOR=BLUE,                                             X00261**5
               ATTRB=(ASKIP,PROT),                                     X00262**5
               LENGTH=005                                               00263**5
ASUNT03  DFHMDF POS=(10,054),                                          X00264*12
               COLOR=BLUE,                                             X00265**5
               ATTRB=(ASKIP,PROT),                                     X00266**5
               LENGTH=006,                                             X00267**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ACCNT03  DFHMDF POS=(10,062),                                          X00269*12
               COLOR=BLUE,                                             X00270**5
               ATTRB=(ASKIP,PROT),                                     X00271**5
               LENGTH=006,                                             X00272**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ARUNT03  DFHMDF POS=(10,070),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=005,                                             X00276**5
               PICOUT='ZZZZZ'                                           00290**5
APSHP03  DFHMDF POS=(10,076),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=003,                                             X00276**5
               PICOUT='ZZZ'                                             00290**5
*                                                                       00277**5
ASEL04   DFHMDF POS=(11,002),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
         DFHMDF POS=(11,004),                                          X00231**5
               ATTRB=(ASKIP,PROT),                                     X00232**5
               LENGTH=001                                               00233**5
AACT04   DFHMDF POS=(11,006),                                          X00234*12
               COLOR=BLUE,                                             X00235**5
               ATTRB=(ASKIP,PROT),                                     X00236**5
               LENGTH=004,                                             X00237**5
               PICOUT='ZZZZ'                                            00238**5
ADC04    DFHMDF POS=(11,011),                                          X00239*12
               COLOR=BLUE,                                             X00240**5
               ATTRB=(ASKIP,PROT),                                     X00241**5
               LENGTH=004,                                             X00242**5
               PICOUT='ZZZZ'                                            00243**5
ARST04   DFHMDF POS=(11,017),                                          X00244*12
               COLOR=BLUE,                                             X00245**5
               ATTRB=(ASKIP,PROT),                                     X00246**5
               LENGTH=004                                               00247**5
AADAT04  DFHMDF POS=(11,022),                                          X00248*12
               COLOR=BLUE,                                             X00249**5
               ATTRB=(ASKIP,PROT),                                     X00250**5
               LENGTH=008                                               00251**5
AATIM04  DFHMDF POS=(11,031),                                          X00252*12
               COLOR=BLUE,                                             X00253**5
               ATTRB=(ASKIP,PROT),                                     X00254**5
               LENGTH=005                                               00255**5
AVDAT04  DFHMDF POS=(11,038),                                          X00256*12
               COLOR=BLUE,                                             X00257**5
               ATTRB=(ASKIP,PROT),                                     X00258**5
               LENGTH=008                                               00259**5
AVTIM04  DFHMDF POS=(11,047),                                          X00260*12
               COLOR=BLUE,                                             X00261**5
               ATTRB=(ASKIP,PROT),                                     X00262**5
               LENGTH=005                                               00263**5
ASUNT04  DFHMDF POS=(11,054),                                          X00264*12
               COLOR=BLUE,                                             X00265**5
               ATTRB=(ASKIP,PROT),                                     X00266**5
               LENGTH=006,                                             X00267**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ACCNT04  DFHMDF POS=(11,062),                                          X00269*12
               COLOR=BLUE,                                             X00270**5
               ATTRB=(ASKIP,PROT),                                     X00271**5
               LENGTH=006,                                             X00272**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ARUNT04  DFHMDF POS=(11,070),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=005,                                             X00276**5
               PICOUT='ZZZZZ'                                           00290**5
APSHP04  DFHMDF POS=(11,076),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=003,                                             X00276**5
               PICOUT='ZZZ'                                             00290**5
*                                                                       00277**5
ASEL05   DFHMDF POS=(12,002),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
         DFHMDF POS=(12,004),                                          X00231**5
               ATTRB=(ASKIP,PROT),                                     X00232**5
               LENGTH=001                                               00233**5
AACT05   DFHMDF POS=(12,006),                                          X00234*12
               COLOR=BLUE,                                             X00235**5
               ATTRB=(ASKIP,PROT),                                     X00236**5
               LENGTH=004,                                             X00237**5
               PICOUT='ZZZZ'                                            00238**5
ADC05    DFHMDF POS=(12,011),                                          X00239*12
               COLOR=BLUE,                                             X00240**5
               ATTRB=(ASKIP,PROT),                                     X00241**5
               LENGTH=004,                                             X00242**5
               PICOUT='ZZZZ'                                            00243**5
ARST05   DFHMDF POS=(12,017),                                          X00244*12
               COLOR=BLUE,                                             X00245**5
               ATTRB=(ASKIP,PROT),                                     X00246**5
               LENGTH=004                                               00247**5
AADAT05  DFHMDF POS=(12,022),                                          X00248*12
               COLOR=BLUE,                                             X00249**5
               ATTRB=(ASKIP,PROT),                                     X00250**5
               LENGTH=008                                               00251**5
AATIM05  DFHMDF POS=(12,031),                                          X00252*12
               COLOR=BLUE,                                             X00253**5
               ATTRB=(ASKIP,PROT),                                     X00254**5
               LENGTH=005                                               00255**5
AVDAT05  DFHMDF POS=(12,038),                                          X00256*12
               COLOR=BLUE,                                             X00257**5
               ATTRB=(ASKIP,PROT),                                     X00258**5
               LENGTH=008                                               00259**5
AVTIM05  DFHMDF POS=(12,047),                                          X00260*12
               COLOR=BLUE,                                             X00261**5
               ATTRB=(ASKIP,PROT),                                     X00262**5
               LENGTH=005                                               00263**5
ASUNT05  DFHMDF POS=(12,054),                                          X00264*12
               COLOR=BLUE,                                             X00265**5
               ATTRB=(ASKIP,PROT),                                     X00266**5
               LENGTH=006,                                             X00267**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ACCNT05  DFHMDF POS=(12,062),                                          X00269*12
               COLOR=BLUE,                                             X00270**5
               ATTRB=(ASKIP,PROT),                                     X00271**5
               LENGTH=006,                                             X00272**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ARUNT05  DFHMDF POS=(12,070),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=005,                                             X00276**5
               PICOUT='ZZZZZ'                                           00290**5
APSHP05  DFHMDF POS=(12,076),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=003,                                             X00276**5
               PICOUT='ZZZ'                                             00290**5
*                                                                       00277**5
ASEL06   DFHMDF POS=(13,002),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
         DFHMDF POS=(13,004),                                          X00231**5
               ATTRB=(ASKIP,PROT),                                     X00232**5
               LENGTH=001                                               00233**5
AACT06   DFHMDF POS=(13,006),                                          X00234*12
               COLOR=BLUE,                                             X00235**5
               ATTRB=(ASKIP,PROT),                                     X00236**5
               LENGTH=004,                                             X00237**5
               PICOUT='ZZZZ'                                            00238**5
ADC06    DFHMDF POS=(13,011),                                          X00239*12
               COLOR=BLUE,                                             X00240**5
               ATTRB=(ASKIP,PROT),                                     X00241**5
               LENGTH=004,                                             X00242**5
               PICOUT='ZZZZ'                                            00243**5
ARST06   DFHMDF POS=(13,017),                                          X00244*12
               COLOR=BLUE,                                             X00245**5
               ATTRB=(ASKIP,PROT),                                     X00246**5
               LENGTH=004                                               00247**5
AADAT06  DFHMDF POS=(13,022),                                          X00248*12
               COLOR=BLUE,                                             X00249**5
               ATTRB=(ASKIP,PROT),                                     X00250**5
               LENGTH=008                                               00251**5
AATIM06  DFHMDF POS=(13,031),                                          X00252*12
               COLOR=BLUE,                                             X00253**5
               ATTRB=(ASKIP,PROT),                                     X00254**5
               LENGTH=005                                               00255**5
AVDAT06  DFHMDF POS=(13,038),                                          X00256*12
               COLOR=BLUE,                                             X00257**5
               ATTRB=(ASKIP,PROT),                                     X00258**5
               LENGTH=008                                               00259**5
AVTIM06  DFHMDF POS=(13,047),                                          X00260*12
               COLOR=BLUE,                                             X00261**5
               ATTRB=(ASKIP,PROT),                                     X00262**5
               LENGTH=005                                               00263**5
ASUNT06  DFHMDF POS=(13,054),                                          X00264*12
               COLOR=BLUE,                                             X00265**5
               ATTRB=(ASKIP,PROT),                                     X00266**5
               LENGTH=006,                                             X00267**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ACCNT06  DFHMDF POS=(13,062),                                          X00269*12
               COLOR=BLUE,                                             X00270**5
               ATTRB=(ASKIP,PROT),                                     X00271**5
               LENGTH=006,                                             X00272**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ARUNT06  DFHMDF POS=(13,070),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=005,                                             X00276**5
               PICOUT='ZZZZZ'                                           00290**5
APSHP06  DFHMDF POS=(13,076),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=003,                                             X00276**5
               PICOUT='ZZZ'                                             00290**5
*                                                                       00277**5
ASEL07   DFHMDF POS=(14,002),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
         DFHMDF POS=(14,004),                                          X00231**5
               ATTRB=(ASKIP,PROT),                                     X00232**5
               LENGTH=001                                               00233**5
AACT07   DFHMDF POS=(14,006),                                          X00234*12
               COLOR=BLUE,                                             X00235**5
               ATTRB=(ASKIP,PROT),                                     X00236**5
               LENGTH=004,                                             X00237**5
               PICOUT='ZZZZ'                                            00238**5
ADC07    DFHMDF POS=(14,011),                                          X00239*12
               COLOR=BLUE,                                             X00240**5
               ATTRB=(ASKIP,PROT),                                     X00241**5
               LENGTH=004,                                             X00242**5
               PICOUT='ZZZZ'                                            00243**5
ARST07   DFHMDF POS=(14,017),                                          X00244*12
               COLOR=BLUE,                                             X00245**5
               ATTRB=(ASKIP,PROT),                                     X00246**5
               LENGTH=004                                               00247**5
AADAT07  DFHMDF POS=(14,022),                                          X00248*12
               COLOR=BLUE,                                             X00249**5
               ATTRB=(ASKIP,PROT),                                     X00250**5
               LENGTH=008                                               00251**5
AATIM07  DFHMDF POS=(14,031),                                          X00252*12
               COLOR=BLUE,                                             X00253**5
               ATTRB=(ASKIP,PROT),                                     X00254**5
               LENGTH=005                                               00255**5
AVDAT07  DFHMDF POS=(14,038),                                          X00256*12
               COLOR=BLUE,                                             X00257**5
               ATTRB=(ASKIP,PROT),                                     X00258**5
               LENGTH=008                                               00259**5
AVTIM07  DFHMDF POS=(14,047),                                          X00260*12
               COLOR=BLUE,                                             X00261**5
               ATTRB=(ASKIP,PROT),                                     X00262**5
               LENGTH=005                                               00263**5
ASUNT07  DFHMDF POS=(14,054),                                          X00264*12
               COLOR=BLUE,                                             X00265**5
               ATTRB=(ASKIP,PROT),                                     X00266**5
               LENGTH=006,                                             X00267**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ACCNT07  DFHMDF POS=(14,062),                                          X00269*12
               COLOR=BLUE,                                             X00270**5
               ATTRB=(ASKIP,PROT),                                     X00271**5
               LENGTH=006,                                             X00272**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ARUNT07  DFHMDF POS=(14,070),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=005,                                             X00276**5
               PICOUT='ZZZZZ'                                           00290**5
APSHP07  DFHMDF POS=(14,076),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=003,                                             X00276**5
               PICOUT='ZZZ'                                             00290**5
*                                                                       00277**5
ASEL08   DFHMDF POS=(15,002),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
         DFHMDF POS=(15,004),                                          X00231**5
               ATTRB=(ASKIP,PROT),                                     X00232**5
               LENGTH=001                                               00233**5
AACT08   DFHMDF POS=(15,006),                                          X00234*12
               COLOR=BLUE,                                             X00235**5
               ATTRB=(ASKIP,PROT),                                     X00236**5
               LENGTH=004,                                             X00237**5
               PICOUT='ZZZZ'                                            00238**5
ADC08    DFHMDF POS=(15,011),                                          X00239*12
               COLOR=BLUE,                                             X00240**5
               ATTRB=(ASKIP,PROT),                                     X00241**5
               LENGTH=004,                                             X00242**5
               PICOUT='ZZZZ'                                            00243**5
ARST08   DFHMDF POS=(15,017),                                          X00244*12
               COLOR=BLUE,                                             X00245**5
               ATTRB=(ASKIP,PROT),                                     X00246**5
               LENGTH=004                                               00247**5
AADAT08  DFHMDF POS=(15,022),                                          X00248*12
               COLOR=BLUE,                                             X00249**5
               ATTRB=(ASKIP,PROT),                                     X00250**5
               LENGTH=008                                               00251**5
AATIM08  DFHMDF POS=(15,031),                                          X00252*12
               COLOR=BLUE,                                             X00253**5
               ATTRB=(ASKIP,PROT),                                     X00254**5
               LENGTH=005                                               00255**5
AVDAT08  DFHMDF POS=(15,038),                                          X00256*12
               COLOR=BLUE,                                             X00257**5
               ATTRB=(ASKIP,PROT),                                     X00258**5
               LENGTH=008                                               00259**5
AVTIM08  DFHMDF POS=(15,047),                                          X00260*12
               COLOR=BLUE,                                             X00261**5
               ATTRB=(ASKIP,PROT),                                     X00262**5
               LENGTH=005                                               00263**5
ASUNT08  DFHMDF POS=(15,054),                                          X00264*12
               COLOR=BLUE,                                             X00265**5
               ATTRB=(ASKIP,PROT),                                     X00266**5
               LENGTH=006,                                             X00267**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ACCNT08  DFHMDF POS=(15,062),                                          X00269*12
               COLOR=BLUE,                                             X00270**5
               ATTRB=(ASKIP,PROT),                                     X00271**5
               LENGTH=006,                                             X00272**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ARUNT08  DFHMDF POS=(15,070),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=005,                                             X00276**5
               PICOUT='ZZZZZ'                                           00290**5
APSHP08  DFHMDF POS=(15,076),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=003,                                             X00276**5
               PICOUT='ZZZ'                                             00290**5
*                                                                       00277**5
ASEL09   DFHMDF POS=(16,002),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
         DFHMDF POS=(16,004),                                          X00231**5
               ATTRB=(ASKIP,PROT),                                     X00232**5
               LENGTH=001                                               00233**5
AACT09   DFHMDF POS=(16,006),                                          X00234*12
               COLOR=BLUE,                                             X00235**5
               ATTRB=(ASKIP,PROT),                                     X00236**5
               LENGTH=004,                                             X00237**5
               PICOUT='ZZZZ'                                            00238**5
ADC09    DFHMDF POS=(16,011),                                          X00239*12
               COLOR=BLUE,                                             X00240**5
               ATTRB=(ASKIP,PROT),                                     X00241**5
               LENGTH=004,                                             X00242**5
               PICOUT='ZZZZ'                                            00243**5
ARST09   DFHMDF POS=(16,017),                                          X00244*12
               COLOR=BLUE,                                             X00245**5
               ATTRB=(ASKIP,PROT),                                     X00246**5
               LENGTH=004                                               00247**5
AADAT09  DFHMDF POS=(16,022),                                          X00248*12
               COLOR=BLUE,                                             X00249**5
               ATTRB=(ASKIP,PROT),                                     X00250**5
               LENGTH=008                                               00251**5
AATIM09  DFHMDF POS=(16,031),                                          X00252*12
               COLOR=BLUE,                                             X00253**5
               ATTRB=(ASKIP,PROT),                                     X00254**5
               LENGTH=005                                               00255**5
AVDAT09  DFHMDF POS=(16,038),                                          X00256*12
               COLOR=BLUE,                                             X00257**5
               ATTRB=(ASKIP,PROT),                                     X00258**5
               LENGTH=008                                               00259**5
AVTIM09  DFHMDF POS=(16,047),                                          X00260*12
               COLOR=BLUE,                                             X00261**5
               ATTRB=(ASKIP,PROT),                                     X00262**5
               LENGTH=005                                               00263**5
ASUNT09  DFHMDF POS=(16,054),                                          X00264*12
               COLOR=BLUE,                                             X00265**5
               ATTRB=(ASKIP,PROT),                                     X00266**5
               LENGTH=006,                                             X00267**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ACCNT09  DFHMDF POS=(16,062),                                          X00269*12
               COLOR=BLUE,                                             X00270**5
               ATTRB=(ASKIP,PROT),                                     X00271**5
               LENGTH=006,                                             X00272**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ARUNT09  DFHMDF POS=(16,070),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=005,                                             X00276**5
               PICOUT='ZZZZZ'                                           00290**5
APSHP09  DFHMDF POS=(16,076),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=003,                                             X00276**5
               PICOUT='ZZZ'                                             00290**5
*                                                                       00277**5
ASEL10   DFHMDF POS=(17,002),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
         DFHMDF POS=(17,004),                                          X00231**5
               ATTRB=(ASKIP,PROT),                                     X00232**5
               LENGTH=001                                               00233**5
AACT10   DFHMDF POS=(17,006),                                          X00234*12
               COLOR=BLUE,                                             X00235**5
               ATTRB=(ASKIP,PROT),                                     X00236**5
               LENGTH=004,                                             X00237**5
               PICOUT='ZZZZ'                                            00238**5
ADC10    DFHMDF POS=(17,011),                                          X00239*12
               COLOR=BLUE,                                             X00240**5
               ATTRB=(ASKIP,PROT),                                     X00241**5
               LENGTH=004,                                             X00242**5
               PICOUT='ZZZZ'                                            00243**5
ARST10   DFHMDF POS=(17,017),                                          X00244*12
               COLOR=BLUE,                                             X00245**5
               ATTRB=(ASKIP,PROT),                                     X00246**5
               LENGTH=004                                               00247**5
AADAT10  DFHMDF POS=(17,022),                                          X00248*12
               COLOR=BLUE,                                             X00249**5
               ATTRB=(ASKIP,PROT),                                     X00250**5
               LENGTH=008                                               00251**5
AATIM10  DFHMDF POS=(17,031),                                          X00252*12
               COLOR=BLUE,                                             X00253**5
               ATTRB=(ASKIP,PROT),                                     X00254**5
               LENGTH=005                                               00255**5
AVDAT10  DFHMDF POS=(17,038),                                          X00256*12
               COLOR=BLUE,                                             X00257**5
               ATTRB=(ASKIP,PROT),                                     X00258**5
               LENGTH=008                                               00259**5
AVTIM10  DFHMDF POS=(17,047),                                          X00260*12
               COLOR=BLUE,                                             X00261**5
               ATTRB=(ASKIP,PROT),                                     X00262**5
               LENGTH=005                                               00263**5
ASUNT10  DFHMDF POS=(17,054),                                          X00264*12
               COLOR=BLUE,                                             X00265**5
               ATTRB=(ASKIP,PROT),                                     X00266**5
               LENGTH=006,                                             X00267**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ACCNT10  DFHMDF POS=(17,062),                                          X00269*12
               COLOR=BLUE,                                             X00270**5
               ATTRB=(ASKIP,PROT),                                     X00271**5
               LENGTH=006,                                             X00272**5
               PICOUT='ZZ,ZZZ'                                          00268**5
ARUNT10  DFHMDF POS=(17,070),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=005,                                             X00276**5
               PICOUT='ZZZZZ'                                           00290**5
APSHP10  DFHMDF POS=(17,076),                                          X00273*12
               COLOR=BLUE,                                             X00274**5
               ATTRB=(ASKIP,PROT),                                     X00275**5
               LENGTH=003,                                             X00276**5
               PICOUT='ZZZ'                                             00290**5
*                                                                       00745*10
         DFHMDF POS=(18,020),                                          X00746**5
               COLOR=NEUTRAL,                                          X00747**5
               ATTRB=(ASKIP,NORM),                                     X00748**5
               LENGTH=029,                                             X00749**5
               INITIAL='TOTALS FOR SELECTION LIST--->'                  00750**5
*                                                                       00751**5
AUNTTOT  DFHMDF POS=(18,054),                                          X00752**5
               COLOR=YELLOW,                                           X00753**5
               ATTRB=(ASKIP,PROT),                                     X00754**5
               LENGTH=006,                                             X00755**5
               PICOUT='ZZ,ZZZ'                                          00756**5
                                                                        00757**5
ACTNTOT  DFHMDF POS=(18,062),                                          X00758**5
               COLOR=YELLOW,                                           X00759**5
               ATTRB=(ASKIP,PROT),                                     X00760**5
               LENGTH=006,                                             X00761**5
               PICOUT='ZZ,ZZZ'                                          00762**5
                                                                        00757**5
ARUNTOT  DFHMDF POS=(18,070),                                          X00758**5
               COLOR=YELLOW,                                           X00759**5
               ATTRB=(ASKIP,PROT),                                     X00760**5
               LENGTH=005,                                             X00761**5
               PICOUT='ZZZZZ'                                           00762**5
*                                                                       00763**5
         DFHMDF POS=(19,045),                                          X00764**5
               COLOR=NEUTRAL,                                          X00765**5
               ATTRB=(ASKIP,NORM),                                     X00766**5
               LENGTH=025,                                             X00767**5
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00768**5
ASELIT   DFHMDF POS=(19,071),                                          X00769**5
               COLOR=BLUE,                                             X00770**5
               ATTRB=(ASKIP,PROT),                                     X00771**5
               LENGTH=007,                                             X00772**5
               PICOUT='ZZZ,ZZ9'                                         00773**5
         DFHMSD TYPE=FINAL                                              00774**5
         END                                                            00775**5
