*********************************************************************** 00000102
*                                                                       00000202
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00000302
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00000402
*********************************************************************** 00000502
        PRINT  NOGEN                                                    00000602
CEKM605 DFHMSD TYPE=DSECT,                                             X00000702
               LANG=COBOL,                                             X00000802
               MODE=INOUT,                                             X00000902
               STORAGE=AUTO,                                           X00001002
               TERM=3270-2,                                            X00001102
               TIOAPFX=YES                                              00001202
*****************************************************************       00001302
CE605A  DFHMDI LINE=2,COLUMN=1,                                        X00001402
               SIZE=(19,80),                                           X00001502
               CTRL=(FREEKB),                                          X00001602
               MAPATTS=(COLOR,HILIGHT),                                X00001702
               DSATTS=(COLOR,HILIGHT)                                   00001802
*****************************************************************       00001902
        DFHMDF POS=(02,01),                                            X00002002
               LENGTH=16,                                              X00002102
               ATTRB=(ASKIP,NORM),                                     X00002202
               COLOR=NEUTRAL,                                          X00002302
               INITIAL='CS LOCATION....:'                               00002402
ALOCID  DFHMDF POS=(02,22),                                            X00002509
               LENGTH=04,                                              X00002602
               ATTRB=(ASKIP,NORM),                                     X00002702
               COLOR=BLUE                                               00002802
        DFHMDF POS=(02,29),                                            X00002910
               LENGTH=12,                                              X00003002
               ATTRB=(ASKIP,NORM),                                     X00003102
               COLOR=NEUTRAL,                                          X00003202
               INITIAL='FOR STORE..:'                                   00003302
ASTRNO  DFHMDF POS=(02,44),                                            X00003410
               LENGTH=04,                                              X00003502
               ATTRB=(ASKIP,NORM),                                     X00003602
               PICOUT='ZZZZ',                                          X00003702
               COLOR=BLUE                                               00003802
MSTRNME DFHMDF POS=(02,52),                                            X00003910
               COLOR=BLUE,                                             X00004008
               ATTRB=(ASKIP),                                          X00004108
               LENGTH=25                                                00004208
*****************************************************************       00004302
        DFHMDF POS=(03,01),                                            X00004402
               LENGTH=16,                                              X00004502
               ATTRB=(ASKIP,NORM),                                     X00004602
               COLOR=NEUTRAL,                                          X00004702
               INITIAL='PULL NUMBER....:'                               00004802
APULNO  DFHMDF POS=(03,18),                                            X00004902
               LENGTH=08,                                              X00005002
               ATTRB=(ASKIP,NORM),                                     X00005102
               PICOUT='Z(8)',                                          X00005205
               COLOR=BLUE                                               00005304
        DFHMDF POS=(03,29),                                            X00005410
               LENGTH=12,                                              X00005504
               ATTRB=(ASKIP,NORM),                                     X00005604
               COLOR=NEUTRAL,                                          X00005704
               INITIAL='PULL STATUS:'                                   00005804
APULST  DFHMDF POS=(03,42),                                            X00005910
               LENGTH=08,                                              X00006004
               ATTRB=(ASKIP,NORM),                                     X00006104
               COLOR=BLUE                                               00006204
        DFHMDF POS=(03,52),                                            X00006310
               LENGTH=09,                                              X00006410
               ATTRB=(ASKIP,NORM),                                     X00006510
               COLOR=NEUTRAL,                                          X00006610
               INITIAL='LAST SKU:'                                      00006710
ALSTSK  DFHMDF POS=(03,62),                                            X00006810
               LENGTH=08,                                              X00006910
               ATTRB=(ASKIP,NORM),                                     X00007010
               COLOR=BLUE                                               00007110
**************************************************************          00007204
        DFHMDF POS=(04,01),                                            X00007304
               LENGTH=16,                                              X00007404
               ATTRB=(ASKIP,NORM),                                     X00007504
               COLOR=NEUTRAL,                                          X00007604
               INITIAL='NUMBER OF LINES:'                               00007704
ALNENO  DFHMDF POS=(04,21),                                            X00007809
               LENGTH=05,                                              X00007904
               ATTRB=(ASKIP,NORM),                                     X00008004
               PICOUT='ZZZZ9',                                         X00008104
               COLOR=BLUE                                               00008204
        DFHMDF POS=(04,29),                                            X00008310
               LENGTH=12,                                              X00008404
               ATTRB=(ASKIP,NORM),                                     X00008504
               COLOR=NEUTRAL,                                          X00008604
               INITIAL='TOTAL UNITS:'                                   00008704
ATOTUT  DFHMDF POS=(04,42),                                            X00008810
               LENGTH=06,                                              X00008904
               ATTRB=(ASKIP,NORM),                                     X00009004
               PICOUT='ZZZZZZ',                                        X00009104
               COLOR=BLUE                                               00009204
        DFHMDF POS=(04,52),                                            X00009310
               LENGTH=09,                                              X00009404
               ATTRB=(ASKIP,NORM),                                     X00009504
               COLOR=NEUTRAL,                                          X00009604
               INITIAL='LAST UPC:'                                      00009710
ALSTUP  DFHMDF POS=(04,62),                                            X00009810
               LENGTH=15,                                              X00009910
               ATTRB=(ASKIP,NORM),                                     X00010004
               COLOR=BLUE                                               00010104
****************************************************************        00010204
        DFHMDF POS=(05,22),                                            X00010313
               LENGTH=15,                                              X00010414
               ATTRB=(ASKIP,NORM),                                     X00010504
               COLOR=NEUTRAL,                                          X00010604
               INITIAL='REQ  AVAIL LINE'                                00010714
        DFHMDF POS=(05,67),                                            X00010806
               LENGTH=03,                                              X00010904
               ATTRB=(ASKIP,NORM),                                     X00011004
               COLOR=NEUTRAL,INITIAL='SKU'                              00011104
****************************************************************        00011204
        DFHMDF POS=(06,01),                                            X00011312
               LENGTH=35,                                              X00011404
               ATTRB=(ASKIP,NORM),                                     X00011504
               COLOR=NEUTRAL,                                          X00011604
               INITIAL='SEL  ACT SKU NUMBER UNITS UNITS NBR'            00011718
        DFHMDF POS=(06,43),                                            X00011806
               LENGTH=30,                                              X00011904
               ATTRB=(ASKIP,NORM),                                     X00012004
               COLOR=NEUTRAL,                                          X00012104
               INITIAL='SKU DESCRIPTION        RETAIL '                 00012206
******************************************************************      00012304
ASEL01  DFHMDF POS=(07,02),                                            X00012412
               LENGTH=01,                                              X00012504
               ATTRB=(UNPROT,NORM),                                    X00012604
               HILIGHT=UNDERLINE,                                      X00012704
               COLOR=GREEN                                              00012804
        DFHMDF POS=(07,04),                                            X00012919
               LENGTH=01,                                              X00013018
               ATTRB=(ASKIP)                                            00013118
AACT01  DFHMDF POS=(07,06),                                            X00013218
               LENGTH=03,                                              X00013304
               ATTRB=(ASKIP,NORM),                                     X00013404
               COLOR=BLUE                                               00013604
ASKU01  DFHMDF POS=(07,10),                                            X00014012
               LENGTH=08,                                              X00014104
               ATTRB=(UNPROT,NORM),                                    X00014204
               PICOUT='ZZZZZZZZ',                                      X00014304
               HILIGHT=UNDERLINE,                                      X00014404
               COLOR=GREEN                                              00014504
        DFHMDF POS=(07,19),                                            X00014612
               LENGTH=01,                                              X00014704
               ATTRB=(ASKIP)                                            00014804
AUNT01 DFHMDF  POS=(07,21),                                            X00014912
               LENGTH=05,                                              X00015004
               ATTRB=(UNPROT,NORM),                                    X00015104
               PICOUT='ZZZZZ',                                         X00015204
               HILIGHT=UNDERLINE,                                      X00015304
               COLOR=GREEN                                              00015404
AAUNT01 DFHMDF POS=(07,27),                                            X00015512
               LENGTH=05,                                              X00015612
               ATTRB=(ASKIP),                                          X00015712
               PICOUT='ZZZZZ',                                         X00015812
               COLOR=BLUE                                               00016012
ALNE01  DFHMDF POS=(07,33),                                            X00016112
               LENGTH=04,                                              X00016212
               ATTRB=(ASKIP),                                          X00016312
               PICOUT='ZZZZ',                                          X00016412
               COLOR=BLUE                                               00016612
ADESC01 DFHMDF POS=(07,38),                                            X00016712
               LENGTH=25,                                              X00016812
               ATTRB=(ASKIP,NORM),                                     X00016912
               COLOR=BLUE                                               00017112
ARETL01 DFHMDF POS=(07,65),                                            X00017212
               LENGTH=08,                                              X00017312
               ATTRB=(ASKIP,NORM),                                     X00017412
               PICOUT='ZZZZZ.99',                                      X00017512
               COLOR=BLUE                                               00017712
******************************************************************      00017812
ASEL02  DFHMDF POS=(08,02),                                            X00017912
               LENGTH=01,                                              X00018012
               ATTRB=(UNPROT,NORM),                                    X00018112
               HILIGHT=UNDERLINE,                                      X00018212
               COLOR=GREEN                                              00018312
        DFHMDF POS=(08,04),                                            X00018419
               LENGTH=01,                                              X00018518
               ATTRB=(ASKIP)                                            00018618
AACT02  DFHMDF POS=(08,06),                                            X00018718
               LENGTH=03,                                              X00018812
               ATTRB=(ASKIP,NORM),                                     X00018912
               COLOR=BLUE                                               00019012
ASKU02  DFHMDF POS=(08,10),                                            X00019412
               LENGTH=08,                                              X00019512
               ATTRB=(UNPROT,NORM),                                    X00019612
               PICOUT='ZZZZZZZZ',                                      X00019712
               HILIGHT=UNDERLINE,                                      X00019812
               COLOR=GREEN                                              00019912
        DFHMDF POS=(08,19),                                            X00020012
               LENGTH=01,                                              X00020112
               ATTRB=(ASKIP)                                            00020212
AUNT02 DFHMDF  POS=(08,21),                                            X00020312
               LENGTH=05,                                              X00020412
               ATTRB=(UNPROT,NORM),                                    X00020512
               PICOUT='ZZZZZ',                                         X00020612
               HILIGHT=UNDERLINE,                                      X00020712
               COLOR=GREEN                                              00020812
AAUNT02 DFHMDF POS=(08,27),                                            X00020912
               LENGTH=05,                                              X00021012
               ATTRB=(ASKIP),                                          X00021112
               PICOUT='ZZZZZ',                                         X00021212
               COLOR=BLUE                                               00021312
ALNE02  DFHMDF POS=(08,33),                                            X00021712
               LENGTH=04,                                              X00021812
               ATTRB=(ASKIP),                                          X00021912
               PICOUT='ZZZZ',                                          X00022012
               COLOR=BLUE                                               00022112
ADESC02 DFHMDF POS=(08,38),                                            X00022212
               LENGTH=25,                                              X00022312
               ATTRB=(ASKIP,NORM),                                     X00022412
               COLOR=BLUE                                               00022512
ARETL02 DFHMDF POS=(08,65),                                            X00022612
               LENGTH=08,                                              X00022712
               ATTRB=(ASKIP,NORM),                                     X00022812
               PICOUT='ZZZZZ.99',                                      X00022912
               COLOR=BLUE                                               00023012
******************************************************************      00023112
ASEL03  DFHMDF POS=(09,02),                                            X00023212
               LENGTH=01,                                              X00023312
               ATTRB=(UNPROT,NORM),                                    X00023412
               HILIGHT=UNDERLINE,                                      X00023512
               COLOR=GREEN                                              00023612
        DFHMDF POS=(09,04),                                            X00023719
               LENGTH=01,                                              X00023818
               ATTRB=(ASKIP)                                            00023918
AACT03  DFHMDF POS=(09,06),                                            X00024018
               LENGTH=03,                                              X00024112
               ATTRB=(ASKIP,NORM),                                     X00024212
               COLOR=BLUE                                               00024312
ASKU03  DFHMDF POS=(09,10),                                            X00024712
               LENGTH=08,                                              X00024812
               ATTRB=(UNPROT,NORM),                                    X00024912
               PICOUT='ZZZZZZZZ',                                      X00025012
               HILIGHT=UNDERLINE,                                      X00025112
               COLOR=GREEN                                              00025212
        DFHMDF POS=(09,19),                                            X00025312
               LENGTH=01,                                              X00025412
               ATTRB=(ASKIP)                                            00025512
AUNT03 DFHMDF  POS=(09,21),                                            X00025612
               LENGTH=05,                                              X00025712
               ATTRB=(UNPROT,NORM),                                    X00025812
               PICOUT='ZZZZZ',                                         X00025912
               HILIGHT=UNDERLINE,                                      X00026012
               COLOR=GREEN                                              00026112
AAUNT03 DFHMDF POS=(09,27),                                            X00026212
               LENGTH=05,                                              X00026312
               ATTRB=(ASKIP),                                          X00026412
               PICOUT='ZZZZZ',                                         X00026512
               COLOR=BLUE                                               00026612
ALNE03  DFHMDF POS=(09,33),                                            X00027412
               LENGTH=04,                                              X00027512
               ATTRB=(ASKIP),                                          X00027612
               PICOUT='ZZZZ',                                          X00027712
               COLOR=BLUE                                               00027812
ADESC03 DFHMDF POS=(09,38),                                            X00027912
               LENGTH=25,                                              X00028012
               ATTRB=(ASKIP,NORM),                                     X00028112
               COLOR=BLUE                                               00028212
ARETL03 DFHMDF POS=(09,65),                                            X00028312
               LENGTH=08,                                              X00028412
               ATTRB=(ASKIP,NORM),                                     X00028512
               PICOUT='ZZZZZ.99',                                      X00028612
               COLOR=BLUE                                               00028712
******************************************************************      00028812
ASEL04  DFHMDF POS=(10,02),                                            X00028912
               LENGTH=01,                                              X00029012
               ATTRB=(UNPROT,NORM),                                    X00029112
               HILIGHT=UNDERLINE,                                      X00029212
               COLOR=GREEN                                              00029312
        DFHMDF POS=(10,04),                                            X00029419
               LENGTH=01,                                              X00029518
               ATTRB=(ASKIP)                                            00029618
AACT04  DFHMDF POS=(10,06),                                            X00029718
               LENGTH=03,                                              X00029812
               ATTRB=(ASKIP,NORM),                                     X00029912
               COLOR=BLUE                                               00030012
ASKU04  DFHMDF POS=(10,10),                                            X00030412
               LENGTH=08,                                              X00030512
               ATTRB=(UNPROT,NORM),                                    X00030612
               PICOUT='ZZZZZZZZ',                                      X00030712
               HILIGHT=UNDERLINE,                                      X00030812
               COLOR=GREEN                                              00030912
        DFHMDF POS=(10,19),                                            X00031012
               LENGTH=01,                                              X00031112
               ATTRB=(ASKIP)                                            00031212
AUNT04 DFHMDF  POS=(10,21),                                            X00031312
               LENGTH=05,                                              X00031412
               ATTRB=(UNPROT,NORM),                                    X00031512
               PICOUT='ZZZZZ',                                         X00031612
               HILIGHT=UNDERLINE,                                      X00031712
               COLOR=GREEN                                              00031812
AAUNT04 DFHMDF POS=(10,27),                                            X00031912
               LENGTH=05,                                              X00032012
               ATTRB=(ASKIP),                                          X00032112
               PICOUT='ZZZZZ',                                         X00032212
               COLOR=BLUE                                               00032312
ALNE04  DFHMDF POS=(10,33),                                            X00033112
               LENGTH=04,                                              X00033212
               ATTRB=(ASKIP),                                          X00033312
               PICOUT='ZZZZ',                                          X00033412
               COLOR=BLUE                                               00033512
ADESC04 DFHMDF POS=(10,38),                                            X00033612
               LENGTH=25,                                              X00033712
               ATTRB=(ASKIP,NORM),                                     X00033812
               COLOR=BLUE                                               00033912
ARETL04 DFHMDF POS=(10,65),                                            X00034012
               LENGTH=08,                                              X00034112
               ATTRB=(ASKIP,NORM),                                     X00034212
               PICOUT='ZZZZZ.99',                                      X00034312
               COLOR=BLUE                                               00034412
******************************************************************      00034512
ASEL05  DFHMDF POS=(11,02),                                            X00034612
               LENGTH=01,                                              X00034712
               ATTRB=(UNPROT,NORM),                                    X00034812
               HILIGHT=UNDERLINE,                                      X00034912
               COLOR=GREEN                                              00035012
        DFHMDF POS=(11,04),                                            X00035119
               LENGTH=01,                                              X00035218
               ATTRB=(ASKIP)                                            00035318
AACT05  DFHMDF POS=(11,06),                                            X00035418
               LENGTH=03,                                              X00035512
               ATTRB=(ASKIP,NORM),                                     X00035612
               COLOR=BLUE                                               00035712
ASKU05  DFHMDF POS=(11,10),                                            X00036112
               LENGTH=08,                                              X00036212
               ATTRB=(UNPROT,NORM),                                    X00036312
               PICOUT='ZZZZZZZZ',                                      X00036412
               HILIGHT=UNDERLINE,                                      X00036512
               COLOR=GREEN                                              00036612
        DFHMDF POS=(11,19),                                            X00036712
               LENGTH=01,                                              X00036812
               ATTRB=(ASKIP)                                            00036912
AUNT05 DFHMDF  POS=(11,21),                                            X00037012
               LENGTH=05,                                              X00037112
               ATTRB=(UNPROT,NORM),                                    X00037212
               PICOUT='ZZZZZ',                                         X00037312
               HILIGHT=UNDERLINE,                                      X00037412
               COLOR=GREEN                                              00037512
AAUNT05 DFHMDF POS=(11,27),                                            X00037612
               LENGTH=05,                                              X00037712
               ATTRB=(ASKIP),                                          X00037812
               PICOUT='ZZZZZ',                                         X00037912
               COLOR=BLUE                                               00038012
ALNE05  DFHMDF POS=(11,33),                                            X00038812
               LENGTH=04,                                              X00038912
               ATTRB=(ASKIP),                                          X00039012
               PICOUT='ZZZZ',                                          X00039112
               COLOR=BLUE                                               00039212
ADESC05 DFHMDF POS=(11,38),                                            X00039312
               LENGTH=25,                                              X00039412
               ATTRB=(ASKIP,NORM),                                     X00039512
               COLOR=BLUE                                               00039612
ARETL05 DFHMDF POS=(11,65),                                            X00039712
               LENGTH=08,                                              X00039812
               ATTRB=(ASKIP,NORM),                                     X00039912
               PICOUT='ZZZZZ.99',                                      X00040012
               COLOR=BLUE                                               00040112
******************************************************************      00040212
ASEL06  DFHMDF POS=(12,02),                                            X00040312
               LENGTH=01,                                              X00040412
               ATTRB=(UNPROT,NORM),                                    X00040512
               HILIGHT=UNDERLINE,                                      X00040612
               COLOR=GREEN                                              00040712
        DFHMDF POS=(12,04),                                            X00040819
               LENGTH=01,                                              X00040918
               ATTRB=(ASKIP)                                            00041018
AACT06  DFHMDF POS=(12,06),                                            X00041118
               LENGTH=03,                                              X00041212
               ATTRB=(ASKIP,NORM),                                     X00041312
               COLOR=BLUE                                               00041412
ASKU06  DFHMDF POS=(12,10),                                            X00041812
               LENGTH=08,                                              X00041912
               ATTRB=(UNPROT,NORM),                                    X00042012
               PICOUT='ZZZZZZZZ',                                      X00042112
               HILIGHT=UNDERLINE,                                      X00042212
               COLOR=GREEN                                              00042312
        DFHMDF POS=(12,19),                                            X00042412
               LENGTH=01,                                              X00042512
               ATTRB=(ASKIP)                                            00042612
AUNT06 DFHMDF  POS=(12,21),                                            X00042712
               LENGTH=05,                                              X00042812
               ATTRB=(UNPROT,NORM),                                    X00042912
               PICOUT='ZZZZZ',                                         X00043012
               HILIGHT=UNDERLINE,                                      X00043112
               COLOR=GREEN                                              00043212
AAUNT06 DFHMDF POS=(12,27),                                            X00043312
               LENGTH=05,                                              X00043412
               ATTRB=(ASKIP),                                          X00043512
               PICOUT='ZZZZZ',                                         X00043612
               COLOR=BLUE                                               00043712
ALNE06  DFHMDF POS=(12,33),                                            X00044512
               LENGTH=04,                                              X00044612
               ATTRB=(ASKIP),                                          X00044712
               PICOUT='ZZZZ',                                          X00044812
               COLOR=BLUE                                               00044912
ADESC06 DFHMDF POS=(12,38),                                            X00045012
               LENGTH=25,                                              X00045112
               ATTRB=(ASKIP,NORM),                                     X00045212
               COLOR=BLUE                                               00045312
ARETL06 DFHMDF POS=(12,65),                                            X00045412
               LENGTH=08,                                              X00045512
               ATTRB=(ASKIP,NORM),                                     X00045612
               PICOUT='ZZZZZ.99',                                      X00045712
               COLOR=BLUE                                               00045812
******************************************************************      00045912
ASEL07  DFHMDF POS=(13,02),                                            X00046012
               LENGTH=01,                                              X00046112
               ATTRB=(UNPROT,NORM),                                    X00046212
               HILIGHT=UNDERLINE,                                      X00046312
               COLOR=GREEN                                              00046412
        DFHMDF POS=(13,04),                                            X00046519
               LENGTH=01,                                              X00046618
               ATTRB=(ASKIP)                                            00046718
AACT07  DFHMDF POS=(13,06),                                            X00046818
               LENGTH=03,                                              X00046912
               ATTRB=(ASKIP,NORM),                                     X00047012
               COLOR=BLUE                                               00047112
ASKU07  DFHMDF POS=(13,10),                                            X00047512
               LENGTH=08,                                              X00047612
               ATTRB=(UNPROT,NORM),                                    X00047712
               PICOUT='ZZZZZZZZ',                                      X00047812
               HILIGHT=UNDERLINE,                                      X00047912
               COLOR=GREEN                                              00048012
        DFHMDF POS=(13,19),                                            X00048112
               LENGTH=01,                                              X00048212
               ATTRB=(ASKIP)                                            00048312
AUNT07 DFHMDF  POS=(13,21),                                            X00048412
               LENGTH=05,                                              X00048512
               ATTRB=(UNPROT,NORM),                                    X00048612
               PICOUT='ZZZZZ',                                         X00048712
               HILIGHT=UNDERLINE,                                      X00048812
               COLOR=GREEN                                              00048912
AAUNT07 DFHMDF POS=(13,27),                                            X00049012
               LENGTH=05,                                              X00049112
               ATTRB=(ASKIP),                                          X00049212
               PICOUT='ZZZZZ',                                         X00049312
               COLOR=BLUE                                               00049412
ALNE07  DFHMDF POS=(13,33),                                            X00050112
               LENGTH=04,                                              X00050212
               ATTRB=(ASKIP),                                          X00050312
               PICOUT='ZZZZ',                                          X00050412
               COLOR=BLUE                                               00050512
ADESC07 DFHMDF POS=(13,38),                                            X00050612
               LENGTH=25,                                              X00050712
               ATTRB=(ASKIP,NORM),                                     X00050812
               COLOR=BLUE                                               00050912
ARETL07 DFHMDF POS=(13,65),                                            X00051012
               LENGTH=08,                                              X00051112
               ATTRB=(ASKIP,NORM),                                     X00051212
               PICOUT='ZZZZZ.99',                                      X00051312
               COLOR=BLUE                                               00051412
******************************************************************      00051512
ASEL08  DFHMDF POS=(14,02),                                            X00051612
               LENGTH=01,                                              X00051712
               ATTRB=(UNPROT,NORM),                                    X00051812
               HILIGHT=UNDERLINE,                                      X00051912
               COLOR=GREEN                                              00052012
        DFHMDF POS=(14,04),                                            X00052119
               LENGTH=01,                                              X00052218
               ATTRB=(ASKIP)                                            00052318
AACT08  DFHMDF POS=(14,06),                                            X00052418
               LENGTH=03,                                              X00052512
               ATTRB=(ASKIP,NORM),                                     X00052612
               COLOR=BLUE                                               00052712
ASKU08  DFHMDF POS=(14,10),                                            X00053112
               LENGTH=08,                                              X00053212
               ATTRB=(UNPROT,NORM),                                    X00053312
               PICOUT='ZZZZZZZZ',                                      X00053412
               HILIGHT=UNDERLINE,                                      X00053512
               COLOR=GREEN                                              00053612
        DFHMDF POS=(14,19),                                            X00053712
               LENGTH=01,                                              X00053812
               ATTRB=(ASKIP)                                            00053912
AUNT08 DFHMDF  POS=(14,21),                                            X00054012
               LENGTH=05,                                              X00054112
               ATTRB=(UNPROT,NORM),                                    X00054212
               PICOUT='ZZZZZ',                                         X00054312
               HILIGHT=UNDERLINE,                                      X00054412
               COLOR=GREEN                                              00054512
AAUNT08 DFHMDF POS=(14,27),                                            X00054612
               LENGTH=05,                                              X00054712
               ATTRB=(ASKIP),                                          X00054812
               PICOUT='ZZZZZ',                                         X00054912
               COLOR=BLUE                                               00055012
ALNE08  DFHMDF POS=(14,33),                                            X00055712
               LENGTH=04,                                              X00055812
               ATTRB=(ASKIP),                                          X00055912
               PICOUT='ZZZZ',                                          X00056012
               COLOR=BLUE                                               00056112
ADESC08 DFHMDF POS=(14,38),                                            X00056212
               LENGTH=25,                                              X00056312
               ATTRB=(ASKIP,NORM),                                     X00056412
               COLOR=BLUE                                               00056512
ARETL08 DFHMDF POS=(14,65),                                            X00056612
               LENGTH=08,                                              X00056712
               ATTRB=(ASKIP,NORM),                                     X00056812
               PICOUT='ZZZZZ.99',                                      X00056912
               COLOR=BLUE                                               00057012
******************************************************************      00057112
ASEL09  DFHMDF POS=(15,02),                                            X00057212
               LENGTH=01,                                              X00057312
               ATTRB=(UNPROT,NORM),                                    X00057412
               HILIGHT=UNDERLINE,                                      X00057512
               COLOR=GREEN                                              00057612
        DFHMDF POS=(15,04),                                            X00057719
               LENGTH=01,                                              X00057818
               ATTRB=(ASKIP)                                            00057918
AACT09  DFHMDF POS=(15,06),                                            X00058018
               LENGTH=03,                                              X00058112
               ATTRB=(ASKIP,NORM),                                     X00058212
               COLOR=BLUE                                               00058312
ASKU09  DFHMDF POS=(15,10),                                            X00058712
               LENGTH=08,                                              X00058812
               ATTRB=(UNPROT,NORM),                                    X00058912
               PICOUT='ZZZZZZZZ',                                      X00059012
               HILIGHT=UNDERLINE,                                      X00059112
               COLOR=GREEN                                              00059212
        DFHMDF POS=(15,19),                                            X00059312
               LENGTH=01,                                              X00059412
               ATTRB=(ASKIP)                                            00059512
AUNT09 DFHMDF  POS=(15,21),                                            X00059612
               LENGTH=05,                                              X00059712
               ATTRB=(UNPROT,NORM),                                    X00059812
               PICOUT='ZZZZZ',                                         X00059912
               HILIGHT=UNDERLINE,                                      X00060012
               COLOR=GREEN                                              00060112
AAUNT09 DFHMDF POS=(15,27),                                            X00060212
               LENGTH=05,                                              X00060312
               ATTRB=(ASKIP),                                          X00060412
               PICOUT='ZZZZZ',                                         X00060512
               COLOR=BLUE                                               00060612
ALNE09  DFHMDF POS=(15,33),                                            X00061312
               LENGTH=04,                                              X00061412
               ATTRB=(ASKIP),                                          X00061512
               PICOUT='ZZZZ',                                          X00061612
               COLOR=BLUE                                               00061712
ADESC09 DFHMDF POS=(15,38),                                            X00061812
               LENGTH=25,                                              X00061912
               ATTRB=(ASKIP,NORM),                                     X00062012
               COLOR=BLUE                                               00062112
ARETL09 DFHMDF POS=(15,65),                                            X00062212
               LENGTH=08,                                              X00062312
               ATTRB=(ASKIP,NORM),                                     X00062412
               PICOUT='ZZZZZ.99',                                      X00062512
               COLOR=BLUE                                               00062612
******************************************************************      00062712
ASEL10  DFHMDF POS=(16,02),                                            X00062812
               LENGTH=01,                                              X00062912
               ATTRB=(UNPROT,NORM),                                    X00063012
               HILIGHT=UNDERLINE,                                      X00063112
               COLOR=GREEN                                              00063212
        DFHMDF POS=(16,04),                                            X00063319
               LENGTH=01,                                              X00063418
               ATTRB=(ASKIP)                                            00063518
AACT10  DFHMDF POS=(16,06),                                            X00063618
               LENGTH=03,                                              X00063712
               ATTRB=(ASKIP,NORM),                                     X00063812
               COLOR=BLUE                                               00063912
ASKU10  DFHMDF POS=(16,10),                                            X00064312
               LENGTH=08,                                              X00064412
               ATTRB=(UNPROT,NORM),                                    X00064512
               PICOUT='ZZZZZZZZ',                                      X00064612
               HILIGHT=UNDERLINE,                                      X00064712
               COLOR=GREEN                                              00064812
        DFHMDF POS=(16,19),                                            X00064912
               LENGTH=01,                                              X00065012
               ATTRB=(ASKIP)                                            00065112
AUNT10  DFHMDF POS=(16,21),                                            X00065212
               LENGTH=05,                                              X00065312
               ATTRB=(UNPROT,NORM),                                    X00065412
               PICOUT='ZZZZZ',                                         X00065512
               HILIGHT=UNDERLINE,                                      X00065612
               COLOR=GREEN                                              00065712
AAUNT10 DFHMDF POS=(16,27),                                            X00065812
               LENGTH=05,                                              X00065912
               ATTRB=(ASKIP),                                          X00066012
               PICOUT='ZZZZZ',                                         X00066112
               COLOR=BLUE                                               00066212
ALNE10  DFHMDF POS=(16,33),                                            X00066312
               LENGTH=04,                                              X00066412
               ATTRB=(ASKIP),                                          X00066512
               PICOUT='ZZZZ',                                          X00066612
               COLOR=BLUE                                               00066712
ADESC10 DFHMDF POS=(16,38),                                            X00066812
               LENGTH=25,                                              X00066912
               ATTRB=(ASKIP,NORM),                                     X00067012
               COLOR=BLUE                                               00067112
ARETL10 DFHMDF POS=(16,65),                                            X00067212
               LENGTH=08,                                              X00067312
               ATTRB=(ASKIP,NORM),                                     X00067412
               PICOUT='ZZZZZ.99',                                      X00067512
               COLOR=BLUE                                               00067612
******************************************************************      00067712
ASEL11  DFHMDF POS=(17,02),                                            X00067812
               LENGTH=01,                                              X00067912
               ATTRB=(UNPROT,NORM),                                    X00068012
               HILIGHT=UNDERLINE,                                      X00068112
               COLOR=GREEN                                              00068212
        DFHMDF POS=(17,04),                                            X00068319
               LENGTH=01,                                              X00068418
               ATTRB=(ASKIP)                                            00068518
AACT11  DFHMDF POS=(17,06),                                            X00068618
               LENGTH=03,                                              X00068712
               ATTRB=(ASKIP,NORM),                                     X00068812
               COLOR=BLUE                                               00068912
ASKU11  DFHMDF POS=(17,10),                                            X00069312
               LENGTH=08,                                              X00069412
               ATTRB=(UNPROT,NORM),                                    X00069512
               PICOUT='ZZZZZZZZ',                                      X00069612
               HILIGHT=UNDERLINE,                                      X00069712
               COLOR=GREEN                                              00069812
        DFHMDF POS=(17,19),                                            X00069912
               LENGTH=01,                                              X00070012
               ATTRB=(ASKIP)                                            00070112
AUNT11  DFHMDF POS=(17,21),                                            X00070212
               LENGTH=05,                                              X00070312
               ATTRB=(UNPROT,NORM),                                    X00070412
               PICOUT='ZZZZZ',                                         X00070512
               HILIGHT=UNDERLINE,                                      X00070612
               COLOR=GREEN                                              00070712
AAUNT11 DFHMDF POS=(17,27),                                            X00070812
               LENGTH=05,                                              X00070912
               ATTRB=(ASKIP),                                          X00071012
               PICOUT='ZZZZZ',                                         X00071112
               COLOR=BLUE                                               00071212
ALNE11  DFHMDF POS=(17,33),                                            X00071312
               LENGTH=04,                                              X00071412
               ATTRB=(ASKIP),                                          X00071512
               PICOUT='ZZZZ',                                          X00071612
               COLOR=BLUE                                               00071712
ADESC11 DFHMDF POS=(17,38),                                            X00071812
               LENGTH=25,                                              X00071912
               ATTRB=(ASKIP,NORM),                                     X00072012
               COLOR=BLUE                                               00072112
ARETL11 DFHMDF POS=(17,65),                                            X00072212
               LENGTH=08,                                              X00072312
               ATTRB=(ASKIP,NORM),                                     X00072412
               PICOUT='ZZZZZ.99',                                      X00072512
               COLOR=BLUE                                               00072612
******************************************************************      00072712
ASEL12  DFHMDF POS=(18,02),                                            X00072812
               LENGTH=01,                                              X00072912
               ATTRB=(UNPROT,NORM),                                    X00073012
               HILIGHT=UNDERLINE,                                      X00073112
               COLOR=GREEN                                              00073212
        DFHMDF POS=(18,04),                                            X00073319
               LENGTH=01,                                              X00073418
               ATTRB=(ASKIP)                                            00073518
AACT12  DFHMDF POS=(18,06),                                            X00073618
               LENGTH=03,                                              X00073712
               ATTRB=(ASKIP,NORM),                                     X00073812
               COLOR=BLUE                                               00073912
ASKU12  DFHMDF POS=(18,10),                                            X00074312
               LENGTH=08,                                              X00074412
               ATTRB=(UNPROT,NORM),                                    X00074512
               PICOUT='ZZZZZZZZ',                                      X00074612
               HILIGHT=UNDERLINE,                                      X00074712
               COLOR=GREEN                                              00074812
        DFHMDF POS=(18,19),                                            X00074912
               LENGTH=01,                                              X00075012
               ATTRB=(ASKIP)                                            00075112
AUNT12  DFHMDF POS=(18,21),                                            X00075212
               LENGTH=05,                                              X00075312
               ATTRB=(UNPROT,NORM),                                    X00075412
               PICOUT='ZZZZZ',                                         X00075512
               HILIGHT=UNDERLINE,                                      X00075612
               COLOR=GREEN                                              00075712
AAUNT12 DFHMDF POS=(18,27),                                            X00075812
               LENGTH=05,                                              X00075912
               ATTRB=(ASKIP),                                          X00076012
               PICOUT='ZZZZZ',                                         X00076112
               COLOR=BLUE                                               00076212
ALNE12  DFHMDF POS=(18,33),                                            X00076312
               LENGTH=04,                                              X00076412
               ATTRB=(ASKIP),                                          X00076512
               PICOUT='ZZZZ',                                          X00076612
               COLOR=BLUE                                               00076712
ADESC12 DFHMDF POS=(18,38),                                            X00076812
               LENGTH=25,                                              X00076912
               ATTRB=(ASKIP,NORM),                                     X00077012
               COLOR=BLUE                                               00077112
ARETL12 DFHMDF POS=(18,65),                                            X00077212
               LENGTH=08,                                              X00077312
               ATTRB=(ASKIP,NORM),                                     X00077412
               PICOUT='ZZZZZ.99',                                      X00077512
               COLOR=BLUE                                               00077612
******************************************************************      00077712
******************************************************************      00077812
        DFHMDF POS=(19,45),                                            X00077912
               LENGTH=25,                                              X00078012
               ATTRB=(ASKIP,NORM),                                     X00078112
               COLOR=NEUTRAL,                                          X00078212
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00078312
ASELIT  DFHMDF POS=(19,72),                                            X00078412
               LENGTH=07,                                              X00078512
               ATTRB=(ASKIP,NORM),                                     X00078612
               COLOR=BLUE,                                             X00078712
               PICOUT='ZZZ,ZZ9'                                         00078812
        DFHMSD TYPE=FINAL                                               00079012
        END                                                             00080002
