*********************************************************************** 00000100
*                                                                       00000200
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00000300
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00000400
*********************************************************************** 00000500
        PRINT  NOGEN                                                    00000600
CEKM602 DFHMSD TYPE=DSECT,                                             X00000700
               LANG=COBOL,                                             X00000800
               MODE=INOUT,                                             X00000900
               STORAGE=AUTO,                                           X00001000
               TERM=3270-2,                                            X00002000
               TIOAPFX=YES                                              00003000
*****************************************************************       00004000
CE602A  DFHMDI LINE=2,COLUMN=1,                                        X00005000
               SIZE=(19,80),                                           X00006000
               CTRL=(FREEKB),                                          X00007000
               MAPATTS=(COLOR,HILIGHT),                                X00008000
               DSATTS=(COLOR,HILIGHT)                                   00009000
*****************************************************************       00010000
        DFHMDF POS=(02,01),                                            X00020000
               LENGTH=15,                                              X00030000
               ATTRB=(ASKIP,NORM),                                     X00040000
               COLOR=NEUTRAL,                                          X00050000
               INITIAL='CS LOCATION...:'                                00060000
ALOCID  DFHMDF POS=(02,21),                                            X00070000
               LENGTH=04,                                              X00080000
               ATTRB=(ASKIP,NORM),                                     X00090000
               COLOR=BLUE                                               00100000
        DFHMDF POS=(02,56),                                            X00110000
               LENGTH=14,                                              X00120000
               ATTRB=(ASKIP,NORM),                                     X00130000
               COLOR=NEUTRAL,                                          X00140000
               INITIAL='PRINTER ID...:'                                 00150000
APRTID  DFHMDF POS=(02,71),                                            X00160000
               LENGTH=08,                                              X00170000
               ATTRB=(UNPROT,NORM),                                    X00180000
               COLOR=GREEN,                                            X00190000
               HILIGHT=UNDERLINE                                        00200000
**************************************************************          00210000
        DFHMDF POS=(02,80),                                            X00220000
               LENGTH=16,                                              X00230000
               ATTRB=(ASKIP,NORM),                                     X00240000
               COLOR=NEUTRAL,                                          X00250000
               INITIAL=' PULL NUMBER...:'                               00260000
APULNO  DFHMDF POS=(03,17),                                            X00270000
               LENGTH=08,                                              X00280000
               PICOUT='ZZZZZZZZ',                                      X00290000
               ATTRB=(ASKIP,NORM),                                     X00300000
               COLOR=BLUE                                               00310000
        DFHMDF POS=(03,28),                                            X00320000
               LENGTH=15,                                              X00330000
               ATTRB=(ASKIP,NORM),                                     X00340000
               COLOR=NEUTRAL,                                          X00350000
               INITIAL='PULL STATUS...:'                                00360000
APULST  DFHMDF POS=(03,44),                                            X00370000
               LENGTH=08,                                              X00380000
               ATTRB=(ASKIP,NORM),                                     X00390000
               COLOR=BLUE                                               00400000
        DFHMDF POS=(03,56),                                            X00410000
               LENGTH=14,                                              X00420000
               ATTRB=(ASKIP,NORM),                                     X00430000
               COLOR=NEUTRAL,                                          X00440000
               INITIAL='PULL SOURCE..:'                                 00450000
APLSRC  DFHMDF POS=(03,71),                                            X00460000
               LENGTH=08,                                              X00470000
               ATTRB=(ASKIP,NORM),                                     X00480000
               COLOR=BLUE                                               00490000
****************************************************************        00500000
        DFHMDF POS=(04,01),                                            X00510000
               LENGTH=15,                                              X00520000
               ATTRB=(ASKIP,NORM),                                     X00530000
               COLOR=NEUTRAL,                                          X00540000
               INITIAL='REQ PULL UNITS:'                                00550000
ARQUNT  DFHMDF POS=(04,19),                                            X00560000
               LENGTH=06,                                              X00570000
               ATTRB=(ASKIP,NORM),                                     X00580000
               PICOUT='ZZZZZ9',                                        X00590000
               COLOR=BLUE                                               00600000
        DFHMDF POS=(04,28),                                            X00610000
               LENGTH=15,                                              X00620000
               ATTRB=(ASKIP,NORM),                                     X00630000
               COLOR=NEUTRAL,                                          X00640000
               INITIAL='DISTRB UNITS..:'                                00650000
ADSUNT  DFHMDF POS=(04,46),                                            X00660000
               LENGTH=07,                                              X00670000
               ATTRB=(ASKIP,NORM),                                     X00680000
               PICOUT='ZZZZZ9-',                                       X00690000
               COLOR=BLUE                                               00700000
        DFHMDF POS=(04,56),                                            X00710000
               LENGTH=14,                                              X00720000
               ATTRB=(ASKIP,NORM),                                     X00730000
               COLOR=NEUTRAL,                                          X00740000
               INITIAL='UNIT VARIANCE:'                                 00750000
AVRUNT  DFHMDF POS=(04,71),                                            X00760000
               LENGTH=07,                                              X00770000
               ATTRB=(ASKIP,NORM),                                     X00780000
               PICOUT='ZZZZZZ-',                                       X00790000
               COLOR=BLUE                                               00800000
******************************************************************      00810000
        DFHMDF POS=(05,01),                                            X00820000
               LENGTH=15,                                              X00830000
               ATTRB=(ASKIP,NORM),                                     X00840000
               COLOR=NEUTRAL,                                          X00850000
               INITIAL='REF NUMBER....:'                                00860000
AREFNO  DFHMDF POS=(05,17),                                            X00870000
               LENGTH=15,                                              X00880000
               ATTRB=(ASKIP,NORM),                                     X00890000
               COLOR=BLUE                                               00900000
        DFHMDF POS=(05,50),                                            X00910000
               LENGTH=05,                                              X00920000
               ATTRB=(ASKIP,NORM),                                     X00930000
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00940000
ASTRTIT DFHMDF POS=(05,56),                                            X00950000
               LENGTH=05,                                              X00960000
               ATTRB=(NUM,UNPROT,NORM),                                X00970000
               COLOR=GREEN,                                            X00980000
               PICOUT='ZZZZ9',                                         X00990000
               HILIGHT=UNDERLINE                                        01000000
        DFHMDF POS=(05,62),                                            X01010000
               LENGTH=02,                                              X01020000
               ATTRB=(ASKIP,NORM),                                     X01030000
               COLOR=NEUTRAL,                                          X01040000
               INITIAL='TO'                                             01050000
AENDIT  DFHMDF POS=(05,65),                                            X01060000
               LENGTH=05,                                              X01070000
               ATTRB=(ASKIP,NORM),                                     X01080000
               COLOR=BLUE,                                             X01090000
               PICOUT='ZZZZ9'                                           01100000
        DFHMDF POS=(05,71),                                            X01110000
               LENGTH=02,                                              X01120000
               ATTRB=(ASKIP,NORM),                                     X01130000
               COLOR=NEUTRAL,                                          X01140000
               INITIAL='OF'                                             01150000
ATOTIT  DFHMDF POS=(05,74),                                            X01160000
               LENGTH=05,                                              X01170000
               ATTRB=(ASKIP,NORM),                                     X01180000
               COLOR=BLUE,                                             X01190000
               PICOUT='ZZZZ9'                                           01200000
******************************************************************      01210000
        DFHMDF POS=(06,55),                                            X01220000
               LENGTH=03,                                              X01230000
               ATTRB=(ASKIP,NORM),                                     X01240000
               COLOR=NEUTRAL,                                          X01250000
               INITIAL='REQ'                                            01260000
******************************************************************      01270000
        DFHMDF POS=(07,07),                                            X01280000
               LENGTH=11,                                              X01290000
               ATTRB=(ASKIP,NORM),                                     X01300000
               COLOR=NEUTRAL,                                          X01310000
               INITIAL='LINE    SKU'                                    01320000
        DFHMDF POS=(07,29),                                            X01330000
               LENGTH=03,                                              X01340000
               ATTRB=(ASKIP,NORM),                                     X01350000
               COLOR=NEUTRAL,                                          X01360000
               INITIAL='SKU'                                            01370000
        DFHMDF POS=(07,41),                                            X01380000
               LENGTH=33,                                              X01390000
               ATTRB=(ASKIP,NORM),                                     X01400000
               COLOR=NEUTRAL,                                          X01410000
               INITIAL='LINE   NBR    PULL DISTRB    UNIT'              01420000
******************************************************************      01430000
        DFHMDF POS=(08,01),                                            X01440000
               LENGTH=19,                                              X01450000
               ATTRB=(ASKIP,NORM),                                     X01460000
               COLOR=NEUTRAL,                                          X01470000
               INITIAL='S ACT NBR    NUMBER'                            01480000
        DFHMDF POS=(08,25),                                            X01490000
               LENGTH=11,                                              X01500000
               ATTRB=(ASKIP,NORM),                                     X01510000
               COLOR=NEUTRAL,                                          X01520000
               INITIAL='DESCRIPTION'                                    01530000
        DFHMDF POS=(08,40),                                            X01540000
               LENGTH=26,                                              X01550000
               ATTRB=(ASKIP,NORM),                                     X01560000
               COLOR=NEUTRAL,                                          X01570000
               INITIAL='STATUS  STRS  UNITS  UNITS'                     01580000
        DFHMDF POS=(08,71),                                            X01590000
               LENGTH=09,                                              X01600000
               ATTRB=(ASKIP,NORM),                                     X01610000
               COLOR=NEUTRAL,                                          X01620000
               INITIAL='VAR   ADJ'                                      01630000
******************************************************************      01640000
ASEL01  DFHMDF POS=(09,01),                                            X01650000
               LENGTH=01,                                              X01660000
               ATTRB=(UNPROT,NORM),                                    X01670000
               HILIGHT=UNDERLINE,                                      X01680000
               COLOR=GREEN                                              01690000
AACT01  DFHMDF POS=(09,03),                                            X01700000
               LENGTH=03,                                              X01710000
               ATTRB=(ASKIP,NORM),                                     X01720000
               COLOR=BLUE                                               01730000
APLNE01 DFHMDF POS=(09,07),                                            X01740000
               LENGTH=04,                                              X01750000
               ATTRB=(ASKIP,NORM),                                     X01751000
               PICOUT='ZZZZ',                                          X01752000
               COLOR=BLUE                                               01753000
ASKU01  DFHMDF POS=(09,13),                                            X01754001
               LENGTH=08,                                              X01755001
               ATTRB=(ASKIP,NORM),                                     X01756000
               COLOR=BLUE                                               01757000
ADESC01 DFHMDF POS=(09,23),                                            X01758000
               LENGTH=15,                                              X01759000
               ATTRB=(ASKIP,NORM),                                     X01760000
               COLOR=BLUE                                               01760100
ALNST01 DFHMDF POS=(09,39),                                            X01760200
               LENGTH=08,                                              X01760300
               ATTRB=(ASKIP,NORM),                                     X01760400
               COLOR=BLUE                                               01760500
ASTRS01 DFHMDF POS=(09,48),                                            X01760600
               LENGTH=04,                                              X01760700
               ATTRB=(ASKIP,NORM),                                     X01760800
               PICOUT='ZZZZ',                                          X01760900
               COLOR=BLUE                                               01761000
ARUNT01 DFHMDF POS=(09,54),                                            X01761100
               LENGTH=05,                                              X01761200
               ATTRB=(ASKIP,NORM),                                     X01761300
               PICOUT='ZZZZZ',                                         X01761400
               COLOR=BLUE                                               01761500
ADUNT01 DFHMDF POS=(09,61),                                            X01761600
               LENGTH=06,                                              X01761700
               ATTRB=(ASKIP,NORM),                                     X01761800
               PICOUT='ZZZZZ-',                                        X01761900
               COLOR=BLUE                                               01762000
AVAR01  DFHMDF POS=(09,69),                                            X01762100
               LENGTH=06,                                              X01762200
               ATTRB=(ASKIP,NORM),                                     X01762300
               PICOUT='ZZZZZ-',                                        X01762400
               COLOR=BLUE                                               01762500
AADJ01  DFHMDF POS=(09,77),                                            X01762600
               LENGTH=03,                                              X01762700
               ATTRB=(ASKIP,NORM),                                     X01762800
               COLOR=BLUE                                               01762900
******************************************************************      01763000
ASEL02  DFHMDF POS=(10,01),                                            X01763100
               LENGTH=01,                                              X01763200
               ATTRB=(UNPROT,NORM),                                    X01763300
               HILIGHT=UNDERLINE,                                      X01763400
               COLOR=GREEN                                              01763500
AACT02  DFHMDF POS=(10,03),                                            X01763600
               LENGTH=03,                                              X01763700
               ATTRB=(ASKIP,NORM),                                     X01763800
               COLOR=BLUE                                               01763900
APLNE02 DFHMDF POS=(10,07),                                            X01764000
               LENGTH=04,                                              X01764100
               ATTRB=(ASKIP,NORM),                                     X01764200
               PICOUT='ZZZZ',                                          X01764300
               COLOR=BLUE                                               01764400
ASKU02  DFHMDF POS=(10,13),                                            X01764501
               LENGTH=08,                                              X01764601
               ATTRB=(ASKIP,NORM),                                     X01764700
               COLOR=BLUE                                               01764800
ADESC02 DFHMDF POS=(10,23),                                            X01764900
               LENGTH=15,                                              X01765000
               ATTRB=(ASKIP,NORM),                                     X01765100
               COLOR=BLUE                                               01765200
ALNST02 DFHMDF POS=(10,39),                                            X01765300
               LENGTH=08,                                              X01765400
               ATTRB=(ASKIP,NORM),                                     X01765500
               COLOR=BLUE                                               01765600
ASTRS02 DFHMDF POS=(10,48),                                            X01765700
               LENGTH=04,                                              X01765800
               ATTRB=(ASKIP,NORM),                                     X01765900
               PICOUT='ZZZZ',                                          X01766000
               COLOR=BLUE                                               01766100
ARUNT02 DFHMDF POS=(10,54),                                            X01766200
               LENGTH=05,                                              X01766300
               ATTRB=(ASKIP,NORM),                                     X01766400
               PICOUT='ZZZZZ',                                         X01766500
               COLOR=BLUE                                               01766600
ADUNT02 DFHMDF POS=(10,61),                                            X01766700
               LENGTH=06,                                              X01766800
               ATTRB=(ASKIP,NORM),                                     X01766900
               PICOUT='ZZZZZ-',                                        X01767000
               COLOR=BLUE                                               01767100
AVAR02  DFHMDF POS=(10,69),                                            X01767200
               LENGTH=06,                                              X01767300
               ATTRB=(ASKIP,NORM),                                     X01767400
               PICOUT='ZZZZZ-',                                        X01767500
               COLOR=BLUE                                               01767600
AADJ02  DFHMDF POS=(10,77),                                            X01767700
               LENGTH=03,                                              X01767800
               ATTRB=(ASKIP,NORM),                                     X01767900
               COLOR=BLUE                                               01768000
******************************************************************      01768100
ASEL03  DFHMDF POS=(11,01),                                            X01768200
               LENGTH=01,                                              X01768300
               ATTRB=(UNPROT,NORM),                                    X01768400
               HILIGHT=UNDERLINE,                                      X01768500
               COLOR=GREEN                                              01768600
AACT03  DFHMDF POS=(11,03),                                            X01768700
               LENGTH=03,                                              X01768800
               ATTRB=(ASKIP,NORM),                                     X01768900
               COLOR=BLUE                                               01769000
APLNE03 DFHMDF POS=(11,07),                                            X01769100
               LENGTH=04,                                              X01769200
               ATTRB=(ASKIP,NORM),                                     X01769300
               PICOUT='ZZZZ',                                          X01769400
               COLOR=BLUE                                               01769500
ASKU03  DFHMDF POS=(11,13),                                            X01769601
               LENGTH=08,                                              X01769701
               ATTRB=(ASKIP,NORM),                                     X01769800
               COLOR=BLUE                                               01769900
ADESC03 DFHMDF POS=(11,23),                                            X01770000
               LENGTH=15,                                              X01770100
               ATTRB=(ASKIP,NORM),                                     X01770200
               COLOR=BLUE                                               01770300
ALNST03 DFHMDF POS=(11,39),                                            X01770400
               LENGTH=08,                                              X01770500
               ATTRB=(ASKIP,NORM),                                     X01770600
               COLOR=BLUE                                               01770700
ASTRS03 DFHMDF POS=(11,48),                                            X01770800
               LENGTH=04,                                              X01770900
               ATTRB=(ASKIP,NORM),                                     X01771000
               PICOUT='ZZZZ',                                          X01771100
               COLOR=BLUE                                               01771200
ARUNT03 DFHMDF POS=(11,54),                                            X01771300
               LENGTH=05,                                              X01771400
               ATTRB=(ASKIP,NORM),                                     X01771500
               PICOUT='ZZZZZ',                                         X01771600
               COLOR=BLUE                                               01771700
ADUNT03 DFHMDF POS=(11,61),                                            X01771800
               LENGTH=06,                                              X01771900
               ATTRB=(ASKIP,NORM),                                     X01772000
               PICOUT='ZZZZZ-',                                        X01772100
               COLOR=BLUE                                               01772200
AVAR03  DFHMDF POS=(11,69),                                            X01772300
               LENGTH=06,                                              X01772400
               ATTRB=(ASKIP,NORM),                                     X01772500
               PICOUT='ZZZZZ-',                                        X01772600
               COLOR=BLUE                                               01772700
AADJ03  DFHMDF POS=(11,77),                                            X01772800
               LENGTH=03,                                              X01772900
               ATTRB=(ASKIP,NORM),                                     X01773000
               COLOR=BLUE                                               01773100
******************************************************************      01773200
ASEL04  DFHMDF POS=(12,01),                                            X01773300
               LENGTH=01,                                              X01773400
               ATTRB=(UNPROT,NORM),                                    X01773500
               HILIGHT=UNDERLINE,                                      X01773600
               COLOR=GREEN                                              01773700
AACT04  DFHMDF POS=(12,03),                                            X01773800
               LENGTH=03,                                              X01773900
               ATTRB=(ASKIP,NORM),                                     X01774000
               COLOR=BLUE                                               01774100
APLNE04 DFHMDF POS=(12,07),                                            X01774200
               LENGTH=04,                                              X01774300
               ATTRB=(ASKIP,NORM),                                     X01774400
               PICOUT='ZZZZ',                                          X01774500
               COLOR=BLUE                                               01774600
ASKU04  DFHMDF POS=(12,13),                                            X01774701
               LENGTH=08,                                              X01774801
               ATTRB=(ASKIP,NORM),                                     X01774900
               COLOR=BLUE                                               01775000
ADESC04 DFHMDF POS=(12,23),                                            X01775100
               LENGTH=15,                                              X01775200
               ATTRB=(ASKIP,NORM),                                     X01775300
               COLOR=BLUE                                               01775400
ALNST04 DFHMDF POS=(12,39),                                            X01775500
               LENGTH=08,                                              X01775600
               ATTRB=(ASKIP,NORM),                                     X01775700
               COLOR=BLUE                                               01775800
ASTRS04 DFHMDF POS=(12,48),                                            X01775900
               LENGTH=04,                                              X01776000
               ATTRB=(ASKIP,NORM),                                     X01776100
               PICOUT='ZZZZ',                                          X01776200
               COLOR=BLUE                                               01776300
ARUNT04 DFHMDF POS=(12,54),                                            X01776400
               LENGTH=05,                                              X01776500
               ATTRB=(ASKIP,NORM),                                     X01776600
               PICOUT='ZZZZZ',                                         X01776700
               COLOR=BLUE                                               01776800
ADUNT04 DFHMDF POS=(12,61),                                            X01776900
               LENGTH=06,                                              X01777000
               ATTRB=(ASKIP,NORM),                                     X01777100
               PICOUT='ZZZZZ-',                                        X01777200
               COLOR=BLUE                                               01777300
AVAR04  DFHMDF POS=(12,69),                                            X01777400
               LENGTH=06,                                              X01777500
               ATTRB=(ASKIP,NORM),                                     X01777600
               PICOUT='ZZZZZ-',                                        X01777700
               COLOR=BLUE                                               01777800
AADJ04  DFHMDF POS=(12,77),                                            X01777900
               LENGTH=03,                                              X01778000
               ATTRB=(ASKIP,NORM),                                     X01778100
               COLOR=BLUE                                               01778200
******************************************************************      01778300
ASEL05  DFHMDF POS=(13,01),                                            X01778400
               LENGTH=01,                                              X01778500
               ATTRB=(UNPROT,NORM),                                    X01778600
               HILIGHT=UNDERLINE,                                      X01778700
               COLOR=GREEN                                              01778800
AACT05  DFHMDF POS=(13,03),                                            X01778900
               LENGTH=03,                                              X01779000
               ATTRB=(ASKIP,NORM),                                     X01779100
               COLOR=BLUE                                               01779200
APLNE05 DFHMDF POS=(13,07),                                            X01779300
               LENGTH=04,                                              X01779400
               ATTRB=(ASKIP,NORM),                                     X01779500
               PICOUT='ZZZZ',                                          X01779600
               COLOR=BLUE                                               01779700
ASKU05  DFHMDF POS=(13,13),                                            X01779801
               LENGTH=08,                                              X01779901
               ATTRB=(ASKIP,NORM),                                     X01780000
               COLOR=BLUE                                               01780100
ADESC05 DFHMDF POS=(13,23),                                            X01780200
               LENGTH=15,                                              X01780300
               ATTRB=(ASKIP,NORM),                                     X01780400
               COLOR=BLUE                                               01780500
ALNST05 DFHMDF POS=(13,39),                                            X01780600
               LENGTH=08,                                              X01780700
               ATTRB=(ASKIP,NORM),                                     X01780800
               COLOR=BLUE                                               01780900
ASTRS05 DFHMDF POS=(13,48),                                            X01781000
               LENGTH=04,                                              X01781100
               ATTRB=(ASKIP,NORM),                                     X01781200
               PICOUT='ZZZZ',                                          X01781300
               COLOR=BLUE                                               01781400
ARUNT05 DFHMDF POS=(13,54),                                            X01781500
               LENGTH=05,                                              X01781600
               ATTRB=(ASKIP,NORM),                                     X01781700
               PICOUT='ZZZZZ',                                         X01781800
               COLOR=BLUE                                               01781900
ADUNT05 DFHMDF POS=(13,61),                                            X01782000
               LENGTH=06,                                              X01782100
               ATTRB=(ASKIP,NORM),                                     X01782200
               PICOUT='ZZZZZ-',                                        X01782300
               COLOR=BLUE                                               01782400
AVAR05  DFHMDF POS=(13,69),                                            X01782500
               LENGTH=06,                                              X01782600
               ATTRB=(ASKIP,NORM),                                     X01782700
               PICOUT='ZZZZZ-',                                        X01782800
               COLOR=BLUE                                               01782900
AADJ05  DFHMDF POS=(13,77),                                            X01783000
               LENGTH=03,                                              X01783100
               ATTRB=(ASKIP,NORM),                                     X01783200
               COLOR=BLUE                                               01783300
******************************************************************      01783400
ASEL06  DFHMDF POS=(14,01),                                            X01783500
               LENGTH=01,                                              X01783600
               ATTRB=(UNPROT,NORM),                                    X01783700
               HILIGHT=UNDERLINE,                                      X01783800
               COLOR=GREEN                                              01783900
AACT06  DFHMDF POS=(14,03),                                            X01784000
               LENGTH=03,                                              X01784100
               ATTRB=(ASKIP,NORM),                                     X01784200
               COLOR=BLUE                                               01784300
APLNE06 DFHMDF POS=(14,07),                                            X01784400
               LENGTH=04,                                              X01784500
               ATTRB=(ASKIP,NORM),                                     X01784600
               PICOUT='ZZZZ',                                          X01784700
               COLOR=BLUE                                               01784800
ASKU06  DFHMDF POS=(14,13),                                            X01784901
               LENGTH=08,                                              X01785001
               ATTRB=(ASKIP,NORM),                                     X01785100
               COLOR=BLUE                                               01785200
ADESC06 DFHMDF POS=(14,23),                                            X01785300
               LENGTH=15,                                              X01785400
               ATTRB=(ASKIP,NORM),                                     X01785500
               COLOR=BLUE                                               01785600
ALNST06 DFHMDF POS=(14,39),                                            X01785700
               LENGTH=08,                                              X01785800
               ATTRB=(ASKIP,NORM),                                     X01785900
               COLOR=BLUE                                               01786000
ASTRS06 DFHMDF POS=(14,48),                                            X01786100
               LENGTH=04,                                              X01786200
               ATTRB=(ASKIP,NORM),                                     X01786300
               PICOUT='ZZZZ',                                          X01786400
               COLOR=BLUE                                               01786500
ARUNT06 DFHMDF POS=(14,54),                                            X01786600
               LENGTH=05,                                              X01786700
               ATTRB=(ASKIP,NORM),                                     X01786800
               PICOUT='ZZZZZ',                                         X01786900
               COLOR=BLUE                                               01787000
ADUNT06 DFHMDF POS=(14,61),                                            X01787100
               LENGTH=06,                                              X01787200
               ATTRB=(ASKIP,NORM),                                     X01787300
               PICOUT='ZZZZZ-',                                        X01787400
               COLOR=BLUE                                               01787500
AVAR06  DFHMDF POS=(14,69),                                            X01787600
               LENGTH=06,                                              X01787700
               ATTRB=(ASKIP,NORM),                                     X01787800
               PICOUT='ZZZZZ-',                                        X01787900
               COLOR=BLUE                                               01788000
AADJ06  DFHMDF POS=(14,77),                                            X01788100
               LENGTH=03,                                              X01788200
               ATTRB=(ASKIP,NORM),                                     X01788300
               COLOR=BLUE                                               01788400
******************************************************************      01788500
ASEL07  DFHMDF POS=(15,01),                                            X01788600
               LENGTH=01,                                              X01788700
               ATTRB=(UNPROT,NORM),                                    X01788800
               HILIGHT=UNDERLINE,                                      X01788900
               COLOR=GREEN                                              01789000
AACT07  DFHMDF POS=(15,03),                                            X01789100
               LENGTH=03,                                              X01789200
               ATTRB=(ASKIP,NORM),                                     X01789300
               COLOR=BLUE                                               01789400
APLNE07 DFHMDF POS=(15,07),                                            X01789500
               LENGTH=04,                                              X01789600
               ATTRB=(ASKIP,NORM),                                     X01789700
               PICOUT='ZZZZ',                                          X01789800
               COLOR=BLUE                                               01789900
ASKU07  DFHMDF POS=(15,13),                                            X01790001
               LENGTH=08,                                              X01790101
               ATTRB=(ASKIP,NORM),                                     X01790200
               COLOR=BLUE                                               01790300
ADESC07 DFHMDF POS=(15,23),                                            X01790400
               LENGTH=15,                                              X01790500
               ATTRB=(ASKIP,NORM),                                     X01790600
               COLOR=BLUE                                               01790700
ALNST07 DFHMDF POS=(15,39),                                            X01790800
               LENGTH=08,                                              X01790900
               ATTRB=(ASKIP,NORM),                                     X01791000
               COLOR=BLUE                                               01791100
ASTRS07 DFHMDF POS=(15,48),                                            X01791200
               LENGTH=04,                                              X01791300
               ATTRB=(ASKIP,NORM),                                     X01791400
               PICOUT='ZZZZ',                                          X01791500
               COLOR=BLUE                                               01791600
ARUNT07 DFHMDF POS=(15,54),                                            X01791700
               LENGTH=05,                                              X01791800
               ATTRB=(ASKIP,NORM),                                     X01791900
               PICOUT='ZZZZZ',                                         X01792000
               COLOR=BLUE                                               01792100
ADUNT07 DFHMDF POS=(15,61),                                            X01792200
               LENGTH=06,                                              X01792300
               ATTRB=(ASKIP,NORM),                                     X01792400
               PICOUT='ZZZZZ-',                                        X01792500
               COLOR=BLUE                                               01792600
AVAR07  DFHMDF POS=(15,69),                                            X01792700
               LENGTH=06,                                              X01792800
               ATTRB=(ASKIP,NORM),                                     X01792900
               PICOUT='ZZZZZ-',                                        X01793000
               COLOR=BLUE                                               01793100
AADJ07  DFHMDF POS=(15,77),                                            X01793200
               LENGTH=03,                                              X01793300
               ATTRB=(ASKIP,NORM),                                     X01793400
               COLOR=BLUE                                               01793500
******************************************************************      01793600
ASEL08  DFHMDF POS=(16,01),                                            X01793700
               LENGTH=01,                                              X01793800
               ATTRB=(UNPROT,NORM),                                    X01793900
               HILIGHT=UNDERLINE,                                      X01794000
               COLOR=GREEN                                              01794100
AACT08  DFHMDF POS=(16,03),                                            X01794200
               LENGTH=03,                                              X01794300
               ATTRB=(ASKIP,NORM),                                     X01794400
               COLOR=BLUE                                               01794500
APLNE08 DFHMDF POS=(16,07),                                            X01794600
               LENGTH=04,                                              X01794700
               ATTRB=(ASKIP,NORM),                                     X01794800
               PICOUT='ZZZZ',                                          X01794900
               COLOR=BLUE                                               01795000
ASKU08  DFHMDF POS=(16,13),                                            X01795101
               LENGTH=08,                                              X01795201
               ATTRB=(ASKIP,NORM),                                     X01795300
               COLOR=BLUE                                               01795400
ADESC08 DFHMDF POS=(16,23),                                            X01795500
               LENGTH=15,                                              X01795600
               ATTRB=(ASKIP,NORM),                                     X01795700
               COLOR=BLUE                                               01795800
ALNST08 DFHMDF POS=(16,39),                                            X01795900
               LENGTH=08,                                              X01796000
               ATTRB=(ASKIP,NORM),                                     X01796100
               COLOR=BLUE                                               01796200
ASTRS08 DFHMDF POS=(16,48),                                            X01796300
               LENGTH=04,                                              X01796400
               ATTRB=(ASKIP,NORM),                                     X01796500
               PICOUT='ZZZZ',                                          X01796600
               COLOR=BLUE                                               01796700
ARUNT08 DFHMDF POS=(16,54),                                            X01796800
               LENGTH=05,                                              X01796900
               ATTRB=(ASKIP,NORM),                                     X01797000
               PICOUT='ZZZZZ',                                         X01797100
               COLOR=BLUE                                               01797200
ADUNT08 DFHMDF POS=(16,61),                                            X01797300
               LENGTH=06,                                              X01797400
               ATTRB=(ASKIP,NORM),                                     X01797500
               PICOUT='ZZZZZ-',                                        X01797600
               COLOR=BLUE                                               01797700
AVAR08  DFHMDF POS=(16,69),                                            X01797800
               LENGTH=06,                                              X01797900
               ATTRB=(ASKIP,NORM),                                     X01798000
               PICOUT='ZZZZZ-',                                        X01798100
               COLOR=BLUE                                               01798200
AADJ08  DFHMDF POS=(16,77),                                            X01798300
               LENGTH=03,                                              X01798400
               ATTRB=(ASKIP,NORM),                                     X01798500
               COLOR=BLUE                                               01798600
******************************************************************      01798700
ASEL09  DFHMDF POS=(17,01),                                            X01798800
               LENGTH=01,                                              X01798900
               ATTRB=(UNPROT,NORM),                                    X01799000
               HILIGHT=UNDERLINE,                                      X01799100
               COLOR=GREEN                                              01799200
AACT09  DFHMDF POS=(17,03),                                            X01799300
               LENGTH=03,                                              X01799400
               ATTRB=(ASKIP,NORM),                                     X01799500
               COLOR=BLUE                                               01799600
APLNE09 DFHMDF POS=(17,07),                                            X01799700
               LENGTH=04,                                              X01799800
               ATTRB=(ASKIP,NORM),                                     X01799900
               PICOUT='ZZZZ',                                          X01800000
               COLOR=BLUE                                               01800100
ASKU09  DFHMDF POS=(17,13),                                            X01800201
               LENGTH=08,                                              X01800301
               ATTRB=(ASKIP,NORM),                                     X01800400
               COLOR=BLUE                                               01800500
ADESC09 DFHMDF POS=(17,23),                                            X01800600
               LENGTH=15,                                              X01800700
               ATTRB=(ASKIP,NORM),                                     X01800800
               COLOR=BLUE                                               01800900
ALNST09 DFHMDF POS=(17,39),                                            X01801000
               LENGTH=08,                                              X01801100
               ATTRB=(ASKIP,NORM),                                     X01801200
               COLOR=BLUE                                               01801300
ASTRS09 DFHMDF POS=(17,48),                                            X01801400
               LENGTH=04,                                              X01801500
               ATTRB=(ASKIP,NORM),                                     X01801600
               PICOUT='ZZZZ',                                          X01801700
               COLOR=BLUE                                               01801800
ARUNT09 DFHMDF POS=(17,54),                                            X01801900
               LENGTH=05,                                              X01802000
               ATTRB=(ASKIP,NORM),                                     X01802100
               PICOUT='ZZZZZ',                                         X01802200
               COLOR=BLUE                                               01802300
ADUNT09 DFHMDF POS=(17,61),                                            X01802400
               LENGTH=06,                                              X01802500
               ATTRB=(ASKIP,NORM),                                     X01802600
               PICOUT='ZZZZZ-',                                        X01802700
               COLOR=BLUE                                               01802800
AVAR09  DFHMDF POS=(17,69),                                            X01802900
               LENGTH=06,                                              X01803000
               ATTRB=(ASKIP,NORM),                                     X01803100
               PICOUT='ZZZZZ-',                                        X01803200
               COLOR=BLUE                                               01803300
AADJ09  DFHMDF POS=(17,77),                                            X01803400
               LENGTH=03,                                              X01803500
               ATTRB=(ASKIP,NORM),                                     X01803600
               COLOR=BLUE                                               01803700
******************************************************************      01803800
ASEL10  DFHMDF POS=(18,01),                                            X01803900
               LENGTH=01,                                              X01804000
               ATTRB=(UNPROT,NORM),                                    X01804100
               HILIGHT=UNDERLINE,                                      X01804200
               COLOR=GREEN                                              01804300
AACT10  DFHMDF POS=(18,03),                                            X01804400
               LENGTH=03,                                              X01804500
               ATTRB=(ASKIP,NORM),                                     X01804600
               COLOR=BLUE                                               01804700
APLNE10 DFHMDF POS=(18,07),                                            X01804800
               LENGTH=04,                                              X01804900
               ATTRB=(ASKIP,NORM),                                     X01805000
               PICOUT='ZZZZ',                                          X01806000
               COLOR=BLUE                                               01807000
ASKU10  DFHMDF POS=(18,13),                                            X01808001
               LENGTH=08,                                              X01809001
               ATTRB=(ASKIP,NORM),                                     X01810000
               COLOR=BLUE                                               01820000
ADESC10 DFHMDF POS=(18,23),                                            X01830000
               LENGTH=15,                                              X01840000
               ATTRB=(ASKIP,NORM),                                     X01850000
               COLOR=BLUE                                               01860000
ALNST10 DFHMDF POS=(18,39),                                            X01870000
               LENGTH=08,                                              X01880000
               ATTRB=(ASKIP,NORM),                                     X01890000
               COLOR=BLUE                                               01900000
ASTRS10 DFHMDF POS=(18,48),                                            X01910000
               LENGTH=04,                                              X01920000
               ATTRB=(ASKIP,NORM),                                     X01930000
               PICOUT='ZZZZ',                                          X01940000
               COLOR=BLUE                                               01950000
ARUNT10 DFHMDF POS=(18,54),                                            X01960000
               LENGTH=05,                                              X01970000
               ATTRB=(ASKIP,NORM),                                     X01980000
               PICOUT='ZZZZZ',                                         X01990000
               COLOR=BLUE                                               02000000
ADUNT10 DFHMDF POS=(18,61),                                            X02010000
               LENGTH=06,                                              X02020000
               ATTRB=(ASKIP,NORM),                                     X02030000
               PICOUT='ZZZZZ-',                                        X02040000
               COLOR=BLUE                                               02050000
AVAR11  DFHMDF POS=(18,69),                                            X02060000
               LENGTH=06,                                              X02070000
               ATTRB=(ASKIP,NORM),                                     X02080000
               PICOUT='ZZZZZ-',                                        X02090000
               COLOR=BLUE                                               02100000
AADJ11  DFHMDF POS=(18,77),                                            X02110000
               LENGTH=03,                                              X02120000
               ATTRB=(ASKIP,NORM),                                     X02130000
               COLOR=BLUE                                               02140000
******************************************************************      02150000
        DFHMDF POS=(19,45),                                            X02160000
               LENGTH=25,                                              X02170000
               ATTRB=(ASKIP,NORM),                                     X02180000
               COLOR=NEUTRAL,                                          X02190000
               INITIAL='NUMBER OF SELECTED ITEMS:'                      02200000
ASELIT  DFHMDF POS=(19,72),                                            X02210000
               LENGTH=07,                                              X02220000
               ATTRB=(ASKIP,NORM),                                     X02230000
               COLOR=BLUE,                                             X02240000
               PICOUT='ZZZ,ZZ9',                                       X02250000
               INITIAL='999,999'                                        02260000
        DFHMSD TYPE=FINAL                                               02270000
        END                                                             02280000
