*********************************************************************** 00010028
*                                                                       00020001
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00030001
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00040001
*********************************************************************** 00050001
        PRINT  NOGEN                                                    00060000
CEKM613 DFHMSD TYPE=DSECT,                                             X00070029
               LANG=COBOL,                                             X00080000
               MODE=INOUT,                                             X00090000
               STORAGE=AUTO,                                           X00100000
               TERM=3270-2,                                            X00110000
               TIOAPFX=YES                                              00120000
*****************************************************************       00130000
CE613A  DFHMDI LINE=2,COLUMN=1,                                        X00140030
               SIZE=(19,80),                                           X00150022
               CTRL=(FREEKB),                                          X00160000
               MAPATTS=(COLOR,HILIGHT),                                X00170000
               DSATTS=(COLOR,HILIGHT)                                   00180000
*****************************************************************       00190000
        DFHMDF POS=(02,01),                                            X00200000
               LENGTH=12,                                              X00210000
               ATTRB=(ASKIP,NORM),                                     X00220000
               COLOR=NEUTRAL,                                          X00230000
               INITIAL='CS LOCATION:'                                   00240000
ALOCID  DFHMDF POS=(02,20),                                            X00250015
               LENGTH=04,                                              X00260000
               ATTRB=(ASKIP,NORM),                                     X00270000
               COLOR=BLUE                                               00280000
        DFHMDF POS=(02,28),                                            X00290030
               LENGTH=11,                                              X00300030
               ATTRB=(ASKIP,NORM),                                     X00310015
               COLOR=NEUTRAL,                                          X00320015
               INITIAL='SKU NUMBER:'                                    00330030
ASKU    DFHMDF POS=(02,40),                                            X00340030
               LENGTH=08,                                              X00350030
               ATTRB=(ASKIP,NORM),                                     X00360015
               COLOR=BLUE                                               00370015
        DFHMDF POS=(02,53),                                            X00380030
               LENGTH=14,                                              X00390030
               ATTRB=(ASKIP,NORM),                                     X00400030
               COLOR=NEUTRAL,                                          X00410030
               INITIAL='MANIFEST UNTS:'                                 00420030
AMFUNT  DFHMDF POS=(02,72),                                            X00430030
               LENGTH=07,                                              X00440030
               ATTRB=(ASKIP,NORM),                                     X00450030
               PICOUT='Z(6)9',                                         X00460030
               COLOR=BLUE                                               00470030
*****************************************************************       00480015
        DFHMDF POS=(03,01),                                            X00490015
               LENGTH=13,                                              X00500030
               ATTRB=(ASKIP,NORM),                                     X00510015
               COLOR=NEUTRAL,                                          X00520015
               INITIAL='STORE NUMBER:'                                  00530030
ASTRNO  DFHMDF POS=(03,20),                                            X00540030
               LENGTH=04,                                              X00550039
               ATTRB=(ASKIP,NORM),                                     X00560015
               COLOR=BLUE                                               00570015
        DFHMDF POS=(03,28),                                            X00580031
               LENGTH=11,                                              X00590031
               ATTRB=(ASKIP,NORM),                                     X00600031
               COLOR=NEUTRAL,                                          X00610031
               INITIAL='SKU RETAIL:'                                    00620031
ASKRET  DFHMDF POS=(03,40),                                            X00630031
               LENGTH=08,                                              X00640031
               ATTRB=(ASKIP,NORM),                                     X00650031
               PICOUT='Z,ZZZ.99',                                      X00660031
               COLOR=BLUE                                               00670031
        DFHMDF POS=(03,53),                                            X00680031
               LENGTH=15,                                              X00690031
               ATTRB=(ASKIP,NORM),                                     X00700031
               COLOR=NEUTRAL,                                          X00710031
               INITIAL='ADJUSTED UNITS:'                                00720031
AADJUNT DFHMDF POS=(03,72),                                            X00730031
               LENGTH=08,                                              X00740040
               ATTRB=(ASKIP,NORM),                                     X00750031
               PICOUT='Z(6)9-',                                        X00760040
               COLOR=BLUE                                               00770031
*****************************************************************       00780030
        DFHMDF POS=(04,01),                                            X00790031
               LENGTH=13,                                              X00800031
               ATTRB=(ASKIP,NORM),                                     X00810030
               COLOR=NEUTRAL,                                          X00820030
               INITIAL='PULL NUMBER.:'                                  00830031
APULNO  DFHMDF POS=(04,15),                                            X00840031
               LENGTH=09,                                              X00850030
               ATTRB=(ASKIP,NORM),                                     X00860030
               PICOUT='Z(8)9',                                         X00870030
               COLOR=BLUE                                               00880030
        DFHMDF POS=(04,53),                                            X00890031
               LENGTH=15,                                              X00900031
               ATTRB=(ASKIP,NORM),                                     X00910031
               COLOR=NEUTRAL,                                          X00920031
               INITIAL='DISTRB UNITS..:'                                00930031
ADSUNT  DFHMDF POS=(04,72),                                            X00940031
               LENGTH=07,                                              X00950031
               ATTRB=(ASKIP,NORM),                                     X00960031
               PICOUT='Z(6)9',                                         X00970031
               COLOR=BLUE                                               00980031
*****************************************************************       00990031
        DFHMDF POS=(05,01),                                            X01000031
               LENGTH=13,                                              X01010031
               ATTRB=(ASKIP,NORM),                                     X01020015
               COLOR=NEUTRAL,                                          X01030015
               INITIAL='LINE NUMBER.:'                                  01040031
ALNENO  DFHMDF POS=(05,20),                                            X01050031
               LENGTH=04,                                              X01060015
               ATTRB=(ASKIP,NORM),                                     X01070015
               PICOUT='ZZZ9',                                          X01080015
               COLOR=BLUE                                               01090015
        DFHMDF POS=(05,53),                                            X01100031
               LENGTH=15,                                              X01110031
               ATTRB=(ASKIP,NORM),                                     X01120031
               COLOR=NEUTRAL,                                          X01130031
               INITIAL='DISTRB RETAIL.:'                                01140031
ADSRTL  DFHMDF POS=(05,69),                                            X01150031
               LENGTH=10,                                              X01160031
               ATTRB=(ASKIP,NORM),                                     X01170031
               PICOUT='ZZZ,ZZZ.99',                                    X01180031
               COLOR=BLUE                                               01190031
******************************************************************      01200015
        DFHMDF POS=(06,45),                                            X01210031
               LENGTH=05,                                              X01220000
               ATTRB=(ASKIP,NORM),                                     X01230000
               COLOR=NEUTRAL,INITIAL='ITEMS'                            01240000
ASTRTIT DFHMDF POS=(06,51),                                            X01250031
               LENGTH=05,                                              X01260000
               ATTRB=(NUM,UNPROT,NORM),                                X01270000
               COLOR=GREEN,                                            X01280000
               PICOUT='ZZZZ9',                                         X01290000
               HILIGHT=UNDERLINE                                        01300000
        DFHMDF POS=(06,57),                                            X01310031
               LENGTH=02,                                              X01320000
               ATTRB=(ASKIP,NORM),                                     X01330000
               COLOR=NEUTRAL,                                          X01340000
               INITIAL='TO'                                             01350000
AENDIT  DFHMDF POS=(06,60),                                            X01360031
               LENGTH=05,                                              X01370000
               ATTRB=(ASKIP,NORM),                                     X01380000
               COLOR=BLUE,                                             X01390000
               PICOUT='ZZZZ9'                                           01400000
        DFHMDF POS=(06,66),                                            X01410031
               LENGTH=02,                                              X01420000
               ATTRB=(ASKIP,NORM),                                     X01430000
               COLOR=NEUTRAL,                                          X01440000
               INITIAL='OF'                                             01450000
ATOTIT  DFHMDF POS=(06,69),                                            X01460031
               LENGTH=05,                                              X01470000
               ATTRB=(ASKIP,NORM),                                     X01480000
               COLOR=BLUE,                                             X01490000
               PICOUT='ZZZZ9'                                           01500000
******************************************************************      01510000
        DFHMDF POS=(07,01),                                            X01520031
               LENGTH=05,                                              X01530031
               ATTRB=(ASKIP,NORM),                                     X01540000
               COLOR=NEUTRAL,                                          X01550000
               INITIAL='STORE'                                          01560031
        DFHMDF POS=(07,09),                                            X01570031
               LENGTH=24,                                              X01580031
               ATTRB=(ASKIP,NORM),                                     X01590015
               COLOR=NEUTRAL,                                          X01600015
               INITIAL='------- MANIFEST -------'                       01610031
        DFHMDF POS=(07,68),                                            X01620031
               LENGTH=07,                                              X01630031
               ATTRB=(ASKIP,NORM),                                     X01640015
               COLOR=NEUTRAL,                                          X01650015
               INITIAL='EXTRACT'                                        01660031
******************************************************************      01670031
        DFHMDF POS=(08,02),                                            X01680031
               LENGTH=03,                                              X01690031
               ATTRB=(ASKIP,NORM),                                     X01700015
               COLOR=NEUTRAL,                                          X01710015
               INITIAL='NBR'                                            01720031
        DFHMDF POS=(08,09),                                            X01730031
               LENGTH=15,                                              X01740031
               ATTRB=(ASKIP,NORM),                                     X01750015
               COLOR=NEUTRAL,                                          X01760015
               INITIAL='DATE       TIME'                                01770031
        DFHMDF POS=(08,29),                                            X01780031
               LENGTH=05,                                              X01790031
               ATTRB=(ASKIP,NORM),                                     X01800031
               COLOR=NEUTRAL,                                          X01810031
               INITIAL='UNITS'                                          01820031
        DFHMDF POS=(08,36),                                            X01830031
               LENGTH=21,                                              X01840031
               ATTRB=(ASKIP,NORM),                                     X01850031
               COLOR=NEUTRAL,                                          X01860031
               INITIAL='BILL OF LADING NUMBER'                          01870031
        DFHMDF POS=(08,68),                                            X01880031
               LENGTH=07,                                              X01890031
               ATTRB=(ASKIP,NORM),                                     X01900031
               COLOR=NEUTRAL,                                          X01910031
               INITIAL='BATCH #'                                        01920031
******************************************************************      01930000
******************************************************************      01940035
******************************************************************      01950014
ASTR01  DFHMDF POS=(09,02),                                            X01960031
               LENGTH=04,                                              X01970031
               ATTRB=(ASKIP,NORM),                                     X01980031
               COLOR=BLUE                                               01990031
        DFHMDF POS=(09,07),                                            X02000034
               LENGTH=01,                                              X02010000
               ATTRB=(ASKIP)                                            02020000
ADAT01  DFHMDF POS=(09,09),                                            X02030031
               LENGTH=16,                                              X02040031
               ATTRB=(ASKIP,NORM),                                     X02050000
               COLOR=BLUE                                               02060000
AUNTS01 DFHMDF POS=(09,28),                                            X02070031
               LENGTH=05,                                              X02080000
               ATTRB=(ASKIP,NORM),                                     X02090031
               PICOUT='ZZZZZ',                                         X02100000
               COLOR=BLUE                                               02110031
        DFHMDF POS=(09,34),                                            X02120031
               LENGTH=01,                                              X02130000
               ATTRB=(ASKIP)                                            02140000
ABOL01  DFHMDF POS=(09,36),                                            X02150031
               LENGTH=30,                                              X02160031
               ATTRB=(ASKIP,NORM),                                     X02170000
               COLOR=BLUE                                               02180000
ABTCH01 DFHMDF POS=(09,70),                                            X02190031
               LENGTH=03,                                              X02200031
               ATTRB=(ASKIP,NORM),                                     X02210000
               COLOR=BLUE                                               02220011
******************************************************************      02230035
ASTR02  DFHMDF POS=(10,02),                                            X02240035
               LENGTH=04,                                              X02250035
               ATTRB=(ASKIP,NORM),                                     X02260035
               COLOR=BLUE                                               02270035
        DFHMDF POS=(10,07),                                            X02280035
               LENGTH=01,                                              X02290035
               ATTRB=(ASKIP)                                            02300035
ADAT02  DFHMDF POS=(10,09),                                            X02310035
               LENGTH=16,                                              X02320035
               ATTRB=(ASKIP,NORM),                                     X02330035
               COLOR=BLUE                                               02340035
AUNTS02 DFHMDF POS=(10,28),                                            X02350035
               LENGTH=05,                                              X02360035
               ATTRB=(ASKIP,NORM),                                     X02370035
               PICOUT='ZZZZZ',                                         X02380035
               COLOR=BLUE                                               02390035
        DFHMDF POS=(10,34),                                            X02400035
               LENGTH=01,                                              X02410035
               ATTRB=(ASKIP)                                            02420035
ABOL02  DFHMDF POS=(10,36),                                            X02430035
               LENGTH=30,                                              X02440035
               ATTRB=(ASKIP,NORM),                                     X02450035
               COLOR=BLUE                                               02460035
ABTCH02 DFHMDF POS=(10,70),                                            X02470035
               LENGTH=03,                                              X02480035
               ATTRB=(ASKIP,NORM),                                     X02490035
               COLOR=BLUE                                               02500035
******************************************************************      02510035
ASTR03  DFHMDF POS=(11,02),                                            X02520035
               LENGTH=04,                                              X02530035
               ATTRB=(ASKIP,NORM),                                     X02540035
               COLOR=BLUE                                               02550035
        DFHMDF POS=(11,07),                                            X02560035
               LENGTH=01,                                              X02570035
               ATTRB=(ASKIP)                                            02580035
ADAT03  DFHMDF POS=(11,09),                                            X02590035
               LENGTH=16,                                              X02600035
               ATTRB=(ASKIP,NORM),                                     X02610035
               COLOR=BLUE                                               02620035
AUNTS03 DFHMDF POS=(11,28),                                            X02630035
               LENGTH=05,                                              X02640035
               ATTRB=(ASKIP,NORM),                                     X02650035
               PICOUT='ZZZZZ',                                         X02660035
               COLOR=BLUE                                               02670035
        DFHMDF POS=(11,34),                                            X02680035
               LENGTH=01,                                              X02690035
               ATTRB=(ASKIP)                                            02700035
ABOL03  DFHMDF POS=(11,36),                                            X02710035
               LENGTH=30,                                              X02720035
               ATTRB=(ASKIP,NORM),                                     X02730035
               COLOR=BLUE                                               02740035
ABTCH03 DFHMDF POS=(11,70),                                            X02750035
               LENGTH=03,                                              X02760035
               ATTRB=(ASKIP,NORM),                                     X02770035
               COLOR=BLUE                                               02780035
******************************************************************      02790035
ASTR04  DFHMDF POS=(12,02),                                            X02800035
               LENGTH=04,                                              X02810035
               ATTRB=(ASKIP,NORM),                                     X02820035
               COLOR=BLUE                                               02830035
        DFHMDF POS=(12,07),                                            X02840035
               LENGTH=01,                                              X02850035
               ATTRB=(ASKIP)                                            02860035
ADAT04  DFHMDF POS=(12,09),                                            X02870035
               LENGTH=16,                                              X02880035
               ATTRB=(ASKIP,NORM),                                     X02890035
               COLOR=BLUE                                               02900035
AUNTS04 DFHMDF POS=(12,28),                                            X02910035
               LENGTH=05,                                              X02920035
               ATTRB=(ASKIP,NORM),                                     X02930035
               PICOUT='ZZZZZ',                                         X02940035
               COLOR=BLUE                                               02950035
        DFHMDF POS=(12,34),                                            X02960035
               LENGTH=01,                                              X02970035
               ATTRB=(ASKIP)                                            02980035
ABOL04  DFHMDF POS=(12,36),                                            X02990035
               LENGTH=30,                                              X03000035
               ATTRB=(ASKIP,NORM),                                     X03010035
               COLOR=BLUE                                               03020035
ABTCH04 DFHMDF POS=(12,70),                                            X03030035
               LENGTH=03,                                              X03040035
               ATTRB=(ASKIP,NORM),                                     X03050035
               COLOR=BLUE                                               03060035
******************************************************************      03070035
ASTR05  DFHMDF POS=(13,02),                                            X03080035
               LENGTH=04,                                              X03090035
               ATTRB=(ASKIP,NORM),                                     X03100035
               COLOR=BLUE                                               03110035
        DFHMDF POS=(13,07),                                            X03120035
               LENGTH=01,                                              X03130035
               ATTRB=(ASKIP)                                            03140035
ADAT05  DFHMDF POS=(13,09),                                            X03150035
               LENGTH=16,                                              X03160035
               ATTRB=(ASKIP,NORM),                                     X03170035
               COLOR=BLUE                                               03180035
AUNTS05 DFHMDF POS=(13,28),                                            X03190035
               LENGTH=05,                                              X03200035
               ATTRB=(ASKIP,NORM),                                     X03210035
               PICOUT='ZZZZZ',                                         X03220035
               COLOR=BLUE                                               03230035
        DFHMDF POS=(13,34),                                            X03240035
               LENGTH=01,                                              X03250035
               ATTRB=(ASKIP)                                            03260035
ABOL05  DFHMDF POS=(13,36),                                            X03270035
               LENGTH=30,                                              X03280035
               ATTRB=(ASKIP,NORM),                                     X03290035
               COLOR=BLUE                                               03300035
ABTCH05 DFHMDF POS=(13,70),                                            X03310035
               LENGTH=03,                                              X03320035
               ATTRB=(ASKIP,NORM),                                     X03330035
               COLOR=BLUE                                               03340035
******************************************************************      03350035
ASTR06  DFHMDF POS=(14,02),                                            X03360035
               LENGTH=04,                                              X03370035
               ATTRB=(ASKIP,NORM),                                     X03380035
               COLOR=BLUE                                               03390035
        DFHMDF POS=(14,07),                                            X03400035
               LENGTH=01,                                              X03410035
               ATTRB=(ASKIP)                                            03420035
ADAT06  DFHMDF POS=(14,09),                                            X03430035
               LENGTH=16,                                              X03440035
               ATTRB=(ASKIP,NORM),                                     X03450035
               COLOR=BLUE                                               03460035
AUNTS06 DFHMDF POS=(14,28),                                            X03470035
               LENGTH=05,                                              X03480035
               ATTRB=(ASKIP,NORM),                                     X03490035
               PICOUT='ZZZZZ',                                         X03500035
               COLOR=BLUE                                               03510035
        DFHMDF POS=(14,34),                                            X03520035
               LENGTH=01,                                              X03530035
               ATTRB=(ASKIP)                                            03540035
ABOL06  DFHMDF POS=(14,36),                                            X03550035
               LENGTH=30,                                              X03560035
               ATTRB=(ASKIP,NORM),                                     X03570035
               COLOR=BLUE                                               03580035
ABTCH06 DFHMDF POS=(14,70),                                            X03590035
               LENGTH=03,                                              X03600035
               ATTRB=(ASKIP,NORM),                                     X03610035
               COLOR=BLUE                                               03620035
******************************************************************      03630035
ASTR07  DFHMDF POS=(15,02),                                            X03640035
               LENGTH=04,                                              X03650035
               ATTRB=(ASKIP,NORM),                                     X03660035
               COLOR=BLUE                                               03670035
        DFHMDF POS=(15,07),                                            X03680035
               LENGTH=01,                                              X03690035
               ATTRB=(ASKIP)                                            03700035
ADAT07  DFHMDF POS=(15,09),                                            X03710035
               LENGTH=16,                                              X03720035
               ATTRB=(ASKIP,NORM),                                     X03730035
               COLOR=BLUE                                               03740035
AUNTS07 DFHMDF POS=(15,28),                                            X03750035
               LENGTH=05,                                              X03760035
               ATTRB=(ASKIP,NORM),                                     X03770035
               PICOUT='ZZZZZ',                                         X03780035
               COLOR=BLUE                                               03790035
        DFHMDF POS=(15,34),                                            X03800035
               LENGTH=01,                                              X03810035
               ATTRB=(ASKIP)                                            03820035
ABOL07  DFHMDF POS=(15,36),                                            X03830035
               LENGTH=30,                                              X03840035
               ATTRB=(ASKIP,NORM),                                     X03850035
               COLOR=BLUE                                               03860035
ABTCH07 DFHMDF POS=(15,70),                                            X03870035
               LENGTH=03,                                              X03880035
               ATTRB=(ASKIP,NORM),                                     X03890035
               COLOR=BLUE                                               03900035
******************************************************************      03910035
ASTR08  DFHMDF POS=(16,02),                                            X03920035
               LENGTH=04,                                              X03930035
               ATTRB=(ASKIP,NORM),                                     X03940035
               COLOR=BLUE                                               03950035
        DFHMDF POS=(16,07),                                            X03960035
               LENGTH=01,                                              X03970035
               ATTRB=(ASKIP)                                            03980035
ADAT08  DFHMDF POS=(16,09),                                            X03990035
               LENGTH=16,                                              X04000035
               ATTRB=(ASKIP,NORM),                                     X04010035
               COLOR=BLUE                                               04020035
AUNTS08 DFHMDF POS=(16,28),                                            X04030035
               LENGTH=05,                                              X04040035
               ATTRB=(ASKIP,NORM),                                     X04050035
               PICOUT='ZZZZZ',                                         X04060035
               COLOR=BLUE                                               04070035
        DFHMDF POS=(16,34),                                            X04080035
               LENGTH=01,                                              X04090035
               ATTRB=(ASKIP)                                            04100035
ABOL08  DFHMDF POS=(16,36),                                            X04110035
               LENGTH=30,                                              X04120035
               ATTRB=(ASKIP,NORM),                                     X04130035
               COLOR=BLUE                                               04140035
ABTCH08 DFHMDF POS=(16,70),                                            X04150035
               LENGTH=03,                                              X04160035
               ATTRB=(ASKIP,NORM),                                     X04170035
               COLOR=BLUE                                               04180035
******************************************************************      04190035
ASTR09  DFHMDF POS=(17,02),                                            X04200035
               LENGTH=04,                                              X04210035
               ATTRB=(ASKIP,NORM),                                     X04220035
               COLOR=BLUE                                               04230035
        DFHMDF POS=(17,07),                                            X04240035
               LENGTH=01,                                              X04250035
               ATTRB=(ASKIP)                                            04260035
ADAT09  DFHMDF POS=(17,09),                                            X04270035
               LENGTH=16,                                              X04280035
               ATTRB=(ASKIP,NORM),                                     X04290035
               COLOR=BLUE                                               04300035
AUNTS09 DFHMDF POS=(17,28),                                            X04310035
               LENGTH=05,                                              X04320035
               ATTRB=(ASKIP,NORM),                                     X04330035
               PICOUT='ZZZZZ',                                         X04340035
               COLOR=BLUE                                               04350035
        DFHMDF POS=(17,34),                                            X04360035
               LENGTH=01,                                              X04370035
               ATTRB=(ASKIP)                                            04380035
ABOL09  DFHMDF POS=(17,36),                                            X04390035
               LENGTH=30,                                              X04400035
               ATTRB=(ASKIP,NORM),                                     X04410035
               COLOR=BLUE                                               04420035
ABTCH09 DFHMDF POS=(17,70),                                            X04430035
               LENGTH=03,                                              X04440035
               ATTRB=(ASKIP,NORM),                                     X04450035
               COLOR=BLUE                                               04460035
******************************************************************      04470035
ASTR10  DFHMDF POS=(18,02),                                            X04480035
               LENGTH=04,                                              X04490035
               ATTRB=(ASKIP,NORM),                                     X04500035
               COLOR=BLUE                                               04510035
        DFHMDF POS=(18,07),                                            X04520035
               LENGTH=01,                                              X04530035
               ATTRB=(ASKIP)                                            04540035
ADAT10  DFHMDF POS=(18,09),                                            X04550035
               LENGTH=16,                                              X04560035
               ATTRB=(ASKIP,NORM),                                     X04570035
               COLOR=BLUE                                               04580035
AUNTS10 DFHMDF POS=(18,28),                                            X04590035
               LENGTH=05,                                              X04600035
               ATTRB=(ASKIP,NORM),                                     X04610035
               PICOUT='ZZZZZ',                                         X04620035
               COLOR=BLUE                                               04630035
        DFHMDF POS=(18,34),                                            X04640035
               LENGTH=01,                                              X04650035
               ATTRB=(ASKIP)                                            04660035
ABOL10  DFHMDF POS=(18,36),                                            X04670035
               LENGTH=30,                                              X04680035
               ATTRB=(ASKIP,NORM),                                     X04690035
               COLOR=BLUE                                               04700035
ABTCH10 DFHMDF POS=(18,70),                                            X04710035
               LENGTH=03,                                              X04720035
               ATTRB=(ASKIP,NORM),                                     X04730035
               COLOR=BLUE                                               04740035
******************************************************************      04750035
******************************************************************      04760035
******************************************************************      04770036
        DFHMSD TYPE=FINAL                                               04780000
        END                                                             04790000
