*********************************************************************** 00000100
*                                                                       00000200
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00000300
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00000400
*********************************************************************** 00000500
        PRINT  NOGEN                                                    00000600
CEKM622 DFHMSD TYPE=DSECT,                                             X00000700
               LANG=COBOL,                                             X00000800
               MODE=INOUT,                                             X00000900
               STORAGE=AUTO,                                           X00001000
               TERM=3270-2,                                            X00002000
               TIOAPFX=YES                                              00003000
*****************************************************************       00004000
CE622A  DFHMDI LINE=2,COLUMN=1,                                        X00005000
               SIZE=(19,80),                                           X00006000
               CTRL=(FREEKB),                                          X00007000
               MAPATTS=(COLOR,HILIGHT),                                X00008000
               DSATTS=(COLOR,HILIGHT)                                   00009000
*****************************************************************       00010000
        DFHMDF POS=(02,01),                                            X00020000
               LENGTH=15,                                              X00030000
               ATTRB=(ASKIP,NORM),                                     X00040000
               COLOR=NEUTRAL,                                          X00050000
               INITIAL='CS LOCATION...:'                                00060000
ALOCID  DFHMDF POS=(02,21),                                            X00070000
               LENGTH=04,                                              X00080000
               ATTRB=(ASKIP,NORM),                                     X00090000
               COLOR=BLUE                                               00100000
**************************************************************          00110000
        DFHMDF POS=(02,80),                                            X00120000
               LENGTH=16,                                              X00130000
               ATTRB=(ASKIP,NORM),                                     X00140000
               COLOR=NEUTRAL,                                          X00150000
               INITIAL=' PULL NUMBER...:'                               00160000
APULNO  DFHMDF POS=(03,17),                                            X00170000
               LENGTH=08,                                              X00180000
               PICOUT='ZZZZZZZZ',                                      X00190000
               ATTRB=(ASKIP,NORM),                                     X00200000
               COLOR=BLUE                                               00210000
        DFHMDF POS=(03,28),                                            X00220000
               LENGTH=15,                                              X00230000
               ATTRB=(ASKIP,NORM),                                     X00240000
               COLOR=NEUTRAL,                                          X00250000
               INITIAL='PULL STATUS...:'                                00260000
APULST  DFHMDF POS=(03,44),                                            X00270000
               LENGTH=08,                                              X00280000
               ATTRB=(ASKIP,NORM),                                     X00290000
               COLOR=BLUE                                               00300000
        DFHMDF POS=(03,57),                                            X00310000
               LENGTH=13,                                              X00320000
               ATTRB=(ASKIP,NORM),                                     X00330000
               COLOR=NEUTRAL,                                          X00340000
               INITIAL='PULL SOURCE.:'                                  00350000
APLSRC  DFHMDF POS=(03,71),                                            X00360000
               LENGTH=08,                                              X00370000
               ATTRB=(ASKIP,NORM),                                     X00380000
               COLOR=BLUE                                               00390000
******************************************************************      00400000
        DFHMDF POS=(04,01),                                            X00410000
               LENGTH=15,                                              X00420000
               ATTRB=(ASKIP,NORM),                                     X00430000
               COLOR=NEUTRAL,                                          X00440000
               INITIAL='REF NUMBER....:'                                00450000
AREFNO  DFHMDF POS=(04,17),                                            X00460000
               LENGTH=15,                                              X00470000
               ATTRB=(ASKIP,NORM),                                     X00480000
               COLOR=BLUE                                               00490000
        DFHMDF POS=(04,50),                                            X00500000
               LENGTH=05,                                              X00510000
               ATTRB=(ASKIP,NORM),                                     X00520000
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00530000
ASTRTIT DFHMDF POS=(04,56),                                            X00540000
               LENGTH=05,                                              X00550000
               ATTRB=(NUM,UNPROT,NORM),                                X00560000
               COLOR=GREEN,                                            X00570000
               PICOUT='ZZZZ9',                                         X00580000
               HILIGHT=UNDERLINE                                        00590000
        DFHMDF POS=(04,62),                                            X00600000
               LENGTH=02,                                              X00610000
               ATTRB=(ASKIP,NORM),                                     X00620000
               COLOR=NEUTRAL,                                          X00630000
               INITIAL='TO'                                             00640000
AENDIT  DFHMDF POS=(04,65),                                            X00650000
               LENGTH=05,                                              X00660000
               ATTRB=(ASKIP,NORM),                                     X00670000
               COLOR=BLUE,                                             X00680000
               PICOUT='ZZZZ9'                                           00690000
        DFHMDF POS=(04,71),                                            X00700000
               LENGTH=02,                                              X00710000
               ATTRB=(ASKIP,NORM),                                     X00720000
               COLOR=NEUTRAL,                                          X00730000
               INITIAL='OF'                                             00740000
ATOTIT  DFHMDF POS=(04,74),                                            X00750000
               LENGTH=05,                                              X00760000
               ATTRB=(ASKIP,NORM),                                     X00770000
               COLOR=BLUE,                                             X00780000
               PICOUT='ZZZZ9'                                           00790000
******************************************************************      00800000
        DFHMDF POS=(05,08),                                            X00810000
               LENGTH=11,                                              X00820000
               ATTRB=(ASKIP,NORM),                                     X00830000
               COLOR=NEUTRAL,                                          X00840000
               INITIAL='LINE    SKU'                                    00850000
        DFHMDF POS=(05,30),                                            X00860000
               LENGTH=03,                                              X00870000
               ATTRB=(ASKIP,NORM),                                     X00880000
               COLOR=NEUTRAL,                                          X00890000
               INITIAL='SKU'                                            00900000
        DFHMDF POS=(05,42),                                            X00910000
               LENGTH=32,                                              X00920000
               ATTRB=(ASKIP,NORM),                                     X00930000
               COLOR=NEUTRAL,                                          X00940000
               INITIAL='LINE                            '               00950000
******************************************************************      00960000
        DFHMDF POS=(06,01),                                            X00970000
               LENGTH=21,                                              X00980000
               ATTRB=(ASKIP,NORM),                                     X00990000
               COLOR=NEUTRAL,                                          X01000000
               INITIAL='S ACT  NBR    NUMBER '                          01010000
        DFHMDF POS=(06,26),                                            X01020000
               LENGTH=11,                                              X01030000
               ATTRB=(ASKIP,NORM),                                     X01040000
               COLOR=NEUTRAL,                                          X01050000
               INITIAL='DESCRIPTION'                                    01060000
        DFHMDF POS=(06,41),                                            X01070000
               LENGTH=33,                                              X01080000
               ATTRB=(ASKIP,NORM),                                     X01090000
               COLOR=NEUTRAL,                                          X01100000
               INITIAL='STATUS  RDM DOWNLOAD STATUS      '              01110000
******************************************************************      01120000
ASEL01  DFHMDF POS=(07,01),                                            X01130000
               LENGTH=01,                                              X01140000
               ATTRB=(UNPROT,NORM),                                    X01150000
               HILIGHT=UNDERLINE,                                      X01160000
               COLOR=GREEN                                              01170000
AACT01  DFHMDF POS=(07,03),                                            X01180000
               LENGTH=03,                                              X01190000
               ATTRB=(ASKIP,NORM),                                     X01200000
               COLOR=BLUE                                               01210000
APLNE01 DFHMDF POS=(07,08),                                            X01220000
               LENGTH=04,                                              X01230000
               ATTRB=(ASKIP,NORM),                                     X01240000
               PICOUT='ZZZZ',                                          X01250000
               COLOR=BLUE                                               01260000
ASKU01  DFHMDF POS=(07,13),                                            X01270000
               LENGTH=08,                                              X01280000
               ATTRB=(ASKIP,NORM),                                     X01290000
               COLOR=BLUE                                               01300000
ADESC01 DFHMDF POS=(07,24),                                            X01310000
               LENGTH=15,                                              X01320000
               ATTRB=(ASKIP,NORM),                                     X01330000
               COLOR=BLUE                                               01340000
ALNST01 DFHMDF POS=(07,40),                                            X01350000
               LENGTH=08,                                              X01360000
               ATTRB=(ASKIP,NORM),                                     X01370000
               COLOR=BLUE                                               01380000
ARDM01  DFHMDF POS=(07,49),                                            X01390000
               LENGTH=20,                                              X01400000
               ATTRB=(ASKIP,NORM),                                     X01410000
               COLOR=BLUE                                               01420000
******************************************************************      01430000
ASEL02  DFHMDF POS=(08,01),                                            X01440000
               LENGTH=01,                                              X01450000
               ATTRB=(UNPROT,NORM),                                    X01460000
               HILIGHT=UNDERLINE,                                      X01470000
               COLOR=GREEN                                              01480000
AACT02  DFHMDF POS=(08,03),                                            X01490000
               LENGTH=03,                                              X01500000
               ATTRB=(ASKIP,NORM),                                     X01510000
               COLOR=BLUE                                               01520000
APLNE02 DFHMDF POS=(08,08),                                            X01530000
               LENGTH=04,                                              X01540000
               ATTRB=(ASKIP,NORM),                                     X01550000
               PICOUT='ZZZZ',                                          X01560000
               COLOR=BLUE                                               01570000
ASKU02  DFHMDF POS=(08,13),                                            X01580000
               LENGTH=08,                                              X01590000
               ATTRB=(ASKIP,NORM),                                     X01600000
               COLOR=BLUE                                               01610000
ADESC02 DFHMDF POS=(08,24),                                            X01620000
               LENGTH=15,                                              X01630000
               ATTRB=(ASKIP,NORM),                                     X01640000
               COLOR=BLUE                                               01650000
ALNST02 DFHMDF POS=(08,40),                                            X01660000
               LENGTH=08,                                              X01670000
               ATTRB=(ASKIP,NORM),                                     X01680000
               COLOR=BLUE                                               01690000
ARDM02  DFHMDF POS=(08,49),                                            X01700000
               LENGTH=20,                                              X01710000
               ATTRB=(ASKIP,NORM),                                     X01720000
               COLOR=BLUE                                               01730000
******************************************************************      01740000
ASEL03  DFHMDF POS=(09,01),                                            X01750000
               LENGTH=01,                                              X01760000
               ATTRB=(UNPROT,NORM),                                    X01770000
               HILIGHT=UNDERLINE,                                      X01780000
               COLOR=GREEN                                              01790000
AACT03  DFHMDF POS=(09,03),                                            X01800000
               LENGTH=03,                                              X01810000
               ATTRB=(ASKIP,NORM),                                     X01820000
               COLOR=BLUE                                               01830000
APLNE03 DFHMDF POS=(09,08),                                            X01840000
               LENGTH=04,                                              X01850000
               ATTRB=(ASKIP,NORM),                                     X01860000
               PICOUT='ZZZZ',                                          X01870000
               COLOR=BLUE                                               01880000
ASKU03  DFHMDF POS=(09,13),                                            X01890000
               LENGTH=08,                                              X01900000
               ATTRB=(ASKIP,NORM),                                     X01910000
               COLOR=BLUE                                               01920000
ADESC03 DFHMDF POS=(09,24),                                            X01930000
               LENGTH=15,                                              X01940000
               ATTRB=(ASKIP,NORM),                                     X01950000
               COLOR=BLUE                                               01960000
ALNST03 DFHMDF POS=(09,40),                                            X01970000
               LENGTH=08,                                              X01980000
               ATTRB=(ASKIP,NORM),                                     X01990000
               COLOR=BLUE                                               02000000
ARDM03  DFHMDF POS=(09,49),                                            X02010000
               LENGTH=20,                                              X02020000
               ATTRB=(ASKIP,NORM),                                     X02030000
               COLOR=BLUE                                               02040000
******************************************************************      02050000
ASEL04  DFHMDF POS=(10,01),                                            X02060000
               LENGTH=01,                                              X02070000
               ATTRB=(UNPROT,NORM),                                    X02080000
               HILIGHT=UNDERLINE,                                      X02090000
               COLOR=GREEN                                              02100000
AACT04  DFHMDF POS=(10,03),                                            X02110000
               LENGTH=03,                                              X02120000
               ATTRB=(ASKIP,NORM),                                     X02130000
               COLOR=BLUE                                               02140000
APLNE04 DFHMDF POS=(10,08),                                            X02150000
               LENGTH=04,                                              X02160000
               ATTRB=(ASKIP,NORM),                                     X02170000
               PICOUT='ZZZZ',                                          X02180000
               COLOR=BLUE                                               02190000
ASKU04  DFHMDF POS=(10,13),                                            X02200000
               LENGTH=08,                                              X02210000
               ATTRB=(ASKIP,NORM),                                     X02220000
               COLOR=BLUE                                               02230000
ADESC04 DFHMDF POS=(10,24),                                            X02240000
               LENGTH=15,                                              X02250000
               ATTRB=(ASKIP,NORM),                                     X02260000
               COLOR=BLUE                                               02270000
ALNST04 DFHMDF POS=(10,40),                                            X02280000
               LENGTH=08,                                              X02290000
               ATTRB=(ASKIP,NORM),                                     X02300000
               COLOR=BLUE                                               02310000
ARDM04  DFHMDF POS=(10,49),                                            X02320000
               LENGTH=20,                                              X02330000
               ATTRB=(ASKIP,NORM),                                     X02340000
               COLOR=BLUE                                               02350000
******************************************************************      02360000
ASEL05  DFHMDF POS=(11,01),                                            X02370000
               LENGTH=01,                                              X02380000
               ATTRB=(UNPROT,NORM),                                    X02390000
               HILIGHT=UNDERLINE,                                      X02400000
               COLOR=GREEN                                              02410000
AACT05  DFHMDF POS=(11,03),                                            X02420000
               LENGTH=03,                                              X02430000
               ATTRB=(ASKIP,NORM),                                     X02440000
               COLOR=BLUE                                               02450000
APLNE05 DFHMDF POS=(11,08),                                            X02460000
               LENGTH=04,                                              X02470000
               ATTRB=(ASKIP,NORM),                                     X02480000
               PICOUT='ZZZZ',                                          X02490000
               COLOR=BLUE                                               02500000
ASKU05  DFHMDF POS=(11,13),                                            X02510000
               LENGTH=08,                                              X02520000
               ATTRB=(ASKIP,NORM),                                     X02530000
               COLOR=BLUE                                               02540000
ADESC05 DFHMDF POS=(11,24),                                            X02550000
               LENGTH=15,                                              X02560000
               ATTRB=(ASKIP,NORM),                                     X02570000
               COLOR=BLUE                                               02580000
ALNST05 DFHMDF POS=(11,40),                                            X02590000
               LENGTH=08,                                              X02600000
               ATTRB=(ASKIP,NORM),                                     X02610000
               COLOR=BLUE                                               02620000
ARDM05  DFHMDF POS=(11,49),                                            X02630000
               LENGTH=20,                                              X02640000
               ATTRB=(ASKIP,NORM),                                     X02650000
               COLOR=BLUE                                               02660000
******************************************************************      02670000
ASEL06  DFHMDF POS=(12,01),                                            X02680000
               LENGTH=01,                                              X02690000
               ATTRB=(UNPROT,NORM),                                    X02700000
               HILIGHT=UNDERLINE,                                      X02710000
               COLOR=GREEN                                              02720000
AACT06  DFHMDF POS=(12,03),                                            X02730000
               LENGTH=03,                                              X02740000
               ATTRB=(ASKIP,NORM),                                     X02750000
               COLOR=BLUE                                               02760000
APLNE06 DFHMDF POS=(12,08),                                            X02770000
               LENGTH=04,                                              X02780000
               ATTRB=(ASKIP,NORM),                                     X02790000
               PICOUT='ZZZZ',                                          X02800000
               COLOR=BLUE                                               02810000
ASKU06  DFHMDF POS=(12,13),                                            X02820000
               LENGTH=08,                                              X02830000
               ATTRB=(ASKIP,NORM),                                     X02840000
               COLOR=BLUE                                               02850000
ADESC06 DFHMDF POS=(12,24),                                            X02860000
               LENGTH=15,                                              X02870000
               ATTRB=(ASKIP,NORM),                                     X02880000
               COLOR=BLUE                                               02890000
ALNST06 DFHMDF POS=(12,40),                                            X02900000
               LENGTH=08,                                              X02910000
               ATTRB=(ASKIP,NORM),                                     X02920000
               COLOR=BLUE                                               02930000
ARDM06  DFHMDF POS=(12,49),                                            X02940000
               LENGTH=20,                                              X02950000
               ATTRB=(ASKIP,NORM),                                     X02960000
               COLOR=BLUE                                               02970000
******************************************************************      02980000
ASEL07  DFHMDF POS=(13,01),                                            X02990000
               LENGTH=01,                                              X03000000
               ATTRB=(UNPROT,NORM),                                    X03010000
               HILIGHT=UNDERLINE,                                      X03020000
               COLOR=GREEN                                              03030000
AACT07  DFHMDF POS=(13,03),                                            X03040000
               LENGTH=03,                                              X03050000
               ATTRB=(ASKIP,NORM),                                     X03060000
               COLOR=BLUE                                               03070000
APLNE07 DFHMDF POS=(13,08),                                            X03080000
               LENGTH=04,                                              X03090000
               ATTRB=(ASKIP,NORM),                                     X03100000
               PICOUT='ZZZZ',                                          X03110000
               COLOR=BLUE                                               03120000
ASKU07  DFHMDF POS=(13,13),                                            X03130000
               LENGTH=08,                                              X03140000
               ATTRB=(ASKIP,NORM),                                     X03150000
               COLOR=BLUE                                               03160000
ADESC07 DFHMDF POS=(13,24),                                            X03170000
               LENGTH=15,                                              X03180000
               ATTRB=(ASKIP,NORM),                                     X03190000
               COLOR=BLUE                                               03200000
ALNST07 DFHMDF POS=(13,40),                                            X03210000
               LENGTH=08,                                              X03220000
               ATTRB=(ASKIP,NORM),                                     X03230000
               COLOR=BLUE                                               03240000
ARDM07  DFHMDF POS=(13,49),                                            X03250000
               LENGTH=20,                                              X03260000
               ATTRB=(ASKIP,NORM),                                     X03270000
               COLOR=BLUE                                               03280000
******************************************************************      03290000
ASEL08  DFHMDF POS=(14,01),                                            X03300000
               LENGTH=01,                                              X03310000
               ATTRB=(UNPROT,NORM),                                    X03320000
               HILIGHT=UNDERLINE,                                      X03330000
               COLOR=GREEN                                              03340000
AACT08  DFHMDF POS=(14,03),                                            X03350000
               LENGTH=03,                                              X03360000
               ATTRB=(ASKIP,NORM),                                     X03370000
               COLOR=BLUE                                               03380000
APLNE08 DFHMDF POS=(14,08),                                            X03390000
               LENGTH=04,                                              X03400000
               ATTRB=(ASKIP,NORM),                                     X03410000
               PICOUT='ZZZZ',                                          X03420000
               COLOR=BLUE                                               03430000
ASKU08  DFHMDF POS=(14,13),                                            X03440000
               LENGTH=08,                                              X03450000
               ATTRB=(ASKIP,NORM),                                     X03460000
               COLOR=BLUE                                               03470000
ADESC08 DFHMDF POS=(14,24),                                            X03480000
               LENGTH=15,                                              X03490000
               ATTRB=(ASKIP,NORM),                                     X03500000
               COLOR=BLUE                                               03510000
ALNST08 DFHMDF POS=(14,40),                                            X03520000
               LENGTH=08,                                              X03530000
               ATTRB=(ASKIP,NORM),                                     X03540000
               COLOR=BLUE                                               03550000
ARDM08  DFHMDF POS=(14,49),                                            X03560000
               LENGTH=20,                                              X03570000
               ATTRB=(ASKIP,NORM),                                     X03580000
               COLOR=BLUE                                               03590000
******************************************************************      03600000
ASEL09  DFHMDF POS=(15,01),                                            X03610000
               LENGTH=01,                                              X03620000
               ATTRB=(UNPROT,NORM),                                    X03630000
               HILIGHT=UNDERLINE,                                      X03640000
               COLOR=GREEN                                              03650000
AACT09  DFHMDF POS=(15,03),                                            X03660000
               LENGTH=03,                                              X03670000
               ATTRB=(ASKIP,NORM),                                     X03680000
               COLOR=BLUE                                               03690000
APLNE09 DFHMDF POS=(15,08),                                            X03700000
               LENGTH=04,                                              X03710000
               ATTRB=(ASKIP,NORM),                                     X03720000
               PICOUT='ZZZZ',                                          X03730000
               COLOR=BLUE                                               03740000
ASKU09  DFHMDF POS=(15,13),                                            X03750000
               LENGTH=08,                                              X03760000
               ATTRB=(ASKIP,NORM),                                     X03770000
               COLOR=BLUE                                               03780000
ADESC09 DFHMDF POS=(15,24),                                            X03790000
               LENGTH=15,                                              X03800000
               ATTRB=(ASKIP,NORM),                                     X03810000
               COLOR=BLUE                                               03820000
ALNST09 DFHMDF POS=(15,40),                                            X03830000
               LENGTH=08,                                              X03840000
               ATTRB=(ASKIP,NORM),                                     X03850000
               COLOR=BLUE                                               03860000
ARDM09  DFHMDF POS=(15,49),                                            X03870000
               LENGTH=20,                                              X03880000
               ATTRB=(ASKIP,NORM),                                     X03890000
               COLOR=BLUE                                               03900000
******************************************************************      03910000
ASEL10  DFHMDF POS=(16,01),                                            X03920000
               LENGTH=01,                                              X03930000
               ATTRB=(UNPROT,NORM),                                    X03940000
               HILIGHT=UNDERLINE,                                      X03950000
               COLOR=GREEN                                              03960000
AACT10  DFHMDF POS=(16,03),                                            X03970000
               LENGTH=03,                                              X03980000
               ATTRB=(ASKIP,NORM),                                     X03990000
               COLOR=BLUE                                               04000000
APLNE10 DFHMDF POS=(16,08),                                            X04010000
               LENGTH=04,                                              X04020000
               ATTRB=(ASKIP,NORM),                                     X04030000
               PICOUT='ZZZZ',                                          X04040000
               COLOR=BLUE                                               04050000
ASKU10  DFHMDF POS=(16,13),                                            X04060000
               LENGTH=08,                                              X04070000
               ATTRB=(ASKIP,NORM),                                     X04080000
               COLOR=BLUE                                               04090000
ADESC10 DFHMDF POS=(16,24),                                            X04100000
               LENGTH=15,                                              X04110000
               ATTRB=(ASKIP,NORM),                                     X04120000
               COLOR=BLUE                                               04130000
ALNST10 DFHMDF POS=(16,40),                                            X04140000
               LENGTH=08,                                              X04150000
               ATTRB=(ASKIP,NORM),                                     X04160000
               COLOR=BLUE                                               04170000
ARDM10  DFHMDF POS=(16,49),                                            X04180000
               LENGTH=20,                                              X04190000
               ATTRB=(ASKIP,NORM),                                     X04200000
               COLOR=BLUE                                               04210000
******************************************************************      04220000
ASEL11  DFHMDF POS=(17,01),                                            X04230000
               LENGTH=01,                                              X04240000
               ATTRB=(UNPROT,NORM),                                    X04250000
               HILIGHT=UNDERLINE,                                      X04260000
               COLOR=GREEN                                              04270000
AACT11  DFHMDF POS=(17,03),                                            X04280000
               LENGTH=03,                                              X04290000
               ATTRB=(ASKIP,NORM),                                     X04300000
               COLOR=BLUE                                               04310000
APLNE11 DFHMDF POS=(17,08),                                            X04320000
               LENGTH=04,                                              X04330000
               ATTRB=(ASKIP,NORM),                                     X04340000
               PICOUT='ZZZZ',                                          X04350000
               COLOR=BLUE                                               04360000
ASKU11  DFHMDF POS=(17,13),                                            X04370000
               LENGTH=08,                                              X04380000
               ATTRB=(ASKIP,NORM),                                     X04390000
               COLOR=BLUE                                               04400000
ADESC11 DFHMDF POS=(17,24),                                            X04410000
               LENGTH=15,                                              X04420000
               ATTRB=(ASKIP,NORM),                                     X04430000
               COLOR=BLUE                                               04440000
ALNST11 DFHMDF POS=(17,40),                                            X04450000
               LENGTH=08,                                              X04460000
               ATTRB=(ASKIP,NORM),                                     X04470000
               COLOR=BLUE                                               04480000
ARDM11  DFHMDF POS=(17,49),                                            X04490000
               LENGTH=20,                                              X04500000
               ATTRB=(ASKIP,NORM),                                     X04510000
               COLOR=BLUE                                               04520000
******************************************************************      04530000
ASEL12  DFHMDF POS=(18,01),                                            X04540000
               LENGTH=01,                                              X04550000
               ATTRB=(UNPROT,NORM),                                    X04560000
               HILIGHT=UNDERLINE,                                      X04570000
               COLOR=GREEN                                              04580000
AACT12  DFHMDF POS=(18,03),                                            X04590000
               LENGTH=03,                                              X04600000
               ATTRB=(ASKIP,NORM),                                     X04610000
               COLOR=BLUE                                               04620000
APLNE12 DFHMDF POS=(18,08),                                            X04630000
               LENGTH=04,                                              X04640000
               ATTRB=(ASKIP,NORM),                                     X04650000
               PICOUT='ZZZZ',                                          X04660000
               COLOR=BLUE                                               04670000
ASKU12  DFHMDF POS=(18,13),                                            X04680000
               LENGTH=08,                                              X04690000
               ATTRB=(ASKIP,NORM),                                     X04700000
               COLOR=BLUE                                               04710000
ADESC12 DFHMDF POS=(18,24),                                            X04720000
               LENGTH=15,                                              X04730000
               ATTRB=(ASKIP,NORM),                                     X04740000
               COLOR=BLUE                                               04750000
ALNST12 DFHMDF POS=(18,40),                                            X04760000
               LENGTH=08,                                              X04770000
               ATTRB=(ASKIP,NORM),                                     X04780000
               COLOR=BLUE                                               04790000
ARDM12  DFHMDF POS=(18,49),                                            X04800000
               LENGTH=20,                                              X04810000
               ATTRB=(ASKIP,NORM),                                     X04820000
               COLOR=BLUE                                               04830000
******************************************************************      04840000
******************************************************************      04850000
        DFHMDF POS=(19,45),                                            X04860000
               LENGTH=25,                                              X04870000
               ATTRB=(ASKIP,NORM),                                     X04880000
               COLOR=NEUTRAL,                                          X04890000
               INITIAL='NUMBER OF SELECTED ITEMS:'                      04900000
ASELIT  DFHMDF POS=(19,72),                                            X04910000
               LENGTH=07,                                              X04920000
               ATTRB=(ASKIP,NORM),                                     X04930000
               COLOR=BLUE,                                             X04940000
               PICOUT='ZZZ,ZZ9',                                       X04950000
               INITIAL='999,999'                                        04960000
        DFHMSD TYPE=FINAL                                               04970000
        END                                                             04980000
