000100******************************************************************00010019
000200*    CENTRAL STOCK TRANSFER RECORD FROM XXXXXXXXXX.               00020019
000300******************************************************************00030019
000400                                                                  00040019
000500 01  CE012-CENTRAL-STK-XFER-RECORD.                               00050019
000600     05  CE012-BTCH-PRC-DTE    PIC X(10)     VALUE SPACES.        00060019
000700     05  CE012-PULL-NBR        PIC 9(08)     VALUE ZEROES.        00070019
000800     05  CE012-PULL-LNE-NBR    PIC 9(04)     VALUE ZEROES.        00080019
000900     05  CE012-BATCH-NMBR      PIC 9(04)     VALUE ZEROES.        00090019
001000     05  CE012-SKU.                                               00100022
001100         10  CE012-DEPT        PIC X(03)     VALUE SPACES.        00110019
001200         10  CE012-CLASS       PIC X(02)     VALUE SPACES.        00120019
001300         10  CE012-SEQ         PIC X(03)     VALUE SPACES.        00130024
001400     05  CE012-FILLED-DATE-MMDDCCYY.                              00140019
001500         10  CE012-FILLED-DATE-MMDDCCYY-MM                        00150019
001600                               PIC 9(02)     VALUE ZEROES.        00160019
001700         10  CE012-FILLED-DATE-MMDDCCYY-DD                        00170019
001800                               PIC 9(02)     VALUE ZEROES.        00180019
001900         10  CE012-FILLED-DATE-MMDDCCYY-CC                        00190019
002000                               PIC 9(02)     VALUE ZEROES.        00200019
002100         10  CE012-FILLED-DATE-MMDDCCYY-YY                        00210019
002200                               PIC 9(02)     VALUE ZEROES.        00220019
002300     05  CE012-DC-STORE-NMBR   PIC 9(04)     VALUE ZEROES.        00230019
002400     05  CE012-TOTAL-QTY       PIC 9(07)     VALUE ZEROES.        00240020
002500     05  CE012-UNIT-PRICE      PIC 9(05)V99  VALUE ZEROES.        00250020
002600     05  CE012-RECV-STORE-NMBR PIC 9(04)     VALUE ZEROES.        00260019
002700     05  CE012-RECV-STORE-QTY  PIC 9(05)     VALUE ZEROES.        00270020
002800     05  CE012-SOURCE-CDE      PIC X(01)     VALUE SPACES.        00280019
002900         88  CE012-ONLINE-SOURCE             VALUE 'O'.           00290019
003000         88  CE012-MANIFEST-SOURCE           VALUE 'M'.           00300019
003100         88  CE012-ADJUST-SOURCE             VALUE 'A'.           00310019
000600     05  CE012-SKU-NBR         PIC X(08)     VALUE SPACES.        00311024
003200     05  FILLER                PIC X(22)     VALUE SPACES.        00320022
