000100************************************************************      00010000
000200*    CERD048 - LAYOUT FOR PROCESSED PULL AND CARTON DATA   *      00020001
000210*            - CREATED BY PERFORMANCE TEAM                 *      00021000
000220*    RECORD LENGTH: 100 BYTES                              *      00022000
000230************************************************************      00023000
000240                                                                  00024000
000250 01  CE048-PULL-BRCD-EXTRACT-REC.                                 00025000
000260     05  CE048-SHIPT-UNT-ID            PIC  X(20).                00026000
000270     05  CE048-CNSTK-REQ-PL-NBR        PIC  9(10).                00027000
000280     05  CE048-PL-LNE-NBR              PIC  9(05).                00028000
000290     05  CE048-SKU-NUMBER              PIC  9(08).                00029000
000300     05  CE048-STORE-NUMBER            PIC  9(04).                00030000
000400     05  CE048-REQ-ORD-QTY             PIC  9(10).                00040000
000500     05  CE048-DC-NUMBER               PIC  9(04).                00050000
000600     05  CE048-STOCK-ORDER-NBR         PIC  9(09).                00060000
000700     05  CE048-ERROR-CODE              PIC  X(01).                00070000
000800         88  CE048-ERR-FIRST-TIME                 VALUE '1'.      00080000
000801         88  CE048-ERR-SECND-TIME                 VALUE '2'.      00080100
000802     05  CE048-ERROR-DATE              PIC  X(10).                00080200
000803     05  CE048-BATCH-NBR               PIC  9(07).                00080300
000804     05  FILLER                        PIC  X(12).                00080400
