000100************************************************************              
000200*    RECORD PURPOSE: DOWNLOAD STOCK ORDER DTL TO RETEK RDM *              
000300*    RECORD LENGTH:  118 BYTES                             *              
000400*    RECORD FORMAT:  SEQUENTIAL                            *              
000500************************************************************              
000600                                                                          
000700 01  CE021-SODTL-DOWNLOAD-REC.                                            
000800     05  CE021-ACTION-TYPE       PIC X(01)     VALUE SPACES.              
000900         88  CE021-ADD                         VALUE 'A'.                 
001000         88  CE021-MODIFY                      VALUE 'M'.                 
001100         88  CE021-DELETE                      VALUE 'D'.                 
001200     05  FILLER                  PIC X(01)     VALUE SPACES.              
001300     05  CE021-LOCATION          PIC 9(04).                               
001400     05  FILLER                  PIC X(01)     VALUE SPACES.              
001500     05  CE021-TRANS-DATE-TIME   PIC 9(12).                               
001600     05  FILLER                  PIC X(01)     VALUE SPACES.              
001700     05  CE021-DISTRO-NUMBER     PIC X(09).                               
001800     05  FILLER                  PIC X(01)     VALUE SPACES.              
001900     05  CE021-ITEM-NUMBER       PIC X(16).                               
002000     05  CE021-SKU-NBR REDEFINES CE021-ITEM-NUMBER.                       
002400         10  CE021-SKU           PIC 9(08).                               
002400         10  FILLER              PIC X(08).                               
002500     05  FILLER                  PIC X(01)     VALUE SPACES.              
002600     05  CE021-RQST-UNIT-QTY     PIC 9(08).9(4).                          
002700     05  FILLER                  PIC X(01)     VALUE SPACES.              
002800     05  CE021-DEST-ID           PIC 9(04).                               
002900     05  FILLER                  PIC X(01)     VALUE SPACES.              
003000     05  CE021-RETAIL-PRICE      PIC 9(05).9(02).                         
003100     05  FILLER                  PIC X(01)     VALUE SPACES.              
003200     05  CE021-PRT-UPC-FLAG      PIC X(01).                               
003300     05  FILLER                  PIC X(01)     VALUE SPACES.              
003400     05  CE021-TICKET-TYPE       PIC X(04).                               
003500     05  FILLER                  PIC X(01)     VALUE SPACES.              
003600     05  CE021-PRIORITY          PIC 9(04).                               
003700     05  FILLER                  PIC X(01)     VALUE SPACES.              
003800     05  CE021-EXPEDITE-FLAG     PIC X(01).                               
003900     05  FILLER                  PIC X(01)     VALUE SPACES.              
004000     05  CE021-AMOUNT-1          PIC 9(12).9999.                          
004100     05  FILLER                  PIC X(01)     VALUE SPACES.              
004200     05  CE021-AMOUNT-2          PIC 9(12).9999.                          
004300     05  FILLER                  PIC X(01)     VALUE SPACES.              
004400     05  CE021-AMOUNT-3          PIC 9(12).9999.                          
004300     05  FILLER                  PIC X(01)     VALUE SPACES.              
004400     05  CE021-ITEM-STATUS       PIC X(01).                               
004300     05  FILLER                  PIC X(01)     VALUE SPACES.              
004400     05  CE021-ORDER-DETAIL-UDA1 PIC X(10).                               
004300     05  FILLER                  PIC X(01)     VALUE SPACES.              
004400     05  CE021-ORDER-DETAIL-UDA2 PIC X(10).                               
004300     05  FILLER                  PIC X(01)     VALUE SPACES.              
004400     05  CE021-ORDER-DETAIL-UDA3 PIC X(10).                               
004300     05  FILLER                  PIC X(01)     VALUE SPACES.              
004400     05  CE021-ORDER-DETAIL-UDA4 PIC X(20).                               
004300     05  FILLER                  PIC X(01)     VALUE SPACES.              
004400     05  CE021-ORDER-DETAIL-UDA5 PIC X(20).                               
