000100************************************************************      00010000
000110* CERD025                                                  *      00011001
000120************************************************************      00012000
000200*    RECORD PURPOSE: BILL OF LADING CONTAINER ITEM         *      00020000
000300*           UPLOAD FROM RDM TO MVS                         *      00030000
000400*    RECORD LENGTH:  107 BYTES                             *      00040000
000500*    RECORD FORMAT:  SEQUENTIAL                            *      00050000
000600************************************************************      00060000
000700                                                                  00070000
000800 01  CE025-BOL-CONTAINER-ITEM-REC.                                00080000
000900     05  CE025-LOCATION          PIC 9(04)     VALUE ZEROS.       00090000
001000     05  FILLER                  PIC X(01)     VALUE SPACES.      00100000
001100     05  CE025-BATCH-NBR         PIC 9(07)     VALUE ZEROS.       00110000
001200     05  FILLER                  PIC X(01)     VALUE SPACES.      00120000
001300     05  CE025-BOL-NBR           PIC 9(09)     VALUE ZEROS.       00130000
001400     05  FILLER                  PIC X(01)     VALUE SPACES.      00140000
001500     05  CE025-CONTAINER-ID      PIC X(20)     VALUE ZEROS.       00150000
001600     05  FILLER                  PIC X(01)     VALUE SPACES.      00160000
001700     05  CE025-ITEM-NBR          PIC X(16)     VALUE SPACES.      00170000
001800     05  FILLER                  PIC X(01)     VALUE SPACES.      00180000
001900     05  CE025-DISTRIBUTION-NBR  PIC X(09)     VALUE ZEROS.       00190000
002000     05  FILLER                  PIC X(01)     VALUE SPACES.      00200000
002100     05  CE025-UNIT-QTY          PIC 9(08)     VALUE ZEROS.       00210000
002200     05  FILLER                  PIC X(01)     VALUE SPACES.      00220000
002300     05  CE025-SHIPPED-WGT       PIC X(13)     VALUE ZEROS.       00230000
002400*        9(8)V9(4)                                                00240000
002500     05  FILLER                  PIC X(01)     VALUE SPACES.      00250000
002600     05  CE025-ALLOCATED-WGT     PIC X(13)     VALUE ZEROS.       00260000
002700*        9(8)V9(4)                                                00270000
