000100************************************************************      00010000
000200* CERD016                                                  *      00020000
000300************************************************************      00030000
000400*    RECORD PURPOSE: CENTRAL STOCK TRANSACTIONS TO RDM     *      00040000
000500*    RECORD LENGTH:   85 BYTES                             *      00050000
000600*    RECORD FORMAT:  SEQUENTIAL                            *      00060000
000700************************************************************      00070000
000800 01  CE016-INV-TRANS-RECORD.                                      00080000
000900     05  CE016-SKU-NUMBER          PIC X(08)  VALUE SPACES.       00090000
001000     05  CE016-STORE-NUMBER        PIC 9(04)  VALUE ZEROES.       00100000
001100     05  CE016-TRANS-TYPE-CODE     PIC X(01).                     00110000
001200         88  CE016-TRANS-TYPE-GET             VALUE 'G'.          00120000
001300         88  CE016-TRANS-TYPE-TRANSFER        VALUE 'T'.          00130000
001400         88  CE016-TRANS-TYPE-X-TRANSFER      VALUE 'X'.          00140000
001410         88  CE016-TRANS-TYPE-ADJ             VALUE 'A'.          00141000
001420     05  CE016-TRANS-SOURCE-CODE   PIC X(01).                     00142000
001430         88  CE016-TRANS-SRC-CENTRAL-STOCK    VALUE 'C'.          00143001
001440     05  CE016-TRANS-SOURCE-DESC   PIC X(40)  VALUE SPACES.       00144000
001450     05  CE016-TRANS-DATE          PIC X(10)  VALUE SPACES.       00145000
001460     05  CE016-TRANS-RESV-QTY      PIC -9(9)  VALUE ZEROES.       00146000
001461     05  CE016-TRANS-AVAIL-QTY     PIC -9(9)  VALUE ZEROES.       00146100
001462     05  CE016-TRANS-SUCCESS-IND   PIC X(01).                     00146200
001463         88  CE016-TRANS-SUCCESSFUL           VALUE 'Y'.          00146300
001464         88  CE016-TRANS-NOT-SUCCESSFUL       VALUE 'N'.          00146400
