000100************************************************************      00010000
000200* CERD015                                                  *      00020000
000300************************************************************      00030000
000400*    RECORD PURPOSE: RECEIPT UPLOAD FROM RDM TO HOST (IBM) *      00040000
000500*    RECORD LENGTH:  158 BYTES                             *      00050000
000600*    RECORD FORMAT:  SEQUENTIAL                            *      00060000
000700************************************************************      00070000
000800                                                                  00080000
000900 01  CE015-RECEIPT-UPLOAD-RECORD.                                 00090000
001000     05  CE015-LOCATION          PIC 9(04)     VALUE ZEROS.       00100000
001100     05  FILLER                  PIC X(01)     VALUE SPACES.      00110000
001200     05  CE015-BATCH-NBR         PIC 9(07)     VALUE ZEROS.       00120000
001300     05  FILLER                  PIC X(01)     VALUE SPACES.      00130000
001400     05  CE015-PO-NBR            PIC X(09)     VALUE ZEROS.       00140000
001500     05  FILLER                  PIC X(01)     VALUE SPACES.      00150000
001600     05  CE015-ITEM-NBR          PIC X(16)     VALUE ZEROS.       00160000
001700     05  FILLER                  PIC X(01)     VALUE SPACES.      00170000
001800     05  CE015-UNIT-QTY         PIC +9(8).9(4) VALUE ZEROS.       00180000
001900     05  FILLER                  PIC X(01)     VALUE SPACES.      00190000
002000     05  CE015-TRANS-TYPE        PIC X(01)     VALUE ZEROS.       00200000
002100         88  CE015-ADJUST-TRANS                VALUE 'A'.         00210000
002200         88  CE015-RECEIPT-TRANS               VALUE 'R'.         00220000
002300     05  FILLER                  PIC X(01)     VALUE SPACES.      00230000
002400     05  CE015-TRANS-DATE.                                        00240000
002500         10  CE015-TRANS-YR      PIC 9(04)     VALUE ZEROES.      00250000
002600         10  CE015-TRANS-MO      PIC 9(02)     VALUE ZEROES.      00260000
002700         10  CE015-TRANS-DA      PIC 9(02)     VALUE ZEROES.      00270000
002800         10  CE015-TRANS-HR      PIC 9(02)     VALUE ZEROES.      00280000
002900         10  CE015-TRANS-MI      PIC 9(02)     VALUE ZEROES.      00290000
003000     05  FILLER                  PIC X(01)     VALUE SPACES.      00300000
003100     05  CE015-RECEIPT-NBR       PIC 9(9)      VALUE ZEROS.       00310000
003200     05  FILLER                  PIC X(01)     VALUE SPACES.      00320000
003300     05  CE015-ASN-NBR           PIC X(20)     VALUE SPACES.      00330000
003400     05  FILLER                  PIC X(01)     VALUE SPACES.      00340000
003500     05  CE015-DEST-ID           PIC X(04)     VALUE SPACES.      00350000
003600     05  FILLER                  PIC X(01)     VALUE SPACES.      00360000
003700     05  CE015-UID               PIC X(10)     VALUE SPACES.      00370000
003800     05  FILLER                  PIC X(01)     VALUE SPACES.      00380000
003900     05  CE015-APPOINT-NBR       PIC X(09)     VALUE SPACES.      00390000
004000     05  FILLER                  PIC X(01)     VALUE SPACES.      00400000
004100     05  CE015-CONTAINER-ID      PIC X(20)     VALUE SPACES.      00410000
004200     05  FILLER                  PIC X(01)     VALUE SPACES.      00420000
004300     05  FILLER                  PIC X(10)     VALUE SPACES.      00430000
004400*    05  CE015-EXPTD-WGT         PIC 9(8)V9(4) VALUE ZEROS.       00440000
