000100******************************************************************00010000
000200**                        CERD026                               **00020001
000300**                                                              **00030000
000400**  THIS IS THE FILE LAYOUT TO BE USED FOR COMBINE THE RDM      **00040000
000500**  BILL OF LADING CONTAINER UPLOAD LAYOUT (CERD024) AND THE    **00050001
000600**  BILL OF LADING CONTAINER/ITEM UPLOAD LAYOUT (CERD025) SO    **00060001
000700**  THAT THE DATA CAN BE INSERTED INTO THE CENTRAL STOCK PULL   **00070000
000800**  REQUEST STORE MANIFEST DATA TABLE (TCEPLMF).                **00080000
000900**                                                              **00090000
001000**  LENGTH:  150 BYTES                                          **00100000
001100******************************************************************00110000
001200                                                                  00120000
001300 01  CE026-CS-STR-MANIFEST-RECORD.                                00130000
001400     05  CE026-PULL-NBR        PIC 9(08)     VALUE ZEROES.        00140000
001500     05  CE026-PULL-LNE-NBR    PIC 9(04)     VALUE ZEROES.        00150000
001600     05  CE026-DC-STORE-NBR    PIC 9(04)     VALUE ZEROES.        00160000
001700     05  CE026-RECV-STORE-NBR  PIC 9(04)     VALUE ZEROES.        00170000
001800     05  CE026-MANIFEST-DATE.                                     00180000
001900         10  CE026-MANIFEST-DATE-MM                               00190000
002000                               PIC 9(02)     VALUE ZEROES.        00200000
002100         10  CE026-MANIFEST-DATE-DD                               00210000
002200                               PIC 9(02)     VALUE ZEROES.        00220000
002300         10  CE026-MANIFEST-DATE-CC                               00230000
002400                               PIC 9(02)     VALUE ZEROES.        00240000
002500         10  CE026-MANIFEST-DATE-YY                               00250000
002600                               PIC 9(02)     VALUE ZEROES.        00260000
002700     05  CE026-MANIFEST-QTY    PIC 9(07)     VALUE ZEROES.        00270000
002800     05  CE026-BOL-NBR         PIC X(30)     VALUE SPACES.        00280000
002900     05  CE026-RDM-BATCH-NBR   PIC 9(07)     VALUE ZEROES.        00290000
003000     05  CE026-RDM-ITEM-ID     PIC X(16)     VALUE SPACES.        00300000
003100     05  CE026-VALID-RCD-IND   PIC X(01)     VALUE 'Y'.           00310000
003200         88  CE026-VALID-RECORD              VALUE 'Y'.           00320000
003300         88  CE026-INVALID-RECORD            VALUE 'N'.           00330000
003400     05  CE026-VALID-PULL-CDE  PIC X(01)     VALUE 'V'.           00340000
003500         88  CE026-VALID-PULL-NBR            VALUE 'V'.           00350000
003600         88  CE026-PULL-NBR-NOT-FOUND        VALUE 'A'.           00360000
003700         88  CE026-CANCEL-PULL-NBR           VALUE 'B'.           00370000
003800         88  CE026-POSTED-PULL-NBR           VALUE 'C'.           00380000
003900     05  CE026-VALID-LINE-CDE  PIC X(01)     VALUE 'V'.           00390000
004000         88  CE026-VALID-LINE-NBR            VALUE 'V'.           00400000
004100         88  CE026-LINE-NBR-NOT-FOUND        VALUE 'A'.           00410000
004200         88  CE026-CANCEL-LINE-NBR           VALUE 'B'.           00420000
004300         88  CE026-POSTED-LINE-NBR           VALUE 'C'.           00430000
004400     05  CE026-VALID-DC-CDE    PIC X(01)     VALUE 'V'.           00440000
004500         88  CE026-VALID-DC-NBR              VALUE 'V'.           00450000
004600         88  CE026-INVALID-DC-NBR            VALUE 'N'.           00460000
004700     05  CE026-VALID-STR-CDE   PIC X(01)     VALUE 'V'.           00470000
004800         88  CE026-VALID-STR-NBR             VALUE 'V'.           00480000
004900         88  CE026-STR-NOT-ON-PULL           VALUE 'A'.           00490000
005000     05  FILLER                PIC X(57)     VALUE SPACES.        00500000
