000100************************************************************      00010000
000110* CERD017                                                  *      00011000
000120************************************************************      00012000
000200*    RECORD PURPOSE: INVENTORY ADJUSTMENT UPLOAD           *      00020000
000210*                    PROCESSING RESULTS                    *      00021000
000400*    RECORD LENGTH:  150 BYTES                             *      00040002
000500*    RECORD FORMAT:  SEQUENTIAL                            *      00050000
000600************************************************************      00060000
000700                                                                  00070000
000800 01  CE017-INV-ADJ-UPLOAD-RECORD.                                 00080000
000900     05  CE017-CNSTK-LOC-ID           PIC 9(04)     VALUE ZEROS.  00090001
001100     05  CE017-BTCH-NBR               PIC X(04)     VALUE SPACES. 00110001
001200     05  CE017-BTCH-PRC-DTE.                                      00120001
001210         10  CE017-BTCH-PRC-DTE-MM    PIC X(2)      VALUE SPACES. 00121001
001220         10  FILLER                   PIC X(1)      VALUE '/'.    00122001
001230         10  CE017-BTCH-PRC-DTE-DD    PIC X(2)      VALUE SPACES. 00123001
001240         10  FILLER                   PIC X(1)      VALUE '/'.    00124001
001250         10  CE017-BTCH-PRC-DTE-YYYY  PIC X(4)      VALUE SPACES. 00125001
001300     05  CE017-DEPT-NBR               PIC 9(04)     VALUE ZEROS.  00130001
001310     05  CE017-CLASS-NBR              PIC 9(04)     VALUE ZEROS.  00131001
001320     05  CE017-SUB-CLASS-NBR          PIC 9(04)     VALUE ZEROS.  00132001
001400     05  CE017-ITEM-NBR               PIC X(08)     VALUE SPACES. 00140001
001410     05  CE017-ITEM-DESCRIPTION       PIC X(25)     VALUE SPACES. 00141001
001500     05  CE017-ADJ-UNIT-QTY           PIC S9(07)    VALUE ZEROS.  00150001
001600     05  CE017-UNIT-PRICE             PIC S9(05)V99 VALUE ZEROES. 00160001
001700     05  CE017-UNIT-PRICE-EXT         PIC S9(07)V99 VALUE ZEROES. 00170001
001800     05  CE017-ADJ-REASON-CDE         PIC X(2)      VALUE ZEROS.  00180001
001900         88  CE017-DMGD-GAIN-RMVING-TRBL            VALUE '01'.   00190001
002000         88  CE017-GAIN-SYSTEM-STATUP               VALUE '10'.   00200001
002100         88  CE017-GAIN-LOSS-ITM-ID-XFER            VALUE '20'.   00210001
002200         88  CE017-GAIN-LOSS-UNIT-PICK              VALUE '30'.   00220001
002200         88  CE017-GAIN-LOSS-FROM-PTS               VALUE '35'.   00221003
002300         88  CE017-GAIN-LOSS-CYCLE-CNT-CHG          VALUE '42'.   00230001
002400         88  CE017-GAIN-LOSS-MULT-SKU-PUTWY         VALUE '50'.   00240001
002500         88  CE017-INV-ADJ-FROM-RETURNS             VALUE '60'.   00250001
002600         88  CE017-RETURN-TO-INVENTORY              VALUE '70'.   00260001
002700         88  CE017-LOSS-MARKING-TRBL                VALUE '80'.   00270001
002800         88  CE017-LOSS-FROM-RTV                    VALUE '90'.   00280001
002900         88  CE017-RECEIPT-ADJUSTMENT               VALUE '95'.   00290001
003000         88  CE017-GENERAL-GAIN-LOSS                VALUE '99'.   00300001
003010     05  CE017-ERROR-REASON-CDE       PIC X(2)      VALUE ZEROS.  00301001
003020         88  CE017-VALID-ADJUSTMENT                 VALUE '00'.   00302001
003021         88  CE017-INVALID-LOCATION                 VALUE '01'.   00302101
003030         88  CE017-INVALID-ITEM                     VALUE '02'.   00303001
006400     05  FILLER                       PIC X(50)     VALUE SPACES. 00640002
