000100******************************************************************00010000
000200**                        CEWS001                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040000
000500**  CENTRAL STOCK INTERFACE CRIT SPEC SCREEN                    **00050000
000600**  LENGTH:  200 BYTES                                          **00060000
000600**  07/21/20 CLT WR#38786 ADDED MAJ/SUB CLASS                   **00061003
000700******************************************************************00070000
000800         10  CE001-INTER-APPL-COMMAREA  REDEFINES                 00080000
000900             INTER-APPL-COMM-AREA.                                00090000
001000             15  FILLER                         PIC  X(01).       00100000
001004             15  CE001-CURR-OPER-UNT-ID         PIC  X(04).       00100100
001005             15  CE001-CURR-OPER-UNT-ID-N REDEFINES               00100200
001006                     CE001-CURR-OPER-UNT-ID     PIC  9(04).       00100300
001007             15  CE001-CURR-FCLTY-ID            PIC  X(04).       00100400
001008             15  CE001-CURR-FCLTY-ID-N REDEFINES                  00100500
001009                     CE001-CURR-FCLTY-ID        PIC  9(04).       00100600
001010             15  CE001-CS-LOCATION              PIC  X(04).       00100700
001011             15  CE001-CS-PRINTER-ID            PIC  X(08).       00100800
001013             15  CE001-PULL-NBR                 PIC S9(09) COMP.  00100900
001020             15  CE001-REF-NBR                  PIC  X(15).       00101000
001030             15  CE001-PULL-SELECT-STATUS       PIC  X(01).       00102000
001031                 88  CE001-SELECT-ALL                VALUE 'A'.   00103000
001032                 88  CE001-SELECT-CNCLD              VALUE 'C'.   00103100
001033                 88  CE001-SELECT-DSTRB              VALUE 'D'.   00103200
001034                 88  CE001-SELECT-INPROC             VALUE 'I'.   00103300
001035                 88  CE001-SELECT-NEW                VALUE 'N'.   00103400
001036                 88  CE001-SELECT-POSTD              VALUE 'P'.   00103500
001040             15  CE001-PULL-SELECT-TYPE         PIC  X(01).       00103600
001041                 88  CE001-SELECT-SRC-ALL            VALUE 'A'.   00103700
001042                 88  CE001-SELECT-SRC-ADAM           VALUE 'D'.   00103800
001043                 88  CE001-SELECT-SRC-INFOREM        VALUE 'I'.   00103900
001044                 88  CE001-SELECT-SRC-MANUAL         VALUE 'M'.   00104000
001044                 88  CE001-SELECT-SRC-XFER           VALUE 'X'.   00104100
001050             15  CE001-PULL-SELECT-DATE-FROM    PIC  9(08).       00104200
001051             15  CE001-PULL-SELECT-DATE-TO      PIC  9(08).       00104300
001052             15  CE001-SELECT-LIST-SEQUENCE     PIC  X(01).       00104400
001056                 88  CE001-LIST-SEQ-PL-NBR           VALUE 'P'.   00104500
001057                 88  CE001-LIST-SEQ-CR-DTE           VALUE 'D'.   00104600
001058             15  CE001-CURR-PULL-STATUS         PIC  X(02).       00104700
001059                 88  CE001-PULL-CANCELLED            VALUE 'CA'.  00104800
001060                 88  CE001-PULL-DISTRIBUTED          VALUE 'DS'.  00104900
001061                 88  CE001-PULL-IN-PROCESS           VALUE 'IP'.  00105000
001062                 88  CE001-PULL-NEW                  VALUE 'NW'.  00106000
001063                 88  CE001-PULL-POSTED               VALUE 'PD'.  00106100
001064             15  CE001-CURR-PULL-TYPE           PIC  X(02).       00106200
001065                 88  CE001-PULL-SRC-ADAM             VALUE 'AD'.  00106300
001066                 88  CE001-PULL-SRC-INFOREM          VALUE 'IN'.  00106400
001070                 88  CE001-PULL-SRC-MANUAL           VALUE 'MA'.  00106500
001070                 88  CE001-PULL-SRC-XFER             VALUE 'XF'.  00106600
001080             15  CE001-DEPT-NBR                 PIC  X(03).       00106700
001080             15  CE001-MAJ-CLASS                PIC  X(02).       00106801
001080             15  CE001-SUB-CLASS                PIC  X(02).       00106902
003020             15  FILLER                         PIC  X(130).      00107002
