000100******************************************************************00010005
000200*    THIS COPYBOOK REFLECTS THE COMMAREA LAYOUT TO PASS DATA     *00020001
000300*    TO THE CENTRAL STOCK PRINT MODULE (CEKCS609)                *00030001
000400******************************************************************00040001
000500 01  CE004-COMMAREA-REC.                                          00050007
000600     05  CE004-PROGRAM-INITIATED        PIC  X(01) VALUE SPACE.   00060001
000700         88  CE004-CICS-LINK                       VALUE 'L'.     00070001
000800         88  CE004-CICS-START                      VALUE 'S'.     00080001
000900         88  CE004-CICS-XCTL                       VALUE 'X'.     00090001
001000     05  CE004-CALLING-PGM-NME         PIC  X(08)  VALUE SPACES.  00100003
001100         88  CE004-FROM-CRIT-SPEC           VALUE 'CEKCS600'.     00110003
001200         88  CE004-FROM-PULL-LIST           VALUE 'CEKCS601'.     00120003
001300         88  CE004-FROM-ITEM-LIST           VALUE 'CEKCS602'.     00130003
001400         88  CE004-FROM-PULL-CRE            VALUE 'CEKCS604'.     00140004
001500         88  CE004-FROM-STARTED-TASK        VALUE 'CEKCS611'.     00150004
001600     05  CE004-CALL-RETURN-AREA.                                  00160004
001700         10  CE004-PRT-RET-CDE         PIC  X(02)  VALUE SPACES.  00170004
001800             88  CE004-PRT-SUCCESSFUL              VALUE '00'.    00180004
001900             88  CE004-PRT-INVALID                 VALUE '01'.    00190004
002000         10  CE004-PRT-RET-MSG         PIC  X(25)  VALUE SPACES.  00200005
002100         10  CE004-PRT-REQ-ID          PIC  X(08)  VALUE SPACES.  00210005
002200     05  CE004-CURR-OPER-UNT-ID         PIC  X(04) VALUE ZEROES.  00220004
002300     05  CE004-CURR-OPER-UNT-ID-N REDEFINES                       00230004
002400             CE004-CURR-OPER-UNT-ID     PIC  9(04).               00240004
002500     05  CE004-CURR-FCLTY-ID            PIC  X(04) VALUE ZEROES.  00250004
002600     05  CE004-CURR-FCLTY-ID-N REDEFINES                          00260004
002700             CE004-CURR-FCLTY-ID        PIC  9(04).               00270004
002800     05  CE004-CS-LOCATION              PIC  9(04) VALUE ZEROES.  00280004
002900     05  CE004-CS-PRINTER-ID            PIC  X(08) VALUE SPACES.  00290004
003000     05  CE004-PULL-NBR                 PIC  9(09) VALUE ZEROES.  00300004
003100     05  CE004-REF-NBR                  PIC  X(15) VALUE SPACES.  00310004
003200     05  CE004-LINE-NBR                 PIC  9(04) VALUE ZEROES.  00320004
003300     05  CE004-PULL-SELECT-STATUS       PIC  X(01) VALUE SPACE.   00330004
003400         88  CE004-SELECT-ALL                      VALUE 'A'.     00340004
003500         88  CE004-SELECT-CNCLD                    VALUE 'C'.     00350004
003600         88  CE004-SELECT-DSTRB                    VALUE 'D'.     00360004
003700         88  CE004-SELECT-INPROC                   VALUE 'I'.     00370004
003800         88  CE004-SELECT-NEW                      VALUE 'N'.     00380004
003900         88  CE004-SELECT-POSTD                    VALUE 'P'.     00390004
004000     05  CE004-PULL-SELECT-TYPE         PIC  X(01) VALUE SPACE.   00400004
004100         88  CE004-SELECT-SRC-ALL                  VALUE 'A'.     00410004
004200         88  CE004-SELECT-SRC-ADAM                 VALUE 'D'.     00420004
004300         88  CE004-SELECT-SRC-INFOREM              VALUE 'I'.     00430004
004400         88  CE004-SELECT-SRC-MANUAL               VALUE 'M'.     00440004
004400         88  CE004-SELECT-SRC-XFER                 VALUE 'X'.     00441010
004500     05  CE004-PULL-SELECT-DATE-FROM    PIC  9(08) VALUE ZEROES.  00450004
004600     05  CE004-PULL-SELECT-DATE-TO      PIC  9(08) VALUE ZEROES.  00460004
004700     05  CE004-SELECT-LIST-SEQUENCE     PIC  X(01) VALUE SPACE.   00470004
004800         88  CE004-LIST-SEQ-PL-NBR                 VALUE 'P'.     00480004
004900         88  CE004-LIST-SEQ-CR-DTE                 VALUE 'D'.     00490004
005000     05  CE004-PULL-STATUS              PIC  X(02) VALUE SPACES.  00500004
005100         88  CE004-PULL-CANCELLED                  VALUE 'CA'.    00510004
005200         88  CE004-PULL-DISTRIBUTED                VALUE 'DS'.    00520004
005300         88  CE004-PULL-IN-PROCESS                 VALUE 'IP'.    00530004
005400         88  CE004-PULL-NEW                        VALUE 'NW'.    00540004
005500         88  CE004-PULL-POSTED                     VALUE 'PD'.    00550004
005600     05  CE004-PULL-STATUS-DATE         PIC  X(10) VALUE SPACES.  00560004
005700     05  CE004-PULL-SOURCE              PIC  X(02) VALUE SPACES.  00570004
005800         88  CE004-PULL-SRC-ADAM                   VALUE 'MA'.    00580008
005900         88  CE004-PULL-SRC-INFOREM                VALUE 'MR'.    00590008
006000         88  CE004-PULL-SRC-MANUAL                 VALUE 'UC'.    00600008
006000         88  CE004-PULL-SRC-XFER                   VALUE 'XF'.    00600110
006010     05  CE004-LINE-STATUS              PIC  X(02) VALUE SPACES.  00601006
006020         88  CE004-LINE-CANCELLED                  VALUE 'CA'.    00602006
006030         88  CE004-LINE-DISTRIBUTED                VALUE 'DS'.    00603006
006040         88  CE004-LINE-IN-PROCESS                 VALUE 'IP'.    00604006
006050         88  CE004-LINE-NEW                        VALUE 'NW'.    00605006
006060         88  CE004-LINE-POSTED                     VALUE 'PD'.    00606006
006100                                                                  00610004
006200     05  CE004-NBR-ITEMS                PIC  9(05) VALUE ZEROES.  00620004
006210     05  CE004-NBR-STORES               PIC  9(04) VALUE ZEROES.  00621006
006300     05  CE004-REQ-PULL-UNITS           PIC  9(06) VALUE ZEROES.  00630004
006400     05  CE004-ACT-PULL-UNITS           PIC  9(06) VALUE ZEROES.  00640004
006500     05  CE004-DISTRBUTED-UNITS         PIC  9(06) VALUE ZEROES.  00650004
006510     05  CE004-USER-ID                  PIC  X(08) VALUE SPACES.  00651009
006600     05  FILLER                         PIC  X(25) VALUE SPACE.   00660009
006700                                                                  00670001
