000001******************************************************************00000100
000002**                        CEWS006                               **00000200
000003**                                                              **00000300
000004**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00000400
000005**  CENTRAL STOCK INTERFACE SYSTEM - ADD/CREATE PULL            **00000500
000006**  LENGTH:  200 BYTES                                          **00000600
000007******************************************************************00000700
000008         10  CE006-INTER-APPL-COMMAREA  REDEFINES                 00000801
000009                                        INTER-APPL-COMM-AREA.     00000901
000010             15  FILLER                         PIC X.            00001004
000011             15  CE006-CURR-OPER-UNT-ID         PIC  X(04).       00001101
000014             15  CE006-CURR-OPER-UNT-ID-N REDEFINES               00001401
000015                     CE006-CURR-OPER-UNT-ID     PIC  9(04).       00001501
000016             15  CE006-CURR-FCLTY-ID            PIC  X(04).       00001601
000018             15  CE006-CURR-FCLTY-ID-N REDEFINES                  00001801
000019                     CE006-CURR-FCLTY-ID        PIC  9(04).       00001901
000020             15  CE006-CS-LOCATION              PIC S9(04) COMP.  00002001
000023             15  CE006-CS-PRINTER-ID            PIC  X(08).       00002301
000024             15  CE006-PULL-NBR                 PIC S9(09) COMP.  00002401
000026             15  CE006-REF-NBR                  PIC  X(15).       00002602
000027             15  CE006-USER-ID                  PIC  X(08).       00002701
000028             15  CE006-STORE-NBR                PIC  9(04).       00002801
000028             15  CE006-PULL-TYPE                PIC  X(02).       00002905
000036*                                                                 00003600
000060             15  FILLER                         PIC  X(148).      00006005
000070                                                                  00007000
