000100******************************************************************00010000
000200*  CALL LIST TRANSACTION ID INCIDENT EXCEPTION RECORD.  THE      *00020000
000300*  RECORD LENGTH IS 80 BYTES.                                    *00030000
000400******************************************************************00040000
000500                                                                  00050000
000600 01  CM007-TRANSACTION-EXCP-RECORD.                               00060000
000700     05  CM007-TRANSACTION-ID    PIC X(4)     VALUE SPACES.       00070000
000710     05  FILLER                  PIC X(1)     VALUE SPACES.       00071000
000720     05  CM007-SUPPRESS-INCIDENT-IND                              00072001
000721                                 PIC X(1)     VALUE SPACES.       00072100
000722         88  CM007-SUPPRESS-INCIDENT          VALUE 'Y'.          00072201
000730     05  FILLER                  PIC X(1)     VALUE SPACES.       00073000
000740     05  CM007-OVERRIDE-IMPACT   PIC X(1)     VALUE SPACES.       00074000
000750     05  FILLER                  PIC X(1)     VALUE SPACES.       00075000
000760     05  CM007-OVERRIDE-URGENCY  PIC X(1)     VALUE SPACES.       00076000
000770     05  FILLER                  PIC X(1)     VALUE SPACES.       00077000
000780     05  CM007-OVERRIDE-ASSIGNMENT-GRP                            00078002
000790                                 PIC X(60)    VALUE SPACES.       00079000
000800     05  FILLER                  PIC X(9)     VALUE SPACES.       00080000
