000100******************************************************************00010000
000200*  CALL LIST SYSTEM ID DEFAULT ASSIGNMENT GROUP RECORD.  THE     *00020000
000300*  RECORD LENGTH IS 80 BYTES.                                    *00030000
000400******************************************************************00040000
000500                                                                  00050000
000600 01  CM004-SYSID-DFLT-GROUP-RECORD.                               00060000
000700     05  CM004-SYSTEM-ID         PIC X(2)     VALUE SPACES.       00070000
000701     05  FILLER                  PIC X(2)     VALUE SPACES.       00070100
000752     05  CM004-ASSIGNMENT-GROUP  PIC X(76)    VALUE SPACES.       00075200
