000100******************************************************************00010000
000200*  PRODUCTION DATA CHANGE REQUEST CONTROL INFORMATION (BUILT     *00020003
000300*  DURING REQUEST STAGING).  THE RECORD LENGTH IS 120 BYTES.     *00030003
000400******************************************************************00040000
000500                                                                  00050000
000600 01  CM001-PROD-DATA-CONTROL-RECORD.                              00060000
000700     05  CM001-SQL-MEMBER-NAME   PIC X(8)     VALUE SPACES.       00070002
000701     05  FILLER                  PIC X(1)     VALUE SPACES.       00070103
000710     05  CM001-REQUESTER-USERID  PIC X(8)     VALUE SPACES.       00071002
000720     05  CM001-REQUESTER-MANAGER-USERID                           00072001
000721                                 PIC X(8)     VALUE SPACES.       00072102
000730     05  FILLER                  PIC X(1)     VALUE SPACES.       00073002
000740     05  CM001-SUBSYSTEM-ID      PIC X(4)     VALUE SPACES.       00074000
000750     05  FILLER                  PIC X(1)     VALUE SPACES.       00075003
000760     05  CM001-JOB-SUBMISSION-USER                                00076000
000761                                 PIC X(8)     VALUE SPACES.       00076102
000770     05  FILLER                  PIC X(1)     VALUE SPACES.       00077002
000771*  REQUEST STAGE DATE IS '/' SEPARATED.                           00077103
000772     05  CM001-REQUEST-STAGE-DATE                                 00077204
000773                                 PIC X(10)    VALUE SPACES.       00077303
000774     05  FILLER                  REDEFINES                        00077403
000775                                     CM001-REQUEST-STAGE-DATE.    00077503
000776         10  CM001-RS-YEAR       PIC 9(4).                        00077603
000777         10  FILLER              PIC X(1).                        00077703
000778         10  CM001-RS-MONTH      PIC 9(2).                        00077803
000779         10  FILLER              PIC X(1).                        00077903
000780         10  CM001-RS-DAY        PIC 9(2).                        00078003
000781     05  FILLER                  PIC X(1)     VALUE SPACES.       00078103
000782*  REQUEST STAGE TIME IS ':' SEPARATED.                           00078203
000783     05  CM001-REQUEST-STAGE-TIME                                 00078304
000784                                 PIC X(8)     VALUE SPACES.       00078403
000785     05  FILLER                  REDEFINES                        00078503
000786                                     CM001-REQUEST-STAGE-TIME.    00078603
000787         10  CM001-RS-HOUR       PIC 9(2).                        00078703
000788         10  FILLER              PIC X(1).                        00078803
000789         10  CM001-RS-MINUTE     PIC 9(2).                        00078903
000790         10  FILLER              PIC X(1).                        00079003
000791         10  CM001-RS-SECOND     PIC 9(2).                        00079103
000792     05  FILLER                  PIC X(1)     VALUE SPACES.       00079203
000793     05  CM001-REQUEST-REASON    PIC X(38)    VALUE SPACES.       00079303
000800     05  FILLER                  PIC X(22)    VALUE SPACES.       00080003
