000100******************************************************************00010000
000200*  CALL LIST TRANSACTION ID TO SYSTEM ID ASSOCIATION RECORD.     *00020000
000300*  THE RECORD LENGTH IS 80 BYTES.                                *00030000
000400******************************************************************00040000
000500                                                                  00050000
000600 01  CM006-TRANSACTION-SYSID-RECORD.                              00060000
000700     05  CM006-START-TRANSACTION-ID                               00070000
000701                                 PIC X(4)     VALUE SPACES.       00070100
000710     05  FILLER                  PIC X(1)     VALUE SPACES.       00071000
000711     05  CM006-END-TRANSACTION-ID                                 00071100
000712                                 PIC X(4)     VALUE SPACES.       00071200
000714         88  CM006-SINGLE-TRANSACTION-ID      VALUE SPACES.       00071400
000715     05  FILLER                  PIC X(1)     VALUE SPACES.       00071500
000716     05  CM006-SYSTEM-ID         PIC X(2)     VALUE SPACES.       00071600
000718     05  FILLER                  PIC X(2)     VALUE SPACES.       00071800
000719     05  CM006-PROGRAM-NAME-EXCEPTION                             00071900
000720                                 PIC X(8)     VALUE SPACES.       00072000
000730     05  FILLER                  PIC X(58)    VALUE SPACES.       00073000
