000100******************************************************************00010000
000200*  CALL LIST ASSIGNMENT EXCEPTIONS BY JOB SUFFIX RECORD.  THE    *00020000
000300*  RECORD LENGTH IS 80 BYTES.                                    *00030000
000400******************************************************************00040000
000500                                                                  00050000
000600 01  CM005-ASSIGNMENT-EXCP-RECORD.                                00060000
000700     05  CM005-ASSIGNMENT-CODE   PIC X(4)     VALUE SPACES.       00070000
000710     05  FILLER                  PIC X(1)     VALUE SPACES.       00071000
000711     05  CM005-JOB-NAME-SUFFIX   PIC X(2)     VALUE SPACES.       00071100
000712     05  FILLER                  PIC X(1)     VALUE SPACES.       00071200
000720     05  CM005-ASSIGNMENT-GROUP  PIC X(72)    VALUE SPACES.       00072000
