*          DATA SET CNKM228                                             00024001
  PRINT  NOGEN                                                          00025001
*-------------------------------------------------------------------*   00026001
*                                                                   *   00027001
*        MAPSET  CNKM228                                            *   00028001
*        MAP     CNK228                                             *   00029001
*        PROGRAM CNKCS228                                           *   00030001
*        TRANSID Y228 - DC-DOOR TO STORE ASSIGNMENT SCREEN         *    00040001
*                                                                   *   00050001
*******************************************************************     00060001
*                                                                       00070001
*  CNKM228  MAPSET -  THIS IS THE BMS MAP FOR THE DC DOOR TO STORE      00080001
*    ASSIGNMENT SCREEN                                                  00090001
*                                                                       00100001
*******************************************************************     00110001
CNKM228 DFHMSD TYPE=DSECT,                                             C00120001
               LANG=COBOL,                                             C00130001
               MODE=INOUT,                                             C00140001
               STORAGE=AUTO,                                           C00150001
               TERM=3270-2,                                            C00160001
               TIOAPFX=YES                                              00170001
CNK228  DFHMDI LINE=2,COLUMN=1,                                        C00180001
               SIZE=(19,80),                                           C00190001
               CTRL=(FREEKB),                                          C00200001
               MAPATTS=(COLOR,HILIGHT),                                C00210001
               DSATTS=(COLOR,HILIGHT)                                   00220001
*******************************************************************     00230001
*******************************************************************     00240001
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00250001
               INITIAL='OPER UNIT ID:',                                X00260001
               COLOR=NEUTRAL,                                          X00270001
               LENGTH=13,                                              X00280001
               POS=(03,02)                                              00290001
AOPRUNT  DFHMDF POS=(03,16),                                           X00300001
               LENGTH=4,                                               X00310001
               COLOR=BLUE,                                             X00320001
               ATTRB=ASKIP                                              00330001
AOPRNME  DFHMDF POS=(03,21),                                           X00340001
               LENGTH=25,                                              X00350001
               COLOR=BLUE,                                             X00360001
               ATTRB=ASKIP                                              00370001
        DFHMDF ATTRB=(ASKIP),                                          X00380001
               LENGTH=1,                                               X00390001
               POS=(03,48)                                              00400001
        DFHMDF ATTRB=(ASKIP),                                          X00401006
               INITIAL='LANE ASSIGNMENT:',                             X00402006
               COLOR=NEUTRAL,                                          X00403006
               LENGTH=16,                                              X00404006
               POS=(03,54)                                              00405006
ALANEASG DFHMDF POS=(03,71),                                           X00406006
               LENGTH=9,                                               X00407006
               COLOR=BLUE,                                             X00408006
               ATTRB=ASKIP                                              00409006
*******************************************************************     00410001
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00420001
               INITIAL='DOOR ID......:',                               X00430001
               COLOR=NEUTRAL,                                          X00440001
               LENGTH=13,                                              X00450001
               POS=(04,02)                                              00460001
ADOORID  DFHMDF POS=(04,16),                                           X00470001
               LENGTH=4,                                               X00480001
               COLOR=BLUE,                                             X00490001
               ATTRB=ASKIP                                              00500001
ALOCDSC  DFHMDF POS=(04,21),                                           X00510001
               LENGTH=30,                                              X00520001
               COLOR=BLUE,                                             X00530001
               ATTRB=ASKIP                                              00540001
        DFHMDF ATTRB=(ASKIP),                                          X00550001
               LENGTH=1,                                               X00560001
               POS=(04,52)                                              00570001
         DFHMDF ATTRB=(ASKIP),                                         X00571001
               INITIAL='DIVERT LOC ID..:',                             X00572006
               COLOR=NEUTRAL,                                          X00573001
               LENGTH=16,                                              X00574001
               POS=(04,54)                                              00575006
ADIVLOC   DFHMDF POS=(04,71),                                          X00576006
               LENGTH=4,                                               X00577006
               COLOR=BLUE,                                             X00579001
               ATTRB=ASKIP                                              00579101
*******************************************************************     00580001
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00730001
               INITIAL='DOOR TYPE...:',                                X00740001
               COLOR=NEUTRAL,                                          X00750001
               LENGTH=13,                                              X00760001
               POS=(05,02)                                              00770001
ADRTYPC  DFHMDF POS=(05,16),                                           X00780001
               LENGTH=2,                                               X00790001
               COLOR=BLUE,                                             X00810001
               ATTRB=ASKIP                                              00820001
        DFHMDF ATTRB=(ASKIP),                                          X00830001
               LENGTH=1,                                               X00840001
               POS=(05,19)                                              00850002
ADRTYDS  DFHMDF POS=(05,21),                                           X00860001
               LENGTH=30,                                              X00870001
               COLOR=BLUE,                                             X00880001
               ATTRB=(ASKIP)                                            00890001
        DFHMDF ATTRB=(ASKIP),                                          X00900001
               LENGTH=1,                                               X00910001
               POS=(05,52)                                              00920001
         DFHMDF ATTRB=(ASKIP),                                         X01220001
               INITIAL='LABEL SEQ NBR..:',                             X01230001
               COLOR=NEUTRAL,                                          X01240001
               LENGTH=16,                                              X01250001
               POS=(05,54)                                              01260001
ALBLNBR  DFHMDF POS=(05,71),                                           X01270001
               LENGTH=04,                                              X01280001
               COLOR=BLUE,                                             X01300001
               ATTRB=ASKIP                                              01310001
        DFHMDF ATTRB=(ASKIP),                                          X01320001
               LENGTH=1,                                               X01330001
               POS=(05,76)                                              01340001
*******************************************************************     01350001
         DFHMDF ATTRB=(ASKIP),                                         X01351001
               INITIAL='DEL',                                          X01352001
               COLOR=NEUTRAL,                                          X01353001
               LENGTH=03,                                              X01354001
               POS=(07,17)                                              01355001
         DFHMDF ATTRB=ASKIP,                                           X01356001
               INITIAL='STORE',                                        X01356101
               POS=(07,23),                                            X01356201
               LENGTH=5,                                               X01357001
               COLOR=NEUTRAL                                            01358001
         DFHMDF ATTRB=ASKIP,                                           X01359001
               INITIAL='---- START -----',                             X01359101
               POS=(07,64),                                            X01359201
               LENGTH=16,                                              X01359301
               COLOR=NEUTRAL                                            01359401
*******************************************************************     01359801
         DFHMDF ATTRB=(ASKIP),                                         X01359901
               INITIAL='(Y)',                                          X01360001
               COLOR=NEUTRAL,                                          X01360101
               LENGTH=03,                                              X01360201
               POS=(08,17)                                              01360301
         DFHMDF ATTRB=ASKIP,                                           X01360401
               INITIAL=' NBR ',                                        X01360501
               POS=(08,23),                                            X01360601
               LENGTH=5,                                               X01360701
               COLOR=NEUTRAL                                            01360801
         DFHMDF ATTRB=ASKIP,                                           X01360903
               INITIAL='STORE NAME',                                   X01361003
               POS=(08,31),                                            X01361103
               LENGTH=10,                                              X01361203
               COLOR=NEUTRAL                                            01361303
         DFHMDF ATTRB=ASKIP,                                           X01361403
               INITIAL='DATE',                                         X01361503
               POS=(08,67),                                            X01361603
               LENGTH=04,                                              X01361703
               COLOR=NEUTRAL                                            01361803
         DFHMDF ATTRB=ASKIP,                                           X01361903
               INITIAL='TIME',                                         X01362003
               POS=(08,75),                                            X01362103
               LENGTH=04,                                              X01362203
               COLOR=NEUTRAL                                            01362303
*******************************************************************     01362403
         DFHMDF ATTRB=(ASKIP),                                         X01362503
               INITIAL='ASSIGNMENT 1:',                                X01362603
               COLOR=NEUTRAL,                                          X01362703
               LENGTH=13,                                              X01362803
               POS=(09,02)                                              01362903
ADEL1    DFHMDF ATTRB=(UNPROT),                                        X01363003
               HILIGHT=UNDERLINE,                                      X01363103
               POS=(09,18),                                            X01363203
               LENGTH=1,                                               X01363303
               COLOR=GREEN                                              01363403
        DFHMDF ATTRB=(ASKIP),                                          X01363505
               LENGTH=1,                                               X01363605
               POS=(09,20)                                              01363705
ASTNBR1  DFHMDF ATTRB=(ASKIP),                                         X01363803
               POS=(09,23),                                            X01363903
               LENGTH=4,                                               X01364003
               COLOR=BLUE                                               01364103
ASTNME1  DFHMDF ATTRB=ASKIP,                                           X01364203
               POS=(09,31),                                            X01364303
               LENGTH=30,                                              X01364403
               COLOR=BLUE                                               01364503
ADATE1   DFHMDF ATTRB=ASKIP,                                           X01364603
               POS=(09,64),                                            X01364703
               LENGTH=10,                                              X01364803
               COLOR=BLUE                                               01364903
ATIME1   DFHMDF ATTRB=ASKIP,                                           X01365003
               POS=(09,75),                                            X01365103
               LENGTH=05,                                              X01365204
               COLOR=BLUE                                               01365303
*******************************************************************     01365403
ASTNBR1A DFHMDF ATTRB=(ASKIP),                                         X01366001
               POS=(10,23),                                            X01366101
               LENGTH=4,                                               X01366201
               COLOR=BLUE                                               01366301
        DFHMDF ATTRB=(ASKIP),                                          X01366405
               LENGTH=1,                                               X01366505
               POS=(10,28)                                              01366605
ASTNME1A DFHMDF ATTRB=ASKIP,                                           X01366701
               POS=(10,31),                                            X01366801
               LENGTH=30,                                              X01366901
               COLOR=BLUE                                               01367001
*******************************************************************     01367601
         DFHMDF ATTRB=(ASKIP),                                         X01367701
               INITIAL='ASSIGNMENT 2:',                                X01367801
               COLOR=NEUTRAL,                                          X01367901
               LENGTH=13,                                              X01368001
               POS=(12,02)                                              01368101
ADEL2    DFHMDF ATTRB=(UNPROT),                                        X01368201
               HILIGHT=UNDERLINE,                                      X01368301
               POS=(12,18),                                            X01368401
               LENGTH=1,                                               X01368501
               COLOR=GREEN                                              01368601
        DFHMDF ATTRB=(ASKIP),                                          X01368705
               LENGTH=1,                                               X01368805
               POS=(12,20)                                              01368905
ASTNBR2  DFHMDF ATTRB=(ASKIP),                                         X01369001
               POS=(12,23),                                            X01369101
               LENGTH=4,                                               X01369201
               COLOR=BLUE                                               01369301
ASTNME2  DFHMDF ATTRB=ASKIP,                                           X01369401
               POS=(12,31),                                            X01369501
               LENGTH=30,                                              X01369601
               COLOR=BLUE                                               01369701
ADATE2   DFHMDF ATTRB=ASKIP,                                           X01369801
               POS=(12,64),                                            X01369901
               LENGTH=10,                                              X01370001
               COLOR=BLUE                                               01370101
ATIME2   DFHMDF ATTRB=ASKIP,                                           X01370201
               POS=(12,75),                                            X01370301
               LENGTH=05,                                              X01370404
               COLOR=BLUE                                               01370501
*******************************************************************     01370601
ASTNBR2A DFHMDF ATTRB=(ASKIP),                                         X01370701
               POS=(13,23),                                            X01370801
               LENGTH=4,                                               X01370901
               COLOR=BLUE                                               01371001
        DFHMDF ATTRB=(ASKIP),                                          X01371105
               LENGTH=1,                                               X01371205
               POS=(13,28)                                              01371305
ASTNME2A DFHMDF ATTRB=ASKIP,                                           X01371401
               POS=(13,31),                                            X01371501
               LENGTH=30,                                              X01371601
               COLOR=BLUE                                               01371701
*******************************************************************     01371801
         DFHMDF ATTRB=(ASKIP),                                         X01371901
               INITIAL='ASSIGNMENT 3:',                                X01372001
               COLOR=NEUTRAL,                                          X01372101
               LENGTH=13,                                              X01372201
               POS=(15,02)                                              01372301
ADEL3    DFHMDF ATTRB=(UNPROT),                                        X01372401
               HILIGHT=UNDERLINE,                                      X01372501
               POS=(15,18),                                            X01372601
               LENGTH=1,                                               X01372701
               COLOR=GREEN                                              01372801
        DFHMDF ATTRB=(ASKIP),                                          X01372905
               LENGTH=1,                                               X01373005
               POS=(15,20)                                              01373105
ASTNBR3  DFHMDF ATTRB=(ASKIP),                                         X01373201
               POS=(15,23),                                            X01373301
               LENGTH=4,                                               X01373401
               COLOR=BLUE                                               01373501
ASTNME3  DFHMDF ATTRB=ASKIP,                                           X01373601
               POS=(15,31),                                            X01373701
               LENGTH=30,                                              X01373801
               COLOR=BLUE                                               01373901
ADATE3   DFHMDF ATTRB=ASKIP,                                           X01374001
               POS=(15,64),                                            X01374101
               LENGTH=10,                                              X01374201
               COLOR=BLUE                                               01374301
ATIME3   DFHMDF ATTRB=ASKIP,                                           X01374401
               POS=(15,75),                                            X01374501
               LENGTH=05,                                              X01374604
               COLOR=BLUE                                               01374701
*******************************************************************     01374801
ASTNBR3A DFHMDF ATTRB=(ASKIP),                                         X01374901
               POS=(16,23),                                            X01375001
               LENGTH=4,                                               X01375101
               COLOR=BLUE                                               01375201
        DFHMDF ATTRB=(ASKIP),                                          X01375305
               LENGTH=1,                                               X01375405
               POS=(16,28)                                              01375505
ASTNME3A DFHMDF ATTRB=ASKIP,                                           X01375601
               POS=(16,31),                                            X01375701
               LENGTH=30,                                              X01375801
               COLOR=BLUE                                               01375901
*******************************************************************     01376001
*******************************************************************     01377001
         DFHMSD TYPE=FINAL                                              01380001
         END                                                            01390001
