*          DATA SET CNKM204    AT LEVEL 001 AS OF 10/25/93                      
*          DATA SET CNKM204    AT LEVEL 001 AS OF 05/13/93              00001   
  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  CNKM204                                            *   00005   
*        MAP     CN204A                                             *   00006   
*        PROGRAM CNKCS204                                           *   00007   
*        TRANSID Y204                                               *   00008   
*        SYSTEM  CICS ARCH - DEPT/CLASS FACILITY AREA LIST          *   00009**4
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
CNKM204 DFHMSD TYPE=DSECT,                                             X00012   
               LANG=COBOL,                                             X00013   
               MODE=INOUT,                                             X00014   
               STORAGE=AUTO,                                           X00015   
               TIOAPFX=YES,                                            X00016   
               TERM=3270-2                                              00017   
CN204A  DFHMDI LINE=2,COLUMN=1,                                        X00018   
               SIZE=(19,80),                                           X00019   
               CTRL=(FREEKB),                                          X00020   
               MAPATTS=(COLOR,HILIGHT),                                X00021   
               DSATTS=(COLOR,HILIGHT)                                   00022   
*                                                                       00023   
        DFHMDF POS=(03,44),                                            X00024   
               LENGTH=05,                                              X00025   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL,                                          X00027   
               INITIAL='ITEMS'                                          00028   
ASTRTIT DFHMDF POS=(03,50),                                            X00029   
               LENGTH=07,                                              X00030   
               ATTRB=(NUM,UNPROT,NORM),                                X00031   
               COLOR=GREEN,                                            X00032   
               HILIGHT=UNDERLINE,                                      X00033   
               PICOUT='ZZZ,ZZ9'                                         00034   
        DFHMDF POS=(03,58),                                            X00035   
               LENGTH=02,                                              X00036   
               ATTRB=(ASKIP,NORM),                                     X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='TO'                                             00039   
AENDIT  DFHMDF POS=(03,61),                                            X00040   
               LENGTH=07,                                              X00041   
               ATTRB=(ASKIP,NORM,FSET),                                X00042   
               COLOR=BLUE,                                             X00043   
               PICOUT='ZZZ,ZZ9'                                         00044   
        DFHMDF POS=(03,69),                                            X00045   
               LENGTH=02,                                              X00046   
               ATTRB=(ASKIP,NORM),                                     X00047   
               COLOR=NEUTRAL,                                          X00048   
               INITIAL='OF'                                             00049   
ATOTIT  DFHMDF POS=(03,72),                                            X00050   
               LENGTH=07,                                              X00051   
               ATTRB=(ASKIP,NORM),                                     X00052   
               COLOR=BLUE,                                             X00053   
               PICOUT='ZZZ,ZZ9'                                         00054   
*                                                                       00055   
        DFHMDF POS=(05,01),                                            X00056**2
               LENGTH=10,                                              X00057**2
               ATTRB=(ASKIP,BRT),                                      X00058**2
               INITIAL='OPER UNIT:'                                     00059**2
AOPER   DFHMDF POS=(05,12),                                            X00060**2
               LENGTH=4,                                               X00061**2
               ATTRB=(ASKIP,NORM),                                     X00062**2
               COLOR=BLUE                                               00063**2
        DFHMDF POS=(05,19),                                            X00064**2
               LENGTH=06,                                              X00065**2
               ATTRB=(ASKIP,BRT),                                      X00066**2
               INITIAL='FCLTY:'                                         00067**2
AFCLTY  DFHMDF POS=(05,27),                                            X00068**2
               LENGTH=4,                                               X00069**2
               PICOUT='ZZZZ',                                          X00070**3
               ATTRB=(ASKIP,NORM),                                     X00071**2
               COLOR=BLUE                                               00072**2
AFDESC  DFHMDF POS=(05,33),                                            X00073**2
               LENGTH=25,                                              X00074**2
               ATTRB=(ASKIP,NORM),                                     X00075**2
               COLOR=BLUE                                               00076**2
*                                                                       00077   
        DFHMDF POS=(07,01),                                            X00078   
               LENGTH=32,                                              X00079**5
               ATTRB=(ASKIP,BRT),                                      X00080   
               INITIAL='SEL ACT  FCLTY  DEPT CLASS  RANK'               00081**5
        DFHMDF POS=(07,36),                                            X00082**5
               LENGTH=24,                                              X00083**5
               ATTRB=(ASKIP,BRT),                                      X00084   
               INITIAL='AREA   TYPE  DESCRIPTION'                       00085**5
*                                                                       00086   
ASEL1   DFHMDF POS=(08,02),                                            X00087   
               LENGTH=01,                                              X00088   
               ATTRB=(UNPROT,NORM,IC),                                 X00089   
               COLOR=GREEN,                                            X00090   
               HILIGHT=UNDERLINE                                        00091   
AACT1   DFHMDF POS=(08,04),                                            X00092**5
               LENGTH=03,                                              X00093   
               ATTRB=(ASKIP,NORM),                                     X00094   
               COLOR=BLUE                                               00095   
AFAC1   DFHMDF POS=(08,10),                                            X00096**5
               LENGTH=04,                                              X00097**5
               ATTRB=(ASKIP,NORM),                                     X00098   
               COLOR=BLUE                                               00099   
ADEPT1  DFHMDF POS=(08,17),                                            X00100**5
               LENGTH=03,                                              X00101**5
               ATTRB=(ASKIP,NORM),                                     X00102**5
               COLOR=BLUE                                               00103**5
ACL1    DFHMDF POS=(08,24),                                            X00104**5
               LENGTH=02,                                              X00105   
               ATTRB=(ASKIP,NORM),                                     X00106   
               COLOR=BLUE                                               00107   
ARANK1  DFHMDF POS=(08,31),                                            X00108**5
               LENGTH=01,                                              X00109   
               ATTRB=(ASKIP,NORM),                                     X00110   
               COLOR=BLUE,                                             X00111   
               PICOUT='9'                                               00112   
ALOC1   DFHMDF POS=(08,35),                                            X00113**5
               LENGTH=06,                                              X00114   
               ATTRB=(ASKIP,NORM),                                     X00115   
               COLOR=BLUE                                               00116   
ATYPE1  DFHMDF POS=(08,44),                                            X00117**5
               LENGTH=02,                                              X00118   
               ATTRB=(ASKIP,NORM),                                     X00119   
               COLOR=BLUE                                               00120   
ADESC1  DFHMDF POS=(08,49),                                            X00121**5
               LENGTH=30,                                              X00122   
               ATTRB=(ASKIP,NORM),                                     X00123   
               COLOR=BLUE                                               00124   
*                                                                       00125   
ASEL2   DFHMDF POS=(09,02),                                            X00126   
               LENGTH=01,                                              X00127   
               ATTRB=(UNPROT,NORM),                                    X00128   
               COLOR=GREEN,                                            X00129   
               HILIGHT=UNDERLINE                                        00130   
AACT2   DFHMDF POS=(09,04),                                            X00131**5
               LENGTH=03,                                              X00132   
               ATTRB=(ASKIP,NORM),                                     X00133   
               COLOR=BLUE                                               00134   
AFAC2   DFHMDF POS=(09,10),                                            X00135**5
               LENGTH=04,                                              X00136**5
               ATTRB=(ASKIP,NORM),                                     X00137**5
               COLOR=BLUE                                               00138**5
ADEPT2  DFHMDF POS=(09,17),                                            X00139**5
               LENGTH=03,                                              X00140   
               ATTRB=(ASKIP,NORM),                                     X00141   
               COLOR=BLUE                                               00142   
ACL2    DFHMDF POS=(09,24),                                            X00143**5
               LENGTH=02,                                              X00144   
               ATTRB=(ASKIP,NORM),                                     X00145   
               COLOR=BLUE                                               00146   
ARANK2  DFHMDF POS=(09,31),                                            X00147**5
               LENGTH=01,                                              X00148   
               ATTRB=(ASKIP,NORM),                                     X00149   
               COLOR=BLUE,                                             X00150   
               PICOUT='9'                                               00151   
ALOC2   DFHMDF POS=(09,35),                                            X00152**5
               LENGTH=06,                                              X00153   
               ATTRB=(ASKIP,NORM),                                     X00154   
               COLOR=BLUE                                               00155   
ATYPE2  DFHMDF POS=(09,44),                                            X00156**5
               LENGTH=02,                                              X00157   
               ATTRB=(ASKIP,NORM),                                     X00158   
               COLOR=BLUE                                               00159   
ADESC2  DFHMDF POS=(09,49),                                            X00160**5
               LENGTH=30,                                              X00161   
               ATTRB=(ASKIP,NORM),                                     X00162   
               COLOR=BLUE                                               00163   
*                                                                       00164   
ASEL3   DFHMDF POS=(10,02),                                            X00165   
               LENGTH=01,                                              X00166   
               ATTRB=(UNPROT,NORM),                                    X00167   
               COLOR=GREEN,                                            X00168   
               HILIGHT=UNDERLINE                                        00169   
AACT3   DFHMDF POS=(10,04),                                            X00170**5
               LENGTH=03,                                              X00171   
               ATTRB=(ASKIP,NORM),                                     X00172   
               COLOR=BLUE                                               00173   
AFAC3   DFHMDF POS=(10,10),                                            X00174**5
               LENGTH=04,                                              X00175**5
               ATTRB=(ASKIP,NORM),                                     X00176**5
               COLOR=BLUE                                               00177**5
ADEPT3  DFHMDF POS=(10,17),                                            X00178**5
               LENGTH=03,                                              X00179   
               ATTRB=(ASKIP,NORM),                                     X00180   
               COLOR=BLUE                                               00181   
ACL3    DFHMDF POS=(10,24),                                            X00182**5
               LENGTH=02,                                              X00183   
               ATTRB=(ASKIP,NORM),                                     X00184   
               COLOR=BLUE                                               00185   
ARANK3  DFHMDF POS=(10,31),                                            X00186**5
               LENGTH=01,                                              X00187   
               ATTRB=(ASKIP,NORM),                                     X00188   
               COLOR=BLUE,                                             X00189   
               PICOUT='9'                                               00190   
ALOC3   DFHMDF POS=(10,35),                                            X00191**5
               LENGTH=06,                                              X00192   
               ATTRB=(ASKIP,NORM),                                     X00193   
               COLOR=BLUE                                               00194   
ATYPE3  DFHMDF POS=(10,44),                                            X00195**5
               LENGTH=02,                                              X00196   
               ATTRB=(ASKIP,NORM),                                     X00197   
               COLOR=BLUE                                               00198   
ADESC3  DFHMDF POS=(10,49),                                            X00199**5
               LENGTH=30,                                              X00200   
               ATTRB=(ASKIP,NORM),                                     X00201   
               COLOR=BLUE                                               00202   
*                                                                       00203   
ASEL4   DFHMDF POS=(11,02),                                            X00204   
               LENGTH=01,                                              X00205   
               ATTRB=(UNPROT,NORM),                                    X00206   
               COLOR=GREEN,                                            X00207   
               HILIGHT=UNDERLINE                                        00208   
AACT4   DFHMDF POS=(11,04),                                            X00209**5
               LENGTH=03,                                              X00210   
               ATTRB=(ASKIP,NORM),                                     X00211   
               COLOR=BLUE                                               00212   
AFAC4   DFHMDF POS=(11,10),                                            X00213**5
               LENGTH=04,                                              X00214**5
               ATTRB=(ASKIP,NORM),                                     X00215**5
               COLOR=BLUE                                               00216**5
ADEPT4  DFHMDF POS=(11,17),                                            X00217**5
               LENGTH=03,                                              X00218   
               ATTRB=(ASKIP,NORM),                                     X00219   
               COLOR=BLUE                                               00220   
ACL4    DFHMDF POS=(11,24),                                            X00221**5
               LENGTH=02,                                              X00222   
               ATTRB=(ASKIP,NORM),                                     X00223   
               COLOR=BLUE                                               00224   
ARANK4  DFHMDF POS=(11,31),                                            X00225**5
               LENGTH=01,                                              X00226   
               ATTRB=(ASKIP,NORM),                                     X00227   
               COLOR=BLUE,                                             X00228   
               PICOUT='9'                                               00229   
ALOC4   DFHMDF POS=(11,35),                                            X00230**5
               LENGTH=06,                                              X00231   
               ATTRB=(ASKIP,NORM),                                     X00232   
               COLOR=BLUE                                               00233   
ATYPE4  DFHMDF POS=(11,44),                                            X00234**5
               LENGTH=02,                                              X00235   
               ATTRB=(ASKIP,NORM),                                     X00236   
               COLOR=BLUE                                               00237   
ADESC4  DFHMDF POS=(11,49),                                            X00238**5
               LENGTH=30,                                              X00239   
               ATTRB=(ASKIP,NORM),                                     X00240   
               COLOR=BLUE                                               00241   
*                                                                       00242   
ASEL5   DFHMDF POS=(12,02),                                            X00243   
               LENGTH=01,                                              X00244   
               ATTRB=(UNPROT,NORM),                                    X00245   
               COLOR=GREEN,                                            X00246   
               HILIGHT=UNDERLINE                                        00247   
AACT5   DFHMDF POS=(12,04),                                            X00248**5
               LENGTH=03,                                              X00249   
               ATTRB=(ASKIP,NORM),                                     X00250   
               COLOR=BLUE                                               00251   
AFAC5   DFHMDF POS=(12,10),                                            X00252**5
               LENGTH=04,                                              X00253**5
               ATTRB=(ASKIP,NORM),                                     X00254**5
               COLOR=BLUE                                               00255**5
ADEPT5  DFHMDF POS=(12,17),                                            X00256**5
               LENGTH=03,                                              X00257   
               ATTRB=(ASKIP,NORM),                                     X00258   
               COLOR=BLUE                                               00259   
ACL5    DFHMDF POS=(12,24),                                            X00260**5
               LENGTH=02,                                              X00261   
               ATTRB=(ASKIP,NORM),                                     X00262   
               COLOR=BLUE                                               00263   
ARANK5  DFHMDF POS=(12,31),                                            X00264**5
               LENGTH=01,                                              X00265   
               ATTRB=(ASKIP,NORM),                                     X00266   
               COLOR=BLUE,                                             X00267   
               PICOUT='9'                                               00268   
ALOC5   DFHMDF POS=(12,35),                                            X00269**5
               LENGTH=06,                                              X00270   
               ATTRB=(ASKIP,NORM),                                     X00271   
               COLOR=BLUE                                               00272   
ATYPE5  DFHMDF POS=(12,44),                                            X00273**5
               LENGTH=02,                                              X00274   
               ATTRB=(ASKIP,NORM),                                     X00275   
               COLOR=BLUE                                               00276   
ADESC5  DFHMDF POS=(12,49),                                            X00277**5
               LENGTH=30,                                              X00278   
               ATTRB=(ASKIP,NORM),                                     X00279   
               COLOR=BLUE                                               00280   
*                                                                       00281   
ASEL6   DFHMDF POS=(13,02),                                            X00282   
               LENGTH=01,                                              X00283   
               ATTRB=(UNPROT,NORM),                                    X00284   
               COLOR=GREEN,                                            X00285   
               HILIGHT=UNDERLINE                                        00286   
AACT6   DFHMDF POS=(13,04),                                            X00287**5
               LENGTH=03,                                              X00288   
               ATTRB=(ASKIP,NORM),                                     X00289   
               COLOR=BLUE                                               00290   
AFAC6   DFHMDF POS=(13,10),                                            X00291**5
               LENGTH=04,                                              X00292**5
               ATTRB=(ASKIP,NORM),                                     X00293**5
               COLOR=BLUE                                               00294**5
ADEPT6  DFHMDF POS=(13,17),                                            X00295**5
               LENGTH=03,                                              X00296   
               ATTRB=(ASKIP,NORM),                                     X00297   
               COLOR=BLUE                                               00298   
ACL6    DFHMDF POS=(13,24),                                            X00299**5
               LENGTH=02,                                              X00300   
               ATTRB=(ASKIP,NORM),                                     X00301   
               COLOR=BLUE                                               00302   
ARANK6  DFHMDF POS=(13,31),                                            X00303**5
               LENGTH=01,                                              X00304   
               ATTRB=(ASKIP,NORM),                                     X00305   
               COLOR=BLUE,                                             X00306   
               PICOUT='9'                                               00307   
ALOC6   DFHMDF POS=(13,35),                                            X00308**5
               LENGTH=06,                                              X00309   
               ATTRB=(ASKIP,NORM),                                     X00310   
               COLOR=BLUE                                               00311   
ATYPE6  DFHMDF POS=(13,44),                                            X00312**5
               LENGTH=02,                                              X00313   
               ATTRB=(ASKIP,NORM),                                     X00314   
               COLOR=BLUE                                               00315   
ADESC6  DFHMDF POS=(13,49),                                            X00316**5
               LENGTH=30,                                              X00317   
               ATTRB=(ASKIP,NORM),                                     X00318   
               COLOR=BLUE                                               00319   
*                                                                       00320   
ASEL7   DFHMDF POS=(14,02),                                            X00321   
               LENGTH=01,                                              X00322   
               ATTRB=(UNPROT,NORM),                                    X00323   
               COLOR=GREEN,                                            X00324   
               HILIGHT=UNDERLINE                                        00325   
AACT7   DFHMDF POS=(14,04),                                            X00326**5
               LENGTH=03,                                              X00327   
               ATTRB=(ASKIP,NORM),                                     X00328   
               COLOR=BLUE                                               00329   
AFAC7   DFHMDF POS=(14,10),                                            X00330**5
               LENGTH=04,                                              X00331**5
               ATTRB=(ASKIP,NORM),                                     X00332**5
               COLOR=BLUE                                               00333**5
ADEPT7  DFHMDF POS=(14,17),                                            X00334**5
               LENGTH=03,                                              X00335   
               ATTRB=(ASKIP,NORM),                                     X00336   
               COLOR=BLUE                                               00337   
ACL7    DFHMDF POS=(14,24),                                            X00338**5
               LENGTH=02,                                              X00339   
               ATTRB=(ASKIP,NORM),                                     X00340   
               COLOR=BLUE                                               00341   
ARANK7  DFHMDF POS=(14,31),                                            X00342**5
               LENGTH=01,                                              X00343   
               ATTRB=(ASKIP,NORM),                                     X00344   
               COLOR=BLUE,                                             X00345   
               PICOUT='9'                                               00346   
ALOC7   DFHMDF POS=(14,35),                                            X00347**5
               LENGTH=06,                                              X00348   
               ATTRB=(ASKIP,NORM),                                     X00349   
               COLOR=BLUE                                               00350   
ATYPE7  DFHMDF POS=(14,44),                                            X00351**5
               LENGTH=02,                                              X00352   
               ATTRB=(ASKIP,NORM),                                     X00353   
               COLOR=BLUE                                               00354   
ADESC7  DFHMDF POS=(14,49),                                            X00355**5
               LENGTH=30,                                              X00356   
               ATTRB=(ASKIP,NORM),                                     X00357   
               COLOR=BLUE                                               00358   
*                                                                       00359   
ASEL8   DFHMDF POS=(15,02),                                            X00360   
               LENGTH=01,                                              X00361   
               ATTRB=(UNPROT,NORM),                                    X00362   
               COLOR=GREEN,                                            X00363   
               HILIGHT=UNDERLINE                                        00364   
AACT8   DFHMDF POS=(15,04),                                            X00365**5
               LENGTH=03,                                              X00366   
               ATTRB=(ASKIP,NORM),                                     X00367   
               COLOR=BLUE                                               00368   
AFAC8   DFHMDF POS=(15,10),                                            X00369**5
               LENGTH=04,                                              X00370**5
               ATTRB=(ASKIP,NORM),                                     X00371**5
               COLOR=BLUE                                               00372**5
ADEPT8  DFHMDF POS=(15,17),                                            X00373**5
               LENGTH=03,                                              X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               COLOR=BLUE                                               00376   
ACL8    DFHMDF POS=(15,24),                                            X00377**5
               LENGTH=02,                                              X00378   
               ATTRB=(ASKIP,NORM),                                     X00379   
               COLOR=BLUE                                               00380   
ARANK8  DFHMDF POS=(15,31),                                            X00381**5
               LENGTH=01,                                              X00382   
               ATTRB=(ASKIP,NORM),                                     X00383   
               COLOR=BLUE,                                             X00384   
               PICOUT='9'                                               00385   
ALOC8   DFHMDF POS=(15,35),                                            X00386**5
               LENGTH=06,                                              X00387   
               ATTRB=(ASKIP,NORM),                                     X00388   
               COLOR=BLUE                                               00389   
ATYPE8  DFHMDF POS=(15,44),                                            X00390**5
               LENGTH=02,                                              X00391   
               ATTRB=(ASKIP,NORM),                                     X00392   
               COLOR=BLUE                                               00393   
ADESC8  DFHMDF POS=(15,49),                                            X00394**5
               LENGTH=30,                                              X00395   
               ATTRB=(ASKIP,NORM),                                     X00396   
               COLOR=BLUE                                               00397   
*                                                                       00398   
ASEL9   DFHMDF POS=(16,02),                                            X00399   
               LENGTH=01,                                              X00400   
               ATTRB=(UNPROT,NORM),                                    X00401   
               COLOR=GREEN,                                            X00402   
               HILIGHT=UNDERLINE                                        00403   
AACT9   DFHMDF POS=(16,04),                                            X00404**5
               LENGTH=03,                                              X00405   
               ATTRB=(ASKIP,NORM),                                     X00406   
               COLOR=BLUE                                               00407   
AFAC9   DFHMDF POS=(16,10),                                            X00408**5
               LENGTH=04,                                              X00409**5
               ATTRB=(ASKIP,NORM),                                     X00410**5
               COLOR=BLUE                                               00411**5
ADEPT9  DFHMDF POS=(16,17),                                            X00412**5
               LENGTH=03,                                              X00413   
               ATTRB=(ASKIP,NORM),                                     X00414   
               COLOR=BLUE                                               00415   
ACL9    DFHMDF POS=(16,24),                                            X00416**5
               LENGTH=02,                                              X00417   
               ATTRB=(ASKIP,NORM),                                     X00418   
               COLOR=BLUE                                               00419   
ARANK9  DFHMDF POS=(16,31),                                            X00420**5
               LENGTH=01,                                              X00421   
               ATTRB=(ASKIP,NORM),                                     X00422   
               COLOR=BLUE,                                             X00423   
               PICOUT='9'                                               00424   
ALOC9   DFHMDF POS=(16,35),                                            X00425**5
               LENGTH=06,                                              X00426   
               ATTRB=(ASKIP,NORM),                                     X00427   
               COLOR=BLUE                                               00428   
ATYPE9  DFHMDF POS=(16,44),                                            X00429**5
               LENGTH=02,                                              X00430   
               ATTRB=(ASKIP,NORM),                                     X00431   
               COLOR=BLUE                                               00432   
ADESC9  DFHMDF POS=(16,49),                                            X00433**5
               LENGTH=30,                                              X00434   
               ATTRB=(ASKIP,NORM),                                     X00435   
               COLOR=BLUE                                               00436   
*                                                                       00437   
ASEL10  DFHMDF POS=(17,02),                                            X00438   
               LENGTH=01,                                              X00439   
               ATTRB=(UNPROT,NORM),                                    X00440   
               COLOR=GREEN,                                            X00441   
               HILIGHT=UNDERLINE                                        00442   
AACT10  DFHMDF POS=(17,04),                                            X00443**5
               LENGTH=03,                                              X00444   
               ATTRB=(ASKIP,NORM),                                     X00445   
               COLOR=BLUE                                               00446   
AFAC10  DFHMDF POS=(17,10),                                            X00447**5
               LENGTH=04,                                              X00448**5
               ATTRB=(ASKIP,NORM),                                     X00449**5
               COLOR=BLUE                                               00450**5
ADEPT10 DFHMDF POS=(17,17),                                            X00451**5
               LENGTH=03,                                              X00452   
               ATTRB=(ASKIP,NORM),                                     X00453   
               COLOR=BLUE                                               00454   
ACL10   DFHMDF POS=(17,24),                                            X00455**5
               LENGTH=02,                                              X00456   
               ATTRB=(ASKIP,NORM),                                     X00457   
               COLOR=BLUE                                               00458   
ARANK10 DFHMDF POS=(17,31),                                            X00459**5
               LENGTH=01,                                              X00460   
               ATTRB=(ASKIP,NORM),                                     X00461   
               COLOR=BLUE,                                             X00462   
               PICOUT='9'                                               00463   
ALOC10  DFHMDF POS=(17,35),                                            X00464**5
               LENGTH=06,                                              X00465   
               ATTRB=(ASKIP,NORM),                                     X00466   
               COLOR=BLUE                                               00467   
ATYPE10 DFHMDF POS=(17,44),                                            X00468**5
               LENGTH=02,                                              X00469   
               ATTRB=(ASKIP,NORM),                                     X00470   
               COLOR=BLUE                                               00471   
ADESC10 DFHMDF POS=(17,49),                                            X00472**5
               LENGTH=30,                                              X00473   
               ATTRB=(ASKIP,NORM),                                     X00474   
               COLOR=BLUE                                               00475   
*                                                                       00476   
ASEL11  DFHMDF POS=(18,02),                                            X00477   
               LENGTH=01,                                              X00478   
               ATTRB=(UNPROT,NORM),                                    X00479   
               COLOR=GREEN,                                            X00480   
               HILIGHT=UNDERLINE                                        00481   
AACT11  DFHMDF POS=(18,04),                                            X00482**5
               LENGTH=03,                                              X00483   
               ATTRB=(ASKIP,NORM),                                     X00484   
               COLOR=BLUE                                               00485   
AFAC11  DFHMDF POS=(18,10),                                            X00486**5
               LENGTH=04,                                              X00487**5
               ATTRB=(ASKIP,NORM),                                     X00488**5
               COLOR=BLUE                                               00489**5
ADEPT11 DFHMDF POS=(18,17),                                            X00490**5
               LENGTH=03,                                              X00491   
               ATTRB=(ASKIP,NORM),                                     X00492   
               COLOR=BLUE                                               00493   
ACL11   DFHMDF POS=(18,24),                                            X00494**5
               LENGTH=02,                                              X00495   
               ATTRB=(ASKIP,NORM),                                     X00496   
               COLOR=BLUE                                               00497   
ARANK11 DFHMDF POS=(18,31),                                            X00498**5
               LENGTH=01,                                              X00499   
               ATTRB=(ASKIP,NORM),                                     X00500   
               COLOR=BLUE,                                             X00501   
               PICOUT='9'                                               00502   
ALOC11  DFHMDF POS=(18,35),                                            X00503**5
               LENGTH=06,                                              X00504   
               ATTRB=(ASKIP,NORM),                                     X00505   
               COLOR=BLUE                                               00506   
ATYPE11 DFHMDF POS=(18,44),                                            X00507**5
               LENGTH=02,                                              X00508   
               ATTRB=(ASKIP,NORM),                                     X00509   
               COLOR=BLUE                                               00510   
ADESC11 DFHMDF POS=(18,49),                                            X00511**5
               LENGTH=30,                                              X00512   
               ATTRB=(ASKIP,NORM),                                     X00513   
               COLOR=BLUE                                               00514   
*                                                                       00515   
        DFHMDF POS=(19,40),                                            X00516   
               LENGTH=25,                                              X00517   
               ATTRB=(ASKIP,NORM),                                     X00518   
               COLOR=NEUTRAL,                                          X00519   
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00520   
ASELIT  DFHMDF POS=(19,67),                                            X00521   
               LENGTH=07,                                              X00522   
               ATTRB=(ASKIP,NORM),                                     X00523   
               COLOR=BLUE,                                             X00524   
               PICOUT='ZZZ,ZZ9'                                         00525   
*                                                                       00526   
         DFHMSD TYPE=FINAL                                              00527   
         END                                                            00528   
