*          DATA SET CNKM233                                             00010001
        PRINT  NOGEN                                                    00020001
*-------------------------------------------------------------------*   00021001
*                                                                   *   00022001
*        MAPSET  CNKM233                                            *   00023001
*        MAP     CNK233                                             *   00024001
*        PROGRAM CNKCS233                                           *   00025001
*        TRANSID Y233 - DC-PARM DEFINITION CRIT SPEC                *   00026001
*                                                                   *   00027001
*-------------------------------------------------------------------*   00028001
CNKM233 DFHMSD TYPE=DSECT,                                             X00029001
               LANG=COBOL,                                             X00030001
               MODE=INOUT,                                             X00040001
               STORAGE=AUTO,                                           X00050001
               TERM=3270-2,                                            X00060001
               TIOAPFX=YES                                              00070001
**********************************************************************  00080001
CNK233  DFHMDI LINE=2,COLUMN=1,                                        X00090001
               SIZE=(19,80),                                           X00100001
               CTRL=(FREEKB),                                          X00110001
               MAPATTS=(COLOR,HILIGHT),                                X00120001
               DSATTS=(COLOR,HILIGHT)                                   00130001
**********************************************************************  00140001
**********************************************************************  00150001
         DFHMDF POS=(04,16),                                           X00160001
               LENGTH=18,                                              X00170001
               ATTRB=(ASKIP,NORM),                                     X00180001
               COLOR=NEUTRAL,                                          X00190001
               INITIAL='OPER UNIT ID.....:'                             00200001
AOPRUNT  DFHMDF POS=(04,35),                                           X00210001
               LENGTH=04,                                              X00220001
               ATTRB=(ASKIP,NORM),                                     X00230001
               COLOR=BLUE                                               00240001
AOPRNME  DFHMDF POS=(04,40),                                           X00250001
               LENGTH=25,                                              X00260001
               ATTRB=(ASKIP,NORM),                                     X00270001
               COLOR=BLUE                                               00280001
         DFHMDF POS=(04,067),                                          X00290001
               ATTRB=(ASKIP,DRK),                                      X00300001
               LENGTH=001                                               00301001
**********************************************************************  00302001
         DFHMDF POS=(06,16),                                           X00303001
               LENGTH=18,                                              X00304001
               ATTRB=(ASKIP,NORM),                                     X00305001
               COLOR=NEUTRAL,                                          X00306001
               INITIAL='PARAMETER NAME...:'                             00307001
APRMNME  DFHMDF POS=(06,35),                                           X00308001
               LENGTH=06,                                              X00309005
               ATTRB=(UNPROT),                                         X00310001
               HILIGHT=UNDERLINE,                                      X00311001
               COLOR=GREEN                                              00312001
         DFHMDF POS=(06,042),                                          X00317005
               ATTRB=(ASKIP,DRK),                                      X00318001
               LENGTH=001                                               00319001
**********************************************************************  00320001
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00330001
               INITIAL='PARAMETER DESC...:',                           X00340001
               COLOR=NEUTRAL,                                          X00350001
               LENGTH=18,                                              X00360001
               POS=(08,16)                                              00370001
APRMDSC  DFHMDF POS=(08,35),                                           X00380001
               LENGTH=40,                                              X00390005
               HILIGHT=UNDERLINE,                                      X00400001
               COLOR=GREEN,                                            X00410001
               ATTRB=(UNPROT)                                           00420001
         DFHMDF ATTRB=(ASKIP),                                         X00430001
               LENGTH=1,                                               X00440001
               POS=(08,76)                                              00450005
**********************************************************************  00460001
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00470001
               INITIAL='PARAMTER TYPE....:',                           X00480001
               COLOR=NEUTRAL,                                          X00490001
               LENGTH=18,                                              X00500001
               POS=(10,16)                                              00510001
APRMTYP  DFHMDF POS=(10,35),                                           X00511001
               LENGTH=2,                                               X00512001
               HILIGHT=UNDERLINE,                                      X00513001
               COLOR=GREEN,                                            X00514001
               ATTRB=(UNPROT)                                           00515001
         DFHMDF POS=(10,038),                                          X00516001
               ATTRB=(ASKIP,DRK),                                      X00517001
               LENGTH=001                                               00518001
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00518101
               INITIAL='(DT=DATE, PC=%, QT=QUANTITY, TX=TEXT)',        X00518204
               COLOR=NEUTRAL,                                          X00518401
               LENGTH=37,                                              X00518506
               POS=(10,40)                                              00518601
**********************************************************************  00580001
         DFHMSD TYPE=FINAL                                              00590001
         END                                                            00600001
