***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
*          DATA SET CNKM222                                                     
  PRINT  NOGEN                                                          00004   
*-------------------------------------------------------------------*   00005   
*                                                                   *   00006   
*        MAPSET  CNKM222                                            *   00007   
*        MAP     CN222A                                             *   00008   
*        PROGRAM CNKCS222                                           *   00009   
*        TRANSID Y222 -                                             *   00010   
*        SYSTEM   (CN)                                              *   00011   
*                                                                   *   00012   
*-------------------------------------------------------------------*   00013   
CNKM222  DFHMSD TYPE=&&SYSPARM,                                        X00014   
               CTRL=(FREEKB),                                          X00015   
               LANG=COBOL,                                             X00016   
               MODE=INOUT,                                             X00017   
               TIOAPFX=YES                                              00018   
CN222A   DFHMDI SIZE=(19,080),                                         X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT),                                 X00021   
               LINE=02,                                                X00022   
               COLUMN=01                                                00023   
***********************************************************************         
         DFHMDF POS=(05,016),                                          X00035   
               COLOR=NEUTRAL,                                          X00036   
               ATTRB=(ASKIP,BRT),                                      X00037   
               LENGTH=019,                                             X00038   
               INITIAL='CURRENT OPER UNIT.:'                            00039   
CNOPER   DFHMDF POS=(05,036),                                          X00040   
               COLOR=BLUE,                                             X00041   
               ATTRB=(ASKIP),                                          X00042   
               LENGTH=009                                               00044   
         DFHMDF POS=(05,46),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
CNOPDS   DFHMDF POS=(05,048),                                          X00050   
               COLOR=BLUE,                                             X00051   
               ATTRB=(ASKIP),                                          X00052   
               LENGTH=025                                               00053   
         DFHMDF POS=(05,74),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
***********************************************************************         
         DFHMDF POS=(07,016),                                          X00054   
               COLOR=NEUTRAL,                                          X00055   
               ATTRB=(ASKIP,BRT),                                      X00056   
               LENGTH=019,                                             X00057   
               INITIAL='OWNER SCAC CODE...:'                            00058   
CNSCAC   DFHMDF POS=(07,036),                                          X00059   
               COLOR=GREEN,                                            X00060   
               ATTRB=(UNPROT),                                         X00061   
               HILIGHT=UNDERLINE,                                      X00062   
               LENGTH=004                                               00063   
         DFHMDF POS=(07,41),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
CNSCDS   DFHMDF POS=(07,045),                                          X00050   
               COLOR=BLUE,                                             X00051   
               ATTRB=(ASKIP),                                          X00052   
               LENGTH=030                                               00053   
         DFHMDF POS=(07,76),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
***********************************************************************         
         DFHMDF POS=(09,016),                                          X00069   
               COLOR=NEUTRAL,                                          X00070   
               ATTRB=(ASKIP,BRT),                                      X00071   
               LENGTH=019,                                             X00072   
               INITIAL='TRAILER NUMBER....:'                            00073   
CNVEID   DFHMDF POS=(09,036),                                          X00074   
               COLOR=GREEN,                                            X00075   
               ATTRB=(UNPROT),                                         X00076   
               HILIGHT=UNDERLINE,                                      X00077   
               LENGTH=012                                               00078   
         DFHMDF POS=(09,49),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
***********************************************************************         
         DFHMDF POS=(11,016),                                          X00085   
               COLOR=NEUTRAL,                                          X00086   
               ATTRB=(ASKIP,BRT),                                      X00087   
               LENGTH=019,                                             X00088   
               INITIAL='TRAILER SERIAL NBR:'                            00089   
CNTRLR   DFHMDF POS=(11,036),                                          X00090   
               COLOR=GREEN,                                            X00091   
               ATTRB=(UNPROT),                                         X00092   
               HILIGHT=UNDERLINE,                                      X00093   
               LENGTH=009                                               00094   
         DFHMDF POS=(11,46),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
***********************************************************************         
         DFHMDF POS=(13,016),                                          X00085   
               COLOR=NEUTRAL,                                          X00086   
               ATTRB=(ASKIP,BRT),                                      X00087   
               LENGTH=019,                                             X00088   
               INITIAL='TRAILER LENGTH....:'                            00089   
CNLNGTH  DFHMDF POS=(13,036),                                          X00085   
               COLOR=GREEN,                                            X00086   
               ATTRB=(UNPROT,NORM),                                    X00087   
               HILIGHT=UNDERLINE,                                      X00077   
               LENGTH=04                                                00088   
         DFHMDF POS=(13,41),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
***********************************************************************         
         DFHMDF POS=(15,016),                                          X00085   
               COLOR=NEUTRAL,                                          X00086   
               ATTRB=(ASKIP,BRT),                                      X00087   
               LENGTH=019,                                             X00088   
               INITIAL='PRINTER ID........:'                            00089   
CNPRTID  DFHMDF POS=(15,036),                                          X00085   
               COLOR=GREEN,                                            X00086   
               ATTRB=(UNPROT,NORM),                                    X00087   
               HILIGHT=UNDERLINE,                                      X00077   
               LENGTH=08                                                00088   
CNPRTDS  DFHMDF POS=(15,045),                                          X00085   
               COLOR=BLUE,                                             X00086   
               ATTRB=(ASKIP,BRT),                                      X00087   
               LENGTH=30                                                00088   
         DFHMDF POS=(15,76),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
***********************************************************************         
AMSGLN   DFHMDF POS=(19,038),                                          X00207   
               COLOR=RED,                                              X        
               ATTRB=(ASKIP),                                          X00050**8
               LENGTH=20                                                00049**8
         DFHMSD TYPE=FINAL                                              00228   
         END                                                            00229   
