*          DATA SET CNKM224                                             00024001
        PRINT  NOGEN                                                    00025001
*-------------------------------------------------------------------*   00026001
*                                                                   *   00027001
*        MAPSET  CNKM224                                            *   00028001
*        MAP     CNK224                                             *   00029001
*        PROGRAM CNKCS224                                           *   00030001
*        TRANSID Y224 - DC-DOOR DEFINITION CRIT SPEC                *   00040001
*                                                                   *   00050001
*-------------------------------------------------------------------*   00060001
CNKM224 DFHMSD TYPE=DSECT,                                             X00070001
               LANG=COBOL,                                             X00080001
               MODE=INOUT,                                             X00090001
               STORAGE=AUTO,                                           X00100001
               TERM=3270-2,                                            X00110001
               TIOAPFX=YES                                              00120001
**********************************************************************  00130001
CNK224  DFHMDI LINE=2,COLUMN=1,                                        X00140001
               SIZE=(19,80),                                           X00150001
               CTRL=(FREEKB),                                          X00160001
               MAPATTS=(COLOR,HILIGHT),                                X00170001
               DSATTS=(COLOR,HILIGHT)                                   00180001
**********************************************************************  00190001
**********************************************************************  00200001
         DFHMDF POS=(04,16),                                           X00210006
               LENGTH=18,                                              X00220001
               ATTRB=(ASKIP,NORM),                                     X00230001
               COLOR=NEUTRAL,                                          X00240001
               INITIAL='CURRENT OPER UNIT:'                             00250001
ACPRUNT  DFHMDF POS=(04,35),                                           X00260006
               LENGTH=04,                                              X00270001
               ATTRB=(ASKIP,NORM),                                     X00280001
               COLOR=BLUE                                               00290004
ACPRNME  DFHMDF POS=(04,40),                                           X00300006
               LENGTH=25,                                              X00301001
               ATTRB=(ASKIP,NORM),                                     X00302001
               COLOR=BLUE                                               00303004
         DFHMDF POS=(04,067),                                          X00304006
               ATTRB=(ASKIP,DRK),                                      X00305001
               LENGTH=001                                               00306001
**********************************************************************  00310001
         DFHMDF POS=(06,16),                                           X00311006
               LENGTH=18,                                              X00312001
               ATTRB=(ASKIP,NORM),                                     X00313001
               COLOR=NEUTRAL,                                          X00314001
               INITIAL='OPER UNIT ID.....:'                             00315001
AOPRUNT  DFHMDF POS=(06,35),                                           X00316006
               LENGTH=04,                                              X00317001
               ATTRB=(UNPROT),                                         X00318001
               HILIGHT=UNDERLINE,                                      X00318101
               COLOR=GREEN                                              00319001
AOPRNME  DFHMDF POS=(06,40),                                           X00320006
               LENGTH=25,                                              X00330001
               ATTRB=(ASKIP,NORM),                                     X00340001
               COLOR=BLUE                                               00350005
         DFHMDF POS=(06,067),                                          X00370006
               ATTRB=(ASKIP,DRK),                                      X00380001
               LENGTH=001                                               00390001
**********************************************************************  00400001
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00430006
               INITIAL='DOOR ID..........:',                           X00440001
               COLOR=NEUTRAL,                                          X00450001
               LENGTH=18,                                              X00460001
               POS=(08,16)                                              00470001
ADOORID  DFHMDF POS=(08,35),                                           X00480001
               LENGTH=4,                                               X00490001
               HILIGHT=UNDERLINE,                                      X00500001
               COLOR=GREEN,                                            X00501001
               ATTRB=(UNPROT)                                           00510001
         DFHMDF ATTRB=(ASKIP),                                         X00510106
               LENGTH=1,                                               X00510201
               POS=(08,40)                                              00510301
**********************************************************************  00511001
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00512001
               INITIAL='DOOR TYPE CODE...:',                           X00513001
               COLOR=NEUTRAL,                                          X00514001
               LENGTH=18,                                              X00515001
               POS=(10,16)                                              00516001
ADRTYPC  DFHMDF POS=(10,35),                                           X00517001
               LENGTH=2,                                               X00518001
               HILIGHT=UNDERLINE,                                      X00519001
               COLOR=GREEN,                                            X00519101
               ATTRB=(UNPROT)                                           00519201
         DFHMDF POS=(10,038),                                          X00519306
               ATTRB=(ASKIP,DRK),                                      X00519403
               LENGTH=001                                               00519503
ADRTYDS  DFHMDF POS=(10,40),                                           X00520001
               LENGTH=30,                                              X00530001
               COLOR=BLUE,                                             X00540001
               ATTRB=(PROT,ASKIP)                                       00550001
         DFHMDF ATTRB=(ASKIP),                                         X00560006
               LENGTH=1,                                               X00570001
               POS=(10,72)                                              00580001
**********************************************************************  01400001
         DFHMSD TYPE=FINAL                                              01410001
         END                                                            01420001
