  PRINT  NOGEN                                                          00010002
*-------------------------------------------------------------------*   00020002
*                                                                   *   00030002
*        MAPSET  CNKM242                                            *   00040002
*        MAP     CN242A                                             *   00050002
*        PROGRAM CNKCS242                                           *   00060002
*        TRANSID Y241 - TRANSPORTATION AIR/LANDED VENDOR UPDATE     *   00070002
*        SYSTEM  CICS ARCHITECTURE                                  *   00080002
*                                                                   *   00090002
*-------------------------------------------------------------------*   00100002
CNKM242 DFHMSD TYPE=MAP,                                               X00110002
               MODE=INOUT,                                             X00120002
               LANG=COBOL,                                             X00130002
               TIOAPFX=YES,                                            X00140002
               CTRL=(FREEKB)                                            00150002
CN242A  DFHMDI LINE=1,COLUMN=1,                                        X00160002
               SIZE=(20,80),                                           X00170002
               MAPATTS=(COLOR,HILIGHT),                                X00180002
               DSATTS=(COLOR,HILIGHT)                                   00190002
*-------------------------------------------------------------------*   00200002
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00210002
               INITIAL='ENTITY.........:',                             X00220002
               LENGTH=16,                                              X00230002
               COLOR=NEUTRAL,                                          X00240002
               POS=(4,9)                                                00250003
AENTID  DFHMDF ATTRB=(UNPROT,NORM),                                    X00260002
               HILIGHT=UNDERLINE,                                      X00270002
               COLOR=GREEN,                                            X00280002
               LENGTH=9,                                               X00290003
               POS=(4,30)                                               00300007
        DFHMDF ATTRB=(ASKIP),                                          X00301007
               LENGTH=01,                                              X00303007
               POS=(4,40)                                               00304007
ANAME   DFHMDF ATTRB=(ASKIP),                                          X00310007
               COLOR=BLUE,                                             X00330007
               LENGTH=25,                                              X00340002
               POS=(4,42)                                               00350007
*-------------------------------------------------------------------*   00360002
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00370002
               INITIAL='FILE TYPE CODE.........:',                     X00380003
               LENGTH=19,                                              X00390003
               COLOR=NEUTRAL,                                          X00400002
               POS=(6,9)                                                00410003
ATYPE   DFHMDF ATTRB=(UNPROT,NORM),                                    X00420008
               LENGTH=2,                                               X00430003
               COLOR=GREEN,                                            X00440008
               POS=(6,30)                                               00450007
        DFHMDF ATTRB=(ASKIP),                                          X00460002
               LENGTH=1,                                               X00470002
               COLOR=NEUTRAL,                                          X00480002
               POS=(6,33)                                               00490007
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00500002
               INITIAL='CN=CONTAINER               ',                  X00510004
               LENGTH=27,                                              X00520002
               COLOR=NEUTRAL,                                          X00530002
               POS=(6,42)                                               00540003
*-------------------------------------------------------------------*   00550002
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00560002
               INITIAL='TRACKING INDICATOR:',                          X00570003
               LENGTH=16,                                              X00580003
               COLOR=NEUTRAL,                                          X00590002
               POS=(8,4)                                                00600003
ATRKNG  DFHMDF ATTRB=(UNPROT,NORM),                                    X00610008
               LENGTH=1,                                               X00620002
               COLOR=GREEN,                                            X00630008
               POS=(8,30)                                               00640007
        DFHMDF ATTRB=(ASKIP),                                          X00650002
               LENGTH=1,                                               X00660002
               COLOR=NEUTRAL,                                          X00670002
               POS=(8,32)                                               00680007
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00690002
               INITIAL='N=NO                       ',                  X00700003
               LENGTH=27,                                              X00710002
               COLOR=NEUTRAL,                                          X00720002
               POS=(8,42)                                               00730003
*-------------------------------------------------------------------*   00740002
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00787002
               INITIAL='STATUS CODE.......:',                          X00788003
               LENGTH=16,                                              X00789003
               COLOR=NEUTRAL,                                          X00789102
               POS=(10,9)                                               00789203
ASTAT   DFHMDF ATTRB=(UNPROT,NORM),                                    X00789308
               LENGTH=1,                                               X00789403
               COLOR=GREEN,                                            X00789508
               POS=(10,30)                                              00789607
        DFHMDF ATTRB=(ASKIP),                                          X00789702
               LENGTH=1,                                               X00789802
               COLOR=NEUTRAL,                                          X00789902
               POS=(10,32)                                              00790007
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00790103
               INITIAL='A=ACTIVE   I= INACTIVE     ',                  X00790203
               LENGTH=27,                                              X00790303
               COLOR=NEUTRAL,                                          X00790403
               POS=(10,42)                                              00790503
*-------------------------------------------------------------------*   00791002
        DFHMSD TYPE=FINAL                                               00810702
        END                                                             00810802
