  PRINT  NOGEN                                                          00003   
*-------------------------------------------------------------------*   00004   
*                                                                   *   00005   
*        MAPSET  CNKM212                                            *   00006   
*        MAP     CN212A                                             *   00007   
*        PROGRAM CNKCS212                                           *   00008   
*        TRANSID Y211 - P2L MOD/STORE UPDATE LIST                   *   00009   
*        SYSTEM  CN - P2L                                               00010   
*                                                                   *   00011   
*-------------------------------------------------------------------*   00012   
CNKM212 DFHMSD TYPE=DSECT,                                             X00013   
               MODE=INOUT,                                             X00014   
               LANG=COBOL,                                             X00015   
               STORAGE=AUTO,                                           X00016   
               TIOAPFX=YES,                                            X00017   
               TERM=3270-2                                              00018   
CN212A  DFHMDI LINE=2,COLUMN=1,                                        X00019   
               SIZE=(19,80),                                           X00020   
               MAPATTS=(COLOR,HILIGHT),                                X00021   
               DSATTS=(COLOR,HILIGHT),                                 X00022   
               CTRL=(FREEKB)                                            00023   
*                                                                       00024   
        DFHMDF POS=(04,48),                                            X00084   
               LENGTH=05,                                              X00085   
               ATTRB=(ASKIP,NORM),                                     X00086   
               COLOR=NEUTRAL,                                          X00087   
               INITIAL='ITEMS'                                          00088   
*                                                                       00065   
ASTRTIT DFHMDF POS=(04,54),                                            X00089   
               LENGTH=05,                                              X00090   
               ATTRB=(NUM,UNPROT,NORM),                                X00091   
               COLOR=GREEN,                                            X00092   
               HILIGHT=UNDERLINE,                                      X00093   
               PICOUT='ZZZZ9'                                           00094   
        DFHMDF POS=(04,61),                                            X00095   
               LENGTH=02,                                              X00096   
               ATTRB=(ASKIP,NORM),                                     X00097   
               COLOR=NEUTRAL,                                          X00098   
               INITIAL='TO'                                             00099   
AENDIT  DFHMDF POS=(04,64),                                            X00100   
               LENGTH=05,                                              X00101   
               ATTRB=(ASKIP,NORM),                                     X00102   
               COLOR=BLUE,                                             X00103   
               PICOUT='ZZZZ9'                                           00104   
        DFHMDF POS=(04,70),                                            X00105   
               LENGTH=02,                                              X00106   
               ATTRB=(ASKIP,NORM),                                     X00107   
               COLOR=NEUTRAL,                                          X00108   
               INITIAL='OF'                                             00109   
ATOTIT  DFHMDF POS=(04,73),                                            X00110   
               LENGTH=05,                                              X00111   
               ATTRB=(ASKIP,NORM),                                     X00112   
               COLOR=BLUE,                                             X00113   
               PICOUT='ZZZZ9'                                           00114   
*                                                                       00115   
*                                                                       00139   
*   FIRST COLUMN HEADING LINE                                           00191   
*                                                                       00192   
        DFHMDF POS=(05,01),                                            X00193   
               LENGTH=41,                                              X00194   
               ATTRB=(PROT,NORM),                                      X00195   
               COLOR=NEUTRAL,                                          X00196   
               INITIAL='           ZONE                          '      00197   
*                                                                       00203   
        DFHMDF POS=(06,01),                                            X00204   
               LENGTH=41,                                              X00205   
               ATTRB=(PROT,NORM),                                      X00206   
               COLOR=NEUTRAL,                                          X00207   
               INITIAL='SEL  ACT   ABBR     ZONE DESCRIPTION     '      00208   
*                                                                       00209   
*                                                                       00215   
*   DETAIL COLUMNS                                                      00216   
*                                                                       00217   
ASEL01  DFHMDF POS=(07,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM,IC),                                 X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(07,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT01  DFHMDF POS=(07,06),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON01 DFHMDF POS=(07,12),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AZDSC01 DFHMDF POS=(07,21),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL02  DFHMDF POS=(08,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(08,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT02  DFHMDF POS=(08,06),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON02 DFHMDF POS=(08,12),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AZDSC02 DFHMDF POS=(08,21),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL03  DFHMDF POS=(09,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(09,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT03  DFHMDF POS=(09,06),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON03 DFHMDF POS=(09,12),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AZDSC03 DFHMDF POS=(09,21),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL04  DFHMDF POS=(10,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(10,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT04  DFHMDF POS=(10,06),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON04 DFHMDF POS=(10,12),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AZDSC04 DFHMDF POS=(10,21),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL05  DFHMDF POS=(11,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(11,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT05  DFHMDF POS=(11,06),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON05 DFHMDF POS=(11,12),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AZDSC05 DFHMDF POS=(11,21),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL06  DFHMDF POS=(12,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(12,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT06  DFHMDF POS=(12,06),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON06 DFHMDF POS=(12,12),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AZDSC06 DFHMDF POS=(12,21),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
ASEL07  DFHMDF POS=(13,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(13,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT07  DFHMDF POS=(13,06),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON07 DFHMDF POS=(13,12),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AZDSC07 DFHMDF POS=(13,21),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
ASEL08  DFHMDF POS=(14,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(14,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT08  DFHMDF POS=(14,06),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON08 DFHMDF POS=(14,12),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AZDSC08 DFHMDF POS=(14,21),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
ASEL09  DFHMDF POS=(15,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(15,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT09  DFHMDF POS=(15,06),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON09 DFHMDF POS=(15,12),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AZDSC09 DFHMDF POS=(15,21),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
ASEL10  DFHMDF POS=(16,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(16,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT10  DFHMDF POS=(16,06),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON10 DFHMDF POS=(16,12),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AZDSC10 DFHMDF POS=(16,21),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
ASEL11  DFHMDF POS=(17,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(17,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT11  DFHMDF POS=(17,06),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON11 DFHMDF POS=(17,12),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AZDSC11 DFHMDF POS=(17,21),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
ASEL12  DFHMDF POS=(18,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(18,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT12  DFHMDF POS=(18,06),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON12 DFHMDF POS=(18,12),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AZDSC12 DFHMDF POS=(18,21),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
*                                                                       00897   
*                                                                       00898   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00899   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00900   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00901   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00902   
**************                                                          00903   
        DFHMSD TYPE=FINAL                                               00904   
**************                                                          00905   
        END                                                             00906   
