*          DATA SET CNKM225                                             00010000
  PRINT  NOGEN                                                          00020000
*-------------------------------------------------------------------*   00030000
*                                                                   *   00040000
*        MAPSET  CNKM225                                            *   00050000
*        MAP     CNK225                                             *   00060000
*        PROGRAM CNKCS225                                           *   00070000
*        TRANSID Y225 - DC-DOOR DEFINITION ADD/UPDATE SCREEN       *    00080000
*                                                                   *   00090000
*******************************************************************     00110000
*                                                                       00120000
*  CNKM225  MAPSET -  THIS IS THE BMS MAP FOR THE DC DOOR DEFINITION    00130000
*    UPDATE/ADD FUNCTION                                                00140000
*                                                                       00150000
*******************************************************************     00160000
CNKM225 DFHMSD TYPE=DSECT,                                             C00170000
               LANG=COBOL,                                             C00180000
               MODE=INOUT,                                             C00190000
               STORAGE=AUTO,                                           C00200000
               TERM=3270-2,                                            C00210000
               TIOAPFX=YES                                              00220000
CNK225  DFHMDI LINE=2,COLUMN=1,                                        C00230000
               SIZE=(19,80),                                           C00240000
               CTRL=(FREEKB),                                          C00250000
               MAPATTS=(COLOR,HILIGHT),                                C00260000
               DSATTS=(COLOR,HILIGHT)                                   00270000
*******************************************************************     00280000
*******************************************************************     00290000
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00300000
               INITIAL='CURRENT OPER UNIT.:',                          X00310000
               COLOR=NEUTRAL,                                          X00320000
               LENGTH=19,                                              X00330000
               POS=(04,16)                                              00340000
ACPRUNT  DFHMDF POS=(04,36),                                           X00350000
               LENGTH=4,                                               X00360000
               COLOR=BLUE,                                             X00370000
               ATTRB=ASKIP                                              00380000
ACPRNME  DFHMDF POS=(04,41),                                           X00390000
               LENGTH=25,                                              X00400000
               COLOR=BLUE,                                             X00410000
               ATTRB=ASKIP                                              00420000
        DFHMDF ATTRB=(ASKIP),                                          X00430000
               LENGTH=1,                                               X00440000
               POS=(04,68)                                              00450000
*******************************************************************     00451000
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00452000
               INITIAL='OPER UNIT ID......:',                          X00453000
               COLOR=NEUTRAL,                                          X00454000
               LENGTH=19,                                              X00455000
               POS=(06,16)                                              00456000
AOPRUNT  DFHMDF POS=(06,36),                                           X00457000
               LENGTH=4,                                               X00458000
               COLOR=BLUE,                                             X00459000
               ATTRB=ASKIP                                              00459100
AOPRNME  DFHMDF POS=(06,41),                                           X00459200
               LENGTH=25,                                              X00459300
               COLOR=BLUE,                                             X00459400
               ATTRB=ASKIP                                              00459500
        DFHMDF ATTRB=(ASKIP),                                          X00459600
               LENGTH=1,                                               X00459700
               POS=(06,68)                                              00459801
*******************************************************************     00460000
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00470000
               INITIAL='DOOR ID............:',                         X00480000
               COLOR=NEUTRAL,                                          X00490000
               LENGTH=19,                                              X00500000
               POS=(08,16)                                              00510000
ADOORID  DFHMDF POS=(08,36),                                           X00520000
               LENGTH=4,                                               X00530000
               HILIGHT=UNDERLINE,                                      X00540000
               COLOR=GREEN,                                            X00541000
               ATTRB=UNPROT                                             00550000
        DFHMDF ATTRB=(ASKIP),                                          X00560000
               LENGTH=1,                                               X00570000
               POS=(08,41)                                              00580000
*******************************************************************     00590000
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00600000
               INITIAL='DOOR TYPE CODE....:',                          X00610000
               COLOR=NEUTRAL,                                          X00620000
               LENGTH=19,                                              X00630000
               POS=(10,16)                                              00640000
ADRTYPC  DFHMDF POS=(10,36),                                           X00650000
               LENGTH=2,                                               X00660000
               HILIGHT=UNDERLINE,                                      X00670000
               COLOR=GREEN,                                            X00680000
               ATTRB=(UNPROT)                                           00690000
        DFHMDF ATTRB=(ASKIP),                                          X00700000
               LENGTH=1,                                               X00710000
               POS=(10,39)                                              00720000
ADRTYDS  DFHMDF POS=(10,41),                                           X00721000
               LENGTH=30,                                              X00722000
               COLOR=BLUE,                                             X00724000
               ATTRB=(ASKIP)                                            00725000
        DFHMDF ATTRB=(ASKIP),                                          X00726000
               LENGTH=1,                                               X00727000
               POS=(10,73)                                              00728000
*******************************************************************     00730000
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00740000
               INITIAL='DOOR LOCATION DESC:',                          X00750000
               COLOR=NEUTRAL,                                          X00760000
               LENGTH=19,                                              X00770000
               POS=(12,16)                                              00780000
ALOCDSC  DFHMDF POS=(12,36),                                           X00790000
               LENGTH=30,                                              X00800000
               HILIGHT=UNDERLINE,                                      X00810000
               COLOR=GREEN,                                            X00820000
               ATTRB=(UNPROT)                                           00830000
        DFHMDF ATTRB=(ASKIP),                                          X00840000
               LENGTH=1,                                               X00850000
               POS=(12,67)                                              00860002
*******************************************************************     00870000
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00880000
               INITIAL='LANE ASSIGNMENT...:',                          X00890000
               COLOR=NEUTRAL,                                          X00900000
               LENGTH=19,                                              X00910000
               POS=(14,16)                                              00920000
ALANEASG  DFHMDF POS=(14,36),                                          X00930000
               LENGTH=9,                                               X00940002
               HILIGHT=UNDERLINE,                                      X00950000
               COLOR=GREEN,                                            X00960000
               ATTRB=UNPROT                                             00970000
        DFHMDF ATTRB=(ASKIP),                                          X00980000
               LENGTH=1,                                               X00990000
               POS=(14,46)                                              01000000
*******************************************************************     01010000
         DFHMDF ATTRB=(ASKIP,BRT),                                     X01020000
               INITIAL='DIVERT LOCATION ID:',                          X01030003
               COLOR=NEUTRAL,                                          X01040000
               LENGTH=19,                                              X01050000
               POS=(16,16)                                              01060000
ADIVLOC  DFHMDF POS=(16,36),                                           X01070003
               LENGTH=04,                                              X01080000
               HILIGHT=UNDERLINE,                                      X01090000
               COLOR=GREEN,                                            X01100000
               ATTRB=UNPROT                                             01110000
        DFHMDF ATTRB=(ASKIP),                                          X01120000
               LENGTH=1,                                               X01130000
               POS=(16,41)                                              01140000
*******************************************************************     01141003
         DFHMDF ATTRB=(ASKIP,BRT),                                     X01142003
               INITIAL='LABEL SEQUENCE NBR:',                          X01143003
               COLOR=NEUTRAL,                                          X01144003
               LENGTH=19,                                              X01145003
               POS=(18,16)                                              01146003
ALBLNBR  DFHMDF POS=(18,36),                                           X01147003
               LENGTH=04,                                              X01148003
               HILIGHT=UNDERLINE,                                      X01149003
               COLOR=GREEN,                                            X01149103
               ATTRB=UNPROT                                             01149203
        DFHMDF ATTRB=(ASKIP),                                          X01149303
               LENGTH=1,                                               X01149403
               POS=(18,41)                                              01149503
*******************************************************************     01150000
*******************************************************************     02030000
*******************************************************************     02040000
         DFHMSD TYPE=FINAL                                              02050000
         END                                                            02060000
