*          DATA SET CNKM217                                             00003   
        PRINT  NOGEN                                                    00004   
*-------------------------------------------------------------------*   00005   
*                                                                   *   00006   
*        MAPSET  CNKM217                                            *   00008   
*        MAP     CNK217                                             *   00007   
*        PROGRAM CNKCS217                                           *   00009   
*        TRANSID Y217 - PRINTER TYPE LIST                           *   00010   
*                                                                   *   00012   
*-------------------------------------------------------------------*   00013   
CNKM217 DFHMSD TYPE=DSECT,                                             X00005   
               LANG=COBOL,                                             X00006   
               MODE=INOUT,                                             X00007   
               STORAGE=AUTO,                                           X00008   
               TERM=3270-2,                                            X00009   
               TIOAPFX=YES                                              00010   
**********************************************************************  00011   
CNK217  DFHMDI LINE=2,COLUMN=1,                                        X00012   
               SIZE=(19,80),                                           X00013   
               CTRL=(FREEKB),                                          X00014   
               MAPATTS=(COLOR,HILIGHT),                                X00015   
               DSATTS=(COLOR,HILIGHT)                                   00016   
**********************************************************************  00011   
        DFHMDF POS=(02,43),                                            X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,INITIAL='ITEMS'                                    
ASTRTIT DFHMDF POS=(02,49),                                            X        
               LENGTH=005,                                             X        
               ATTRB=(NUM,UNPROT,NORM),                                X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9',                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(02,55),                                            X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(02,58),                                            X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(02,64),                                            X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(02,67),                                            X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
**********************************************************************  00011   
        DFHMDF POS=(03,64),                                            X00018   
               LENGTH=003,                                             X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='PPR'                                                    
        DFHMDF POS=(03,72),                                            X00018   
               LENGTH=003,                                             X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='BAR'                                                    
        DFHMDF POS=(03,76),                                            X00018   
               LENGTH=003,                                             X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='PTR'                                                    
**********************************************************************  00011   
        DFHMDF POS=(04,07),                                            X00018   
               LENGTH=007,                                             X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='PRINTER'                                                
        DFHMDF POS=(04,64),                                            X00018   
               LENGTH=003,                                             X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='TRK'                                                    
        DFHMDF POS=(04,68),                                            X00018   
               LENGTH=003,                                             X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='AUT'                                                    
        DFHMDF POS=(04,72),                                            X00018   
               LENGTH=003,                                             X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='CDE'                                                    
        DFHMDF POS=(04,76),                                            X00018   
               LENGTH=003,                                             X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='CTL'                                                    
**********************************************************************          
        DFHMDF POS=(05,01),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=001,                                             X        
               INITIAL='S'                                                      
        DFHMDF POS=(05,03),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='ACT'                                            00025   
        DFHMDF POS=(05,07),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=008,                                             X        
               INITIAL='TYPE CDE'                                               
        DFHMDF POS=(05,17),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=016,                                             X        
               INITIAL='MANUFACTURE DESC'                               00025   
        DFHMDF POS=(05,38),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010,                                             X        
               INITIAL='MODEL DESC'                                             
        DFHMDF POS=(05,64),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='QTY'                                                    
        DFHMDF POS=(05,68),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='CTR'                                            00025   
        DFHMDF POS=(05,72),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='IND'                                            00025   
        DFHMDF POS=(05,76),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='IND'                                            00025   
**********************************************************************  00011   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL01  DFHMDF POS=(06,001),                                           X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT01  DFHMDF POS=(06,003),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=003                                                       
APRTY01 DFHMDF POS=(06,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
AMFDS01 DFHMDF POS=(06,017),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                                       
AMLDS01 DFHMDF POS=(06,038),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=025                                               00140   
APRTQ01 DFHMDF POS=(06,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               PICOUT='ZZZZ',                                          X        
               LENGTH=004                                               00140   
AAUCT01 DFHMDF POS=(06,069),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
ABRCD01 DFHMDF POS=(06,073),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
APTCL01 DFHMDF POS=(06,077),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
**********************************************************************  00011   
ASEL02  DFHMDF POS=(07,001),                                           X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT02  DFHMDF POS=(07,003),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=003                                                       
APRTY02 DFHMDF POS=(07,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
AMFDS02 DFHMDF POS=(07,017),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                                       
AMLDS02 DFHMDF POS=(07,038),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=025                                               00140   
APRTQ02 DFHMDF POS=(07,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAUCT02 DFHMDF POS=(07,069),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
ABRCD02 DFHMDF POS=(07,073),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
APTCL02 DFHMDF POS=(07,077),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
**********************************************************************  00011   
ASEL03  DFHMDF POS=(08,001),                                           X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT03  DFHMDF POS=(08,003),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=003                                                       
APRTY03 DFHMDF POS=(08,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
AMFDS03 DFHMDF POS=(08,017),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                                       
AMLDS03 DFHMDF POS=(08,038),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=025                                               00140   
APRTQ03 DFHMDF POS=(08,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAUCT03 DFHMDF POS=(08,069),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
ABRCD03 DFHMDF POS=(08,073),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
APTCL03 DFHMDF POS=(08,077),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
**********************************************************************  00011   
ASEL04  DFHMDF POS=(09,001),                                           X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT04  DFHMDF POS=(09,003),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=003                                                       
APRTY04 DFHMDF POS=(09,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
AMFDS04 DFHMDF POS=(09,017),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                                       
AMLDS04 DFHMDF POS=(09,038),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=025                                               00140   
APRTQ04 DFHMDF POS=(09,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAUCT04 DFHMDF POS=(09,069),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
ABRCD04 DFHMDF POS=(09,073),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
APTCL04 DFHMDF POS=(09,077),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
**********************************************************************  00011   
ASEL05  DFHMDF POS=(10,001),                                           X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT05  DFHMDF POS=(10,003),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=003                                                       
APRTY05 DFHMDF POS=(10,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
AMFDS05 DFHMDF POS=(10,017),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                                       
AMLDS05 DFHMDF POS=(10,038),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=025                                               00140   
APRTQ05 DFHMDF POS=(10,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAUCT05 DFHMDF POS=(10,069),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
ABRCD05 DFHMDF POS=(10,073),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
APTCL05 DFHMDF POS=(10,077),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
**********************************************************************  00011   
ASEL06  DFHMDF POS=(11,001),                                           X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT06  DFHMDF POS=(11,003),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=003                                                       
APRTY06 DFHMDF POS=(11,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
AMFDS06 DFHMDF POS=(11,017),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                                       
AMLDS06 DFHMDF POS=(11,038),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=025                                               00140   
APRTQ06 DFHMDF POS=(11,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAUCT06 DFHMDF POS=(11,069),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
ABRCD06 DFHMDF POS=(11,073),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
APTCL06 DFHMDF POS=(11,077),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
**********************************************************************  00011   
ASEL07  DFHMDF POS=(12,001),                                           X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT07  DFHMDF POS=(12,003),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=003                                                       
APRTY07 DFHMDF POS=(12,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
AMFDS07 DFHMDF POS=(12,017),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                                       
AMLDS07 DFHMDF POS=(12,038),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=025                                               00140   
APRTQ07 DFHMDF POS=(12,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAUCT07 DFHMDF POS=(12,069),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
ABRCD07 DFHMDF POS=(12,073),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
APTCL07 DFHMDF POS=(12,077),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
**********************************************************************  00011   
ASEL08  DFHMDF POS=(13,001),                                           X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT08  DFHMDF POS=(13,003),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=003                                                       
APRTY08 DFHMDF POS=(13,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
AMFDS08 DFHMDF POS=(13,017),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                                       
AMLDS08 DFHMDF POS=(13,038),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=025                                               00140   
APRTQ08 DFHMDF POS=(13,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAUCT08 DFHMDF POS=(13,069),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
ABRCD08 DFHMDF POS=(13,073),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
APTCL08 DFHMDF POS=(13,077),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
**********************************************************************  00011   
ASEL09  DFHMDF POS=(14,001),                                           X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT09  DFHMDF POS=(14,003),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=003                                                       
APRTY09 DFHMDF POS=(14,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
AMFDS09 DFHMDF POS=(14,017),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                                       
AMLDS09 DFHMDF POS=(14,038),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=025                                               00140   
APRTQ09 DFHMDF POS=(14,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAUCT09 DFHMDF POS=(14,069),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
ABRCD09 DFHMDF POS=(14,073),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
APTCL09 DFHMDF POS=(14,077),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
**********************************************************************  00011   
ASEL10  DFHMDF POS=(15,001),                                           X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT10  DFHMDF POS=(15,003),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=003                                                       
APRTY10 DFHMDF POS=(15,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
AMFDS10 DFHMDF POS=(15,017),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                                       
AMLDS10 DFHMDF POS=(15,038),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=025                                               00140   
APRTQ10 DFHMDF POS=(15,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAUCT10 DFHMDF POS=(15,069),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
ABRCD10 DFHMDF POS=(15,073),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
APTCL10 DFHMDF POS=(15,077),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
**********************************************************************  00011   
ASEL11  DFHMDF POS=(16,001),                                           X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT11  DFHMDF POS=(16,003),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=003                                                       
APRTY11 DFHMDF POS=(16,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
AMFDS11 DFHMDF POS=(16,017),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                                       
AMLDS11 DFHMDF POS=(16,038),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=025                                               00140   
APRTQ11 DFHMDF POS=(16,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAUCT11 DFHMDF POS=(16,069),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
ABRCD11 DFHMDF POS=(16,073),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
APTCL11 DFHMDF POS=(16,077),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
**********************************************************************  00011   
ASEL12  DFHMDF POS=(17,001),                                           X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT12  DFHMDF POS=(17,003),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=003                                                       
APRTY12 DFHMDF POS=(17,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
AMFDS12 DFHMDF POS=(17,017),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                                       
AMLDS12 DFHMDF POS=(17,038),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=025                                               00140   
APRTQ12 DFHMDF POS=(17,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAUCT12 DFHMDF POS=(17,069),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
ABRCD12 DFHMDF POS=(17,073),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
APTCL12 DFHMDF POS=(17,077),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
**********************************************************************  00011   
ASEL13  DFHMDF POS=(18,001),                                           X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT13  DFHMDF POS=(18,003),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=003                                                       
APRTY13 DFHMDF POS=(18,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
AMFDS13 DFHMDF POS=(18,017),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                                       
AMLDS13 DFHMDF POS=(18,038),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=025                                               00140   
APRTQ13 DFHMDF POS=(18,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAUCT13 DFHMDF POS=(18,069),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
ABRCD13 DFHMDF POS=(18,073),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
APTCL13 DFHMDF POS=(18,077),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=01                                                00140   
**********************************************************************  00011   
**********************************************************************  00011   
         DFHMDF POS=(19,040),                                          X00728   
               COLOR=NEUTRAL,                                          X00729   
               ATTRB=(ASKIP,NORM),                                     X00730   
               LENGTH=025,                                             X00731   
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00732   
ASELIT   DFHMDF POS=(19,067),                                          X00733   
               COLOR=BLUE,                                             X00734   
               ATTRB=(ASKIP,NORM),                                     X00735   
               LENGTH=007,                                             X00736   
               PICOUT='ZZZ,ZZ9'                                         00737   
**********************************************************************  00011   
**********************************************************************  00011   
**********************************************************************  00011   
         DFHMSD TYPE=FINAL                                              00347   
         END                                                            00349   
