*          DATA SET CNKM209    AT LEVEL 001 AS OF 10/13/93                      
*          DATA SET CNKM209    AT LEVEL 001 AS OF 05/11/93              00001   
  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  CNKM209                                            *   00005   
*        MAP     CN209A                                             *   00006   
*        PROGRAM CNKCS209                                           *   00007   
*        TRANSID Y209                                               *   00008   
*        SYSTEM  CICS ARCH - ASSIGN DEPARTMENT/CLASS TICKET FORMAT  *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
CNKM209 DFHMSD TYPE=DSECT,                                             X00012   
               LANG=COBOL,                                             X00013   
               MODE=INOUT,                                             X00014   
               STORAGE=AUTO,                                           X00015   
               TIOAPFX=YES,                                            X00016   
               TERM=3270-2                                              00017   
CN209A  DFHMDI LINE=2,COLUMN=1,                                        X00018   
               SIZE=(19,80),                                           X00019   
               CTRL=(FREEKB),                                          X00020   
               MAPATTS=(COLOR,HILIGHT),                                X00021   
               DSATTS=(COLOR,HILIGHT)                                   00022   
*                                                                       00023   
        DFHMDF POS=(03,10),                                            X00024**2
               LENGTH=10,                                              X00025**2
               ATTRB=(ASKIP,BRT),                                      X00026**2
               INITIAL='OPER UNIT:'                                     00027**2
AOPER   DFHMDF POS=(03,21),                                            X00028**2
               LENGTH=4,                                               X00029**2
               ATTRB=(ASKIP,NORM),                                     X00030**2
               COLOR=BLUE                                               00031**2
        DFHMDF POS=(03,28),                                            X00032**2
               LENGTH=06,                                              X00033**2
               ATTRB=(ASKIP,BRT),                                      X00034**2
               INITIAL='FCLTY:'                                         00035**2
AFCLTY  DFHMDF POS=(03,36),                                            X00036**2
               LENGTH=4,                                               X00037**2
               PICOUT='ZZZZ',                                          X00038**3
               ATTRB=(ASKIP,NORM),                                     X00039**2
               COLOR=BLUE                                               00040**2
AFDESC  DFHMDF POS=(03,42),                                            X00041**2
               LENGTH=25,                                              X00042**2
               ATTRB=(ASKIP,NORM),                                     X00043**2
               COLOR=BLUE                                               00044**2
*                                                                       00045**2
        DFHMDF POS=(04,10),                                            X00046   
               LENGTH=26,                                              X00047   
               ATTRB=(ASKIP,BRT),                                      X00048   
               INITIAL='MERCHANDISE DEPARTMENT...:',                   X00049   
               COLOR=NEUTRAL                                            00050   
ADEPT   DFHMDF POS=(04,39),                                            X00051   
               LENGTH=3,                                               X00052   
               ATTRB=(UNPROT,IC),                                      X00053   
               COLOR=GREEN,                                            X00054   
               HILIGHT=UNDERLINE                                        00055   
        DFHMDF POS=(04,43),                                            X00056   
               LENGTH=1,                                               X00057   
               ATTRB=ASKIP                                              00058   
*                                                                       00059   
        DFHMDF POS=(05,10),                                            X00060   
               LENGTH=26,                                              X00061   
               ATTRB=(ASKIP,BRT),                                      X00062   
               INITIAL='MERCHANDISE CLASS........:',                   X00063   
               COLOR=NEUTRAL                                            00064   
ACLAS   DFHMDF POS=(05,39),                                            X00065   
               LENGTH=2,                                               X00066   
               ATTRB=UNPROT,                                           X00067   
               COLOR=GREEN,                                            X00068   
               HILIGHT=UNDERLINE                                        00069   
        DFHMDF POS=(05,42),                                            X00070   
               LENGTH=1,                                               X00071   
               ATTRB=ASKIP                                              00072   
*                                                                       00073   
        DFHMDF POS=(06,10),                                            X00074   
               LENGTH=26,                                              X00075   
               ATTRB=(ASKIP,BRT),                                      X00076   
               INITIAL='TICKET FORMAT............:',                   X00077   
               COLOR=NEUTRAL                                            00078   
AFMT    DFHMDF POS=(06,39),                                            X00079   
               LENGTH=6,                                               X00080   
               ATTRB=UNPROT,                                           X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE                                        00083   
        DFHMDF POS=(06,46),                                            X00084   
               LENGTH=1,                                               X00085   
               ATTRB=ASKIP                                              00086   
*                                                                       00087   
        DFHMDF POS=(07,10),                                            X00088   
               LENGTH=26,                                              X00089   
               ATTRB=(ASKIP,BRT),                                      X00090   
               INITIAL='RANK.....................:',                   X00091   
               COLOR=NEUTRAL                                            00092   
ARANK   DFHMDF POS=(07,39),                                            X00093   
               LENGTH=1,                                               X00094   
               ATTRB=UNPROT,                                           X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               PICOUT='9'                                               00098   
        DFHMDF POS=(07,41),                                            X00099   
               LENGTH=1,                                               X00100   
               ATTRB=ASKIP                                              00101   
*                                                                       00102   
        DFHMDF POS=(08,10),                                            X00103   
               LENGTH=26,                                              X00104   
               ATTRB=(ASKIP,BRT),                                      X00105   
               INITIAL='TICKET FORMAT DESCRIPTION:',                   X00106   
               COLOR=NEUTRAL                                            00107   
ADESC   DFHMDF POS=(08,39),                                            X00108   
               LENGTH=30,                                              X00109   
               ATTRB=ASKIP,                                            X00110   
               COLOR=BLUE                                               00111   
*                                                                       00112   
        DFHMSD TYPE=FINAL                                               00113   
        END                                                             00114   
