*          DATA SET CNKM243                                             00010002
        PRINT  NOGEN                                                    00020001
*-------------------------------------------------------------------*   00021001
*                                                                   *   00022001
*        MAPSET  CNKM243                                            *   00023002
*        MAP     CNK243                                             *   00024002
*        PROGRAM CNKCS243                                           *   00025002
*        TRANSID Y243 - DC-INTEGRATION PARM CRIT SPEC               *   00026002
*                                                                   *   00027001
*-------------------------------------------------------------------*   00028001
CNKM243 DFHMSD TYPE=DSECT,                                             X00029002
               LANG=COBOL,                                             X00030001
               MODE=INOUT,                                             X00040001
               STORAGE=AUTO,                                           X00050001
               TERM=3270-2,                                            X00060001
               TIOAPFX=YES                                              00070001
**********************************************************************  00080001
CNK243  DFHMDI LINE=2,COLUMN=1,                                        X00090002
               SIZE=(19,80),                                           X00100001
               CTRL=(FREEKB),                                          X00110001
               MAPATTS=(COLOR,HILIGHT),                                X00120001
               DSATTS=(COLOR,HILIGHT)                                   00130001
**********************************************************************  00140001
**********************************************************************  00150001
         DFHMDF POS=(04,06),                                           X00160001
               LENGTH=22,                                              X00170001
               ATTRB=(ASKIP,NORM),                                     X00180001
               COLOR=NEUTRAL,                                          X00190001
               INITIAL='OPER UNIT ID.........:'                         00200001
AOPRUNT  DFHMDF POS=(04,29),                                           X00210001
               LENGTH=04,                                              X00220001
               ATTRB=(ASKIP,NORM),                                     X00230001
               COLOR=BLUE                                               00240001
AOPRNME  DFHMDF POS=(04,34),                                           X00250001
               LENGTH=25,                                              X00260001
               ATTRB=(ASKIP,NORM),                                     X00270001
               COLOR=BLUE                                               00280001
**********************************************************************  00302001
         DFHMDF POS=(06,06),                                           X00303001
               LENGTH=22,                                              X00304001
               ATTRB=(ASKIP,NORM),                                     X00305001
               COLOR=NEUTRAL,                                          X00306001
               INITIAL='INTEGRATION PARM NAME:'                         00307001
APRMNME  DFHMDF POS=(06,29),                                           X00308001
               LENGTH=10,                                              X00309001
               ATTRB=(UNPROT),                                         X00310001
               HILIGHT=UNDERLINE,                                      X00311001
               COLOR=GREEN                                              00312001
         DFHMDF POS=(06,040),                                          X00313001
               ATTRB=(ASKIP,DRK),                                      X00314001
               LENGTH=001                                               00315001
**********************************************************************  00316001
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00317001
               INITIAL='INTEGRATION PARM DESC:',                       X00318001
               COLOR=NEUTRAL,                                          X00319001
               LENGTH=22,                                              X00320001
               POS=(08,06)                                              00330001
APRMDSC  DFHMDF POS=(08,29),                                           X00340001
               LENGTH=50,                                              X00350001
               HILIGHT=UNDERLINE,                                      X00360001
               COLOR=GREEN,                                            X00370001
               ATTRB=(UNPROT)                                           00380001
         DFHMDF ATTRB=(ASKIP),                                         X00390001
               LENGTH=1,                                               X00400001
               POS=(08,80)                                              00410001
**********************************************************************  00420001
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00430001
               INITIAL='APPL FUNCTION DESC...:',                       X00440001
               COLOR=NEUTRAL,                                          X00450001
               LENGTH=22,                                              X00460001
               POS=(10,06)                                              00470001
APRMTYP  DFHMDF POS=(10,29),                                           X00480001
               LENGTH=10,                                              X00490003
               HILIGHT=UNDERLINE,                                      X00500001
               COLOR=GREEN,                                            X00510001
               ATTRB=(UNPROT)                                           00511001
         DFHMDF POS=(10,040),                                          X00512001
               ATTRB=(ASKIP,DRK),                                      X00513001
               LENGTH=001                                               00514001
**********************************************************************  00515004
         DFHMDF POS=(12,006),                                          X00515109
               ATTRB=(ASKIP,NORM),                                     X00515209
               INITIAL='F24-ELEMENT LIST ONLY',                        X00515313
               COLOR=YELLOW,                                           X00515414
               LENGTH=021                                               00515509
**********************************************************************  00515609
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00516004
               INITIAL='ELEMENT SEQUENCE NBR.:',                       X00517004
               COLOR=NEUTRAL,                                          X00518004
               LENGTH=22,                                              X00519004
               POS=(14,06)                                              00519109
AELEMSQ  DFHMDF POS=(14,29),                                           X00519209
               LENGTH=09,                                              X00519315
               HILIGHT=UNDERLINE,                                      X00519404
               COLOR=GREEN,                                            X00519504
               ATTRB=(UNPROT)                                           00519604
         DFHMDF POS=(14,039),                                          X00519715
               ATTRB=(ASKIP,DRK),                                      X00519804
               LENGTH=001                                               00519904
**********************************************************************  00521001
         DFHMSD TYPE=FINAL                                              00530001
         END                                                            00540001
