*          DATA SET CNKM247                                             00010001
        PRINT  NOGEN                                                    00020001
*-------------------------------------------------------------------*   00030001
*                                                                   *   00040001
*        MAPSET  CNKM247                                            *   00050001
*        MAP     CNK247                                             *   00060001
*        PROGRAM CNKCS247                                           *   00070001
*        TRANSID Y247 - CN-INTEGRATION DEFINITION LIST              *   00080001
*                                                                   *   00090001
*-------------------------------------------------------------------*   00100001
CNKM247 DFHMSD TYPE=DSECT,                                             X00110001
               LANG=COBOL,                                             X00120001
               MODE=INOUT,                                             X00130001
               STORAGE=AUTO,                                           X00140001
               TERM=3270-2,                                            X00150001
               TIOAPFX=YES                                              00160001
**********************************************************************  00170001
CNK247  DFHMDI LINE=2,COLUMN=1,                                        X00180001
               SIZE=(19,80),                                           X00190001
               CTRL=(FREEKB),                                          X00200001
               MAPATTS=(COLOR,HILIGHT),                                X00210001
               DSATTS=(COLOR,HILIGHT)                                   00220001
**********************************************************************  00221001
**********************************************************************  00222001
        DFHMDF POS=(02,02),                                            X00223001
               LENGTH=10,                                              X00224001
               ATTRB=(ASKIP,NORM),                                     X00225001
               COLOR=NEUTRAL,INITIAL='PARM NAME:'                       00226001
AIPARM  DFHMDF POS=(02,13),                                            X00227001
               LENGTH=10,                                              X00228001
               ATTRB=(ASKIP,NORM),                                     X00229002
               COLOR=BLUE                                               00229104
AIPDESC DFHMDF POS=(02,24),                                            X00229201
               LENGTH=50,                                              X00229301
               ATTRB=(ASKIP,NORM),                                     X00229402
               COLOR=BLUE                                               00229504
**********************************************************************  00230001
**********************************************************************  00240001
        DFHMDF POS=(03,51),                                            X00250001
               LENGTH=05,                                              X00260001
               ATTRB=(ASKIP,NORM),                                     X00270001
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00280001
ASTRTIT DFHMDF POS=(03,57),                                            X00290001
               LENGTH=05,                                              X00300001
               ATTRB=(NUM,UNPROT,NORM),                                X00310001
               COLOR=GREEN,                                            X00320001
               PICOUT='ZZZZ9',                                         X00330001
               HILIGHT=UNDERLINE                                        00340001
        DFHMDF POS=(03,63),                                            X00350001
               LENGTH=02,                                              X00360001
               ATTRB=(ASKIP,NORM),                                     X00370001
               COLOR=NEUTRAL,                                          X00380001
               INITIAL='TO'                                             00390001
AENDIT  DFHMDF POS=(03,66),                                            X00400001
               LENGTH=05,                                              X00410001
               ATTRB=(ASKIP,NORM),                                     X00420001
               COLOR=BLUE,                                             X00430001
               PICOUT='ZZZZ9'                                           00440001
        DFHMDF POS=(03,72),                                            X00450001
               LENGTH=02,                                              X00460001
               ATTRB=(ASKIP,NORM),                                     X00470001
               COLOR=NEUTRAL,                                          X00480001
               INITIAL='OF'                                             00490001
ATOTIT  DFHMDF POS=(03,75),                                            X00500001
               LENGTH=05,                                              X00510001
               ATTRB=(ASKIP,NORM),                                     X00520001
               COLOR=BLUE,                                             X00530001
               PICOUT='ZZZZ9'                                           00540001
**********************************************************************  00550001
        DFHMDF POS=(04,05),                                            X00560001
               ATTRB=(ASKIP,NORM),                                     X00570001
               COLOR=NEUTRAL,                                          X00580001
               LENGTH=004,                                             X00590001
               INITIAL='DEFN'                                           00600001
        DFHMDF POS=(04,59),                                            X00610003
               ATTRB=(ASKIP,NORM),                                     X00620001
               COLOR=NEUTRAL,                                          X00630001
               LENGTH=001,                                             X00640003
               INITIAL='R'                                              00650003
        DFHMDF POS=(04,61),                                            X00651003
               ATTRB=(ASKIP,NORM),                                     X00652003
               COLOR=NEUTRAL,                                          X00653003
               LENGTH=004,                                             X00654003
               INITIAL='DATA'                                           00655003
        DFHMDF POS=(04,67),                                            X00660003
               ATTRB=(ASKIP,NORM),                                     X00670001
               COLOR=NEUTRAL,                                          X00680001
               LENGTH=003,                                             X00690001
               INITIAL='MAX'                                            00700001
        DFHMDF POS=(04,72),                                            X00701003
               ATTRB=(ASKIP,NORM),                                     X00702001
               COLOR=NEUTRAL,                                          X00703001
               LENGTH=003,                                             X00704001
               INITIAL='DEC'                                            00705001
        DFHMDF POS=(04,76),                                            X00706003
               ATTRB=(ASKIP,NORM),                                     X00707003
               COLOR=NEUTRAL,                                          X00708003
               LENGTH=004,                                             X00709003
               INITIAL='ELEM'                                           00709103
**********************************************************************  00710001
        DFHMDF POS=(05,01),                                            X00720001
               ATTRB=(ASKIP,NORM),                                     X00730001
               COLOR=NEUTRAL,                                          X00740001
               LENGTH=001,                                             X00750001
               INITIAL='S'                                              00760001
        DFHMDF POS=(05,03),                                            X00770001
               ATTRB=(ASKIP,NORM),                                     X00780001
               COLOR=NEUTRAL,                                          X00790001
               LENGTH=001,                                             X00800001
               INITIAL='A'                                              00810001
        DFHMDF POS=(05,06),                                            X00820003
               ATTRB=(ASKIP,NORM),                                     X00830001
               COLOR=NEUTRAL,                                          X00840001
               LENGTH=003,                                             X00850001
               INITIAL='SEQ'                                            00860001
        DFHMDF POS=(05,10),                                            X00870001
               ATTRB=(ASKIP,NORM),                                     X00880001
               COLOR=NEUTRAL,                                          X00890001
               LENGTH=032,                                             X00900001
               INITIAL='ATTRIBUTE DEFINITION DESCRIPTION'               00910001
        DFHMDF POS=(05,59),                                            X00920003
               ATTRB=(ASKIP,NORM),                                     X00930001
               COLOR=NEUTRAL,                                          X00940001
               LENGTH=001,                                             X00950003
               INITIAL='Q'                                              00960003
        DFHMDF POS=(05,61),                                            X00970003
               ATTRB=(ASKIP,NORM),                                     X00980001
               COLOR=NEUTRAL,                                          X00990001
               LENGTH=004,                                             X01000001
               INITIAL='TYPE'                                           01010001
        DFHMDF POS=(05,67),                                            X01011003
               ATTRB=(ASKIP,NORM),                                     X01012001
               COLOR=NEUTRAL,                                          X01013001
               LENGTH=003,                                             X01014001
               INITIAL='LEN'                                            01015001
        DFHMDF POS=(05,72),                                            X01016003
               ATTRB=(ASKIP,NORM),                                     X01017001
               COLOR=NEUTRAL,                                          X01018001
               LENGTH=003,                                             X01019001
               INITIAL='POS'                                            01019101
        DFHMDF POS=(05,77),                                            X01019203
               ATTRB=(ASKIP,NORM),                                     X01019303
               COLOR=NEUTRAL,                                          X01019403
               LENGTH=003,                                             X01019503
               INITIAL='CNT'                                            01019603
**********************************************************************  01020001
**********************************************************************  01030001
ASEL01  DFHMDF POS=(06,001),                                           X01040001
               COLOR=GREEN,                                            X01050001
               HILIGHT=UNDERLINE,                                      X01060001
               ATTRB=(UNPROT,NORM),                                    X01070001
               LENGTH=001                                               01080001
AACT01  DFHMDF POS=(06,003),                                           X01081001
               ATTRB=(ASKIP),                                          X01081101
               LENGTH=001                                               01081201
ADFSQ01 DFHMDF POS=(06,005),                                           X01081301
               COLOR=BLUE,                                             X01081401
               ATTRB=(ASKIP,NORM),                                     X01081501
               LENGTH=004                                               01081601
ADESC01 DFHMDF POS=(06,010),                                           X01081701
               COLOR=BLUE,                                             X01081801
               ATTRB=(ASKIP,NORM),                                     X01081901
               LENGTH=048                                               01082009
AREQD01 DFHMDF POS=(06,059),                                           X01083003
               COLOR=BLUE,                                             X01084001
               ATTRB=(ASKIP,NORM),                                     X01085001
               LENGTH=001                                               01086001
ADTYP01 DFHMDF POS=(06,061),                                           X01087003
               COLOR=BLUE,                                             X01088001
               ATTRB=(ASKIP,NORM),                                     X01089001
               LENGTH=003                                               01090001
AMXLN01 DFHMDF POS=(06,066),                                           X01091003
               COLOR=BLUE,                                             X01092001
               ATTRB=(ASKIP,NORM),                                     X01093001
               LENGTH=004                                               01094001
ADECP01 DFHMDF POS=(06,071),                                           X01095003
               COLOR=BLUE,                                             X01096001
               ATTRB=(ASKIP,NORM),                                     X01097001
               LENGTH=004                                               01098001
AELCT01 DFHMDF POS=(06,076),                                           X01099003
               COLOR=BLUE,                                             X01099103
               ATTRB=(ASKIP,NORM),                                     X01099203
               LENGTH=004                                               01099303
**********************************************************************  01100001
**********************************************************************  01110001
ASEL02  DFHMDF POS=(07,001),                                           X01111001
               COLOR=GREEN,                                            X01112001
               HILIGHT=UNDERLINE,                                      X01113001
               ATTRB=(UNPROT,NORM),                                    X01114001
               LENGTH=001                                               01115001
AACT02  DFHMDF POS=(07,003),                                           X01116001
               ATTRB=(ASKIP),                                          X01117001
               LENGTH=001                                               01118001
ADFSQ02 DFHMDF POS=(07,005),                                           X01119001
               COLOR=BLUE,                                             X01119101
               ATTRB=(ASKIP,NORM),                                     X01119201
               LENGTH=004                                               01119301
ADESC02 DFHMDF POS=(07,010),                                           X01119401
               COLOR=BLUE,                                             X01119501
               ATTRB=(ASKIP,NORM),                                     X01119601
               LENGTH=048                                               01119709
AREQD02 DFHMDF POS=(07,059),                                           X01119803
               COLOR=BLUE,                                             X01119901
               ATTRB=(ASKIP,NORM),                                     X01120001
               LENGTH=001                                               01120101
ADTYP02 DFHMDF POS=(07,061),                                           X01120203
               COLOR=BLUE,                                             X01120301
               ATTRB=(ASKIP,NORM),                                     X01120401
               LENGTH=003                                               01120501
AMXLN02 DFHMDF POS=(07,066),                                           X01120603
               COLOR=BLUE,                                             X01120701
               ATTRB=(ASKIP,NORM),                                     X01120801
               LENGTH=004                                               01120901
ADECP02 DFHMDF POS=(07,071),                                           X01121003
               COLOR=BLUE,                                             X01121101
               ATTRB=(ASKIP,NORM),                                     X01121201
               LENGTH=004                                               01121301
AELCT02 DFHMDF POS=(07,076),                                           X01121403
               COLOR=BLUE,                                             X01121503
               ATTRB=(ASKIP,NORM),                                     X01121603
               LENGTH=004                                               01121703
**********************************************************************  01360001
**********************************************************************  01370001
ASEL03  DFHMDF POS=(08,001),                                           X01371001
               COLOR=GREEN,                                            X01372001
               HILIGHT=UNDERLINE,                                      X01373001
               ATTRB=(UNPROT,NORM),                                    X01374001
               LENGTH=001                                               01375001
AACT03  DFHMDF POS=(08,003),                                           X01376001
               ATTRB=(ASKIP),                                          X01377001
               LENGTH=001                                               01378001
ADFSQ03 DFHMDF POS=(08,005),                                           X01379001
               COLOR=BLUE,                                             X01379101
               ATTRB=(ASKIP,NORM),                                     X01379201
               LENGTH=004                                               01379301
ADESC03 DFHMDF POS=(08,010),                                           X01379401
               COLOR=BLUE,                                             X01379501
               ATTRB=(ASKIP,NORM),                                     X01379601
               LENGTH=048                                               01379709
AREQD03 DFHMDF POS=(08,059),                                           X01379803
               COLOR=BLUE,                                             X01379901
               ATTRB=(ASKIP,NORM),                                     X01380001
               LENGTH=001                                               01380101
ADTYP03 DFHMDF POS=(08,061),                                           X01380203
               COLOR=BLUE,                                             X01380301
               ATTRB=(ASKIP,NORM),                                     X01380401
               LENGTH=003                                               01380501
AMXLN03 DFHMDF POS=(08,066),                                           X01380603
               COLOR=BLUE,                                             X01380701
               ATTRB=(ASKIP,NORM),                                     X01380801
               LENGTH=004                                               01380901
ADECP03 DFHMDF POS=(08,071),                                           X01381003
               COLOR=BLUE,                                             X01381101
               ATTRB=(ASKIP,NORM),                                     X01381201
               LENGTH=004                                               01381301
AELCT03 DFHMDF POS=(08,076),                                           X01381403
               COLOR=BLUE,                                             X01381503
               ATTRB=(ASKIP,NORM),                                     X01381603
               LENGTH=004                                               01381703
**********************************************************************  01620001
**********************************************************************  01630001
ASEL04  DFHMDF POS=(09,001),                                           X01631001
               COLOR=GREEN,                                            X01632001
               HILIGHT=UNDERLINE,                                      X01633001
               ATTRB=(UNPROT,NORM),                                    X01634001
               LENGTH=001                                               01635001
AACT04  DFHMDF POS=(09,003),                                           X01636001
               ATTRB=(ASKIP),                                          X01637001
               LENGTH=001                                               01638001
ADFSQ04 DFHMDF POS=(09,005),                                           X01639001
               COLOR=BLUE,                                             X01639101
               ATTRB=(ASKIP,NORM),                                     X01639201
               LENGTH=004                                               01639301
ADESC04 DFHMDF POS=(09,010),                                           X01639401
               COLOR=BLUE,                                             X01639501
               ATTRB=(ASKIP,NORM),                                     X01639601
               LENGTH=048                                               01639709
AREQD04 DFHMDF POS=(09,059),                                           X01639803
               COLOR=BLUE,                                             X01639901
               ATTRB=(ASKIP,NORM),                                     X01640001
               LENGTH=001                                               01640101
ADTYP04 DFHMDF POS=(09,061),                                           X01640203
               COLOR=BLUE,                                             X01640301
               ATTRB=(ASKIP,NORM),                                     X01640401
               LENGTH=003                                               01640501
AMXLN04 DFHMDF POS=(09,066),                                           X01640603
               COLOR=BLUE,                                             X01640701
               ATTRB=(ASKIP,NORM),                                     X01640801
               LENGTH=004                                               01640901
ADECP04 DFHMDF POS=(09,071),                                           X01641003
               COLOR=BLUE,                                             X01641101
               ATTRB=(ASKIP,NORM),                                     X01641201
               LENGTH=004                                               01641301
AELCT04 DFHMDF POS=(09,076),                                           X01641403
               COLOR=BLUE,                                             X01641503
               ATTRB=(ASKIP,NORM),                                     X01641603
               LENGTH=004                                               01641703
**********************************************************************  01880001
**********************************************************************  01890001
ASEL05  DFHMDF POS=(10,001),                                           X01891001
               COLOR=GREEN,                                            X01892001
               HILIGHT=UNDERLINE,                                      X01893001
               ATTRB=(UNPROT,NORM),                                    X01894001
               LENGTH=001                                               01895001
AACT05  DFHMDF POS=(10,003),                                           X01896001
               ATTRB=(ASKIP),                                          X01897001
               LENGTH=001                                               01898001
ADFSQ05 DFHMDF POS=(10,005),                                           X01899001
               COLOR=BLUE,                                             X01899101
               ATTRB=(ASKIP,NORM),                                     X01899201
               LENGTH=004                                               01899301
ADESC05 DFHMDF POS=(10,010),                                           X01899401
               COLOR=BLUE,                                             X01899501
               ATTRB=(ASKIP,NORM),                                     X01899601
               LENGTH=048                                               01899709
AREQD05 DFHMDF POS=(10,059),                                           X01899803
               COLOR=BLUE,                                             X01899901
               ATTRB=(ASKIP,NORM),                                     X01900001
               LENGTH=001                                               01900101
ADTYP05 DFHMDF POS=(10,061),                                           X01900203
               COLOR=BLUE,                                             X01900301
               ATTRB=(ASKIP,NORM),                                     X01900401
               LENGTH=003                                               01900501
AMXLN05 DFHMDF POS=(10,066),                                           X01900603
               COLOR=BLUE,                                             X01900701
               ATTRB=(ASKIP,NORM),                                     X01900801
               LENGTH=004                                               01900901
ADECP05 DFHMDF POS=(10,071),                                           X01901003
               COLOR=BLUE,                                             X01901101
               ATTRB=(ASKIP,NORM),                                     X01901201
               LENGTH=004                                               01901301
AELCT05 DFHMDF POS=(10,076),                                           X01901403
               COLOR=BLUE,                                             X01901503
               ATTRB=(ASKIP,NORM),                                     X01901603
               LENGTH=004                                               01901703
**********************************************************************  02140001
**********************************************************************  02150001
ASEL06  DFHMDF POS=(11,001),                                           X02151001
               COLOR=GREEN,                                            X02152001
               HILIGHT=UNDERLINE,                                      X02153001
               ATTRB=(UNPROT,NORM),                                    X02154001
               LENGTH=001                                               02155001
AACT06  DFHMDF POS=(11,003),                                           X02156001
               ATTRB=(ASKIP),                                          X02157001
               LENGTH=001                                               02158001
ADFSQ06 DFHMDF POS=(11,005),                                           X02159001
               COLOR=BLUE,                                             X02159101
               ATTRB=(ASKIP,NORM),                                     X02159201
               LENGTH=004                                               02159301
ADESC06 DFHMDF POS=(11,010),                                           X02159401
               COLOR=BLUE,                                             X02159501
               ATTRB=(ASKIP,NORM),                                     X02159601
               LENGTH=048                                               02159709
AREQD06 DFHMDF POS=(11,059),                                           X02159803
               COLOR=BLUE,                                             X02159901
               ATTRB=(ASKIP,NORM),                                     X02160001
               LENGTH=001                                               02160101
ADTYP06 DFHMDF POS=(11,061),                                           X02160203
               COLOR=BLUE,                                             X02160301
               ATTRB=(ASKIP,NORM),                                     X02160401
               LENGTH=003                                               02160501
AMXLN06 DFHMDF POS=(11,066),                                           X02160603
               COLOR=BLUE,                                             X02160701
               ATTRB=(ASKIP,NORM),                                     X02160801
               LENGTH=004                                               02160901
ADECP06 DFHMDF POS=(11,071),                                           X02161003
               COLOR=BLUE,                                             X02161101
               ATTRB=(ASKIP,NORM),                                     X02161201
               LENGTH=004                                               02161301
AELCT06 DFHMDF POS=(11,076),                                           X02161403
               COLOR=BLUE,                                             X02161503
               ATTRB=(ASKIP,NORM),                                     X02161603
               LENGTH=004                                               02161703
**********************************************************************  02400001
**********************************************************************  02410001
ASEL07  DFHMDF POS=(12,001),                                           X02411001
               COLOR=GREEN,                                            X02412001
               HILIGHT=UNDERLINE,                                      X02413001
               ATTRB=(UNPROT,NORM),                                    X02414001
               LENGTH=001                                               02415001
AACT07  DFHMDF POS=(12,003),                                           X02416001
               ATTRB=(ASKIP),                                          X02417001
               LENGTH=001                                               02418001
ADFSQ07 DFHMDF POS=(12,005),                                           X02419001
               COLOR=BLUE,                                             X02419101
               ATTRB=(ASKIP,NORM),                                     X02419201
               LENGTH=004                                               02419301
ADESC07 DFHMDF POS=(12,010),                                           X02419401
               COLOR=BLUE,                                             X02419501
               ATTRB=(ASKIP,NORM),                                     X02419601
               LENGTH=048                                               02419709
AREQD07 DFHMDF POS=(12,059),                                           X02419803
               COLOR=BLUE,                                             X02419901
               ATTRB=(ASKIP,NORM),                                     X02420001
               LENGTH=001                                               02420101
ADTYP07 DFHMDF POS=(12,061),                                           X02420203
               COLOR=BLUE,                                             X02420301
               ATTRB=(ASKIP,NORM),                                     X02420401
               LENGTH=003                                               02420501
AMXLN07 DFHMDF POS=(12,066),                                           X02420603
               COLOR=BLUE,                                             X02420701
               ATTRB=(ASKIP,NORM),                                     X02420801
               LENGTH=004                                               02420901
ADECP07 DFHMDF POS=(12,071),                                           X02421003
               COLOR=BLUE,                                             X02421101
               ATTRB=(ASKIP,NORM),                                     X02421201
               LENGTH=004                                               02421301
AELCT07 DFHMDF POS=(12,076),                                           X02421403
               COLOR=BLUE,                                             X02421503
               ATTRB=(ASKIP,NORM),                                     X02421603
               LENGTH=004                                               02421703
**********************************************************************  02660001
**********************************************************************  02670001
ASEL08  DFHMDF POS=(13,001),                                           X02671001
               COLOR=GREEN,                                            X02672001
               HILIGHT=UNDERLINE,                                      X02673001
               ATTRB=(UNPROT,NORM),                                    X02674001
               LENGTH=001                                               02675001
AACT08  DFHMDF POS=(13,003),                                           X02676001
               ATTRB=(ASKIP),                                          X02677001
               LENGTH=001                                               02678001
ADFSQ08 DFHMDF POS=(13,005),                                           X02679001
               COLOR=BLUE,                                             X02679101
               ATTRB=(ASKIP,NORM),                                     X02679201
               LENGTH=004                                               02679301
ADESC08 DFHMDF POS=(13,010),                                           X02679401
               COLOR=BLUE,                                             X02679501
               ATTRB=(ASKIP,NORM),                                     X02679601
               LENGTH=048                                               02679709
AREQD08 DFHMDF POS=(13,059),                                           X02679803
               COLOR=BLUE,                                             X02679901
               ATTRB=(ASKIP,NORM),                                     X02680001
               LENGTH=001                                               02680101
ADTYP08 DFHMDF POS=(13,061),                                           X02680203
               COLOR=BLUE,                                             X02680301
               ATTRB=(ASKIP,NORM),                                     X02680401
               LENGTH=003                                               02680501
AMXLN08 DFHMDF POS=(13,066),                                           X02680603
               COLOR=BLUE,                                             X02680701
               ATTRB=(ASKIP,NORM),                                     X02680801
               LENGTH=004                                               02680901
ADECP08 DFHMDF POS=(13,071),                                           X02681003
               COLOR=BLUE,                                             X02681101
               ATTRB=(ASKIP,NORM),                                     X02681201
               LENGTH=004                                               02681301
AELCT08 DFHMDF POS=(13,076),                                           X02681403
               COLOR=BLUE,                                             X02681503
               ATTRB=(ASKIP,NORM),                                     X02681603
               LENGTH=004                                               02681703
**********************************************************************  02920001
**********************************************************************  02930001
ASEL09  DFHMDF POS=(14,001),                                           X02931001
               COLOR=GREEN,                                            X02932001
               HILIGHT=UNDERLINE,                                      X02933001
               ATTRB=(UNPROT,NORM),                                    X02934001
               LENGTH=001                                               02935001
AACT09  DFHMDF POS=(14,003),                                           X02936001
               ATTRB=(ASKIP),                                          X02937001
               LENGTH=001                                               02938001
ADFSQ09 DFHMDF POS=(14,005),                                           X02939001
               COLOR=BLUE,                                             X02939101
               ATTRB=(ASKIP,NORM),                                     X02939201
               LENGTH=004                                               02939301
ADESC09 DFHMDF POS=(14,010),                                           X02939401
               COLOR=BLUE,                                             X02939501
               ATTRB=(ASKIP,NORM),                                     X02939601
               LENGTH=048                                               02939709
AREQD09 DFHMDF POS=(14,059),                                           X02939810
               COLOR=BLUE,                                             X02939901
               ATTRB=(ASKIP,NORM),                                     X02940001
               LENGTH=001                                               02940101
ADTYP09 DFHMDF POS=(14,061),                                           X02940203
               COLOR=BLUE,                                             X02940301
               ATTRB=(ASKIP,NORM),                                     X02940401
               LENGTH=003                                               02940501
AMXLN09 DFHMDF POS=(14,066),                                           X02940603
               COLOR=BLUE,                                             X02940701
               ATTRB=(ASKIP,NORM),                                     X02940801
               LENGTH=004                                               02940901
ADECP09 DFHMDF POS=(14,071),                                           X02941003
               COLOR=BLUE,                                             X02941101
               ATTRB=(ASKIP,NORM),                                     X02941201
               LENGTH=004                                               02941301
AELCT09 DFHMDF POS=(14,076),                                           X02941403
               COLOR=BLUE,                                             X02941503
               ATTRB=(ASKIP,NORM),                                     X02941603
               LENGTH=004                                               02941703
**********************************************************************  03180001
**********************************************************************  03190001
**********************************************************************  03440001
**********************************************************************  03450001
         DFHMDF POS=(19,045),                                          X04240001
               COLOR=NEUTRAL,                                          X04250001
               ATTRB=(ASKIP,NORM),                                     X04260001
               LENGTH=025,                                             X04270001
               INITIAL='NUMBER OF SELECTED ITEMS:'                      04280001
ASELIT   DFHMDF POS=(19,072),                                          X04290001
               COLOR=BLUE,                                             X04300001
               ATTRB=(ASKIP,NORM),                                     X04310001
               LENGTH=007,                                             X04320001
               PICOUT='ZZZ,ZZ9'                                         04330001
         DFHMSD TYPE=FINAL                                              04340001
         END                                                            04350001
