  PRINT  NOGEN                                                          00003   
*-------------------------------------------------------------------*   00004   
*                                                                   *   00005   
*        MAPSET  CNKM211                                            *   00006   
*        MAP     CN211A                                             *   00007   
*        PROGRAM CNKCS211                                           *   00008   
*        TRANSID Y211 - P2L MOD/STORE UPDATE LIST                   *   00009   
*        SYSTEM  CN - P2L                                               00010   
*                                                                   *   00011   
*-------------------------------------------------------------------*   00012   
CNKM211 DFHMSD TYPE=DSECT,                                             X00013   
               MODE=INOUT,                                             X00014   
               LANG=COBOL,                                             X00015   
               STORAGE=AUTO,                                           X00016   
               TIOAPFX=YES,                                            X00017   
               TERM=3270-2                                              00018   
CN211A  DFHMDI LINE=2,COLUMN=1,                                        X00019   
               SIZE=(19,80),                                           X00020   
               MAPATTS=(COLOR,HILIGHT),                                X00021   
               DSATTS=(COLOR,HILIGHT),                                 X00022   
               CTRL=(FREEKB)                                            00023   
*                                                                       00024   
        DFHMDF POS=(02,01),                                            X00043   
               LENGTH=13,                                              X00044   
               ATTRB=(ASKIP,NORM),                                     X00045   
               COLOR=NEUTRAL,                                          X00046   
               INITIAL='ZONE SETUP..:'                                  00047   
AZONE   DFHMDF POS=(02,15),                                            X00048   
               LENGTH=14,                                              X00049   
               ATTRB=(ASKIP,NORM),                                     X00050   
               COLOR=BLUE                                               00051   
*                                                                       00024   
        DFHMDF POS=(03,01),                                            X00043   
               LENGTH=13,                                              X00044   
               ATTRB=(ASKIP,NORM),                                     X00045   
               COLOR=NEUTRAL,                                          X00046   
               INITIAL='OPERATING ID:'                                  00047   
AOPER   DFHMDF POS=(03,15),                                            X00048   
               LENGTH=04,                                              X00049   
               ATTRB=(ASKIP,NORM),                                     X00050   
               COLOR=BLUE                                               00051   
AFDESC  DFHMDF POS=(03,22),                                            X00061   
               LENGTH=25,                                              X00062   
               ATTRB=(ASKIP,NORM),                                     X00063   
               COLOR=BLUE                                               00064   
        DFHMDF POS=(04,01),                                            X00052   
               LENGTH=13,                                              X00053   
               ATTRB=(ASKIP,NORM),                                     X00054   
               COLOR=NEUTRAL,                                          X00055   
               INITIAL='FACILITY ID.:'                                  00047   
AFCLTY  DFHMDF POS=(04,15),                                            X00057   
               LENGTH=04,                                              X00058   
               ATTRB=(ASKIP,NORM),                                     X00059   
               COLOR=BLUE                                               00060   
*                                                                       00065   
        DFHMDF POS=(04,48),                                            X00084   
               LENGTH=05,                                              X00085   
               ATTRB=(ASKIP,NORM),                                     X00086   
               COLOR=NEUTRAL,                                          X00087   
               INITIAL='ITEMS'                                          00088   
*                                                                       00065   
ASTRTIT DFHMDF POS=(04,54),                                            X00089   
               LENGTH=05,                                              X00090   
               ATTRB=(NUM,UNPROT,NORM),                                X00091   
               COLOR=GREEN,                                            X00092   
               HILIGHT=UNDERLINE,                                      X00093   
               PICOUT='ZZZZ9'                                           00094   
        DFHMDF POS=(04,61),                                            X00095   
               LENGTH=02,                                              X00096   
               ATTRB=(ASKIP,NORM),                                     X00097   
               COLOR=NEUTRAL,                                          X00098   
               INITIAL='TO'                                             00099   
AENDIT  DFHMDF POS=(04,64),                                            X00100   
               LENGTH=05,                                              X00101   
               ATTRB=(ASKIP,NORM),                                     X00102   
               COLOR=BLUE,                                             X00103   
               PICOUT='ZZZZ9'                                           00104   
        DFHMDF POS=(04,70),                                            X00105   
               LENGTH=02,                                              X00106   
               ATTRB=(ASKIP,NORM),                                     X00107   
               COLOR=NEUTRAL,                                          X00108   
               INITIAL='OF'                                             00109   
ATOTIT  DFHMDF POS=(04,73),                                            X00110   
               LENGTH=05,                                              X00111   
               ATTRB=(ASKIP,NORM),                                     X00112   
               COLOR=BLUE,                                             X00113   
               PICOUT='ZZZZ9'                                           00114   
*                                                                       00115   
*                                                                       00139   
*   FIRST COLUMN HEADING LINE                                           00191   
*                                                                       00192   
        DFHMDF POS=(05,01),                                            X00193   
               LENGTH=41,                                              X00194   
               ATTRB=(PROT,NORM),                                      X00195   
               COLOR=NEUTRAL,                                          X00196   
               INITIAL='          UPDATE   P2L     MOD     STORE '      00197   
        DFHMDF POS=(05,67),                                            X00193   
               LENGTH=12,                                              X00194   
               ATTRB=(PROT,NORM),                                      X00195   
               COLOR=NEUTRAL,                                          X00196   
               INITIAL='MDSE  DIVERT'                                   00197   
*                                                                       00203   
        DFHMDF POS=(06,01),                                            X00204   
               LENGTH=41,                                              X00205   
               ATTRB=(PROT,NORM),                                      X00206   
               COLOR=NEUTRAL,                                          X00207   
               INITIAL='SEL ACT   STR ZN   MOD    DESC      ZONE '      00208   
        DFHMDF POS=(06,43),                                            X00204   
               LENGTH=18,                                              X00205   
               ATTRB=(PROT,NORM),                                      X00206   
               COLOR=NEUTRAL,                                          X00207   
               INITIAL='  ZONE DESCRIPTION'                             00208   
        DFHMDF POS=(06,67),                                            X00193   
               LENGTH=12,                                              X00194   
               ATTRB=(PROT,NORM),                                      X00195   
               COLOR=NEUTRAL,                                          X00196   
               INITIAL='TYPE   CODE '                                   00197   
*                                                                       00209   
*                                                                       00215   
*   DETAIL COLUMNS                                                      00216   
*                                                                       00217   
ASEL01  DFHMDF POS=(07,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM,IC),                                 X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(07,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT01  DFHMDF POS=(07,05),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON01 DFHMDF POS=(07,11),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(UNPROT,NORM),                                    X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
        DFHMDF POS=(07,17),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AMOD01  DFHMDF POS=(07,20),                                            X00231   
               LENGTH=03,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMDSC01 DFHMDF POS=(07,26),                                            X00231   
               LENGTH=07,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ASTZZ01 DFHMDF POS=(07,36),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AZDSC01 DFHMDF POS=(07,45),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMTYP01 DFHMDF POS=(07,67),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ADVCD01 DFHMDF POS=(07,74),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL02  DFHMDF POS=(08,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(08,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT02  DFHMDF POS=(08,05),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON02 DFHMDF POS=(08,11),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(UNPROT,NORM),                                    X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
        DFHMDF POS=(08,17),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AMOD02  DFHMDF POS=(08,20),                                            X00231   
               LENGTH=03,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMDSC02 DFHMDF POS=(08,26),                                            X00231   
               LENGTH=07,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ASTZZ02 DFHMDF POS=(08,36),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AZDSC02 DFHMDF POS=(08,45),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMTYP02 DFHMDF POS=(08,67),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ADVCD02 DFHMDF POS=(08,74),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL03  DFHMDF POS=(09,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(09,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT03  DFHMDF POS=(09,05),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON03 DFHMDF POS=(09,11),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(UNPROT,NORM),                                    X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
        DFHMDF POS=(09,17),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AMOD03  DFHMDF POS=(09,20),                                            X00231   
               LENGTH=03,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMDSC03 DFHMDF POS=(09,26),                                            X00231   
               LENGTH=07,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ASTZZ03 DFHMDF POS=(09,36),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AZDSC03 DFHMDF POS=(09,45),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMTYP03 DFHMDF POS=(09,67),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ADVCD03 DFHMDF POS=(09,74),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL04  DFHMDF POS=(10,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(10,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT04  DFHMDF POS=(10,05),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON04 DFHMDF POS=(10,11),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(UNPROT,NORM),                                    X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
        DFHMDF POS=(10,17),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AMOD04  DFHMDF POS=(10,20),                                            X00231   
               LENGTH=03,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMDSC04 DFHMDF POS=(10,26),                                            X00231   
               LENGTH=07,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ASTZZ04 DFHMDF POS=(10,36),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AZDSC04 DFHMDF POS=(10,45),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMTYP04 DFHMDF POS=(10,67),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ADVCD04 DFHMDF POS=(10,74),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL05  DFHMDF POS=(11,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(11,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT05  DFHMDF POS=(11,05),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON05 DFHMDF POS=(11,11),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(UNPROT,NORM),                                    X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
        DFHMDF POS=(11,17),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AMOD05  DFHMDF POS=(11,20),                                            X00231   
               LENGTH=03,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMDSC05 DFHMDF POS=(11,26),                                            X00231   
               LENGTH=07,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ASTZZ05 DFHMDF POS=(11,36),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AZDSC05 DFHMDF POS=(11,45),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMTYP05 DFHMDF POS=(11,67),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ADVCD05 DFHMDF POS=(11,74),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL06  DFHMDF POS=(12,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(12,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT06  DFHMDF POS=(12,05),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON06 DFHMDF POS=(12,11),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(UNPROT,NORM),                                    X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
        DFHMDF POS=(12,17),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AMOD06  DFHMDF POS=(12,20),                                            X00231   
               LENGTH=03,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMDSC06 DFHMDF POS=(12,26),                                            X00231   
               LENGTH=07,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ASTZZ06 DFHMDF POS=(12,36),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AZDSC06 DFHMDF POS=(12,45),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMTYP06 DFHMDF POS=(12,67),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ADVCD06 DFHMDF POS=(12,74),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL07  DFHMDF POS=(13,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(13,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT07  DFHMDF POS=(13,05),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON07 DFHMDF POS=(13,11),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(UNPROT,NORM),                                    X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
        DFHMDF POS=(13,17),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AMOD07  DFHMDF POS=(13,20),                                            X00231   
               LENGTH=03,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMDSC07 DFHMDF POS=(13,26),                                            X00231   
               LENGTH=07,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ASTZZ07 DFHMDF POS=(13,36),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AZDSC07 DFHMDF POS=(13,45),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMTYP07 DFHMDF POS=(13,67),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ADVCD07 DFHMDF POS=(13,74),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL08  DFHMDF POS=(14,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(14,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT08  DFHMDF POS=(14,05),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON08 DFHMDF POS=(14,11),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(UNPROT,NORM),                                    X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
        DFHMDF POS=(14,17),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AMOD08  DFHMDF POS=(14,20),                                            X00231   
               LENGTH=03,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMDSC08 DFHMDF POS=(14,26),                                            X00231   
               LENGTH=07,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ASTZZ08 DFHMDF POS=(14,36),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AZDSC08 DFHMDF POS=(14,45),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMTYP08 DFHMDF POS=(14,67),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ADVCD08 DFHMDF POS=(14,74),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL09  DFHMDF POS=(15,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(15,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT09  DFHMDF POS=(15,05),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON09 DFHMDF POS=(15,11),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(UNPROT,NORM),                                    X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
        DFHMDF POS=(15,17),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AMOD09  DFHMDF POS=(15,20),                                            X00231   
               LENGTH=03,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMDSC09 DFHMDF POS=(15,26),                                            X00231   
               LENGTH=07,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ASTZZ09 DFHMDF POS=(15,36),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AZDSC09 DFHMDF POS=(15,45),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMTYP09 DFHMDF POS=(15,67),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ADVCD09 DFHMDF POS=(15,74),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL10  DFHMDF POS=(16,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(16,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT10  DFHMDF POS=(16,05),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON10 DFHMDF POS=(16,11),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(UNPROT,NORM),                                    X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
        DFHMDF POS=(16,17),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AMOD10  DFHMDF POS=(16,20),                                            X00231   
               LENGTH=03,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMDSC10 DFHMDF POS=(16,26),                                            X00231   
               LENGTH=07,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ASTZZ10 DFHMDF POS=(16,36),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AZDSC10 DFHMDF POS=(16,45),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMTYP10 DFHMDF POS=(16,67),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ADVCD10 DFHMDF POS=(16,74),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL11  DFHMDF POS=(17,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(17,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT11  DFHMDF POS=(17,05),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON11 DFHMDF POS=(17,11),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(UNPROT,NORM),                                    X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
        DFHMDF POS=(17,17),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AMOD11  DFHMDF POS=(17,20),                                            X00231   
               LENGTH=03,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMDSC11 DFHMDF POS=(17,26),                                            X00231   
               LENGTH=07,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ASTZZ11 DFHMDF POS=(17,36),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AZDSC11 DFHMDF POS=(17,45),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMTYP11 DFHMDF POS=(17,67),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ADVCD11 DFHMDF POS=(17,74),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00217   
ASEL12  DFHMDF POS=(18,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(18,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT12  DFHMDF POS=(18,05),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
AUZON12 DFHMDF POS=(18,11),                                            X00226   
               LENGTH=05,                                              X00227   
               ATTRB=(UNPROT,NORM),                                    X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
        DFHMDF POS=(18,17),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AMOD12  DFHMDF POS=(18,20),                                            X00231   
               LENGTH=03,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMDSC12 DFHMDF POS=(18,26),                                            X00231   
               LENGTH=07,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ASTZZ12 DFHMDF POS=(18,36),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AZDSC12 DFHMDF POS=(18,45),                                            X00231   
               LENGTH=20,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AMTYP12 DFHMDF POS=(18,67),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
ADVCD12 DFHMDF POS=(18,74),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00284   
*                                                                       00897   
*                                                                       00898   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00899   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00900   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00901   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00902   
**************                                                          00903   
        DFHMSD TYPE=FINAL                                               00904   
**************                                                          00905   
        END                                                             00906   
