        PRINT NOGEN                                                     00001   
CNKM230  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=(FREEKB,FRSET)                                      00006   
*                                                                       00007   
CNK230A  DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
         DFHMDF POS=(01,01),                                           X00012**5
               LENGTH=003,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='DC:'                                            00015*29
*                                                                       00011   
ADC      DFHMDF POS=(01,10),                                           X00012**5
               LENGTH=004,                                             X00013*29
               ATTRB=(UNPROT,NORM)                                      00053   
*                                                                       00016   
         DFHMDF POS=(02,01),                                           X00012**5
               LENGTH=005,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='DOOR:'                                          00015*29
*                                                                       00011   
ADOOR    DFHMDF POS=(02,10),                                           X00012**5
               LENGTH=004,                                             X00013*29
               ATTRB=(UNPROT,NORM)                                      00053   
*                                                                       00016   
         DFHMDF POS=(03,01),                                           X00012**5
               LENGTH=007,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='CARTON:'                                        00015*29
*                                                                       00011   
ACTN     DFHMDF POS=(04,01),                                           X00012**5
               LENGTH=020,                                             X00013*29
               ATTRB=(UNPROT,NORM)                                      00053   
*                                                                       00016   
AMSGLN   DFHMDF POS=(08,01),                                           X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
