*          DATA SET CNKM202    AT LEVEL 001 AS OF 10/25/93                      
*          DATA SET CNKM202    AT LEVEL 001 AS OF 05/18/93              00001   
  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  CNKM202                                            *   00005   
*        MAP     CN202A                                             *   00006   
*        PROGRAM CNKCS202                                           *   00007   
*        TRANSID Y202                                               *   00008   
*        SYSTEM  CICS ARCH - FACILITY AREA LIST                     *   00009**5
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
CNKM202 DFHMSD TYPE=DSECT,                                             X00012   
               LANG=COBOL,                                             X00013   
               MODE=INOUT,                                             X00014   
               STORAGE=AUTO,                                           X00015   
               TIOAPFX=YES,                                            X00016   
               TERM=3270-2                                              00017   
CN202A  DFHMDI LINE=2,COLUMN=1,                                        X00018   
               SIZE=(19,80),                                           X00019   
               CTRL=(FREEKB),                                          X00020   
               MAPATTS=(COLOR,HILIGHT),                                X00021   
               DSATTS=(COLOR,HILIGHT)                                   00022   
*                                                                       00023   
        DFHMDF POS=(03,44),                                            X00024   
               LENGTH=05,                                              X00025   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL,                                          X00027   
               INITIAL='ITEMS'                                          00028   
ASTRTIT DFHMDF POS=(03,50),                                            X00029   
               LENGTH=07,                                              X00030   
               ATTRB=(NUM,UNPROT,NORM),                                X00031   
               COLOR=GREEN,                                            X00032   
               HILIGHT=UNDERLINE,                                      X00033   
               PICOUT='ZZZ,ZZ9'                                         00034   
        DFHMDF POS=(03,58),                                            X00035   
               LENGTH=02,                                              X00036   
               ATTRB=(ASKIP,NORM),                                     X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='TO'                                             00039   
AENDIT  DFHMDF POS=(03,61),                                            X00040   
               LENGTH=07,                                              X00041   
               ATTRB=(ASKIP,NORM,FSET),                                X00042   
               COLOR=BLUE,                                             X00043   
               PICOUT='ZZZ,ZZ9'                                         00044   
        DFHMDF POS=(03,69),                                            X00045   
               LENGTH=02,                                              X00046   
               ATTRB=(ASKIP,NORM),                                     X00047   
               COLOR=NEUTRAL,                                          X00048   
               INITIAL='OF'                                             00049   
ATOTIT  DFHMDF POS=(03,72),                                            X00050   
               LENGTH=07,                                              X00051   
               ATTRB=(ASKIP,NORM),                                     X00052   
               COLOR=BLUE,                                             X00053   
               PICOUT='ZZZ,ZZ9'                                         00054   
*                                                                       00055   
        DFHMDF POS=(05,01),                                            X00056**2
               LENGTH=10,                                              X00057**2
               ATTRB=(ASKIP,BRT),                                      X00058   
               INITIAL='OPER UNIT:'                                     00059**2
AOPER   DFHMDF POS=(05,12),                                            X00060**3
               LENGTH=4,                                               X00061**2
               ATTRB=(ASKIP,NORM),                                     X00062   
               COLOR=BLUE                                               00063   
        DFHMDF POS=(05,19),                                            X00064**3
               LENGTH=06,                                              X00065**2
               ATTRB=(ASKIP,BRT),                                      X00066**2
               INITIAL='FCLTY:'                                         00067**2
AFCLTY  DFHMDF POS=(05,27),                                            X00068**3
               LENGTH=4,                                               X00069**2
               PICOUT='ZZZZ',                                          X00070**4
               ATTRB=(ASKIP,NORM),                                     X00071**2
               COLOR=BLUE                                               00072**2
AFDESC  DFHMDF POS=(05,33),                                            X00073**3
               LENGTH=25,                                              X00074   
               ATTRB=(ASKIP,NORM),                                     X00075   
               COLOR=BLUE                                               00076   
*                                                                       00077   
        DFHMDF POS=(07,01),                                            X00078   
               LENGTH=27,                                              X00079**7
               ATTRB=(ASKIP,BRT),                                      X00080   
               INITIAL='SEL ACT  FCLTY   AREA  TYPE',                   00081**7
        DFHMDF POS=(07,30),                                            X00082**7
               LENGTH=11,                                              X00083**7
               ATTRB=(ASKIP,BRT),                                      X00084   
               INITIAL='DESCRIPTION'                                    00085**7
        DFHMDF POS=(07,60),                                            X00086**7
               LENGTH=10,                                              X00087   
               ATTRB=(ASKIP,BRT),                                      X00088   
               INITIAL='SUBAREA OF'                                     00089   
        DFHMDF POS=(07,72),                                            X00090**7
               LENGTH=08,                                              X00091   
               ATTRB=(ASKIP,BRT),                                      X00092   
               INITIAL='DEPT IND'                                       00093   
ASEL1   DFHMDF POS=(08,02),                                            X00094   
               LENGTH=01,                                              X00095   
               ATTRB=(UNPROT,NORM,IC),                                 X00096   
               COLOR=GREEN,                                            X00097   
               HILIGHT=UNDERLINE                                        00098   
AACT1   DFHMDF POS=(08,04),                                            X00099   
               LENGTH=03,                                              X00100   
               ATTRB=(ASKIP,NORM),                                     X00101   
               COLOR=BLUE                                               00102   
AFAC1   DFHMDF POS=(08,10),                                            X00103**7
               LENGTH=04,                                              X00104**7
               ATTRB=(ASKIP,NORM),                                     X00105   
               COLOR=BLUE                                               00106   
ALOC1   DFHMDF POS=(08,17),                                            X00107**7
               LENGTH=06,                                              X00108**7
               ATTRB=(ASKIP,NORM),                                     X00109**7
               COLOR=BLUE                                               00110**7
ATYPE1  DFHMDF POS=(08,25),                                            X00111**7
               LENGTH=02,                                              X00112   
               ATTRB=(ASKIP,NORM),                                     X00113   
               COLOR=BLUE                                               00114   
ADESC1  DFHMDF POS=(08,30),                                            X00115**7
               LENGTH=27,                                              X00116**7
               ATTRB=(ASKIP,NORM),                                     X00117   
               COLOR=BLUE                                               00118   
ASUB1   DFHMDF POS=(08,62),                                            X00119**7
               LENGTH=06,                                              X00120   
               ATTRB=(ASKIP,NORM),                                     X00121   
               COLOR=BLUE                                               00122   
AIND1   DFHMDF POS=(08,75),                                            X00123**7
               LENGTH=01,                                              X00124   
               ATTRB=(ASKIP,NORM),                                     X00125   
               COLOR=BLUE                                               00126   
*                                                                       00127   
ASEL2   DFHMDF POS=(09,02),                                            X00128   
               LENGTH=01,                                              X00129   
               ATTRB=(UNPROT,NORM),                                    X00130   
               COLOR=GREEN,                                            X00131   
               HILIGHT=UNDERLINE                                        00132   
AACT2   DFHMDF POS=(09,04),                                            X00133   
               LENGTH=03,                                              X00134   
               ATTRB=(ASKIP,NORM),                                     X00135   
               COLOR=BLUE                                               00136   
AFAC2   DFHMDF POS=(09,10),                                            X00137**7
               LENGTH=04,                                              X00138**7
               ATTRB=(ASKIP,NORM),                                     X00139**7
               COLOR=BLUE                                               00140**7
ALOC2   DFHMDF POS=(09,17),                                            X00141**7
               LENGTH=06,                                              X00142   
               ATTRB=(ASKIP,NORM),                                     X00143   
               COLOR=BLUE                                               00144   
ATYPE2  DFHMDF POS=(09,25),                                            X00145**7
               LENGTH=02,                                              X00146   
               ATTRB=(ASKIP,NORM),                                     X00147   
               COLOR=BLUE                                               00148   
ADESC2  DFHMDF POS=(09,30),                                            X00149**7
               LENGTH=27,                                              X00150**7
               ATTRB=(ASKIP,NORM),                                     X00151   
               COLOR=BLUE                                               00152   
ASUB2   DFHMDF POS=(09,62),                                            X00153**7
               LENGTH=06,                                              X00154   
               ATTRB=(ASKIP,NORM),                                     X00155   
               COLOR=BLUE                                               00156   
AIND2   DFHMDF POS=(09,75),                                            X00157**7
               LENGTH=01,                                              X00158   
               ATTRB=(ASKIP,NORM),                                     X00159   
               COLOR=BLUE                                               00160   
*                                                                       00161   
ASEL3   DFHMDF POS=(10,02),                                            X00162   
               LENGTH=01,                                              X00163   
               ATTRB=(UNPROT,NORM),                                    X00164   
               COLOR=GREEN,                                            X00165   
               HILIGHT=UNDERLINE                                        00166   
AACT3   DFHMDF POS=(10,04),                                            X00167   
               LENGTH=03,                                              X00168   
               ATTRB=(ASKIP,NORM),                                     X00169   
               COLOR=BLUE                                               00170   
AFAC3   DFHMDF POS=(10,10),                                            X00171**7
               LENGTH=04,                                              X00172**7
               ATTRB=(ASKIP,NORM),                                     X00173**7
               COLOR=BLUE                                               00174**7
ALOC3   DFHMDF POS=(10,17),                                            X00175**7
               LENGTH=06,                                              X00176   
               ATTRB=(ASKIP,NORM),                                     X00177   
               COLOR=BLUE                                               00178   
ATYPE3  DFHMDF POS=(10,25),                                            X00179**7
               LENGTH=02,                                              X00180   
               ATTRB=(ASKIP,NORM),                                     X00181   
               COLOR=BLUE                                               00182   
ADESC3  DFHMDF POS=(10,30),                                            X00183**7
               LENGTH=27,                                              X00184**7
               ATTRB=(ASKIP,NORM),                                     X00185   
               COLOR=BLUE                                               00186   
ASUB3   DFHMDF POS=(10,62),                                            X00187**7
               LENGTH=06,                                              X00188   
               ATTRB=(ASKIP,NORM),                                     X00189   
               COLOR=BLUE                                               00190   
AIND3   DFHMDF POS=(10,75),                                            X00191**7
               LENGTH=01,                                              X00192   
               ATTRB=(ASKIP,NORM),                                     X00193   
               COLOR=BLUE                                               00194   
*                                                                       00195   
ASEL4   DFHMDF POS=(11,02),                                            X00196   
               LENGTH=01,                                              X00197   
               ATTRB=(UNPROT,NORM),                                    X00198   
               COLOR=GREEN,                                            X00199   
               HILIGHT=UNDERLINE                                        00200   
AACT4   DFHMDF POS=(11,04),                                            X00201   
               LENGTH=03,                                              X00202   
               ATTRB=(ASKIP,NORM),                                     X00203   
               COLOR=BLUE                                               00204   
AFAC4   DFHMDF POS=(11,10),                                            X00205**7
               LENGTH=04,                                              X00206**7
               ATTRB=(ASKIP,NORM),                                     X00207**7
               COLOR=BLUE                                               00208**7
ALOC4   DFHMDF POS=(11,17),                                            X00209**7
               LENGTH=06,                                              X00210   
               ATTRB=(ASKIP,NORM),                                     X00211   
               COLOR=BLUE                                               00212   
ATYPE4  DFHMDF POS=(11,25),                                            X00213**7
               LENGTH=02,                                              X00214   
               ATTRB=(ASKIP,NORM),                                     X00215   
               COLOR=BLUE                                               00216   
ADESC4  DFHMDF POS=(11,30),                                            X00217**7
               LENGTH=27,                                              X00218**7
               ATTRB=(ASKIP,NORM),                                     X00219   
               COLOR=BLUE                                               00220   
ASUB4   DFHMDF POS=(11,62),                                            X00221**7
               LENGTH=06,                                              X00222   
               ATTRB=(ASKIP,NORM),                                     X00223   
               COLOR=BLUE                                               00224   
AIND4   DFHMDF POS=(11,75),                                            X00225**7
               LENGTH=01,                                              X00226   
               ATTRB=(ASKIP,NORM),                                     X00227   
               COLOR=BLUE                                               00228   
*                                                                       00229   
ASEL5   DFHMDF POS=(12,02),                                            X00230   
               LENGTH=01,                                              X00231   
               ATTRB=(UNPROT,NORM),                                    X00232   
               COLOR=GREEN,                                            X00233   
               HILIGHT=UNDERLINE                                        00234   
AACT5   DFHMDF POS=(12,04),                                            X00235   
               LENGTH=03,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
AFAC5   DFHMDF POS=(12,10),                                            X00239**7
               LENGTH=04,                                              X00240**7
               ATTRB=(ASKIP,NORM),                                     X00241**7
               COLOR=BLUE                                               00242**7
ALOC5   DFHMDF POS=(12,17),                                            X00243**7
               LENGTH=06,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ATYPE5  DFHMDF POS=(12,25),                                            X00247**7
               LENGTH=02,                                              X00248   
               ATTRB=(ASKIP,NORM),                                     X00249   
               COLOR=BLUE                                               00250   
ADESC5  DFHMDF POS=(12,30),                                            X00251**7
               LENGTH=27,                                              X00252**7
               ATTRB=(ASKIP,NORM),                                     X00253   
               COLOR=BLUE                                               00254   
ASUB5   DFHMDF POS=(12,62),                                            X00255**7
               LENGTH=06,                                              X00256   
               ATTRB=(ASKIP,NORM),                                     X00257   
               COLOR=BLUE                                               00258   
AIND5   DFHMDF POS=(12,75),                                            X00259**7
               LENGTH=01,                                              X00260   
               ATTRB=(ASKIP,NORM),                                     X00261   
               COLOR=BLUE                                               00262   
*                                                                       00263   
ASEL6   DFHMDF POS=(13,02),                                            X00264   
               LENGTH=01,                                              X00265   
               ATTRB=(UNPROT,NORM),                                    X00266   
               COLOR=GREEN,                                            X00267   
               HILIGHT=UNDERLINE                                        00268   
AACT6   DFHMDF POS=(13,04),                                            X00269   
               LENGTH=03,                                              X00270   
               ATTRB=(ASKIP,NORM),                                     X00271   
               COLOR=BLUE                                               00272   
AFAC6   DFHMDF POS=(13,10),                                            X00273**7
               LENGTH=04,                                              X00274**7
               ATTRB=(ASKIP,NORM),                                     X00275**7
               COLOR=BLUE                                               00276**7
ALOC6   DFHMDF POS=(13,17),                                            X00277**7
               LENGTH=06,                                              X00278   
               ATTRB=(ASKIP,NORM),                                     X00279   
               COLOR=BLUE                                               00280   
ATYPE6  DFHMDF POS=(13,25),                                            X00281**7
               LENGTH=02,                                              X00282   
               ATTRB=(ASKIP,NORM),                                     X00283   
               COLOR=BLUE                                               00284   
ADESC6  DFHMDF POS=(13,30),                                            X00285**7
               LENGTH=27,                                              X00286**7
               ATTRB=(ASKIP,NORM),                                     X00287   
               COLOR=BLUE                                               00288   
ASUB6   DFHMDF POS=(13,62),                                            X00289**7
               LENGTH=06,                                              X00290   
               ATTRB=(ASKIP,NORM),                                     X00291   
               COLOR=BLUE                                               00292   
AIND6   DFHMDF POS=(13,75),                                            X00293**7
               LENGTH=01,                                              X00294   
               ATTRB=(ASKIP,NORM),                                     X00295   
               COLOR=BLUE                                               00296   
*                                                                       00297   
ASEL7   DFHMDF POS=(14,02),                                            X00298   
               LENGTH=01,                                              X00299   
               ATTRB=(UNPROT,NORM),                                    X00300   
               COLOR=GREEN,                                            X00301   
               HILIGHT=UNDERLINE                                        00302   
AACT7   DFHMDF POS=(14,04),                                            X00303   
               LENGTH=03,                                              X00304   
               ATTRB=(ASKIP,NORM),                                     X00305   
               COLOR=BLUE                                               00306   
AFAC7   DFHMDF POS=(14,10),                                            X00307**7
               LENGTH=04,                                              X00308**7
               ATTRB=(ASKIP,NORM),                                     X00309**7
               COLOR=BLUE                                               00310**7
ALOC7   DFHMDF POS=(14,17),                                            X00311**7
               LENGTH=06,                                              X00312   
               ATTRB=(ASKIP,NORM),                                     X00313   
               COLOR=BLUE                                               00314   
ATYPE7  DFHMDF POS=(14,25),                                            X00315**7
               LENGTH=02,                                              X00316   
               ATTRB=(ASKIP,NORM),                                     X00317   
               COLOR=BLUE                                               00318   
ADESC7  DFHMDF POS=(14,30),                                            X00319**7
               LENGTH=27,                                              X00320**7
               ATTRB=(ASKIP,NORM),                                     X00321   
               COLOR=BLUE                                               00322   
ASUB7   DFHMDF POS=(14,62),                                            X00323**7
               LENGTH=06,                                              X00324   
               ATTRB=(ASKIP,NORM),                                     X00325   
               COLOR=BLUE                                               00326   
AIND7   DFHMDF POS=(14,75),                                            X00327**7
               LENGTH=01,                                              X00328   
               ATTRB=(ASKIP,NORM),                                     X00329   
               COLOR=BLUE                                               00330   
*                                                                       00331   
ASEL8   DFHMDF POS=(15,02),                                            X00332   
               LENGTH=01,                                              X00333   
               ATTRB=(UNPROT,NORM),                                    X00334   
               COLOR=GREEN,                                            X00335   
               HILIGHT=UNDERLINE                                        00336   
AACT8   DFHMDF POS=(15,04),                                            X00337   
               LENGTH=03,                                              X00338   
               ATTRB=(ASKIP,NORM),                                     X00339   
               COLOR=BLUE                                               00340   
AFAC8   DFHMDF POS=(15,10),                                            X00341**7
               LENGTH=04,                                              X00342**7
               ATTRB=(ASKIP,NORM),                                     X00343**7
               COLOR=BLUE                                               00344**7
ALOC8   DFHMDF POS=(15,17),                                            X00345**7
               LENGTH=06,                                              X00346   
               ATTRB=(ASKIP,NORM),                                     X00347   
               COLOR=BLUE                                               00348   
ATYPE8  DFHMDF POS=(15,25),                                            X00349**7
               LENGTH=02,                                              X00350   
               ATTRB=(ASKIP,NORM),                                     X00351   
               COLOR=BLUE                                               00352   
ADESC8  DFHMDF POS=(15,30),                                            X00353**7
               LENGTH=27,                                              X00354**7
               ATTRB=(ASKIP,NORM),                                     X00355   
               COLOR=BLUE                                               00356   
ASUB8   DFHMDF POS=(15,62),                                            X00357**7
               LENGTH=06,                                              X00358   
               ATTRB=(ASKIP,NORM),                                     X00359   
               COLOR=BLUE                                               00360   
AIND8   DFHMDF POS=(15,75),                                            X00361**7
               LENGTH=01,                                              X00362   
               ATTRB=(ASKIP,NORM),                                     X00363   
               COLOR=BLUE                                               00364   
*                                                                       00365   
ASEL9   DFHMDF POS=(16,02),                                            X00366   
               LENGTH=01,                                              X00367   
               ATTRB=(UNPROT,NORM),                                    X00368   
               COLOR=GREEN,                                            X00369   
               HILIGHT=UNDERLINE                                        00370   
AACT9   DFHMDF POS=(16,04),                                            X00371   
               LENGTH=03,                                              X00372   
               ATTRB=(ASKIP,NORM),                                     X00373   
               COLOR=BLUE                                               00374   
AFAC9   DFHMDF POS=(16,10),                                            X00375**7
               LENGTH=04,                                              X00376**7
               ATTRB=(ASKIP,NORM),                                     X00377**7
               COLOR=BLUE                                               00378**7
ALOC9   DFHMDF POS=(16,17),                                            X00379**7
               LENGTH=06,                                              X00380   
               ATTRB=(ASKIP,NORM),                                     X00381   
               COLOR=BLUE                                               00382   
ATYPE9  DFHMDF POS=(16,25),                                            X00383**7
               LENGTH=02,                                              X00384   
               ATTRB=(ASKIP,NORM),                                     X00385   
               COLOR=BLUE                                               00386   
ADESC9  DFHMDF POS=(16,30),                                            X00387**7
               LENGTH=27,                                              X00388**8
               ATTRB=(ASKIP,NORM),                                     X00389   
               COLOR=BLUE                                               00390   
ASUB9   DFHMDF POS=(16,62),                                            X00391**7
               LENGTH=06,                                              X00392   
               ATTRB=(ASKIP,NORM),                                     X00393   
               COLOR=BLUE                                               00394   
AIND9   DFHMDF POS=(16,75),                                            X00395**7
               LENGTH=01,                                              X00396   
               ATTRB=(ASKIP,NORM),                                     X00397   
               COLOR=BLUE                                               00398   
*                                                                       00399   
ASEL10  DFHMDF POS=(17,02),                                            X00400   
               LENGTH=01,                                              X00401   
               ATTRB=(UNPROT,NORM),                                    X00402   
               COLOR=GREEN,                                            X00403   
               HILIGHT=UNDERLINE                                        00404   
AACT10  DFHMDF POS=(17,04),                                            X00405   
               LENGTH=03,                                              X00406   
               ATTRB=(ASKIP,NORM),                                     X00407   
               COLOR=BLUE                                               00408   
AFAC10  DFHMDF POS=(17,10),                                            X00409**7
               LENGTH=04,                                              X00410**7
               ATTRB=(ASKIP,NORM),                                     X00411**7
               COLOR=BLUE                                               00412**7
ALOC10  DFHMDF POS=(17,17),                                            X00413**7
               LENGTH=06,                                              X00414   
               ATTRB=(ASKIP,NORM),                                     X00415   
               COLOR=BLUE                                               00416   
ATYPE10 DFHMDF POS=(17,25),                                            X00417**7
               LENGTH=02,                                              X00418   
               ATTRB=(ASKIP,NORM),                                     X00419   
               COLOR=BLUE                                               00420   
ADESC10 DFHMDF POS=(17,30),                                            X00421**7
               LENGTH=27,                                              X00422**7
               ATTRB=(ASKIP,NORM),                                     X00423   
               COLOR=BLUE                                               00424   
ASUB10  DFHMDF POS=(17,62),                                            X00425**7
               LENGTH=06,                                              X00426   
               ATTRB=(ASKIP,NORM),                                     X00427   
               COLOR=BLUE                                               00428   
AIND10  DFHMDF POS=(17,75),                                            X00429**7
               LENGTH=01,                                              X00430   
               ATTRB=(ASKIP,NORM),                                     X00431   
               COLOR=BLUE                                               00432   
*                                                                       00433   
ASEL11  DFHMDF POS=(18,02),                                            X00434   
               LENGTH=01,                                              X00435   
               ATTRB=(UNPROT,NORM),                                    X00436   
               COLOR=GREEN,                                            X00437   
               HILIGHT=UNDERLINE                                        00438   
AACT11  DFHMDF POS=(18,04),                                            X00439   
               LENGTH=03,                                              X00440   
               ATTRB=(ASKIP,NORM),                                     X00441   
               COLOR=BLUE                                               00442   
AFAC11  DFHMDF POS=(18,10),                                            X00443**7
               LENGTH=04,                                              X00444**7
               ATTRB=(ASKIP,NORM),                                     X00445**7
               COLOR=BLUE                                               00446**7
ALOC11  DFHMDF POS=(18,17),                                            X00447**7
               LENGTH=06,                                              X00448   
               ATTRB=(ASKIP,NORM),                                     X00449   
               COLOR=BLUE                                               00450   
ATYPE11 DFHMDF POS=(18,25),                                            X00451**7
               LENGTH=02,                                              X00452   
               ATTRB=(ASKIP,NORM),                                     X00453   
               COLOR=BLUE                                               00454   
ADESC11 DFHMDF POS=(18,30),                                            X00455**7
               LENGTH=27,                                              X00456**7
               ATTRB=(ASKIP,NORM),                                     X00457   
               COLOR=BLUE                                               00458   
ASUB11  DFHMDF POS=(18,62),                                            X00459**7
               LENGTH=06,                                              X00460   
               ATTRB=(ASKIP,NORM),                                     X00461   
               COLOR=BLUE                                               00462   
AIND11  DFHMDF POS=(18,75),                                            X00463**7
               LENGTH=01,                                              X00464   
               ATTRB=(ASKIP,NORM),                                     X00465   
               COLOR=BLUE                                               00466   
*                                                                       00467   
        DFHMDF POS=(19,40),                                            X00468   
               LENGTH=25,                                              X00469   
               ATTRB=(ASKIP,NORM),                                     X00470   
               COLOR=NEUTRAL,                                          X00471   
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00472   
ASELIT  DFHMDF POS=(19,67),                                            X00473   
               LENGTH=07,                                              X00474   
               ATTRB=(ASKIP,NORM),                                     X00475   
               COLOR=BLUE,                                             X00476   
               PICOUT='ZZZ,ZZ9'                                         00477   
*                                                                       00478   
         DFHMSD TYPE=FINAL                                              00479   
         END                                                            00480   
