*          DATA SET CNKM203    AT LEVEL 001 AS OF 10/25/93                      
*          DATA SET CNKM203    AT LEVEL 001 AS OF 04/30/93              00001   
*          DATA SET CNKM203A1  AT LEVEL 006 AS OF 04/27/93              00002   
  PRINT  NOGEN                                                          00003   
*-------------------------------------------------------------------*   00004   
*                                                                   *   00005   
*        MAPSET  CNKM203                                            *   00006   
*        MAP     CN203A                                             *   00007   
*        PROGRAM CNKCS203                                           *   00008   
*        TRANSID Y203                                               *   00009   
*        SYSTEM  CICS ARCH - TICKET FORMAT LIST                     *   00010   
*                                                                   *   00011   
*-------------------------------------------------------------------*   00012   
CNKM203 DFHMSD TYPE=DSECT,                                             X00013   
               LANG=COBOL,                                             X00014   
               MODE=INOUT,                                             X00015   
               STORAGE=AUTO,                                           X00016   
               TIOAPFX=YES,                                            X00017   
               TERM=3270-2                                              00018   
CN203A  DFHMDI LINE=2,COLUMN=1,                                        X00019   
               SIZE=(19,80),                                           X00020   
               CTRL=(FREEKB),                                          X00021   
               MAPATTS=(COLOR,HILIGHT),                                X00022   
               DSATTS=(COLOR,HILIGHT)                                   00023   
*                                                                       00024   
        DFHMDF POS=(03,44),                                            X00025   
               LENGTH=05,                                              X00026   
               ATTRB=(ASKIP,NORM),                                     X00027   
               COLOR=NEUTRAL,                                          X00028   
               INITIAL='ITEMS'                                          00029   
ASTRTIT DFHMDF POS=(03,50),                                            X00030   
               LENGTH=07,                                              X00031   
               ATTRB=(NUM,UNPROT,NORM),                                X00032   
               COLOR=GREEN,                                            X00033   
               HILIGHT=UNDERLINE,                                      X00034   
               PICOUT='ZZZ,ZZ9'                                         00035   
        DFHMDF POS=(03,58),                                            X00036   
               LENGTH=02,                                              X00037   
               ATTRB=(ASKIP,NORM),                                     X00038   
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='TO'                                             00040   
AENDIT  DFHMDF POS=(03,61),                                            X00041   
               LENGTH=07,                                              X00042   
               ATTRB=(ASKIP,NORM),                                     X00043   
               COLOR=BLUE,                                             X00044   
               PICOUT='ZZZ,ZZ9'                                         00045   
        DFHMDF POS=(03,69),                                            X00046   
               LENGTH=02,                                              X00047   
               ATTRB=(ASKIP,NORM),                                     X00048   
               COLOR=NEUTRAL,                                          X00049   
               INITIAL='OF'                                             00050   
ATOTIT  DFHMDF POS=(03,72),                                            X00051   
               LENGTH=07,                                              X00052   
               ATTRB=(ASKIP,NORM),                                     X00053   
               COLOR=BLUE,                                             X00054   
               PICOUT='ZZZ,ZZ9'                                         00055   
*                                                                       00056   
        DFHMDF POS=(05,01),                                            X00057**2
               LENGTH=10,                                              X00058**2
               ATTRB=(ASKIP,BRT),                                      X00059**2
               INITIAL='OPER UNIT:'                                     00060**2
AOPER   DFHMDF POS=(05,12),                                            X00061**2
               LENGTH=4,                                               X00062**2
               ATTRB=(ASKIP,NORM),                                     X00063**2
               COLOR=BLUE                                               00064**2
        DFHMDF POS=(05,19),                                            X00065**2
               LENGTH=06,                                              X00066**2
               ATTRB=(ASKIP,BRT),                                      X00067**2
               INITIAL='FCLTY:'                                         00068**2
AFCLTY  DFHMDF POS=(05,27),                                            X00069**2
               LENGTH=4,                                               X00070**2
               PICOUT='ZZZZ',                                          X00071**3
               ATTRB=(ASKIP,NORM),                                     X00072**2
               COLOR=BLUE                                               00073**2
AFDESC  DFHMDF POS=(05,33),                                            X00074**2
               LENGTH=25,                                              X00075**2
               ATTRB=(ASKIP,NORM),                                     X00076**2
               COLOR=BLUE                                               00077**2
*                                                                       00078   
        DFHMDF POS=(07,18),                                            X00079**4
               LENGTH=06,                                              X00080   
               ATTRB=(ASKIP,BRT),                                      X00081   
               COLOR=NEUTRAL,                                          X00082   
               INITIAL='TICKET'                                         00083   
        DFHMDF POS=(07,34),                                            X00084**4
               LENGTH=05,                                              X00085   
               ATTRB=(ASKIP,BRT),                                      X00086   
               COLOR=NEUTRAL,                                          X00087   
               INITIAL='PAPER'                                          00088   
        DFHMDF POS=(07,43),                                            X00089**4
               LENGTH=11,                                              X00090   
               ATTRB=(ASKIP,BRT),                                      X00091   
               COLOR=NEUTRAL,                                          X00092   
               INITIAL='XTRA TICKET'                                    00093   
        DFHMDF POS=(07,64),                                            X00094**5
               LENGTH=16,                                              X00095   
               ATTRB=(ASKIP,BRT),                                      X00096   
               COLOR=NEUTRAL,                                          X00097   
               INITIAL='INCLUDE PRINT OF'                               00098   
*                                                                       00099   
        DFHMDF POS=(08,01),                                            X00100   
               LENGTH=26,                                              X00101**4
               ATTRB=(ASKIP,BRT),                                      X00102   
               COLOR=NEUTRAL,                                          X00103   
               INITIAL='SEL ACT  FCLTY FORMAT DESC'                     00104**4
        DFHMDF POS=(08,30),                                            X00105**4
               LENGTH=26,                                              X00106**7
               ATTRB=(ASKIP,BRT),                                      X00107   
               COLOR=NEUTRAL,                                          X00108   
               INITIAL='TYP TYPE   APPL NR TYP  NR'                     00109**4
        DFHMDF POS=(08,59),                                            X00110**4
               LENGTH=21,                                              X00111**5
               ATTRB=(ASKIP,BRT),                                      X00112   
               COLOR=NEUTRAL,                                          X00113   
               INITIAL='STKR TXT SIZ CLR PRIC'                          00114**5
*                                                                       00115   
ASEL1   DFHMDF POS=(09,02),                                            X00116   
               LENGTH=01,                                              X00117   
               ATTRB=(UNPROT,IC),                                      X00118   
               COLOR=GREEN,                                            X00119   
               HILIGHT=UNDERLINE                                        00120   
AACT1   DFHMDF POS=(09,04),                                            X00121**4
               LENGTH=03,                                              X00122   
               ATTRB=ASKIP,                                            X00123   
               COLOR=BLUE                                               00124   
AFAC1   DFHMDF POS=(09,10),                                            X00125**4
               LENGTH=04,                                              X00126**4
               ATTRB=ASKIP,                                            X00127   
               COLOR=BLUE                                               00128   
AFMT1   DFHMDF POS=(09,16),                                            X00129**4
               LENGTH=06,                                              X00130**4
               ATTRB=ASKIP,                                            X00131**4
               COLOR=BLUE                                               00132**4
ADESC1  DFHMDF POS=(09,23),                                            X00133**4
               LENGTH=06,                                              X00134   
               ATTRB=ASKIP,                                            X00135   
               COLOR=BLUE                                               00136   
ATYP1   DFHMDF POS=(09,31),                                            X00137**4
               LENGTH=01,                                              X00138   
               ATTRB=ASKIP,                                            X00139   
               COLOR=BLUE                                               00140   
ATYPE1  DFHMDF POS=(09,34),                                            X00141**4
               LENGTH=04,                                              X00142   
               ATTRB=ASKIP,                                            X00143   
               COLOR=BLUE                                               00144   
AAPPL1  DFHMDF POS=(09,43),                                            X00145**4
               LENGTH=01,                                              X00146   
               ATTRB=ASKIP,                                            X00147   
               COLOR=BLUE                                               00148   
ATTYP1  DFHMDF POS=(09,49),                                            X00149**4
               LENGTH=01,                                              X00150   
               ATTRB=ASKIP,                                            X00151   
               COLOR=BLUE                                               00152   
ATNR1   DFHMDF POS=(09,54),                                            X00153**4
               LENGTH=03,                                              X00154   
               ATTRB=ASKIP,                                            X00155   
               COLOR=BLUE,                                             X00156   
               PICOUT='ZZ9'                                             00157   
ASTKR1  DFHMDF POS=(09,58),                                            X00158**4
               LENGTH=06,                                              X00159   
               ATTRB=ASKIP,                                            X00160   
               COLOR=BLUE                                               00161   
ATEXT1  DFHMDF POS=(09,65),                                            X00162**5
               LENGTH=01,                                              X00163   
               ATTRB=ASKIP,                                            X00164   
               COLOR=BLUE                                               00165   
ASIZ1   DFHMDF POS=(09,69),                                            X00166**5
               LENGTH=01,                                              X00167   
               ATTRB=ASKIP,                                            X00168   
               COLOR=BLUE                                               00169   
ACLR1   DFHMDF POS=(09,73),                                            X00170**5
               LENGTH=01,                                              X00171   
               ATTRB=ASKIP,                                            X00172   
               COLOR=BLUE                                               00173   
APRIC1  DFHMDF POS=(09,78),                                            X00174**5
               LENGTH=01,                                              X00175   
               ATTRB=ASKIP,                                            X00176   
               COLOR=BLUE                                               00177   
*                                                                       00178   
ASEL2   DFHMDF POS=(10,02),                                            X00179   
               LENGTH=01,                                              X00180   
               ATTRB=UNPROT,                                           X00181   
               COLOR=GREEN,                                            X00182   
               HILIGHT=UNDERLINE                                        00183   
AACT2   DFHMDF POS=(10,04),                                            X00184**4
               LENGTH=03,                                              X00185   
               ATTRB=ASKIP,                                            X00186   
               COLOR=BLUE                                               00187   
AFAC2   DFHMDF POS=(10,10),                                            X00188**4
               LENGTH=04,                                              X00189**4
               ATTRB=ASKIP,                                            X00190**4
               COLOR=BLUE                                               00191**4
AFMT2   DFHMDF POS=(10,16),                                            X00192**4
               LENGTH=06,                                              X00193   
               ATTRB=ASKIP,                                            X00194   
               COLOR=BLUE                                               00195   
ADESC2  DFHMDF POS=(10,23),                                            X00196**4
               LENGTH=06,                                              X00197   
               ATTRB=ASKIP,                                            X00198   
               COLOR=BLUE                                               00199   
ATYP2   DFHMDF POS=(10,31),                                            X00200**4
               LENGTH=01,                                              X00201   
               ATTRB=ASKIP,                                            X00202   
               COLOR=BLUE                                               00203   
ATYPE2  DFHMDF POS=(10,34),                                            X00204**4
               LENGTH=04,                                              X00205   
               ATTRB=ASKIP,                                            X00206   
               COLOR=BLUE                                               00207   
AAPPL2  DFHMDF POS=(10,43),                                            X00208**4
               LENGTH=01,                                              X00209   
               ATTRB=ASKIP,                                            X00210   
               COLOR=BLUE                                               00211   
ATTYP2  DFHMDF POS=(10,49),                                            X00212**4
               LENGTH=01,                                              X00213   
               ATTRB=ASKIP,                                            X00214   
               COLOR=BLUE                                               00215   
ATNR2   DFHMDF POS=(10,54),                                            X00216**4
               LENGTH=03,                                              X00217   
               ATTRB=ASKIP,                                            X00218   
               COLOR=BLUE,                                             X00219   
               PICOUT='ZZ9'                                             00220   
ASTKR2  DFHMDF POS=(10,58),                                            X00221**4
               LENGTH=06,                                              X00222   
               ATTRB=ASKIP,                                            X00223   
               COLOR=BLUE                                               00224   
ATEXT2  DFHMDF POS=(10,65),                                            X00225**5
               LENGTH=01,                                              X00226   
               ATTRB=ASKIP,                                            X00227   
               COLOR=BLUE                                               00228   
ASIZ2   DFHMDF POS=(10,69),                                            X00229**5
               LENGTH=01,                                              X00230   
               ATTRB=ASKIP,                                            X00231   
               COLOR=BLUE                                               00232   
ACLR2   DFHMDF POS=(10,73),                                            X00233**5
               LENGTH=01,                                              X00234   
               ATTRB=ASKIP,                                            X00235   
               COLOR=BLUE                                               00236   
APRIC2  DFHMDF POS=(10,78),                                            X00237**5
               LENGTH=01,                                              X00238   
               ATTRB=ASKIP,                                            X00239   
               COLOR=BLUE                                               00240   
*                                                                       00241   
ASEL3   DFHMDF POS=(11,02),                                            X00242   
               LENGTH=01,                                              X00243   
               ATTRB=UNPROT,                                           X00244   
               COLOR=GREEN,                                            X00245   
               HILIGHT=UNDERLINE                                        00246   
AACT3   DFHMDF POS=(11,04),                                            X00247**6
               LENGTH=03,                                              X00248   
               ATTRB=ASKIP,                                            X00249   
               COLOR=BLUE                                               00250   
AFAC3   DFHMDF POS=(11,10),                                            X00251**4
               LENGTH=04,                                              X00252**4
               ATTRB=ASKIP,                                            X00253**4
               COLOR=BLUE                                               00254**4
AFMT3   DFHMDF POS=(11,16),                                            X00255**4
               LENGTH=06,                                              X00256   
               ATTRB=ASKIP,                                            X00257   
               COLOR=BLUE                                               00258   
ADESC3  DFHMDF POS=(11,23),                                            X00259**4
               LENGTH=06,                                              X00260   
               ATTRB=ASKIP,                                            X00261   
               COLOR=BLUE                                               00262   
ATYP3   DFHMDF POS=(11,31),                                            X00263**4
               LENGTH=01,                                              X00264   
               ATTRB=ASKIP,                                            X00265   
               COLOR=BLUE                                               00266   
ATYPE3  DFHMDF POS=(11,34),                                            X00267**4
               LENGTH=04,                                              X00268   
               ATTRB=ASKIP,                                            X00269   
               COLOR=BLUE                                               00270   
AAPPL3  DFHMDF POS=(11,43),                                            X00271**4
               LENGTH=01,                                              X00272   
               ATTRB=ASKIP,                                            X00273   
               COLOR=BLUE                                               00274   
ATTYP3  DFHMDF POS=(11,49),                                            X00275**4
               LENGTH=01,                                              X00276   
               ATTRB=ASKIP,                                            X00277   
               COLOR=BLUE                                               00278   
ATNR3   DFHMDF POS=(11,54),                                            X00279**4
               LENGTH=03,                                              X00280   
               ATTRB=ASKIP,                                            X00281   
               COLOR=BLUE,                                             X00282   
               PICOUT='ZZ9'                                             00283   
ASTKR3  DFHMDF POS=(11,58),                                            X00284**4
               LENGTH=06,                                              X00285   
               ATTRB=ASKIP,                                            X00286   
               COLOR=BLUE                                               00287   
ATEXT3  DFHMDF POS=(11,65),                                            X00288**5
               LENGTH=01,                                              X00289   
               ATTRB=ASKIP,                                            X00290   
               COLOR=BLUE                                               00291   
ASIZ3   DFHMDF POS=(11,69),                                            X00292**5
               LENGTH=01,                                              X00293   
               ATTRB=ASKIP,                                            X00294   
               COLOR=BLUE                                               00295   
ACLR3   DFHMDF POS=(11,73),                                            X00296**5
               LENGTH=01,                                              X00297   
               ATTRB=ASKIP,                                            X00298   
               COLOR=BLUE                                               00299   
APRIC3  DFHMDF POS=(11,78),                                            X00300**5
               LENGTH=01,                                              X00301   
               ATTRB=ASKIP,                                            X00302   
               COLOR=BLUE                                               00303   
*                                                                       00304   
ASEL4   DFHMDF POS=(12,02),                                            X00305   
               LENGTH=01,                                              X00306   
               ATTRB=UNPROT,                                           X00307   
               COLOR=GREEN,                                            X00308   
               HILIGHT=UNDERLINE                                        00309   
AACT4   DFHMDF POS=(12,04),                                            X00310**6
               LENGTH=03,                                              X00311   
               ATTRB=ASKIP,                                            X00312   
               COLOR=BLUE                                               00313   
AFAC4   DFHMDF POS=(12,10),                                            X00314**4
               LENGTH=04,                                              X00315**4
               ATTRB=ASKIP,                                            X00316**4
               COLOR=BLUE                                               00317**4
AFMT4   DFHMDF POS=(12,16),                                            X00318**4
               LENGTH=06,                                              X00319   
               ATTRB=ASKIP,                                            X00320   
               COLOR=BLUE                                               00321   
ADESC4  DFHMDF POS=(12,23),                                            X00322**4
               LENGTH=06,                                              X00323   
               ATTRB=ASKIP,                                            X00324   
               COLOR=BLUE                                               00325   
ATYP4   DFHMDF POS=(12,31),                                            X00326**4
               LENGTH=01,                                              X00327   
               ATTRB=ASKIP,                                            X00328   
               COLOR=BLUE                                               00329   
ATYPE4  DFHMDF POS=(12,34),                                            X00330**4
               LENGTH=04,                                              X00331   
               ATTRB=ASKIP,                                            X00332   
               COLOR=BLUE                                               00333   
AAPPL4  DFHMDF POS=(12,43),                                            X00334**4
               LENGTH=01,                                              X00335   
               ATTRB=ASKIP,                                            X00336   
               COLOR=BLUE                                               00337   
ATTYP4  DFHMDF POS=(12,49),                                            X00338**4
               LENGTH=01,                                              X00339   
               ATTRB=ASKIP,                                            X00340   
               COLOR=BLUE                                               00341   
ATNR4   DFHMDF POS=(12,54),                                            X00342**4
               LENGTH=03,                                              X00343   
               ATTRB=ASKIP,                                            X00344   
               COLOR=BLUE,                                             X00345   
               PICOUT='ZZ9'                                             00346   
ASTKR4  DFHMDF POS=(12,58),                                            X00347**4
               LENGTH=06,                                              X00348   
               ATTRB=ASKIP,                                            X00349   
               COLOR=BLUE                                               00350   
ATEXT4  DFHMDF POS=(12,65),                                            X00351**5
               LENGTH=01,                                              X00352   
               ATTRB=ASKIP,                                            X00353   
               COLOR=BLUE                                               00354   
ASIZ4   DFHMDF POS=(12,69),                                            X00355**5
               LENGTH=01,                                              X00356   
               ATTRB=ASKIP,                                            X00357   
               COLOR=BLUE                                               00358   
ACLR4   DFHMDF POS=(12,73),                                            X00359**5
               LENGTH=01,                                              X00360   
               ATTRB=ASKIP,                                            X00361   
               COLOR=BLUE                                               00362   
APRIC4  DFHMDF POS=(12,78),                                            X00363**5
               LENGTH=01,                                              X00364   
               ATTRB=ASKIP,                                            X00365   
               COLOR=BLUE                                               00366   
*                                                                       00367   
ASEL5   DFHMDF POS=(13,02),                                            X00368   
               LENGTH=01,                                              X00369   
               ATTRB=UNPROT,                                           X00370   
               COLOR=GREEN,                                            X00371   
               HILIGHT=UNDERLINE                                        00372   
AACT5   DFHMDF POS=(13,04),                                            X00373**6
               LENGTH=03,                                              X00374   
               ATTRB=ASKIP,                                            X00375   
               COLOR=BLUE                                               00376   
AFAC5   DFHMDF POS=(13,10),                                            X00377**4
               LENGTH=04,                                              X00378**4
               ATTRB=ASKIP,                                            X00379**4
               COLOR=BLUE                                               00380**4
AFMT5   DFHMDF POS=(13,16),                                            X00381**4
               LENGTH=06,                                              X00382   
               ATTRB=ASKIP,                                            X00383   
               COLOR=BLUE                                               00384   
ADESC5  DFHMDF POS=(13,23),                                            X00385**4
               LENGTH=06,                                              X00386   
               ATTRB=ASKIP,                                            X00387   
               COLOR=BLUE                                               00388   
ATYP5   DFHMDF POS=(13,31),                                            X00389**4
               LENGTH=01,                                              X00390   
               ATTRB=ASKIP,                                            X00391   
               COLOR=BLUE                                               00392   
ATYPE5  DFHMDF POS=(13,34),                                            X00393**4
               LENGTH=04,                                              X00394   
               ATTRB=ASKIP,                                            X00395   
               COLOR=BLUE                                               00396   
AAPPL5  DFHMDF POS=(13,43),                                            X00397**4
               LENGTH=01,                                              X00398   
               ATTRB=ASKIP,                                            X00399   
               COLOR=BLUE                                               00400   
ATTYP5  DFHMDF POS=(13,49),                                            X00401**4
               LENGTH=01,                                              X00402   
               ATTRB=ASKIP,                                            X00403   
               COLOR=BLUE                                               00404   
ATNR5   DFHMDF POS=(13,54),                                            X00405**4
               LENGTH=03,                                              X00406   
               ATTRB=ASKIP,                                            X00407   
               COLOR=BLUE,                                             X00408   
               PICOUT='ZZ9'                                             00409   
ASTKR5  DFHMDF POS=(13,58),                                            X00410**4
               LENGTH=06,                                              X00411   
               ATTRB=ASKIP,                                            X00412   
               COLOR=BLUE                                               00413   
ATEXT5  DFHMDF POS=(13,65),                                            X00414**5
               LENGTH=01,                                              X00415   
               ATTRB=ASKIP,                                            X00416   
               COLOR=BLUE                                               00417   
ASIZ5   DFHMDF POS=(13,69),                                            X00418**5
               LENGTH=01,                                              X00419   
               ATTRB=ASKIP,                                            X00420   
               COLOR=BLUE                                               00421   
ACLR5   DFHMDF POS=(13,73),                                            X00422**5
               LENGTH=01,                                              X00423   
               ATTRB=ASKIP,                                            X00424   
               COLOR=BLUE                                               00425   
APRIC5  DFHMDF POS=(13,78),                                            X00426**5
               LENGTH=01,                                              X00427   
               ATTRB=ASKIP,                                            X00428   
               COLOR=BLUE                                               00429   
*                                                                       00430   
ASEL6   DFHMDF POS=(14,02),                                            X00431   
               LENGTH=01,                                              X00432   
               ATTRB=UNPROT,                                           X00433   
               COLOR=GREEN,                                            X00434   
               HILIGHT=UNDERLINE                                        00435   
AACT6   DFHMDF POS=(14,04),                                            X00436**6
               LENGTH=03,                                              X00437   
               ATTRB=ASKIP,                                            X00438   
               COLOR=BLUE                                               00439   
AFAC6   DFHMDF POS=(14,10),                                            X00440**4
               LENGTH=04,                                              X00441**4
               ATTRB=ASKIP,                                            X00442**4
               COLOR=BLUE                                               00443**4
AFMT6   DFHMDF POS=(14,16),                                            X00444**4
               LENGTH=06,                                              X00445   
               ATTRB=ASKIP,                                            X00446   
               COLOR=BLUE                                               00447   
ADESC6  DFHMDF POS=(14,23),                                            X00448**4
               LENGTH=06,                                              X00449   
               ATTRB=ASKIP,                                            X00450   
               COLOR=BLUE                                               00451   
ATYP6   DFHMDF POS=(14,31),                                            X00452**4
               LENGTH=01,                                              X00453   
               ATTRB=ASKIP,                                            X00454   
               COLOR=BLUE                                               00455   
ATYPE6  DFHMDF POS=(14,34),                                            X00456**4
               LENGTH=04,                                              X00457   
               ATTRB=ASKIP,                                            X00458   
               COLOR=BLUE                                               00459   
AAPPL6  DFHMDF POS=(14,43),                                            X00460**4
               LENGTH=01,                                              X00461   
               ATTRB=ASKIP,                                            X00462   
               COLOR=BLUE                                               00463   
ATTYP6  DFHMDF POS=(14,49),                                            X00464**4
               LENGTH=01,                                              X00465   
               ATTRB=ASKIP,                                            X00466   
               COLOR=BLUE                                               00467   
ATNR6   DFHMDF POS=(14,54),                                            X00468**4
               LENGTH=03,                                              X00469   
               ATTRB=ASKIP,                                            X00470   
               COLOR=BLUE,                                             X00471   
               PICOUT='ZZ9'                                             00472   
ASTKR6  DFHMDF POS=(14,58),                                            X00473**4
               LENGTH=06,                                              X00474   
               ATTRB=ASKIP,                                            X00475   
               COLOR=BLUE                                               00476   
ATEXT6  DFHMDF POS=(14,65),                                            X00477**5
               LENGTH=01,                                              X00478   
               ATTRB=ASKIP,                                            X00479   
               COLOR=BLUE                                               00480   
ASIZ6   DFHMDF POS=(14,69),                                            X00481**5
               LENGTH=01,                                              X00482   
               ATTRB=ASKIP,                                            X00483   
               COLOR=BLUE                                               00484   
ACLR6   DFHMDF POS=(14,73),                                            X00485**5
               LENGTH=01,                                              X00486   
               ATTRB=ASKIP,                                            X00487   
               COLOR=BLUE                                               00488   
APRIC6  DFHMDF POS=(14,78),                                            X00489**5
               LENGTH=01,                                              X00490   
               ATTRB=ASKIP,                                            X00491   
               COLOR=BLUE                                               00492   
*                                                                       00493   
ASEL7   DFHMDF POS=(15,02),                                            X00494   
               LENGTH=01,                                              X00495   
               ATTRB=UNPROT,                                           X00496   
               COLOR=GREEN,                                            X00497   
               HILIGHT=UNDERLINE                                        00498   
AACT7   DFHMDF POS=(15,04),                                            X00499**6
               LENGTH=03,                                              X00500   
               ATTRB=ASKIP,                                            X00501   
               COLOR=BLUE                                               00502   
AFAC7   DFHMDF POS=(15,10),                                            X00503**4
               LENGTH=04,                                              X00504**4
               ATTRB=ASKIP,                                            X00505**4
               COLOR=BLUE                                               00506**4
AFMT7   DFHMDF POS=(15,16),                                            X00507**4
               LENGTH=06,                                              X00508   
               ATTRB=ASKIP,                                            X00509   
               COLOR=BLUE                                               00510   
ADESC7  DFHMDF POS=(15,23),                                            X00511**4
               LENGTH=06,                                              X00512   
               ATTRB=ASKIP,                                            X00513   
               COLOR=BLUE                                               00514   
ATYP7   DFHMDF POS=(15,31),                                            X00515**4
               LENGTH=01,                                              X00516   
               ATTRB=ASKIP,                                            X00517   
               COLOR=BLUE                                               00518   
ATYPE7  DFHMDF POS=(15,34),                                            X00519**4
               LENGTH=04,                                              X00520   
               ATTRB=ASKIP,                                            X00521   
               COLOR=BLUE                                               00522   
AAPPL7  DFHMDF POS=(15,43),                                            X00523**4
               LENGTH=01,                                              X00524   
               ATTRB=ASKIP,                                            X00525   
               COLOR=BLUE                                               00526   
ATTYP7  DFHMDF POS=(15,49),                                            X00527**4
               LENGTH=01,                                              X00528   
               ATTRB=ASKIP,                                            X00529   
               COLOR=BLUE                                               00530   
ATNR7   DFHMDF POS=(15,54),                                            X00531**4
               LENGTH=03,                                              X00532   
               ATTRB=ASKIP,                                            X00533   
               COLOR=BLUE,                                             X00534   
               PICOUT='ZZ9'                                             00535   
ASTKR7  DFHMDF POS=(15,58),                                            X00536**4
               LENGTH=06,                                              X00537   
               ATTRB=ASKIP,                                            X00538   
               COLOR=BLUE                                               00539   
ATEXT7  DFHMDF POS=(15,65),                                            X00540**5
               LENGTH=01,                                              X00541   
               ATTRB=ASKIP,                                            X00542   
               COLOR=BLUE                                               00543   
ASIZ7   DFHMDF POS=(15,69),                                            X00544**5
               LENGTH=01,                                              X00545   
               ATTRB=ASKIP,                                            X00546   
               COLOR=BLUE                                               00547   
ACLR7   DFHMDF POS=(15,73),                                            X00548**5
               LENGTH=01,                                              X00549   
               ATTRB=ASKIP,                                            X00550   
               COLOR=BLUE                                               00551   
APRIC7  DFHMDF POS=(15,78),                                            X00552**5
               LENGTH=01,                                              X00553   
               ATTRB=ASKIP,                                            X00554   
               COLOR=BLUE                                               00555   
*                                                                       00556   
ASEL8   DFHMDF POS=(16,02),                                            X00557   
               LENGTH=01,                                              X00558   
               ATTRB=UNPROT,                                           X00559   
               COLOR=GREEN,                                            X00560   
               HILIGHT=UNDERLINE                                        00561   
AACT8   DFHMDF POS=(16,04),                                            X00562**6
               LENGTH=03,                                              X00563   
               ATTRB=ASKIP,                                            X00564   
               COLOR=BLUE                                               00565   
AFAC8   DFHMDF POS=(16,10),                                            X00566**4
               LENGTH=04,                                              X00567**4
               ATTRB=ASKIP,                                            X00568**4
               COLOR=BLUE                                               00569**4
AFMT8   DFHMDF POS=(16,16),                                            X00570**4
               LENGTH=06,                                              X00571   
               ATTRB=ASKIP,                                            X00572   
               COLOR=BLUE                                               00573   
ADESC8  DFHMDF POS=(16,23),                                            X00574**4
               LENGTH=06,                                              X00575   
               ATTRB=ASKIP,                                            X00576   
               COLOR=BLUE                                               00577   
ATYP8   DFHMDF POS=(16,31),                                            X00578**4
               LENGTH=01,                                              X00579   
               ATTRB=ASKIP,                                            X00580   
               COLOR=BLUE                                               00581   
ATYPE8  DFHMDF POS=(16,34),                                            X00582**4
               LENGTH=04,                                              X00583   
               ATTRB=ASKIP,                                            X00584   
               COLOR=BLUE                                               00585   
AAPPL8  DFHMDF POS=(16,43),                                            X00586**4
               LENGTH=01,                                              X00587   
               ATTRB=ASKIP,                                            X00588   
               COLOR=BLUE                                               00589   
ATTYP8  DFHMDF POS=(16,49),                                            X00590**4
               LENGTH=01,                                              X00591   
               ATTRB=ASKIP,                                            X00592   
               COLOR=BLUE                                               00593   
ATNR8   DFHMDF POS=(16,54),                                            X00594**4
               LENGTH=03,                                              X00595   
               ATTRB=ASKIP,                                            X00596   
               COLOR=BLUE,                                             X00597   
               PICOUT='ZZ9'                                             00598   
ASTKR8  DFHMDF POS=(16,58),                                            X00599**4
               LENGTH=06,                                              X00600   
               ATTRB=ASKIP,                                            X00601   
               COLOR=BLUE                                               00602   
ATEXT8  DFHMDF POS=(16,65),                                            X00603**5
               LENGTH=01,                                              X00604   
               ATTRB=ASKIP,                                            X00605   
               COLOR=BLUE                                               00606   
ASIZ8   DFHMDF POS=(16,69),                                            X00607**5
               LENGTH=01,                                              X00608   
               ATTRB=ASKIP,                                            X00609   
               COLOR=BLUE                                               00610   
ACLR8   DFHMDF POS=(16,73),                                            X00611**5
               LENGTH=01,                                              X00612   
               ATTRB=ASKIP,                                            X00613   
               COLOR=BLUE                                               00614   
APRIC8  DFHMDF POS=(16,78),                                            X00615**5
               LENGTH=01,                                              X00616   
               ATTRB=ASKIP,                                            X00617   
               COLOR=BLUE                                               00618   
*                                                                       00619   
ASEL9   DFHMDF POS=(17,02),                                            X00620   
               LENGTH=01,                                              X00621   
               ATTRB=UNPROT,                                           X00622   
               COLOR=GREEN,                                            X00623   
               HILIGHT=UNDERLINE                                        00624   
AACT9   DFHMDF POS=(17,04),                                            X00625**6
               LENGTH=03,                                              X00626   
               ATTRB=ASKIP,                                            X00627   
               COLOR=BLUE                                               00628   
AFAC9   DFHMDF POS=(17,10),                                            X00629**4
               LENGTH=04,                                              X00630**4
               ATTRB=ASKIP,                                            X00631**4
               COLOR=BLUE                                               00632**4
AFMT9   DFHMDF POS=(17,16),                                            X00633**4
               LENGTH=06,                                              X00634   
               ATTRB=ASKIP,                                            X00635   
               COLOR=BLUE                                               00636   
ADESC9  DFHMDF POS=(17,23),                                            X00637**4
               LENGTH=06,                                              X00638   
               ATTRB=ASKIP,                                            X00639   
               COLOR=BLUE                                               00640   
ATYP9   DFHMDF POS=(17,31),                                            X00641**4
               LENGTH=01,                                              X00642   
               ATTRB=ASKIP,                                            X00643   
               COLOR=BLUE                                               00644   
ATYPE9  DFHMDF POS=(17,34),                                            X00645**4
               LENGTH=04,                                              X00646   
               ATTRB=ASKIP,                                            X00647   
               COLOR=BLUE                                               00648   
AAPPL9  DFHMDF POS=(17,43),                                            X00649**4
               LENGTH=01,                                              X00650   
               ATTRB=ASKIP,                                            X00651   
               COLOR=BLUE                                               00652   
ATTYP9  DFHMDF POS=(17,49),                                            X00653**4
               LENGTH=01,                                              X00654   
               ATTRB=ASKIP,                                            X00655   
               COLOR=BLUE                                               00656   
ATNR9   DFHMDF POS=(17,54),                                            X00657**4
               LENGTH=03,                                              X00658   
               ATTRB=ASKIP,                                            X00659   
               COLOR=BLUE,                                             X00660   
               PICOUT='ZZ9'                                             00661   
ASTKR9  DFHMDF POS=(17,58),                                            X00662**4
               LENGTH=06,                                              X00663   
               ATTRB=ASKIP,                                            X00664   
               COLOR=BLUE                                               00665   
ATEXT9  DFHMDF POS=(17,65),                                            X00666**5
               LENGTH=01,                                              X00667   
               ATTRB=ASKIP,                                            X00668   
               COLOR=BLUE                                               00669   
ASIZ9   DFHMDF POS=(17,69),                                            X00670**5
               LENGTH=01,                                              X00671   
               ATTRB=ASKIP,                                            X00672   
               COLOR=BLUE                                               00673   
ACLR9   DFHMDF POS=(17,73),                                            X00674**5
               LENGTH=01,                                              X00675   
               ATTRB=ASKIP,                                            X00676   
               COLOR=BLUE                                               00677   
APRIC9  DFHMDF POS=(17,78),                                            X00678**5
               LENGTH=01,                                              X00679   
               ATTRB=ASKIP,                                            X00680   
               COLOR=BLUE                                               00681   
*                                                                       00682   
ASEL10  DFHMDF POS=(18,02),                                            X00683   
               LENGTH=01,                                              X00684   
               ATTRB=UNPROT,                                           X00685   
               COLOR=GREEN,                                            X00686   
               HILIGHT=UNDERLINE                                        00687   
AACT10  DFHMDF POS=(18,04),                                            X00688**6
               LENGTH=03,                                              X00689   
               ATTRB=ASKIP,                                            X00690   
               COLOR=BLUE                                               00691   
AFAC10  DFHMDF POS=(18,10),                                            X00692**4
               LENGTH=04,                                              X00693**4
               ATTRB=ASKIP,                                            X00694**4
               COLOR=BLUE                                               00695**4
AFMT10  DFHMDF POS=(18,16),                                            X00696**4
               LENGTH=06,                                              X00697   
               ATTRB=ASKIP,                                            X00698   
               COLOR=BLUE                                               00699   
ADESC10 DFHMDF POS=(18,23),                                            X00700**4
               LENGTH=06,                                              X00701   
               ATTRB=ASKIP,                                            X00702   
               COLOR=BLUE                                               00703   
ATYP10  DFHMDF POS=(18,31),                                            X00704**4
               LENGTH=01,                                              X00705   
               ATTRB=ASKIP,                                            X00706   
               COLOR=BLUE                                               00707   
ATYPE10 DFHMDF POS=(18,34),                                            X00708**4
               LENGTH=04,                                              X00709   
               ATTRB=ASKIP,                                            X00710   
               COLOR=BLUE                                               00711   
AAPPL10 DFHMDF POS=(18,43),                                            X00712**4
               LENGTH=01,                                              X00713   
               ATTRB=ASKIP,                                            X00714   
               COLOR=BLUE                                               00715   
ATTYP10 DFHMDF POS=(18,49),                                            X00716**4
               LENGTH=01,                                              X00717   
               ATTRB=ASKIP,                                            X00718   
               COLOR=BLUE                                               00719   
ATNR10  DFHMDF POS=(18,54),                                            X00720**4
               LENGTH=03,                                              X00721   
               ATTRB=ASKIP,                                            X00722   
               COLOR=BLUE,                                             X00723   
               PICOUT='ZZ9'                                             00724   
ASTKR10 DFHMDF POS=(18,58),                                            X00725**4
               LENGTH=06,                                              X00726   
               ATTRB=ASKIP,                                            X00727   
               COLOR=BLUE                                               00728   
ATEXT10 DFHMDF POS=(18,65),                                            X00729**5
               LENGTH=01,                                              X00730   
               ATTRB=ASKIP,                                            X00731   
               COLOR=BLUE                                               00732   
ASIZ10  DFHMDF POS=(18,69),                                            X00733**5
               LENGTH=01,                                              X00734   
               ATTRB=ASKIP,                                            X00735   
               COLOR=BLUE                                               00736   
ACLR10  DFHMDF POS=(18,73),                                            X00737**5
               LENGTH=01,                                              X00738   
               ATTRB=ASKIP,                                            X00739   
               COLOR=BLUE                                               00740   
APRIC10 DFHMDF POS=(18,78),                                            X00741**5
               LENGTH=01,                                              X00742   
               ATTRB=ASKIP,                                            X00743   
               COLOR=BLUE                                               00744   
*                                                                       00745   
        DFHMDF POS=(19,40),                                            X00746   
               LENGTH=25,                                              X00747   
               ATTRB=(ASKIP,NORM),                                     X00748   
               COLOR=NEUTRAL,                                          X00749   
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00750   
ASELIT  DFHMDF POS=(19,67),                                            X00751   
               LENGTH=07,                                              X00752   
               ATTRB=(ASKIP,NORM),                                     X00753   
               COLOR=BLUE,                                             X00754   
               PICOUT='ZZZ,ZZ9'                                         00755   
*                                                                       00756   
         DFHMSD TYPE=FINAL                                              00757   
         END                                                            00758   
