*          DATA SET CNKM234                                             00010002
  PRINT  NOGEN                                                          00020002
*-------------------------------------------------------------------*   00030002
*                                                                   *   00040002
*        MAPSET  CNKM234                                            *   00050002
*        MAP     CNK234                                             *   00060002
*        PROGRAM CNKCS234                                           *   00070002
*        TRANSID Y234 - DC-FUNCTION CODE ADD/UPDATE                 *   00080002
*                                                                   *   00090002
*******************************************************************     00100002
*                                                                       00110002
*  CNKM234  MAPSET -  THIS IS THE BMS MAP FOR THE DC FUNCTION CODE      00120002
*    UPDATE/ADD FUNCTION                                                00130002
*                                                                       00140002
*******************************************************************     00150002
CNKM234 DFHMSD TYPE=DSECT,                                             C00160002
               LANG=COBOL,                                             C00170002
               MODE=INOUT,                                             C00180002
               STORAGE=AUTO,                                           C00190002
               TERM=3270-2,                                            C00200002
               TIOAPFX=YES                                              00210002
CNK234  DFHMDI LINE=2,COLUMN=1,                                        C00220002
               SIZE=(19,80),                                           C00230002
               CTRL=(FREEKB),                                          C00240002
               MAPATTS=(COLOR,HILIGHT),                                C00250002
               DSATTS=(COLOR,HILIGHT)                                   00260002
*******************************************************************     00270002
*******************************************************************     00280002
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00290002
               INITIAL='PARAMETER NAME.......:',                       X00300003
               COLOR=NEUTRAL,                                          X00310002
               LENGTH=22,                                              X00320003
               POS=(04,10)                                              00330004
APMCODE  DFHMDF POS=(04,34),                                           X00340003
               LENGTH=6,                                               X00350003
               COLOR=BLUE,                                             X00360002
               ATTRB=ASKIP                                              00370002
        DFHMDF ATTRB=(ASKIP),                                          X00420002
               LENGTH=1,                                               X00430002
               POS=(04,41)                                              00440003
*******************************************************************     00450002
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00451002
               INITIAL='PARAMETER DESCRIPTION:',                       X00452003
               COLOR=NEUTRAL,                                          X00453002
               LENGTH=22,                                              X00454003
               POS=(06,10)                                              00455004
APMDESC  DFHMDF POS=(06,34),                                           X00456006
               LENGTH=40,                                              X00457003
               COLOR=BLUE,                                             X00458002
               ATTRB=ASKIP                                              00459002
        DFHMDF ATTRB=(ASKIP),                                          X00459502
               LENGTH=1,                                               X00459602
               POS=(06,75)                                              00459706
*******************************************************************     00459802
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00459902
               INITIAL='PARAMETER TYPE........:',                      X00460003
               COLOR=NEUTRAL,                                          X00470002
               LENGTH=22,                                              X00480003
               POS=(08,10)                                              00490004
APMTYPE  DFHMDF POS=(08,34),                                           X00500006
               LENGTH=2,                                               X00510003
               HILIGHT=UNDERLINE,                                      X00520002
               COLOR=GREEN,                                            X00530002
               ATTRB=UNPROT                                             00540002
        DFHMDF ATTRB=(ASKIP),                                          X00550002
               LENGTH=1,                                               X00560002
               POS=(08,37)                                              00570006
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00571003
               INITIAL='(DT=DATE, PC=%, QT=QUANTITY, TX=TEXT)',        X00572003
               COLOR=NEUTRAL,                                          X00573003
               LENGTH=37,                                              X00574003
               POS=(08,40)                                              00575006
*******************************************************************     00580002
*******************************************************************     01149402
*******************************************************************     01149502
         DFHMSD TYPE=FINAL                                              01149602
         END                                                            01149702
