*          DATA SET CNKM237                                             00010002
        PRINT  NOGEN                                                    00020002
*-------------------------------------------------------------------*   00030002
*                                                                   *   00040002
*        MAPSET  CNKM237                                            *   00050002
*        MAP     CNK237                                             *   00060002
*        PROGRAM CNKCS237                                           *   00070002
*        TRANSID Y237 - CN-PARAMETER PARM LIST                      *   00080002
*                                                                   *   00090002
*-------------------------------------------------------------------*   00100002
CNKM237 DFHMSD TYPE=DSECT,                                             X00110002
               LANG=COBOL,                                             X00120002
               MODE=INOUT,                                             X00130002
               STORAGE=AUTO,                                           X00140002
               TERM=3270-2,                                            X00150002
               TIOAPFX=YES                                              00160002
**********************************************************************  00170002
CNK237  DFHMDI LINE=2,COLUMN=1,                                        X00180002
               SIZE=(19,80),                                           X00190002
               CTRL=(FREEKB),                                          X00200002
               MAPATTS=(COLOR,HILIGHT),                                X00210002
               DSATTS=(COLOR,HILIGHT)                                   00220002
**********************************************************************  00230002
**********************************************************************  00240002
        DFHMDF POS=(03,02),                                            X00240103
               LENGTH=05,                                              X00240203
               ATTRB=(ASKIP,NORM),                                     X00240303
               COLOR=NEUTRAL,                                          X00240403
               INITIAL='CODE:'                                          00240503
ACODE   DFHMDF POS=(03,08),                                            X00240606
               LENGTH=06,                                              X00240707
               ATTRB=(ASKIP,NORM),                                     X00240803
               COLOR=BLUE                                               00240906
ANAME   DFHMDF POS=(03,17),                                            X00241003
               LENGTH=40,                                              X00241103
               ATTRB=(ASKIP,NORM),                                     X00241203
               COLOR=BLUE                                               00241306
        DFHMDF POS=(03,59),                                            X00241403
               LENGTH=05,                                              X00241503
               ATTRB=(ASKIP,NORM),                                     X00241603
               COLOR=NEUTRAL,                                          X00241703
               INITIAL='TYPE:'                                          00241803
ATYPE   DFHMDF POS=(03,65),                                            X00241903
               LENGTH=12,                                              X00242003
               ATTRB=(ASKIP,NORM),                                     X00242103
               COLOR=BLUE                                               00242206
**********************************************************************  00242303
**********************************************************************  00243003
        DFHMDF POS=(04,01),                                            X00250003
               LENGTH=01,                                              X00260002
               ATTRB=(ASKIP,NORM),                                     X00270002
               COLOR=NEUTRAL,                                          X00280002
               INITIAL='S'                                              00280102
        DFHMDF POS=(04,03),                                            X00280203
               LENGTH=01,                                              X00280302
               ATTRB=(ASKIP,NORM),                                     X00280402
               COLOR=NEUTRAL,                                          X00280502
               INITIAL='A'                                              00280602
        DFHMDF POS=(04,10),                                            X00280703
               LENGTH=03,                                              X00280802
               ATTRB=(ASKIP,NORM),                                     X00280902
               COLOR=NEUTRAL,                                          X00281002
               INITIAL='INT'                                            00281102
        DFHMDF POS=(04,51),                                            X00281203
               LENGTH=05,                                              X00282002
               ATTRB=(ASKIP,NORM),                                     X00283002
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00284002
ASTRTIT DFHMDF POS=(04,57),                                            X00290003
               LENGTH=05,                                              X00300002
               ATTRB=(NUM,UNPROT,NORM),                                X00310002
               COLOR=GREEN,                                            X00320002
               PICOUT='ZZZZ9',                                         X00330002
               HILIGHT=UNDERLINE                                        00340002
        DFHMDF POS=(04,63),                                            X00350003
               LENGTH=02,                                              X00360002
               ATTRB=(ASKIP,NORM),                                     X00370002
               COLOR=NEUTRAL,                                          X00380002
               INITIAL='TO'                                             00390002
AENDIT  DFHMDF POS=(04,66),                                            X00400003
               LENGTH=05,                                              X00410002
               ATTRB=(ASKIP,NORM),                                     X00420002
               COLOR=BLUE,                                             X00430002
               PICOUT='ZZZZ9'                                           00440002
        DFHMDF POS=(04,72),                                            X00450003
               LENGTH=02,                                              X00460002
               ATTRB=(ASKIP,NORM),                                     X00470002
               COLOR=NEUTRAL,                                          X00480002
               INITIAL='OF'                                             00490002
ATOTIT  DFHMDF POS=(04,75),                                            X00500003
               LENGTH=05,                                              X00510002
               ATTRB=(ASKIP,NORM),                                     X00520002
               COLOR=BLUE,                                             X00530002
               PICOUT='ZZZZ9'                                           00540002
**********************************************************************  00550002
        DFHMDF POS=(05,01),                                            X00560003
               ATTRB=(ASKIP,NORM),                                     X00570002
               COLOR=NEUTRAL,                                          X00580002
               LENGTH=001,                                             X00590002
               INITIAL='E'                                              00600002
        DFHMDF POS=(05,03),                                            X00601003
               ATTRB=(ASKIP,NORM),                                     X00602002
               COLOR=NEUTRAL,                                          X00603002
               LENGTH=001,                                             X00604002
               INITIAL='C'                                              00605002
        DFHMDF POS=(05,10),                                            X00605108
               LENGTH=03,                                              X00605208
               ATTRB=(ASKIP,NORM),                                     X00605308
               COLOR=NEUTRAL,                                          X00605408
               INITIAL='SYS'                                            00605508
        DFHMDF POS=(05,18),                                            X00606003
               ATTRB=(ASKIP,NORM),                                     X00607002
               COLOR=NEUTRAL,                                          X00608002
               LENGTH=008,                                             X00609002
               INITIAL='FUNCTION'                                       00609102
        DFHMDF POS=(05,30),                                            X00610003
               ATTRB=(ASKIP,NORM),                                     X00620002
               COLOR=NEUTRAL,                                          X00630002
               LENGTH=008,                                             X00640002
               INITIAL='FUNCTION'                                       00650002
        DFHMDF POS=(05,39),                                            X00651003
               ATTRB=(ASKIP,NORM),                                     X00652002
               COLOR=NEUTRAL,                                          X00653002
               LENGTH=008,                                             X00654002
               INITIAL='FUNCTION'                                       00655002
        DFHMDF POS=(05,49),                                            X00660003
               ATTRB=(ASKIP,NORM),                                     X00670002
               COLOR=NEUTRAL,                                          X00680002
               LENGTH=004,                                             X00690002
               INITIAL='FUNC'                                           00700002
**********************************************************************  00710002
        DFHMDF POS=(06,01),                                            X00720003
               ATTRB=(ASKIP,NORM),                                     X00730002
               COLOR=NEUTRAL,                                          X00740002
               LENGTH=001,                                             X00750002
               INITIAL='L'                                              00760002
        DFHMDF POS=(06,03),                                            X00770003
               ATTRB=(ASKIP,NORM),                                     X00780002
               COLOR=NEUTRAL,                                          X00790002
               LENGTH=001,                                             X00800002
               INITIAL='T'                                              00810002
        DFHMDF POS=(06,06),                                            X00820003
               ATTRB=(ASKIP,NORM),                                     X00830002
               COLOR=NEUTRAL,                                          X00840002
               LENGTH=003,                                             X00850002
               INITIAL='LOC'                                            00860002
        DFHMDF POS=(06,10),                                            X00861003
               ATTRB=(ASKIP,NORM),                                     X00862002
               COLOR=NEUTRAL,                                          X00863002
               LENGTH=003,                                             X00864002
               INITIAL='CDE'                                            00865002
        DFHMDF POS=(06,14),                                            X00866003
               ATTRB=(ASKIP,NORM),                                     X00867002
               COLOR=NEUTRAL,                                          X00868002
               LENGTH=002,                                             X00869002
               INITIAL='ST'                                             00869102
        DFHMDF POS=(06,18),                                            X00870003
               ATTRB=(ASKIP,NORM),                                     X00880002
               COLOR=NEUTRAL,                                          X00890002
               LENGTH=009,                                             X00900002
               INITIAL='FROM DATE'                                      00910002
        DFHMDF POS=(06,30),                                            X00920003
               ATTRB=(ASKIP,NORM),                                     X00930002
               COLOR=NEUTRAL,                                          X00940002
               LENGTH=007,                                             X00950002
               INITIAL='TO DATE'                                        00960002
        DFHMDF POS=(06,39),                                            X00970003
               ATTRB=(ASKIP,NORM),                                     X00980002
               COLOR=NEUTRAL,                                          X00990002
               LENGTH=008,                                             X01000002
               INITIAL='QUANTITY'                                       01010002
        DFHMDF POS=(06,49),                                            X01011003
               ATTRB=(ASKIP,NORM),                                     X01012002
               COLOR=NEUTRAL,                                          X01013002
               LENGTH=004,                                             X01014002
               INITIAL='PCNT'                                           01015002
        DFHMDF POS=(06,55),                                            X01016003
               ATTRB=(ASKIP,NORM),                                     X01017002
               COLOR=NEUTRAL,                                          X01018002
               LENGTH=013,                                             X01019002
               INITIAL='FUNCTION TEXT'                                  01019102
**********************************************************************  01020002
**********************************************************************  01030002
ASEL01  DFHMDF POS=(08,001),                                           X04311009
               COLOR=GREEN,                                            X04312002
               HILIGHT=UNDERLINE,                                      X04313002
               ATTRB=(UNPROT,NORM),                                    X04314002
               LENGTH=001                                               04315002
AACT01  DFHMDF POS=(08,003),                                           X04316009
               ATTRB=(ASKIP),                                          X04317002
               LENGTH=001                                               04318002
AOPER01 DFHMDF POS=(08,005),                                           X04319009
               COLOR=BLUE,                                             X04319102
               ATTRB=(ASKIP,NORM),                                     X04319202
               LENGTH=004                                               04319302
ASYS01  DFHMDF POS=(08,010),                                           X04319409
               COLOR=BLUE,                                             X04319502
               ATTRB=(ASKIP,NORM),                                     X04319602
               LENGTH=003                                               04319702
ASTAT01 DFHMDF POS=(08,014),                                           X04319809
               COLOR=BLUE,                                             X04319902
               ATTRB=(ASKIP,NORM),                                     X04320002
               LENGTH=002                                               04320102
AFROM01 DFHMDF POS=(08,017),                                           X04320209
               COLOR=BLUE,                                             X04320302
               ATTRB=(ASKIP,NORM),                                     X04320402
               LENGTH=010                                               04320502
ATODT01 DFHMDF POS=(08,028),                                           X04320609
               COLOR=BLUE,                                             X04320702
               ATTRB=(ASKIP,NORM),                                     X04320802
               LENGTH=010                                               04320902
AQTY01  DFHMDF POS=(08,039),                                           X04321009
               COLOR=BLUE,                                             X04321102
               ATTRB=(ASKIP,NORM),                                     X04321202
               LENGTH=008                                               04321302
APCNT01 DFHMDF POS=(08,048),                                           X04321409
               COLOR=BLUE,                                             X04321502
               ATTRB=(ASKIP,NORM),                                     X04321602
               LENGTH=006                                               04321702
ATEXT01 DFHMDF POS=(08,055),                                           X04321809
               COLOR=BLUE,                                             X04321902
               ATTRB=(ASKIP,NORM),                                     X04322002
               LENGTH=024                                               04322102
**********************************************************************  04322202
**********************************************************************  04322302
ASEL02  DFHMDF POS=(09,001),                                           X04322409
               COLOR=GREEN,                                            X04322502
               HILIGHT=UNDERLINE,                                      X04322602
               ATTRB=(UNPROT,NORM),                                    X04322702
               LENGTH=001                                               04322802
AACT02  DFHMDF POS=(09,003),                                           X04322909
               ATTRB=(ASKIP),                                          X04323002
               LENGTH=001                                               04323102
AOPER02 DFHMDF POS=(09,005),                                           X04323209
               COLOR=BLUE,                                             X04323302
               ATTRB=(ASKIP,NORM),                                     X04323402
               LENGTH=004                                               04323502
ASYS02  DFHMDF POS=(09,010),                                           X04323609
               COLOR=BLUE,                                             X04323702
               ATTRB=(ASKIP,NORM),                                     X04323802
               LENGTH=003                                               04323902
ASTAT02 DFHMDF POS=(09,014),                                           X04324009
               COLOR=BLUE,                                             X04324102
               ATTRB=(ASKIP,NORM),                                     X04324202
               LENGTH=002                                               04324302
AFROM02 DFHMDF POS=(09,017),                                           X04324409
               COLOR=BLUE,                                             X04324502
               ATTRB=(ASKIP,NORM),                                     X04324602
               LENGTH=010                                               04324702
ATODT02 DFHMDF POS=(09,028),                                           X04324809
               COLOR=BLUE,                                             X04324902
               ATTRB=(ASKIP,NORM),                                     X04325002
               LENGTH=010                                               04325102
AQTY02  DFHMDF POS=(09,039),                                           X04325209
               COLOR=BLUE,                                             X04325302
               ATTRB=(ASKIP,NORM),                                     X04325402
               LENGTH=008                                               04325502
APCNT02 DFHMDF POS=(09,048),                                           X04325609
               COLOR=BLUE,                                             X04325702
               ATTRB=(ASKIP,NORM),                                     X04325802
               LENGTH=006                                               04325902
ATEXT02 DFHMDF POS=(09,055),                                           X04326009
               COLOR=BLUE,                                             X04326102
               ATTRB=(ASKIP,NORM),                                     X04326202
               LENGTH=024                                               04326302
**********************************************************************  04326402
**********************************************************************  04326502
ASEL03  DFHMDF POS=(10,001),                                           X04326609
               COLOR=GREEN,                                            X04326702
               HILIGHT=UNDERLINE,                                      X04326802
               ATTRB=(UNPROT,NORM),                                    X04326902
               LENGTH=001                                               04327002
AACT03  DFHMDF POS=(10,003),                                           X04327109
               ATTRB=(ASKIP),                                          X04327202
               LENGTH=001                                               04327302
AOPER03 DFHMDF POS=(10,005),                                           X04327409
               COLOR=BLUE,                                             X04327502
               ATTRB=(ASKIP,NORM),                                     X04327602
               LENGTH=004                                               04327702
ASYS03  DFHMDF POS=(10,010),                                           X04327809
               COLOR=BLUE,                                             X04327902
               ATTRB=(ASKIP,NORM),                                     X04328002
               LENGTH=003                                               04328102
ASTAT03 DFHMDF POS=(10,014),                                           X04328209
               COLOR=BLUE,                                             X04328302
               ATTRB=(ASKIP,NORM),                                     X04328402
               LENGTH=002                                               04328502
AFROM03 DFHMDF POS=(10,017),                                           X04328609
               COLOR=BLUE,                                             X04328702
               ATTRB=(ASKIP,NORM),                                     X04328802
               LENGTH=010                                               04328902
ATODT03 DFHMDF POS=(10,028),                                           X04329009
               COLOR=BLUE,                                             X04329102
               ATTRB=(ASKIP,NORM),                                     X04329202
               LENGTH=010                                               04329302
AQTY03  DFHMDF POS=(10,039),                                           X04329409
               COLOR=BLUE,                                             X04329502
               ATTRB=(ASKIP,NORM),                                     X04329602
               LENGTH=008                                               04329702
APCNT03 DFHMDF POS=(10,048),                                           X04329809
               COLOR=BLUE,                                             X04329902
               ATTRB=(ASKIP,NORM),                                     X04330002
               LENGTH=006                                               04330102
ATEXT03 DFHMDF POS=(10,055),                                           X04330209
               COLOR=BLUE,                                             X04330302
               ATTRB=(ASKIP,NORM),                                     X04330402
               LENGTH=024                                               04330502
**********************************************************************  04330602
**********************************************************************  04330702
ASEL04  DFHMDF POS=(11,001),                                           X04330809
               COLOR=GREEN,                                            X04330902
               HILIGHT=UNDERLINE,                                      X04331002
               ATTRB=(UNPROT,NORM),                                    X04331102
               LENGTH=001                                               04331202
AACT04  DFHMDF POS=(11,003),                                           X04331309
               ATTRB=(ASKIP),                                          X04331402
               LENGTH=001                                               04331502
AOPER04 DFHMDF POS=(11,005),                                           X04331609
               COLOR=BLUE,                                             X04331702
               ATTRB=(ASKIP,NORM),                                     X04331802
               LENGTH=004                                               04331902
ASYS04  DFHMDF POS=(11,010),                                           X04332009
               COLOR=BLUE,                                             X04332102
               ATTRB=(ASKIP,NORM),                                     X04332202
               LENGTH=003                                               04332302
ASTAT04 DFHMDF POS=(11,014),                                           X04332409
               COLOR=BLUE,                                             X04332502
               ATTRB=(ASKIP,NORM),                                     X04332602
               LENGTH=002                                               04332702
AFROM04 DFHMDF POS=(11,017),                                           X04332809
               COLOR=BLUE,                                             X04332902
               ATTRB=(ASKIP,NORM),                                     X04333002
               LENGTH=010                                               04333102
ATODT04 DFHMDF POS=(11,028),                                           X04333209
               COLOR=BLUE,                                             X04333302
               ATTRB=(ASKIP,NORM),                                     X04333402
               LENGTH=010                                               04333502
AQTY04  DFHMDF POS=(11,039),                                           X04333609
               COLOR=BLUE,                                             X04333702
               ATTRB=(ASKIP,NORM),                                     X04333802
               LENGTH=008                                               04333902
APCNT04 DFHMDF POS=(11,048),                                           X04334009
               COLOR=BLUE,                                             X04334102
               ATTRB=(ASKIP,NORM),                                     X04334202
               LENGTH=006                                               04334302
ATEXT04 DFHMDF POS=(11,055),                                           X04334409
               COLOR=BLUE,                                             X04334502
               ATTRB=(ASKIP,NORM),                                     X04334602
               LENGTH=024                                               04334702
**********************************************************************  04334802
**********************************************************************  04334902
ASEL05  DFHMDF POS=(12,001),                                           X04335009
               COLOR=GREEN,                                            X04335102
               HILIGHT=UNDERLINE,                                      X04335202
               ATTRB=(UNPROT,NORM),                                    X04335302
               LENGTH=001                                               04335402
AACT05  DFHMDF POS=(12,003),                                           X04335509
               ATTRB=(ASKIP),                                          X04335602
               LENGTH=001                                               04335702
AOPER05 DFHMDF POS=(12,005),                                           X04335809
               COLOR=BLUE,                                             X04335902
               ATTRB=(ASKIP,NORM),                                     X04336002
               LENGTH=004                                               04336102
ASYS05  DFHMDF POS=(12,010),                                           X04336209
               COLOR=BLUE,                                             X04336302
               ATTRB=(ASKIP,NORM),                                     X04336402
               LENGTH=003                                               04336502
ASTAT05 DFHMDF POS=(12,014),                                           X04336609
               COLOR=BLUE,                                             X04336702
               ATTRB=(ASKIP,NORM),                                     X04336802
               LENGTH=002                                               04336902
AFROM05 DFHMDF POS=(12,017),                                           X04337009
               COLOR=BLUE,                                             X04337102
               ATTRB=(ASKIP,NORM),                                     X04337202
               LENGTH=010                                               04337302
ATODT05 DFHMDF POS=(12,028),                                           X04337409
               COLOR=BLUE,                                             X04337502
               ATTRB=(ASKIP,NORM),                                     X04337602
               LENGTH=010                                               04337702
AQTY05  DFHMDF POS=(12,039),                                           X04337809
               COLOR=BLUE,                                             X04337902
               ATTRB=(ASKIP,NORM),                                     X04338002
               LENGTH=008                                               04338102
APCNT05 DFHMDF POS=(12,048),                                           X04338209
               COLOR=BLUE,                                             X04338302
               ATTRB=(ASKIP,NORM),                                     X04338402
               LENGTH=006                                               04338502
ATEXT05 DFHMDF POS=(12,055),                                           X04338609
               COLOR=BLUE,                                             X04338702
               ATTRB=(ASKIP,NORM),                                     X04338802
               LENGTH=024                                               04338902
**********************************************************************  04339002
**********************************************************************  04339102
ASEL06  DFHMDF POS=(13,001),                                           X04339209
               COLOR=GREEN,                                            X04339302
               HILIGHT=UNDERLINE,                                      X04339402
               ATTRB=(UNPROT,NORM),                                    X04339502
               LENGTH=001                                               04339602
AACT06  DFHMDF POS=(13,003),                                           X04339709
               ATTRB=(ASKIP),                                          X04339802
               LENGTH=001                                               04339902
AOPER06 DFHMDF POS=(13,005),                                           X04340009
               COLOR=BLUE,                                             X04340102
               ATTRB=(ASKIP,NORM),                                     X04340202
               LENGTH=004                                               04340302
ASYS06  DFHMDF POS=(13,010),                                           X04340409
               COLOR=BLUE,                                             X04340502
               ATTRB=(ASKIP,NORM),                                     X04340602
               LENGTH=003                                               04340702
ASTAT06 DFHMDF POS=(13,014),                                           X04340809
               COLOR=BLUE,                                             X04340902
               ATTRB=(ASKIP,NORM),                                     X04341002
               LENGTH=002                                               04341102
AFROM06 DFHMDF POS=(13,017),                                           X04341209
               COLOR=BLUE,                                             X04341302
               ATTRB=(ASKIP,NORM),                                     X04341402
               LENGTH=010                                               04341502
ATODT06 DFHMDF POS=(13,028),                                           X04341609
               COLOR=BLUE,                                             X04341702
               ATTRB=(ASKIP,NORM),                                     X04341802
               LENGTH=010                                               04341902
AQTY06  DFHMDF POS=(13,039),                                           X04342009
               COLOR=BLUE,                                             X04342102
               ATTRB=(ASKIP,NORM),                                     X04342202
               LENGTH=008                                               04342302
APCNT06 DFHMDF POS=(13,048),                                           X04342409
               COLOR=BLUE,                                             X04342502
               ATTRB=(ASKIP,NORM),                                     X04342602
               LENGTH=006                                               04342702
ATEXT06 DFHMDF POS=(13,055),                                           X04342809
               COLOR=BLUE,                                             X04342902
               ATTRB=(ASKIP,NORM),                                     X04343002
               LENGTH=024                                               04343102
**********************************************************************  04343202
**********************************************************************  04343302
ASEL07  DFHMDF POS=(14,001),                                           X04343409
               COLOR=GREEN,                                            X04343502
               HILIGHT=UNDERLINE,                                      X04343602
               ATTRB=(UNPROT,NORM),                                    X04343702
               LENGTH=001                                               04343802
AACT07  DFHMDF POS=(14,003),                                           X04343909
               ATTRB=(ASKIP),                                          X04344002
               LENGTH=001                                               04344102
AOPER07 DFHMDF POS=(14,005),                                           X04344209
               COLOR=BLUE,                                             X04344302
               ATTRB=(ASKIP,NORM),                                     X04344402
               LENGTH=004                                               04344502
ASYS07  DFHMDF POS=(14,010),                                           X04344609
               COLOR=BLUE,                                             X04344702
               ATTRB=(ASKIP,NORM),                                     X04344802
               LENGTH=003                                               04344902
ASTAT07 DFHMDF POS=(14,014),                                           X04345009
               COLOR=BLUE,                                             X04345102
               ATTRB=(ASKIP,NORM),                                     X04345202
               LENGTH=002                                               04345302
AFROM07 DFHMDF POS=(14,017),                                           X04345409
               COLOR=BLUE,                                             X04345502
               ATTRB=(ASKIP,NORM),                                     X04345602
               LENGTH=010                                               04345702
ATODT07 DFHMDF POS=(14,028),                                           X04345809
               COLOR=BLUE,                                             X04345902
               ATTRB=(ASKIP,NORM),                                     X04346002
               LENGTH=010                                               04346102
AQTY07  DFHMDF POS=(14,039),                                           X04346209
               COLOR=BLUE,                                             X04346302
               ATTRB=(ASKIP,NORM),                                     X04346402
               LENGTH=008                                               04346502
APCNT07 DFHMDF POS=(14,048),                                           X04346609
               COLOR=BLUE,                                             X04346702
               ATTRB=(ASKIP,NORM),                                     X04346802
               LENGTH=006                                               04346902
ATEXT07 DFHMDF POS=(14,055),                                           X04347009
               COLOR=BLUE,                                             X04347102
               ATTRB=(ASKIP,NORM),                                     X04347202
               LENGTH=024                                               04347302
**********************************************************************  04347402
**********************************************************************  04347502
ASEL08  DFHMDF POS=(15,001),                                           X04347609
               COLOR=GREEN,                                            X04347702
               HILIGHT=UNDERLINE,                                      X04347802
               ATTRB=(UNPROT,NORM),                                    X04347902
               LENGTH=001                                               04348002
AACT08  DFHMDF POS=(15,003),                                           X04348109
               ATTRB=(ASKIP),                                          X04348202
               LENGTH=001                                               04348302
AOPER08 DFHMDF POS=(15,005),                                           X04348409
               COLOR=BLUE,                                             X04348502
               ATTRB=(ASKIP,NORM),                                     X04348602
               LENGTH=004                                               04348702
ASYS08  DFHMDF POS=(15,010),                                           X04348809
               COLOR=BLUE,                                             X04348902
               ATTRB=(ASKIP,NORM),                                     X04349002
               LENGTH=003                                               04349102
ASTAT08 DFHMDF POS=(15,014),                                           X04349209
               COLOR=BLUE,                                             X04349302
               ATTRB=(ASKIP,NORM),                                     X04349402
               LENGTH=002                                               04349502
AFROM08 DFHMDF POS=(15,017),                                           X04349609
               COLOR=BLUE,                                             X04349702
               ATTRB=(ASKIP,NORM),                                     X04349802
               LENGTH=010                                               04349902
ATODT08 DFHMDF POS=(15,028),                                           X04350009
               COLOR=BLUE,                                             X04350102
               ATTRB=(ASKIP,NORM),                                     X04350202
               LENGTH=010                                               04350302
AQTY08  DFHMDF POS=(15,039),                                           X04350409
               COLOR=BLUE,                                             X04350502
               ATTRB=(ASKIP,NORM),                                     X04350602
               LENGTH=008                                               04350702
APCNT08 DFHMDF POS=(15,048),                                           X04350809
               COLOR=BLUE,                                             X04350902
               ATTRB=(ASKIP,NORM),                                     X04351002
               LENGTH=006                                               04351102
ATEXT08 DFHMDF POS=(15,055),                                           X04351209
               COLOR=BLUE,                                             X04351302
               ATTRB=(ASKIP,NORM),                                     X04351402
               LENGTH=024                                               04351502
**********************************************************************  04351602
**********************************************************************  04351702
ASEL09  DFHMDF POS=(16,001),                                           X04351809
               COLOR=GREEN,                                            X04351902
               HILIGHT=UNDERLINE,                                      X04352002
               ATTRB=(UNPROT,NORM),                                    X04352102
               LENGTH=001                                               04352202
AACT09  DFHMDF POS=(16,003),                                           X04352309
               ATTRB=(ASKIP),                                          X04352402
               LENGTH=001                                               04352502
AOPER09 DFHMDF POS=(16,005),                                           X04352609
               COLOR=BLUE,                                             X04352702
               ATTRB=(ASKIP,NORM),                                     X04352802
               LENGTH=004                                               04352902
ASYS09  DFHMDF POS=(16,010),                                           X04353009
               COLOR=BLUE,                                             X04353102
               ATTRB=(ASKIP,NORM),                                     X04353202
               LENGTH=003                                               04353302
ASTAT09 DFHMDF POS=(16,014),                                           X04353409
               COLOR=BLUE,                                             X04353502
               ATTRB=(ASKIP,NORM),                                     X04353602
               LENGTH=002                                               04353702
AFROM09 DFHMDF POS=(16,017),                                           X04353809
               COLOR=BLUE,                                             X04353902
               ATTRB=(ASKIP,NORM),                                     X04354002
               LENGTH=010                                               04354102
ATODT09 DFHMDF POS=(16,028),                                           X04354209
               COLOR=BLUE,                                             X04354302
               ATTRB=(ASKIP,NORM),                                     X04354402
               LENGTH=010                                               04354502
AQTY09  DFHMDF POS=(16,039),                                           X04354609
               COLOR=BLUE,                                             X04354702
               ATTRB=(ASKIP,NORM),                                     X04354802
               LENGTH=008                                               04354902
APCNT09 DFHMDF POS=(16,048),                                           X04355009
               COLOR=BLUE,                                             X04355102
               ATTRB=(ASKIP,NORM),                                     X04355202
               LENGTH=006                                               04355302
ATEXT09 DFHMDF POS=(16,055),                                           X04355409
               COLOR=BLUE,                                             X04355502
               ATTRB=(ASKIP,NORM),                                     X04355602
               LENGTH=024                                               04355702
**********************************************************************  04355802
**********************************************************************  04355902
ASEL10  DFHMDF POS=(17,001),                                           X04356009
               COLOR=GREEN,                                            X04356102
               HILIGHT=UNDERLINE,                                      X04356202
               ATTRB=(UNPROT,NORM),                                    X04356302
               LENGTH=001                                               04356402
AACT10  DFHMDF POS=(17,003),                                           X04356509
               ATTRB=(ASKIP),                                          X04356602
               LENGTH=001                                               04356702
AOPER10 DFHMDF POS=(17,005),                                           X04356809
               COLOR=BLUE,                                             X04356902
               ATTRB=(ASKIP,NORM),                                     X04357002
               LENGTH=004                                               04357102
ASYS10  DFHMDF POS=(17,010),                                           X04357209
               COLOR=BLUE,                                             X04357302
               ATTRB=(ASKIP,NORM),                                     X04357402
               LENGTH=003                                               04357502
ASTAT10 DFHMDF POS=(17,014),                                           X04357609
               COLOR=BLUE,                                             X04357702
               ATTRB=(ASKIP,NORM),                                     X04357802
               LENGTH=002                                               04357902
AFROM10 DFHMDF POS=(17,017),                                           X04358009
               COLOR=BLUE,                                             X04358102
               ATTRB=(ASKIP,NORM),                                     X04358202
               LENGTH=010                                               04358302
ATODT10 DFHMDF POS=(17,028),                                           X04358409
               COLOR=BLUE,                                             X04358502
               ATTRB=(ASKIP,NORM),                                     X04358602
               LENGTH=010                                               04358702
AQTY10  DFHMDF POS=(17,039),                                           X04358809
               COLOR=BLUE,                                             X04358902
               ATTRB=(ASKIP,NORM),                                     X04359002
               LENGTH=008                                               04359102
APCNT10 DFHMDF POS=(17,048),                                           X04359209
               COLOR=BLUE,                                             X04359302
               ATTRB=(ASKIP,NORM),                                     X04359402
               LENGTH=006                                               04359502
ATEXT10 DFHMDF POS=(17,055),                                           X04359609
               COLOR=BLUE,                                             X04359702
               ATTRB=(ASKIP,NORM),                                     X04359802
               LENGTH=024                                               04359902
**********************************************************************  04364202
**********************************************************************  04364302
**********************************************************************  04364402
         DFHMDF POS=(19,045),                                          X04364502
               COLOR=NEUTRAL,                                          X04364602
               ATTRB=(ASKIP,NORM),                                     X04364702
               LENGTH=025,                                             X04365002
               INITIAL='NUMBER OF SELECTED ITEMS:'                      04370002
ASELIT   DFHMDF POS=(19,072),                                          X04380002
               COLOR=BLUE,                                             X04390002
               ATTRB=(ASKIP,NORM),                                     X04400002
               LENGTH=007,                                             X04410002
               PICOUT='ZZZ,ZZ9'                                         04420002
         DFHMSD TYPE=FINAL                                              04430002
         END                                                            04440002
