*          DATA SET CNKM208    AT LEVEL 002 AS OF 03/21/94                      
*          DATA SET CNKM208    AT LEVEL 001 AS OF 10/21/93              00001**1
*          DATA SET CNKM208    AT LEVEL 001 AS OF 05/14/93              00002**1
  PRINT  NOGEN                                                          00003**1
*-------------------------------------------------------------------*   00004**1
*                                                                   *   00005**1
*        MAPSET  CNKM208                                            *   00006**1
*        MAP     CN208A                                             *   00007**1
*        PROGRAM CNKCS208                                           *   00008**1
*        TRANSID Y208                                               *   00009**1
*        SYSTEM  CICS ARCH - ASSIGN DEPARTMENT/CLASS FACILITY LOC   *   00010**1
*                                                                   *   00011**1
*-------------------------------------------------------------------*   00012**1
CNKM208 DFHMSD TYPE=DSECT,                                             X00013**1
               LANG=COBOL,                                             X00014**1
               MODE=INOUT,                                             X00015**1
               STORAGE=AUTO,                                           X00016**1
               TIOAPFX=YES,                                            X00017**1
               TERM=3270-2                                              00018**1
CN208A  DFHMDI LINE=2,COLUMN=1,                                        X00019**1
               SIZE=(19,80),                                           X00020**1
               CTRL=(FREEKB),                                          X00021**1
               MAPATTS=(COLOR,HILIGHT),                                X00022**1
               DSATTS=(COLOR,HILIGHT)                                   00023**1
*                                                                       00024**1
        DFHMDF POS=(03,07),                                            X00025**1
               LENGTH=10,                                              X00026**1
               ATTRB=(ASKIP,BRT),                                      X00027**1
               INITIAL='OPER UNIT:'                                     00028**1
AOPER   DFHMDF POS=(03,18),                                            X00029**1
               LENGTH=4,                                               X00030**1
               ATTRB=(ASKIP,NORM),                                     X00031**1
               COLOR=BLUE                                               00032**1
        DFHMDF POS=(03,25),                                            X00033**1
               LENGTH=06,                                              X00034**1
               ATTRB=(ASKIP,BRT),                                      X00035**1
               INITIAL='FCLTY:'                                         00036**1
AFCLTY  DFHMDF POS=(03,34),                                            X00037**1
               LENGTH=4,                                               X00038**1
               PICOUT='ZZZZ',                                          X00039**1
               ATTRB=(ASKIP,NORM),                                     X00040**1
               COLOR=BLUE                                               00041**1
AFDESC  DFHMDF POS=(03,39),                                            X00042**1
               LENGTH=25,                                              X00043**1
               ATTRB=(ASKIP,NORM),                                     X00044**1
               COLOR=BLUE                                               00045**1
*                                                                       00046**1
        DFHMDF POS=(04,07),                                            X00047**1
               LENGTH=30,                                              X00048**1
               ATTRB=(ASKIP,BRT),                                      X00049**1
               INITIAL='DEPARTMENT...................:',               X00050**1
               COLOR=NEUTRAL                                            00051**1
ADEPT   DFHMDF POS=(04,39),                                            X00052**1
               LENGTH=3,                                               X00053**1
               ATTRB=(UNPROT,IC),                                      X00054**1
               COLOR=GREEN,                                            X00055**1
               HILIGHT=UNDERLINE                                        00056**1
        DFHMDF POS=(04,43),                                            X00057**1
               LENGTH=1,                                               X00058**1
               ATTRB=ASKIP                                              00059**1
*                                                                       00060**1
        DFHMDF POS=(05,07),                                            X00061**1
               LENGTH=30,                                              X00062**1
               ATTRB=(ASKIP,BRT),                                      X00063**1
               INITIAL='CLASS........................:',               X00064**1
               COLOR=NEUTRAL                                            00065**1
ACLAS   DFHMDF POS=(05,39),                                            X00066**1
               LENGTH=2,                                               X00067**1
               ATTRB=UNPROT,                                           X00068**1
               COLOR=GREEN,                                            X00069**1
               HILIGHT=UNDERLINE                                        00070**1
        DFHMDF POS=(05,42),                                            X00071**1
               LENGTH=1,                                               X00072**1
               ATTRB=ASKIP                                              00073**1
*                                                                       00074**1
        DFHMDF POS=(06,07),                                            X00075**1
               LENGTH=30,                                              X00076**1
               ATTRB=(ASKIP,BRT),                                      X00077**1
               INITIAL='FACILITY AREA TYPE...........:',               X00078**1
               COLOR=NEUTRAL                                            00079**1
ATYPE   DFHMDF POS=(06,39),                                            X00080**1
               LENGTH=2,                                               X00081**1
               ATTRB=UNPROT,                                           X00082**1
               COLOR=GREEN,                                            X00083**1
               HILIGHT=UNDERLINE                                        00084**1
        DFHMDF POS=(06,42),                                            X00085**1
               LENGTH=1,                                               X00086**1
               ATTRB=ASKIP                                              00087**1
*                                                                       00088**1
        DFHMDF POS=(07,07),                                            X00089**1
               LENGTH=30,                                              X00090**1
               ATTRB=(ASKIP,BRT),                                      X00091**1
               INITIAL='FACILITY AREA................:',               X00092**1
               COLOR=NEUTRAL                                            00093**1
ALOC    DFHMDF POS=(07,39),                                            X00094**1
               LENGTH=6,                                               X00095**1
               ATTRB=UNPROT,                                           X00096**1
               COLOR=GREEN,                                            X00097**1
               HILIGHT=UNDERLINE                                        00098**1
        DFHMDF POS=(07,46),                                            X00099**1
               LENGTH=1,                                               X00100**1
               ATTRB=ASKIP                                              00101**1
*                                                                       00102**1
        DFHMDF POS=(08,07),                                            X00103**1
               LENGTH=30,                                              X00104**1
               ATTRB=(ASKIP,BRT),                                      X00105**1
               INITIAL='RANK.........................:',               X00106**1
               COLOR=NEUTRAL                                            00107**1
ARANK   DFHMDF POS=(08,39),                                            X00108**1
               LENGTH=1,                                               X00109**1
               ATTRB=UNPROT,                                           X00110**1
               COLOR=GREEN,                                            X00111**1
               HILIGHT=UNDERLINE,                                      X00112**1
               PICOUT='9'                                               00113**1
        DFHMDF POS=(08,41),                                            X00114**1
               LENGTH=1,                                               X00115**1
               ATTRB=ASKIP                                              00116**1
*                                                                       00117**1
        DFHMDF POS=(09,07),                                            X00118**1
               LENGTH=30,                                              X00119**1
               ATTRB=(ASKIP,BRT),                                      X00120**1
               INITIAL='FACILITY AREA DESCRIPTION....:',               X00121**1
               COLOR=NEUTRAL                                            00122**1
ADESC   DFHMDF POS=(09,39),                                            X00123**1
               LENGTH=30,                                              X00124**1
               ATTRB=ASKIP,                                            X00125**1
               COLOR=BLUE                                               00126**1
*                                                                       00127**1
        DFHMDF POS=(10,07),                                            X00128**1
               LENGTH=30,                                              X00129**1
               ATTRB=(ASKIP,BRT),                                      X00130**1
               INITIAL='OPERATION SET ID.............:',               X00131**1
               COLOR=NEUTRAL                                            00132**1
AOPSET  DFHMDF POS=(10,39),                                            X00133**1
               LENGTH=3,                                               X00134**1
               ATTRB=UNPROT,                                           X00135**1
               COLOR=GREEN,                                            X00136**1
               HILIGHT=UNDERLINE,                                      X00137**1
               PICOUT='ZZZ'                                             00138**1
        DFHMDF POS=(10,43),                                            X00139**2
               LENGTH=1,                                               X00140**1
               ATTRB=ASKIP                                              00141**1
*                                                                       00142**1
        DFHMDF POS=(11,07),                                            X00143**1
               LENGTH=30,                                              X00144**1
               ATTRB=(ASKIP,BRT),                                      X00145**1
               INITIAL='OPERATION SET DESCRIPTION....:',               X00146**1
               COLOR=NEUTRAL                                            00147**1
AOPSDES DFHMDF POS=(11,39),                                            X00148**1
               LENGTH=25,                                              X00149**1
               ATTRB=ASKIP,                                            X00150**1
               COLOR=BLUE                                               00151**1
*                                                                       00152**1
        DFHMSD TYPE=FINAL                                               00153**1
        END                                                             00154**1
