*          DATA SET CNKM249                                             00001001
        PRINT  NOGEN                                                    00002001
*-------------------------------------------------------------------*   00003001
*                                                                   *   00004001
*        MAPSET  CNKM249                                            *   00005001
*        MAP     CNK249                                             *   00006001
*        PROGRAM CNKCS249                                           *   00007001
*        TRANSID Y249 - DC-INTEGRATION PARM ELEMENT ADD/UPDATE      *   00008001
*                                                                   *   00009001
*-------------------------------------------------------------------*   00009101
CNKM249 DFHMSD TYPE=DSECT,                                             X00009201
               LANG=COBOL,                                             X00009301
               MODE=INOUT,                                             X00009401
               STORAGE=AUTO,                                           X00009501
               TERM=3270-2,                                            X00009601
               TIOAPFX=YES                                              00009701
**********************************************************************  00009801
CNK249  DFHMDI LINE=2,COLUMN=1,                                        X00009901
               SIZE=(19,80),                                           X00010001
               CTRL=(FREEKB),                                          X00010101
               MAPATTS=(COLOR,HILIGHT),                                X00010201
               DSATTS=(COLOR,HILIGHT)                                   00010301
**********************************************************************  00010401
**********************************************************************  00010501
         DFHMDF POS=(02,01),                                           X00010608
               LENGTH=10,                                              X00010701
               ATTRB=(ASKIP,NORM),                                     X00010801
               COLOR=NEUTRAL,                                          X00010901
               INITIAL='PARM NAME:'                                     00011001
APRMNME  DFHMDF POS=(02,13),                                           X00011101
               LENGTH=10,                                              X00011201
               ATTRB=(ASKIP,NORM),                                     X00011301
               COLOR=BLUE                                               00011401
APRMDSC  DFHMDF POS=(02,24),                                           X00011501
               LENGTH=25,                                              X00011601
               ATTRB=(ASKIP,NORM),                                     X00011701
               COLOR=BLUE                                               00011801
**********************************************************************  00011901
         DFHMDF POS=(03,01),                                           X00012002
               LENGTH=21,                                              X00012101
               ATTRB=(ASKIP,NORM),                                     X00012201
               COLOR=NEUTRAL,                                          X00012301
               INITIAL='ATTR ELEM SEQUENCE..:'                          00012401
AELMSEQ  DFHMDF POS=(03,24),                                           X00012501
               LENGTH=04,                                              X00012601
               ATTRB=(ASKIP,NORM),                                     X00012701
               COLOR=YELLOW                                             00012811
         DFHMDF POS=(03,33),                                           X00013201
               LENGTH=15,                                              X00013301
               ATTRB=(ASKIP,NORM),                                     X00013401
               COLOR=NEUTRAL,                                          X00013501
               INITIAL='TOTAL DEFN SEQ:'                                00013601
ATOTDEF  DFHMDF POS=(03,49),                                           X00013701
               LENGTH=04,                                              X00013801
               ATTRB=(ASKIP,NORM),                                     X00013901
               COLOR=BLUE                                               00014001
         DFHMDF POS=(03,054),                                          X00014118
               ATTRB=(ASKIP,DRK),                                      X00014201
               LENGTH=001                                               00014301
**********************************************************************  00014401
**********************************************************************  00014501
        DFHMDF POS=(04,05),                                            X00014606
               ATTRB=(ASKIP,NORM),                                     X00014701
               COLOR=NEUTRAL,                                          X00014801
               LENGTH=004,                                             X00014901
               INITIAL='DEFN'                                           00015001
        DFHMDF POS=(04,10),                                            X00015105
               ATTRB=(ASKIP,NORM),                                     X00015201
               COLOR=NEUTRAL,                                          X00015301
               LENGTH=004,                                             X00015401
               INITIAL='DATA'                                           00015501
        DFHMDF POS=(04,15),                                            X00015605
               ATTRB=(ASKIP,NORM),                                     X00015701
               COLOR=NEUTRAL,                                          X00015801
               LENGTH=007,                                             X00015901
               INITIAL='ELEMENT'                                        00016001
        DFHMDF POS=(04,28),                                            X00016105
               ATTRB=(ASKIP,NORM),                                     X00016205
               COLOR=NEUTRAL,                                          X00016305
               LENGTH=007,                                             X00016405
               INITIAL='ELEMENT'                                        00016505
        DFHMDF POS=(04,51),                                            X00016601
               LENGTH=05,                                              X00016701
               ATTRB=(ASKIP,NORM),                                     X00016801
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00016901
ASTRTIT DFHMDF POS=(04,57),                                            X00017001
               LENGTH=05,                                              X00017101
               ATTRB=(NUM,UNPROT,NORM),                                X00017201
               COLOR=GREEN,                                            X00018001
               PICOUT='ZZZZ9',                                         X00019001
               HILIGHT=UNDERLINE                                        00020001
        DFHMDF POS=(04,63),                                            X00021001
               LENGTH=02,                                              X00022001
               ATTRB=(ASKIP,NORM),                                     X00022101
               COLOR=NEUTRAL,                                          X00022201
               INITIAL='TO'                                             00022301
AENDIT  DFHMDF POS=(04,66),                                            X00022401
               LENGTH=05,                                              X00022501
               ATTRB=(ASKIP,NORM),                                     X00022601
               COLOR=BLUE,                                             X00022701
               PICOUT='ZZZZ9'                                           00022801
        DFHMDF POS=(04,72),                                            X00022901
               LENGTH=02,                                              X00023001
               ATTRB=(ASKIP,NORM),                                     X00023101
               COLOR=NEUTRAL,                                          X00023201
               INITIAL='OF'                                             00023301
ATOTIT  DFHMDF POS=(04,75),                                            X00023401
               LENGTH=05,                                              X00023501
               ATTRB=(ASKIP,NORM),                                     X00023601
               COLOR=BLUE,                                             X00023701
               PICOUT='ZZZZ9'                                           00023801
**********************************************************************  00023901
**********************************************************************  00025501
        DFHMDF POS=(05,01),                                            X00025601
               ATTRB=(ASKIP,NORM),                                     X00025701
               COLOR=NEUTRAL,                                          X00025801
               LENGTH=001,                                             X00025905
               INITIAL='S'                                              00026005
        DFHMDF POS=(05,03),                                            X00026105
               ATTRB=(ASKIP,NORM),                                     X00026201
               COLOR=NEUTRAL,                                          X00026301
               LENGTH=001,                                             X00026405
               INITIAL='A'                                              00026505
        DFHMDF POS=(05,06),                                            X00026605
               ATTRB=(ASKIP,NORM),                                     X00026701
               COLOR=NEUTRAL,                                          X00026801
               LENGTH=003,                                             X00026901
               INITIAL='SEQ'                                            00027001
        DFHMDF POS=(05,10),                                            X00027605
               ATTRB=(ASKIP,NORM),                                     X00027701
               COLOR=NEUTRAL,                                          X00027801
               LENGTH=004,                                             X00027901
               INITIAL='TYPE'                                           00028001
        DFHMDF POS=(05,15),                                            X00028105
               ATTRB=(ASKIP,NORM),                                     X00028201
               COLOR=NEUTRAL,                                          X00028301
               LENGTH=011,                                             X00028405
               INITIAL='DESCRIPTION'                                    00028505
        DFHMDF POS=(05,28),                                            X00028605
               ATTRB=(ASKIP,NORM),                                     X00028705
               COLOR=NEUTRAL,                                          X00028805
               LENGTH=007,                                             X00028905
               INITIAL='VALUE'                                          00029005
**********************************************************************  00029101
**********************************************************************  00029201
ASEL01  DFHMDF POS=(06,001),                                           X00029301
               COLOR=GREEN,                                            X00029401
               HILIGHT=UNDERLINE,                                      X00029501
               ATTRB=(UNPROT,NORM),                                    X00029601
               LENGTH=001                                               00029701
AACT01  DFHMDF POS=(06,003),                                           X00029803
               ATTRB=(ASKIP),                                          X00029901
               LENGTH=001                                               00030003
ADFSQ01 DFHMDF POS=(06,005),                                           X00030103
               COLOR=BLUE,                                             X00030201
               ATTRB=(ASKIP,NORM),                                     X00030301
               LENGTH=004                                               00030401
ADTYP01 DFHMDF POS=(06,010),                                           X00030503
               COLOR=BLUE,                                             X00030601
               ATTRB=(ASKIP,NORM),                                     X00030701
               LENGTH=003                                               00030804
ADESC01 DFHMDF POS=(06,015),                                           X00030903
               COLOR=BLUE,                                             X00031003
               ATTRB=(ASKIP,NORM),                                     X00031103
               LENGTH=012                                               00031203
AVALU01 DFHMDF POS=(06,028),                                           X00031303
               COLOR=GREEN,                                            X00031415
               HILIGHT=UNDERLINE,                                      X00031515
               ATTRB=(UNPROT,NORM),                                    X00031617
               LENGTH=050                                               00031901
        DFHMDF POS=(06,079),                                           X00032009
               COLOR=BLUE,                                             X00032109
               ATTRB=(ASKIP,NORM),                                     X00032209
               LENGTH=001                                               00032309
**********************************************************************  00032401
**********************************************************************  00032501
ASEL02  DFHMDF POS=(07,001),                                           X00032601
               COLOR=GREEN,                                            X00032701
               HILIGHT=UNDERLINE,                                      X00032801
               ATTRB=(UNPROT,NORM),                                    X00032901
               LENGTH=001                                               00033001
AACT02  DFHMDF POS=(07,003),                                           X00034303
               ATTRB=(ASKIP),                                          X00034401
               LENGTH=001                                               00034503
ADFSQ02 DFHMDF POS=(07,005),                                           X00034603
               COLOR=BLUE,                                             X00034701
               ATTRB=(ASKIP,NORM),                                     X00034801
               LENGTH=004                                               00034901
ADTYP02 DFHMDF POS=(07,010),                                           X00035003
               COLOR=BLUE,                                             X00035101
               ATTRB=(ASKIP,NORM),                                     X00035201
               LENGTH=003                                               00035304
ADESC02 DFHMDF POS=(07,015),                                           X00035403
               COLOR=BLUE,                                             X00035503
               ATTRB=(ASKIP,NORM),                                     X00035603
               LENGTH=012                                               00035703
AVALU02 DFHMDF POS=(07,028),                                           X00035803
               COLOR=GREEN,                                            X00035915
               HILIGHT=UNDERLINE,                                      X00036015
               ATTRB=(UNPROT,NORM),                                    X00036117
               LENGTH=050                                               00036401
        DFHMDF POS=(07,079),                                           X00036509
               COLOR=BLUE,                                             X00036609
               ATTRB=(ASKIP,NORM),                                     X00036709
               LENGTH=001                                               00036809
**********************************************************************  00036901
**********************************************************************  00037001
ASEL03  DFHMDF POS=(08,001),                                           X00037101
               COLOR=GREEN,                                            X00037201
               HILIGHT=UNDERLINE,                                      X00037301
               ATTRB=(UNPROT,NORM),                                    X00037401
               LENGTH=001                                               00037501
AACT03  DFHMDF POS=(08,003),                                           X00037803
               ATTRB=(ASKIP),                                          X00037901
               LENGTH=001                                               00038003
ADFSQ03 DFHMDF POS=(08,005),                                           X00038107
               COLOR=BLUE,                                             X00038201
               ATTRB=(ASKIP,NORM),                                     X00038301
               LENGTH=004                                               00038401
ADTYP03 DFHMDF POS=(08,010),                                           X00038503
               COLOR=BLUE,                                             X00038601
               ATTRB=(ASKIP,NORM),                                     X00038701
               LENGTH=003                                               00038804
ADESC03 DFHMDF POS=(08,015),                                           X00038903
               COLOR=BLUE,                                             X00039003
               ATTRB=(ASKIP,NORM),                                     X00039103
               LENGTH=012                                               00039203
AVALU03 DFHMDF POS=(08,028),                                           X00039303
               COLOR=GREEN,                                            X00039415
               HILIGHT=UNDERLINE,                                      X00039515
               ATTRB=(UNPROT,NORM),                                    X00039618
               LENGTH=050                                               00039901
        DFHMDF POS=(08,079),                                           X00040009
               COLOR=BLUE,                                             X00040109
               ATTRB=(ASKIP,NORM),                                     X00040209
               LENGTH=001                                               00040309
**********************************************************************  00040401
**********************************************************************  00040501
ASEL04  DFHMDF POS=(09,001),                                           X00040601
               COLOR=GREEN,                                            X00040701
               HILIGHT=UNDERLINE,                                      X00040801
               ATTRB=(UNPROT,NORM),                                    X00040901
               LENGTH=001                                               00041001
AACT04  DFHMDF POS=(09,003),                                           X00041103
               ATTRB=(ASKIP),                                          X00041201
               LENGTH=001                                               00041303
ADFSQ04 DFHMDF POS=(09,005),                                           X00041403
               COLOR=BLUE,                                             X00041501
               ATTRB=(ASKIP,NORM),                                     X00041601
               LENGTH=004                                               00041701
ADTYP04 DFHMDF POS=(09,010),                                           X00041803
               COLOR=BLUE,                                             X00041901
               ATTRB=(ASKIP,NORM),                                     X00042001
               LENGTH=003                                               00042104
ADESC04 DFHMDF POS=(09,015),                                           X00042203
               COLOR=BLUE,                                             X00042303
               ATTRB=(ASKIP,NORM),                                     X00042403
               LENGTH=012                                               00042503
AVALU04 DFHMDF POS=(09,028),                                           X00042603
               COLOR=GREEN,                                            X00042715
               HILIGHT=UNDERLINE,                                      X00042815
               ATTRB=(UNPROT,NORM),                                    X00042917
               LENGTH=050                                               00043201
        DFHMDF POS=(09,079),                                           X00043309
               COLOR=BLUE,                                             X00043409
               ATTRB=(ASKIP,NORM),                                     X00043509
               LENGTH=001                                               00043609
**********************************************************************  00043701
**********************************************************************  00043801
ASEL05  DFHMDF POS=(10,001),                                           X00043901
               COLOR=GREEN,                                            X00044001
               HILIGHT=UNDERLINE,                                      X00044101
               ATTRB=(UNPROT,NORM),                                    X00044201
               LENGTH=001                                               00044301
AACT05  DFHMDF POS=(10,003),                                           X00044403
               ATTRB=(ASKIP),                                          X00044501
               LENGTH=001                                               00044603
ADFSQ05 DFHMDF POS=(10,005),                                           X00044703
               COLOR=BLUE,                                             X00044801
               ATTRB=(ASKIP,NORM),                                     X00044901
               LENGTH=004                                               00045001
ADTYP05 DFHMDF POS=(10,010),                                           X00045103
               COLOR=BLUE,                                             X00045201
               ATTRB=(ASKIP,NORM),                                     X00045301
               LENGTH=003                                               00045404
ADESC05 DFHMDF POS=(10,015),                                           X00045503
               COLOR=BLUE,                                             X00045603
               ATTRB=(ASKIP,NORM),                                     X00045703
               LENGTH=012                                               00045803
AVALU05 DFHMDF POS=(10,028),                                           X00045903
               COLOR=GREEN,                                            X00046015
               HILIGHT=UNDERLINE,                                      X00046115
               ATTRB=(UNPROT,NORM),                                    X00046217
               LENGTH=050                                               00046501
        DFHMDF POS=(10,079),                                           X00046609
               COLOR=BLUE,                                             X00046709
               ATTRB=(ASKIP,NORM),                                     X00046809
               LENGTH=001                                               00046909
**********************************************************************  00047001
**********************************************************************  00047101
ASEL06  DFHMDF POS=(11,001),                                           X00047201
               COLOR=GREEN,                                            X00047301
               HILIGHT=UNDERLINE,                                      X00047401
               ATTRB=(UNPROT,NORM),                                    X00047501
               LENGTH=001                                               00047601
AACT06  DFHMDF POS=(11,003),                                           X00047703
               ATTRB=(ASKIP),                                          X00047801
               LENGTH=001                                               00047903
ADFSQ06 DFHMDF POS=(11,005),                                           X00048003
               COLOR=BLUE,                                             X00048101
               ATTRB=(ASKIP,NORM),                                     X00048201
               LENGTH=004                                               00048301
ADTYP06 DFHMDF POS=(11,010),                                           X00048403
               COLOR=BLUE,                                             X00048501
               ATTRB=(ASKIP,NORM),                                     X00048601
               LENGTH=003                                               00048704
ADESC06 DFHMDF POS=(11,015),                                           X00048803
               COLOR=BLUE,                                             X00048903
               ATTRB=(ASKIP,NORM),                                     X00049003
               LENGTH=012                                               00049103
AVALU06 DFHMDF POS=(11,028),                                           X00049203
               COLOR=GREEN,                                            X00049315
               HILIGHT=UNDERLINE,                                      X00049415
               ATTRB=(UNPROT,NORM),                                    X00049517
               LENGTH=050                                               00049801
        DFHMDF POS=(11,079),                                           X00049909
               COLOR=BLUE,                                             X00050009
               ATTRB=(ASKIP,NORM),                                     X00050109
               LENGTH=001                                               00050209
**********************************************************************  00050301
**********************************************************************  00050401
ASEL07  DFHMDF POS=(12,001),                                           X00050501
               COLOR=GREEN,                                            X00050601
               HILIGHT=UNDERLINE,                                      X00050701
               ATTRB=(UNPROT,NORM),                                    X00050801
               LENGTH=001                                               00050901
AACT07  DFHMDF POS=(12,003),                                           X00051003
               ATTRB=(ASKIP),                                          X00051101
               LENGTH=001                                               00051203
ADFSQ07 DFHMDF POS=(12,005),                                           X00051303
               COLOR=BLUE,                                             X00051401
               ATTRB=(ASKIP,NORM),                                     X00051501
               LENGTH=004                                               00051601
ADTYP07 DFHMDF POS=(12,010),                                           X00051703
               COLOR=BLUE,                                             X00051801
               ATTRB=(ASKIP,NORM),                                     X00051901
               LENGTH=003                                               00052004
ADESC07 DFHMDF POS=(12,015),                                           X00052103
               COLOR=BLUE,                                             X00052203
               ATTRB=(ASKIP,NORM),                                     X00052303
               LENGTH=012                                               00052403
AVALU07 DFHMDF POS=(12,028),                                           X00052503
               COLOR=GREEN,                                            X00052615
               HILIGHT=UNDERLINE,                                      X00052715
               ATTRB=(UNPROT,NORM),                                    X00052817
               LENGTH=050                                               00053101
        DFHMDF POS=(12,079),                                           X00053209
               COLOR=BLUE,                                             X00053309
               ATTRB=(ASKIP,NORM),                                     X00053409
               LENGTH=001                                               00053509
**********************************************************************  00053601
**********************************************************************  00054001
**********************************************************************  00055201
**********************************************************************  00055301
         DFHMDF POS=(19,045),                                          X00070610
               COLOR=NEUTRAL,                                          X00070710
               ATTRB=(ASKIP,NORM),                                     X00070810
               LENGTH=025,                                             X00070910
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00071010
ASELIT   DFHMDF POS=(19,072),                                          X00071110
               COLOR=BLUE,                                             X00071210
               ATTRB=(ASKIP,NORM),                                     X00071310
               LENGTH=007,                                             X00071410
               PICOUT='ZZZ,ZZ9'                                         00071510
**********************************************************************  00071601
**********************************************************************  00071710
         DFHMSD TYPE=FINAL                                              00072001
         END                                                            00080001
