*          DATA SET CNKM220                                             00010000
  PRINT  NOGEN                                                          00020000
*******************************************************************     00030000
*                                                                       00040000
*  CNKM220  MAPSET -  THIS IS THE BMS MAP FOR THE PRINTER TYPE ADD      00050000
*    FUNCTION.                                                          00060000
*                                                                       00070000
*******************************************************************     00080000
CNKM220 DFHMSD TYPE=DSECT,                                             X00090010
               LANG=COBOL,                                             X00100010
               MODE=INOUT,                                             X00110010
               STORAGE=AUTO,                                           X00120010
               TERM=3270-2,                                            X00130010
               TIOAPFX=YES                                              00140000
CNK220  DFHMDI LINE=2,COLUMN=1,                                        X00150010
               SIZE=(19,80),                                           X00160010
               CTRL=(FREEKB),                                          X00170010
               MAPATTS=(COLOR,HILIGHT),                                X00180010
               DSATTS=(COLOR,HILIGHT)                                   00190000
*******************************************************************     00200000
*******************************************************************     00210000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00220003
               INITIAL='OPER UNIT ID..............:',                  X00230000
               COLOR=NEUTRAL,                                          X00240000
               LENGTH=27,                                              X00250000
               POS=(05,15)                                              00260000
AOPERUN  DFHMDF POS=(05,43),                                           X00270000
               LENGTH=4,                                               X00280000
               COLOR=GREEN,                                            X00290004
               ATTRB=UNPROT                                             00300006
AOPERDS  DFHMDF POS=(05,48),                                           X00310000
               LENGTH=25,                                              X00320000
               COLOR=GREEN,                                            X00330004
               ATTRB=UNPROT                                             00340006
        DFHMDF ATTRB=(ASKIP),                                          X00350000
               LENGTH=1,                                               X00360000
               POS=(05,75)                                              00370001
*******************************************************************     00380000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00390003
               INITIAL='FACILITY ID...............:',                  X00400000
               COLOR=NEUTRAL,                                          X00410000
               LENGTH=27,                                              X00420000
               POS=(06,15)                                              00430000
AFCLTY   DFHMDF POS=(06,43),                                           X00440000
               LENGTH=4,                                               X00450000
               COLOR=GREEN,                                            X00460003
               ATTRB=UNPROT                                             00470006
        DFHMDF ATTRB=(ASKIP),                                          X00480000
               LENGTH=1,                                               X00490000
               POS=(06,48)                                              00500007
*******************************************************************     00510000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00520003
               INITIAL='CLUSTER NUMBER............:',                  X00530000
               COLOR=NEUTRAL,                                          X00540000
               LENGTH=27,                                              X00550000
               POS=(07,15)                                              00560000
APCLNBR  DFHMDF POS=(07,43),                                           X00570000
               LENGTH=4,                                               X00580007
               HILIGHT=UNDERLINE,                                      X00590000
               COLOR=GREEN,                                            X00600000
               ATTRB=UNPROT                                             00610006
        DFHMDF ATTRB=(ASKIP),                                          X00620000
               LENGTH=1,                                               X00630000
               POS=(07,48)                                              00640007
*******************************************************************     00650000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00660003
               INITIAL='IP ADDRESS................:',                  X00670000
               COLOR=NEUTRAL,                                          X00680000
               LENGTH=27,                                              X00690000
               POS=(08,15)                                              00700000
AIPADDR1 DFHMDF POS=(08,43),                                           X00710010
               LENGTH=03,                                              X00720010
               HILIGHT=UNDERLINE,                                      X00730000
               COLOR=GREEN,                                            X00740000
               ATTRB=UNPROT                                             00750000
APER1    DFHMDF ATTRB=(ASKIP,NORM),                                    X00760033
               INITIAL='.',                                            X00770029
               COLOR=NEUTRAL,                                          X00780034
               LENGTH=01,                                              X00790027
               POS=(08,47)                                              00800032
AIPADDR2 DFHMDF POS=(08,49),                                           X00810034
               LENGTH=03,                                              X00820010
               HILIGHT=UNDERLINE,                                      X00830010
               COLOR=GREEN,                                            X00840010
               ATTRB=UNPROT                                             00850010
APER2    DFHMDF ATTRB=(ASKIP,NORM),                                    X00860033
               INITIAL='.',                                            X00870029
               COLOR=NEUTRAL,                                          X00880034
               LENGTH=01,                                              X00890029
               POS=(08,53)                                              00900034
AIPADDR3 DFHMDF POS=(08,55),                                           X00910034
               LENGTH=03,                                              X00920010
               HILIGHT=UNDERLINE,                                      X00930010
               COLOR=GREEN,                                            X00940010
               ATTRB=UNPROT                                             00950010
APER3   DFHMDF ATTRB=(ASKIP,NORM),                                     X00960035
               INITIAL='.',                                            X00970029
               COLOR=NEUTRAL,                                          X00980034
               LENGTH=01,                                              X00990029
               POS=(08,59)                                              01000034
AIPADDR4 DFHMDF POS=(08,61),                                           X01010034
               LENGTH=03,                                              X01020010
               HILIGHT=UNDERLINE,                                      X01030010
               COLOR=GREEN,                                            X01040010
               ATTRB=UNPROT                                             01050010
        DFHMDF ATTRB=(ASKIP),                                          X01060000
               LENGTH=0,                                               X01070018
               POS=(08,65)                                              01080034
*******************************************************************     01090000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X01100003
               INITIAL='OPERATING SYS RELEASE CODE:',                  X01110000
               COLOR=NEUTRAL,                                          X01120000
               LENGTH=27,                                              X01130000
               POS=(09,15)                                              01140000
ARLSCDE  DFHMDF POS=(09,43),                                           X01150000
               LENGTH=05,                                              X01160000
               COLOR=GREEN,                                            X01170000
               ATTRB=(ASKIP,NORM)                                       01180028
        DFHMDF ATTRB=(ASKIP),                                          X01190000
               LENGTH=1,                                               X01200000
               POS=(09,49)                                              01210007
*******************************************************************     01220000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X01230003
               INITIAL='DATA XFER MODE ID.........:',                  X01240000
               COLOR=NEUTRAL,                                          X01250000
               LENGTH=27,                                              X01260000
               POS=(10,15)                                              01270000
AXFRMDE  DFHMDF POS=(10,43),                                           X01280000
               LENGTH=2,                                               X01290000
               COLOR=GREEN,                                            X01300000
               ATTRB=(ASKIP,NORM)                                       01310036
        DFHMDF ATTRB=(ASKIP),                                          X01320000
               LENGTH=1,                                               X01330000
               POS=(10,46)                                              01340007
*******************************************************************     01350000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X01360003
               INITIAL='TRANSMIT INTERFACE CODE...:',                  X01370000
               COLOR=NEUTRAL,                                          X01380000
               LENGTH=27,                                              X01390000
               POS=(11,15)                                              01400000
AINTCDE  DFHMDF POS=(11,43),                                           X01410000
               LENGTH=1,                                               X01420000
               HILIGHT=UNDERLINE,                                      X01430000
               COLOR=GREEN,                                            X01440000
               ATTRB=UNPROT                                             01450000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X01460003
               COLOR=NEUTRAL,                                          X01470000
               LENGTH=18,                                              X01480000
               INITIAL='(F=FTP, S=SOCKETS)',                           X01490000
               POS=(11,45)                                              01500000
        DFHMDF ATTRB=(ASKIP),                                          X01510000
               LENGTH=1,                                               X01520000
               POS=(11,67)                                              01530003
*******************************************************************     01540000
         DFHMSD TYPE=FINAL                                              01550000
         END                                                            01560000
