000100******************************************************************00010000
000110**                        CNWS012                                 00011005
000120**                                                                00012005
000200* INTER-APPLICATION COMMUNICATION AREA FOR THE DC DOOR DEFINITION 00020000
000300* SCREENS                                                         00030000
000400* LENGTH = 200 BYTES                                              00040000
000500******************************************************************00050000
000600         10  CN012-INTER-APPL-COMMAREA  REDEFINES                 00060000
000700                                        INTER-APPL-COMM-AREA.     00070000
000800             15  FILLER                     PIC X.                00080000
000900             15  CN012-NUMBER-OF-SELECTED-ITEMS                   00090000
001000                                            PIC S9(09) COMP-3.    00100000
001100             15  CN012-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00110000
001200             15  CN012-SEL-QUEUE-NAME       PIC X(08).            00120000
001300             15  CN012-CURR-OPER-UNT-ID     PIC 9(04).            00130000
001400             15  CN012-CURR-FCLTY-ID        PIC 9(04).            00140000
001410             15  CN012-OPER-UNT-ID          PIC 9(04).            00141001
001420             15  CN012-FCLTY-ID             PIC 9(04).            00142001
001421             15  CN012-FCLTY-NME            PIC X(25).            00142104
001422             15  CN012-FUNCTION             PIC  X(01).           00142204
001440                 88  CN012-ASSIGN-STORES             VALUE 'A'.   00144002
001441                 88  CN012-LIST-STORES               VALUE 'L'.   00144102
001450                 88  CN012-UPD-DOOR                  VALUE 'U'.   00145002
001800             15  FILLER                     PIC X(141).           00180004
