000010******************************************************************        
000011**                        CNWS019                                         
000012**                                                                        
000020*    SELECTION QUEUE FOR THE TKRPRCD CODE LIST SCREEN                     
000040*    MAX LENGTH = 2165 BYTES                                              
000050******************************************************************        
000100                                                                          
000200 01  CN019-SELECT-RECORD.                                                 
000300     05  CN019-SELECTED-ITEMS             PIC S9(5) VALUE ZERO            
000400                                                    COMP-3.               
000500     05  CN019-MAX-ITEMS                  PIC 99    VALUE 20.             
000600     05  CN019-SELECTED-ITEM-ARRAY.                                       
000700         10  FILLER                       OCCURS 20 TIMES                 
000800                                          INDEXED BY CN019-IDX.           
000900             15  CN019-ITEM               PIC S9(9) COMP-3.               
001000             15  CN019-ACTION-SW          PIC X(03).                      
001100                 88  CN019-INQ                      VALUE 'INQ'.          
001200                 88  CN019-UPD                      VALUE 'UPD'.          
001300                 88  CN019-DEL                      VALUE 'DEL'.          
001400                 88  CN019-ERR                      VALUE 'ERR'.          
001500             15  CN019-KEY-DATA.                                          
001700                 20  CN019-FUNC-CODE      PIC X(06).                      
002011                 20  CN019-FUNC-DESC      PIC X(40).                      
003300                 20  CN019-FUNC-TYPE      PIC X(02).                      
003302                     88  CN019-VALID-TYPE  VALUE                          
003303                                           'DT' 'PC' 'QT' 'TX'.           
003304                     88  CN019-TYPE-DATE   VALUE 'DT'.                    
003305                     88  CN019-TYPE-PCNT   VALUE 'PC'.                    
003306                     88  CN019-TYPE-QTY    VALUE 'QT'.                    
003307                     88  CN019-TYPE-TEXT   VALUE 'TX'.                    
003310                 20  CN019-PARM-COUNT     PIC 9(04).                      
003400                 20  FILLER               PIC X(40).                      
004200                                                                          
