000100******************************************************************00010007
000200*    INTER-APPLICATION COMMUNICATION AREA FOR THE CN700 SCREENS   00020013
000300*    LENGTH = 200 BYTES                                           00030007
000400******************************************************************00040007
000500         10  CN162-INTER-APPL-COMMAREA  REDEFINES                 00050013
000600                                        INTER-APPL-COMM-AREA.     00060007
000700             15  FILLER                     PIC X.                00070007
000800             15  CN162-NUMBER-OF-SELECTED-ITEMS                   00080013
000900                                            PIC S9(09) COMP-3.    00090007
001000             15  CN162-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00100013
001100             15  CN162-SEL-QUEUE-NAME       PIC X(08).            00110013
001200             15  CN162-OPER-UNT-ID          PIC S9(04) COMP.      00120013
001300             15  CN162-FCLTY-ID             PIC S9(04) COMP.      00130013
001400             15  CN162-FCLTY-NME            PIC X(25).            00140013
001500             15  CN162-PRTR-ID              PIC X(08).            00150015
001600             15  CN162-CLUSTR-NBR           PIC S9(4)  COMP.      00160018
001700             15  CN162-PRTR-TYP-CDE         PIC X(08).            00170013
001800             15  CN162-PRTR-LOC-DESC        PIC X(25).            00180013
001900             15  CN162-PRTR-PHY-STAT-CDE    PIC X(1).             00190013
002000             15  CN162-IP-ADDRESS           PIC X(15).            00200014
002100             15  CN162-OS-RLSE-CDE          PIC X(05).            00210014
002200             15  CN162-DATA-XFER-MDE        PIC X(2).             00220014
002300             15  CN162-TRANSMIT-CDE         PIC X(01).            00230014
002400             15  CN162-STK-TYP-CDE          PIC X(8).             00240014
002500             15  CN162-STK-TYP-DESC         PIC X(50).            00250014
002510             15  CN162-FUNCTION-SW          PIC X.                00251019
002520                 88  CN162-ADD                  VALUE 'A'.        00252019
002530                 88  CN162-UPD                  VALUE 'U'.        00253019
002540                 88  CN162-DEL                  VALUE 'D'.        00254019
002600             15  FILLER                     PIC X(28).            00260019
