000010******************************************************************        
000011**                        CNWS024                                         
000012**                                                                        
000020*    SELECTION QUEUE FOR THE INTEGRATION PARM CODE LIST SCREEN            
000030*    WST_INTGRTN_TYP                                                      
000040*    MAX LENGTH = 2165 BYTES                                              
000050******************************************************************        
000100                                                                          
000200 01  CN024-SELECT-RECORD.                                                 
000300     05  CN024-SELECTED-ITEMS             PIC S9(5) VALUE ZERO            
000400                                                    COMP-3.               
000500     05  CN024-MAX-ITEMS                  PIC 99    VALUE 26.             
000600     05  CN024-SELECTED-ITEM-ARRAY.                                       
000700         10  FILLER                       OCCURS 26 TIMES                 
000800                                          INDEXED BY CN024-IDX.           
000900             15  CN024-ITEM               PIC S9(9) COMP-3.               
001000             15  CN024-ACTION-SW          PIC X(01).                      
001100                 88  CN024-INQ                      VALUE 'I'.            
001200                 88  CN024-UPD                      VALUE 'U'.            
001300                 88  CN024-DEL                      VALUE 'D'.            
001400                 88  CN024-ERR                      VALUE 'E'.            
001500             15  CN024-KEY-DATA.                                          
001700                 20  CN024-OPER-UNIT      PIC 9(04).                      
001800                 20  CN024-PARM-NAME      PIC X(10).                      
002011                 20  CN024-PARM-DESC      PIC X(50).                      
003300                 20  CN024-PARM-FUNC      PIC X(10).                      
003310                 20  CN024-DEFN-CNT       PIC 9(09).                      
003320                 20  CN024-ELEM-CNT       PIC 9(09).                      
003400                 20  FILLER               PIC X(25).                      
004200                                                                          
