00001 *----------------------------------------------------------------*10/13/93
00002 *                         CNWS004                                *CNWS004 
00003 *                                                                *   LV006
00004 *   THIS IS TS QUEUE RECORD LAYOUT USED IN THE TICKET FORMAT     *CNWS004 
00005 *   LIST PROGRAM TO PASS THE KEYS.                               *CNWS004 
00006 *                                                                *CNWS004 
00007 *----------------------------------------------------------------*CNWS004 
00008                                                                   CNWS004 
00009  01  CN004-TS-SEL-REC.                                            CNWS004 
00010        05  CN004-SELECTED-ITEMS       PIC S9(05)  COMP-3          CNWS004 
00011                                                   VALUE ZERO.     CNWS004 
00012        05  CN004-MAX-ITEMS            PIC  9(02)  VALUE 20.       CNWS004 
00013        05  CN004-SELECTED-ITEM-ARRAY.                             CNWS004 
00014            10  FILLER                 OCCURS 20 TIMES             CNWS004 
00015                                       INDEXED BY CN004-IDX.       CNWS004 
00016                15  CN004-ITEM         PIC S9(09)  COMP-3.         CNWS004 
00017                15  CN004-ACTION-SW    PIC  X(01).                 CNWS004 
00018                    88  CN004-INQ                  VALUE 'I'.      CNWS004 
00019                    88  CN004-UPD                  VALUE 'U'.      CNWS004 
00020                    88  CN004-DEL                  VALUE 'D'.      CNWS004 
00021                    88  CN004-ERR                  VALUE 'E'.      CNWS004 
00022                15  CN004-KEY-DATA.                                CNWS004 
00023                    20  CN004-OPER-UNT-ID PIC S9(04) COMP.            CL**6
00024                    20  CN004-FCLTY-ID PIC S9(04) COMP.               CL**5
00025                    20  CN004-TKT-FMT-ID                              CL**5
00026                                       PIC X(06).                  CNWS004 
