00001 ******************************************************************10/13/93
00002 **                        CNWS001                               **CNWS001 
00003 **                                                              **   LV006
00004 **  THIS IS THE APPLICATION SPECIFIC COMMUNICATION AREA FOR     **CNWS001 
00005 **  PROGRAM CNKCS201                                            **CNWS001 
00006 **          CNKCS202                                            **CNWS001 
00007 **          CNKCS203                                            **CNWS001 
00008 **          CNKCS204                                            **CNWS001 
00009 **          CNKCS205                                            **CNWS001 
00010 **                                                              **CNWS001 
00011 **  LENGTH:  200 BYTES                                          **CNWS001 
00012 ******************************************************************CNWS001 
00013          10  CN001-INTER-APPL-COMMAREA  REDEFINES                 CNWS001 
00014              INTER-APPL-COMM-AREA.                                CNWS001 
00015              15  FILLER               PIC X(01).                     CL**3
00016              15  CN001-OPER-UNT-ID    PIC S9(04) COMP.               CL**6
00017              15  CN001-FCLTY-ID       PIC S9(04) COMP.               CL**5
00018              15  CN001-DEPT-NBR       PIC X(03).                     CL**5
00019              15  CN001-AREA-ID        PIC X(06).                     CL**5
00020              15  CN001-LOC-TYPE       PIC X(02).                     CL**3
00021              15  CN001-TKT-FMT-ID     PIC X(06).                     CL**5
00022              15  CN001-SEL-UNASSIGNED PIC X(01).                  CNWS001 
00023              15  FILLER               PIC X(177).                    CL**4
