000100******************************************************************00010000
000110**                        CNWS020                                 00011000
000120**                                                                00012000
000130* INTER-APPLICATION COMMUNICATION AREA FOR THE TKRPRPM PARM LIST  00013000
000140* SCREEN                                                          00014000
000150* LENGTH = 200 BYTES                                              00015000
000160******************************************************************00016000
000170         10  CN020-INTER-APPL-COMMAREA.                           00017000
000171**       10  CN020-INTER-APPL-COMMAREA  REDEFINES                 00017100
000180**                                      INTER-APPL-COMM-AREA.     00018000
000190             15  FILLER                        PIC X.             00019000
000200             15  CN020-NUMBER-OF-SELECTED-ITEMS                   00020000
000300                                               PIC S9(09) COMP-3. 00030000
000400             15  CN020-NUMBER-OF-TS-ITEMS      PIC S9(05) COMP-3. 00040000
000500             15  CN020-SEL-QUEUE-NAME          PIC  X(08).        00050000
000510*                                                                 00051000
000520             15  CN020-FUNCTION                PIC  X(02).        00052000
000530                 88  CN020-FUNCTION-NONE            VALUE '  '.   00053001
000540                 88  CN020-ADD-TKRPRPM              VALUE 'AP'.   00054001
000550                 88  CN020-UPD-TKRPRPM              VALUE 'UP'.   00055001
000560*                                                                 00056000
000561             15  CN020-FUNC-CODE               PIC X(06).         00056100
000562             15  CN020-FUNC-DESC               PIC X(40).         00056200
000563             15  CN020-TYPE-CODE               PIC X(02).         00056300
000564                 88  CN020-VALID-TYPE              VALUE 'DT',    00056401
000565                                                         'PC',    00056501
000566                                                         'QT',    00056601
000567                                                         'TX'.    00056701
000568                 88  CN020-TYPE-DATE               VALUE 'DT'.    00056801
000569                 88  CN020-TYPE-PCNT               VALUE 'PC'.    00056901
000570                 88  CN020-TYPE-QTY                VALUE 'QT'.    00057001
000571                 88  CN020-TYPE-TEXT               VALUE 'TX'.    00057101
000580             15  FILLER                        PIC X(133).        00058000
