000100******************************************************************00010000
000200**                        CNWS161                               **00020033
000300**                                                              **00030000
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040000
000500**  PRINTER MAINTENANCE CRITERIA SPECIFICATION.                 **00050030
000600**  LENGTH:  200 BYTES                                          **00060000
000700******************************************************************00070000
000800         10  CN161-INTER-APPL-COMMAREA  REDEFINES                 00080033
000900                                     INTER-APPL-COMM-AREA.        00090002
001000             15  FILLER                         PIC X(01).        00100030
001100             15  CN161-OPER-UNT-ID              PIC S9(4) COMP.   00110033
001200             15  CN161-FCLTY-ID                 PIC S9(4) COMP.   00120033
001300             15  CN161-CLUSTR-NBR               PIC S9(4) COMP.   00130037
001400             15  CN161-FCLTY-NME                PIC X(25).        00140033
001500             15  CN161-PRINTER-ID               PIC X(08).        00150033
001600             15  CN161-PRINTER-SELECT-TYPE      PIC X(01).        00160033
001700                 88  CN161-SELECT-ALL               VALUE 'A'.    00170033
001800                 88  CN161-SELECT-LABEL             VALUE 'L'.    00180033
001900                 88  CN161-SELECT-LINE              VALUE 'N'.    00190033
002000             15  CN161-PRINTER-ID-SW            PIC X(01).        00200034
002100                 88  CN161-PRINTER-ID-ENTERED       VALUE 'Y'.    00210034
002200                 88  CN161-NO-PRINTER-ID-ENTERED    VALUE 'N'.    00220034
002300             15  FILLER                         PIC X(158).       00230037
