00001 ******************************************************************01/08/92
00002 *  THIS COPYBOOK WAS RENAMED TO BE USED IN PROGRAM CNKUT002.              
00002 *  FSRD001O   RECORD LENGTH = 48                                 *FSRD001O
00001 ******************************************************************01/08/92
00002 *  CNWS002    RECORD LENGTH = 48                                 *FSRD001O
00003 *                                                                *   LV002
00004 *  THIS FILE CONTAINS THE MERCHANDISE BUSINESS STRUCTURE FOR     *   CL**1
00005 *  THE FASHION SALES SYSTEM AS CREATED IN PROGRAM FSKUT003.      *   CL**1
00005 *   *-*-*-*  WILL NOW BE USED IN PROGRAM CNKUT002 *-*-*-*        *   CL**1
00006 *  A SORTED VERSION OF THIS FILE IS USED AS THE DRIVER IN        *   CL**1
00007 *  PROGRAM FSKRP032 TO CREATE THE INVENTORY LEVEL REPORTS BY     *   CL**1
00008 *  DEPARTMENT/CLASS.                                             *   CL**1
00005 *   *-*-*-*  PROG FSKRP032 NO LONGER EXISTS       *-*-*-*        *   CL**1
00009 ******************************************************************   CL**1
00010  01  CN002-MBS-STRUCTURE-RECORD.                                     CL**1
00011      05  CN002-GMM                   PIC  X(02)    VALUE SPACES.     CL**1
00012      05  CN002-DMM                   PIC  X(02)    VALUE SPACES.     CL**1
00013      05  CN002-BUYER                 PIC  X(03)    VALUE SPACES.     CL**1
00014      05  CN002-DEPT                  PIC  X(03)    VALUE SPACES.     CL**1
00015      05  CN002-MAJ-CLASS             PIC  X(02)    VALUE SPACES.     CL**1
00016      05  CN002-SUB-CLASS.                                            CL**1
00017          10  FILLER                  PIC  X(01)    VALUE SPACE.      CL**1
00018          10  CN002-SUB-CLASS-NMBR    PIC  X(02)    VALUE SPACES.     CL**1
00019      05  CN002-LEVEL                 PIC  X(03)    VALUE SPACES.     CL**1
00020      05  CN002-DESC                  PIC  X(30)    VALUE SPACES.     CL**1
