000010******************************************************************        
000011**                        CNWS017                                         
000012**                                                                        
000020*    SELECTION QUEUE FOR THE SEASONAL SET LIST SCREEN                     
000040*    LENGTH = 2165 BYTES                                                  
000050******************************************************************        
000100                                                                          
000200 01  CN017-SELECT-RECORD.                                                 
000300     05  CN017-SELECTED-ITEMS             PIC S9(5) VALUE ZERO            
000400                                                    COMP-3.               
000500     05  CN017-MAX-ITEMS                  PIC 99    VALUE 20.             
000600     05  CN017-SELECTED-ITEM-ARRAY.                                       
000700         10  FILLER                       OCCURS 20 TIMES                 
000800                                          INDEXED BY CN017-IDX.           
000900             15  CN017-ITEM               PIC S9(9) COMP-3.               
001000             15  CN017-ACTION-SW          PIC X(03).                      
001100                 88  CN017-INQ                      VALUE 'INQ'.          
001200                 88  CN017-UPD                      VALUE 'UPD'.          
001300                 88  CN017-DEL                      VALUE 'DEL'.          
001400                 88  CN017-ERR                      VALUE 'ERR'.          
001500             15  CN017-KEY-DATA.                                          
001700                 20  CN017-DIVERT-PREFIX  PIC 9(02).                      
002011                 20  CN017-SEASET-YEAR    PIC 9(04).                      
003300                 20  CN017-SEASET-TYPE    PIC X(03).                      
003310                 20  CN017-SEASET-SHRTNM  PIC X(05).                      
003311                 20  CN017-SEASET-NAME    PIC X(25).                      
003330                 20  CN017-RLSE-DATE      PIC X(10).                      
003340                 20  CN017-STATUS         PIC X(01).                      
003400                 20  FILLER               PIC X(50).                      
004200                                                                          
