000100******************************************************************00010000
000110**                        CNWS023                                 00011000
000120**                                                                00012000
000130* INTER-APPLICATION COMMUNICATION AREA FOR THE INTEGRATION PARM   00013001
000140* CODE LIST - WST_INTGRTN_TYP                                     00014000
000150* LENGTH = 200 BYTES                                              00015000
000160******************************************************************00016000
000173         10  CN023-INTER-APPL-COMMAREA  REDEFINES                 00017308
000174                                        INTER-APPL-COMM-AREA.     00017408
000175             15  FILLER                        PIC X.             00017507
000176             15  CN023-NUMBER-OF-SELECTED-ITEMS                   00017607
000177                                               PIC S9(09) COMP-3. 00017707
000178             15  CN023-NUMBER-OF-TS-ITEMS      PIC S9(05) COMP-3. 00017807
000179             15  CN023-SEL-QUEUE-NAME          PIC  X(08).        00017907
000180*                                                                 00018007
000181             15  CN023-FUNCTION                PIC  X(02).        00018107
000182                 88  CN023-FUNCTION-NONE            VALUE '  '.   00018207
000190                 88  CN023-ADD-INTGRTN              VALUE 'AI'.   00019001
000200                 88  CN023-UPD-INTGRTN              VALUE 'UI'.   00020001
000210                 88  CN023-ADD-DEFN                 VALUE 'AD'.   00021004
000300*                                                                 00030000
000302             15  CN023-OPER-UNT-ID             PIC S9(04) COMP.   00030203
000303             15  CN023-OPER-UNT-NAME           PIC  X(25).        00030303
000310*                                                                 00031002
000400             15  CN023-PARM-CODE               PIC X(10).         00040001
000500             15  CN023-PARM-DESC               PIC X(50).         00050001
000510             15  CN023-APPL-FUNC               PIC X(10).         00051001
000564             15  FILLER                        PIC X(84).         00056406
