00001 *----------------------------------------------------------------*10/13/93
00002 *                         CNWS005                                *CNWS005 
00003 *                                                                *   LV003
00004 *   THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE *CNWS005 
00005 *   MAINTENANCE PROGRAMS TO PASS THE KEY INFORMATION.            *CNWS005 
00006 *                                                                *CNWS005 
00007 *----------------------------------------------------------------*CNWS005 
00008                                                                   CNWS005 
00009  01  CN005-TS-SEL-REC.                                            CNWS005 
00010        05  CN005-SELECTED-ITEMS         PIC S9(05)  COMP-3        CNWS005 
00011                                                     VALUE ZERO.   CNWS005 
00012        05  CN005-MAX-ITEMS              PIC  9(02)  VALUE 20.     CNWS005 
00013        05  CN005-SELECTED-ITEM-ARRAY.                             CNWS005 
00014            10  FILLER                   OCCURS 20 TIMES           CNWS005 
00015                                         INDEXED BY CN005-IDX.     CNWS005 
00016                15  CN005-ITEM           PIC S9(09)  COMP-3.       CNWS005 
00017                15  CN005-ACTION-SW      PIC  X(01).               CNWS005 
00018                    88  CN005-ADD                    VALUE 'A'.    CNWS005 
00019                    88  CN005-INQ                    VALUE 'I'.    CNWS005 
00020                    88  CN005-UPD                    VALUE 'U'.    CNWS005 
00021                    88  CN005-DEL                    VALUE 'D'.    CNWS005 
00022                    88  CN005-ERR                    VALUE 'E'.    CNWS005 
00023                15  CN005-KEY-DATA.                                CNWS005 
00024                    20  CN005-AREA-ID    PIC  X(06).                  CL**2
00025                    20  CN005-TYPE       PIC  X(02).               CNWS005 
00026                    20  CN005-DEPT-NBR   PIC  X(03).                  CL**2
00027                    20  CN005-CL-NBR     PIC  X(02).                  CL**2
00028                    20  CN005-RANK       PIC S9(04) COMP.          CNWS005 
00029                    20  CN005-OPER-UNT-ID PIC S9(04) COMP.            CL**3
00030                    20  CN005-FCLTY-ID   PIC S9(04) COMP.             CL**3
