000010******************************************************************        
000011**                        CNWS028                                         
000012**                                                                        
000020*    SELECTION QUEUE FOR THE INTEGRATION ELEMENT LIST SCREEN              
000030*    WST_ATTR_ELEM                                                        
000040*    MAX LENGTH = 2165 BYTES                                              
000050******************************************************************        
000100                                                                          
000200 01  CN028-SELECT-RECORD.                                                 
000300     05  CN028-SELECTED-ITEMS             PIC S9(5) VALUE ZERO            
000400                                                    COMP-3.               
000500     05  CN028-MAX-ITEMS                  PIC 99    VALUE 16.             
000600     05  CN028-SELECTED-ITEM-ARRAY.                                       
000700         10  FILLER                       OCCURS 16 TIMES                 
000800                                          INDEXED BY CN028-IDX.           
000900             15  CN028-ITEM               PIC S9(9) COMP-3.               
001000             15  CN028-ACTION-SW          PIC X(03).                      
001100                 88  CN028-INQ                      VALUE 'INQ'.          
001200                 88  CN028-UPD                      VALUE 'UPD'.          
001300                 88  CN028-DEL                      VALUE 'DEL'.          
001400                 88  CN028-ERR                      VALUE 'ERR'.          
001500             15  CN028-KEY-DATA.                                          
001700                 20  CN028-ELEM-SEQ       PIC 9(04).                      
001800                 20  CN028-DEFN-SEQ       PIC 9(04).                      
002011                 20  CN028-DATA-TYPE      PIC X(03).                      
002012                     88  CN028-DATE                  VALUE 'DTE'.         
002013                     88  CN028-NUMERIC               VALUE 'NUM'.         
002014                     88  CN028-STRING                VALUE 'STR'.         
003300                 20  CN028-ATTR-DESCR     PIC X(08).                      
003302                 20  CN028-REQD           PIC  X(01).                     
003307                 20  CN028-MAX-LENGTH     PIC  9(04).                     
003308                 20  CN028-DECIMAL-POSITIONS   PIC  9(04).                
003309                 20  CN028-ELEM-COUNT     PIC S9(09)  COMP.               
003310                 20  CN028-ELEM-VALUE     PIC X(50).                      
003311                 20  CN028-ELEM-TEXT      PIC X(50).                      
003312                 20  CN028-ELEM-TEXT-NULL PIC S9(04)  VALUE ZEROS         
003313                                                      COMP SYNC.          
003314                 20  CN028-ELEM-TMST      PIC X(26).                      
003315                 20  CN028-ELEM-TMST-NULL PIC S9(04)  VALUE ZEROS         
003316                                                      COMP SYNC.          
003317                 20  CN028-ELEM-NBR       PIC S9(10)V9(5) COMP-3.         
003318                 20  CN028-ELEM-NBR-NULL  PIC S9(04)  VALUE ZEROS         
003319                                                      COMP SYNC.          
003400                 20  FILLER               PIC X(35).                      
004200                                                                          
