000100******************************************************************00010001
000200**                        CNWS025                                 00020001
000300**                                                                00030001
000400* INTER-APPLICATION COMMUNICATION AREA FOR THE INTEGRATION PARM   00040001
000500* ATTRIBUTE DEFINITION SCREEN - WST_ATTR_DEFN                     00050001
000600* LENGTH = 200 BYTES                                              00060001
000700******************************************************************00070001
000910         10  CN025-INTER-APPL-COMMAREA  REDEFINES                 00091007
001000                                        INTER-APPL-COMM-AREA.     00100007
001100             15  FILLER                        PIC X.             00110001
001200             15  CN025-NUMBER-OF-SELECTED-ITEMS                   00120001
001300                                               PIC S9(09) COMP-3. 00130001
001400             15  CN025-NUMBER-OF-TS-ITEMS      PIC S9(05) COMP-3. 00140001
001500             15  CN025-SEL-QUEUE-NAME          PIC  X(08).        00150001
001600*                                                                 00160001
001700             15  CN025-FUNCTION                PIC  X(02).        00170001
001800                 88  CN025-FUNCTION-NONE            VALUE '  '.   00180001
001900                 88  CN025-ADD-DEFN                 VALUE 'AD'.   00190001
002000                 88  CN025-UPD-DEFN                 VALUE 'UD'.   00200001
002100*                                                                 00210001
002200             15  CN025-FUNC-NAME               PIC X(10).         00220002
002210             15  CN025-FUNC-DESC               PIC X(50).         00221002
002220             15  CN025-APPL-FUNC               PIC X(10).         00222003
003300             15  FILLER                        PIC X(111).        00330006
