000100******************************************************************00010000
000200**                        CNWS022                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040000
000500**  DC APPLICATION INTEGRATION PARM MAINT SCREENS (FROM CRIT)   **00050000
000600**  LENGTH:  200 BYTES                                          **00060000
000700******************************************************************00070000
000810         10  CN022-INTER-APPL-COMMAREA  REDEFINES                 00081003
000900                                     INTER-APPL-COMM-AREA.        00090003
001000             15  FILLER                         PIC  X(01).       00100000
001010             15  CN022-FUNCTION                 PIC  X(02).       00101000
001020                 88  CN022-FUNCTION-NONE             VALUE ' '.   00102000
001021                 88  CN022-ADD-CODE                  VALUE 'AC'.  00102100
001022                 88  CN022-UPD-CODE                  VALUE 'UC'.  00102200
001023                 88  CN022-ADD-DEFN                  VALUE 'AD'.  00102301
001024                 88  CN022-UPD-DEFN                  VALUE 'UD'.  00102407
001025                 88  CN022-ADD-ELEM                  VALUE 'AE'.  00102508
001026             15  CN022-OPER-UNT-ID              PIC S9(04) COMP.  00102608
001027             15  CN022-OPER-UNT-NAME            PIC  X(25).       00102708
001028             15  CN022-PARM-NAME                PIC  X(10).       00102808
001029             15  CN022-PARM-DESC                PIC  X(40).       00102908
001030             15  CN022-PARM-FUNC                PIC  X(10).       00103008
001040             15  CN022-ELEM-SEQ                 PIC  9(09).       00104010
001056             15  FILLER                         PIC X(106).       00105609
