000100******************************************************************00010000
000110**                        CNWS016                                 00011000
000120**                                                                00012000
000130* INTER-APPLICATION COMMUNICATION AREA FOR THE SEASONAL SET LIST  00013000
000140* SCREEN                                                          00014000
000150* LENGTH = 200 BYTES                                              00015000
000160******************************************************************00016000
000172         10  CN016-INTER-APPL-COMMAREA  REDEFINES                 00017203
000180                                        INTER-APPL-COMM-AREA.     00018003
000190             15  FILLER                        PIC X.             00019001
000200             15  CN016-NUMBER-OF-SELECTED-ITEMS                   00020000
000300                                               PIC S9(09) COMP-3. 00030001
000400             15  CN016-NUMBER-OF-TS-ITEMS      PIC S9(05) COMP-3. 00040001
000500             15  CN016-SEL-QUEUE-NAME          PIC  X(08).        00050001
000510*                                                                 00051001
000600             15  CN016-FUNCTION                PIC  X(01).        00060001
000700                 88  CN016-FUNCTION-NONE             VALUE ' '.   00070001
000800                 88  CN016-UPD-TSEASET               VALUE 'U'.   00080001
000900             15  CN016-DIVERT-PREFIX-NBR       PIC  9(02).        00090001
001000             15  CN016-SET-YEAR                PIC  X(04).        00100004
001200             15  CN016-SHORT-NAME              PIC  X(05).        00120001
001210             15  CN016-SET-TYPE                PIC  X(03).        00121004
001300             15  CN016-SEASET-NAME             PIC  X(25).        00130001
001310             15  CN016-STATUS                  PIC  X(01).        00131002
001400             15  CN016-RLSE-DATE               PIC  X(10).        00140002
001460*                                                                 00146001
001500             15  FILLER                        PIC X(132).        00150005
