000100******************************************************************00010000
000200**                        CNWS008                               **00020001
000300**                                                              **00030000
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040000
000500**  TRAILER MANIFESTING APPLICATION SCREENS                     **00050001
000600**  LENGTH:  200 BYTES                                          **00060000
000700******************************************************************00070000
000800         10  CN008-INTER-APPL-COMMAREA  REDEFINES                 00080001
000900                                     INTER-APPL-COMM-AREA.        00090000
001000             15  FILLER                         PIC  X(01).       00100001
001100             15  CN008-OPER-UNT-ID              PIC S9(04) COMP.  00110001
001200             15  CN008-FCLTY-ID                 PIC S9(04) COMP.  00120001
001300             15  CN008-FCLTY-NME                PIC  X(25).       00130001
001400             15  CN008-SCAC                     PIC  X(04).       00140001
001410             15  CN008-SCAC-NAME                PIC  X(30).       00141002
001500             15  CN008-TRLR-ID                  PIC  X(12).       00150001
001600             15  CN008-TRLR-SRL-NBR             PIC S9(09) COMP.  00160001
001700             15  CN008-PRINTER-ID               PIC  X(08).       00170001
001800             15  CN008-TRLR-LENGTH              PIC  9(04).       00180005
002500             15  FILLER                         PIC X(108).       00250005
