000100******************************************************************00010000
000200*    INTER-APPLICATION COMMUNICATION AREA FOR THE TRAILER SERIAL  00020000
000300*    NUMBER LABEL PRINT REQUEST                                   00030000
000400*    LENGTH = 200 BYTES                                           00040000
000500******************************************************************00050000
000600         10  CN009-INTER-APPL-COMMAREA  REDEFINES                 00060000
000700                                        INTER-APPL-COMM-AREA.     00070000
000800             15  FILLER                     PIC X.                00080000
000900             15  CN009-NUMBER-OF-SELECTED-ITEMS                   00090000
001000                                            PIC S9(09) COMP-3.    00100000
001100             15  CN009-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00110000
001200             15  CN009-SEL-QUEUE-NAME       PIC X(08).            00120000
001300             15  CN009-CURR-OPER-UNT-ID     PIC 9(04).            00130000
001400             15  CN009-CURR-FCLTY-ID        PIC 9(04).            00140000
001760             15  CN009-PRTR-ID              PIC X(08).            00176000
001770             15  CN009-DC-PRTD-AT           PIC X(02).            00177000
001780             15  CN009-USER-ID              PIC X(08).            00178000
001790             15  FILLER                     PIC X(157).           00179002
