000100******************************************************************00010000
000110**                        CNWS029                                 00011000
000120**                                                                00012000
000130* INTER-APPLICATION COMMUNICATION AREA FOR THE INTEGRATION PARM   00013000
000140* ELEMENT ADD/UPDATE LIST   WST_ATTR_ELEM (CNKCS249)              00014000
000150* LENGTH = 200 BYTES                                              00015000
000160******************************************************************00016000
000170         10  CN029-INTER-APPL-COMMAREA  REDEFINES                 00017000
000171                                        INTER-APPL-COMM-AREA.     00017100
000172             15  FILLER                        PIC X.             00017200
000173             15  CN029-NUMBER-OF-SELECTED-ITEMS                   00017300
000174                                               PIC S9(09) COMP-3. 00017400
000175             15  CN029-NUMBER-OF-TS-ITEMS      PIC S9(05) COMP-3. 00017500
000176             15  CN029-SEL-QUEUE-NAME          PIC  X(08).        00017600
000177*                                                                 00017700
000178             15  CN029-FUNCTION                PIC  X(02).        00017800
000179                 88  CN029-FUNCTION-NONE            VALUE '  '.   00017900
000180                 88  CN029-ADD-ELEM                 VALUE 'AE'.   00018000
000190                 88  CN029-UPD-ELEM                 VALUE 'UE'.   00019000
000200*                                                                 00020000
000300             15  CN029-FUNC-NAME               PIC X(10).         00030000
000400             15  CN029-FUNC-DESC               PIC X(40).         00040000
000500             15  CN029-APPL-FUNC               PIC X(10).         00050000
000600             15  FILLER                        PIC X(121).        00060000
