000010******************************************************************        
000020*    SELECTION QUEUE FOR THE BLIND RECEIPT LABEL PRINT REQUEST            
000040*    LENGTH = ___ BYTES                                                   
000050******************************************************************        
000100                                                                          
000200 01  CN010-SELECT-RECORD.                                                 
000300     05  CN010-SELECTED-ITEMS             PIC S9(5) VALUE ZERO            
000400                                                    COMP-3.               
000500     05  CN010-MAX-ITEMS                  PIC 99    VALUE 20.             
000600     05  CN010-SELECTED-ITEM-ARRAY.                                       
000700         10  FILLER                       OCCURS 20 TIMES                 
000800                                          INDEXED BY CN010-IDX.           
000900             15  CN010-ITEM               PIC S9(9) COMP-3.               
001000             15  CN010-ACTION-SW          PIC X.                          
001100                 88  CN010-INQ                      VALUE 'I'.            
001200                 88  CN010-UPD                      VALUE 'U'.            
001300                 88  CN010-DEL                      VALUE 'D'.            
001400                 88  CN010-ERR                      VALUE 'E'.            
001500             15  CN010-KEY-DATA.                                          
001700                 20  CN010-TRAILER-ID     PIC X(12).                      
002011                 20  CN010-SERIAL-NBR     PIC 9(09).                      
002012                 20  CN010-SCAC           PIC X(04).                      
002013                 20  CN010-TRLR-LENGTH    PIC 9(04).                      
003300                 20  FILLER               PIC X(60).                      
004200                                                                          
