000100******************************************************************00010000
000200**                        CNWS015                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040000
000500**  DC CONTROLS APPLICATION - SEASONAL SET CRIT SPEC            **00050000
000600**  LENGTH:  200 BYTES                                          **00060000
000700******************************************************************00070000
000820         10  CN015-INTER-APPL-COMMAREA  REDEFINES                 00082003
000900                                     INTER-APPL-COMM-AREA.        00090003
001000             15  FILLER                         PIC  X(01).       00100000
001010             15  CN015-FUNCTION                 PIC  X(01).       00101000
001020                 88  CN015-FUNCTION-NONE             VALUE ' '.   00102000
001022                 88  CN015-UPD-TSEASET               VALUE 'U'.   00102200
001023             15  CN015-DIVERT-PREFIX-NBR        PIC  9(02).       00102300
001024             15  CN015-SET-YEAR                 PIC  9(04).       00102404
001026             15  CN015-SHORT-NAME               PIC  X(05).       00102600
001027             15  CN015-SEASET-NAME              PIC  X(25).       00102700
001028             15  CN015-STATUS                   PIC  X(01).       00102802
001029             15  CN015-RLSE-DATE                PIC  X(10).       00102902
001030             15  CN015-SEASET-TYPE              PIC  X(03).       00103005
001090             15  FILLER                         PIC X(148).       00109005
