000100******************************************************************00010000
000110**                        CNWS018                                 00011000
000120**                                                                00012000
000130* INTER-APPLICATION COMMUNICATION AREA FOR THE TKRPRCD CODE LIST  00013000
000140* SCREEN                                                          00014000
000150* LENGTH = 200 BYTES                                              00015000
000160******************************************************************00016000
000172         10  CN018-INTER-APPL-COMMAREA  REDEFINES                 00017204
000180                                        INTER-APPL-COMM-AREA.     00018004
000190             15  FILLER                        PIC X.             00019000
000200             15  CN018-NUMBER-OF-SELECTED-ITEMS                   00020000
000300                                               PIC S9(09) COMP-3. 00030000
000400             15  CN018-NUMBER-OF-TS-ITEMS      PIC S9(05) COMP-3. 00040000
000500             15  CN018-SEL-QUEUE-NAME          PIC  X(08).        00050000
000510*                                                                 00051000
000520             15  CN018-FUNCTION                PIC  X(02).        00052000
000530                 88  CN018-FUNCTION-NONE             VALUE '  '.  00053000
000540                 88  CN018-ADD-TKRPRCD               VALUE 'AC'.  00054000
000541                 88  CN018-UPD-TKRPRCD               VALUE 'UC'.  00054100
000542                 88  CN018-ADD-TKRPRPM               VALUE 'AP'.  00054202
000543                 88  CN018-UPD-TKRPRPM               VALUE 'UP'.  00054302
000544             15  CN018-OPER-UNT-ID             PIC S9(04) COMP.   00054403
000545             15  CN018-OPER-UNT-NAME           PIC  X(25).        00054503
000800*                                                                 00080000
000900             15  FILLER                        PIC X(154).        00090004
