000100***************************************************************** 00010000
000200*  CASH OFFICE VOID AFTER TRANSACTION RECORD LAYOUT.            * 00020013
000300*  THIS IS EXTRACTED FROM THE MEDIA DETAIL TABLE IN THE CASH    * 00030015
000400*  OFFICE SYSTEM AND THEN SENT TO CORPORATE VIA MQSERIES.       * 00040013
000500***************************************************************** 00050013
000600                                                                  00060013
000700 01  CO001-VOID-AFTER-RECORD.                                     00070013
000800     05  CO001-STORE-NUMBER      PIC 9(04)      VALUE ZERO.       00080013
000900     05  CO001-BALANCE-DATE      PIC X(10)      VALUE SPACES.     00090013
001000     05  CO001-REGISTER-ID       PIC 9(04)      VALUE ZERO.       00100013
001100     05  CO001-START-TIMESTAMP   PIC X(19)      VALUE SPACES.     00110013
001200     05  CO001-READ-TRANS-NBR    PIC 9(04)      VALUE ZERO.       00120013
001300     05  CO001-TENDER-TYPE-CODE  PIC X(02)      VALUE SPACES.     00130013
001400     05  CO001-SEQUENCE-NUMBER   PIC 9(04)      VALUE ZERO.       00140013
001500     05  CO001-MATCHED-CODE      PIC X(02)      VALUE SPACES.     00150013
001600     05  CO001-MEDIA-AMOUNT      PIC S9(07)V99  VALUE ZERO.       00160013
001700     05  CO001-TRANSACTION-NBR   PIC 9(04)      VALUE ZERO.       00170013
001800     05  FILLER                  PIC X(18)      VALUE SPACES.     00180014
