      ***************************************************************           
      *   CWRD011 - VENDOR STYLE RECORD                                         
      *   RECORD LENGTH = 108 BYTES                                             
      ***************************************************************           
       01  CW011-RECORD.                                                        
           05  CW011-KEY.                                                       
               10  CW011-RMS-STYL-ID        PIC   9(8).                         
           05  CW011-DATA.                                                      
               10  CW011-DEPT-NBR           PIC   9(4).                         
               10  CW011-MAJ-CL-NBR         PIC   9(4).                         
               10  CW011-SUB-CL-NBR         PIC   9(4).                         
               10  CW011-VS-ID              PIC   9(10).                        
               10  CW011-ENT-ID             PIC   9(10).                        
               10  CW011-VS-NBR             PIC   X(20).                        
               10  CW011-STKR-NBR           PIC   9(5).                         
               10  CW011-VS-DESC            PIC   X(30).                        
               10  CW011-MAP-UNT-RTL-AMT    PIC  +9(7).9(2).                    
               10  CW011-LBL-TYP-CDE        PIC   X(01).                        
           05  CW011-CHANGE-IND             PIC   X.                            
       01  CW011-RECORD-R REDEFINES CW011-RECORD.                               
           05  CW011-KEY-R.                                                     
               10  CW011-RMS-STYL-ID-R      PIC   9(8).                         
               10  CW011-DEPT-NBR-R         PIC   9(4).                         
               10  CW011-MAJ-CL-NBR-R       PIC   9(4).                         
               10  CW011-SUB-CL-NBR-R       PIC   9(4).                         
           05  CW011-DATA-R.                                                    
               10  CW011-VS-ID-R            PIC   9(10).                        
               10  CW011-ENT-ID-R           PIC   9(10).                        
               10  CW011-VS-NBR-R           PIC   X(20).                        
               10  CW011-STKR-NBR-R         PIC   9(5).                         
               10  CW011-VS-DESC-R          PIC   X(30).                        
               10  CW011-MAP-UNT-RTL-AMT-R  PIC  +9(7).9(2).                    
               10  CW011-LBL-TYP-CDE-R      PIC   X(01).                        
           05  CW011-CHANGE-IND-R           PIC   X.                            
