      ***************************************************************           
      *   CWRD901 - TIME DIMENSION EXTRACT                                      
      *   RECORD LENGTH = 282 BYTES                                             
      ***************************************************************           
       01  CW901-TIME-RECORD.                                                   
           05  CW901-TM-DIM-KY-DTE          PIC   X(10).                        
           05  CW901-FSCL-WK-NBR            PIC   X(2).                         
           05  CW901-FSCL-WK-ID             PIC   9(6).                         
           05  FILLER REDEFINES CW901-FSCL-WK-ID.                               
               10  CW901-FSCL-WK-ID-CCYY    PIC   9(4).                         
               10  CW901-FSCL-WK-ID-WK      PIC   9(2).                         
           05  CW901-FSCL-MN-NBR            PIC   X(2).                         
           05  CW901-FSCL-MN-NM             PIC   X(9).                         
           05  CW901-FSCL-MN-ID             PIC   9(6).                         
           05  FILLER REDEFINES CW901-FSCL-MN-ID.                               
               10  CW901-FSCL-MN-ID-CCYY    PIC   9(4).                         
               10  CW901-FSCL-MN-ID-MN      PIC   9(2).                         
           05  CW901-FSCL-QTR-NBR           PIC   X(1).                         
           05  CW901-FSCL-QTR-ID            PIC   9(6).                         
           05  FILLER REDEFINES CW901-FSCL-QTR-ID.                              
               10  CW901-FSCL-QTR-ID-CCYY   PIC   9(4).                         
               10  CW901-FSCL-QTR-ID-QTR    PIC   9(2).                         
           05  CW901-FSCL-YR-NBR            PIC   X(4).                         
           05  CW901-FSCL-YR-AND-DAY-NBR    PIC   9(7).                         
           05  FILLER REDEFINES CW901-FSCL-YR-AND-DAY-NBR.                      
               10  CW901-FSCL-YR-DAY-CCYY   PIC   9(4).                         
               10  CW901-FSCL-YR-DAY-DDD    PIC   9(3).                         
           05  CW901-LY-FSCL-MN-ID          PIC   9(6).                         
           05  FILLER REDEFINES CW901-LY-FSCL-MN-ID.                            
               10  CW901-LY-FSCL-MN-ID-CCYY PIC   9(4).                         
               10  CW901-LY-FSCL-MN-ID-MN   PIC   9(2).                         
           05  CW901-FSCL-BOM-IND           PIC   X(1).                         
           05  CW901-FSCL-EOM-IND           PIC   X(1).                         
           05  CW901-FSCL-MN-LST-BOW-IND    PIC   X(1).                         
           05  CW901-JLN-DTE                PIC   9(7).                         
           05  FILLER REDEFINES CW901-JLN-DTE.                                  
               10  CW901-JLN-DTE-CCYY       PIC   9(4).                         
               10  CW901-JLN-DTE-DDD        PIC   9(3).                         
           05  CW901-DAY-OF-WK-NBR          PIC   X(1).                         
           05  CW901-DAY-OF-WK-NM           PIC   X(9).                         
           05  CW901-CAL-DAY-OF-MN-NBR      PIC   X(2).                         
           05  CW901-CAL-MN-NBR             PIC   X(2).                         
           05  CW901-CAL-MN-NM              PIC   X(9).                         
           05  CW901-CAL-QTR-NBR            PIC   X(1).                         
           05  CW901-CAL-YR-NBR             PIC   X(4).                         
           05  CW901-CAL-BOM-IND            PIC   X(1).                         
           05  CW901-CAL-EOM-IND            PIC   X(1).                         
           05  CW901-BOW-IND                PIC   X(1).                         
           05  CW901-BOW-DTE                PIC   X(10).                        
           05  CW901-EOW-IND                PIC   X(1).                         
           05  CW901-WKDA-IND               PIC   X(1).                         
           05  CW901-HOL-IND                PIC   X(1).                         
           05  CW901-HOL-NM                 PIC   X(25).                        
           05  CW901-SEA-ID                 PIC   X(5).                         
           05  FILLER REDEFINES CW901-SEA-ID.                                   
               10  CW901-SEA-ID-CCYY        PIC   9(4).                         
               10  CW901-SEA-S-F            PIC   X(1).                         
           05  CW901-SEA-DESC               PIC   X(6).                         
           05  CW901-BOS-IND                PIC   X(1).                         
           05  CW901-EOS-IND                PIC   X(1).                         
           05  CW901-LAST-SEA-LAST-BOW-DTE  PIC   X(10).                        
           05  CW901-LY-LAST-BOW-DTE        PIC   X(10).                        
           05  CW901-NWK-BOW-DTE            PIC   X(10).                        
           05  CW901-PWK-BOW-DTE            PIC   X(10).                        
           05  CW901-PWK2-BOW-DTE           PIC   X(10).                        
           05  CW901-PWK3-BOW-DTE           PIC   X(10).                        
           05  CW901-PWK4-BOW-DTE           PIC   X(10).                        
           05  CW901-LY-TDA-DTE             PIC   X(10).                        
           05  CW901-FSCL-WK-OF-MN-NBR      PIC   9(01).                        
           05  CW901-BEG-WTD-DTE            PIC   X(10).                        
           05  CW901-BEG-FSCL-MTD-DTE       PIC   X(10).                        
           05  CW901-BEG-FSCL-QTD-DTE       PIC   X(10).                        
           05  CW901-BEG-STD-DTE            PIC   X(10).                        
           05  CW901-BEG-FSCL-YTD-DTE       PIC   X(10).                        
