      ***************************************************************           
      *   CWRD007 - VENDOR RECORD                                               
      *   RECORD LENGTH = 105 BYTES                                             
      ***************************************************************           
       01  CW007-VENDOR-RECORD.                                                 
                                                                                
           05  CW007-ENT-ID-RED                 PIC +9(10).                     
           05  CW007-ENT-ID-GROUP REDEFINES CW007-ENT-ID-RED.                   
               10  CW007-ENT-ID-SIGN            PIC X(1).                       
               10  CW007-ENT-ID                 PIC 9(10).                      
                                                                                
           05  CW007-VND-NBR-10.                                                
               10  FILLER                   PIC X(1) VALUE '0'.                 
               10  CW007-VND-NBR-9          PIC X(9).                           
                                                                                
           05  CW007-PRIM-TYP-CDE           PIC X(1).                           
           05  CW007-PRIMARY-NAME           PIC X(30).                          
           05  CW007-STATUS-CDE             PIC X(1).                           
           05  CW007-CRE-TMST               PIC X(26).                          
           05  CW007-LAST-UPD-TMST          PIC X(26).                          
