       01  CW026-RECORD.                                                        
           05  CW026-RMS-STYL-ID            PIC  S9(08)V COMP-3.                
           05  CW026-VS-CHARTC-CDE          PIC  S9(04) COMP.                   
           05  CW026-VS-CHARTC-VAL-CDE      PIC  S9(04) COMP.                   
