      *---------------------------------------------------------------*         
      *                                                               *         
      *    CWRD107 - ITEM GROUP PRICING DOMAIN EXTRACT DISPLAY FORMAT *         
      *    LENGTH  - 48 BYTES                                         *         
      *---------------------------------------------------------------*         
       01  CW107-GROUP-PRICE-EXTRACT-REC.                                       
           05 CW107-GP-PRIC-ID              PIC  +9(10).                        
           05 CW107-GP-PRIC-DESC            PIC   X(20).                        
           05 CW107-GP-RTL-QTY              PIC  +9(05).                        
           05 CW107-GP-RTL-AMT              PIC  +9(7).9(2).                    
