      ***************************************************************           
      *   CWRD009 - ADDRESS                                                     
      *   RECORD LENGTH = 97 BYTES                                              
      ***************************************************************           
       01  CWRD009-RECORD.                                                      
           05 CW009-ADDR-NBR                 PIC 9(04).                         
           05 CW009-ADDRESS-DATA             PIC X(92).                         
           05 CW009-ADDRESS-DETAIL REDEFINES CW009-ADDRESS-DATA.                
               10 CW009-ADDR-LNE-1           PIC X(30).                         
               10 CW009-ADDR-LNE-2           PIC X(30).                         
               10 CW009-ADDR-CITY            PIC X(20).                         
               10 CW009-ADDR-ST-CDE          PIC X(02).                         
               10 CW009-ADDR-ZIP-10-CDE      PIC X(10).                         
           05 CW009-ADDR-CHNGE-IND           PIC X(01).                         
