       01  CW027-RECORD.                                                        
           05  CW027-RMS-STYL-ID            PIC  S9(08)V COMP-3.                
           05  CW027-DEPT-NBR               PIC  S9(04)V COMP-3.                
           05  CW027-MAJ-CL-NBR             PIC  S9(04)V COMP-3.                
           05  CW027-SUB-CL-NBR             PIC  S9(04)V COMP-3.                
           05  CW027-VS-ID                  PIC  S9(09) COMP.                   
           05  CW027-ENT-ID                 PIC  S9(09) COMP.                   
           05  CW027-VS-NBR                 PIC   X(20).                        
           05  CW027-STKR-NBR               PIC  S9(04) COMP.                   
           05  CW027-VS-DESC                PIC   X(30).                        
           05  CW027-MAP-UNT-RTL-AMT        PIC  S9(7)V9(2) COMP-3.             
           05  CW027-LBL-TYP-CDE            PIC   X(01).                        
