       01  CW032-RECORD.                                                        
           05 CW032-INTR-UPC-ID             PIC  S9(09)  COMP.                  
           05 CW032-RMS-STYL-ID             PIC  S9(08)V COMP-3.                
           05 CW032-ITM-NBR                 PIC  S9(15)V COMP-3.                
           05 CW032-SKU                     PIC  S9(08)V COMP-3.                
           05 CW032-INTR-UPC-DESC           PIC   X(30).                        
           05 CW032-SKU-STAT-CDE            PIC   X(02).                        
           05 CW032-SKU-STAT-DESC           PIC   X(10).                        
           05 CW032-INNR-PK-QTY             PIC  S9(04)  COMP.                  
           05 CW032-OUTR-PK-QTY             PIC  S9(04)  COMP.                  
           05 CW032-KOHLS-SIZE-CDE          PIC  S9(09)  COMP.                  
           05 CW032-KOHLS-SIZE-DESC         PIC   X(10).                        
           05 CW032-NRF-CLOR-CDE            PIC   X(03).                        
           05 CW032-NRF-CLOR-DESC           PIC   X(10).                        
           05 CW032-SHRT-CLOR-DESC          PIC   X(04).                        
           05 CW032-CSTM-CLOR-DESC          PIC   X(10).                        
           05 CW032-CUSTFACG-CLOR-DESC      PIC   X(22).                        
           05 CW032-REGN-PRIC-IND           PIC   X(01).                        
           05 CW032-RPLNMT-IND              PIC   X(01).                        
           05 CW032-KY-ITM-IND              PIC   X(01).                        
           05 CW032-POG-IND                 PIC   X(01).                        
           05 CW032-GP-CDE                  PIC   X(03).                        
           05 CW032-SEA-DESC                PIC   X(20).                        
           05 CW032-UNT-COST-1ST-AMT        PIC  S9(7)V9(3)  COMP-3.            
           05 CW032-TX-PRD-CDE-DESC         PIC   X(20).                        
           05 CW032-WT-UM-CDE               PIC   X(02).                        
           05 CW032-WT-UM-QTY               PIC  S9(5)V9(3)  COMP-3.            
           05 CW032-SIZE-UM-CDE             PIC   X(02).                        
           05 CW032-WD-UM-QTY               PIC  S9(4)V9(3)  COMP-3.            
           05 CW032-HT-UM-QTY               PIC  S9(4)V9(3)  COMP-3.            
           05 CW032-DPTH-UM-QTY             PIC  S9(4)V9(3)  COMP-3.            
           05 CW032-E-BUS-ITM-IND           PIC   X(01).                        
           05 CW032-ASRT-BEG-DTE            PIC   X(10).                        
           05 CW032-ASRT-END-DTE            PIC   X(10).                        
           05 CW032-STRG-AREA-DESC          PIC   X(20).                        
           05 CW032-SHIP-WD-QTY             PIC  S9(4)V9(3) COMP-3.             
           05 CW032-SHIP-DPTH-QTY           PIC  S9(4)V9(3) COMP-3.             
           05 CW032-SHIP-HT-QTY             PIC  S9(4)V9(3) COMP-3.             
           05 CW032-SHIP-WT-QTY             PIC  S9(5)V9(3) COMP-3.             
           05 CW032-SHIP-DIM-SRC-CDE        PIC   X(1).                         
           05 CW032-PKG-DESC                PIC   X(20).                        
           05 CW032-SHIP-RSTRC-DESC         PIC   X(20).                        
           05 CW032-GFT-WRAP-AVL-IND        PIC   X(1).                         
           05 CW032-PRD-GP-NBR              PIC  S9(8)V COMP-3.                 
           05 CW032-PRD-GP-IND              PIC   X(1).                         
           05 CW032-SHIP-SRCHG-FEE-AMT      PIC  S9(3)V9(2) COMP-3.             
           05 CW032-SHIP-SRVC-DESC          PIC   X(20).                        
           05 CW032-SHIP-GP-DESC            PIC   X(20).                        
           05 CW032-TRNSTN-IND              PIC   X(01).                        
           05 CW032-WEB-EXCLV-IND           PIC   X(01).                        
           05 CW032-EXTD-SZ-CDE             PIC   X(02).                        
           05 CW032-PO-SHRT-CYC-IND         PIC   X(01).                        
           05 CW032-EFF-BEG-DTE             PIC   X(10).                        
           05 CW032-CORP-RTL-AMT            PIC  S9(7)V9(2) COMP-3.             
           05 CW032-CORP-COST-AMT           PIC  S9(7)V9(3) COMP-3.             
           05 CW032-CORP-GP-PRIC-ID         PIC  S9(9)      COMP.               
           05 CW032-ORIG-CLR-DTE            PIC   X(10).                        
           05 CW032-MKDN-CDE                PIC   X(1).                         
