      ***************************************************************           
      *   CWRD001 - VENDOR STYLE DUMMY CREATE                                   
      *   RECORD LENGTH = 107 BYTES                                             
      ***************************************************************           
       01  CW001-RECORD.                                                        
               10  CW001-RMS-STYL-ID        PIC   9(8).                         
               10  CW001-DEPT-NBR           PIC   9(4).                         
               10  CW001-MAJ-CL-NBR         PIC   9(4).                         
               10  CW001-SUB-CL-NBR         PIC   9(4).                         
               10  CW001-VS-ID              PIC   9(10).                        
               10  CW001-ENT-ID             PIC   9(10).                        
               10  CW001-VS-NBR             PIC   X(20).                        
               10  CW001-STKR-NBR           PIC   9(5).                         
               10  CW001-VS-DESC            PIC   X(30).                        
               10  CW001-MAP-UNT-RTL-AMT    PIC  +9(7).9(2).                    
               10  CW001-LBL-TYP-CDE        PIC   X(01).                        
