      ***************************************************************           
      *   CWRD005 - SKU RECORD                                                  
      *   RECORD LENGTH = 499 BYTES                                             
      ***************************************************************           
       01  CW005-SKU-RECORD.                                                    
                                                                                
           05  CW005-INTR-UPC-ID-RED        PIC  +9(10).                        
           05  CW005-INTR-UPC-ID-GROUP REDEFINES CW005-INTR-UPC-ID-RED.         
               10  CW005-INTR-UPC-ID-SIGN   PIC   X(01).                        
               10  CW005-INTR-UPC-ID        PIC   9(10).                        
                                                                                
           05  CW005-RMS-STYL-ID-RED        PIC  +9(8).                         
           05  CW005-RMS-STYL-ID-GROUP REDEFINES CW005-RMS-STYL-ID-RED.         
               10  CW005-RMS-STYL-ID-SIGN   PIC   X(1).                         
               10  CW005-RMS-STYL-ID        PIC   9(8).                         
                                                                                
           05  CW005-ITM-NBR-RED            PIC  +9(15).                        
           05  CW005-ITM-NBR-GROUP REDEFINES CW005-ITM-NBR-RED.                 
               10  CW005-ITM-NBR-SIGN       PIC   X(1).                         
               10  CW005-ITM-NBR            PIC   9(15).                        
                                                                                
           05  CW005-SKU-RED                PIC  +9(8).                         
           05  CW005-SKU-GROUP REDEFINES CW005-SKU-RED.                         
               10  CW005-SKU-SIGN           PIC   X(1).                         
               10  CW005-SKU                PIC   9(8).                         
                                                                                
           05  CW005-INTR-UPC-DESC          PIC   X(30).                        
           05  CW005-SKU-STAT-CDE           PIC   X(2).                         
           05  CW005-SKU-STAT-DESC          PIC   X(10).                        
           05  CW005-INNR-PK-QTY            PIC  +9(5).                         
           05  CW005-OUTR-PK-QTY            PIC  +9(5).                         
                                                                                
           05  CW005-KOHLS-SIZE-CDE-RED     PIC +9(10).                         
           05  CW005-KOHLS-SIZE-CDE-GROUP REDEFINES                             
               CW005-KOHLS-SIZE-CDE-RED.                                        
               10  CW005-KOHLS-SIZE-CDE-SIGN PIC  X(1).                         
               10  CW005-KOHLS-SIZE-CDE      PIC  9(10).                        
                                                                                
           05  CW005-KOHLS-SIZE-DESC        PIC   X(10).                        
           05  CW005-NRF-CLOR-CDE           PIC   X(3).                         
           05  CW005-NRF-CLOR-DESC          PIC   X(10).                        
           05  CW005-SHRT-CLOR-DESC         PIC   X(4).                         
           05  CW005-CSTM-CLOR-DESC         PIC   X(10).                        
           05  CW005-CUSTFACG-CLOR-DESC     PIC   X(22).                        
           05  CW005-REGN-PRIC-IND          PIC   X(1).                         
           05  CW005-RPLNMT-IND             PIC   X(1).                         
           05  CW005-KY-ITM-IND             PIC   X(1).                         
           05  CW005-POG-IND                PIC   X(1).                         
           05  CW005-GP-CDE                 PIC   X(3).                         
           05  CW005-SEA-DESC               PIC   X(20).                        
           05  CW005-UNT-COST-1ST-AMT       PIC  +9(7).9(3).                    
           05  CW005-TX-PRD-CDE-DESC        PIC   X(20).                        
           05  CW005-WT-UM-CDE              PIC   X(2).                         
           05  CW005-WT-UM-QTY              PIC  +9(5).9(3).                    
           05  CW005-SIZE-UM-CDE            PIC   X(2).                         
           05  CW005-WD-UM-QTY              PIC  +9(4).9(3).                    
           05  CW005-HT-UM-QTY              PIC  +9(4).9(3).                    
           05  CW005-DPTH-UM-QTY            PIC  +9(4).9(3).                    
           05  CW005-E-BUS-ITM-IND          PIC   X(1).                         
           05  CW005-ASRT-BEG-DTE           PIC   X(10).                        
           05  CW005-ASRT-END-DTE           PIC   X(10).                        
           05  CW005-STRG-AREA-DESC         PIC   X(20).                        
           05  CW005-SHIP-WD-QTY            PIC  +9(4).9(3).                    
           05  CW005-SHIP-DPTH-QTY          PIC  +9(4).9(3).                    
           05  CW005-SHIP-HT-QTY            PIC  +9(4).9(3).                    
           05  CW005-SHIP-WT-QTY            PIC  +9(5).9(3).                    
           05  CW005-SHIP-DIM-SRC-CDE       PIC   X(1).                         
           05  CW005-PKG-DESC               PIC   X(20).                        
           05  CW005-SHIP-RSTRC-DESC        PIC   X(20).                        
           05  CW005-GFT-WRAP-AVL-IND       PIC   X(1).                         
           05  CW005-PRD-GP-NBR             PIC  9(8).                          
           05  CW005-PRD-GP-IND             PIC   X(1).                         
           05  CW005-SHIP-SRCHG-FEE-AMT     PIC  +9(3).9(2).                    
           05  CW005-SHIP-SRVC-DESC         PIC   X(20).                        
           05  CW005-SHIP-GP-DESC           PIC   X(20).                        
           05  CW005-TRNSTN-IND             PIC   X(01).                        
           05  CW005-WEB-EXCLV-IND          PIC   X(01).                        
           05  CW005-EXTD-SZ-CDE            PIC   X(02).                        
           05  CW005-PO-SHRT-CYC-IND        PIC   X(01).                        
           05  CW005-EFF-BEG-DTE            PIC   X(10).                        
           05  CW005-CORP-RTL-AMT           PIC  +9(7).99.                      
           05  CW005-CORP-COST-AMT          PIC  +9(7).999.                     
           05  CW005-CORP-GP-PRIC-ID        PIC   9(9).                         
           05  CW005-ORIG-CLR-DTE           PIC   X(10).                        
           05  CW005-MKDN-CDE               PIC   X(1).                         
           05  CW005-CHANGE-IND             PIC   X(1).                         
