      ***************************************************************           
      *   CWRD050 - DUMMY CUSTOMER CHOICE CREATE                                
      *   RECORD LENGTH = 118 BYTES                                             
      ***************************************************************           
       01  CW050-RECORD.                                                        
           05  CW050-CUST-CHOICE-ID       PIC   9(10).                          
           05  FILLER                     PIC   X(01) VALUE '|'.                
           05  CW050-DUMMY-CC-DESC.                                             
               10  CW050-DUMMY-CC-DESC-21 PIC   X(21).                          
               10  CW050-DUMMY-SPACE      PIC   X(01).                          
               10  CW050-DUMMY-CC-DESC-9  PIC   9(10).                          
           05  FILLER                     PIC   X(01) VALUE '|'.                
           05  CW050-RMS-STYL-ID          PIC   9(08).                          
           05  FILLER                     PIC   X(01) VALUE '|'.                
           05  CW050-CSTM-CLOR-DESC       PIC   X(10).                          
           05  FILLER                     PIC   X(01) VALUE '|'.                
           05  CW050-NRF-CLOR-CDE         PIC   X(03).                          
           05  FILLER                     PIC   X(01) VALUE '|'.                
           05  CW050-CREATE-DTE           PIC   X(10).                          
           05  FILLER                     PIC   X(01) VALUE '|'.                
           05  CW050-CREATE-USER-ID       PIC   X(08).                          
           05  FILLER                     PIC   X(01) VALUE '|'.                
           05  CW050-EFF-BEG-DTE          PIC   X(10).                          
           05  FILLER                     PIC   X(01) VALUE '|'.                
           05  CW050-EFF-END-DTE          PIC   X(10).                          
           05  FILLER                     PIC   X(01) VALUE '|'.                
           05  CW050-SKU-NBR              PIC   9(08).                          
