      ***************************************************************           
      *   CWRD002 - DUMMY SKU / DUMMY UPC                                       
      *   RECORD LENGTH = 343 BYTES                                             
      ***************************************************************           
       01  CW002-RECORD.                                                        
           05 CW002-DEPT-NBR            PIC 9(4).                               
           05 CW002-MAJ-CL-NBR          PIC 9(4).                               
           05 CW002-SUB-CL-NBR          PIC 9(4).                               
           05 CW002-RMS-STYL-ID         PIC 9(10).                              
           05 CW002-SKU-STAT-CDE        PIC X(2).                               
           05 CW002-KOHLS-SIZE-CDE      PIC 9(10).                              
           05 CW002-NRF-CLOR-CDE        PIC X(3).                               
           05 CW002-SIZE-UM-CDE         PIC X(2).                               
           05 CW002-WT-UM-CDE           PIC X(2).                               
           05 CW002-INTR-UPC-ID         PIC 9(10).                              
           05 CW002-ITM-NBR             PIC 9(15).                              
           05 CW002-SKU-NBR             PIC 9(8).                               
           05 CW002-SKU-DESC            PIC X(30).                              
           05 CW002-INNR-PK-QTY         PIC +9(5).                              
           05 CW002-OUTR-PK-QTY         PIC +9(5).                              
           05 CW002-EDI-ORD-IND         PIC X(1).                               
           05 CW002-CSTM-CLOR-DESC      PIC X(10).                              
           05 CW002-CUSTFACG-CLOR-DESC  PIC X(22).                              
           05 CW002-REGN-PRIC-IND       PIC X(1).                               
           05 CW002-RPLNMT-IND          PIC X(1).                               
           05 CW002-KY-ITM-IND          PIC X(1).                               
           05 CW002-POG-IND             PIC X(1).                               
           05 CW002-GP-CDE              PIC X(3).                               
           05 CW002-SEA-DESC            PIC X(20).                              
           05 CW002-UNT-COST-1ST-AMT    PIC +9(7).9(3).                         
           05 CW002-TX-PRD-CDE-DESC     PIC X(20).                              
           05 CW002-WT-UM-QTY           PIC +9(5).9(3).                         
           05 CW002-WD-UM-QTY           PIC +9(4).9(3).                         
           05 CW002-HT-UM-QTY           PIC +9(4).9(3).                         
           05 CW002-DPTH-UM-QTY         PIC +9(4).9(3).                         
           05 CW002-E-BUS-ITM-IND       PIC X(1).                               
           05 CW002-UPC-TYP-CDE         PIC X(1).                               
           05 CW002-UPC-SRC-CDE         PIC X(1).                               
           05 CW002-UPC-ID              PIC 9(10).                              
           05 CW002-UPC-NBR             PIC 9(15).                              
           05 CW002-PREPK-IND           PIC X(1).                               
           05 CW002-CERTD-IND           PIC X(1).                               
           05 CW002-CERTD-DTE           PIC X(10).                              
           05 CW002-TRNSTN-IND          PIC X(01).                              
           05 CW002-WEB-EXCLV-IND       PIC X(01).                              
           05 CW002-EXTD-SZ-CDE         PIC X(02).                              
           05 CW002-PO-SHRT-CYC-IND     PIC X(01).                              
           05 CW002-EFF-BEG-DTE         PIC X(10).                              
           05 CW002-CORP-RTL-AMT        PIC +9(7).99.                           
           05 CW002-CORP-COST-AMT       PIC +9(7).999.                          
           05 CW002-CORP-GP-PRIC-ID     PIC  9(9).                              
           05 CW002-ORIG-CLR-DTE        PIC  X(10).                             
           05 CW002-MKDN-CDE            PIC  X(1).                              
