      ******************************************************************00010022
      *    DARD100 - DEBIT ALLOWANCE COPYBOOK                           00020022
W30021*    LENGTH  - 350 BYTES                                          00030022
      *                                                                 00040022
      *CHANGE HISTORY:                                                  00050022
      * PROJ   DATE       PGMR       DESCRIPTION                        00060022
      * ------ ---------- ---------- ---------------------------------- 00070022
W30021* 30021  01/20/2006 J BLAZICH  CORRECTED RECORD LENGTH            00071022
      *        03/09/2001            ADDED FISCAL YEAR TO COPYBOOK.     00080022
22405 * 22405  05-31-2001 R JANSSEN  DAII - ASSET RECOVERY ENHANCEMENT  00090022
      *W22601  04-20-2004 S JACKSON  STORE NUMBER EXPANSION             00100022
W30021*W30021  05-04-2006 P KEBER    ADD NEW OFF INVOICE DEBIT TYPES    00101026
      ******************************************************************00110022
       01  DARD100-RECORD.                                              00120022
           10  DA100-DR-ALW-NBR            PIC X(16).                   00130022
           10  DA100-DEPT-NBR              PIC X(03).                   00140022
           10  DA100-MAJ-CL-NBR            PIC X(02).                   00150022
           10  DA100-SUB-CL-NBR            PIC X(02).                   00160022
           10  DA100-ENT-ID                PIC S9(10)    COMP-3.        00170022
           10  DA100-TYP-CDE               PIC X(02).                   00180022
               88  DA100-TYP-CDE-AA                  VALUE 'AA'.        00190022
22405          88  DA100-TYP-CDE-AR                  VALUE 'AR'.        00200022
               88  DA100-TYP-CDE-FS                  VALUE 'FS'.        00210022
               88  DA100-TYP-CDE-IL                  VALUE 'IL'.        00220022
               88  DA100-TYP-CDE-MA                  VALUE 'MA'.        00230022
               88  DA100-TYP-CDE-MO                  VALUE 'MO'.        00240022
W30021         88  DA100-TYP-CDE-PR                  VALUE 'PR'.        00241025
W30021         88  DA100-TYP-CDE-PC                  VALUE 'PC'.        00242025
W30021         88  DA100-TYP-CDE-AC                  VALUE 'AC'.        00243025
           10  DA100-EFF-DTE               PIC X(19).                   00250022
           10  DA100-FSCL-MN-NBR           PIC S9(02)    COMP-3.        00260022
           10  DA100-FSCL-YR-NBR           PIC S9(4)     COMP-3.        00270022
           10  DA100-STAT-CDE              PIC X(02).                   00280022
           10  DA100-CLLCTN-MTHD-CDE       PIC X(02).                   00290022
           10  DA100-CLLCTN-DAYS-NBR       PIC S9(03)    COMP-3.        00300022
           10  DA100-NET-CST-AMT           PIC S9(07)V99 COMP-3.        00310022
           10  DA100-MKUP-PCT              PIC S9(03)V99 COMP-3.        00320022
           10  DA100-CENPPC-NBR            PIC S9(07)    COMP-3.        00330022
           10  DA100-PO-NBR                PIC S9(10)    COMP-3.        00340022
           10  DA100-RSN-CDE               PIC X(02).                   00350022
           10  DA100-CRE-BY-USR-ID         PIC X(08).                   00360022
           10  DA100-CRE-DTE               PIC X(19).                   00370022
           10  DA100-DMM-UPD-BY-USR-ID     PIC X(08).                   00380022
           10  DA100-DMM-UPD-DTE           PIC X(19).                   00390022
           10  DA100-AP-UPD-BY-USR-ID      PIC X(08).                   00400022
           10  DA100-AP-UPD-DTE            PIC X(19).                   00410022
           10  DA100-LAST-UPD-BY-USR-ID    PIC X(08).                   00420022
           10  DA100-LAST-UPD-DTE          PIC X(19).                   00430022
           10  DA100-NOTE-LINE1            PIC X(50).                   00440022
           10  DA100-NOTE-LINE2            PIC X(50).                   00450022
           10  DA100-BATCH-NBR             PIC X(03).                   00460022
W26601     10  DA100-STR-NBR               PIC X(05).                   00470022
           10  DA100-RTL-AMT               PIC S9(09)V99 COMP-3.        00480022
W30021     10  FILLER                      PIC X(47).                   00500023
