      *****************************************************************         
      *    DARD108 - DEBIT ALLOWANCE AVAILABLE VENDOR FUNDING PURGE             
      *              TDAALW EXTRACT COPYBOOK                                    
      *    RECORD LENGTH - 28 BYTES                                             
      *                                                                         
      *CHANGE HISTORY:                                                          
      * PROJ   DATE       PGMR       DESCRIPTION                                
      * ------ ---------- ---------- ----------------------------------         
      * W30021 2006-05-16 P. KEBER   INITIAL CREATION                           
      *****************************************************************         
       01  DA108-AVL-VND-FUND-TDAALW-REC.                                       
           05  DA108-ENTITY-ID               PIC 9(09)     VALUE ZERO.          
           05  FILLER                        PIC X(02)     VALUE SPACES.        
           05  DA108-DEPT-NBR                PIC 9(03)     VALUE ZERO.          
           05  FILLER                        PIC X(01)     VALUE SPACES.        
           05  DA108-NET-COST-AMT            PIC 9(11)V99  VALUE ZEROES.        
