      ******************************************************************00000100
      *    DARD104 - DEBIT ALLOWANCE OPEN FISCAL WEEK/MONTH DATES      *00000206
      *    LENGTH  - 50 BYTES                                          *00000300
      ******************************************************************00000400
      ******************************************************************00000500
      *    WR/PITS#     DATE        DESCRIPTION                        *00000600
      *    --------   --------     ---------------------------------   *00000700
      *               03/08/2001   ADDED FISCAL YEAR NUMBER            *00000807
      ******************************************************************00000900
       01  DARD104-RECORD.                                              00001000
           05  DA104-OPN-FSCL-MN-DTE        PIC X(10).                  00001101
           05  DA104-OPN-FSCL-MN-NBR        PIC X(02).                  00001201
           05  DA104-OPN-FSCL-WK-DTE        PIC X(10).                  00002001
           05  DA104-OPN-FSCL-WK-NBR        PIC X(02).                  00010001
           05  DA104-OPN-FSCL-YR-NBR        PIC X(04).                  00020007
