      *****************************************************************         
      *    DARD106 - DEBIT ALLOWANCE BY DMM, BUYERS AND VENDOR EXTRACT          
      *              COPYBOOK                                                   
      *    RECORD LENGTH - 165 BYTES                                            
      *                                                                         
      *CHANGE HISTORY:                                                          
      * PROJ   DATE       PGMR       DESCRIPTION                                
      * ------ ---------- ---------- ----------------------------------         
      *****************************************************************         
       01  DA106-AVL-VND-FUND-REC.                                              
           05  DA106-GMM                     PIC X(02)     VALUE SPACES.        
           05  DA106-DMM                     PIC X(02)     VALUE SPACES.        
           05  DA106-BUYER                   PIC X(03)     VALUE SPACES.        
           05  DA106-VENDOR-NBR              PIC X(09)     VALUE SPACES.        
           05  DA106-VENDOR-NAME             PIC X(30)     VALUE SPACES.        
           05  DA106-DEPT-NBR                PIC X(03)     VALUE SPACES.        
           05  DA106-CRRNT-AVL-COST-AMT      PIC 9(11)V99  VALUE ZEROES.        
           05  DA106-PREV-AVL-COST-AMT       PIC 9(11)V99  VALUE ZEROES.        
           05  DA106-GMM-FIR-NAME            PIC X(12)     VALUE SPACES.        
           05  DA106-GMM-LAST-NAME           PIC X(18)     VALUE SPACES.        
           05  DA106-DMM-FIR-NAME            PIC X(12)     VALUE SPACES.        
           05  DA106-DMM-LAST-NAME           PIC X(18)     VALUE SPACES.        
           05  DA106-BYR-FIR-NAME            PIC X(12)     VALUE SPACES.        
           05  DA106-BYR-LAST-NAME           PIC X(18)     VALUE SPACES.        
