      *****************************************************************         
      *    DARD107 - DEBIT ALLOWANCE AVAILABLE VENDOR FUNDING PURGE             
      *              DAT_AVL_VND_FUND EXTRACT COPYBOOK                          
      *    RECORD LENGTH - 47 BYTES                                             
      *                                                                         
      *CHANGE HISTORY:                                                          
      * PROJ   DATE       PGMR       DESCRIPTION                                
      * ------ ---------- ---------- ----------------------------------         
      * W30021 2006-05-16 P. KEBER   INITIAL CREATION                           
      *****************************************************************         
       01  DA107-AVL-VND-FUND-EXTRACT-REC.                                      
           05  DA107-ENTITY-ID               PIC 9(09)     VALUE ZERO.          
           05  FILLER                        PIC X(02)     VALUE SPACES.        
           05  DA107-DEPT-NBR                PIC 9(04)     VALUE ZERO.          
           05  FILLER                        PIC X(02)     VALUE SPACES.        
           05  DA107-SUB-CL-NBR              PIC 9(04)     VALUE ZERO.          
           05  FILLER                        PIC X(02)     VALUE SPACES.        
           05  DA107-EFF-BEG-DTE             PIC X(10)     VALUE SPACES.        
           05  FILLER                        PIC X(01)     VALUE SPACE.         
           05  DA107-AVL-COST-AMT            PIC 9(11)V99  VALUE ZEROES.        
