      ******************************************************************00010004
      **                   DAWS304                                    **00020004
      **                                                              **00030001
      **  THIS COPYBOOK CONTAINS THE WORKING-STORAGE ELEMENTS         **00040004
      **  PASSED FROM SUBROUTINE DAKUT304 TO DAKUT301 AND DAKUT305    **00050004
      ******************************************************************00070004
       01  DA304-PARAMATERS.                                            00080004
           05  DA304-IO-PARMS.                                          00090004
               10  DA304-FUNCTION-CODE             PIC   X(09).         00100004
                   88  DA304-INIT-SELECT-FOR-DAKUT301 VALUE 'DAKUT301I'.00110004
                   88  DA304-REG-SELECT-FOR-DAKUT301  VALUE 'DAKUT301R'.00110004
                   88  DA304-REG-SELECT-FOR-DAKUT305  VALUE 'DAKUT305R'.00110004
               10  DA304-ENT-ID                    PIC S9(09)  COMP.    00170004
               10  DA304-TYP-CDE                   PIC X(02).           00170004
               10  DA304-DEPT-NBR                  PIC X(03).                   
               10  DA304-SUB-CL-NBR                PIC X(02).                   
               10  DA304-EFF-DTE                   PIC X(10).                   
           05  DA304-DAKUT301-RETURN-DATA.                              00250004
               10  DA304-TAPCNTL-DATA.                                  00250004
                   15  DA304-PAYT-FLOAT-DAY-QTY    PIC X(06).           00290004
                   15  DA304-EXC-FLT-DAY-QTY       PIC X(06).           00290004
                   15  DA304-RCVG-VARN-DAY-QTY     PIC X(06).           00290004
                   15  DA304-TAPCNTL-ERROR-MESSAGE PIC X(79).           00660004
                   15  DA304-TAPCNTL-RETURN-CODE   PIC 9(01).           00670004
                       88  DA304-TAPCNTL-GOOD-CALL    VALUE 0.          00680004
                       88  DA304-TAPCNTL-BAD-CALL     VALUE 1.          00690004
               10  DA304-TTRNCDE-DATA.                                  00250004
I30021             15  DA304-TTRNCDE-TABLE OCCURS 500 TIMES.                    
                       20  DA304-AP-TRN-CDE        PIC X(02).                   
                       20  DA304-PSTG-TYP-CDE      PIC X(02).                   
                       20  DA304-TRN-TYP-CDE       PIC X(03).                   
                       20  DA304-GL-ACCT-NBR       PIC X(06).                   
                       20  DA304-BTCH-SRC-CDE      PIC X(03).                   
                   15  DA304-TTRNCDE-ERROR-MESSAGE PIC X(79).           00660004
                   15  DA304-TTRNCDE-RETURN-CODE   PIC 9(01).           00670004
                       88  DA304-TTRNCDE-GOOD-CALL    VALUE 0.          00680004
                       88  DA304-TTRNCDE-BAD-CALL     VALUE 1.          00690004
               10  DA304-VENDOR-DATA.                                   00250004
                   15  DA304-VENDOR-NAME           PIC X(30).           00260004
                   15  DA304-DUN-NBR               PIC X(09).           00210004
                   15  DA304-VENDOR-ERROR-MESSAGE  PIC X(79).           00660004
                   15  DA304-VENDOR-RETURN-CODE    PIC 9(01).           00670004
                       88  DA304-VENDOR-GOOD-CALL     VALUE 0.          00680004
                       88  DA304-VENDOR-BAD-CALL      VALUE 1.          00690004
               10  DA304-DTATTR-DATA.                                   00250004
                   15  DA304-DTATTR-FSCL-YR-NBR    PIC X(04).           00290004
                   15  DA304-DTATTR-WK-IN-MN-NBR   PIC X(01).           00290004
                   15  DA304-DTATTR-ERROR-MESSAGE  PIC X(79).           00660004
                   15  DA304-DTATTR-RETURN-CODE    PIC 9(01).           00670004
                       88  DA304-DTATTR-GOOD-CALL     VALUE 0.          00680004
                       88  DA304-DTATTR-BAD-CALL      VALUE 1.          00690004
               10  DA304-MLCNTL-DATA.                                   00250004
                   15  DA304-MLCNTL-MX-FSCL-WK-NBR PIC X(02).           00290004
                   15  DA304-MLCNTL-MX-FSCL-MN-NBR PIC X(02).           00290004
                   15  DA304-MLCNTL-MX-FSCL-WK-DTE PIC X(10).           00290004
                   15  DA304-MLCNTL-MX-FSCL-MN-DTE PIC X(10).           00290004
                   15  DA304-MLCNTL-ERROR-MESSAGE  PIC X(79).           00660004
                   15  DA304-MLCNTL-RETURN-CODE    PIC 9(01).           00670004
                       88  DA304-MLCNTL-GOOD-CALL     VALUE 0.          00680004
                       88  DA304-MLCNTL-BAD-CALL      VALUE 1.          00690004
               10  DA304-MBS-DATA.                                      00250004
                   15  DA304-MBS-BUYER-NBR         PIC X(03).           00290004
                   15  DA304-MBS-ERROR-MESSAGE     PIC X(79).           00660004
                   15  DA304-MBS-RETURN-CODE       PIC 9(01).           00670004
                       88  DA304-MBS-GOOD-CALL        VALUE 0.          00680004
                       88  DA304-MBS-BAD-CALL         VALUE 1.          00690004
               10  DA304-BUYER-DATA.                                    00250004
                   15  DA304-BUYER-FIRST-NAME      PIC X(12).           00290004
                   15  DA304-BUYER-LAST-NAME       PIC X(18).           00290004
                   15  DA304-BUYER-ERROR-MESSAGE   PIC X(79).           00660004
                   15  DA304-BUYER-RETURN-CODE     PIC 9(01).           00670004
                       88  DA304-BUYER-GOOD-CALL      VALUE 0.          00680004
                       88  DA304-BUYER-BAD-CALL       VALUE 1.          00690004
           05  DA304-GENERAL-ERROR-MESSAGE         PIC X(79).           00660004
           05  DA304-GENERAL-RETURN-CODE           PIC 9(01).           00670004
               88  DA304-GOOD-CALL                    VALUE 0.          00680004
               88  DA304-BAD-CALL                     VALUE 1.          00690004
