000100 IDENTIFICATION DIVISION.                                         00010000
000300 PROGRAM-ID.      DFKUT008.                                       00030000
000400 AUTHOR.          DEANNA BRANTNER.                                00040000
000500 INSTALLATION.    KOHLS DEPARTMENT STORES.                        00050000
000600 DATE-WRITTEN.    SEPTEMBER, 2009.                                00060000
000700 DATE-COMPILED.                                                   00070000
000800                                                                  00080000
000900******************************************************************00090000
001200* THIS PROGRAM PREPARES THE ML FLASH UPDATE FILE TO BE PROCESSED  00120000
001300* BY DFKUP004 UNDER THE DB2 CHECKPOINT RESTART SYSTEM.            00130000
001400*                                                                 00140000
001500* THE PROGRAM READS THE ML FLASH UPDATE FILE, REFORMATS THE       00150000
001600* RECORDS AND SETS A CHECKPOINT INDICATOR ON THE RECORD BASED     00160000
001700* ON HOW CHECKPOINTS WILL BE TAKEN BY THE MAINTENANCE PROGRAM.    00170000
001800* AFTER A RECORD HAS BEEN REFORMATTED IT IS PASSED TO THE         00180000
001900* TRANSACTION PREPARATION MODULE (DPKUT900) WHICH DOES SOME MORE  00190000
002000* PROCESSING ON THE RECORDS AND WRITES THE REFORMATTED RECORDS    00200000
002100* OUT TO A SEQUENTIAL FILE.                                       00210000
002200*                                                                 00220000
002300* THE PROGRAM COMMUNICATES WITH THE TRANSACTION PREPARATION       00230000
002400* MODULE USING FUNCTION CODES (OPEN, WRITE, & CLOSE) AND CHECKS   00240000
002500* THE RETURN CODE AFTER EACH REQUEST.  IF AN INVALID RETURN CODE  00250000
002600* IS RECEIVED, ANY INFORMATION THAT MAY BE HELPFUL IN RESOLVING   00260000
002700* THE BAD RETURN CODE IS DISPLAYED ON SYSOUT AND THE PROGRAM      00270000
002800* ABENDS.                                                         00280000
000900******************************************************************00281007
260107* CHG0260107 - 08/18/21  JIM HUNTER                               00290007
260107* ADDING COPYBOOK DPWS990 TO MAKE CALL TO DPKUT900 DYNAMIC.       00291007
000900******************************************************************00300000
003700 ENVIRONMENT DIVISION.                                            00370000
003800 CONFIGURATION SECTION.                                           00380000
004000 SOURCE-COMPUTER.    IBM-3090.                                    00400000
004100 OBJECT-COMPUTER.    IBM-3090.                                    00410000
004200                                                                  00420000
004300 INPUT-OUTPUT SECTION.                                            00430000
004400 FILE-CONTROL.                                                    00440000
004500                                                                  00450000
004600     SELECT UPDATE-FILE   ASSIGN TO INP01.                        00460000
004700                                                                  00470000
004800 DATA DIVISION.                                                   00480000
004900 FILE SECTION.                                                    00490000
005000                                                                  00500000
005100 FD  UPDATE-FILE                                                  00510000
005200     RECORDING MODE IS F                                          00520000
005300     BLOCK CONTAINS 0 RECORDS                                     00530000
005400     LABEL RECORDS ARE OMITTED.                                   00540000
005500                                                                  00550000
005600 01  UPDATE-REC                       PIC  X(25).                 00560000
005700                                                                  00570000
005800***************************************************************** 00580000
005900*                       WORKING STORAGE                           00590000
006000***************************************************************** 00600000
006100 WORKING-STORAGE SECTION.                                         00610000
006200                                                                  00620000
006300 01  W-START                          PIC  X(40)                  00630000
006400     VALUE 'DFKUT008 - WORKING STORAGE BEGINS HERE'.              00640000
006500                                                                  00650000
006700***************************************************************** 00670000
006800*                         SWITCHES                                00680000
006900***************************************************************** 00690000
007000 01  PROGRAM-SWITCHES.                                            00700000
007100     05  PS-INPUT-UPDATE-EOF-SW       PIC  X(01) VALUE 'N'.       00710000
007200         88  PS-INPUT-UPDATE-EOF                 VALUE 'Y'.       00720000
007300     05  PS-FIRST-TRANS-READ-SW       PIC  X(01) VALUE 'Y'.       00730000
007400         88  FIRST-TRANS-READ                    VALUE 'Y'.       00740000
007500                                                                  00750000
007600******************************************************************00760000
007700*                       ACCUMULATORS                              00770000
007800******************************************************************00780000
007900 01  PROGRAM-ACCUMULATORS.                                        00790000
008000     05  PA-READ                      PIC  9(11) VALUE ZEROS.     00800000
008100     05  PA-WRITTEN                   PIC  9(11) VALUE ZEROS.     00810000
008200                                                                  00820000
008300******************************************************************00830000
008400*                           CONSTANTS                             00840000
008500******************************************************************00850000
008600 01  PROGRAM-CONSTANTS.                                           00860000
008700     05  PC-PROGRAM-NAME              PIC  X(08) VALUE 'DFKUT008'.00870000
008800                                                                  00880000
008900     05  PC-TRAN-PREP-FUNC-CODES.                                 00890000
009000         10  PC-TRAN-PREP-FUNC-OPEN   PIC  X(05) VALUE 'OPEN '.   00900000
009100         10  PC-TRAN-PREP-FUNC-WRITE  PIC  X(05) VALUE 'WRITE'.   00910000
009200         10  PC-TRAN-PREP-FUNC-CLOSE  PIC  X(05) VALUE 'CLOSE'.   00920000
009300                                                                  00930000
009400     05  PC-JOB-NAME                  PIC  X(08) VALUE 'DFK105  '.00940000
009500     05  PC-PLAN-NAME                 PIC  X(08) VALUE 'DFKUP004'.00950000
009600     05  PC-TRANS-RECORD-LENGTH       PIC S9(04) VALUE +25 COMP.  00960000
009700                                                                  00970000
009800******************************************************************00980000
009900*                          VARIABLES                              00990000
010000******************************************************************01000000
010100 01  PROGRAM-VARIABLES.                                           01010000
010200     05  PV-PARAGRAPH-NAME            PIC  X(30) VALUE SPACES.    01020000
010300     05  PV-OPERATION-MSG             PIC  X(60) VALUE SPACES.    01030000
010400     05  PV-RET-CODE                  PIC  9(04) VALUE ZEROS.     01040000
010500                                                                  01050000
010600     05  PV-CHECKPOINT-TYPE           PIC  X(01) VALUE SPACE.     01060000
010700         88  CONTROL-BREAK                       VALUE 'C'.       01070000
010800         88  LOGICAL-TRANSACTION                 VALUE 'L'.       01080000
010900         88  TIME-INTERVAL                       VALUE 'T'.       01090000
011000         88  REQUESTED-BY-PROGRAM                VALUE 'R'.       01100000
011100                                                                  01110000
011300     05  PV-HOLD-DEPT-NBR             PIC  X(03).                 01120002
011700     05  PV-INTEGER                   PIC S9(11) VALUE +0.        01121003
011800     05  PV-DECIMAL                   PIC S9(11) VALUE +0.        01122003
011500                                                                  01130000
011600******************************************************************01140000
011700*               SYSTEM TIME AND DATE VARIABLES                    01150000
011800******************************************************************01160000
011900 01  SYS-DATE-TIME.                                               01170000
012000     05  SYS-DATE                     PIC  X(08) VALUE SPACES.    01180000
012100     05  SYS-TIME                     PIC  X(08) VALUE SPACES.    01190000
012200                                                                  01200000
012300 01  ST-BEG-TIME.                                                 01210000
012400     05  ST-BEG-HR                    PIC  9(02) VALUE ZEROS.     01220000
012500     05  FILLER                       PIC  X(01) VALUE ':'.       01230000
012600     05  ST-BEG-MN                    PIC  9(02) VALUE ZEROS.     01240000
012700                                                                  01250000
012800 01  ST-END-TIME.                                                 01260000
012900     05  ST-END-HR                    PIC  9(02) VALUE ZEROS.     01270000
013000     05  FILLER                       PIC  X(01) VALUE ':'.       01280000
013100     05  ST-END-MN                    PIC  9(02) VALUE ZEROS.     01290000
013200                                                                  01300000
013300 01  SD-EDIT-DATE.                                                01310000
013400     05  SD-MONTH                     PIC  9(02) VALUE ZEROS.     01320000
013500     05  FILLER                       PIC  X(01) VALUE '-'.       01330000
013600     05  SD-DAY                       PIC  9(02) VALUE ZEROS.     01340000
013700     05  FILLER                       PIC  X(01) VALUE '-'.       01350000
013800     05  SD-CENT                      PIC  9(02) VALUE ZEROS.     01360000
013900     05  SD-YEAR                      PIC  9(02) VALUE ZEROS.     01370000
014000                                                                  01380000
014100******************************************************************01390000
014200*                        ERROR HANDLING                           01400000
014300******************************************************************01410000
014400 01  ABEND-CODE                       PIC S9(04) VALUE ZEROS      01420000
014500                                                 COMP SYNC.       01430000
014600     88  ABEND-4002-READ-ERROR             VALUE +4002.           01440000
014700     88  ABEND-4019-CAL-SUB-ERROR          VALUE +4019.           01450000
014800                                                                  01460000
016170******************************************************************01480000
016200*    ML SALES FILE LAYOUT                                        *01490000
016300******************************************************************01500000
016400     COPY DFRD005.                                                01510000
016500                                                                  01511000
015500******************************************************************01530000
015600*  TRANSACTION PREPARATION MODULE LINKAGE SECTION                 01540000
015700******************************************************************01550000
260107     COPY DPWS990.                                                01560007
015900                                                                  01570000
015800     COPY DPLS000.                                                01571007
015900                                                                  01572007
016000******************************************************************01580000
016100*  SQL COMMUNICATIONS WORK AREA                                   01590000
016200******************************************************************01600000
016300     COPY SQLCA2.                                                 01610000
016700                                                                  01650000
016800 PROCEDURE DIVISION.                                              01660000
016900******************************************************************01670000
017000* MAINLINE-PROCESSING                                             01680000
017100******************************************************************01690000
017200                                                                  01700000
017300     PERFORM A100-INITIALIZE.                                     01710000
017400                                                                  01720000
017500     PERFORM B100-PROCESS-UPDATE-INPUT-FILE                       01730000
017600       UNTIL PS-INPUT-UPDATE-EOF.                                 01740000
017700                                                                  01750000
017800     PERFORM Z990-END-OF-JOB-ROUTINE.                             01760000
017900                                                                  01770000
018000     GOBACK.                                                      01780000
018100                                                                  01790000
018300******************************************************************01810000
018400* PREFORMS TASK INITIATION                                        01820000
018500******************************************************************01830000
018600 A100-INITIALIZE.                                                 01840000
018700                                                                  01850000
018800     OPEN INPUT UPDATE-FILE.                                      01860000
018900                                                                  01870000
019000     MOVE FUNCTION CURRENT-DATE TO SYS-DATE-TIME.                 01880000
019100                                                                  01890000
019200     MOVE SYS-TIME (1:2) TO ST-BEG-HR.                            01900000
019300     MOVE SYS-TIME (3:2) TO ST-BEG-MN.                            01910000
019400                                                                  01920000
019500     MOVE SYS-DATE (1:2) TO SD-CENT.                              01930000
019600     MOVE SYS-DATE (3:2) TO SD-YEAR.                              01940000
019700     MOVE SYS-DATE (5:2) TO SD-MONTH.                             01950000
019800     MOVE SYS-DATE (7:2) TO SD-DAY.                               01960000
019900                                                                  01970000
020000     PERFORM C100-ISSUE-OPEN-REQUEST.                             01980000
020100                                                                  01990000
020200     PERFORM C200-READ-UPDATE-INPUT-FILE.                         02000000
020300                                                                  02010000
020400     IF PS-INPUT-UPDATE-EOF                                       02020000
020500         MOVE 'C200-READ-UPDATE-INPUT-FILE' TO PV-PARAGRAPH-NAME  02030000
020600         MOVE '** EMPTY UPDATE FILE - NO DATA **'                 02040000
020700                                            TO PV-OPERATION-MSG   02050000
020800         SET ABEND-4002-READ-ERROR TO TRUE                        02060000
020900         PERFORM Z200-ABEND                                       02070000
021000     END-IF.                                                      02080000
021100                                                                  02090000
021300******************************************************************02110000
021400* PROCESS THE UPDATE FILE. IF A RECORD IS READ, GATHER WHATEVER   02120000
021500* OTHER DATA IS NECESSARY TO TAKE CHECKPOINTS BASED ON THE TYPE OF02130000
021600* CHECKPOINTS BEING TAKEN BY DFKUP004 AND ISSUE A WRITE REQUEST   02140000
021700* TO THE TRANSACTION PREPARATION PROGRAM.                         02150000
021800******************************************************************02160000
021900 B100-PROCESS-UPDATE-INPUT-FILE.                                  02170000
022000                                                                  02180000
022100     IF FIRST-TRANS-READ                                          02190000
022300         MOVE DF005-DEPT-NBR  TO PV-HOLD-DEPT-NBR                 02200002
022500         MOVE 'N'             TO PS-FIRST-TRANS-READ-SW           02210000
022600     END-IF.                                                      02220000
022700                                                                  02230000
022800     IF CONTROL-BREAK                                             02240000
022900         PERFORM C300-CKPT-BY-CNTL-BREAK                          02250000
023000     ELSE                                                         02260000
023100         IF LOGICAL-TRANSACTION                                   02270000
023200             PERFORM C400-CKPT-BY-LOGICAL-TRANS                   02280000
023300         ELSE                                                     02290000
023400             PERFORM C500-CKPT-BY-TIME-OR-REQUEST                 02300000
023500         END-IF                                                   02310000
023600     END-IF.                                                      02320000
023700                                                                  02330000
023800     PERFORM C200-READ-UPDATE-INPUT-FILE.                         02340000
023900                                                                  02350000
024100******************************************************************02370000
024200* ISSUE AN 'OPEN' REQUEST TO THE TRANSACTION PREPARATION MODULE   02380000
024300******************************************************************02390000
024400 C100-ISSUE-OPEN-REQUEST.                                         02400000
024500                                                                  02410000
024600     MOVE PC-TRAN-PREP-FUNC-OPEN TO DP000-FUNC-CODE.              02420000
024700     MOVE PC-JOB-NAME            TO DP000-JOB-NAME.               02430000
024800     MOVE PC-PLAN-NAME           TO DP000-PLAN-NAME.              02440000
024900                                                                  02450000
025000     PERFORM Z100-CALL-TRANS-PREP-MODULE.                         02460000
025100                                                                  02470000
025200     MOVE DP000-CKPT-TYPE-CODE   TO PV-CHECKPOINT-TYPE.           02480000
025300                                                                  02490000
025500******************************************************************02510000
025600* READ THE UPDATE INPUT FILE                                      02520000
025700******************************************************************02530000
025800 C200-READ-UPDATE-INPUT-FILE.                                     02540000
025900                                                                  02550000
026000     READ UPDATE-FILE INTO DF005-RECORD                           02560000
026100       AT END SET PS-INPUT-UPDATE-EOF TO TRUE.                    02570000
026200                                                                  02580000
026300     IF PS-INPUT-UPDATE-EOF                                       02590000
026400         CONTINUE                                                 02600000
026500     ELSE                                                         02610000
026600         ADD +1 TO PA-READ                                        02620000
026700     END-IF.                                                      02630000
026800                                                                  02640000
027000******************************************************************02660000
027100* THIS ROUTINE SETS THE CHECKPOINT INDICATOR ON THE TRANSACATION  02670000
027200* RECORD "ON" IF THERE IS A CHANGE IN THE STORE NUMBER. AFTER     02680000
027300* THE TRANSACTION RECORD HAS BEEN FORMATTED, A WRITE REQUEST IS   02690000
027400* ISSUED TO THE TRANSACTION PREPARATION MODULE.                   02700000
027500*                                                                 02710000
027600* NOTE: AT THIS TIME CONTROL/LOGIC BREAK PROCESSING IS IDENTICAL. 02720000
027700******************************************************************02730000
027800 C300-CKPT-BY-CNTL-BREAK.                                         02740000
027900                                                                  02750000
028100     IF  DF005-DEPT-NBR = PV-HOLD-DEPT-NBR                        02760002
028300         MOVE 'N' TO DP000-CHECKPOINT-IND                         02770000
028400     ELSE                                                         02780000
028500         MOVE 'Y' TO DP000-CHECKPOINT-IND                         02790000
028700         MOVE DF005-DEPT-NBR TO PV-HOLD-DEPT-NBR                  02800002
028900     END-IF.                                                      02810000
029000                                                                  02820000
029100     MOVE PC-TRANS-RECORD-LENGTH  TO DP000-TRANS-REC-LENGTH.      02830000
029200     MOVE DF005-RECORD            TO DP000-TRANS-REC.             02840000
029300     MOVE PC-TRAN-PREP-FUNC-WRITE TO DP000-FUNC-CODE.             02850000
029400     MOVE PC-JOB-NAME             TO DP000-JOB-NAME.              02860000
029500     MOVE PC-PLAN-NAME            TO DP000-PLAN-NAME.             02870000
029600                                                                  02880000
029700     PERFORM Z100-CALL-TRANS-PREP-MODULE.                         02890000
029800                                                                  02900000
029900     ADD +1 TO PA-WRITTEN.                                        02910000
030000                                                                  02920000
030200******************************************************************02940000
030300* THIS ROUTINE SETS THE CHECKPOINT INDICATOR ON THE TRANSACTION   02950000
030400* RECORD "ON".  THE UPDATE PROGRAM WILL CHECK THE CHECKPOINT      02960000
030500* FREQUENCY TO KNOW WHETHER A CHECKPOINT SHOULD BE TAKEN. AFTER   02970000
030600* THE TRANSACTION RECORD HAS BEEN FORMATTED, A WRITE REQUEST IS   02980000
030700* ISSUED TO THE TRANSACTION PREPARATION MODULE.                   02990000
030800******************************************************************03000000
030900 C400-CKPT-BY-LOGICAL-TRANS.                                      03010000
031000                                                                  03020000
030800     DIVIDE PA-READ BY +10                                        03021005
030900        GIVING PV-INTEGER                                         03022003
031000        REMAINDER PV-DECIMAL.                                     03023003
031100                                                                  03024003
031200     IF  PV-DECIMAL = +0                                          03025003
031300         MOVE 'Y' TO DP000-CHECKPOINT-IND                         03026003
031400     ELSE                                                         03027003
031500         MOVE 'N' TO DP000-CHECKPOINT-IND                         03028003
031600     END-IF.                                                      03029003
031700                                                                  03029103
031800     MOVE PC-TRANS-RECORD-LENGTH     TO DP000-TRANS-REC-LENGTH.   03029203
032300     MOVE DF005-RECORD               TO DP000-TRANS-REC.          03029303
032000     MOVE PC-TRAN-PREP-FUNC-WRITE    TO DP000-FUNC-CODE.          03029403
032100     MOVE PC-JOB-NAME                TO DP000-JOB-NAME.           03029503
032200     MOVE PC-PLAN-NAME               TO DP000-PLAN-NAME.          03029603
032300                                                                  03029703
032400     PERFORM Z100-CALL-TRANS-PREP-MODULE.                         03029803
032500                                                                  03029903
032600     ADD +1 TO PA-WRITTEN.                                        03030003
032700                                                                  03030103
033300******************************************************************03210000
033400* THIS ROUTINE BUILDS THE TRANSACTION RECORD AND ISSUES A WRITE   03220000
033500* REQUEST TO THE TRANSACTION PREPARATION MODULE IF CHECKPOINTS ARE03230000
033600* TAKEN BY TIME INTERVAL (SECONDS) OR REQUESTED BY THE MAINTENANCE03240000
033700* PROGRAM.                                                        03250000
033800******************************************************************03260000
033900 C500-CKPT-BY-TIME-OR-REQUEST.                                    03270000
034000                                                                  03280000
034100     MOVE 'N'                     TO DP000-CHECKPOINT-IND.        03290000
034200                                                                  03300000
034300     MOVE PC-TRANS-RECORD-LENGTH  TO DP000-TRANS-REC-LENGTH.      03310000
034400     MOVE DF005-RECORD            TO DP000-TRANS-REC.             03320000
034500     MOVE PC-TRAN-PREP-FUNC-WRITE TO DP000-FUNC-CODE.             03330000
034600     MOVE PC-JOB-NAME             TO DP000-JOB-NAME.              03340000
034700     MOVE PC-PLAN-NAME            TO DP000-PLAN-NAME.             03350000
034800                                                                  03360000
034900     PERFORM Z100-CALL-TRANS-PREP-MODULE.                         03370000
035000                                                                  03380000
035100     ADD +1 TO PA-WRITTEN.                                        03390000
035300                                                                  03410000
035400******************************************************************03420000
035500* ISSUE A 'CLOSE' REQUEST TO THE TRANSACTION PREPARATION MODULE   03430000
035600******************************************************************03440000
035700 C600-ISSUE-CLOSE-REQUEST.                                        03450000
035800                                                                  03460000
035900     MOVE PC-TRAN-PREP-FUNC-CLOSE TO DP000-FUNC-CODE.             03470000
036000     MOVE PC-JOB-NAME             TO DP000-JOB-NAME.              03480000
036100     MOVE PC-PLAN-NAME            TO DP000-PLAN-NAME.             03490000
036200                                                                  03500000
036300     PERFORM Z100-CALL-TRANS-PREP-MODULE.                         03510000
036400                                                                  03520000
036600******************************************************************03540000
036700* VERIFY THE RETURN CODE ON THE CALLED MODULE                     03550000
036800******************************************************************03560000
036900 Z100-CALL-TRANS-PREP-MODULE.                                     03570000
037000                                                                  03580000
037100     PERFORM Z900-CALL-TRANS-PREP-MODULE.                         03590000
037200                                                                  03600000
037300     IF  DP000-GOOD-RET-CODE                                      03610000
037400         CONTINUE                                                 03620000
037600     ELSE                                                         03640000
037700         MOVE 'Z100-CALL-TRANS-PREP-MODULE' TO PV-PARAGRAPH-NAME  03650000
037800         MOVE '** BAD CALL TO TRANS PREP MODULE **'               03660000
037900                                            TO PV-OPERATION-MSG   03670000
038000         MOVE DP000-RET-CODE                TO PV-RET-CODE        03680000
038100                                                                  03690000
038200         SET ABEND-4019-CAL-SUB-ERROR TO TRUE                     03700000
038400         PERFORM Z200-ABEND                                       03720000
038500     END-IF.                                                      03730000
038600                                                                  03740000
038800******************************************************************03760000
038900* NON-DB2 ABEND                                                   03770000
039000******************************************************************03780000
039100 Z200-ABEND.                                                      03790000
039200                                                                  03800000
039300     PERFORM Z999-CONTROLS.                                       03810000
039400                                                                  03820000
039500     DISPLAY '                     '.                             03830000
039600     DISPLAY '** ABEND           **'.                             03840000
039700     DISPLAY '** PROGRAM         ** = ' PC-PROGRAM-NAME.          03850000
039800     DISPLAY '** PARAGRAPH       ** = ' PV-PARAGRAPH-NAME.        03860000
039900     DISPLAY '** OPERATION       ** = ' PV-OPERATION-MSG.         03870000
040000     DISPLAY '** RETURN CODE     ** = ' PV-RET-CODE.              03880000
040100                                                                  03890000
040200     CALL 'ILBOABN0' USING ABEND-CODE.                            03900000
040300                                                                  03910000
040500******************************************************************03930000
040600* PREFORMS TASK TERMINATION PROCESSING                            03940000
040700******************************************************************03950000
040800 Z990-END-OF-JOB-ROUTINE.                                         03960000
040900                                                                  03970000
041000     CLOSE UPDATE-FILE.                                           03980000
041100                                                                  03990000
041200     PERFORM C600-ISSUE-CLOSE-REQUEST.                            04000000
041300                                                                  04010000
041400     PERFORM Z999-CONTROLS.                                       04020000
041500                                                                  04030000
041700******************************************************************04050000
041800* DISPLAY CONTROLS FROM THE PROGRAM                               04060000
041900******************************************************************04070000
042000 Z999-CONTROLS.                                                   04080000
042100                                                                  04090000
042200     MOVE FUNCTION CURRENT-DATE TO SYS-DATE-TIME.                 04100000
042400     MOVE SYS-TIME (1:2) TO ST-END-HR.                            04120000
042500     MOVE SYS-TIME (3:2) TO ST-END-MN.                            04130000
042600                                                                  04140000
042700     DISPLAY '                    '.                              04150000
042800     DISPLAY '**********************'.                            04160000
042900     DISPLAY '   DFKUT008 CONTROLS  '.                            04170000
043000     DISPLAY '**********************'.                            04180000
043100     DISPLAY 'RUN DATE  = ' SD-EDIT-DATE.                         04190000
043200     DISPLAY 'BEG TIME  = ' ST-BEG-TIME.                          04200000
043300     DISPLAY 'END TIME  = ' ST-END-TIME.                          04210000
043400     DISPLAY '======================'.                            04220000
043500     DISPLAY 'RECORDS READ    = ' PA-READ.                        04230000
043600     DISPLAY '                  '.                                04240000
043700     DISPLAY 'RECORDS WRITTEN = ' PA-WRITTEN.                     04250000
043800     DISPLAY '                  '.                                04260000
043900                                                                  04270000
044100******************************************************************04290000
044200* TRANSACTION PREPARATION MODULE CALL AND ERROR ROUTINES          04300000
044300******************************************************************04310000
044400     COPY DPPD000.                                                04320000
