000100******************************************************************        
000200*                      DFRD018  LRECL=182                                 
000300*         CHECKPOINT/RESTART XSTW_DF_LOC_HIER FILE LAYOUT                 
000400******************************************************************        
000500 01  DF018-UPDT-REC.                                                      
000600     05  DF018-NULL-IND              PIC  X(01) VALUE SPACES.     001-001 
000700     05  DF018-LOC-NBR               PIC S9(04) COMP.             002-003 
000700     05  DF018-REPLT-STR             PIC  9(04) VALUE  0.         004-007 
000700     05  DF018-CLO-DTE               PIC  X(10) VALUE SPACES.     008-017 
000710     05  DF018-DIST-NBR              PIC S9(4)V VALUE +0 COMP-3.  018-020 
000720     05  DF018-DIST-NM               PIC X(20)  VALUE SPACES.     021-040 
000730     05  DF018-REGN-NBR              PIC S9(4)V VALUE +0 COMP-3.  041-043 
000740     05  DF018-REGN-NM               PIC X(20)  VALUE SPACES.     044-063 
000750     05  DF018-TERR-NBR              PIC S9(4)V VALUE +0 COMP-3.  064-066 
000760     05  DF018-TERR-NM               PIC X(20)  VALUE SPACES.     067-086 
000770     05  DF018-METRO-ID              PIC S9(4)  VALUE +0 COMP.    087-088 
000780     05  DF018-METRO-NM              PIC X(30)  VALUE SPACES.     089-118 
000790     05  DF018-GEO-ID                PIC S9(4)  VALUE +0 COMP.    119-120 
000791     05  DF018-GEO-NM                PIC X(30)  VALUE SPACES.     121-150 
000792     05  DF018-CLMT-ID               PIC S9(4)  VALUE +0 COMP.    151-152 
000793     05  DF018-CLMT-NM               PIC X(30)  VALUE SPACES.     153-182 
000800                                                                          
