       01  DF085-RECORD.                                                00010001
           05  DF085-STORE-NBR            PIC 9(4)  VALUE ZERO.         00020001
           05  FILLER                     PIC X(1)  VALUE ','.          00030001
           05  DF085-STORE-NAME           PIC X(10) VALUE SPACE.        00031001
           05  FILLER                     PIC X(1)  VALUE ','.          00032001
           05  DF085-STORE-SALES          OCCURS 28 TO 35 TIMES         00033001
                                          DEPENDING ON PV-DAYS-IN-MONTH 00034001
                                          INDEXED BY D85-IDX.           00035001
               10  DF085-DAILY-SALES      PIC ZZZZZZZZZ.99.             00036002
               10  FILLER                 PIC X     VALUE ','.          00037001
           05  DF085-MTD-TOTAL            PIC ZZZZZZZZZZ.99.            00038001
