       01  DF025-RECORD.                                                00010000
           05  DF025-STORE-NBR         PIC 9(4).                        00020000
           05  FILLER                  PIC X(1)   VALUE ','.            00030000
           05  DF025-STORE-NAME        PIC X(10).                       00040000
           05  FILLER                  PIC X(1)   VALUE ','.            00050000
           05  DF025-STORE-SALES-WK1   PIC ZZZZZZZZZ.99.                00060000
           05  DF025-ST-SALES-WK1 REDEFINES DF025-STORE-SALES-WK1       00070000
                                       PIC X(12).                       00080000
           05  FILLER                  PIC X(1)   VALUE ','.            00090000
           05  DF025-STORE-SALES-WK2   PIC ZZZZZZZZZ.99.                00100000
           05  DF025-ST-SALES-WK2 REDEFINES DF025-STORE-SALES-WK2       00110000
                                       PIC X(12).                       00120000
           05  FILLER                  PIC X(1)   VALUE ','.            00130000
           05  DF025-STORE-SALES-WK3   PIC ZZZZZZZZZ.99.                00140000
           05  DF025-ST-SALES-WK3 REDEFINES DF025-STORE-SALES-WK3       00150000
                                       PIC X(12).                       00160000
           05  FILLER                  PIC X(1)   VALUE ','.            00170000
           05  DF025-STORE-SALES-WK4   PIC ZZZZZZZZZ.99.                00180000
           05  DF025-ST-SALES-WK4 REDEFINES DF025-STORE-SALES-WK4       00190000
                                       PIC X(12).                       00200000
           05  DF025-STORE-SALES-WK5-SEP                                00210000
                                       PIC X(1).                        00220000
           05  DF025-STORE-SALES-WK5   PIC ZZZZZZZZZ.99.                00230000
           05  DF025-ST-SALES-WK5 REDEFINES DF025-STORE-SALES-WK5       00240000
                                       PIC X(12).                       00250000
           05  FILLER                  PIC X(11)  VALUE SPACES.         00260000
