      ******************************************************************00001016
      *    LAYOUT FORMAT FOR THE SALES DOWNLOAD FILE.                  *00002016
      ******************************************************************00003016
       01  DF030-RECORD.                                                00010005
           05  DF030-STORE-NBR         PIC 9(4).                        00020017
           05  FILLER                  PIC X(1)   VALUE ','.            00030000
           05  DF030-STORE-NAME        PIC X(10).                       00040005
           05  FILLER                  PIC X(1)   VALUE ','.            00050000
           05  DF030-STORE-SALES-MN01  PIC ZZZZZZZZZ.99.                00060018
           05  DF030-ST-SALES-MN01 REDEFINES DF030-STORE-SALES-MN01     00070005
                                       PIC X(12).                       00080019
           05  FILLER                  PIC X(1)   VALUE ','.            00090000
           05  DF030-STORE-SALES-MN02  PIC ZZZZZZZZZ.99.                00100018
           05  DF030-ST-SALES-MN02 REDEFINES DF030-STORE-SALES-MN02     00110005
                                       PIC X(12).                       00120019
           05  FILLER                  PIC X(1)   VALUE ','.            00130000
           05  DF030-STORE-SALES-MN03  PIC ZZZZZZZZZ.99.                00140018
           05  DF030-ST-SALES-MN03 REDEFINES DF030-STORE-SALES-MN03     00150005
                                       PIC X(12).                       00160019
           05  FILLER                  PIC X(1)   VALUE ','.            00170000
           05  DF030-STORE-SALES-MN04  PIC ZZZZZZZZZ.99.                00180018
           05  DF030-ST-SALES-MN04 REDEFINES DF030-STORE-SALES-MN04     00190005
                                       PIC X(12).                       00200019
           05  FILLER                  PIC X(1)   VALUE ','.            00201005
           05  DF030-STORE-SALES-MN05  PIC ZZZZZZZZZ.99.                00202018
           05  DF030-ST-SALES-MN05 REDEFINES DF030-STORE-SALES-MN05     00203005
                                       PIC X(12).                       00204019
           05  FILLER                  PIC X(1)   VALUE ','.            00205005
           05  DF030-STORE-SALES-MN06  PIC ZZZZZZZZZ.99.                00210018
           05  DF030-ST-SALES-MN06 REDEFINES DF030-STORE-SALES-MN06     00220005
                                       PIC X(12).                       00230019
           05  FILLER                  PIC X(1)   VALUE ','.            00231005
           05  DF030-STORE-SALES-MN07  PIC ZZZZZZZZZ.99.                00232018
           05  DF030-ST-SALES-MN07 REDEFINES DF030-STORE-SALES-MN07     00233005
                                       PIC X(12).                       00234019
           05  FILLER                  PIC X(1)   VALUE ','.            00235005
           05  DF030-STORE-SALES-MN08  PIC ZZZZZZZZZ.99.                00236018
           05  DF030-ST-SALES-MN08 REDEFINES DF030-STORE-SALES-MN08     00237005
                                       PIC X(12).                       00238019
           05  FILLER                  PIC X(1)   VALUE ','.            00239005
           05  DF030-STORE-SALES-MN09  PIC ZZZZZZZZZ.99.                00239118
           05  DF030-ST-SALES-MN09 REDEFINES DF030-STORE-SALES-MN09     00239205
                                       PIC X(12).                       00239319
           05  FILLER                  PIC X(1)   VALUE ','.            00239405
           05  DF030-STORE-SALES-MN10  PIC ZZZZZZZZZ.99.                00239518
           05  DF030-ST-SALES-MN10 REDEFINES DF030-STORE-SALES-MN10     00239605
                                       PIC X(12).                       00239719
           05  FILLER                  PIC X(1)   VALUE ','.            00239805
           05  DF030-STORE-SALES-MN11  PIC ZZZZZZZZZ.99.                00239918
           05  DF030-ST-SALES-MN11 REDEFINES DF030-STORE-SALES-MN11     00240005
                                       PIC X(12).                       00240119
           05  FILLER                  PIC X(1)   VALUE ','.            00241005
           05  DF030-STORE-SALES-MN12  PIC ZZZZZZZZZ.99.                00242018
           05  DF030-ST-SALES-MN12 REDEFINES DF030-STORE-SALES-MN12     00250005
                                       PIC X(12).                       00260019
