*********************************************************************** 00010000
*          DATA SET DLKM405                                             00020000
  PRINT  NOGEN                                                          00030000
*-------------------------------------------------------------------*   00040000
*                                                                   *   00050000
*        MAPSET  DLKM407                                            *   00060007
*        MAP     DK4057                                             *   00070007
*        PROGRAM DLKCS407                                           *   00080007
*        TRANSID D407 - SHIP DOOR TEMPLATE INQUIRY LIST             *   00090007
*        SYSTEM  LABOR MANAGEMENT (DL)                              *   00100000
*                                                                   *   00110000
*-------------------------------------------------------------------*   00120000
DL407A  DFHMSD TYPE=DSECT,                                             X00130007
               LANG=COBOL,                                             X00140000
               MODE=INOUT,                                             X00150000
               STORAGE=AUTO,                                           X00160000
               TERM=3270-2,                                            X00170000
               TIOAPFX=YES                                              00180000
*********************************************************************** 00190000
DLK407  DFHMDI LINE=2,COLUMN=1,                                        X00200007
               SIZE=(19,80),                                           X00210000
               CTRL=(FREEKB),                                          X00220000
               MAPATTS=(COLOR,HILIGHT),                                X00230000
               DSATTS=(COLOR,HILIGHT)                                   00240000
*********************************************************************** 00250000
        DFHMDF POS=(02,01),                                            X00260000
               LENGTH=16,                                              X00270000
               ATTRB=(ASKIP,NORM),                                     X00280000
               COLOR=NEUTRAL,                                          X00290000
               INITIAL='DC NUMBER......:'                               00300000
ADC     DFHMDF POS=(02,18),                                            X00310000
               LENGTH=04,                                              X00320000
               ATTRB=(ASKIP,NORM),                                     X00330000
               COLOR=BLUE                                               00340000
ADCNME  DFHMDF POS=(02,23),                                            X00350000
               LENGTH=27,                                              X00360000
               ATTRB=(ASKIP,NORM),                                     X00370000
               COLOR=BLUE                                               00380000
        DFHMDF POS=(02,58),                                            X00390000
               LENGTH=10,                                              X00400000
               ATTRB=(ASKIP,NORM),                                     X00410000
               COLOR=NEUTRAL,                                          X00420000
               INITIAL='NBR DOORS:'                                     00430000
ATDOOR  DFHMDF POS=(02,69),                                            X00440000
               LENGTH=05,                                              X00450000
               ATTRB=(ASKIP,NORM),                                     X00460000
               COLOR=BLUE                                               00470000
*********************************************************************** 00480000
        DFHMDF POS=(03,01),                                            X00490000
               LENGTH=16,                                              X00500000
               ATTRB=(ASKIP,NORM),                                     X00510000
               COLOR=NEUTRAL,                                          X00520000
               INITIAL='TEMPLATE NUMBER:'                               00530000
ATMPL   DFHMDF POS=(03,18),                                            X00540000
               LENGTH=04,                                              X00550000
               ATTRB=(ASKIP,NORM),                                     X00560000
               PICOUT='ZZZZ',                                          X00570000
               COLOR=BLUE                                               00580000
        DFHMDF POS=(03,23),                                            X00590000
               LENGTH=12,                                              X00600000
               ATTRB=(ASKIP,NORM),                                     X00610000
               COLOR=NEUTRAL,                                          X00620000
               INITIAL='DESCRIPTION:'                                   00630000
ADESC   DFHMDF POS=(03,36),                                            X00640000
               LENGTH=40,                                              X00650000
               ATTRB=(ASKIP,NORM),                                     X00660007
               COLOR=BLUE                                               00670008
        DFHMDF POS=(03,77),                                            X00680000
               LENGTH=01,                                              X00690000
               ATTRB=(ASKIP,DRK)                                        00700000
*********************************************************************** 00710000
ASEQ    DFHMDF POS=(04,01),                                            X00720000
               LENGTH=20,                                              X00730010
               ATTRB=(ASKIP,NORM),                                     X00740000
               COLOR=YELLOW                                             00750000
ASTRTIT DFHMDF POS=(04,55),                                            X00760000
               LENGTH=05,                                              X00770000
               ATTRB=(NUM,UNPROT,NORM,IC),                             X00780009
               COLOR=GREEN,                                            X00790011
               PICOUT='ZZZZ9',                                         X00800000
               HILIGHT=UNDERLINE                                        00810000
        DFHMDF POS=(04,61),                                            X00820000
               LENGTH=02,                                              X00830000
               ATTRB=(ASKIP,NORM),                                     X00840000
               COLOR=NEUTRAL,                                          X00850000
               INITIAL='TO'                                             00860000
AENDIT  DFHMDF POS=(04,64),                                            X00870000
               LENGTH=05,                                              X00880000
               ATTRB=(ASKIP,NORM),                                     X00890000
               COLOR=BLUE,                                             X00900000
               PICOUT='ZZZZ9'                                           00910000
        DFHMDF POS=(04,70),                                            X00920000
               LENGTH=02,                                              X00930000
               ATTRB=(ASKIP,NORM),                                     X00940000
               COLOR=NEUTRAL,                                          X00950000
               INITIAL='OF'                                             00960000
ATOTIT  DFHMDF POS=(04,73),                                            X00970000
               LENGTH=05,                                              X00980000
               ATTRB=(ASKIP,NORM),                                     X00990000
               COLOR=BLUE,                                             X01000000
               PICOUT='ZZZZ9'                                           01010000
*********************************************************************** 01020000
        DFHMDF POS=(05,03),                                            X01030000
               LENGTH=41,                                              X01040000
               ATTRB=(ASKIP,NORM),                                     X01050000
               COLOR=NEUTRAL,                                          X01060000
               INITIAL='DOOR  GROUP    DOOR  GROUP    DOOR  GROUP'      01070000
        DFHMDF POS=(05,48),                                            X01080000
               LENGTH=26,                                              X01090000
               ATTRB=(ASKIP,NORM),                                     X01100000
               COLOR=NEUTRAL,                                          X01110000
               INITIAL='DOOR  GROUP    DOOR  GROUP'                     01120000
*********************************************************************** 01130000
        DFHMDF POS=(06,04),                                            X01140000
               LENGTH=41,                                              X01150000
               ATTRB=(ASKIP,NORM),                                     X01160000
               COLOR=NEUTRAL,                                          X01170000
               INITIAL='NBR   NBR      NBR   NBR      NBR   NBR  '      01180000
        DFHMDF POS=(06,49),                                            X01190000
               LENGTH=26,                                              X01200000
               ATTRB=(ASKIP,NORM),                                     X01210000
               COLOR=NEUTRAL,                                          X01220000
               INITIAL='NBR   NBR      NBR   NBR  '                     01230000
*********************************************************************** 01240000
*********************************************************************** 01250000
ADR011  DFHMDF POS=(07,03),                                            X01260000
               LENGTH=04,                                              X01270000
               ATTRB=(ASKIP,NORM),                                     X01280000
               COLOR=BLUE                                               01290000
AGP011  DFHMDF POS=(07,10),                                            X01300000
               LENGTH=04,                                              X01310000
               ATTRB=(ASKIP,NORM),                                     X01320007
               HILIGHT=UNDERLINE,                                      X01330000
               COLOR=BLUE                                               01340008
        DFHMDF POS=(07,15),                                            X01350000
               LENGTH=01,                                              X01360000
               ATTRB=(ASKIP,DRK)                                        01370000
ADR012  DFHMDF POS=(07,18),                                            X01380000
               LENGTH=04,                                              X01390000
               ATTRB=(ASKIP,NORM),                                     X01400000
               COLOR=BLUE                                               01410000
AGP012  DFHMDF POS=(07,25),                                            X01420000
               LENGTH=04,                                              X01430000
               ATTRB=(ASKIP,NORM),                                     X01440007
               HILIGHT=UNDERLINE,                                      X01450000
               COLOR=BLUE                                               01460008
        DFHMDF POS=(07,30),                                            X01470000
               LENGTH=01,                                              X01480000
               ATTRB=(ASKIP,DRK)                                        01490000
ADR013  DFHMDF POS=(07,33),                                            X01500000
               LENGTH=04,                                              X01510000
               ATTRB=(ASKIP,NORM),                                     X01520000
               COLOR=BLUE                                               01530000
AGP013  DFHMDF POS=(07,40),                                            X01540000
               LENGTH=04,                                              X01550000
               ATTRB=(ASKIP,NORM),                                     X01560007
               HILIGHT=UNDERLINE,                                      X01570000
               COLOR=BLUE                                               01580008
        DFHMDF POS=(07,45),                                            X01590000
               LENGTH=01,                                              X01600000
               ATTRB=(ASKIP,DRK)                                        01610000
ADR014  DFHMDF POS=(07,48),                                            X01620000
               LENGTH=04,                                              X01630000
               ATTRB=(ASKIP,NORM),                                     X01640000
               COLOR=BLUE                                               01650000
AGP014  DFHMDF POS=(07,55),                                            X01660000
               LENGTH=04,                                              X01670000
               ATTRB=(ASKIP,NORM),                                     X01680007
               HILIGHT=UNDERLINE,                                      X01690000
               COLOR=BLUE                                               01700008
        DFHMDF POS=(07,60),                                            X01710000
               LENGTH=01,                                              X01720000
               ATTRB=(ASKIP,DRK)                                        01730000
ADR015  DFHMDF POS=(07,63),                                            X01740000
               LENGTH=04,                                              X01750000
               ATTRB=(ASKIP,NORM),                                     X01760000
               COLOR=BLUE                                               01770000
AGP015  DFHMDF POS=(07,70),                                            X01780000
               LENGTH=04,                                              X01790000
               ATTRB=(ASKIP,NORM),                                     X01800007
               HILIGHT=UNDERLINE,                                      X01810000
               COLOR=BLUE                                               01820008
        DFHMDF POS=(07,75),                                            X01830000
               LENGTH=01,                                              X01840000
               HILIGHT=UNDERLINE,                                      X01850000
               ATTRB=(ASKIP,DRK)                                        01860000
*********************************************************************** 01870000
ADR021  DFHMDF POS=(08,03),                                            X01880000
               LENGTH=04,                                              X01890000
               ATTRB=(ASKIP,NORM),                                     X01900000
               COLOR=BLUE                                               01910000
AGP021  DFHMDF POS=(08,10),                                            X01920000
               LENGTH=04,                                              X01930000
               ATTRB=(ASKIP,NORM),                                     X01940007
               HILIGHT=UNDERLINE,                                      X01950000
               COLOR=BLUE                                               01960008
        DFHMDF POS=(08,15),                                            X01970000
               LENGTH=01,                                              X01980000
               ATTRB=(ASKIP,DRK)                                        01990000
ADR022  DFHMDF POS=(08,18),                                            X02000000
               LENGTH=04,                                              X02010000
               ATTRB=(ASKIP,NORM),                                     X02020000
               COLOR=BLUE                                               02030000
AGP022  DFHMDF POS=(08,25),                                            X02040000
               LENGTH=04,                                              X02050000
               ATTRB=(ASKIP,NORM),                                     X02060007
               HILIGHT=UNDERLINE,                                      X02070000
               COLOR=BLUE                                               02080008
        DFHMDF POS=(08,30),                                            X02090000
               LENGTH=01,                                              X02100000
               ATTRB=(ASKIP,DRK)                                        02110000
ADR023  DFHMDF POS=(08,33),                                            X02120000
               LENGTH=04,                                              X02130000
               ATTRB=(ASKIP,NORM),                                     X02140000
               COLOR=BLUE                                               02150000
AGP023  DFHMDF POS=(08,40),                                            X02160000
               LENGTH=04,                                              X02170000
               ATTRB=(ASKIP,NORM),                                     X02180007
               HILIGHT=UNDERLINE,                                      X02190000
               COLOR=BLUE                                               02200008
        DFHMDF POS=(08,45),                                            X02210000
               LENGTH=01,                                              X02220000
               ATTRB=(ASKIP,DRK)                                        02230000
ADR024  DFHMDF POS=(08,48),                                            X02240000
               LENGTH=04,                                              X02250000
               ATTRB=(ASKIP,NORM),                                     X02260000
               COLOR=BLUE                                               02270000
AGP024  DFHMDF POS=(08,55),                                            X02280000
               LENGTH=04,                                              X02290000
               ATTRB=(ASKIP,NORM),                                     X02300007
               HILIGHT=UNDERLINE,                                      X02310000
               COLOR=BLUE                                               02320008
        DFHMDF POS=(08,60),                                            X02330000
               LENGTH=01,                                              X02340000
               ATTRB=(ASKIP,DRK)                                        02350000
ADR025  DFHMDF POS=(08,63),                                            X02360000
               LENGTH=04,                                              X02370000
               ATTRB=(ASKIP,NORM),                                     X02380000
               COLOR=BLUE                                               02390000
AGP025  DFHMDF POS=(08,70),                                            X02400000
               LENGTH=04,                                              X02410000
               ATTRB=(ASKIP,NORM),                                     X02420007
               HILIGHT=UNDERLINE,                                      X02430000
               COLOR=BLUE                                               02440008
        DFHMDF POS=(08,75),                                            X02450000
               LENGTH=01,                                              X02460000
               HILIGHT=UNDERLINE,                                      X02470000
               ATTRB=(ASKIP,DRK)                                        02480000
*********************************************************************** 02490000
ADR031  DFHMDF POS=(09,03),                                            X02500000
               LENGTH=04,                                              X02510000
               ATTRB=(ASKIP,NORM),                                     X02520000
               COLOR=BLUE                                               02530000
AGP031  DFHMDF POS=(09,10),                                            X02540000
               LENGTH=04,                                              X02550000
               ATTRB=(ASKIP,NORM),                                     X02560007
               HILIGHT=UNDERLINE,                                      X02570000
               COLOR=BLUE                                               02580008
        DFHMDF POS=(09,15),                                            X02590000
               LENGTH=01,                                              X02600000
               ATTRB=(ASKIP,DRK)                                        02610000
ADR032  DFHMDF POS=(09,18),                                            X02620000
               LENGTH=04,                                              X02630000
               ATTRB=(ASKIP,NORM),                                     X02640000
               COLOR=BLUE                                               02650000
AGP032  DFHMDF POS=(09,25),                                            X02660000
               LENGTH=04,                                              X02670000
               ATTRB=(ASKIP,NORM),                                     X02680007
               HILIGHT=UNDERLINE,                                      X02690000
               COLOR=BLUE                                               02700008
        DFHMDF POS=(09,30),                                            X02710000
               LENGTH=01,                                              X02720000
               ATTRB=(ASKIP,DRK)                                        02730000
ADR033  DFHMDF POS=(09,33),                                            X02740000
               LENGTH=04,                                              X02750000
               ATTRB=(ASKIP,NORM),                                     X02760000
               COLOR=BLUE                                               02770000
AGP033  DFHMDF POS=(09,40),                                            X02780000
               LENGTH=04,                                              X02790000
               ATTRB=(ASKIP,NORM),                                     X02800007
               HILIGHT=UNDERLINE,                                      X02810000
               COLOR=BLUE                                               02820008
        DFHMDF POS=(09,45),                                            X02830000
               LENGTH=01,                                              X02840000
               ATTRB=(ASKIP,DRK)                                        02850000
ADR034  DFHMDF POS=(09,48),                                            X02860000
               LENGTH=04,                                              X02870000
               ATTRB=(ASKIP,NORM),                                     X02880000
               COLOR=BLUE                                               02890000
AGP034  DFHMDF POS=(09,55),                                            X02900000
               LENGTH=04,                                              X02910000
               ATTRB=(ASKIP,NORM),                                     X02920007
               HILIGHT=UNDERLINE,                                      X02930000
               COLOR=BLUE                                               02940008
        DFHMDF POS=(09,60),                                            X02950000
               LENGTH=01,                                              X02960000
               ATTRB=(ASKIP,DRK)                                        02970000
ADR035  DFHMDF POS=(09,63),                                            X02980000
               LENGTH=04,                                              X02990000
               ATTRB=(ASKIP,NORM),                                     X03000000
               COLOR=BLUE                                               03010000
AGP035  DFHMDF POS=(09,70),                                            X03020000
               LENGTH=04,                                              X03030000
               ATTRB=(ASKIP,NORM),                                     X03040007
               HILIGHT=UNDERLINE,                                      X03050000
               COLOR=BLUE                                               03060008
        DFHMDF POS=(09,75),                                            X03070000
               LENGTH=01,                                              X03080000
               HILIGHT=UNDERLINE,                                      X03090000
               ATTRB=(ASKIP,DRK)                                        03100000
*********************************************************************** 03110000
ADR041  DFHMDF POS=(10,03),                                            X03120000
               LENGTH=04,                                              X03130000
               ATTRB=(ASKIP,NORM),                                     X03140000
               COLOR=BLUE                                               03150000
AGP041  DFHMDF POS=(10,10),                                            X03160000
               LENGTH=04,                                              X03170000
               ATTRB=(ASKIP,NORM),                                     X03180007
               HILIGHT=UNDERLINE,                                      X03190000
               COLOR=BLUE                                               03200008
        DFHMDF POS=(10,15),                                            X03210000
               LENGTH=01,                                              X03220000
               ATTRB=(ASKIP,DRK)                                        03230000
ADR042  DFHMDF POS=(10,18),                                            X03240000
               LENGTH=04,                                              X03250000
               ATTRB=(ASKIP,NORM),                                     X03260000
               COLOR=BLUE                                               03270000
AGP042  DFHMDF POS=(10,25),                                            X03280000
               LENGTH=04,                                              X03290000
               ATTRB=(ASKIP,NORM),                                     X03300007
               HILIGHT=UNDERLINE,                                      X03310000
               COLOR=BLUE                                               03320008
        DFHMDF POS=(10,30),                                            X03330000
               LENGTH=01,                                              X03340000
               ATTRB=(ASKIP,DRK)                                        03350000
ADR043  DFHMDF POS=(10,33),                                            X03360000
               LENGTH=04,                                              X03370000
               ATTRB=(ASKIP,NORM),                                     X03380000
               COLOR=BLUE                                               03390000
AGP043  DFHMDF POS=(10,40),                                            X03400000
               LENGTH=04,                                              X03410000
               ATTRB=(ASKIP,NORM),                                     X03420007
               HILIGHT=UNDERLINE,                                      X03430000
               COLOR=BLUE                                               03440008
        DFHMDF POS=(10,45),                                            X03450000
               LENGTH=01,                                              X03460000
               ATTRB=(ASKIP,DRK)                                        03470000
ADR044  DFHMDF POS=(10,48),                                            X03480000
               LENGTH=04,                                              X03490000
               ATTRB=(ASKIP,NORM),                                     X03500000
               COLOR=BLUE                                               03510000
AGP044  DFHMDF POS=(10,55),                                            X03520000
               LENGTH=04,                                              X03530000
               ATTRB=(ASKIP,NORM),                                     X03540007
               HILIGHT=UNDERLINE,                                      X03550000
               COLOR=BLUE                                               03560008
        DFHMDF POS=(10,60),                                            X03570000
               LENGTH=01,                                              X03580000
               ATTRB=(ASKIP,DRK)                                        03590000
ADR045  DFHMDF POS=(10,63),                                            X03600000
               LENGTH=04,                                              X03610000
               ATTRB=(ASKIP,NORM),                                     X03620000
               COLOR=BLUE                                               03630000
AGP045  DFHMDF POS=(10,70),                                            X03640000
               LENGTH=04,                                              X03650000
               ATTRB=(ASKIP,NORM),                                     X03660007
               HILIGHT=UNDERLINE,                                      X03670000
               COLOR=BLUE                                               03680008
        DFHMDF POS=(10,75),                                            X03690000
               LENGTH=01,                                              X03700000
               HILIGHT=UNDERLINE,                                      X03710000
               ATTRB=(ASKIP,DRK)                                        03720000
*********************************************************************** 03730000
ADR051  DFHMDF POS=(11,03),                                            X03740000
               LENGTH=04,                                              X03750000
               ATTRB=(ASKIP,NORM),                                     X03760000
               COLOR=BLUE                                               03770000
AGP051  DFHMDF POS=(11,10),                                            X03780000
               LENGTH=04,                                              X03790000
               ATTRB=(ASKIP,NORM),                                     X03800007
               HILIGHT=UNDERLINE,                                      X03810000
               COLOR=BLUE                                               03820008
        DFHMDF POS=(11,15),                                            X03830000
               LENGTH=01,                                              X03840000
               ATTRB=(ASKIP,DRK)                                        03850000
ADR052  DFHMDF POS=(11,18),                                            X03860000
               LENGTH=04,                                              X03870000
               ATTRB=(ASKIP,NORM),                                     X03880000
               COLOR=BLUE                                               03890000
AGP052  DFHMDF POS=(11,25),                                            X03900000
               LENGTH=04,                                              X03910000
               ATTRB=(ASKIP,NORM),                                     X03920007
               HILIGHT=UNDERLINE,                                      X03930000
               COLOR=BLUE                                               03940008
        DFHMDF POS=(11,30),                                            X03950000
               LENGTH=01,                                              X03960000
               ATTRB=(ASKIP,DRK)                                        03970000
ADR053  DFHMDF POS=(11,33),                                            X03980000
               LENGTH=04,                                              X03990000
               ATTRB=(ASKIP,NORM),                                     X04000000
               COLOR=BLUE                                               04010000
AGP053  DFHMDF POS=(11,40),                                            X04020000
               LENGTH=04,                                              X04030000
               ATTRB=(ASKIP,NORM),                                     X04040007
               HILIGHT=UNDERLINE,                                      X04050000
               COLOR=BLUE                                               04060008
        DFHMDF POS=(11,45),                                            X04070000
               LENGTH=01,                                              X04080000
               ATTRB=(ASKIP,DRK)                                        04090000
ADR054  DFHMDF POS=(11,48),                                            X04100000
               LENGTH=04,                                              X04110000
               ATTRB=(ASKIP,NORM),                                     X04120000
               COLOR=BLUE                                               04130000
AGP054  DFHMDF POS=(11,55),                                            X04140000
               LENGTH=04,                                              X04150000
               ATTRB=(ASKIP,NORM),                                     X04160007
               HILIGHT=UNDERLINE,                                      X04170000
               COLOR=BLUE                                               04180008
        DFHMDF POS=(11,60),                                            X04190000
               LENGTH=01,                                              X04200000
               ATTRB=(ASKIP,DRK)                                        04210000
ADR055  DFHMDF POS=(11,63),                                            X04220000
               LENGTH=04,                                              X04230000
               ATTRB=(ASKIP,NORM),                                     X04240000
               COLOR=BLUE                                               04250000
AGP055  DFHMDF POS=(11,70),                                            X04260000
               LENGTH=04,                                              X04270000
               ATTRB=(ASKIP,NORM),                                     X04280007
               HILIGHT=UNDERLINE,                                      X04290000
               COLOR=BLUE                                               04300008
        DFHMDF POS=(11,75),                                            X04310000
               LENGTH=01,                                              X04320000
               HILIGHT=UNDERLINE,                                      X04330000
               ATTRB=(ASKIP,DRK)                                        04340000
*********************************************************************** 04350000
ADR061  DFHMDF POS=(12,03),                                            X04360000
               LENGTH=04,                                              X04370000
               ATTRB=(ASKIP,NORM),                                     X04380000
               COLOR=BLUE                                               04390000
AGP061  DFHMDF POS=(12,10),                                            X04400000
               LENGTH=04,                                              X04410000
               ATTRB=(ASKIP,NORM),                                     X04420007
               HILIGHT=UNDERLINE,                                      X04430000
               COLOR=BLUE                                               04440008
        DFHMDF POS=(12,15),                                            X04450000
               LENGTH=01,                                              X04460000
               ATTRB=(ASKIP,DRK)                                        04470000
ADR062  DFHMDF POS=(12,18),                                            X04480000
               LENGTH=04,                                              X04490000
               ATTRB=(ASKIP,NORM),                                     X04500000
               COLOR=BLUE                                               04510000
AGP062  DFHMDF POS=(12,25),                                            X04520000
               LENGTH=04,                                              X04530000
               ATTRB=(ASKIP,NORM),                                     X04540007
               HILIGHT=UNDERLINE,                                      X04550000
               COLOR=BLUE                                               04560008
        DFHMDF POS=(12,30),                                            X04570000
               LENGTH=01,                                              X04580000
               ATTRB=(ASKIP,DRK)                                        04590000
ADR063  DFHMDF POS=(12,33),                                            X04600000
               LENGTH=04,                                              X04610000
               ATTRB=(ASKIP,NORM),                                     X04620000
               COLOR=BLUE                                               04630000
AGP063  DFHMDF POS=(12,40),                                            X04640000
               LENGTH=04,                                              X04650000
               ATTRB=(ASKIP,NORM),                                     X04660007
               HILIGHT=UNDERLINE,                                      X04670000
               COLOR=BLUE                                               04680008
        DFHMDF POS=(12,45),                                            X04690000
               LENGTH=01,                                              X04700000
               ATTRB=(ASKIP,DRK)                                        04710000
ADR064  DFHMDF POS=(12,48),                                            X04720000
               LENGTH=04,                                              X04730000
               ATTRB=(ASKIP,NORM),                                     X04740000
               COLOR=BLUE                                               04750000
AGP064  DFHMDF POS=(12,55),                                            X04760000
               LENGTH=04,                                              X04770000
               ATTRB=(ASKIP,NORM),                                     X04780007
               HILIGHT=UNDERLINE,                                      X04790000
               COLOR=BLUE                                               04800008
        DFHMDF POS=(12,60),                                            X04810000
               LENGTH=01,                                              X04820000
               ATTRB=(ASKIP,DRK)                                        04830000
ADR065  DFHMDF POS=(12,63),                                            X04840000
               LENGTH=04,                                              X04850000
               ATTRB=(ASKIP,NORM),                                     X04860000
               COLOR=BLUE                                               04870000
AGP065  DFHMDF POS=(12,70),                                            X04880000
               LENGTH=04,                                              X04890000
               ATTRB=(ASKIP,NORM),                                     X04900007
               HILIGHT=UNDERLINE,                                      X04910000
               COLOR=BLUE                                               04920008
        DFHMDF POS=(12,75),                                            X04930000
               LENGTH=01,                                              X04940000
               HILIGHT=UNDERLINE,                                      X04950000
               ATTRB=(ASKIP,DRK)                                        04960000
*********************************************************************** 04970000
ADR071  DFHMDF POS=(13,03),                                            X04980000
               LENGTH=04,                                              X04990000
               ATTRB=(ASKIP,NORM),                                     X05000000
               COLOR=BLUE                                               05010000
AGP071  DFHMDF POS=(13,10),                                            X05020000
               LENGTH=04,                                              X05030000
               ATTRB=(ASKIP,NORM),                                     X05040007
               HILIGHT=UNDERLINE,                                      X05050000
               COLOR=BLUE                                               05060008
        DFHMDF POS=(13,15),                                            X05070000
               LENGTH=01,                                              X05080000
               ATTRB=(ASKIP,DRK)                                        05090000
ADR072  DFHMDF POS=(13,18),                                            X05100000
               LENGTH=04,                                              X05110000
               ATTRB=(ASKIP,NORM),                                     X05120000
               COLOR=BLUE                                               05130000
AGP072  DFHMDF POS=(13,25),                                            X05140000
               LENGTH=04,                                              X05150000
               ATTRB=(ASKIP,NORM),                                     X05160007
               HILIGHT=UNDERLINE,                                      X05170000
               COLOR=BLUE                                               05180008
        DFHMDF POS=(13,30),                                            X05190000
               LENGTH=01,                                              X05200000
               ATTRB=(ASKIP,DRK)                                        05210000
ADR073  DFHMDF POS=(13,33),                                            X05220000
               LENGTH=04,                                              X05230000
               ATTRB=(ASKIP,NORM),                                     X05240000
               COLOR=BLUE                                               05250000
AGP073  DFHMDF POS=(13,40),                                            X05260000
               LENGTH=04,                                              X05270000
               ATTRB=(ASKIP,NORM),                                     X05280007
               HILIGHT=UNDERLINE,                                      X05290000
               COLOR=BLUE                                               05300008
        DFHMDF POS=(13,45),                                            X05310000
               LENGTH=01,                                              X05320000
               ATTRB=(ASKIP,DRK)                                        05330000
ADR074  DFHMDF POS=(13,48),                                            X05340000
               LENGTH=04,                                              X05350000
               ATTRB=(ASKIP,NORM),                                     X05360000
               COLOR=BLUE                                               05370000
AGP074  DFHMDF POS=(13,55),                                            X05380000
               LENGTH=04,                                              X05390000
               ATTRB=(ASKIP,NORM),                                     X05400007
               HILIGHT=UNDERLINE,                                      X05410000
               COLOR=BLUE                                               05420008
        DFHMDF POS=(13,60),                                            X05430000
               LENGTH=01,                                              X05440000
               ATTRB=(ASKIP,DRK)                                        05450000
ADR075  DFHMDF POS=(13,63),                                            X05460000
               LENGTH=04,                                              X05470000
               ATTRB=(ASKIP,NORM),                                     X05480000
               COLOR=BLUE                                               05490000
AGP075  DFHMDF POS=(13,70),                                            X05500000
               LENGTH=04,                                              X05510000
               ATTRB=(ASKIP,NORM),                                     X05520007
               HILIGHT=UNDERLINE,                                      X05530000
               COLOR=BLUE                                               05540008
        DFHMDF POS=(13,75),                                            X05550000
               LENGTH=01,                                              X05560000
               HILIGHT=UNDERLINE,                                      X05570000
               ATTRB=(ASKIP,DRK)                                        05580000
*********************************************************************** 05590000
ADR081  DFHMDF POS=(14,03),                                            X05600000
               LENGTH=04,                                              X05610000
               ATTRB=(ASKIP,NORM),                                     X05620000
               COLOR=BLUE                                               05630000
AGP081  DFHMDF POS=(14,10),                                            X05640000
               LENGTH=04,                                              X05650000
               ATTRB=(ASKIP,NORM),                                     X05660007
               HILIGHT=UNDERLINE,                                      X05670000
               COLOR=BLUE                                               05680008
        DFHMDF POS=(14,15),                                            X05690000
               LENGTH=01,                                              X05700000
               ATTRB=(ASKIP,DRK)                                        05710000
ADR082  DFHMDF POS=(14,18),                                            X05720000
               LENGTH=04,                                              X05730000
               ATTRB=(ASKIP,NORM),                                     X05740000
               COLOR=BLUE                                               05750000
AGP082  DFHMDF POS=(14,25),                                            X05760000
               LENGTH=04,                                              X05770000
               ATTRB=(ASKIP,NORM),                                     X05780007
               HILIGHT=UNDERLINE,                                      X05790000
               COLOR=BLUE                                               05800008
        DFHMDF POS=(14,30),                                            X05810000
               LENGTH=01,                                              X05820000
               ATTRB=(ASKIP,DRK)                                        05830000
ADR083  DFHMDF POS=(14,33),                                            X05840000
               LENGTH=04,                                              X05850000
               ATTRB=(ASKIP,NORM),                                     X05860000
               COLOR=BLUE                                               05870000
AGP083  DFHMDF POS=(14,40),                                            X05880000
               LENGTH=04,                                              X05890000
               ATTRB=(ASKIP,NORM),                                     X05900007
               HILIGHT=UNDERLINE,                                      X05910000
               COLOR=BLUE                                               05920008
        DFHMDF POS=(14,45),                                            X05930000
               LENGTH=01,                                              X05940000
               ATTRB=(ASKIP,DRK)                                        05950000
ADR084  DFHMDF POS=(14,48),                                            X05960000
               LENGTH=04,                                              X05970000
               ATTRB=(ASKIP,NORM),                                     X05980000
               COLOR=BLUE                                               05990000
AGP084  DFHMDF POS=(14,55),                                            X06000000
               LENGTH=04,                                              X06010000
               ATTRB=(ASKIP,NORM),                                     X06020007
               HILIGHT=UNDERLINE,                                      X06030000
               COLOR=BLUE                                               06040008
        DFHMDF POS=(14,60),                                            X06050000
               LENGTH=01,                                              X06060000
               ATTRB=(ASKIP,DRK)                                        06070000
ADR085  DFHMDF POS=(14,63),                                            X06080000
               LENGTH=04,                                              X06090000
               ATTRB=(ASKIP,NORM),                                     X06100000
               COLOR=BLUE                                               06110000
AGP085  DFHMDF POS=(14,70),                                            X06120000
               LENGTH=04,                                              X06130000
               ATTRB=(ASKIP,NORM),                                     X06140007
               HILIGHT=UNDERLINE,                                      X06150000
               COLOR=BLUE                                               06160008
        DFHMDF POS=(14,75),                                            X06170000
               LENGTH=01,                                              X06180000
               HILIGHT=UNDERLINE,                                      X06190000
               ATTRB=(ASKIP,DRK)                                        06200000
*********************************************************************** 06210000
ADR091  DFHMDF POS=(15,03),                                            X06220000
               LENGTH=04,                                              X06230000
               ATTRB=(ASKIP,NORM),                                     X06240000
               COLOR=BLUE                                               06250000
AGP091  DFHMDF POS=(15,10),                                            X06260000
               LENGTH=04,                                              X06270000
               ATTRB=(ASKIP,NORM),                                     X06280007
               HILIGHT=UNDERLINE,                                      X06290000
               COLOR=BLUE                                               06300008
        DFHMDF POS=(15,15),                                            X06310000
               LENGTH=01,                                              X06320000
               ATTRB=(ASKIP,DRK)                                        06330000
ADR092  DFHMDF POS=(15,18),                                            X06340000
               LENGTH=04,                                              X06350000
               ATTRB=(ASKIP,NORM),                                     X06360000
               COLOR=BLUE                                               06370000
AGP092  DFHMDF POS=(15,25),                                            X06380000
               LENGTH=04,                                              X06390000
               ATTRB=(ASKIP,NORM),                                     X06400007
               HILIGHT=UNDERLINE,                                      X06410000
               COLOR=BLUE                                               06420008
        DFHMDF POS=(15,30),                                            X06430000
               LENGTH=01,                                              X06440000
               ATTRB=(ASKIP,DRK)                                        06450000
ADR093  DFHMDF POS=(15,33),                                            X06460000
               LENGTH=04,                                              X06470000
               ATTRB=(ASKIP,NORM),                                     X06480000
               COLOR=BLUE                                               06490000
AGP093  DFHMDF POS=(15,40),                                            X06500000
               LENGTH=04,                                              X06510000
               ATTRB=(ASKIP,NORM),                                     X06520007
               HILIGHT=UNDERLINE,                                      X06530000
               COLOR=BLUE                                               06540008
        DFHMDF POS=(15,45),                                            X06550000
               LENGTH=01,                                              X06560000
               ATTRB=(ASKIP,DRK)                                        06570000
ADR094  DFHMDF POS=(15,48),                                            X06580000
               LENGTH=04,                                              X06590000
               ATTRB=(ASKIP,NORM),                                     X06600000
               COLOR=BLUE                                               06610000
AGP094  DFHMDF POS=(15,55),                                            X06620000
               LENGTH=04,                                              X06630000
               ATTRB=(ASKIP,NORM),                                     X06640007
               HILIGHT=UNDERLINE,                                      X06650000
               COLOR=BLUE                                               06660008
        DFHMDF POS=(15,60),                                            X06670000
               LENGTH=01,                                              X06680000
               ATTRB=(ASKIP,DRK)                                        06690000
ADR095  DFHMDF POS=(15,63),                                            X06700000
               LENGTH=04,                                              X06710000
               ATTRB=(ASKIP,NORM),                                     X06720000
               COLOR=BLUE                                               06730000
AGP095  DFHMDF POS=(15,70),                                            X06740000
               LENGTH=04,                                              X06750000
               ATTRB=(ASKIP,NORM),                                     X06760007
               HILIGHT=UNDERLINE,                                      X06770000
               COLOR=BLUE                                               06780008
        DFHMDF POS=(15,75),                                            X06790000
               LENGTH=01,                                              X06800000
               HILIGHT=UNDERLINE,                                      X06810000
               ATTRB=(ASKIP,DRK)                                        06820000
*********************************************************************** 06830000
ADR101  DFHMDF POS=(16,03),                                            X06840000
               LENGTH=04,                                              X06850000
               ATTRB=(ASKIP,NORM),                                     X06860000
               COLOR=BLUE                                               06870000
AGP101  DFHMDF POS=(16,10),                                            X06880000
               LENGTH=04,                                              X06890000
               ATTRB=(ASKIP,NORM),                                     X06900007
               HILIGHT=UNDERLINE,                                      X06910000
               COLOR=BLUE                                               06920008
        DFHMDF POS=(16,15),                                            X06930000
               LENGTH=01,                                              X06940000
               ATTRB=(ASKIP,DRK)                                        06950000
ADR102  DFHMDF POS=(16,18),                                            X06960000
               LENGTH=04,                                              X06970000
               ATTRB=(ASKIP,NORM),                                     X06980000
               COLOR=BLUE                                               06990000
AGP102  DFHMDF POS=(16,25),                                            X07000000
               LENGTH=04,                                              X07010000
               ATTRB=(ASKIP,NORM),                                     X07020007
               HILIGHT=UNDERLINE,                                      X07030000
               COLOR=BLUE                                               07040008
        DFHMDF POS=(16,30),                                            X07050000
               LENGTH=01,                                              X07060000
               ATTRB=(ASKIP,DRK)                                        07070000
ADR103  DFHMDF POS=(16,33),                                            X07080000
               LENGTH=04,                                              X07090000
               ATTRB=(ASKIP,NORM),                                     X07100000
               COLOR=BLUE                                               07110000
AGP103  DFHMDF POS=(16,40),                                            X07120000
               LENGTH=04,                                              X07130000
               ATTRB=(ASKIP,NORM),                                     X07140007
               HILIGHT=UNDERLINE,                                      X07150000
               COLOR=BLUE                                               07160008
        DFHMDF POS=(16,45),                                            X07170000
               LENGTH=01,                                              X07180000
               ATTRB=(ASKIP,DRK)                                        07190000
ADR104  DFHMDF POS=(16,48),                                            X07200000
               LENGTH=04,                                              X07210000
               ATTRB=(ASKIP,NORM),                                     X07220000
               COLOR=BLUE                                               07230000
AGP104  DFHMDF POS=(16,55),                                            X07240000
               LENGTH=04,                                              X07250000
               ATTRB=(ASKIP,NORM),                                     X07260007
               HILIGHT=UNDERLINE,                                      X07270000
               COLOR=BLUE                                               07280008
        DFHMDF POS=(16,60),                                            X07290000
               LENGTH=01,                                              X07300000
               ATTRB=(ASKIP,DRK)                                        07310000
ADR105  DFHMDF POS=(16,63),                                            X07320000
               LENGTH=04,                                              X07330000
               ATTRB=(ASKIP,NORM),                                     X07340000
               COLOR=BLUE                                               07350000
AGP105  DFHMDF POS=(16,70),                                            X07360000
               LENGTH=04,                                              X07370000
               ATTRB=(ASKIP,NORM),                                     X07380007
               HILIGHT=UNDERLINE,                                      X07390000
               COLOR=BLUE                                               07400008
        DFHMDF POS=(16,75),                                            X07410000
               LENGTH=01,                                              X07420000
               HILIGHT=UNDERLINE,                                      X07430000
               ATTRB=(ASKIP,DRK)                                        07440000
*********************************************************************** 07450000
ADR111  DFHMDF POS=(17,03),                                            X07460000
               LENGTH=04,                                              X07470000
               ATTRB=(ASKIP,NORM),                                     X07480000
               COLOR=BLUE                                               07490000
AGP111  DFHMDF POS=(17,10),                                            X07500000
               LENGTH=04,                                              X07510000
               ATTRB=(ASKIP,NORM),                                     X07520007
               HILIGHT=UNDERLINE,                                      X07530000
               COLOR=BLUE                                               07540008
        DFHMDF POS=(17,15),                                            X07550000
               LENGTH=01,                                              X07560000
               ATTRB=(ASKIP,DRK)                                        07570000
ADR112  DFHMDF POS=(17,18),                                            X07580000
               LENGTH=04,                                              X07590000
               ATTRB=(ASKIP,NORM),                                     X07600000
               COLOR=BLUE                                               07610000
AGP112  DFHMDF POS=(17,25),                                            X07620000
               LENGTH=04,                                              X07630000
               ATTRB=(ASKIP,NORM),                                     X07640007
               HILIGHT=UNDERLINE,                                      X07650000
               COLOR=BLUE                                               07660008
        DFHMDF POS=(17,30),                                            X07670000
               LENGTH=01,                                              X07680000
               ATTRB=(ASKIP,DRK)                                        07690000
ADR113  DFHMDF POS=(17,33),                                            X07700000
               LENGTH=04,                                              X07710000
               ATTRB=(ASKIP,NORM),                                     X07720000
               COLOR=BLUE                                               07730000
AGP113  DFHMDF POS=(17,40),                                            X07740000
               LENGTH=04,                                              X07750000
               ATTRB=(ASKIP,NORM),                                     X07760007
               HILIGHT=UNDERLINE,                                      X07770000
               COLOR=BLUE                                               07780008
        DFHMDF POS=(17,45),                                            X07790000
               LENGTH=01,                                              X07800000
               ATTRB=(ASKIP,DRK)                                        07810000
ADR114  DFHMDF POS=(17,48),                                            X07820000
               LENGTH=04,                                              X07830000
               ATTRB=(ASKIP,NORM),                                     X07840000
               COLOR=BLUE                                               07850000
AGP114  DFHMDF POS=(17,55),                                            X07860000
               LENGTH=04,                                              X07870000
               ATTRB=(ASKIP,NORM),                                     X07880007
               HILIGHT=UNDERLINE,                                      X07890000
               COLOR=BLUE                                               07900008
        DFHMDF POS=(17,60),                                            X07910000
               LENGTH=01,                                              X07920000
               ATTRB=(ASKIP,DRK)                                        07930000
ADR115  DFHMDF POS=(17,63),                                            X07940000
               LENGTH=04,                                              X07950000
               ATTRB=(ASKIP,NORM),                                     X07960000
               COLOR=BLUE                                               07970000
AGP115  DFHMDF POS=(17,70),                                            X07980000
               LENGTH=04,                                              X07990000
               ATTRB=(ASKIP,NORM),                                     X08000007
               HILIGHT=UNDERLINE,                                      X08010000
               COLOR=BLUE                                               08020008
        DFHMDF POS=(17,75),                                            X08030000
               LENGTH=01,                                              X08040000
               HILIGHT=UNDERLINE,                                      X08050000
               ATTRB=(ASKIP,DRK)                                        08060000
*********************************************************************** 08070000
ADR121  DFHMDF POS=(18,03),                                            X08080000
               LENGTH=04,                                              X08090000
               ATTRB=(ASKIP,NORM),                                     X08100000
               COLOR=BLUE                                               08110000
AGP121  DFHMDF POS=(18,10),                                            X08120000
               LENGTH=04,                                              X08130000
               ATTRB=(ASKIP,NORM),                                     X08140007
               HILIGHT=UNDERLINE,                                      X08150000
               COLOR=BLUE                                               08160008
        DFHMDF POS=(18,15),                                            X08170000
               LENGTH=01,                                              X08180000
               ATTRB=(ASKIP,DRK)                                        08190000
ADR122  DFHMDF POS=(18,18),                                            X08200000
               LENGTH=04,                                              X08210000
               ATTRB=(ASKIP,NORM),                                     X08220000
               COLOR=BLUE                                               08230000
AGP122  DFHMDF POS=(18,25),                                            X08240000
               LENGTH=04,                                              X08250000
               ATTRB=(ASKIP,NORM),                                     X08260007
               HILIGHT=UNDERLINE,                                      X08270000
               COLOR=BLUE                                               08280008
        DFHMDF POS=(18,30),                                            X08290000
               LENGTH=01,                                              X08300000
               ATTRB=(ASKIP,DRK)                                        08310000
ADR123  DFHMDF POS=(18,33),                                            X08320000
               LENGTH=04,                                              X08330000
               ATTRB=(ASKIP,NORM),                                     X08340000
               COLOR=BLUE                                               08350000
AGP123  DFHMDF POS=(18,40),                                            X08360000
               LENGTH=04,                                              X08370000
               ATTRB=(ASKIP,NORM),                                     X08380007
               HILIGHT=UNDERLINE,                                      X08390000
               COLOR=BLUE                                               08400008
        DFHMDF POS=(18,45),                                            X08410000
               LENGTH=01,                                              X08420000
               ATTRB=(ASKIP,DRK)                                        08430000
ADR124  DFHMDF POS=(18,48),                                            X08440000
               LENGTH=04,                                              X08450000
               ATTRB=(ASKIP,NORM),                                     X08460000
               COLOR=BLUE                                               08470000
AGP124  DFHMDF POS=(18,55),                                            X08480000
               LENGTH=04,                                              X08490000
               ATTRB=(ASKIP,NORM),                                     X08500007
               HILIGHT=UNDERLINE,                                      X08510000
               COLOR=BLUE                                               08520008
        DFHMDF POS=(18,60),                                            X08530000
               LENGTH=01,                                              X08540000
               ATTRB=(ASKIP,DRK)                                        08550000
ADR125  DFHMDF POS=(18,63),                                            X08560000
               LENGTH=04,                                              X08570000
               ATTRB=(ASKIP,NORM),                                     X08580000
               COLOR=BLUE                                               08590000
AGP125  DFHMDF POS=(18,70),                                            X08600000
               LENGTH=04,                                              X08610000
               ATTRB=(ASKIP,NORM),                                     X08620007
               HILIGHT=UNDERLINE,                                      X08630000
               COLOR=BLUE                                               08640008
        DFHMDF POS=(18,75),                                            X08650000
               LENGTH=01,                                              X08660000
               HILIGHT=UNDERLINE,                                      X08670000
               ATTRB=(ASKIP,DRK)                                        08680000
*********************************************************************** 08690000
ADR131  DFHMDF POS=(19,03),                                            X08700000
               LENGTH=04,                                              X08710000
               ATTRB=(ASKIP,NORM),                                     X08720000
               COLOR=BLUE                                               08730000
AGP131  DFHMDF POS=(19,10),                                            X08740000
               LENGTH=04,                                              X08750000
               ATTRB=(ASKIP,NORM),                                     X08760007
               HILIGHT=UNDERLINE,                                      X08770000
               COLOR=BLUE                                               08780008
        DFHMDF POS=(19,15),                                            X08790000
               LENGTH=01,                                              X08800000
               ATTRB=(ASKIP,DRK)                                        08810000
ADR132  DFHMDF POS=(19,18),                                            X08820000
               LENGTH=04,                                              X08830000
               ATTRB=(ASKIP,NORM),                                     X08840000
               COLOR=BLUE                                               08850000
AGP132  DFHMDF POS=(19,25),                                            X08860000
               LENGTH=04,                                              X08870000
               ATTRB=(ASKIP,NORM),                                     X08880007
               HILIGHT=UNDERLINE,                                      X08890000
               COLOR=BLUE                                               08900008
        DFHMDF POS=(19,30),                                            X08910000
               LENGTH=01,                                              X08920000
               ATTRB=(ASKIP,DRK)                                        08930000
ADR133  DFHMDF POS=(19,33),                                            X08940000
               LENGTH=04,                                              X08950000
               ATTRB=(ASKIP,NORM),                                     X08960000
               COLOR=BLUE                                               08970000
AGP133  DFHMDF POS=(19,40),                                            X08980000
               LENGTH=04,                                              X08990000
               ATTRB=(ASKIP,NORM),                                     X09000007
               HILIGHT=UNDERLINE,                                      X09010000
               COLOR=BLUE                                               09020008
        DFHMDF POS=(19,45),                                            X09030000
               LENGTH=01,                                              X09040000
               ATTRB=(ASKIP,DRK)                                        09050000
ADR134  DFHMDF POS=(19,48),                                            X09060000
               LENGTH=04,                                              X09070000
               ATTRB=(ASKIP,NORM),                                     X09080000
               COLOR=BLUE                                               09090000
AGP134  DFHMDF POS=(19,55),                                            X09100000
               LENGTH=04,                                              X09110000
               ATTRB=(ASKIP,NORM),                                     X09120007
               HILIGHT=UNDERLINE,                                      X09130000
               COLOR=BLUE                                               09140008
        DFHMDF POS=(19,60),                                            X09150000
               LENGTH=01,                                              X09160000
               ATTRB=(ASKIP,DRK)                                        09170000
ADR135  DFHMDF POS=(19,63),                                            X09180000
               LENGTH=04,                                              X09190000
               ATTRB=(ASKIP,NORM),                                     X09200000
               COLOR=BLUE                                               09210000
AGP135  DFHMDF POS=(19,70),                                            X09220000
               LENGTH=04,                                              X09230000
               ATTRB=(ASKIP,NORM),                                     X09240007
               HILIGHT=UNDERLINE,                                      X09250000
               COLOR=BLUE                                               09260008
        DFHMDF POS=(19,75),                                            X09270000
               LENGTH=01,                                              X09280000
               HILIGHT=UNDERLINE,                                      X09290000
               ATTRB=(ASKIP,DRK)                                        09300000
        DFHMSD TYPE=FINAL                                               09310000
        END                                                             09320000
