*          DATA SET DLKM457    AT LEVEL 030 AS OF 06/21/16                      
        PRINT NOGEN                                                             
DLKM457  DFHMSD TYPE=MAP,                                              X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES,                                            X        
               CTRL=FREEKB                                                      
*                                                                               
DL457A   DFHMDI SIZE=(08,20),                                          X        
               LINE=1,                                                 X        
               COLUMN=1,                                               X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                               
         DFHMDF POS=(01,03),                                           X        
               LENGTH=012,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               INITIAL='GLOBAL ISTOP'                                           
*                                                                               
****** LINE 2 ****************************************************      00041*22
         DFHMDF POS=(02,02),                                           X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               INITIAL='GROUP:'                                                 
AGROUP   DFHMDF POS=(02,09),                                           X        
               LENGTH=06,                                              X        
               PICOUT='XXXXXX',                                        X        
               ATTRB=(UNPROT,IC,FSET)                                           
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(02,16)                                                      
*                                                                               
****** LINE 3 ****************************************************      00041*22
AMSG1    DFHMDF POS=(03,01),                                           X        
               LENGTH=19,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
****** LINE 4 ****************************************************      00041*22
AMSG2    DFHMDF POS=(04,01),                                           X        
               LENGTH=19,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
****** LINE 5 ****************************************************      00041*22
AMSG3    DFHMDF POS=(05,01),                                           X        
               LENGTH=19,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
****** LINE 6 ****************************************************      00041*22
AMSG4    DFHMDF POS=(06,01),                                           X        
               LENGTH=19,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
****** LINE 7 ****************************************************      00041*22
AMSG5    DFHMDF POS=(07,01),                                           X        
               LENGTH=19,                                              X        
               ATTRB=(ASKIP,NORM,FSET),                                X        
               COLOR=BLUE,                                             X        
               INITIAL='   F5 TO APPLY     '                                    
****** LINE 8 ****************************************************      00041*22
AERMSG   DFHMDF POS=(08,01),                                           X        
               LENGTH=19,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
*                                                                       00041*22
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
