        PRINT NOGEN                                                             
DLKM451  DFHMSD TYPE=MAP,                                              X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES,                                            X        
               CTRL=FREEKB                                                      
*                                                                               
DL451A   DFHMDI SIZE=(08,20),                                          X        
               LINE=1,                                                 X        
               COLUMN=1                                                         
*                                                                               
         DFHMDF POS=(01,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='  TEAM ASSOC LIST  '                                    
*                                                                               
****** LINE 2 ****************************************************      00041*22
AWKTYP  DFHMDF POS=(02,01),                                            X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
****** LINE 3 ****************************************************      00041*22
AAREA   DFHMDF POS=(03,01),                                            X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
****** LINE 4 ****************************************************      00041*22
        DFHMDF POS=(04,01),                                            X00034*22
               LENGTH=012,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET),                                X00036*14
               INITIAL='NBR IN TEAM:'                                           
ATMCNT  DFHMDF POS=(04,14),                                            X00034*22
               LENGTH=005,                                             X00035*22
               PICOUT='ZZZZ9',                                         X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
****** LINE 5 ****************************************************      00041*22
ANAME1   DFHMDF POS=(05,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
****** LINE 6 ****************************************************      00041*22
ANAME2   DFHMDF POS=(06,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
****** LINE 7 ****************************************************      00041*22
ANAME3   DFHMDF POS=(07,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
****** LINE 8 ****************************************************      00041*22
AMSGLN   DFHMDF POS=(08,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM,FSET),                                X        
               INITIAL='    F7/8-SCROLL    '                                    
*                                                                               
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
