        PRINT  NOGEN                                                    00010005
DLKM454 DFHMSD TYPE=MAP,                                               X00020007
               LANG=COBOL,                                             X00030005
               MODE=INOUT,                                             X00040005
               TIOAPFX=YES,                                            X00050005
               CTRL=FREEKB                                              00060005
*                                                                       00070005
DL454A  DFHMDI SIZE=(12,20),                                           X00080007
               LINE=1,                                                 X00090005
               COLUMN=1                                                 00100005
*                                                                       00110005
        DFHMDF POS=(01,01),                                            X00120007
               LENGTH=019,                                             X00130005
               ATTRB=(ASKIP,NORM),                                     X00140005
               INITIAL='  INDIRECT CODES   '                            00150005
*                                                                       00160005
        DFHMDF POS=(02,01),                                            X00170005
               LENGTH=006,                                             X00180005
               ATTRB=(ASKIP,NORM),                                     X00190005
               INITIAL='ASSOC:'                                         00200005
AUSER   DFHMDF POS=(02,08),                                            X00210005
               LENGTH=007,                                             X00220005
               ATTRB=(UNPROT,NORM,FSET)                                 00230005
        DFHMDF POS=(02,16),                                            X00240005
               LENGTH=001,                                             X00250005
               ATTRB=(ASKIP,DRK)                                        00260005
*                                                                       00270005
ACODE1  DFHMDF POS=(03,01),                                            X00280007
               LENGTH=002,                                             X00290005
               ATTRB=(ASKIP,NORM,FSET)                                  00300005
ADESC1  DFHMDF POS=(03,04),                                            X00310007
               LENGTH=015,                                             X00320005
               ATTRB=(ASKIP,NORM,FSET)                                  00330005
*                                                                       00340005
ACODE2  DFHMDF POS=(04,01),                                            X00350007
               LENGTH=002,                                             X00360005
               ATTRB=(ASKIP,NORM,FSET)                                  00370005
ADESC2  DFHMDF POS=(04,04),                                            X00380007
               LENGTH=015,                                             X00390005
               ATTRB=(ASKIP,NORM,FSET)                                  00400005
*                                                                       00410005
ACODE3  DFHMDF POS=(05,01),                                            X00420007
               LENGTH=002,                                             X00430005
               ATTRB=(ASKIP,NORM,FSET)                                  00440005
ADESC3  DFHMDF POS=(05,04),                                            X00450007
               LENGTH=015,                                             X00460005
               ATTRB=(ASKIP,NORM,FSET)                                  00470005
*                                                                       00480005
ACODE4  DFHMDF POS=(06,01),                                            X00490007
               LENGTH=002,                                             X00500005
               ATTRB=(ASKIP,NORM,FSET)                                  00510005
ADESC4  DFHMDF POS=(06,04),                                            X00520007
               LENGTH=015,                                             X00530005
               ATTRB=(ASKIP,NORM,FSET)                                  00540005
*                                                                       00550005
ACODE5  DFHMDF POS=(07,01),                                            X00560007
               LENGTH=002,                                             X00570005
               ATTRB=(ASKIP,NORM,FSET)                                  00580005
ADESC5  DFHMDF POS=(07,04),                                            X00590007
               LENGTH=015,                                             X00600005
               ATTRB=(ASKIP,NORM,FSET)                                  00610005
*                                                                       00620005
ACODE6  DFHMDF POS=(08,01),                                            X00630007
               LENGTH=002,                                             X00640005
               ATTRB=(ASKIP,NORM,FSET)                                  00650005
ADESC6  DFHMDF POS=(08,04),                                            X00660007
               LENGTH=015,                                             X00670005
               ATTRB=(ASKIP,NORM,FSET)                                  00680005
*                                                                       00690005
ACODE7  DFHMDF POS=(09,01),                                            X00700007
               LENGTH=002,                                             X00710005
               ATTRB=(ASKIP,NORM,FSET)                                  00720005
ADESC7  DFHMDF POS=(09,04),                                            X00730007
               LENGTH=015,                                             X00740005
               ATTRB=(ASKIP,NORM,FSET)                                  00750005
*                                                                       00760005
ACODE8  DFHMDF POS=(10,01),                                            X00770007
               LENGTH=002,                                             X00780005
               ATTRB=(ASKIP,NORM,FSET)                                  00790005
ADESC8  DFHMDF POS=(10,04),                                            X00800007
               LENGTH=015,                                             X00810005
               ATTRB=(ASKIP,NORM,FSET)                                  00820005
*                                                                       00830005
        DFHMDF POS=(11,01),                                            X00840005
               LENGTH=010,                                             X00850005
               ATTRB=(ASKIP,NORM),                                     X00860005
               INITIAL='SELECTION:'                                     00870005
ASELECT DFHMDF POS=(11,12),                                            X00880009
               LENGTH=002,                                             X00890005
               PICOUT='99',                                            X00900005
               ATTRB=(UNPROT,NORM,IC,FSET)                              00910005
        DFHMDF POS=(11,15),                                            X00920007
               LENGTH=001,                                             X00930005
               ATTRB=(ASKIP,DRK)                                        00940005
*                                                                       00950005
AMSGLN   DFHMDF POS=(12,01),                                           X00960005
               LENGTH=019,                                             X00970005
               ATTRB=(ASKIP,NORM,FSET),                                X00980005
               INITIAL='    F7/F8-SCROLL   '                            00990005
*                                                                       01000005
         DFHMSD TYPE=FINAL                                              01010005
         END                                                            01020005
