        PRINT NOGEN                                                     00001   
DLKM452  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=FREEKB                                              00006   
*                                                                       00041*22
DL452A  DFHMDI SIZE=(08,20),                                           X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
        DFHMDF POS=(01,02),                                            X00012**5
               LENGTH=015,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='ASSOCIATE ASGMT'                                00015*29
*****************************************************************       00016   
        DFHMDF POS=(02,01),                                            X00034*22
               LENGTH=006,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='ASSOC:'                                         00015*29
AUSER   DFHMDF POS=(02,08),                                            X00034*22
               LENGTH=008,                                             X00035*22
               ATTRB=(UNPROT,NORM,IC,FSET)                              00036*14
        DFHMDF POS=(02,17),                                            X00034*22
               LENGTH=001,                                             X00035*22
               ATTRB=(ASKIP,DRK)                                        00036*14
****** LINE 3 ****************************************************      00041*22
        DFHMDF POS=(03,01),                                            X00034*22
               LENGTH=003,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='DC:'                                            00015*29
ADC     DFHMDF POS=(03,05),                                            X00034*22
               LENGTH=004,                                             X00035*22
               PICOUT='ZZZZ',                                          X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
        DFHMDF POS=(03,10),                                            X00034*22
               LENGTH=005,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='#TEM:'                                          00015*29
ATMCNT  DFHMDF POS=(03,16),                                            X00034*22
               LENGTH=004,                                             X00035*22
               PICOUT='ZZZ9',                                          X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
****** LINE 4 ****************************************************      00041*22
AAREA   DFHMDF POS=(04,01),                                            X00034*22
               LENGTH=015,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET),                                X00036*14
               INITIAL='WORK TYPE/AREA:'                                00015*29
****** LINE 5 ****************************************************      00041*22
ALINE5  DFHMDF POS=(05,01),                                            X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
****** LINE 6 ****************************************************      00041*22
ALINE6  DFHMDF POS=(06,01),                                            X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
****** LINE 7 ****************************************************      00041*22
ALINE7  DFHMDF POS=(07,01),                                            X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
****** LINE 8 ****************************************************      00041*22
ALINE8  DFHMDF POS=(08,01),                                            X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM,FSET)                                  00075*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
