        PRINT NOGEN                                                     00001   
DLKM450  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=FREEKB                                              00006   
*                                                                       00041*22
DL450A  DFHMDI SIZE=(08,20),                                           X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
        DFHMDF POS=(01,03),                                            X00012**5
               LENGTH=014,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='TEAM-ASSOC ADD'                                 00015*29
****** LINE 2 ****************************************************      00041*22
ATYPE   DFHMDF POS=(02,01),                                            X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
****** LINE 3 ****************************************************      00041*22
AAREA   DFHMDF POS=(03,01),                                            X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
****** LINE 4 ***************************************************       00016   
AUSER   DFHMDF POS=(04,01),                                            X00034*22
               LENGTH=008,                                             X00035*22
               ATTRB=(UNPROT,NORM,IC,FSET)                              00036*14
        DFHMDF POS=(04,10),                                            X00012**5
               LENGTH=004,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='#TEM'                                           00015*29
ATMCNT  DFHMDF POS=(04,16),                                            X00034*22
               LENGTH=003,                                             X00035*22
               PICOUT='ZZ9',                                           X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
****** LINE 5 ***************************************************       00016   
ALINE5  DFHMDF POS=(05,01),                                            X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
****** LINE 6 ***************************************************       00016   
ALINE6  DFHMDF POS=(06,01),                                            X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
****** LINE 7 ***************************************************       00016   
ALINE7  DFHMDF POS=(07,01),                                            X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET),                                X00036*14
               INITIAL='F5-ADD F6-TEAM LST'                             00036*14
****** LINE 8 ***************************************************       00016   
ALINE8  DFHMDF POS=(08,01),                                            X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
*****************************************************************       00016   
*****************************************************************       00016   
*****************************************************************       00016   
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
