        PRINT NOGEN                                                             
DLKM455  DFHMSD TYPE=MAP,                                              X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES,                                            X        
               CTRL=FREEKB                                                      
*                                                                               
DL455A   DFHMDI SIZE=(08,20),                                          X        
               LINE=1,                                                 X        
               COLUMN=1                                                         
*                                                                               
         DFHMDF POS=(01,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='APPLY INDIRECT CODE'                                    
*                                                                               
****** LINE 2 ****************************************************      00041*22
ACODE   DFHMDF POS=(02,02),                                            X00034*22
               LENGTH=015,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                          
****** LINE 3 ****************************************************      00041*22
         DFHMDF POS=(03,01),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='TO ALL'                                                 
ATMCNT  DFHMDF POS=(03,08),                                            X00034*22
               LENGTH=002,                                             X00035*22
               PICOUT='Z9',                                            X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
         DFHMDF POS=(03,11),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='MEMBERS'                                                
****** LINE 4 ****************************************************      00041*22
         DFHMDF POS=(04,06),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='OF TEAM'                                                
****** LINE 5 ****************************************************      00041*22
         DFHMDF POS=(05,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL=' PRESS F4 FOR ALL'                                      
****** LINE 6 ****************************************************      00041*22
         DFHMDF POS=(06,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL=' F5 TO APPLY TO  '                                      
****** LINE 7 ****************************************************      00041*22
AUSER    DFHMDF POS=(07,04),                                           X        
               LENGTH=008,                                             X        
               ATTRB=(UNPROT,NORM,FSET)                                         
         DFHMDF POS=(07,13),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='ONLY'                                                   
****** LINE 8 ****************************************************      00041*22
AMSGLN   DFHMDF POS=(08,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
*                                                                               
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
