*****************************************************************       00004   
*       MAPSET  - DLKM402                                               00005   
*       MAP     - DL402A                                                00006   
*       PROGRAM - DLKCS402                                              00007   
*       TRANSID - D402                                                  00008   
*****************************************************************       00009   
  PRINT  NOGEN                                                          00010   
*                                                                       00011   
DL402A   DFHMSD TYPE=&&SYSPARM,                                        X00012   
               LANG=COBOL,                                             X00013   
               MODE=INOUT,                                             X00014   
               STORAGE=AUTO,                                           X00015   
               TERM=3270-2,                                            X00016   
               TIOAPFX=YES                                              00017   
DLK402   DFHMDI SIZE=(19,080),                                         X00018   
               MAPATTS=(COLOR,HILIGHT),                                X00019   
               DSATTS=(COLOR,HILIGHT),                                 X00020   
               LINE=02,                                                X00021   
               COLUMN=01,                                              X00022   
               CTRL=(FREEKB)                                            00023   
*                                                                               
*                                                                               
         DFHMDF POS=(05,007),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,NORM),                                     X00026   
               LENGTH=016,                                             X00027   
               INITIAL='DC NUMBER......:'                               00028   
ADC      DFHMDF POS=(05,024),                                          X00029   
               COLOR=BLUE,                                             X00030   
               ATTRB=(ASKIP,NORM),                                     X00031   
               LENGTH=005,                                             X00032   
               PICOUT='ZZZZ9'                                           00033   
ADCNME   DFHMDF POS=(05,031),                                          X00040   
               COLOR=BLUE,                                             X00041   
               ATTRB=(ASKIP,NORM),                                     X00042   
               LENGTH=025,                                             X00043   
               INITIAL='                         '                      00039   
*                                                                               
         DFHMDF POS=(06,007),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,NORM),                                     X00026   
               LENGTH=016,                                             X00027   
               INITIAL='USER CODE......:'                               00028   
AUSRCD   DFHMDF POS=(06,024),                                          X00029   
               COLOR=BLUE,                                             X00030   
               ATTRB=(ASKIP,NORM),                                     X00051   
               LENGTH=008,                                             X00032   
               INITIAL='        '                                               
        DFHMDF POS=(06,033),                                           X00134   
               LENGTH=1,                                               X00135   
               ATTRB=ASKIP                                              00136   
*                                                                               
         DFHMDF POS=(07,007),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,NORM),                                     X00026   
               LENGTH=016,                                             X00027   
               INITIAL='FIRST NAME.....:'                               00028   
AFNME    DFHMDF POS=(07,024),                                          X00029   
               COLOR=GREEN,                                            X00030   
               ATTRB=(UNPROT,NORM),                                    X00051   
               HILIGHT=UNDERLINE,                                      X00052   
               LENGTH=020,                                             X00032   
               INITIAL='                    '                                   
        DFHMDF POS=(07,045),                                           X00134   
               LENGTH=1,                                               X00135   
               ATTRB=ASKIP                                              00136   
*                                                                               
         DFHMDF POS=(08,007),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,NORM),                                     X00026   
               LENGTH=016,                                             X00027   
               INITIAL='LAST NAME......:'                               00028   
ALNME    DFHMDF POS=(08,024),                                          X00029   
               COLOR=GREEN,                                            X00030   
               ATTRB=(UNPROT,NORM),                                    X00051   
               HILIGHT=UNDERLINE,                                      X00052   
               LENGTH=030,                                             X00032   
               INITIAL='                              '                         
        DFHMDF POS=(08,055),                                           X00134   
               LENGTH=1,                                               X00135   
               ATTRB=ASKIP                                              00136   
*                                                                               
         DFHMDF POS=(10,007),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,NORM),                                     X00026   
               LENGTH=016,                                             X00027   
               INITIAL='USER ADDED BY..:'                               00028   
AADDBY   DFHMDF POS=(10,024),                                          X00029   
               COLOR=BLUE,                                             X00030   
               ATTRB=(ASKIP,NORM),                                     X00031   
               LENGTH=008,                                             X00032   
               INITIAL='        '                                       00033   
AADDNME  DFHMDF POS=(10,034),                                          X00040   
               COLOR=BLUE,                                             X00041   
               ATTRB=(ASKIP,NORM),                                     X00042   
               LENGTH=030,                                             X00043   
               INITIAL='                              '                 00039   
*                                                                               
         DFHMDF POS=(11,007),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,NORM),                                     X00026   
               LENGTH=016,                                             X00027   
               INITIAL='ADDED BY DC....:'                               00028   
ABYDC    DFHMDF POS=(11,024),                                          X00029   
               COLOR=BLUE,                                             X00030   
               ATTRB=(ASKIP,NORM),                                     X00031   
               LENGTH=004,                                             X00032   
               PICOUT='ZZZ9'                                            00033   
ABYDCNM  DFHMDF POS=(11,034),                                          X00040   
               COLOR=BLUE,                                             X00041   
               ATTRB=(ASKIP,NORM),                                     X00042   
               LENGTH=030,                                             X00043   
               INITIAL='                              '                 00039   
*                                                                               
         DFHMDF POS=(12,007),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,NORM),                                     X00026   
               LENGTH=016,                                             X00027   
               INITIAL='DATE/TIME ADDED:'                               00028   
ADATE    DFHMDF POS=(12,024),                                          X00029   
               COLOR=BLUE,                                             X00030   
               ATTRB=(ASKIP,NORM),                                     X00031   
               LENGTH=010,                                             X00032   
               INITIAL='          '                                     00033   
         DFHMDF POS=(12,035),                                          X00040   
               COLOR=BLUE,                                             X00041   
               ATTRB=(ASKIP,NORM),                                     X00042   
               LENGTH=001,                                             X00043   
               INITIAL='@'                                              00039   
ATIME    DFHMDF POS=(12,037),                                          X00029   
               COLOR=BLUE,                                             X00030   
               ATTRB=(ASKIP,NORM),                                     X00031   
               LENGTH=008,                                             X00032   
               INITIAL='        '                                       00033   
*                                                                               
         DFHMDF POS=(14,007),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,NORM),                                     X00026   
               LENGTH=016,                                             X00027   
               INITIAL='ACTIVE USER....:'                               00028   
AACTUSR  DFHMDF POS=(14,024),                                          X00029   
               COLOR=GREEN,                                            X00030   
               ATTRB=(UNPROT,NORM),                                    X00051   
               HILIGHT=UNDERLINE,                                      X00032   
               LENGTH=001,                                             X00032   
               INITIAL=' '                                                      
         DFHMDF POS=(14,026),                                          X00134   
               LENGTH=1,                                               X00135   
               ATTRB=ASKIP                                              00136   
         DFHMDF POS=(14,028),                                          X00040   
               COLOR=BLUE,                                             X00041   
               ATTRB=(ASKIP,NORM),                                     X00042   
               LENGTH=008,                                             X00043   
               INITIAL='(Y OR N)'                                       00039   
*                                                                               
*                                                                               
         DFHMSD TYPE=FINAL                                              00739   
         END                                                            00740   
