000100**************************************************************    00010000
000210*   COPYBOOK NAME:    DLRD003                                *    00021000
000211*   COPYBOOK LENGTH:  900                                    *    00021102
000212*   THIS IS THE RECORD LAYOUT FOR INFORMATION EXTRACTED      *    00021200
000220*   FROM THE EAI EXPORT TABLES THAT WILL BE FORMATTED AND    *    00022000
000230*   SENT OFF TO THE DLX LABOR SYSTEM.                        *    00023000
003120**************************************************************    00312000
003200 01  DL003-EXPORT-RECORD-LAYOUT.                                  00320003
003500     05  DL003-EVNT-OBJ-TXT           PIC  X(40).                 00350001
003600     05  DL003-EVNT-OBJ-ACTN-TXT      PIC  X(40).                 00360001
003610     05  DL003-CRE-BY-USR-ID          PIC  X(08).                 00361001
003620     05  DL003-CRE-PGM-NM             PIC  X(08).                 00362001
003630     05  DL003-REF-ID                 PIC  X(40).                 00363001
003631     05  DL003-EVNT-KY-1-NBR          PIC S9(18)V        COMP-3.  00363101
003632     05  DL003-EVNT-KY-2-NBR          PIC S9(18)V        COMP-3.  00363201
003633     05  DL003-EVNT-KY-3-NBR          PIC S9(18)V        COMP-3.  00363301
003634     05  DL003-EVNT-KY-4-NBR          PIC S9(18)V        COMP-3.  00363401
003635     05  DL003-EVNT-KY-5-NBR          PIC S9(18)V        COMP-3.  00363501
003636     05  DL003-EVNT-KY-1-TXT          PIC  X(40).                 00363601
003637     05  DL003-EVNT-KY-2-TXT          PIC  X(40).                 00363701
003638     05  DL003-EVNT-KY-3-TXT          PIC  X(40).                 00363801
003639     05  DL003-EVNT-KY-4-TXT          PIC  X(40).                 00363901
003640     05  DL003-EVNT-KY-5-TXT          PIC  X(40).                 00364001
003641     05  DL003-EVNT-KY-1-TMST         PIC  X(26).                 00364101
003642     05  DL003-EVNT-KY-2-TMST         PIC  X(26).                 00364201
003643     05  DL003-EVNT-KY-3-TMST         PIC  X(26).                 00364301
003644     05  DL003-EVNT-KY-4-TMST         PIC  X(26).                 00364401
003645     05  DL003-EVNT-KY-5-TMST         PIC  X(26).                 00364501
003646     05  DL003-DTL-TXT.                                           00364601
003647         10  DL003-APP-ID-EXPORT-CDE  PIC  X(02).                 00364701
003648             88  DL003-PC-APP-ID           VALUE  'PC'.           00364801
003649             88  DL003-SU-APP-ID           VALUE  'SU'.           00364901
003650             88  DL003-VALID-APP-ID        VALUES 'PC', 'SU'.     00365001
003651         10  DL003-DTL-TXT-AREA       PIC  X(300).                00365101
003658     05  DL003-EVENT-DB-CRE-TMST      PIC  X(26).                 00365805
003659     05  DL003-TEAM-CODE              PIC X(20).                  00365910
003660     05  DL003-TEAM-CODE-IND          PIC X(03).                  00366010
003661             88  DL003-TEAM              VALUE 'TEM'.             00366110
003662             88  DL003-ONE               VALUE 'ONE'.             00366210
003670     05  DL003-FILLER-1               PIC  X(33).                 00367009
