000100**************************************************************    00010000
000200*   COPYBOOK NAME  :  DLRD020                                *    00020003
000210*   COPYBOOK LENGTH:  148                                    *    00021010
000211*   THIS IS RECORD LAYOUT FOR LABOR EVENT DATA EXTRACT       *    00021103
000216**************************************************************    00021600
000217 01  DL020-LBR-EVNT-RECORD.                                       00021703
000218     05  DL020-DC-LOC-NBR            PIC  9(04) VALUE ZEROES.     00021801
000219     05  DL020-USER-ID               PIC  X(08) VALUE SPACES.     00021901
000250     05  DL020-USER-NAME             PIC  X(40) VALUE SPACES.     00025010
000252     05  DL020-EVENT-DATE            PIC  X(10) VALUE SPACES.     00025201
000260     05  DL020-EVENT-DATE-HOUR       PIC  9(02) VALUE ZEROES.     00026011
000270     05  DL020-EVENT-TEXT            PIC  X(40) VALUE SPACES.     00027001
000280     05  DL020-EVENT-ACTION-TEXT     PIC  X(40) VALUE SPACES.     00028001
000290     05  DL020-EVENT-COUNT           PIC  9(06) VALUE ZEROES.     00029012
