000100*  DATA TO BE PURGED FROM DLT_P2L_CART_VLDN.  LRECL=68                    
000200 01  DL010-CART-VLDN-PURGE-EXTRACT.                                       
000300     05  DL010-USR-ID                 PIC X(08).                          
000400     05  DL010-NULL-1                 PIC X(01).                          
000500     05  DL010-P2L-CART-ID            PIC X(22).                          
000600     05  DL010-LOC-NBR                PIC S9(04) COMP.                    
000700     05  DL010-CRE-TMST               PIC X(26).                          
000800     05  DL010-TMP-USR-ID             PIC X(08).                          
000900     05  DL010-NULL-2                 PIC X(01).                          
