000100****************************************************************          
000200*                         DLRD001                             **          
000300*  THIS IS THE COPYBOOK USED TO FORMAT THE RED PRAIRIE        **          
000400*  "JOB0100" MESSAGE FOR FTP.                                 **          
000500****************************************************************          
000600 01  DL001-RECORD.                                                        
000700     05  DL001-JOB0100-TRANS.                                             
000800         10  DL001-JOB0100-RECORDTYPE    PIC X(15)  VALUE SPACES.         
000800         10  DL001-JOB0100-ASSIGN-NUM    PIC X(15)  VALUE SPACES.         
000800         10  DL001-JOB0100-USR-ID        PIC X(10)  VALUE SPACES.         
000800         10  DL001-JOB0100-START-TIME    PIC 9(06)  VALUE ZEROES.         
000800         10  DL001-JOB0100-KVI-GOAL-SEC  PIC X(06)  VALUE SPACES.         
000800         10  DL001-JOB0100-JOBCODEID     PIC X(06)  VALUE SPACES.         
000800         10  DL001-JOB0100-AISLE-AREA-ID PIC X(10)  VALUE SPACES.         
000800         10  DL001-JOB0100-PLAN-DATE.                                     
000800             15  DL001-JOB0100-PLAN-DATE-MM PIC 9(02).                    
000800             15  DL001-JOB0100-PLAN-DATE-DD PIC 9(02).                    
000800             15  DL001-JOB0100-PLAN-DATE-YY PIC 9(04).                    
000800         10  FILLER                      PIC X(434) VALUE SPACES.         
