000100**************************************************************    00010000
000200*   COPYBOOK NAME:    DLRD007                                *    00020000
000210*   COPYBOOK LENGTH:  50                                     *    00021000
000211*   THIS IS THE RECORD LAYOUT FOR AN EXTRACT FILE CONTAINING *    00021100
000212*   THE KEY FIELDS OF BUSINESS EVENTS THAT CAN BE PURGED FROM*    00021200
000213*   THE BUSINESS EVENT TABLES.                               *    00021300
000214**************************************************************    00021400
000215 01  DL007-BUSEV-PURGE-LAYOUT.                                    00021500
000216     15  DL007-EVNT-EXPRT-ID                 PIC  9(10).          00021600
000217     05  DL007-FILLER-1                      PIC  X(40).          00021700
