000100**************************************************************    00010000
000200*   COPYBOOK NAME:    DLRD015                                *    00020000
000210*   COPYBOOK LENGTH:  80                                     *    00021000
000211*   THIS IS THE RECORD LAYOUT FOR KEY DATA THAT NEEDS TO     *    00021100
000212*   BUMPED AGAINST SHIPPING ASSIGNMENTS TO DETERMINE IF      *    00021200
000213*   THE CORRESPONDING SHIPPING EVENTS FOUND IN THE           *    00021300
000214*   PCT_BUS_EVNT_EXPRT TABLE CAN BE UPDATED TO A 'C' STATUS  *    00021400
000215*   SO THAT EVENTS CAN BE EXTRACTED AND SENT TO DLX.         *    00021500
000216**************************************************************    00021600
000217 01  DL015-EAI-KEY-RECORD-LAYOUT.                                 00021700
000218     05  DL015-EVNT-EXPRT-ID          PIC S9(09)          COMP.   00021800
000219     05  DL015-APP-ID-EXPORT-CDE      PIC  X(02).                 00021900
000220         88  DL015-PC-APP-ID           VALUE  'PC'.               00022000
000230         88  DL015-SU-APP-ID           VALUE  'SU'.               00023000
000240         88  DL015-VALID-APP-ID        VALUES 'PC', 'SU'.         00024000
000250     05  DL015-EXTRACT-TIMESTAMP      PIC  X(26).                 00025000
000251     05  DL015-EXTRACT-DTL-TXT        PIC  X(29).                 00025101
000260     05  DL015-FILLER-1               PIC  X(19).                 00026001
