000100******************************************************************00010000
000200*  DLWS010 - 2330 (5 PAGES OF INDIRECT)(5PGS * 8 LNS = 40 CODES) *00020005
000300*                                                                 00030000
000400*  THIS MEMBER CONTAINS THE COMMON DATA THAT IS PASSED BETWEEN    00040000
000500*  THE DL ONLINE PROGRAMS IN THE COMMAREA.                        00050000
000600******************************************************************00060000
000700 01  DL010-COMMAREA.                                              00070000
000800     05  DL010-COMMON-DATA.                                       00080000
000900         10  DL010-TRANSACTION-STATUS PIC X(01) VALUE SPACE.      00090000
001000             88  DL010-INITIALIZE-SCREEN        VALUE 'S'.        00100000
001100             88  DL010-PROCESS-SCREEN           VALUE 'R'.        00110000
001200             88  DL010-WAIT-FOR-CONFIRM         VALUE 'W'.        00120000
001300             88  DL010-UPDATE-CONFIRMED         VALUE 'U'.        00130000
001400             88  DL010-CHG-PENDING              VALUE 'C'.        00140000
001410                                                                  00141000
001500*            WRITES A FULL-SIZED ABEND MESSAGE ON CSSL            00150000
001600             88  DL010-ABEND                    VALUE 'A'.        00160000
001700                                                                  00170000
001800*            ALLOWS EXIT FROM ABEND SCREEN                        00180000
001900         10  DL010-XCTL-SW            PIC X(01) VALUE SPACE.      00190000
002000             88  DL010-XCTL                     VALUE 'Y'.        00200000
002100*     NAVIGATION                                                  00210000
002200         10  DL010-LAST-PROGRAM       PIC X(08) VALUE SPACE.      00220000
002300         10  DL010-MENU-PROGRAM       PIC X(08) VALUE SPACE.      00230000
002400         10  DL010-NEXT-PROGRAM       PIC X(08) VALUE SPACE.      00240000
002500         10  DL010-ROOT-PROGRAM       PIC X(08) VALUE SPACE.      00250000
002600         10  DL010-PROGRAM-DATA.                                  00260000
002610                                                                  00261000
002620             15  DL010-SELECTION-X    PIC X(01) VALUE SPACE.      00262000
002630                 88 DL010-VALID-SELECTION       VALUE             00263000
002640                    '1', '2', '3', '4'.                           00264000
002650             15  DL010-SELECTION REDEFINES DL010-SELECTION-X      00265000
002660                                      PIC 9(01).                  00266000
002670                 88 DL010-SELECTION-ONE              VALUE 1.     00267000
002680                 88 DL010-SELECTION-TWO              VALUE 2.     00268000
002690                 88 DL010-SELECTION-THREE            VALUE 3.     00269000
002700                 88 DL010-SELECTION-FOUR             VALUE 4.     00270000
002900                                                                  00290000
003000         10  DL010-TERM-ID            PIC X(04)  VALUE SPACE.     00300000
003100         10  DL010-TRAN-ID            PIC X(04)  VALUE SPACE.     00310000
003200                                                                  00320000
003300*            THE USER THAT'S SIGNED ON                            00330000
003400         10  DL010-USERID             PIC X(08)  VALUE SPACE.     00340000
003410                                                                  00341000
003500*            THE USER THAT WAS KEYED.  DEFAULTS TO DL010-USERID   00350000
003600         10  DL010-KEYED-USERID       PIC X(08)  VALUE SPACE.     00360000
003610                                                                  00361000
003700*            THIS SWITCH AFFECTS THE PATHS AVAILABLE FOR          00370000
003800*                THE SPECIFIED USER                               00380000
003900         10  DL010-ASSIGNMENT-SW      PIC X(01)  VALUE SPACE.     00390000
004000             88  DL010-ASSGMT-FOUND-YES          VALUE 'Y'.       00400000
004100             88  DL010-ASSGMT-FOUND-NO           VALUE 'N'.       00410000
004200             88  DL010-ASSGMT-FOUND-MULT         VALUE 'M'.       00420000
004210                                                                  00421000
004300         10  DL010-ENABLE-FKEYS-SW    PIC X(01)  VALUE SPACE.     00430000
004400             88  DL010-ENABLE-FKEYS-YES          VALUE 'Y'.       00440000
004500             88  DL010-ENABLE-FKEYS-NO           VALUE 'N'.       00450000
004600                                                                  00460000
004700         10  DL010-OPER-UNT-ID        PIC S9(04) VALUE ZERO       00470000
004800                                                     COMP.        00480000
004900         10  DL010-FCLTY-ID           PIC S9(04) VALUE ZERO       00490000
005000                                                     COMP.        00500000
005100         10  DL010-TRIP-ID            PIC S9(09) VALUE ZERO       00510000
005200                                                     COMP.        00520000
005300         10  DL010-DOOR-ID            PIC X(04)  VALUE SPACE.     00530000
005400         10  DL010-AUDIT-CNTL-NBR     PIC 9(09)  VALUE ZEROES     00540000
005500                                                     COMP.        00550000
005600                                                                  00560000
005700         10  DL010-ASGMT-STRT-DTE     PIC X(10)  VALUE SPACE.     00570000
005800         10  DL010-ASGMT-NBR-TXT      PIC X(10)  VALUE SPACE.     00580000
005900         10  DL010-ASGMT-NBR-SEQ-NBR  PIC S9(09) VALUE ZERO       00590000
006000                                                     COMP.        00600000
006100         10  DL010-TEM-ASGMT-SEQ-NBR  PIC S9(09) VALUE ZERO       00610000
006200                                                     COMP.        00620000
006300                                                                  00630000
006400         10  DL010-WRK-TYP-DESC       PIC X(15)  VALUE SPACE.     00640000
006500         10  DL010-WRK-AREA-DESC      PIC X(20)  VALUE SPACE.     00650000
006600         10  DL010-ASGMT-ACTV-USR-QTY PIC S9(04)  COMP.           00660000
006700             88  DL010-ASGMT-ONLY-USR     VALUE 1.                00670000
006800         10  DL010-TEAM-COUNT         PIC S9(05) COMP-3.          00680000
006900         10  DL010-SCROLL-TABLE.                                  00690000
007000             15  DL010-PAGE-COUNT     PIC S9(03) COMP-3.          00700000
007100             15  DL010-PAGE-SUB       PIC S9(03) COMP-3.          00710000
007200             15  DL010-LINE-SUB       PIC S9(03) COMP-3.          00720000
007210*                                                                 00721000
007220*** DMH CHANGE PAGE OCCURS FROM "7" TO "4" TIMES                  00722001
007221*** DMH CHANGE LINE OCCURS FROM "5" TO "8" TIMES                  00722103
007230*                                                                 00723000
007300             15  DL010-TEAM-PAGE OCCURS 5 TIMES.                  00730003
007400                 20  DL010-PAGE-NBR   PIC S9(05) COMP-3.          00740000
007500                 20  DL010-LINE          OCCURS 8 TIMES.          00750001
007600                     25  DL010-TEAM-LINE.                         00760000
007700                         30  DL010-TEAM-USERID                    00770000
007800                                      PIC X(08).                  00780000
007900                         30  DL010-TEAM-USER-NAME PIC X(11).      00790000
008000                         30  FILLER               PIC X(06).      00800001
008100                    25  DL010-CODE-LINE REDEFINES DL010-TEAM-LINE.00810000
008200                         30  DL010-CODE-SEQ                       00820000
008300                                      PIC 9(02).                  00830000
008400                         30  DL010-CODE-DESC                      00840000
008500                                      PIC X(15).                  00850000
008600                         30  DL010-CONFIRM-SW                     00860000
008700                                      PIC X(01).                  00870000
008800                         30  DL010-TEM-PROMPT-SW                  00880000
008900                                      PIC X(01).                  00890000
009000                         30  DL010-INDIR-LBR-CDE                  00900000
009100                                      PIC X(06).                  00910000
009200*                                                                 00920000
009300*        ERROR HANDLING                                           00930000
009400*            THIS IS THE OCCURENCE OF THE ERROR SCREEN THAT WILL  00940000
009500*            BE SHOWN BY PCKRF852                                 00950000
009600         10  DL010-PGM-MSG-NBR        PIC 9(03) VALUE ZERO.       00960000
009700*            THIS IS A UNIQUE IDENTIFIER FOR AN UNRECOVERABLE     00970000
009800*            DB2 ERROR OR AN ABEND CONDITION                      00980000
009900         10  DL010-ERROR-NBR          PIC 9(03)     VALUE ZERO.   00990000
010000                                                                  01000000
010100*        DB2 ABEND FIELDS                                         01010000
010200*                                                                 01020000
010300         10  DL010-DFHEIBLK           PIC X(85)     VALUE SPACE.  01030000
010400         10  DL010-SQLCODE            PIC S9(04)    COMP.         01040000
010500         10  DL010-SQLCA              PIC X(136)    VALUE SPACES. 01050000
010600         10  DL010-PARAGRAPH          PIC X(19)     VALUE SPACES. 01060000
010700         10  DL010-DB2-TABLE-NAME    OCCURS 5 TIMES               01070000
010800                                      PIC  X(18).                 01080000
010900         10  DL010-MESSAGE-TABLE.                                 01090000
011000             15 DL010-MESSAGE-TEXT   OCCURS 4 TIMES               01100000
011100                                      PIC X(79)     VALUE SPACE.  01110000
011200                                                                  01120000
011300         10  DL010-MOD-FAIL-AREA.                                 01130000
011400             15  DL010-ORIG-CALLING-PGM-NM                        01140000
011500                                      PIC X(08).                  01150000
011600             15  DL010-SQL-ERROR-PARA                             01160000
011700                                      PIC X(05).                  01170000
011800             15  DL010-CALL-MOD-FAIL-NM                           01180000
011900                                      PIC X(08).                  01190000
012000             15  DL010-CALL-MOD-FAIL-ERR-CDE                      01200000
012100                                      PIC X(02).                  01210000
012200         10  DL010-OLD-DOOR-ID        PIC X(04)  VALUE SPACE.     01220000
012300         10  DL010-FIRST-SCAN-SW      PIC X(01)  VALUE SPACE.     01230000
012400             88  DL010-FIRST-TRIP-SCAN-NO        VALUE 'N'.       01240000
012500             88  DL010-FIRST-TRIP-SCAN-YES       VALUE 'Y'.       01250000
012600         10  DL010-INDIRECT-SW        PIC X(01)  VALUE SPACE.     01260000
012700             88  DL010-INDIRECT-ALL              VALUE 'A'.       01270000
012800             88  DL010-INDIRECT-ONE              VALUE 'O'.       01280000
012900         10  DL010-FORCE-F3-SW        PIC X(01)  VALUE 'N'.       01290000
013000             88  DL010-FORCE-F3                  VALUE 'Y'.       01300000
013100             88  DL010-FORCE-F3-NO               VALUE 'N'.       01310000
013200                                                                  01320000
013210*                                                                 01321000
013220*** DMH                                                           01322000
013230*** CHANGE DL010=FILLER FROM "119"  TO  "80"                      01323005
013250***                                                               01325000
013260*                                                                 01326000
013300         10  DL010-FILLER             PIC X(80)  VALUE SPACES.    01330005
013400******************************************************************01340000
013500*  THIS IS THE SAVE AREA FOR SU COMMAREA DATA IF NAVIGATION WAS   01350000
013600*  FROM AN SU PROGRAM.                                            01360000
013700******************************************************************01370000
013710*                                                                 01371000
013720*** DMH                                                           01372000
013730*** CHANGE HOST-SAVE-AREA FROM "500" TO "400"                     01373001
013740*** CHANGE SU FILLER FROM "140" TO "40"                           01374001
013750*** CHANGE MP-SAVE-AREA FROM "12" TO "20" (TO INCLUDE TK#)        01375000
013760*** CHANGE MP FILLER FROM "488" TO "380"                          01376001
013770***                                                               01377000
013780*                                                                 01378000
013800    05  DL010-HOST-SAVE-AREA.                                     01380000
013900        10 DL010-SU-SAVE-AREA-MAIN    PIC X(400).                 01390001
014000        10 FILLER REDEFINES DL010-SU-SAVE-AREA-MAIN.              01400000
014100           15 DL010-SU-SAVE-AREA      PIC X(360).                 01410000
014200           15 FILLER                  PIC X(40).                  01420001
014300        10 FILLER REDEFINES DL010-SU-SAVE-AREA-MAIN.              01430000
014400           15 MP026-MP-SAVE-AREA      PIC X(020).                 01440000
014500           15 FILLER                  PIC X(380).                 01450001
