000100****************************************************************          
000200*                        DLWS014                               *          
000300*                                                              *          
000400*  THIS IS THE COPYBOOK MEMBER THAT WILL CONTAIN THE MESSAGES  *          
000500*  USED IN THE LABOR MANAGEMENT SYSTEM                                    
000600****************************************************************          
000700 01  DL014-PGM-MSG-DATA.                                                  
000800     05  DL014-PRESS-ENTER-MSG           PIC  X(19)  VALUE                
000900         'PRESS ENTER TO CONT'.                                           
001000     05  DL014-DB2-FATAL-ERROR-MSG       PIC  X(19)  VALUE                
001100         'DB2 ERR/HELP DESK  '.                                           
001200     05  DL014-TRANS-NOT-AVAILABLE-MSG   PIC  X(19)  VALUE                
001300         'TRANS NOT AVAILABLE'.                                           
001400     05  DL014-CICS-FATAL-ERROR-MSG      PIC  X(19)  VALUE                
001500         'CICS ERR/HELP DESK '.                                           
001600     05  DL014-UNRECOGNIZED-PF-KEY-MSG   PIC  X(19)  VALUE                
001700         'UNRECOGNIZED PF KEY'.                                           
001800     05  DL014-SYSTEM-ERROR-MSG          PIC  X(19)  VALUE                
001900         'SYSTEM ERR/HELP DES'.                                           
002000     05  DL014-NUMERIC-VALUE-REQ-MSG     PIC X(19)  VALUE                 
002100         'NUMERIC VALUE REQ. '.                                           
002200     05  DL014-INVALID-SELECTION-MSG     PIC  X(19)  VALUE                
002300         'INVALID SELECTION  '.                                           
002400     05  DL014-DB2-ACCESS-ERROR-MSG      PIC  X(19)  VALUE                
002500         'DB2 ACCESS ERROR   '.                                           
002600     05  DL014-ENTER-THROUGH-MENU-MSG    PIC  X(19)  VALUE                
002700         'ENTER THROUGH MENU '.                                           
002800     05  DL014-NO-BYR-NME-FOUND-MSG      PIC  X(19)  VALUE                
002900         'NO BUYER NAME FOUND'.                                           
003000     05  DL014-ACCESS-DENIED-MSG         PIC  X(19)  VALUE                
003100         'USER NOT AUTHORIZED'.                                           
003200     05  DL014-CICS-AUTH-ERROR-MSG       PIC  X(19)  VALUE                
003300         'CICSAUTH BAD RETURN'.                                           
003400     05  DL014-ONLY-ONE-SELECTION-MSG    PIC  X(19)  VALUE                
003500         'SELECT ONLY ONE    '.                                           
003600     05  DL014-AUDIT-NOT-FOUND-MSG       PIC  X(19)  VALUE                
003700         'AUDIT NBR NOT FOUND'.                                           
003800     05  DL014-PF2-CONTINUE-MSG          PIC  X(19)  VALUE                
003900         'UPD COMPLT F2-CONT '.                                           
004000     05  DL014-INVALID-PRINTER-ID-MSG    PIC  X(19)  VALUE                
004100         'INVALID PRINTER ID '.                                           
004200     05  DL014-PRINTER-ID-REQUIRED-MSG   PIC  X(19)  VALUE                
004300         'PRINTER ID REQUIRED'.                                           
004400     05  DL014-PLS-ENT-FLD-MSG           PIC  X(19)  VALUE                
004500         'PLEASE ENTER FIELD '.                                           
004600     05  DL014-MORE-DIGITS-REQD          PIC  X(19)  VALUE                
004700         'MORE DIGITS REQUIRD'.                                           
004800     05  DL014-MUST-BE-GT-0-MSG          PIC  X(19)  VALUE                
004900         'MUST BE > ZERO     '.                                           
005000     05  DL014-DC-FOR-FUNCTION-MSG       PIC  X(19)  VALUE                
005100         'INVALID FUNCTION   '.                                           
