000100******************************************************************        
000200*    INTER-APPLICATION COMMUNICATION AREA FOR THE LABOR SCREENS           
000300*    LENGTH = 200 BYTES                                                   
000400******************************************************************        
000500         10  DL002-INTER-APPL-COMMAREA  REDEFINES                         
000600                                        INTER-APPL-COMM-AREA.             
000700             15  FILLER                     PIC X.                        
000800             15  DL002-NUMBER-OF-SELECTED-ITEMS                           
000900                                            PIC S9(09) COMP-3.            
001000             15  DL002-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.            
001100             15  DL002-SEL-QUEUE-NAME       PIC X(08).                    
001200             15  DL002-OPER-UNT-ID          PIC S9(04) COMP.              
001210             15  DL002-OPER-DESC            PIC  X(40).                   
001300             15  DL002-FCLTY-ID             PIC S9(04) COMP.              
001400             15  DL002-FCLTY-NME            PIC X(25).                    
001500             15  DL002-DOOR-COUNT           PIC S9(05) COMP-3.            
001510             15  DL002-USER-CODE            PIC  X(08).                   
001520             15  DL002-ADDED-BY-DC-NBR      PIC  9(04).                   
001530             15  DL002-SORT-SEQ             PIC  X(01).                   
001540                 88 DL002-SORT-SEQ-USER-CODE     VALUE 'U'.               
001550                 88 DL002-SORT-SEQ-LAST-NAME     VALUE 'L'.               
001600             15  FILLER                     PIC  X(98).                   
