000100**************************************************************    00010000
000200*    ******                IMPORTANT                 ******  *    00020000
000300*   THIS IS THE COMMUNICATION AREA TO BE USED BY A CALLING   *    00030000
000400*   PROGRAM THAT WILL USE ROUTINE DLKUT026 TO INSERT NEW     *    00040000
000500*   ASSIGNMENTS INTO THE ASSIGNMENT TABLE (THIS MODULE WILL  *    00050000
000600*   ALL ALLOW FOR THE COPY OF AN ASSIGNMENT TO A NEW         *    00060000
000610*   ASSIGNMENT) AND/OR END AN ASSIGNMENT WITHIN THE          *    00061000
000630*   ASSIGNMENT TABLE.                                        *    00062000
000631*                                                            *    00063000
000640*   WHEN THE PROGRAM CHANGES IT MUST BE COMPILED FOR         *    00064000
000650*   BOTH BATCH AND CICS                                      *    00065000
000660*                                                            *    00066000
000670*   TO INVOKE THIS PROGRAM FROM BATCH:                       *    00067000
001000*     CALL DL022-USER-PGM USING DL022-USER-COMMAREA          *    00100000
001100*    ******                IMPORTANT                 ******  *    00110000
001200*                                                            *    00120000
001300*     INITIALIZE DL022-USER-COMMAREA BEFORE CALLING DLKUT026.*    00130000
001600*     THE DL022-PROCESS-ASGMT-CDE (AND RELATED FIELDS BASED  *    00140000
001610*     ON THE VALUE OF THE CODE) ARE REQUIRED.  THE CODE WILL *    00150000
001700*     TELL THE MODULE WHAT NEEDS TO BE CREATED FROM SCRATCH, *    00160000
001701*     WHAT NEEDS TO BE COPIED AND/OR WHAT NEEDS TO BE ENDED. *    00170000
001711*                                                            *    00171000
001720*     THE APPROPRIATE DL022-NEW-ASGMT-FIELDS OR              *    00172000
001800*     DL022-COPY-ASGMT-KEYS FIELDS ARE REQUIRED BASED ON THE *    00173000
001801*     PROCESS TO BE DONE.                                    *    00174000
001810*                                                            *    00175000
001900*     REGARDING DL022-OUTPUT-FIELDS:                         *    00176000
002000*       THE APPROPRIATE OUTPUT FIELDS WILL BE RETURNED TO    *    00177000
002100*       THE CALLING PROGRAM BASED ON WHAT THE DLKUT026       *    00178000
002200*       MODULE DETERMINES.                                   *    00179000
002300*                                                            *    00180000
002400*     NOTE: IF FIELD(S) ARE ADDED TO THIS COPYBOOK           *    00190000
002500*           DECREMENT THE FILLER NEAR THE END OF THIS        *    00200000
002600*           COPYBOOK SO THE TOTAL LENGTH REMAINS THE SAME    *    00210000
002700*           AT LENGTH OF 650                                 *    00220000
002800**************************************************************    00230000
002900 01  DL022-ASGMT-COMMAREA.                                        00240000
003200     05  DL022-PROCESS-ASGMT-CDE          PIC  X(01).             00250000
003210         88  DL022-VALID-PROCESS-CODE     VALUES 'A' 'B' 'C'      00260000
003220                                                 'D' 'E' 'E'      00270000
003230                                                 'F' 'G'.         00280000
003300         88  DL022-CREATE-NEW-ASGMT       VALUE 'A'.              00290000
003310         88  DL022-CREATE-NEW-ASGMT-WTEAM VALUE 'B'.              00300000
003400         88  DL022-COPY-FROM-ASGMT        VALUE 'C'.              00310000
003410         88  DL022-COPY-FROM-ASGMT-WTEAM  VALUE 'D'.              00320000
003420         88  DL022-END-COPY-ASGMT         VALUE 'E'.              00330000
003430         88  DL022-END-COPY-ASGMT-WTEAM   VALUE 'F'.              00340000
003440         88  DL022-END-ASGMT              VALUE 'G'.              00341000
003500     05  DL022-COMMIT-CDE                 PIC  X(01).             00342000
003600         88  DL022-COMMIT-UPDATE          VALUE 'C'.              00343000
003700         88  DL022-DO-NOT-COMMIT-UPDATE   VALUE 'N'.              00344000
003710     05  DL022-LOG-TO-EAI-EXPORT-CDE      PIC  X(01).             00345000
003720         88  DL022-LOG-TO-EAI-EXPORT      VALUE 'Y'.              00346000
003730         88  DL022-NO-LOG-TO-EAI-EXPORT   VALUE 'N'.              00347000
003800     05  DL022-FILLER                     PIC  X(19).             00348000
003900     05  DL022-NEW-ASGMT-FIELDS.                                  00349000
003901         10  DL022-NA-FLD-START-DTE.                              00350000
003902             15  DL022-NA-FLD-SDTE-YYYY   PIC  X(04).             00360000
003903                 88  DL022-NA-FLD-NO-SDTY VALUE SPACES.           00370000
003904             15  DL022-FILLER             PIC  X(01).             00380000
003905             15  DL022-NA-FLD-SDTE-MM     PIC  X(02).             00390000
003906                 88  DL022-NA-FLD-NO-SDTM VALUE SPACES.           00390100
003907             15  DL022-FILLER             PIC  X(01).             00390200
003908             15  DL022-NA-FLD-SDTE-DD     PIC  X(02).             00390300
003909                 88  DL022-NA-FLD-NO-SDTD VALUE SPACES.           00390400
003910         10  DL022-NA-FLD-NBR-TXT         PIC  X(10).             00390500
003911             88  DL022-NA-FLD-NO-NBR-TXT  VALUE SPACES.           00390600
003912         10  DL022-NA-FLD-CRE-BY-USR-ID   PIC  X(08).             00390700
003913             88  DL022-NA-FLD-NO-CRE-USR  VALUE SPACES.           00390800
003914         10  DL022-NA-FLD-USR-TYP-CDE     PIC  X(01).             00390900
003915             88  DL022-USR-IS-KOHLS       VALUE 'K'.              00391000
003916             88  DL022-USR-IS-TMP         VALUE 'T'.              00391100
003917         10  DL022-NA-FLD-CRE-PGM-NM      PIC  X(08).             00391200
003918             88  DL022-NA-FLD-NO-CRE-PGM  VALUE SPACES.           00391300
003919         10  DL022-NA-FLD-WK-TYP-DESC     PIC  X(15).             00391400
003920             88  DL022-NA-FLD-NO-WK-TYP   VALUE SPACES.           00391500
003921         10  DL022-NA-FLD-WK-AREA-DESC    PIC  X(20).             00391600
003922             88  DL022-NA-FLD-NO-WK-AREA  VALUE SPACES.           00391700
003923         10  DL022-NA-FLD-DC-NBR          PIC S9(04)     COMP.    00391800
003924             88  DL022-NA-FLD-NO-DC-NBR   VALUE ZEROS.            00391900
003925         10  DL022-NA-FLD-START-TM.                               00392000
003926             15  DL022-NA-FLD-STM-HH      PIC  X(02).             00392100
003927                 88  DL022-NA-FLD-NO-STMH VALUE SPACES.           00392200
003928             15  DL022-FILLER             PIC  X(01).             00392300
003929             15  DL022-NA-FLD-STM-MM      PIC  X(02).             00392400
003930                 88  DL022-NA-FLD-NO-STMM VALUE SPACES.           00392500
003931             15  DL022-FILLER             PIC  X(01).             00392600
003932             15  DL022-NA-FLD-STM-SS      PIC  X(02).             00392700
003933                 88  DL022-NA-FLD-NO-STMS VALUE SPACES.           00392800
003934         10  DL022-FILLER                 PIC  X(50).             00392900
003935     05  DL022-END-COPY-ASGMT-KEYS.                               00393000
003936         10  DL022-ECA-KEY-START-DTE.                             00393100
003937             15  DL022-ECA-KEY-SDTE-YYYY  PIC  X(04).             00393200
003938             15  DL022-FILLER             PIC  X(01).             00393300
003939             15  DL022-ECA-KEY-SDTE-MM    PIC  X(02).             00393400
003940             15  DL022-FILLER             PIC  X(01).             00393500
003950             15  DL022-ECA-KEY-SDTE-DD    PIC  X(02).             00393600
003960         10  DL022-ECA-KEY-NBR-TXT        PIC  X(10).             00393700
003970             88  DL022-NO-KEY-NBR-TXT     VALUE SPACES.           00393800
003980         10  DL022-ECA-KEY-NBR-SEQ-NBR    PIC S9(09)     COMP.    00393900
003990             88  DL022-NO-KEY-NBR-SEQ-NBR VALUE ZEROS.            00394000
004000         10  DL022-ECA-STOP-PGM-NM        PIC  X(08).             00395000
004100             88  DL022-NO-STOP-PGM-NM     VALUE SPACES.           00396000
004200         10  DL022-ECA-STOP-RSN-CDE       PIC  X(01).             00397000
004210             88  DL022-NO-STOP-RSN-CDE    VALUE SPACES.           00398000
004211             88  DL022-STOP-TIME-EXP      VALUE 'T'.              00399000
004212             88  DL022-STOP-ASSOC-MOVE    VALUE 'M'.              00400000
004213             88  DL022-STOP-SYS-MOVE      VALUE 'S'.              00410000
004214             88  DL022-STOP-ASSOC-STOP    VALUE 'Q'.              00420000
004215             88  DL022-STOP-SYS-STOP      VALUE 'A'.              00421000
004216         10  DL022-FILLER                 PIC  X(50).             00421100
004217     05  DL022-RETURN-CODE                PIC  X(02).             00421200
004220         88  DL022-SUCCESSFUL             VALUES ZERO.            00421300
004230         88  DL022-SQL-ERROR              VALUE '01'.             00421400
004240         88  DL022-MISSING-NEW-FIELDS     VALUE '02'.             00421500
004241         88  DL022-MISSING-COPY-FIELDS    VALUE '03'.             00421600
004242         88  DL022-ASGMT-NOT-OPEN         VALUE '04'.             00421700
004243         88  DL022-COMMIT-CODE-INVALID    VALUE '05'.             00421800
004244         88  DL022-CALLED-MODULE-FAILURE  VALUE '98'.             00421900
004290         88  DL022-INVALID-ACCESS         VALUE '99'.             00422000
004300     05  DL022-RETURN-SQLCODES.                                   00423000
004400         10  DL022-ASGMT-SQLCODE          PIC  S9(9).             00424000
004500             88  DL022-ASGMT-NOT-FOUND    VALUE  +100.            00425000
004600             88  DL022-ASGMT-CONTENTION   VALUES -904 -911 -913.  00426000
004700         10  DL022-FILLER                 PIC  X(32).             00427000
004710* THE FOLLOWING FIELD SHOULD CONTAIN THE ORIGINAL CALLING         00428000
004720* PROGRAM ASSOCIATED TO THE PROCESSING TO BE DONE.                00429000
004730     05  DL022-ORIG-CALLING-PGM-NM        PIC  X(08).             00430000
004800     05  DL022-FILLER                     PIC  X(17).             00440000
004900* THE FOLLOWING ARE TO CONTAIN PARAGRAPH NUMBERS ASSOCIATED TO    00450000
005000* THE ABOVE SQL RETURN CODES.                                     00460000
005200     05  DL022-SQL-ERROR-PARA             PIC  X(05).             00470000
005210     05  DL022-CALL-MOD-FAIL-NM           PIC  X(08).             00480000
005220     05  DL022-CALL-MOD-FAIL-ERR-CDE      PIC  X(02).             00490000
005300     05  DL022-FILLER                     PIC  X(10).             00500000
005400                                                                  00510000
005500     05  DL022-OUTPUT-FIELDS.                                     00520000
005600         10  DL022-NEW-START-DTE.                                 00530000
005700             15  DL022-NEW-SDTE-YYYY      PIC  X(04).             00540000
005800             15  DL022-FILLER             PIC  X(01).             00550000
005900             15  DL022-NEW-SDTE-MM        PIC  X(02).             00560000
006000             15  DL022-FILLER             PIC  X(01).             00570000
006100             15  DL022-NEW-SDTE-DD        PIC  X(02).             00580000
006200         10  DL022-NEW-NBR-TXT            PIC  X(10).             00590000
006300         10  DL022-NEW-ASGMT-NBR-SEQ-NBR  PIC S9(09)     COMP.    00600000
006310         10  DL022-ASGMT-END-TMST.                                00610000
006320             15 DL022-ASGMT-END-YYYY      PIC  X(04).             00620000
006330             15 DL022-FILLER              PIC  X(01).             00630000
006340             15 DL022-ASGMT-END-MM        PIC  X(02).             00631000
006350             15 DL022-FILLER              PIC  X(01).             00632000
006360             15 DL022-ASGMT-END-DD        PIC  X(02).             00633000
006370             15 DL022-FILLER              PIC  X(01).             00634000
006380             15 DL022-ASGMT-END-HRS       PIC  X(02).             00635000
006390             15 DL022-FILLER              PIC  X(01).             00636000
006391             15 DL022-ASGMT-END-MIN       PIC  X(02).             00637000
006392             15 DL022-FILLER              PIC  X(01).             00638000
006393             15 DL022-ASGMT-END-SEC       PIC  X(02).             00639000
006394             15 DL022-FILLER              PIC  X(07).             00639100
006400         10  DL022-FILLER                 PIC  X(51).             00639200
006700     05  DL022-FILLER                     PIC  X(81).             00639300
006800     05  DL022-SQLCA                      PIC  X(138).            00639400
006900 01  DL022-COMMAREA                       PIC  X(01).             00639500
007000 01  DL022-USER-PGM                       PIC  X(08)              00639600
007100                                          VALUE 'DLKUP026'.       00639701
