000100**************************************************************    00010000
000200*    ******                IMPORTANT                 ******  *    00020000
000300*   THIS IS THE COMMUNICATION AREA TO BE USED BY A CALLING   *    00030000
000400*   PROGRAM THAT WILL USE ROUTINE DLKUT025 TO MAINTAIN       *    00040000
000500*   ASSOCIATES WITHIN AN ASSIGNMENT (CAN ADD AN ASSOCIATE    *    00050000
000600*   TO AN ASSIGNMENT, CAN END AN ASSOCIATE ATTACHED TO AN    *    00060000
000610*   ASSIGNMENT, CAN END ALL ASSOCIATES ATTACHED TO AN        *    00061000
000620*   ASSIGNMENT).                                             *    00062000
000700*                                                            *    00063000
001100*   TO INVOKE THIS PROGRAM IN BATCH:                         *    00067000
001700*     CALL DL021-USER-PGM USING DL021-USER-COMMAREA          *    00100000
001800*    ******                IMPORTANT                 ******  *    00110000
001900*                                                            *    00120000
002000*     INITIALIZE DL021-USER-COMMAREA BEFORE CALLING DLKUT025 *    00130000
002100*                                                            *    00140000
002200*     DL021-ACCESS-METHOD IS REQUIRED.                       *    00150000
002300*                                                            *    00160000
002400*     THE APPROPRIATE DL021-KEYS FIELDS ARE REQUIRED.        *    00170000
002500*                                                            *    00180000
002600*     REGARDING DL021-OUTPUT-FIELDS:                         *    00190000
002700*       THE APPROPRIATE OUTPUT FIELDS WILL BE RETURNED TO    *    00200000
002800*       THE CALLING PROGRAM BASED ON WHAT THE DLKUT025       *    00210000
002900*       MODULE DETERMINES.                                   *    00220000
003000*                                                            *    00230000
003100*     NOTE: IF FIELD(S) ARE ADDED TO THIS COPYBOOK           *    00240000
003200*           DECREMENT THE FILLER NEAR THE END OF THIS        *    00250000
003300*           COPYBOOK SO THE TOTAL LENGTH REMAINS THE SAME    *    00260000
003400*           AT LENGTH OF 550                                 *    00270000
003500**************************************************************    00280000
003600 01  DL021-ASGMT-COMMAREA.                                        00290000
003700     05  DL021-ACCESS-METHOD              PIC  X(04).             00300000
003800         88  DL021-BY-ASGMT-NBR           VALUE 'ASGN'.           00310000
003810     05  DL021-PROCESS-CDE                PIC  X(01).             00320000
003820         88  DL021-ADD-TO-ASGMT           VALUE 'A'.              00330000
003830         88  DL021-END-FROM-ASGMT         VALUE 'B'.              00340000
003850     05  DL021-COMMIT-CDE                 PIC  X(01).             00350000
003860         88  DL021-COMMIT-UPDATE          VALUE 'C'.              00360000
003870         88  DL021-DO-NOT-COMMIT-UPDATE   VALUE 'N'.              00370000
003900     05  DL021-FILLER                     PIC  X(20).             00380000
004000     05  DL021-KEYS.                                              00390000
004010         10  DL021-KEY-START-DTE.                                 00400000
004020             15  DL021-KEY-SDTE-YYYY      PIC  X(04).             00401000
004030             15  DL021-FILLER             PIC  X(01).             00402000
004040             15  DL021-KEY-SDTE-MM        PIC  X(02).             00403000
004050             15  DL021-FILLER             PIC  X(01).             00404000
004060             15  DL021-KEY-SDTE-DD        PIC  X(02).             00405000
004070         10  DL021-KEY-NBR-TXT            PIC  X(10).             00406000
004071             88  DL021-NO-KEY-NBR-TXT     VALUE SPACES.           00407000
004080         10  DL021-KEY-NBR-SEQ-NBR        PIC S9(09)     COMP.    00408000
004081             88  DL021-NO-KEY-NBR-SEQ-NBR VALUE ZEROS.            00408100
004082         10  DL021-KEY-TEM-ASGMT-SEQ-NBR  PIC S9(09)     COMP.    00408200
004083             88  DL021-NO-KEY-TEM-SEQ-NBR VALUE ZEROS.            00408300
004084         10  DL021-KEY-USER-ID            PIC  X(08).             00408400
004085             88  DL021-NO-KEY-USER-ID     VALUE SPACES.           00408500
004086         10  DL021-KEY-ADD-BY-USER-ID     PIC  X(08).             00408600
004087             88  DL021-NO-KEY-ADD-BY-USR  VALUE SPACES.           00408700
004088         10  DL021-KEY-LVE-PGM-NM         PIC  X(08).             00408800
004089             88  DL021-NO-KEY-LVE-BY-PGM  VALUE SPACES.           00408900
004090         10  DL021-KEY-USR-TYPE-CDE       PIC  X(01).             00409000
004091             88  DL021-KEY-USR-IS-KOHLS   VALUE 'K'.              00409100
004092             88  DL021-KEY-USR-IS-TEMP    VALUE 'T'.              00409200
004093             88  DL021-NO-KEY-USR-TYPE    VALUE SPACE.            00409300
004094         10  DL021-KEY-LVE-RSN-CDE        PIC  X(01).             00409400
004095             88  DL021-VALID-LVE-RSN-CDE  VALUES 'M' 'S' 'A'      00409500
004096                                                 'Q' 'T'.         00409600
004097             88  DL021-KEY-LVE-RSN-AMOVE  VALUE 'M'.              00409700
004098             88  DL021-KEY-LVE-RSN-SMOVE  VALUE 'S'.              00409800
004099             88  DL021-KEY-LVE-RSN-ASTOP  VALUE 'A'.              00409900
004100             88  DL021-KEY-LVE-RSN-SSTOP  VALUE 'Q'.              00410000
004101             88  DL021-KEY-LVE-RSN-TIME   VALUE 'T'.              00410100
004110             88  DL021-NO-KEY-LVE-RSN     VALUE SPACE.            00410200
004200         10  DL021-FILLER                 PIC  X(50).             00410300
004260     05  DL021-RETURN-CODE                PIC  X(02).             00410400
004270         88  DL021-SUCCESSFUL             VALUES ZERO.            00410500
004280         88  DL021-SQL-ERROR              VALUE '01'.             00410600
004290         88  DL021-MISSING-KEY-FIELDS     VALUE '02'.             00410700
004291         88  DL021-INVALID-USER-ID        VALUE '03'.             00410800
004292         88  DL021-INVALID-LVE-RSN-CDE    VALUE '04'.             00410900
004293         88  DL021-ASGMT-NOT-ACTIVE       VALUE '05'.             00411000
004294         88  DL021-ASSOC-ALREADY-ACTIVE   VALUE '06'.             00412000
004295         88  DL021-COMMIT-CODE-INVALID    VALUE '07'.             00413000
004296         88  DL021-PROCESS-CODE-INVALID   VALUE '08'.             00414000
004297         88  DL021-CALLED-MODULE-FAILURE  VALUE '98'.             00415000
004300         88  DL021-INVALID-ACCESS         VALUE '99'.             00416000
004400     05  DL021-RETURN-SQLCODES.                                   00417000
004500         10  DL021-ASGMT-SQLCODE          PIC  S9(9).             00418000
004600             88  DL021-ASGMT-NOT-FOUND    VALUE  +100.            00419000
004700             88  DL021-ASGMT-CONTENTION   VALUES -904 -911 -913.  00420000
004800         10  DL021-FILLER                 PIC  X(32).             00430000
004810* THE FOLLOWING FIELD SHOULD CONTAIN THE ORIGINAL CALLING         00440000
004820* PROGRAM ASSOCIATED TO THE PROCESSING TO BE DONE.                00450000
004830     05  DL021-ORIG-CALLING-PGM-NM        PIC  X(08).             00460000
004900     05  DL021-FILLER                     PIC  X(17).             00470000
005000* THE FOLLOWING ARE TO CONTAIN PARAGRAPH NUMBERS ASSOCIATED TO    00480000
005100* THE ABOVE SQL RETURN CODES.                                     00490000
005300     05  DL021-SQL-ERROR-PARA             PIC  X(05).             00500000
005310     05  DL021-CALL-MOD-FAIL-NM           PIC  X(08).             00510000
005320     05  DL021-CALL-MOD-FAIL-ERR-CDE      PIC  X(02).             00520000
005400     05  DL021-FILLER                     PIC  X(10).             00530000
005500                                                                  00540000
005600     05  DL021-OUTPUT-FIELDS.                                     00550000
006010         10  DL021-ASSOC-FOUND-CODE       PIC  X(1).              00560000
006020             88  DL021-ASSOC-FOUND        VALUE 'Y'.              00570000
006030             88  DL021-ASSOC-NOT-FOUND    VALUE 'N'.              00580000
006031             88  DL021-ASSOC-NOT-ACTIVE   VALUE 'A'.              00590000
006040             88  DL021-ASSOC-LAST-ACTIVE  VALUE 'B'.              00600000
006050         10  DL021-ASSOC-TMST.                                    00601000
006060             15 DL021-ASSOC-YYYY          PIC  X(04).             00602000
006070             15 DL021-FILLER              PIC  X(01).             00603000
006080             15 DL021-ASSOC-MM            PIC  X(02).             00604000
006090             15 DL021-FILLER              PIC  X(01).             00605000
006100             15 DL021-ASSOC-DD            PIC  X(02).             00606000
006200             15 DL021-FILLER              PIC  X(01).             00607000
006300             15 DL021-ASSOC-HRS           PIC  X(02).             00608000
006400             15 DL021-FILLER              PIC  X(01).             00609000
006500             15 DL021-ASSOC-MIN           PIC  X(02).             00610000
006600             15 DL021-FILLER              PIC  X(01).             00620000
006700             15 DL021-ASSOC-SEC           PIC  X(02).             00630000
006800             15 DL021-FILLER              PIC  X(07).             00640000
007703         10  DL021-FILLER                 PIC  X(51).             00650000
007704                                                                  00660000
007705     05  DL021-FILLER                     PIC  X(111).            00670000
007706     05  DL021-SQLCA                      PIC  X(138).            00680000
007707 01  DL021-COMMAREA                       PIC  X(01).             00690000
007708 01  DL021-USER-PGM                       PIC  X(08)              00700000
007709                                          VALUE 'DLKUP025'.       00710001
