000100**************************************************************    00010000
000110*  DLWS026  --  DLKUT030                                     *    00011000
000120**************************************************************    00012000
000130*    ******                IMPORTANT                 ******  *    00013000
000140*   THIS IS THE COMMUNICATION AREA TO BE USED BY A CALLING   *    00014000
000150*   PROGRAM THAT WILL USE ROUTINE DLKUT030 TO HANDLE         *    00015000
000160*   ENDING ASSIGNMENTS WHEN MULTIPLE ARE OPEN FOR THE SAMM   *    00016000
000170*   DC/WORK TYPE/WORK AREA.                                  *    00017000
000180*                                                            *    00018000
000200*   TO INVOKE THIS PROGRAM IN BATCH:                         *    00020002
000300*     CALL DL026-DC-MULT-ASGMT-PGM                           *    00030002
000400*                          USING DL026-ASGMT-COMMAREA        *    00040002
000500*                                                            *    00050002
000700*    ******                IMPORTANT                 ******  *    00070000
000800*                                                            *    00080000
000900*   INITIALIZE DL026-ASGMT-COMMAREA BEFORE CALLING DLKUT030  *    00090002
001000*                                                            *    00100000
001100*     DL026-ACCESS-METHOD IS REQUIRED.                       *    00110000
001200*                                                            *    00120000
001300*     THE APPROPRIATE DL026-KEYS FIELDS ARE REQUIRED.        *    00130000
001400*                                                            *    00140000
001500*     REGARDING DL026-OUTPUT-FIELDS:                         *    00150000
001600*       THE APPROPRIATE OUTPUT FIELDS WILL BE RETURNED TO    *    00160000
001700*       THE CALLING PROGRAM BASED ON WHAT THE DLKUT030       *    00170000
001800*       MODULE DETERMINES.                                   *    00180000
001900*                                                            *    00190000
002000*     NOTE: IF FIELD(S) ARE ADDED TO THIS COPYBOOK           *    00200000
002100*           DECREMENT THE FILLER NEAR THE END OF THIS        *    00210000
002200*           COPYBOOK SO THE TOTAL LENGTH REMAINS THE SAME    *    00220000
002300*           AT LENGTH OF 550                                 *    00230000
002400**************************************************************    00240000
002500 01  DL026-ASGMT-COMMAREA.                                        00250000
002600     05  DL026-ACCESS-METHOD              PIC  X(04).             00260000
002700         88  DL026-BY-DC-MULT-ASGMT            VALUE 'MLTD'.      00270001
002800     05  DL026-FILLER                     PIC  X(20).             00280000
002900                                                                  00290000
003000     05  DL026-KEYS.                                              00300000
003100         10  DL026-KEY-WK-TYP             PIC X(15).              00310000
003200                 88  DL026-NO-KEY-WK-TYP       VALUE SPACES.      00320000
003300         10  DL026-KEY-WK-AREA  PIC X(20).                        00330000
003400                 88  DL026-NO-KEY-WK-AREA      VALUE SPACES.      00340000
003500         10  DL026-KEY-DC-NBR             PIC S9(04) COMP.        00350000
003600             88  DL026-NO-KEY-DC-NBR           VALUE ZEROS.       00360000
003700***      10  DL026-KEY-USER-ID            PIC  X(08).             00370001
003800***          88  DL003-NO-KEY-USER-ID          VALUE SPACES.      00380001
003900***      10  DL026-USER-FOUND-CODE        PIC  X(01).             00390001
004000***          88  DL026-USER-NOT-FOUND          VALUE 'N'.         00400001
004100***          88  DL026-USER-IS-KOHLS           VALUE 'K'.         00410001
004200***          88  DL026-USER-IS-TEMP            VALUE 'T'.         00420001
004300***      10  DL026-FILLER                 PIC  X(49).             00430001
004310         10  DL026-FILLER                 PIC  X(58).             00431001
004400                                                                  00440000
004500     05  DL026-RETURN-CODE                PIC  X(02).             00450000
004600         88  DL026-SUCCESSFUL             VALUES ZERO.            00460000
004700         88  DL026-SQL-ERROR              VALUE '01'.             00470000
004800         88  DL026-MISSING-KEY-FIELDS     VALUE '02'.             00480000
004900         88  DL026-CALLED-MODULE-FAILURE  VALUE '98'.             00490000
005000         88  DL026-INVALID-ACCESS         VALUE '99'.             00500000
005100                                                                  00510000
005200     05  DL026-RETURN-SQLCODES.                                   00520000
005300         10  DL026-ASGMT-SQLCODE          PIC  S9(9).             00530000
005400             88  DL026-SQL-NOT-FOUND      VALUE  +100.            00540000
005500             88  DL026-SQL-CONTENTION     VALUES -904 -911 -913.  00550000
005600         10  DL026-FILLER                 PIC  X(32).             00560000
005700                                                                  00570000
005800* THE FOLLOWING FIELD SHOULD CONTAIN THE ORIGINAL CALLING         00580000
005900* PROGRAM ASSOCIATED TO THE PROCESSING TO BE DONE.                00590000
006000     05  DL026-ORIG-CALLING-PGM-NM        PIC  X(08).             00600000
006100     05  DL026-FILLER                     PIC  X(17).             00610000
006200                                                                  00620000
006300* THE FOLLOWING ARE TO CONTAIN PARAGRAPH NUMBERS ASSOCIATED TO    00630000
006400* THE ABOVE SQL RETURN CODES.                                     00640000
006500     05  DL026-CALL-MOD-FAIL-SQL-PARA     PIC  X(5).              00650000
006600     05  DL026-CALL-MOD-FAIL-NM           PIC  X(08).             00660000
006700     05  DL026-CALL-MOD-FAIL-ERR-CDE      PIC  X(02).             00670000
006710     05  DL026-CALL-MOD-FAIL-SQL-CDE      PIC  S9(9).             00671000
006720     05  DL026-FILLER                     PIC  X(10).             00672000
006730                                                                  00673000
006740     05  DL026-OUTPUT-FIELDS.                                     00674000
006750         10  DL026-FILLER                 PIC  X(108).            00675000
006760                                                                  00676000
006770     05  DL026-FILLER                     PIC  X(92).             00677000
006780     05  DL026-SQLCA                      PIC  X(138).            00678000
006790 01  DL026-COMMAREA                       PIC  X(01).             00679000
006800 01  DL026-DC-MULT-ASGMT-PGM              PIC  X(08)              00680001
006900                                          VALUE 'DLKUT030'.       00690000
