000100 01  DL011-ASGMT-TEMPLATE.                                                
000200     05  DL011-KEYS.                                                      
000300***************************************************************           
000400*   USE THE FOLLOWING TO CONSISTENTLY FORMAT THE ASSIGNMENT   *           
000500*   NUMBER FIELD WITHIN DL PROGRAMS.                          *           
000600***************************************************************           
000700         10  DL011-KEY-ASGMT-NBR-TXT.                                     
000800             15  DL011-KEY-ASGMT-NBR-DC   PIC  9(04)  VALUE 0.            
000900             15  DL011-KEY-ASGMT-NBR-WRK-TYP                              
001000                                       PIC  X(06)  VALUE SPACE.           
001100                 88  DL011-AN-RECV-WRK-TYP    VALUE 'RECV  '.             
001100                 88  DL011-AN-RECV1-WRK-TYP   VALUE 'RECV1 '.             
001200                 88  DL011-AN-FLAT-WRK-TYP    VALUE 'FLAT  '.             
001300                 88  DL011-AN-SHIP-WRK-TYP    VALUE 'SHIP  '.             
001400                 88  DL011-AN-P2L-WRK-TYP     VALUE 'P2L   '.             
001400                 88  DL011-AN-P2L1-WRK-TYP    VALUE 'P2L1  '.             
001500                 88  DL011-AN-RLABL-WRK-TYP   VALUE 'RLABL '.             
001600***************************************************************           
001700*   USE THE FOLLOWING TO CONSISTENTLY FORMAT THE ASSIGNMENT   *           
001800*   WORK TYPE FIELD WITHIN THE DL PROGRAMS.                   *           
001900***************************************************************           
002000         10  DL011-KEY-WK-TYP.                                            
002100             15 DL011-WRK-TYP-DESC-1-6   PIC  X(06)  VALUE SPACE.         
002200                 88  DL011-RECV-WRK-TYP      VALUE 'RECV  '.              
002300                 88  DL011-FLAT-WRK-TYP      VALUE 'FLAT  '.              
002400                 88  DL011-SHIP-WRK-TYP      VALUE 'SHIP  '.              
002500                 88  DL011-P2L-WRK-TYP       VALUE 'P2L   '.              
002600                 88  DL011-RLABL-WRK-TYP     VALUE 'RLABL '.              
002700             15 FILLER                   PIC  X(09)  VALUE SPACE.         
002800***************************************************************           
002900*   USE THE FOLLOWING TO CONSISTENTLY FORMAT THE ASSIGNMENT   *           
003000*   WORK AREA FIELD WITHIN THE DL PROGRAMS FOR THE RECEIVING  *           
003100*   DOOR. (EX. CARTON CHECKIN, TRAILER OPEN                   *           
003200***************************************************************           
003300         10  DL011-RECV-DOOR-WRK-AREA.                                    
003400             15  DL011-RD-WRK-AREA-1-4         PIC  X(04)                 
003500                                               VALUE 'DOOR'.              
003600             15  DL011-RD-WRK-AREA-DOOR-NBR    PIC  X(04).                
003700             15  DL011-RD-WRK-AREA-9-20        PIC  X(12)                 
003800                                               VALUE SPACE.               
003900***************************************************************           
004000*   USE THE FOLLOWING TO CONSISTENTLY FORMAT THE ASSIGNMENT   *           
004100*   WORK AREA FIELD WITHIN THE DL PROGRAMS FOR THE RECEIVING  *           
004200*   IN FLAT (EX. CARTON CHECKIN, TRAILER OPEN)                *           
004300***************************************************************           
004400         10  DL011-RECV-FLAT-WRK-AREA.                                    
004500             15  DL011-RF-WRK-AREA-1-4         PIC  X(04)                 
004600                                               VALUE 'DOOR'.              
004700             15  DL011-RF-WRK-AREA-DOOR-NBR    PIC  X(04)                 
004800                                               VALUE 'FLAT'.              
004900             15  FILLER                        PIC  X(01)                 
005000                                               VALUE SPACES.              
005100             15  DL011-RF-WRK-AREA-USER-ID     PIC  X(08).                
005200             15  DL011-RF-WRK-AREA-18-20       PIC  X(03)                 
005300                                               VALUE SPACE.               
005400***************************************************************           
005500*   USE THE FOLLOWING TO CONSISTENTLY FORMAT THE ASSIGNMENT   *           
005600*   WORK AREA FIELD WITHIN THE DL PROGRAMS FOR THE QA IN      *           
005700*   FLAT.                                                     *           
005800***************************************************************           
005900         10  DL011-FLAT-FQA-WRK-AREA.                                     
006000             15  DL011-FQ-WRK-AREA-1-3         PIC  X(03)                 
006100                                               VALUE 'FQA'.               
006200             15  FILLER                        PIC  X(01)                 
006300                                               VALUE SPACES.              
006400             15  DL011-FQ-WRK-AREA-USER-ID     PIC  X(08).                
006500             15  DL011-FQ-WRK-AREA-13-20       PIC  X(08)                 
006600                                               VALUE SPACE.               
006700***************************************************************           
006800*   USE THE FOLLOWING TO CONSISTENTLY FORMAT THE ASSIGNMENT   *           
006900*   WORK AREA FIELD WITHIN THE DL PROGRAMS FOR SHIPPING       *           
007000*   DOOR GROUPS.                                              *           
007100***************************************************************           
007200         10  DL011-SHIP-DOORGRP-WRK-AREA.                                 
007300             15  DL011-SD-WRK-AREA-1-3         PIC  X(07)                 
007400                                               VALUE 'DOORGRP'.           
007500             15  DL011-SD-WRK-AREA-DOOR-GROUP  PIC  9(04).                
007600             15  DL011-SD-WRK-AREA-12-20       PIC  X(09)                 
007700                                               VALUE SPACE.               
007800***************************************************************           
007900*   USE THE FOLLOWING TO CONSISTENTLY FORMAT THE ASSIGNMENT   *           
008000*   WORK AREA FIELD WITHIN THE DL PROGRAMS FOR P2L MODS.      *           
008100***************************************************************           
008200         10  DL011-P2L-MOD-WRK-AREA.                                      
008300             15  DL011-P2-WRK-AREA-1-4         PIC  X(04)                 
008400                                               VALUE 'P2L-'.              
008500             15  DL011-P2-WRK-AREA-5-9         PIC  X(05).                
008600             15  FILLER                        PIC  X(01)                 
008700                                               VALUE SPACES.              
008800             15  DL011-P2-WRK-AREA-MOD-1-3     PIC  X(03)                 
008400                                               VALUE 'MOD'.               
008800             15  DL011-P2-WRK-AREA-MOD-4-6     PIC  9(03).                
008900             15  DL011-P2-WRK-AREA-19-20       PIC  X(04)                 
009000                                               VALUE SPACE.               
009100***************************************************************           
009200*   USE THE FOLLOWING TO CONSISTENTLY FORMAT THE ASSIGNMENT   *           
009300*   WORK AREA FIELD WITHIN THE DL PROGRAMS FOR CARTON LABEL   *           
009400*   PRINTING                                                  *           
009500***************************************************************           
009600         10  DL011-RLABL-WRK-AREA.                                        
009700             15  DL011-RL-WRK-AREA-1-3         PIC  X(05)                 
009800                                               VALUE 'RLABL'.             
009900             15  FILLER                        PIC  X(01)                 
010000                                               VALUE SPACES.              
010100             15  DL011-RL-WRK-AREA-USER-ID     PIC  X(08).                
010200             15  DL011-RL-WRK-AREA-15-20       PIC  X(06)                 
010300                                               VALUE SPACE.               
