000100**************************************************************    00010000
000200*    ******                IMPORTANT                 ******  *    00020000
000300*   THIS IS THE COMMUNICATION AREA TO BE USED BY A CALLING   *    00030000
000400*   PROGRAM THAT WILL USE ROUTINE DLKUT027 TO MANAGE THE     *    00040000
000500*   WRITE OF THE SHIPPING SUMMARY RECORDS TO THE EAI EXPORT  *    00050000
000600*   TABLES FOR EVERY DOOR WITHIN A DOOR GROUP TEMPLATE.      *    00060000
001000*                                                            *    00100000
001010*   TO INVOKE THIS PROGRAM IN BATCH:                         *    00101000
001020*     CALL DL023-USER-PGM USING DL023-USER-COMMAREA          *    00102000
001030*    ******                IMPORTANT                 ******  *    00103000
001900*                                                            *    00190000
002000*     INITIALIZE DL023-USER-COMMAREA BEFORE CALLING DLKUT027 *    00200000
002100*                                                            *    00210000
002200*     THE APPROPRIATE DL023-INPUT FIELDS ARE REQUIRED.       *    00220000
002300*                                                            *    00230000
002400*     REGARDING DL023-OUTPUT-FIELDS:                         *    00240000
002500*       DL023-ASGMT-FOUND-CODE IS ALWAYS RETURNED.           *    00250000
002600*                                                            *    00260000
002700*     NOTE: IF FIELD(S) ARE ADDED TO THIS COPYBOOK           *    00270000
002800*           DECREMENT THE FILLER NEAR THE END OF THIS        *    00280000
002900*           COPYBOOK SO THE TOTAL LENGTH REMAINS THE SAME    *    00290000
003000*           AT LENGTH OF 550                                 *    00300000
003100**************************************************************    00310000
003200 01  DL023-ASGMT-COMMAREA.                                        00320000
003300     05  DL023-ACCESS-METHOD              PIC  X(04).             00330000
003400         88  DL023-BY-DOOR-GROUP-ID       VALUE 'AKEY'.           00340000
003500     05  DL023-FILLER                     PIC  X(20).             00350000
003600     05  DL023-INPUT-FIELDS.                                      00360000
003700         10  DL023-ASGMT-START-DTE        PIC  X(10).             00370000
003800         10  DL023-ASGMT-NBR-TXT          PIC  X(10).             00380000
003900         10  DL023-ASGMT-NBR-SEQ-NBR      PIC S9(09)     COMP.    00390000
004000         10  DL023-DOOR-GP-NBR            PIC S9(09)     COMP.    00400000
004100         10  DL023-DC-NBR                 PIC S9(04)     COMP.    00410000
004200         10  DL023-ASGMT-STRT-TMST        PIC  X(26).             00420000
004300         10  DL023-ASGMT-STOP-TMST        PIC  X(26).             00430000
004400         10  DL023-BEGIN-DETAIL-SEQ-NBR   PIC S9(09)     COMP.    00440000
004500         10  DL023-NBR-DOORS              PIC S9(04)     COMP.    00450000
004600         10  DL023-USR-ID                 PIC  X(08).             00460000
004700         10  DL023-FILLER                 PIC  X(46).             00470000
004800                                                                  00480000
004900     05  DL023-COMMIT-CDE                 PIC  X(01).             00490000
005000         88  DL023-COMMIT-UPDATE          VALUE 'C'.              00500000
005100         88  DL023-DO-NOT-COMMIT-UPDATE   VALUE 'N'.              00510000
005200     05  DL023-RETURN-CODE            PIC  X(02).                 00520000
005300         88  DL023-SUCCESSFUL             VALUES ZERO.            00530000
005400         88  DL023-SQL-ERROR              VALUE '01'.             00540000
005500         88  DL023-COMMIT-CODE-INVALID    VALUE '03'.             00550000
005600         88  DL023-INPUT-FIELD-01-MISSING VALUE '11'.             00560000
005700         88  DL023-INPUT-FIELD-02-MISSING VALUE '12'.             00570000
005800         88  DL023-INPUT-FIELD-03-MISSING VALUE '13'.             00580000
005900         88  DL023-INPUT-FIELD-04-MISSING VALUE '14'.             00590000
006000         88  DL023-INPUT-FIELD-05-MISSING VALUE '15'.             00600000
006100         88  DL023-INPUT-FIELD-06-MISSING VALUE '16'.             00610000
006200         88  DL023-INPUT-FIELD-07-MISSING VALUE '17'.             00620000
006300         88  DL023-INPUT-FIELD-08-MISSING VALUE '18'.             00630000
006400         88  DL023-INPUT-FIELD-09-MISSING VALUE '19'.             00640000
006500         88  DL023-INPUT-FIELD-10-MISSING VALUE '20'.             00650000
006600         88  DL023-INPUT-FIELD-11-MISSING VALUE '21'.             00660000
006700         88  DL023-CALLED-MODULE-FAILURE  VALUE '98'.             00670000
006800         88  DL023-INVALID-ACCESS         VALUE '99'.             00680000
006900     05  DL023-RETURN-SQLCODES.                                   00690000
007000         10  DL023-ASGMT-SQLCODE      PIC  S9(9).                 00700000
007100             88  DL023-SQL-NOT-FOUND      VALUE  +100.            00710000
007200             88  DL023-SQL-CONTENTION     VALUES -904 -911 -913.  00720000
007300         10  DL023-FILLER             PIC  X(32).                 00730000
007400* THE FOLLOWING FIELD SHOULD CONTAIN THE ORIGINAL CALLING         00740000
007500* PROGRAM ASSOCIATED TO THE PROCESSING TO BE DONE.                00750000
007600     05  DL023-ORIG-CALLING-PGM-NM    PIC  X(08).                 00760000
007700     05  DL023-FILLER                 PIC  X(17).                 00770000
007800* THE FOLLOWING ARE TO CONTAIN PARAGRAPH NUMBERS ASSOCIATED TO    00780000
007900* THE ABOVE SQL RETURN CODES.                                     00790000
008000     05  DL023-SQL-ERROR-PARA         PIC  X(05).                 00800000
008100     05  DL023-CALL-MOD-FAIL-NM       PIC  X(08).                 00810000
008200     05  DL023-CALL-MOD-FAIL-ERR-CDE  PIC  X(02).                 00820000
008300     05  DL023-FILLER                 PIC  X(10).                 00830000
008400                                                                  00840000
008500     05  DL023-OUTPUT-FIELDS.                                     00850000
008600         10  DL023-FILLER             PIC  X(50).                 00860000
008700                                                                  00870000
008800     05  DL023-FILLER                 PIC X(102).                 00880000
008900     05  DL023-SQLCA                  PIC X(138).                 00890000
009000 01  DL023-COMMAREA                   PIC X(01).                  00900000
009100 01  DL023-USER-PGM                   PIC X(08) VALUE 'DLKUT027'. 00910000
