000100**************************************************************    00010000
000200*    ******                IMPORTANT                 ******  *    00020000
000300*   THIS IS THE COMMUNICATION AREA TO BE USED BY A CALLING   *    00030000
000400*   PROGRAM THAT WILL USE ROUTINE DLKUP003 TO INSERT NEW     *    00040000
000500*   ASSIGNMENTS INTO THE ASSIGNMENT TABLE (THIS MODULE WILL  *    00050000
000600*   ALL ALLOW FOR THE COPY OF AN ASSIGNMENT TO A NEW         *    00060000
000610*   ASSIGNMENT) AND/OR END AN ASSIGNMENT WITHIN THE          *    00061005
000630*   ASSIGNMENT TABLE.                                        *    00063005
000631*                                                            *    00063105
000640*   WHEN THE PROGRAM CHANGES IT MUST BE COMPILED FOR         *    00064000
000650*   BOTH BATCH AND CICS                                      *    00065000
000660*                                                            *    00066000
000670*   TO INVOKE THIS PROGRAM FROM A CICS EXIT YOU MUST USE THIS*    00067000
000680*   FORMAT:                                                  *    00068000
000690*     CALL DL007-USER-PGM USING DFHEIBLK                     *    00069000
000700*                              DL007-COMMAREA                *    00070000
000800*                              DL007-USER-COMMAREA           *    00080000
000900*   IN BATCH DO THIS:                                        *    00090000
001000*     CALL DL007-USER-PGM USING DL007-USER-COMMAREA          *    00100000
001100*    ******                IMPORTANT                 ******  *    00110000
001200*                                                            *    00120000
001300*     INITIALIZE DL007-USER-COMMAREA BEFORE CALLING DLKUP003.*    00130005
001600*     THE DL007-PROCESS-ASGMT-CDE (AND RELATED FIELDS BASED  *    00160005
001610*     ON THE VALUE OF THE CODE) ARE REQUIRED.  THE CODE WILL *    00161005
001700*     TELL THE MODULE WHAT NEEDS TO BE CREATED FROM SCRATCH, *    00170005
001701*     WHAT NEEDS TO BE COPIED AND/OR WHAT NEEDS TO BE ENDED. *    00170105
001711*                                                            *    00171100
001720*     THE APPROPRIATE DL007-NEW-ASGMT-FIELDS OR              *    00172001
001800*     DL007-COPY-ASGMT-KEYS FIELDS ARE REQUIRED BASED ON THE *    00180001
001801*     PROCESS TO BE DONE.                                    *    00180101
001810*                                                            *    00181001
001900*     REGARDING DL007-OUTPUT-FIELDS:                         *    00190000
002000*       THE APPROPRIATE OUTPUT FIELDS WILL BE RETURNED TO    *    00200000
002100*       THE CALLING PROGRAM BASED ON WHAT THE DLKUP003       *    00210000
002200*       MODULE DETERMINES.                                   *    00220000
002300*                                                            *    00230000
002400*     NOTE: IF FIELD(S) ARE ADDED TO THIS COPYBOOK           *    00240000
002500*           DECREMENT THE FILLER NEAR THE END OF THIS        *    00250000
002600*           COPYBOOK SO THE TOTAL LENGTH REMAINS THE SAME    *    00260000
002700*           AT LENGTH OF 650                                 *    00270005
002800**************************************************************    00280000
002900 01  DL007-ASGMT-COMMAREA.                                        00290000
003200     05  DL007-PROCESS-ASGMT-CDE          PIC  X(01).             00320000
003210         88  DL007-VALID-PROCESS-CODE     VALUES 'A' 'B' 'C'      00321007
003220                                                 'D' 'E' 'E'      00322007
003230                                                 'F' 'G'.         00323007
003300         88  DL007-CREATE-NEW-ASGMT       VALUE 'A'.              00330000
003310         88  DL007-CREATE-NEW-ASGMT-WTEAM VALUE 'B'.              00331001
003400         88  DL007-COPY-FROM-ASGMT        VALUE 'C'.              00340002
003410         88  DL007-COPY-FROM-ASGMT-WTEAM  VALUE 'D'.              00341002
003420         88  DL007-END-COPY-ASGMT         VALUE 'E'.              00342004
003430         88  DL007-END-COPY-ASGMT-WTEAM   VALUE 'F'.              00343004
003440         88  DL007-END-ASGMT              VALUE 'G'.              00344004
003500     05  DL007-COMMIT-CDE                 PIC  X(01).             00350000
003600         88  DL007-COMMIT-UPDATE          VALUE 'C'.              00360000
003700         88  DL007-DO-NOT-COMMIT-UPDATE   VALUE 'N'.              00370000
003710     05  DL007-LOG-TO-EAI-EXPORT-CDE      PIC  X(01).             00371011
003720         88  DL007-LOG-TO-EAI-EXPORT      VALUE 'Y'.              00372011
003730         88  DL007-NO-LOG-TO-EAI-EXPORT   VALUE 'N'.              00373011
003800     05  DL007-FILLER                     PIC  X(19).             00380011
003900     05  DL007-NEW-ASGMT-FIELDS.                                  00390000
003901         10  DL007-NA-FLD-START-DTE.                              00390100
003902             15  DL007-NA-FLD-SDTE-YYYY   PIC  X(04).             00390200
003903                 88  DL007-NA-FLD-NO-SDTY VALUE SPACES.           00390301
003904             15  DL007-FILLER             PIC  X(01).             00390409
003905             15  DL007-NA-FLD-SDTE-MM     PIC  X(02).             00390500
003906                 88  DL007-NA-FLD-NO-SDTM VALUE SPACES.           00390601
003907             15  DL007-FILLER             PIC  X(01).             00390709
003908             15  DL007-NA-FLD-SDTE-DD     PIC  X(02).             00390800
003909                 88  DL007-NA-FLD-NO-SDTD VALUE SPACES.           00390901
003910         10  DL007-NA-FLD-NBR-TXT         PIC  X(10).             00391001
003911             88  DL007-NA-FLD-NO-NBR-TXT  VALUE SPACES.           00391101
003912         10  DL007-NA-FLD-CRE-BY-USR-ID   PIC  X(08).             00391201
003913             88  DL007-NA-FLD-NO-CRE-USR  VALUE SPACES.           00391306
003914         10  DL007-NA-FLD-USR-TYP-CDE     PIC  X(01).             00391401
003915             88  DL007-USR-IS-KOHLS       VALUE 'K'.              00391506
003916             88  DL007-USR-IS-TMP         VALUE 'T'.              00391606
003917         10  DL007-NA-FLD-CRE-PGM-NM      PIC  X(08).             00391701
003918             88  DL007-NA-FLD-NO-CRE-PGM  VALUE SPACES.           00391801
003919         10  DL007-NA-FLD-WK-TYP-DESC     PIC  X(15).             00391901
003920             88  DL007-NA-FLD-NO-WK-TYP   VALUE SPACES.           00392001
003921         10  DL007-NA-FLD-WK-AREA-DESC    PIC  X(20).             00392101
003922             88  DL007-NA-FLD-NO-WK-AREA  VALUE SPACES.           00392201
003923         10  DL007-NA-FLD-DC-NBR          PIC S9(04)     COMP.    00392301
003924             88  DL007-NA-FLD-NO-DC-NBR   VALUE ZEROS.            00392401
003925         10  DL007-NA-FLD-START-TM.                               00392501
003926             15  DL007-NA-FLD-STM-HH      PIC  X(02).             00392601
003927                 88  DL007-NA-FLD-NO-STMH VALUE SPACES.           00392701
003928             15  DL007-FILLER             PIC  X(01).             00392809
003929             15  DL007-NA-FLD-STM-MM      PIC  X(02).             00392901
003930                 88  DL007-NA-FLD-NO-STMM VALUE SPACES.           00393001
003931             15  DL007-FILLER             PIC  X(01).             00393109
003932             15  DL007-NA-FLD-STM-SS      PIC  X(02).             00393201
003933                 88  DL007-NA-FLD-NO-STMS VALUE SPACES.           00393301
003934         10  DL007-FILLER                 PIC  X(50).             00393409
003935     05  DL007-END-COPY-ASGMT-KEYS.                               00393505
003936         10  DL007-ECA-KEY-START-DTE.                             00393610
003937             15  DL007-ECA-KEY-SDTE-YYYY  PIC  X(04).             00393705
003938             15  DL007-FILLER             PIC  X(01).             00393809
003939             15  DL007-ECA-KEY-SDTE-MM    PIC  X(02).             00393905
003940             15  DL007-FILLER             PIC  X(01).             00394009
003950             15  DL007-ECA-KEY-SDTE-DD    PIC  X(02).             00395005
003960         10  DL007-ECA-KEY-NBR-TXT        PIC  X(10).             00396010
003970             88  DL007-NO-KEY-NBR-TXT     VALUE SPACES.           00397005
003980         10  DL007-ECA-KEY-NBR-SEQ-NBR    PIC S9(09)     COMP.    00398005
003990             88  DL007-NO-KEY-NBR-SEQ-NBR VALUE ZEROS.            00399005
004000         10  DL007-ECA-STOP-PGM-NM        PIC  X(08).             00400005
004100             88  DL007-NO-STOP-PGM-NM     VALUE SPACES.           00410005
004200         10  DL007-ECA-STOP-RSN-CDE       PIC  X(01).             00420006
004210             88  DL007-NO-STOP-RSN-CDE    VALUE SPACES.           00421005
004211             88  DL007-STOP-TIME-EXP      VALUE 'T'.              00421105
004212             88  DL007-STOP-ASSOC-MOVE    VALUE 'M'.              00421205
004213             88  DL007-STOP-SYS-MOVE      VALUE 'S'.              00421305
004214             88  DL007-STOP-ASSOC-STOP    VALUE 'Q'.              00421405
004215             88  DL007-STOP-SYS-STOP      VALUE 'A'.              00421505
004216         10  DL007-FILLER                 PIC  X(50).             00421609
004217     05  DL007-RETURN-CODE                PIC  X(02).             00421701
004220         88  DL007-SUCCESSFUL             VALUES ZERO.            00422000
004230         88  DL007-SQL-ERROR              VALUE '01'.             00423000
004240         88  DL007-MISSING-NEW-FIELDS     VALUE '02'.             00424001
004241         88  DL007-MISSING-COPY-FIELDS    VALUE '03'.             00424101
004242         88  DL007-ASGMT-NOT-OPEN         VALUE '04'.             00424205
004243         88  DL007-COMMIT-CODE-INVALID    VALUE '05'.             00424308
004244         88  DL007-CALLED-MODULE-FAILURE  VALUE '98'.             00424412
004290         88  DL007-INVALID-ACCESS         VALUE '99'.             00429000
004300     05  DL007-RETURN-SQLCODES.                                   00430000
004400         10  DL007-ASGMT-SQLCODE          PIC  S9(9).             00440000
004500             88  DL007-ASGMT-NOT-FOUND    VALUE  +100.            00450000
004600             88  DL007-ASGMT-CONTENTION   VALUES -904 -911 -913.  00460000
004700         10  DL007-FILLER                 PIC  X(32).             00470009
004710* THE FOLLOWING FIELD SHOULD CONTAIN THE ORIGINAL CALLING         00471012
004720* PROGRAM ASSOCIATED TO THE PROCESSING TO BE DONE.                00472012
004730     05  DL007-ORIG-CALLING-PGM-NM        PIC  X(08).             00473012
004800     05  DL007-FILLER                     PIC  X(17).             00480013
004900* THE FOLLOWING ARE TO CONTAIN PARAGRAPH NUMBERS ASSOCIATED TO    00490000
005000* THE ABOVE SQL RETURN CODES.                                     00500000
005200     05  DL007-SQL-ERROR-PARA             PIC  X(05).             00520013
005210     05  DL007-CALL-MOD-FAIL-NM           PIC  X(08).             00521012
005220     05  DL007-CALL-MOD-FAIL-ERR-CDE      PIC  X(02).             00522012
005300     05  DL007-FILLER                     PIC  X(10).             00530012
005400                                                                  00540000
005500     05  DL007-OUTPUT-FIELDS.                                     00550000
005600         10  DL007-NEW-START-DTE.                                 00560005
005700             15  DL007-NEW-SDTE-YYYY      PIC  X(04).             00570005
005800             15  DL007-FILLER             PIC  X(01).             00580009
005900             15  DL007-NEW-SDTE-MM        PIC  X(02).             00590005
006000             15  DL007-FILLER             PIC  X(01).             00600009
006100             15  DL007-NEW-SDTE-DD        PIC  X(02).             00610005
006200         10  DL007-NEW-NBR-TXT            PIC  X(10).             00620005
006300         10  DL007-NEW-ASGMT-NBR-SEQ-NBR  PIC S9(09)     COMP.    00630005
006310         10  DL007-ASGMT-END-TMST.                                00631005
006320             15 DL007-ASGMT-END-YYYY      PIC  X(04).             00632005
006330             15 DL007-FILLER              PIC  X(01).             00633009
006340             15 DL007-ASGMT-END-MM        PIC  X(02).             00634005
006350             15 DL007-FILLER              PIC  X(01).             00635009
006360             15 DL007-ASGMT-END-DD        PIC  X(02).             00636005
006370             15 DL007-FILLER              PIC  X(01).             00637009
006380             15 DL007-ASGMT-END-HRS       PIC  X(02).             00638005
006390             15 DL007-FILLER              PIC  X(01).             00639009
006391             15 DL007-ASGMT-END-MIN       PIC  X(02).             00639105
006392             15 DL007-FILLER              PIC  X(01).             00639209
006393             15 DL007-ASGMT-END-SEC       PIC  X(02).             00639305
006394             15 DL007-FILLER              PIC  X(07).             00639409
006400         10  DL007-FILLER                 PIC  X(51).             00640009
006700     05  DL007-FILLER                     PIC  X(81).             00670009
006800     05  DL007-SQLCA                      PIC  X(138).            00680000
006900 01  DL007-COMMAREA                       PIC  X(01).             00690000
007000 01  DL007-USER-PGM                       PIC  X(08)              00700000
007100                                          VALUE 'DLKUP003'.       00710000
