000100**************************************************************            
000200*    ******                IMPORTANT                 ******  *            
000300*   THIS IS THE COMMUNICATION AREA TO BE USED BY A CALLING   *            
000400*   PROGRAM THAT WILL USE ROUTINE DLKUT001 TO DETERMINE IF   *            
000500*   AN ASSOCIATE IS CURRENTLY ASSOCIATED WITH AN ASSIGNMENT  *            
000600*   FOR THE DLX LABOR SYSTEM.                                *            
000700*                                                            *            
000800*   WHEN THE PROGRAM CHANGES IT MUST BE COMPILED FOR         *            
000900*   BOTH BATCH AND CICS                                      *            
001000*                                                            *            
001100*   TO INVOKE THIS PROGRAM FROM A CICS EXIT YOU MUST USE THIS*            
001200*   FORMAT:                                                  *            
001300*     CALL DL003-USER-PGM USING DFHEIBLK                     *            
001400*                              DL003-COMMAREA                *            
001500*                              DL003-USER-COMMAREA           *            
001600*   IN BATCH DO THIS:                                        *            
001700*     CALL DL003-USER-PGM USING DL003-USER-COMMAREA          *            
001800*    ******                IMPORTANT                 ******  *            
001900*                                                            *            
002000*     INITIALIZE DL003-USER-COMMAREA BEFORE CALLING DLKUT001 *            
002100*                                                            *            
002200*     DL003-ACCESS-METHODD IS REQUIRED.                      *            
002300*                                                            *            
002400*     THE APPROPRIATE DL003-KEYS FIELDS ARE REQUIRED.        *            
002500*                                                            *            
002600*     REGARDING DL003-OUTPUT-FIELDS:                         *            
002700*       THE APPROPRIATE OUTPUT FIELDS WILL BE RETURNED TO    *            
002800*       THE CALLING PROGRAM BASED ON WHAT THE DLKUT001       *            
002900*       MODULE DETERMINES.                                   *            
003000*                                                            *            
003100*     NOTE: IF FIELD(S) ARE ADDED TO THIS COPYBOOK           *            
003200*           DECREMENT THE FILLER NEAR THE END OF THIS        *            
003300*           COPYBOOK SO THE TOTAL LENGTH REMAINS THE SAME    *            
003400*           AT LENGTH OF 600                                 *            
003500**************************************************************            
003600 01  DL003-ASGMT-COMMAREA.                                                
003700     05  DL003-ACCESS-METHOD              PIC  X(04).                     
003800         88  DL003-BY-USER-KEY            VALUE 'USER'.                   
003900     05  DL003-FILLER                     PIC  X(20).                     
004000     05  DL003-KEYS.                                                      
004100         10  DL003-KEY-USER-ID            PIC  X(08).                     
004200             88  DL003-NO-KEY-USER-ID     VALUE SPACES.                   
004300         10  DL003-FILLER                 PIC  X(58).                     
004400     05  DL003-RETURN-CODE                PIC  X(02).                     
004500         88  DL003-SUCCESSFUL             VALUES ZERO.                    
004600         88  DL003-SQL-ERROR              VALUE '01'.                     
004700         88  DL003-MISSING-KEY-FIELDS     VALUE '02'.                     
004800         88  DL003-CALLED-MODULE-FAILURE  VALUE '98'.                     
004900         88  DL003-INVALID-ACCESS         VALUE '99'.                     
005000     05  DL003-RETURN-SQLCODES.                                           
005100         10  DL003-ASGMT-SQLCODE          PIC  S9(9).                     
005200             88  DL003-SQL-NOT-FOUND      VALUE  +100.                    
005300             88  DL003-SQL-CONTENTION     VALUES -904 -911 -913.          
005400         10  DL003-FILLER                 PIC  X(32).                     
005500* THE FOLLOWING FIELD SHOULD CONTAIN THE ORIGINAL CALLING                 
005600* PROGRAM ASSOCIATED TO THE PROCESSING TO BE DONE.                        
005700     05  DL003-ORIG-CALLING-PGM-NM        PIC  X(08).                     
005800     05  DL003-FILLER                     PIC  X(17).                     
005900* THE FOLLOWING ARE TO CONTAIN PARAGRAPH NUMBERS ASSOCIATED TO            
006000* THE ABOVE SQL RETURN CODES.                                             
006100     05  DL003-SQL-ERROR-PARA             PIC  X(05).                     
006200     05  DL003-CALL-MOD-FAIL-NM           PIC  X(08).                     
006300     05  DL003-CALL-MOD-FAIL-ERR-CDE      PIC  X(02).                     
006400     05  DL003-FILLER                     PIC  X(10).                     
006500                                                                          
006600     05  DL003-OUTPUT-FIELDS.                                             
006700         10  DL003-ASGMT-FOUND-CODE       PIC  X(1).                      
006800             88  DL003-ASGMT-FOUND        VALUE 'Y'.                      
006900             88  DL003-ASGMT-NOT-FOUND    VALUE 'N'.                      
007000             88  DL003-ASGMT-MULT-FOUND   VALUE 'M'.                      
007100         10  DL003-ASGMT-FOUND-QTY        PIC S9(04)     COMP.            
007200         10  DL003-ASGMT-START-DTE.                                       
007300             15  DL003-ASGMT-SDTE-YYYY    PIC  X(04).                     
007400             15  DL003-FILLER             PIC  X(01).                     
007500             15  DL003-ASGMT-SDTE-MM      PIC  X(02).                     
007600             15  DL003-FILLER             PIC  X(01).                     
007700             15  DL003-ASGMT-SDTE-DD      PIC  X(02).                     
007800         10  DL003-ASGMT-NBR-TXT          PIC  X(10).                     
007900         10  DL003-ASGMT-NBR-SEQ-NBR      PIC S9(09)     COMP.            
008000         10  DL003-ASGMT-STRT-TM.                                         
008100             15  DL003-ASGMT-STM-HH       PIC  X(02).                     
008200             15  DL003-FILLER             PIC  X(01).                     
008300             15  DL003-ASGMT-STM-MM       PIC  X(02).                     
008400             15  DL003-FILLER             PIC  X(01).                     
008500             15  DL003-ASGMT-STM-SS       PIC  X(02).                     
008600         10  DL003-ASGMT-WK-TYP-DESC      PIC  X(15).                     
008700         10  DL003-ASGMT-WK-AREA-DESC     PIC  X(20).                     
008800         10  DL003-ASGMT-DC-NBR           PIC S9(04)     COMP.            
008900         10  DL003-TEM-ASGMT-SEQ-NBR      PIC S9(09)     COMP.            
009000         10  DL003-ASGMT-JOIN-TMST        PIC X(26).                      
009100*         FORMAT MM/DD/YY                                                 
009200         10  DL003-ASGMT-JOIN-DTE-RF      PIC X(08).                      
009300         10  DL003-ASGMT-JOIN-TME         PIC X(08).                      
009400         10  DL003-ASGMT-JN-BY-USR-ID     PIC  X(08).                     
009500         10  DL003-ASGMT-ACTV-USR-QTY     PIC S9(04)     COMP.            
009600             88  DL003-ASGMT-ONLY-USR     VALUE 1.                        
009700         10  DL003-USR-TYPE-CDE           PIC  X(01).                     
009800             88  DL003-USR-IS-KOHLS       VALUE 'K'.                      
009900             88  DL003-USR-IS-TMP         VALUE 'T'.                      
010000         10  DL003-FILLER                 PIC  X(51).                     
010100                                                                          
010200     05  DL003-FILLER                     PIC  X(099).                    
010300     05  DL003-SQLCA                      PIC  X(138).                    
010400 01  DL003-COMMAREA                       PIC  X(01).                     
010500 01  DL003-USER-PGM                       PIC  X(08)                      
010600                                          VALUE 'DLKUT001'.               
