000100******************************************************************00010000
000200 IDENTIFICATION DIVISION.                                         00020000
000300******************************************************************00030000
000400                                                                  00040000
000500 PROGRAM-ID.                DPKCS221.                             00050000
000600 AUTHOR.                    BRUCE BORCHARDT.                      00060000
000700 INSTALLATION.              KOHLS DEPARTMENT STORES.              00070000
000800 DATE-WRITTEN.              09-17-03.                             00080000
000900 DATE-COMPILED.                                                   00090000
001000                                                                  00100000
001100******************************************************************00110000
001200*  CICS PROGRAM - DPKCS221                                       *00120000
001300*                                                                *00130000
001400*  PLT TRANSACTION TO KICK OFF DB2 PROGS FOR CICSP8 ONLY          00140000
001500******************************************************************00150000
001600                                                                  00160000
001700******************************************************************00170000
001800 ENVIRONMENT DIVISION.                                            00180000
001900******************************************************************00190000
002000                                                                  00200000
002100******************************************************************00210000
002200 DATA DIVISION.                                                   00220000
002300******************************************************************00230000
002400                                                                  00240000
002500 WORKING-STORAGE SECTION.                                         00250000
002600 01  WS-INDICATORS.                                               00260000
002700     05 WI-PORT            PIC 9(4) VALUE 2992.                   00270000
002713******************************************************************00271300
002714 PROCEDURE DIVISION.                                              00271400
002715******************************************************************00271500
002716 0000-MAIN-LINE.                                                  00271600
002717     EXEC CICS START                                              00271700
002718               TRANSID('Z300')                                    00271800
002719               FROM(WI-PORT)                                      00271900
002720     END-EXEC.                                                    00272000
002730*    EXEC CICS START                                              00273002
002740*              TRANSID('T230')                                    00274002
002760*    END-EXEC.                                                    00276002
003300     EXEC CICS RETURN                                             00330000
003400     END-EXEC.                                                    00340000
