000001******************************************************************00000100
000002 IDENTIFICATION DIVISION.                                         00000200
000003******************************************************************00000300
000004                                                                  00000400
000005 PROGRAM-ID.                DPKCS214.                             00000500
000006 AUTHOR.                    BRUCE BORCHARDT.                      00000600
000007 INSTALLATION.              KOHLS DEPARTMENT STORES.              00000700
000008 DATE-WRITTEN.              10-15-96.                             00000800
000009 DATE-COMPILED.                                                   00000900
000010                                                                  00001000
000011******************************************************************00001100
000012*  CICS PROGRAM - DPKCS214                                       *00001200
000013*                                                                *00001300
000014*  PLT TRANSACTION TO ENABLE MESSAGE ROUTING EXIT               .*00001400
000015******************************************************************00001500
000016                                                                  00001600
000017******************************************************************00001700
000018 ENVIRONMENT DIVISION.                                            00001800
000019******************************************************************00001900
000020                                                                  00002000
000021******************************************************************00002100
000022 DATA DIVISION.                                                   00002200
000023******************************************************************00002300
000024                                                                  00002400
000025 WORKING-STORAGE SECTION.                                         00002500
000026                                                                  00002600
000027                                                                  00002700
000028******************************************************************00002800
000029 PROCEDURE DIVISION.                                              00002900
000030******************************************************************00003000
000031 0000-MAIN-LINE.                                                  00003100
000032     EXEC CICS ENABLE                                             00003200
000033          PROGRAM('DPKCS223')                                     00003300
000034          EXIT('XMEOUT')                                          00003400
000035          START                                                   00003500
000036     END-EXEC.                                                    00003600
000037     EXEC CICS ENABLE                                             00003700
000038          PROGRAM('DPKCS107')                                     00003800
000039          EXIT('XMEOUT')                                          00003900
000040          START                                                   00004000
000041     END-EXEC.                                                    00004100
000042     EXEC CICS RETURN                                             00004200
000050     END-EXEC.                                                    00005000
