000100******************************************************************00000100
000200 IDENTIFICATION DIVISION.                                         00000200
000300******************************************************************00000300
000400                                                                  00000400
000500 PROGRAM-ID.                DPKCS202.                             00000500
000600 AUTHOR.                    BRUCE BORCHARDT.                      00000600
000700 INSTALLATION.              KOHLS DEPARTMENT STORES.              00000700
000800 DATE-WRITTEN.              10-25-90.                             00000800
000900 DATE-COMPILED.                                                   00000900
001000                                                                  00001000
001100******************************************************************00001100
001200*  CICS PROGRAM - DPKCS202                                       *00001200
001300*                                                                *00001300
001400*  PLT TRANSACTION TO CANCEL OUTSTANDING START TIMER FOR S101   .*00001400
001500******************************************************************00001500
001600                                                                  00001600
001700******************************************************************00001700
001800 ENVIRONMENT DIVISION.                                            00001800
001900******************************************************************00001900
002000                                                                  00002000
002100******************************************************************00002100
002200 DATA DIVISION.                                                   00002200
002300******************************************************************00002300
002400                                                                  00002400
002500 WORKING-STORAGE SECTION.                                         00002500
002600                                                                  00002600
002700                                                                  00002700
002800******************************************************************00002800
002900 PROCEDURE DIVISION.                                              00002900
003000******************************************************************00003000
003100 0000-MAIN-LINE.                                                  00003100
003200     EXEC CICS CANCEL                                             00003200
003300               TRANSID('S101')                                    00003300
003400               REQID('XXXXS101')                                  00003400
003500     END-EXEC.                                                    00003500
003600     EXEC CICS RETURN                                             00003600
003900     END-EXEC.                                                    00003900
