000100******************************************************************00010011
000200 IDENTIFICATION DIVISION.                                         00020011
000300******************************************************************00030011
000400                                                                  00040011
000500 PROGRAM-ID.                DPKCS211.                             00050011
000600 AUTHOR.                    BRUCE BORCHARDT.                      00060011
000700 INSTALLATION.              KOHLS DEPARTMENT STORES.              00070011
000800 DATE-WRITTEN.              01-23-90.                             00080011
000900 DATE-COMPILED.                                                   00090011
001000                                                                  00100011
001100******************************************************************00110011
001200*  CICS PROGRAM - DPKCS211                                       *00120011
001300*                                                                *00130011
001400*  PLT TRANSACTION TO KICK OFF DB2 PROGS FOR CICST1 ONLY          00140011
001500******************************************************************00150011
001600                                                                  00160011
001700******************************************************************00170011
001800 ENVIRONMENT DIVISION.                                            00180011
001900******************************************************************00190011
002000                                                                  00200011
002100******************************************************************00210011
002200 DATA DIVISION.                                                   00220011
002300******************************************************************00230011
002400                                                                  00240011
002500 WORKING-STORAGE SECTION.                                         00250011
002600 01  WS-INDICATORS.                                               00260011
002700     05 WI-PORT            PIC 9(4) VALUE 2993.                   00270011
002800     05 WI-PORT2           PIC 9(4) VALUE 3993.                   00280011
002900     05 WI-PORT3           PIC 9(4) VALUE 4993.                   00290011
002910     05 WI-PORT4           PIC 9(4) VALUE 5993.                   00291011
002920     05 WI-PORT5           PIC 9(4) VALUE 7993.                   00292011
002930******************************************************************00293011
002940 PROCEDURE DIVISION.                                              00294011
002950******************************************************************00295011
002960 0000-MAIN-LINE.                                                  00296011
002970     EXEC CICS START                                              00297011
002980               TRANSID('Z300')                                    00298011
002990               FROM(WI-PORT)                                      00299011
003000     END-EXEC.                                                    00300011
003100     EXEC CICS START                                              00310011
003200               TRANSID('Z300')                                    00320011
003300               FROM(WI-PORT2)                                     00330011
003400     END-EXEC.                                                    00340011
003500     EXEC CICS START                                              00350011
003600               TRANSID('A500')                                    00360011
003700               FROM(WI-PORT3)                                     00370011
003800     END-EXEC.                                                    00380011
003900     EXEC CICS START                                              00390011
004000               TRANSID('A505')                                    00400011
004100               FROM(WI-PORT4)                                     00410011
004200     END-EXEC.                                                    00420011
004300     EXEC CICS START                                              00430011
004400               TRANSID('A519')                                    00440011
004500               FROM(WI-PORT5)                                     00450011
004510     END-EXEC.                                                    00451011
004520     EXEC CICS START                                              00452011
004530               TRANSID('S611')                                    00453011
004540     END-EXEC.                                                    00454011
004550**   EXEC CICS START                                              00455012
004560**             TRANSID('L201')                                    00456012
004570**   END-EXEC.                                                    00457012
004580     EXEC CICS START                                              00458011
004590               TRANSID('T230')                                    00459011
004600     END-EXEC.                                                    00460011
004700     EXEC CICS RETURN                                             00470011
004800     END-EXEC.                                                    00480011
