000100******************************************************************00000100
000200 IDENTIFICATION DIVISION.                                         00000200
000300******************************************************************00000300
000400                                                                  00000400
000500 PROGRAM-ID.                DPKCS204.                             00000500
000600 AUTHOR.                    BRUCE BORCHARDT.                      00000600
000700 INSTALLATION.              KOHLS DEPARTMENT STORES.              00000700
000800 DATE-WRITTEN.              01-23-90.                             00000800
000900 DATE-COMPILED.                                                   00000900
001000                                                                  00001000
001100******************************************************************00001100
001200*  CICS PROGRAM - DPKCS204                                       *00001200
001300*                                                                *00001300
001400*  PLT TRANSACTION TO ENABLE SHIPABLE TERMINAL EXITS            .*00001400
002500******************************************************************00001500
002600                                                                  00001600
002700******************************************************************00001700
002800 ENVIRONMENT DIVISION.                                            00001800
002900******************************************************************00001900
003000                                                                  00002000
003100******************************************************************00002100
003200 DATA DIVISION.                                                   00002200
003300******************************************************************00002300
003400                                                                  00002400
003500 WORKING-STORAGE SECTION.                                         00002500
003506                                                                  00002600
003607                                                                  00002700
059400******************************************************************00002800
059500 PROCEDURE DIVISION.                                              00002900
059600******************************************************************00003000
059700 0000-MAIN-LINE.                                                  00003100
059800     EXEC CICS ENABLE                                             00003200
059900          PROGRAM('DFHXTENF')                                     00003300
060000          EXIT('XALTENF')                                         00003400
060100          START                                                   00003500
060110     END-EXEC.                                                    00003600
060120     EXEC CICS ENABLE                                             00003700
060130          PROGRAM('DFHXTENF')                                     00003800
060140          EXIT('XICTENF')                                         00003900
060150          START                                                   00004000
060160     END-EXEC.                                                    00004100
060170     EXEC CICS SET STATISTICS                                     00004200
060180          INTERVAL(240000)                                        00004300
060192     END-EXEC.                                                    00004400
060210     EXEC CICS RETURN                                             00005000
060300     END-EXEC.                                                    00010000
