000100******************************************************************00010000
000200 IDENTIFICATION DIVISION.                                         00020000
000300******************************************************************00030000
000400                                                                  00040000
000500 PROGRAM-ID.                DPKCS231.                             00050000
000600 AUTHOR.                    BRUCE BORCHARDT.                      00060000
000700 INSTALLATION.              KOHLS DEPARTMENT STORES.              00070000
000800 DATE-WRITTEN.              01-23-90.                             00080000
000900 DATE-COMPILED.                                                   00090000
001000                                                                  00100000
001100******************************************************************00110000
001200*  CICS PROGRAM - DPKCS231                                       *00120000
001300*                                                                *00130000
001400*  PLT TRANSACTION TO KICK OFF DB2 PROGS FOR CICSPB ONLY          00140000
001500******************************************************************00150000
001600                                                                  00160000
001700******************************************************************00170000
001800 ENVIRONMENT DIVISION.                                            00180000
001900******************************************************************00190000
002000                                                                  00200000
002100******************************************************************00210000
002200 DATA DIVISION.                                                   00220000
002300******************************************************************00230000
002400                                                                  00240000
002500 WORKING-STORAGE SECTION.                                         00250000
002600 01  WS-INDICATORS.                                               00260000
002610     05 FILLER PIC X.                                             00261002
002700******************************************************************00270001
002710 PROCEDURE DIVISION.                                              00271002
002720******************************************************************00272002
002730 0000-MAIN-LINE.                                                  00273002
002740     EXEC CICS RETURN                                             00274002
002750     END-EXEC.                                                    00275002
