*          DATA SET DPKM017    AT LEVEL 001 AS OF 07/07/92                      
*********************************************************************** 00001   
*       MAPSET  DPKM017                                                 00002   
*       MAP     DP017A                                                  00003   
*       PROGRAM DPKCS017 - UPDATE FUNCTION KEYS                         00004   
*       TRANSID Z017                                                    00005   
*       SYSTEM  CICS ARCHITECTURE                                       00006   
*********************************************************************** 00007   
        PRINT  NOGEN                                                    00008   
DPKM017 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES,             C00009   
               CTRL=(FREEKB)                                            00010   
DP017A  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),                   C00011   
               DSATTS=(COLOR,HILIGHT)                                   00012   
ADATE   DFHMDF POS=(1,2),LENGTH=10,ATTRB=(PROT,BRT),COLOR=NEUTRAL       00013   
ATIME   DFHMDF POS=(1,14),LENGTH=8,ATTRB=(PROT,BRT),COLOR=NEUTRAL       00014   
ATITLE  DFHMDF POS=(1,25),LENGTH=30,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00015   
ANETNAM DFHMDF POS=(1,61),LENGTH=8,ATTRB=(PROT,BRT),COLOR=NEUTRAL       00016   
AMNEMIC DFHMDF POS=(1,71),LENGTH=8,ATTRB=(PROT,BRT),COLOR=NEUTRAL       00017   
*                                                                       00018   
        DFHMDF POS=(3,02),LENGTH=07,ATTRB=(ASKIP,BRT),                 C00019   
               COLOR=NEUTRAL,INITIAL='TRANID:'                          00020   
ATRANID DFHMDF POS=(3,10),LENGTH=4,ATTRB=(PROT,NORM),COLOR=BLUE         00021   
*                                                                       00022   
        DFHMDF POS=(3,17),LENGTH=09,ATTRB=(ASKIP,BRT),                 C00023   
               COLOR=NEUTRAL,INITIAL='MNEMONIC:'                        00024   
AMNOMIC DFHMDF POS=(3,27),LENGTH=8,ATTRB=(PROT,NORM),COLOR=BLUE         00025   
*                                                                       00026   
        DFHMDF POS=(3,39),LENGTH=06,ATTRB=(ASKIP,BRT),                 C00027   
               COLOR=NEUTRAL,INITIAL='TITLE:'                           00028   
ANAME   DFHMDF POS=(3,46),LENGTH=30,ATTRB=(PROT,NORM),COLOR=BLUE        00029   
*                                                                       00030   
        DFHMDF POS=(5,02),LENGTH=72,INITIAL='SELECT THE FUNCTION KEYS AC00031   
               ND ENTER THE LABEL AND ACTION DESIRED FOR EACH',        C00032   
               COLOR=NEUTRAL,ATTRB=(ASKIP,BRT)                          00033   
*                                                                       00034   
        DFHMDF POS=(7,02),LENGTH=73,INITIAL='SEL  KEY   STATUS    ACTIOC00035   
               N    DISP    LABEL      MNEMONIC   FORMAT   STK',       C00036   
               COLOR=NEUTRAL,ATTRB=(ASKIP,BRT)                          00037   
*                                                                       00038   
ASEL01  DFHMDF POS=(09,3),                                             C00039   
               LENGTH=01,                                              C00040   
               ATTRB=(UNPROT),                                         C00041   
               COLOR=GREEN,                                            C00042   
               HILIGHT=UNDERLINE                                        00043   
        DFHMDF POS=(09,05),LENGTH=1,ATTRB=(ASKIP)                       00044   
AFKEY01 DFHMDF POS=(09,07),                                            C00045   
               LENGTH=03,                                              C00046   
               ATTRB=(ASKIP),                                          C00047   
               COLOR=BLUE                                               00048   
ASTAT01 DFHMDF POS=(09,12),                                            C00049   
               LENGTH=08,                                              C00050   
               ATTRB=(ASKIP),                                          C00051   
               COLOR=BLUE                                               00052   
AACT01  DFHMDF POS=(09,22),                                            C00053   
               LENGTH=01,                                              C00054   
               ATTRB=(UNPROT),                                         C00055   
               COLOR=GREEN,                                            C00056   
               HILIGHT=UNDERLINE                                        00057   
AACTD01 DFHMDF POS=(09,24),                                            C00058   
               LENGTH=10,                                              C00059   
               ATTRB=(ASKIP),                                          C00060   
               COLOR=BLUE                                               00061   
ADISP01 DFHMDF POS=(09,35),                                            C00058   
               LENGTH=01,                                              C00059   
               ATTRB=(UNPROT),                                         C00060   
               COLOR=BLUE                                               00061   
        DFHMDF POS=(09,37),LENGTH=1,ATTRB=(ASKIP)                       00595   
ALABL01 DFHMDF POS=(09,40),                                            C00062   
               LENGTH=08,                                              C00063   
               ATTRB=(UNPROT),                                         C00064   
               COLOR=GREEN,                                            C00065   
               HILIGHT=UNDERLINE                                        00066   
        DFHMDF POS=(09,49),LENGTH=1,ATTRB=(ASKIP)                       00067   
AMNEM01 DFHMDF POS=(09,52),                                            C00068   
               LENGTH=08,                                              C00069   
               ATTRB=(UNPROT),                                         C00070   
               COLOR=GREEN,                                            C00071   
               HILIGHT=UNDERLINE                                        00072   
        DFHMDF POS=(09,61),LENGTH=1,ATTRB=(ASKIP)                       00073   
AFRMT01 DFHMDF POS=(09,66),                                            C00074   
               LENGTH=01,                                              C00075   
               ATTRB=(UNPROT),                                         C00076   
               COLOR=GREEN,                                            C00077   
               HILIGHT=UNDERLINE                                        00078   
        DFHMDF POS=(09,68),LENGTH=1,ATTRB=(ASKIP)                       00079   
ASTK01  DFHMDF POS=(09,74),                                            C00080   
               LENGTH=01,                                              C00081   
               ATTRB=(UNPROT),                                         C00082   
               COLOR=GREEN,                                            C00083   
               HILIGHT=UNDERLINE                                        00084   
        DFHMDF POS=(09,76),LENGTH=1,ATTRB=(ASKIP)                       00085   
*                                                                       00086   
ASEL02  DFHMDF POS=(10,3),                                             C00087   
               LENGTH=01,                                              C00088   
               ATTRB=(UNPROT),                                         C00089   
               COLOR=GREEN,                                            C00090   
               HILIGHT=UNDERLINE                                        00091   
        DFHMDF POS=(10,05),LENGTH=1,ATTRB=(ASKIP)                       00092   
AFKEY02 DFHMDF POS=(10,07),                                            C00093   
               LENGTH=03,                                              C00094   
               ATTRB=(ASKIP),                                          C00095   
               COLOR=BLUE                                               00096   
ASTAT02 DFHMDF POS=(10,12),                                            C00097   
               LENGTH=08,                                              C00098   
               ATTRB=(ASKIP),                                          C00099   
               COLOR=BLUE                                               00100   
AACT02  DFHMDF POS=(10,22),                                            C00101   
               LENGTH=01,                                              C00102   
               ATTRB=(UNPROT),                                         C00103   
               COLOR=GREEN,                                            C00104   
               HILIGHT=UNDERLINE                                        00105   
AACTD02 DFHMDF POS=(10,24),                                            C00106   
               LENGTH=10,                                              C00107   
               ATTRB=(ASKIP),                                          C00108   
               COLOR=BLUE                                               00109   
ADISP02 DFHMDF POS=(10,35),                                            C00058   
               LENGTH=01,                                              C00059   
               ATTRB=(UNPROT),                                         C00060   
               COLOR=BLUE                                               00061   
        DFHMDF POS=(10,37),LENGTH=1,ATTRB=(ASKIP)                       00595   
ALABL02 DFHMDF POS=(10,40),                                            C00110   
               LENGTH=08,                                              C00111   
               ATTRB=(UNPROT),                                         C00112   
               COLOR=GREEN,                                            C00113   
               HILIGHT=UNDERLINE                                        00114   
        DFHMDF POS=(10,49),LENGTH=1,ATTRB=(ASKIP)                       00115   
AMNEM02 DFHMDF POS=(10,52),                                            C00116   
               LENGTH=08,                                              C00117   
               ATTRB=(UNPROT),                                         C00118   
               COLOR=GREEN,                                            C00119   
               HILIGHT=UNDERLINE                                        00120   
        DFHMDF POS=(10,61),LENGTH=1,ATTRB=(ASKIP)                       00121   
AFRMT02 DFHMDF POS=(10,66),                                            C00122   
               LENGTH=01,                                              C00123   
               ATTRB=(UNPROT),                                         C00124   
               COLOR=GREEN,                                            C00125   
               HILIGHT=UNDERLINE                                        00126   
        DFHMDF POS=(10,68),LENGTH=1,ATTRB=(ASKIP)                       00127   
ASTK02  DFHMDF POS=(10,74),                                            C00128   
               LENGTH=01,                                              C00129   
               ATTRB=(UNPROT),                                         C00130   
               COLOR=GREEN,                                            C00131   
               HILIGHT=UNDERLINE                                        00132   
        DFHMDF POS=(10,76),LENGTH=1,ATTRB=(ASKIP)                       00133   
*                                                                       00134   
ASEL03  DFHMDF POS=(11,3),                                             C00135   
               LENGTH=01,                                              C00136   
               ATTRB=(UNPROT),                                         C00137   
               COLOR=GREEN,                                            C00138   
               HILIGHT=UNDERLINE                                        00139   
        DFHMDF POS=(11,05),LENGTH=1,ATTRB=(ASKIP)                       00140   
AFKEY03 DFHMDF POS=(11,07),                                            C00141   
               LENGTH=03,                                              C00142   
               ATTRB=(ASKIP),                                          C00143   
               COLOR=BLUE                                               00144   
ASTAT03 DFHMDF POS=(11,12),                                            C00145   
               LENGTH=08,                                              C00146   
               ATTRB=(ASKIP),                                          C00147   
               COLOR=BLUE                                               00148   
AACT03  DFHMDF POS=(11,22),                                            C00149   
               LENGTH=01,                                              C00150   
               ATTRB=(UNPROT),                                         C00151   
               COLOR=GREEN,                                            C00152   
               HILIGHT=UNDERLINE                                        00153   
AACTD03 DFHMDF POS=(11,24),                                            C00154   
               LENGTH=10,                                              C00155   
               ATTRB=(ASKIP),                                          C00156   
               COLOR=BLUE                                               00157   
ADISP03 DFHMDF POS=(11,35),                                            C00058   
               LENGTH=01,                                              C00059   
               ATTRB=(UNPROT),                                         C00060   
               COLOR=BLUE                                               00061   
        DFHMDF POS=(11,37),LENGTH=1,ATTRB=(ASKIP)                       00595   
ALABL03 DFHMDF POS=(11,40),                                            C00158   
               LENGTH=08,                                              C00159   
               ATTRB=(UNPROT),                                         C00160   
               COLOR=GREEN,                                            C00161   
               HILIGHT=UNDERLINE                                        00162   
        DFHMDF POS=(11,49),LENGTH=1,ATTRB=(ASKIP)                       00163   
AMNEM03 DFHMDF POS=(11,52),                                            C00164   
               LENGTH=08,                                              C00165   
               ATTRB=(UNPROT),                                         C00166   
               COLOR=GREEN,                                            C00167   
               HILIGHT=UNDERLINE                                        00168   
        DFHMDF POS=(11,61),LENGTH=1,ATTRB=(ASKIP)                       00169   
AFRMT03 DFHMDF POS=(11,66),                                            C00170   
               LENGTH=01,                                              C00171   
               ATTRB=(UNPROT),                                         C00172   
               COLOR=GREEN,                                            C00173   
               HILIGHT=UNDERLINE                                        00174   
        DFHMDF POS=(11,68),LENGTH=1,ATTRB=(ASKIP)                       00175   
ASTK03  DFHMDF POS=(11,74),                                            C00176   
               LENGTH=01,                                              C00177   
               ATTRB=(UNPROT),                                         C00178   
               COLOR=GREEN,                                            C00179   
               HILIGHT=UNDERLINE                                        00180   
        DFHMDF POS=(11,76),LENGTH=1,ATTRB=(ASKIP)                       00181   
*                                                                       00182   
ASEL04  DFHMDF POS=(12,3),                                             C00183   
               LENGTH=01,                                              C00184   
               ATTRB=(UNPROT),                                         C00185   
               COLOR=GREEN,                                            C00186   
               HILIGHT=UNDERLINE                                        00187   
        DFHMDF POS=(12,05),LENGTH=1,ATTRB=(ASKIP)                       00188   
AFKEY04 DFHMDF POS=(12,07),                                            C00189   
               LENGTH=03,                                              C00190   
               ATTRB=(ASKIP),                                          C00191   
               COLOR=BLUE                                               00192   
ASTAT04 DFHMDF POS=(12,12),                                            C00193   
               LENGTH=08,                                              C00194   
               ATTRB=(ASKIP),                                          C00195   
               COLOR=BLUE                                               00196   
AACT04  DFHMDF POS=(12,22),                                            C00197   
               LENGTH=01,                                              C00198   
               ATTRB=(UNPROT),                                         C00199   
               COLOR=GREEN,                                            C00200   
               HILIGHT=UNDERLINE                                        00201   
AACTD04 DFHMDF POS=(12,24),                                            C00202   
               LENGTH=10,                                              C00203   
               ATTRB=(ASKIP),                                          C00204   
               COLOR=BLUE                                               00205   
ADISP04 DFHMDF POS=(12,35),                                            C00058   
               LENGTH=01,                                              C00059   
               ATTRB=(UNPROT),                                         C00060   
               COLOR=BLUE                                               00061   
        DFHMDF POS=(12,37),LENGTH=1,ATTRB=(ASKIP)                       00595   
ALABL04 DFHMDF POS=(12,40),                                            C00206   
               LENGTH=08,                                              C00207   
               ATTRB=(UNPROT),                                         C00208   
               COLOR=GREEN,                                            C00209   
               HILIGHT=UNDERLINE                                        00210   
        DFHMDF POS=(12,49),LENGTH=1,ATTRB=(ASKIP)                       00211   
AMNEM04 DFHMDF POS=(12,52),                                            C00212   
               LENGTH=08,                                              C00213   
               ATTRB=(UNPROT),                                         C00214   
               COLOR=GREEN,                                            C00215   
               HILIGHT=UNDERLINE                                        00216   
        DFHMDF POS=(12,61),LENGTH=1,ATTRB=(ASKIP)                       00217   
AFRMT04 DFHMDF POS=(12,66),                                            C00218   
               LENGTH=01,                                              C00219   
               ATTRB=(UNPROT),                                         C00220   
               COLOR=GREEN,                                            C00221   
               HILIGHT=UNDERLINE                                        00222   
        DFHMDF POS=(12,68),LENGTH=1,ATTRB=(ASKIP)                       00223   
ASTK04  DFHMDF POS=(12,74),                                            C00224   
               LENGTH=01,                                              C00225   
               ATTRB=(UNPROT),                                         C00226   
               COLOR=GREEN,                                            C00227   
               HILIGHT=UNDERLINE                                        00228   
        DFHMDF POS=(12,76),LENGTH=1,ATTRB=(ASKIP)                       00229   
*                                                                       00230   
ASEL05  DFHMDF POS=(13,3),                                             C00231   
               LENGTH=01,                                              C00232   
               ATTRB=(UNPROT),                                         C00233   
               COLOR=GREEN,                                            C00234   
               HILIGHT=UNDERLINE                                        00235   
        DFHMDF POS=(13,05),LENGTH=1,ATTRB=(ASKIP)                       00236   
AFKEY05 DFHMDF POS=(13,07),                                            C00237   
               LENGTH=03,                                              C00238   
               ATTRB=(ASKIP),                                          C00239   
               COLOR=BLUE                                               00240   
ASTAT05 DFHMDF POS=(13,12),                                            C00241   
               LENGTH=08,                                              C00242   
               ATTRB=(ASKIP),                                          C00243   
               COLOR=BLUE                                               00244   
AACT05  DFHMDF POS=(13,22),                                            C00245   
               LENGTH=01,                                              C00246   
               ATTRB=(UNPROT),                                         C00247   
               COLOR=GREEN,                                            C00248   
               HILIGHT=UNDERLINE                                        00249   
AACTD05 DFHMDF POS=(13,24),                                            C00250   
               LENGTH=10,                                              C00251   
               ATTRB=(ASKIP),                                          C00252   
               COLOR=BLUE                                               00253   
ADISP05 DFHMDF POS=(13,35),                                            C00058   
               LENGTH=01,                                              C00059   
               ATTRB=(UNPROT),                                         C00060   
               COLOR=BLUE                                               00061   
        DFHMDF POS=(13,37),LENGTH=1,ATTRB=(ASKIP)                       00595   
ALABL05 DFHMDF POS=(13,40),                                            C00254   
               LENGTH=08,                                              C00255   
               ATTRB=(UNPROT),                                         C00256   
               COLOR=GREEN,                                            C00257   
               HILIGHT=UNDERLINE                                        00258   
        DFHMDF POS=(13,49),LENGTH=1,ATTRB=(ASKIP)                       00259   
AMNEM05 DFHMDF POS=(13,52),                                            C00260   
               LENGTH=08,                                              C00261   
               ATTRB=(UNPROT),                                         C00262   
               COLOR=GREEN,                                            C00263   
               HILIGHT=UNDERLINE                                        00264   
        DFHMDF POS=(13,61),LENGTH=1,ATTRB=(ASKIP)                       00265   
AFRMT05 DFHMDF POS=(13,66),                                            C00266   
               LENGTH=01,                                              C00267   
               ATTRB=(UNPROT),                                         C00268   
               COLOR=GREEN,                                            C00269   
               HILIGHT=UNDERLINE                                        00270   
        DFHMDF POS=(13,68),LENGTH=1,ATTRB=(ASKIP)                       00271   
ASTK05  DFHMDF POS=(13,74),                                            C00272   
               LENGTH=01,                                              C00273   
               ATTRB=(UNPROT),                                         C00274   
               COLOR=GREEN,                                            C00275   
               HILIGHT=UNDERLINE                                        00276   
        DFHMDF POS=(13,76),LENGTH=1,ATTRB=(ASKIP)                       00277   
*                                                                       00278   
ASEL06  DFHMDF POS=(14,3),                                             C00279   
               LENGTH=01,                                              C00280   
               ATTRB=(UNPROT),                                         C00281   
               COLOR=GREEN,                                            C00282   
               HILIGHT=UNDERLINE                                        00283   
        DFHMDF POS=(14,05),LENGTH=1,ATTRB=(ASKIP)                       00284   
AFKEY06 DFHMDF POS=(14,07),                                            C00285   
               LENGTH=03,                                              C00286   
               ATTRB=(ASKIP),                                          C00287   
               COLOR=BLUE                                               00288   
ASTAT06 DFHMDF POS=(14,12),                                            C00289   
               LENGTH=08,                                              C00290   
               ATTRB=(ASKIP),                                          C00291   
               COLOR=BLUE                                               00292   
AACT06  DFHMDF POS=(14,22),                                            C00293   
               LENGTH=01,                                              C00294   
               ATTRB=(UNPROT),                                         C00295   
               COLOR=GREEN,                                            C00296   
               HILIGHT=UNDERLINE                                        00297   
AACTD06 DFHMDF POS=(14,24),                                            C00298   
               LENGTH=10,                                              C00299   
               ATTRB=(ASKIP),                                          C00300   
               COLOR=BLUE                                               00301   
ADISP06 DFHMDF POS=(14,35),                                            C00058   
               LENGTH=01,                                              C00059   
               ATTRB=(UNPROT),                                         C00060   
               COLOR=BLUE                                               00061   
        DFHMDF POS=(14,37),LENGTH=1,ATTRB=(ASKIP)                       00595   
ALABL06 DFHMDF POS=(14,40),                                            C00302   
               LENGTH=08,                                              C00303   
               ATTRB=(UNPROT),                                         C00304   
               COLOR=GREEN,                                            C00305   
               HILIGHT=UNDERLINE                                        00306   
        DFHMDF POS=(14,49),LENGTH=1,ATTRB=(ASKIP)                       00307   
AMNEM06 DFHMDF POS=(14,52),                                            C00308   
               LENGTH=08,                                              C00309   
               ATTRB=(UNPROT),                                         C00310   
               COLOR=GREEN,                                            C00311   
               HILIGHT=UNDERLINE                                        00312   
        DFHMDF POS=(14,61),LENGTH=1,ATTRB=(ASKIP)                       00313   
AFRMT06 DFHMDF POS=(14,66),                                            C00314   
               LENGTH=01,                                              C00315   
               ATTRB=(UNPROT),                                         C00316   
               COLOR=GREEN,                                            C00317   
               HILIGHT=UNDERLINE                                        00318   
        DFHMDF POS=(14,68),LENGTH=1,ATTRB=(ASKIP)                       00319   
ASTK06  DFHMDF POS=(14,74),                                            C00320   
               LENGTH=01,                                              C00321   
               ATTRB=(UNPROT),                                         C00322   
               COLOR=GREEN,                                            C00323   
               HILIGHT=UNDERLINE                                        00324   
        DFHMDF POS=(14,76),LENGTH=1,ATTRB=(ASKIP)                       00325   
*                                                                       00326   
ASEL07  DFHMDF POS=(15,3),                                             C00327   
               LENGTH=01,                                              C00328   
               ATTRB=(UNPROT),                                         C00329   
               COLOR=GREEN,                                            C00330   
               HILIGHT=UNDERLINE                                        00331   
        DFHMDF POS=(15,05),LENGTH=1,ATTRB=(ASKIP)                       00332   
AFKEY07 DFHMDF POS=(15,07),                                            C00333   
               LENGTH=03,                                              C00334   
               ATTRB=(ASKIP),                                          C00335   
               COLOR=BLUE                                               00336   
ASTAT07 DFHMDF POS=(15,12),                                            C00337   
               LENGTH=08,                                              C00338   
               ATTRB=(ASKIP),                                          C00339   
               COLOR=BLUE                                               00340   
AACT07  DFHMDF POS=(15,22),                                            C00341   
               LENGTH=01,                                              C00342   
               ATTRB=(UNPROT),                                         C00343   
               COLOR=GREEN,                                            C00344   
               HILIGHT=UNDERLINE                                        00345   
AACTD07 DFHMDF POS=(15,24),                                            C00346   
               LENGTH=10,                                              C00347   
               ATTRB=(ASKIP),                                          C00348   
               COLOR=BLUE                                               00349   
ADISP07 DFHMDF POS=(15,35),                                            C00058   
               LENGTH=01,                                              C00059   
               ATTRB=(UNPROT),                                         C00060   
               COLOR=BLUE                                               00061   
        DFHMDF POS=(15,37),LENGTH=1,ATTRB=(ASKIP)                       00595   
ALABL07 DFHMDF POS=(15,40),                                            C00350   
               LENGTH=08,                                              C00351   
               ATTRB=(UNPROT),                                         C00352   
               COLOR=GREEN,                                            C00353   
               HILIGHT=UNDERLINE                                        00354   
        DFHMDF POS=(15,49),LENGTH=1,ATTRB=(ASKIP)                       00355   
AMNEM07 DFHMDF POS=(15,52),                                            C00356   
               LENGTH=08,                                              C00357   
               ATTRB=(UNPROT),                                         C00358   
               COLOR=GREEN,                                            C00359   
               HILIGHT=UNDERLINE                                        00360   
        DFHMDF POS=(15,61),LENGTH=1,ATTRB=(ASKIP)                       00361   
AFRMT07 DFHMDF POS=(15,66),                                            C00362   
               LENGTH=01,                                              C00363   
               ATTRB=(UNPROT),                                         C00364   
               COLOR=GREEN,                                            C00365   
               HILIGHT=UNDERLINE                                        00366   
        DFHMDF POS=(15,68),LENGTH=1,ATTRB=(ASKIP)                       00367   
ASTK07  DFHMDF POS=(15,74),                                            C00368   
               LENGTH=01,                                              C00369   
               ATTRB=(UNPROT),                                         C00370   
               COLOR=GREEN,                                            C00371   
               HILIGHT=UNDERLINE                                        00372   
        DFHMDF POS=(15,76),LENGTH=1,ATTRB=(ASKIP)                       00373   
*                                                                       00374   
ASEL08  DFHMDF POS=(16,3),                                             C00375   
               LENGTH=01,                                              C00376   
               ATTRB=(UNPROT),                                         C00377   
               COLOR=GREEN,                                            C00378   
               HILIGHT=UNDERLINE                                        00379   
        DFHMDF POS=(16,05),LENGTH=1,ATTRB=(ASKIP)                       00380   
AFKEY08 DFHMDF POS=(16,07),                                            C00381   
               LENGTH=03,                                              C00382   
               ATTRB=(ASKIP),                                          C00383   
               COLOR=BLUE                                               00384   
ASTAT08 DFHMDF POS=(16,12),                                            C00385   
               LENGTH=08,                                              C00386   
               ATTRB=(ASKIP),                                          C00387   
               COLOR=BLUE                                               00388   
AACT08  DFHMDF POS=(16,22),                                            C00389   
               LENGTH=01,                                              C00390   
               ATTRB=(UNPROT),                                         C00391   
               COLOR=GREEN,                                            C00392   
               HILIGHT=UNDERLINE                                        00393   
AACTD08 DFHMDF POS=(16,24),                                            C00394   
               LENGTH=10,                                              C00395   
               ATTRB=(ASKIP),                                          C00396   
               COLOR=BLUE                                               00397   
ADISP08 DFHMDF POS=(16,35),                                            C00058   
               LENGTH=01,                                              C00059   
               ATTRB=(UNPROT),                                         C00060   
               COLOR=BLUE                                               00061   
        DFHMDF POS=(16,37),LENGTH=1,ATTRB=(ASKIP)                       00595   
ALABL08 DFHMDF POS=(16,40),                                            C00398   
               LENGTH=08,                                              C00399   
               ATTRB=(UNPROT),                                         C00400   
               COLOR=GREEN,                                            C00401   
               HILIGHT=UNDERLINE                                        00402   
        DFHMDF POS=(16,49),LENGTH=1,ATTRB=(ASKIP)                       00403   
AMNEM08 DFHMDF POS=(16,52),                                            C00404   
               LENGTH=08,                                              C00405   
               ATTRB=(UNPROT),                                         C00406   
               COLOR=GREEN,                                            C00407   
               HILIGHT=UNDERLINE                                        00408   
        DFHMDF POS=(16,61),LENGTH=1,ATTRB=(ASKIP)                       00409   
AFRMT08 DFHMDF POS=(16,66),                                            C00410   
               LENGTH=01,                                              C00411   
               ATTRB=(UNPROT),                                         C00412   
               COLOR=GREEN,                                            C00413   
               HILIGHT=UNDERLINE                                        00414   
        DFHMDF POS=(16,68),LENGTH=1,ATTRB=(ASKIP)                       00415   
ASTK08  DFHMDF POS=(16,74),                                            C00416   
               LENGTH=01,                                              C00417   
               ATTRB=(UNPROT),                                         C00418   
               COLOR=GREEN,                                            C00419   
               HILIGHT=UNDERLINE                                        00420   
        DFHMDF POS=(16,76),LENGTH=1,ATTRB=(ASKIP)                       00421   
*                                                                       00422   
ASEL09  DFHMDF POS=(17,3),                                             C00423   
               LENGTH=01,                                              C00424   
               ATTRB=(UNPROT),                                         C00425   
               COLOR=GREEN,                                            C00426   
               HILIGHT=UNDERLINE                                        00427   
        DFHMDF POS=(17,05),LENGTH=1,ATTRB=(ASKIP)                       00428   
AFKEY09 DFHMDF POS=(17,07),                                            C00429   
               LENGTH=03,                                              C00430   
               ATTRB=(ASKIP),                                          C00431   
               COLOR=BLUE                                               00432   
ASTAT09 DFHMDF POS=(17,12),                                            C00433   
               LENGTH=08,                                              C00434   
               ATTRB=(ASKIP),                                          C00435   
               COLOR=BLUE                                               00436   
AACT09  DFHMDF POS=(17,22),                                            C00437   
               LENGTH=01,                                              C00438   
               ATTRB=(UNPROT),                                         C00439   
               COLOR=GREEN,                                            C00440   
               HILIGHT=UNDERLINE                                        00441   
AACTD09 DFHMDF POS=(17,24),                                            C00442   
               LENGTH=10,                                              C00443   
               ATTRB=(ASKIP),                                          C00444   
               COLOR=BLUE                                               00445   
ADISP09 DFHMDF POS=(17,35),                                            C00058   
               LENGTH=01,                                              C00059   
               ATTRB=(UNPROT),                                         C00060   
               COLOR=BLUE                                               00061   
        DFHMDF POS=(17,37),LENGTH=1,ATTRB=(ASKIP)                       00595   
ALABL09 DFHMDF POS=(17,40),                                            C00446   
               LENGTH=08,                                              C00447   
               ATTRB=(UNPROT),                                         C00448   
               COLOR=GREEN,                                            C00449   
               HILIGHT=UNDERLINE                                        00450   
        DFHMDF POS=(17,49),LENGTH=1,ATTRB=(ASKIP)                       00451   
AMNEM09 DFHMDF POS=(17,52),                                            C00452   
               LENGTH=08,                                              C00453   
               ATTRB=(UNPROT),                                         C00454   
               COLOR=GREEN,                                            C00455   
               HILIGHT=UNDERLINE                                        00456   
        DFHMDF POS=(17,61),LENGTH=1,ATTRB=(ASKIP)                       00457   
AFRMT09 DFHMDF POS=(17,66),                                            C00458   
               LENGTH=01,                                              C00459   
               ATTRB=(UNPROT),                                         C00460   
               COLOR=GREEN,                                            C00461   
               HILIGHT=UNDERLINE                                        00462   
        DFHMDF POS=(17,68),LENGTH=1,ATTRB=(ASKIP)                       00463   
ASTK09  DFHMDF POS=(17,74),                                            C00464   
               LENGTH=01,                                              C00465   
               ATTRB=(UNPROT),                                         C00466   
               COLOR=GREEN,                                            C00467   
               HILIGHT=UNDERLINE                                        00468   
        DFHMDF POS=(17,76),LENGTH=1,ATTRB=(ASKIP)                       00469   
*                                                                       00470   
ASEL10  DFHMDF POS=(18,3),                                             C00471   
               LENGTH=01,                                              C00472   
               ATTRB=(UNPROT),                                         C00473   
               COLOR=GREEN,                                            C00474   
               HILIGHT=UNDERLINE                                        00475   
        DFHMDF POS=(18,05),LENGTH=1,ATTRB=(ASKIP)                       00476   
AFKEY10 DFHMDF POS=(18,07),                                            C00477   
               LENGTH=03,                                              C00478   
               ATTRB=(ASKIP),                                          C00479   
               COLOR=BLUE                                               00480   
ASTAT10 DFHMDF POS=(18,12),                                            C00481   
               LENGTH=08,                                              C00482   
               ATTRB=(ASKIP),                                          C00483   
               COLOR=BLUE                                               00484   
AACT10  DFHMDF POS=(18,22),                                            C00485   
               LENGTH=01,                                              C00486   
               ATTRB=(UNPROT),                                         C00487   
               COLOR=GREEN,                                            C00488   
               HILIGHT=UNDERLINE                                        00489   
AACTD10 DFHMDF POS=(18,24),                                            C00490   
               LENGTH=10,                                              C00491   
               ATTRB=(ASKIP),                                          C00492   
               COLOR=BLUE                                               00493   
ADISP10 DFHMDF POS=(18,35),                                            C00058   
               LENGTH=01,                                              C00059   
               ATTRB=(UNPROT),                                         C00060   
               COLOR=BLUE                                               00061   
        DFHMDF POS=(18,37),LENGTH=1,ATTRB=(ASKIP)                       00595   
ALABL10 DFHMDF POS=(18,40),                                            C00494   
               LENGTH=08,                                              C00495   
               ATTRB=(UNPROT),                                         C00496   
               COLOR=GREEN,                                            C00497   
               HILIGHT=UNDERLINE                                        00498   
        DFHMDF POS=(18,49),LENGTH=1,ATTRB=(ASKIP)                       00499   
AMNEM10 DFHMDF POS=(18,52),                                            C00500   
               LENGTH=08,                                              C00501   
               ATTRB=(UNPROT),                                         C00502   
               COLOR=GREEN,                                            C00503   
               HILIGHT=UNDERLINE                                        00504   
        DFHMDF POS=(18,61),LENGTH=1,ATTRB=(ASKIP)                       00505   
AFRMT10 DFHMDF POS=(18,66),                                            C00506   
               LENGTH=01,                                              C00507   
               ATTRB=(UNPROT),                                         C00508   
               COLOR=GREEN,                                            C00509   
               HILIGHT=UNDERLINE                                        00510   
        DFHMDF POS=(18,68),LENGTH=1,ATTRB=(ASKIP)                       00511   
ASTK10  DFHMDF POS=(18,74),                                            C00512   
               LENGTH=01,                                              C00513   
               ATTRB=(UNPROT),                                         C00514   
               COLOR=GREEN,                                            C00515   
               HILIGHT=UNDERLINE                                        00516   
        DFHMDF POS=(18,76),LENGTH=1,ATTRB=(ASKIP)                       00517   
*                                                                       00518   
ASEL11  DFHMDF POS=(19,3),                                             C00519   
               LENGTH=01,                                              C00520   
               ATTRB=(UNPROT),                                         C00521   
               COLOR=GREEN,                                            C00522   
               HILIGHT=UNDERLINE                                        00523   
        DFHMDF POS=(19,05),LENGTH=1,ATTRB=(ASKIP)                       00524   
AFKEY11 DFHMDF POS=(19,07),                                            C00525   
               LENGTH=03,                                              C00526   
               ATTRB=(ASKIP),                                          C00527   
               COLOR=BLUE                                               00528   
ASTAT11 DFHMDF POS=(19,12),                                            C00529   
               LENGTH=08,                                              C00530   
               ATTRB=(ASKIP),                                          C00531   
               COLOR=BLUE                                               00532   
AACT11  DFHMDF POS=(19,22),                                            C00533   
               LENGTH=01,                                              C00534   
               ATTRB=(UNPROT),                                         C00535   
               COLOR=GREEN,                                            C00536   
               HILIGHT=UNDERLINE                                        00537   
AACTD11 DFHMDF POS=(19,24),                                            C00538   
               LENGTH=10,                                              C00539   
               ATTRB=(ASKIP),                                          C00540   
               COLOR=BLUE                                               00541   
ADISP11 DFHMDF POS=(19,35),                                            C00058   
               LENGTH=01,                                              C00059   
               ATTRB=(UNPROT),                                         C00060   
               COLOR=BLUE                                               00061   
        DFHMDF POS=(19,37),LENGTH=1,ATTRB=(ASKIP)                       00595   
ALABL11 DFHMDF POS=(19,40),                                            C00542   
               LENGTH=08,                                              C00543   
               ATTRB=(UNPROT),                                         C00544   
               COLOR=GREEN,                                            C00545   
               HILIGHT=UNDERLINE                                        00546   
        DFHMDF POS=(19,49),LENGTH=1,ATTRB=(ASKIP)                       00547   
AMNEM11 DFHMDF POS=(19,52),                                            C00548   
               LENGTH=08,                                              C00549   
               ATTRB=(UNPROT),                                         C00550   
               COLOR=GREEN,                                            C00551   
               HILIGHT=UNDERLINE                                        00552   
        DFHMDF POS=(19,61),LENGTH=1,ATTRB=(ASKIP)                       00553   
AFRMT11 DFHMDF POS=(19,66),                                            C00554   
               LENGTH=01,                                              C00555   
               ATTRB=(UNPROT),                                         C00556   
               COLOR=GREEN,                                            C00557   
               HILIGHT=UNDERLINE                                        00558   
        DFHMDF POS=(19,68),LENGTH=1,ATTRB=(ASKIP)                       00559   
ASTK11  DFHMDF POS=(19,74),                                            C00560   
               LENGTH=01,                                              C00561   
               ATTRB=(UNPROT),                                         C00562   
               COLOR=GREEN,                                            C00563   
               HILIGHT=UNDERLINE                                        00564   
        DFHMDF POS=(19,76),LENGTH=1,ATTRB=(ASKIP)                       00565   
*                                                                       00566   
ASEL12  DFHMDF POS=(20,3),                                             C00567   
               LENGTH=01,                                              C00568   
               ATTRB=(UNPROT),                                         C00569   
               COLOR=GREEN,                                            C00570   
               HILIGHT=UNDERLINE                                        00571   
        DFHMDF POS=(20,05),LENGTH=1,ATTRB=(ASKIP)                       00572   
AFKEY12 DFHMDF POS=(20,07),                                            C00573   
               LENGTH=03,                                              C00574   
               ATTRB=(ASKIP),                                          C00575   
               COLOR=BLUE                                               00576   
ASTAT12 DFHMDF POS=(20,12),                                            C00577   
               LENGTH=08,                                              C00578   
               ATTRB=(ASKIP),                                          C00579   
               COLOR=BLUE                                               00580   
AACT12  DFHMDF POS=(20,22),                                            C00581   
               LENGTH=01,                                              C00582   
               ATTRB=(UNPROT),                                         C00583   
               COLOR=GREEN,                                            C00584   
               HILIGHT=UNDERLINE                                        00585   
AACTD12 DFHMDF POS=(20,24),                                            C00586   
               LENGTH=10,                                              C00587   
               ATTRB=(ASKIP),                                          C00588   
               COLOR=BLUE                                               00589   
ADISP12 DFHMDF POS=(20,35),                                            C00058   
               LENGTH=01,                                              C00059   
               ATTRB=(UNPROT),                                         C00060   
               COLOR=BLUE                                               00061   
        DFHMDF POS=(20,37),LENGTH=1,ATTRB=(ASKIP)                       00595   
ALABL12 DFHMDF POS=(20,40),                                            C00590   
               LENGTH=08,                                              C00591   
               ATTRB=(UNPROT),                                         C00592   
               COLOR=GREEN,                                            C00593   
               HILIGHT=UNDERLINE                                        00594   
        DFHMDF POS=(20,49),LENGTH=1,ATTRB=(ASKIP)                       00595   
AMNEM12 DFHMDF POS=(20,52),                                            C00596   
               LENGTH=08,                                              C00597   
               ATTRB=(UNPROT),                                         C00598   
               COLOR=GREEN,                                            C00599   
               HILIGHT=UNDERLINE                                        00600   
        DFHMDF POS=(20,61),LENGTH=1,ATTRB=(ASKIP)                       00601   
AFRMT12 DFHMDF POS=(20,66),                                            C00602   
               LENGTH=01,                                              C00603   
               ATTRB=(UNPROT),                                         C00604   
               COLOR=GREEN,                                            C00605   
               HILIGHT=UNDERLINE                                        00606   
        DFHMDF POS=(20,68),LENGTH=1,ATTRB=(ASKIP)                       00607   
ASTK12  DFHMDF POS=(20,74),                                            C00608   
               LENGTH=01,                                              C00609   
               ATTRB=(UNPROT),                                         C00610   
               COLOR=GREEN,                                            C00611   
               HILIGHT=UNDERLINE                                        00612   
        DFHMDF POS=(20,76),LENGTH=1,ATTRB=(ASKIP)                       00613   
*                                                                       00614   
AMSG    DFHMDF POS=(21,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=RED          00615   
        DFHMDF POS=(22,1),LENGTH=11,INITIAL='COMMAND===>',             C00616   
               ATTRB=(PROT,BRT)                                         00617   
ANAVCMD DFHMDF POS=(22,13),LENGTH=8,ATTRB=(UNPROT),                    C00618   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00619   
        DFHMDF POS=(22,22),LENGTH=1,ATTRB=(ASKIP)                       00620   
        DFHMDF POS=(22,24),LENGTH=7,INITIAL='KEY===>',ATTRB=(PROT,BRT)  00621   
ANAVKEY DFHMDF POS=(22,32),LENGTH=25,ATTRB=(UNPROT),                   C00622   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00623   
        DFHMDF POS=(22,58),LENGTH=1,ATTRB=(ASKIP)                       00624   
        DFHMDF POS=(22,63),LENGTH=16,INITIAL='PA2=OTHER FKEYS',        C00625   
               ATTRB=(PROT,BRT)                                         00626   
AFKLIN1 DFHMDF POS=(23,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00627   
AFKLIN2 DFHMDF POS=(24,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00628   
        DFHMSD TYPE=FINAL                                               00629   
        END                                                             00630   
