*          DATA SET DPKM007    AT LEVEL 001 AS OF 07/07/92                      
***********************************************************************         
*       THIS IS THE MAPSET FOR THE COMMON MENU SCREEN IN THE NEW                
*  CICS ARCHITECTURE (DPKCS007 - Z007).                                         
*                                                                               
*       THE FIRST BYTE OF THE MAP IS LEFT BLANK FOR THE FORMFEED                
*  CHARACTER.                                                                   
*                                                                               
*  ** NOTE **                                                                   
*                                                                               
*       THE FOLLOWING MAPSET IS REDEFINED IN THE PROGRAM DPKCS807 IN            
*  ORDER TO MAKE USE OF ARRAYS.  ANY CHANGES TO THIS MAPSET MUST ALSO           
*  BE REFLECTED IN THE PROGRAM REDEFINITION.                                    
***********************************************************************         
        PRINT NOGEN                                                             
DPKM007 DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,TIOAPFX=YES                  
DP007A  DFHMDI SIZE=(24,80),CTRL=FREEKB,LINE=1,COLUMN=1,               X        
               MAPATTS=(COLOR,HILIGHT),DSATTS=(COLOR,HILIGHT)                   
ADATE   DFHMDF POS=(1,2),LENGTH=10,ATTRB=(ASKIP,BRT),COLOR=NEUTRAL              
ATIME   DFHMDF POS=(1,14),LENGTH=8,ATTRB=(ASKIP,BRT),COLOR=NEUTRAL              
ATITLE  DFHMDF POS=(1,25),LENGTH=30,ATTRB=(ASKIP,BRT),COLOR=NEUTRAL             
ANETNAM DFHMDF POS=(1,61),LENGTH=8,ATTRB=(ASKIP,BRT),COLOR=NEUTRAL              
AMNEMIC DFHMDF POS=(1,71),LENGTH=8,ATTRB=(ASKIP,BRT),COLOR=NEUTRAL              
*                                                                               
        DFHMDF POS=(2,61),                                             X        
               LENGTH=9,                                               X        
               ATTRB=(ASKIP,BRT),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='USERID..:'                                              
AUSERID DFHMDF POS=(2,71),                                             X        
               LENGTH=8,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*                                                                               
        DFHMDF POS=(3,1),LENGTH=20,ATTRB=(ASKIP,BRT),COLOR=NEUTRAL,    X        
               INITIAL='ITEM NUMBER  COMMAND'                                   
        DFHMDF POS=(3,36),LENGTH=11,ATTRB=(ASKIP,BRT),COLOR=NEUTRAL,   X        
               INITIAL='DESCRIPTION'                                            
        DFHMDF POS=(3,61),                                             X        
               LENGTH=9,                                               X        
               ATTRB=(ASKIP,BRT),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='LOCATION:'                                              
ALOCATN DFHMDF POS=(3,71),                                             X        
               LENGTH=5,                                               X        
               PICOUT='99999',                                         X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AITEM01 DFHMDF POS=(4,4),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE,       X        
               PICOUT='ZZ9'                                                     
AMNEM01 DFHMDF POS=(4,14),LENGTH=8,ATTRB=(ASKIP,NORM),COLOR=BLUE                
ADESC01 DFHMDF POS=(4,27),LENGTH=30,ATTRB=(ASKIP,NORM),COLOR=BLUE               
AITEM02 DFHMDF POS=(5,4),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE,       X        
               PICOUT='ZZ9'                                                     
AMNEM02 DFHMDF POS=(5,14),LENGTH=8,ATTRB=(ASKIP,NORM),COLOR=BLUE                
ADESC02 DFHMDF POS=(5,27),LENGTH=30,ATTRB=(ASKIP,NORM),COLOR=BLUE               
AITEM03 DFHMDF POS=(6,4),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE,       X        
               PICOUT='ZZ9'                                                     
AMNEM03 DFHMDF POS=(6,14),LENGTH=8,ATTRB=(ASKIP,NORM),COLOR=BLUE                
ADESC03 DFHMDF POS=(6,27),LENGTH=30,ATTRB=(ASKIP,NORM),COLOR=BLUE               
AITEM04 DFHMDF POS=(7,4),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE,       X        
               PICOUT='ZZ9'                                                     
AMNEM04 DFHMDF POS=(7,14),LENGTH=8,ATTRB=(ASKIP,NORM),COLOR=BLUE                
ADESC04 DFHMDF POS=(7,27),LENGTH=30,ATTRB=(ASKIP,NORM),COLOR=BLUE               
AITEM05 DFHMDF POS=(8,4),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE,       X        
               PICOUT='ZZ9'                                                     
AMNEM05 DFHMDF POS=(8,14),LENGTH=8,ATTRB=(ASKIP,NORM),COLOR=BLUE                
ADESC05 DFHMDF POS=(8,27),LENGTH=30,ATTRB=(ASKIP,NORM),COLOR=BLUE               
AITEM06 DFHMDF POS=(9,4),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE,       X        
               PICOUT='ZZ9'                                                     
AMNEM06 DFHMDF POS=(9,14),LENGTH=8,ATTRB=(ASKIP,NORM),COLOR=BLUE                
ADESC06 DFHMDF POS=(9,27),LENGTH=30,ATTRB=(ASKIP,NORM),COLOR=BLUE               
AITEM07 DFHMDF POS=(10,4),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE,      X        
               PICOUT='ZZ9'                                                     
AMNEM07 DFHMDF POS=(10,14),LENGTH=8,ATTRB=(ASKIP,NORM),COLOR=BLUE               
ADESC07 DFHMDF POS=(10,27),LENGTH=30,ATTRB=(ASKIP,NORM),COLOR=BLUE              
AITEM08 DFHMDF POS=(11,4),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE,      X        
               PICOUT='ZZ9'                                                     
AMNEM08 DFHMDF POS=(11,14),LENGTH=8,ATTRB=(ASKIP,NORM),COLOR=BLUE               
ADESC08 DFHMDF POS=(11,27),LENGTH=30,ATTRB=(ASKIP,NORM),COLOR=BLUE              
AITEM09 DFHMDF POS=(12,4),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE,      X        
               PICOUT='ZZ9'                                                     
AMNEM09 DFHMDF POS=(12,14),LENGTH=8,ATTRB=(ASKIP,NORM),COLOR=BLUE               
ADESC09 DFHMDF POS=(12,27),LENGTH=30,ATTRB=(ASKIP,NORM),COLOR=BLUE              
AITEM10 DFHMDF POS=(13,4),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE,      X        
               PICOUT='ZZ9'                                                     
AMNEM10 DFHMDF POS=(13,14),LENGTH=8,ATTRB=(ASKIP,NORM),COLOR=BLUE               
ADESC10 DFHMDF POS=(13,27),LENGTH=30,ATTRB=(ASKIP,NORM),COLOR=BLUE              
AITEM11 DFHMDF POS=(14,4),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE,      X        
               PICOUT='ZZ9'                                                     
AMNEM11 DFHMDF POS=(14,14),LENGTH=8,ATTRB=(ASKIP,NORM),COLOR=BLUE               
ADESC11 DFHMDF POS=(14,27),LENGTH=30,ATTRB=(ASKIP,NORM),COLOR=BLUE              
AITEM12 DFHMDF POS=(15,4),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE,      X        
               PICOUT='ZZ9'                                                     
AMNEM12 DFHMDF POS=(15,14),LENGTH=8,ATTRB=(ASKIP,NORM),COLOR=BLUE               
ADESC12 DFHMDF POS=(15,27),LENGTH=30,ATTRB=(ASKIP,NORM),COLOR=BLUE              
AITEM13 DFHMDF POS=(16,4),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE,      X        
               PICOUT='ZZ9'                                                     
AMNEM13 DFHMDF POS=(16,14),LENGTH=8,ATTRB=(ASKIP,NORM),COLOR=BLUE               
ADESC13 DFHMDF POS=(16,27),LENGTH=30,ATTRB=(ASKIP,NORM),COLOR=BLUE              
AITEM14 DFHMDF POS=(17,4),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE,      X        
               PICOUT='ZZ9'                                                     
AMNEM14 DFHMDF POS=(17,14),LENGTH=8,ATTRB=(ASKIP,NORM),COLOR=BLUE               
ADESC14 DFHMDF POS=(17,27),LENGTH=30,ATTRB=(ASKIP,NORM),COLOR=BLUE              
AITEM15 DFHMDF POS=(18,4),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE,      X        
               PICOUT='ZZ9'                                                     
AMNEM15 DFHMDF POS=(18,14),LENGTH=8,ATTRB=(ASKIP,NORM),COLOR=BLUE               
ADESC15 DFHMDF POS=(18,27),LENGTH=30,ATTRB=(ASKIP,NORM),COLOR=BLUE              
        DFHMDF POS=(20,25),LENGTH=24,ATTRB=(ASKIP,BRT),COLOR=NEUTRAL,  X        
               INITIAL='SELECTED ITEM NUMBER ==>'                               
ASEL    DFHMDF POS=(20,50),LENGTH=3,ATTRB=UNPROT,HILIGHT=UNDERLINE,    X        
               COLOR=GREEN                                                      
        DFHMDF POS=(20,54),LENGTH=1,ATTRB=ASKIP                                 
AMSG    DFHMDF POS=(21,1),LENGTH=78,ATTRB=(ASKIP,BRT),COLOR=NEUTRAL             
        DFHMDF POS=(22,1),LENGTH=11,ATTRB=(ASKIP,BRT),COLOR=NEUTRAL,   X        
               INITIAL='COMMAND ==>'                                            
ANAVCMD DFHMDF POS=(22,13),LENGTH=8,ATTRB=UNPROT,HILIGHT=UNDERLINE,    X        
               COLOR=GREEN                                                      
        DFHMDF POS=(22,22),LENGTH=1,ATTRB=ASKIP                                 
        DFHMDF POS=(22,24),LENGTH=7,ATTRB=(ASKIP,BRT),COLOR=NEUTRAL,   X        
               INITIAL='KEY ==>'                                                
ANAVKEY DFHMDF POS=(22,32),LENGTH=25,ATTRB=UNPROT,HILIGHT=UNDERLINE,   X        
               COLOR=GREEN                                                      
        DFHMDF POS=(22,58),LENGTH=1,ATTRB=ASKIP                                 
        DFHMDF POS=(22,63),LENGTH=16,ATTRB=(ASKIP,BRT),COLOR=NEUTRAL,  X        
               INITIAL='PA2=OTHER F KEYS'                                       
AFKLIN1 DFHMDF POS=(23,1),LENGTH=78,ATTRB=(ASKIP,BRT),COLOR=NEUTRAL             
AFKLIN2 DFHMDF POS=(24,1),LENGTH=78,ATTRB=(ASKIP,BRT),COLOR=NEUTRAL             
        DFHMSD TYPE=FINAL                                                       
        PRINT NOGEN                                                             
        END                                                                     
