*          DATA SET DPKM026    AT LEVEL 005 AS OF 12/10/90                      
*********************************************************************** 00001   
*       MAPSET  DPKM026                                                 00002   
*       MAP     DP026A                                                  00003   
*       PROGRAM DPKCS026 - SELECT ABEND EXIT                            00004   
*       TRANSID Z026                                                    00005   
*       SYSTEM  CICS ARCHITECTURE                                       00006   
*********************************************************************** 00007   
        PRINT  NOGEN                                                    00008   
DPKM026 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES,             C00009   
               CTRL=(FREEKB)                                            00010   
DP026A  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),                   C00011   
               DSATTS=(COLOR,HILIGHT)                                   00012   
ADATE   DFHMDF POS=(1,2),LENGTH=8,ATTRB=(PROT,BRT),COLOR=BLUE           00013**3
ATIME   DFHMDF POS=(1,14),LENGTH=8,ATTRB=(PROT,BRT),COLOR=BLUE          00014   
        DFHMDF POS=(1,30),LENGTH=17,INITIAL='SELECT ABEND EXIT',       C00015   
               ATTRB=(PROT,BRT,FSET)                                    00016**4
ATERMID DFHMDF POS=(1,63),LENGTH=4,ATTRB=(PROT,BRT),COLOR=BLUE          00017   
APGMID  DFHMDF POS=(1,70),LENGTH=8,ATTRB=(PROT,BRT)                     00018   
        DFHMDF POS=(8,20),LENGTH=39,INITIAL='HIT ONE OF THE FOLLOWING FC00019**2
               UNCTION KEYS:',ATTRB=(PROT,BRT)                          00020**2
        DFHMDF POS=(10,26),LENGTH=27,INITIAL='PF3)  RETURN TO NATIVE CIC00021**2
               CS',ATTRB=(PROT,BRT)                                     00022**2
        DFHMDF POS=(11,26),LENGTH=25,INITIAL='PF4)  RETURN TO MAIN MENUC00023**2
               ',ATTRB=(PROT,BRT)                                       00024**2
        DFHMDF POS=(12,26),LENGTH=12,INITIAL='PF24) LOGOFF',           C00025**2
               ATTRB=(PROT,BRT)                                         00026**2
        DFHMDF POS=(23,1),LENGTH=42,INITIAL='PF3 - END   PF4 - MAINMENUC00027**5
                  PF24 - LOGOFF',ATTRB=(PROT,BRT)                       00028**2
AMSG    DFHMDF POS=(24,1),LENGTH=79,ATTRB=(PROT,BRT)                    00029**2
        DFHMSD TYPE=FINAL                                               00030   
        END                                                             00031   
