*          DATA SET DPKM004    AT LEVEL 008 AS OF 03/14/90                      
*          DATA SET DPKM004A1  AT LEVEL 015 AS OF 10/27/89              00001   
*          DATA SET DPKM004    AT LEVEL 001 AS OF 10/24/89              00002   
******************************************************************      00003   
*                                                                       00004   
*       THIS IS THE MAPSET FOR THE DB2 CHECKPOINT RESTART SYSTEM -      00005   
*  CHECKPOINT CONTROL MAIN MENU (DPKCS004 - G004).                      00006   
*                                                                       00007   
*       THE FIRST BYTE OF THE MAP IS LEFT BLANK FOR THE FORMFEED        00008   
*  CHARACTER.                                                           00009   
*                                                                       00010   
******************************************************************      00011   
        PRINT NOGEN                                                     00012   
DPKM004 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES               00013   
DP004A  DFHMDI SIZE=(24,80),CTRL=(FREEKB,FRSET),LINE=1,COLUMN=1,       X00014   
               MAPATTS=(COLOR,HILIGHT),DSATTS=(COLOR,HILIGHT),         X00015   
               EXTATT=YES                                               00016   
        DFHMDF POS=(1,3),LENGTH=8,ATTRB=(ASKIP,BRT),                   X00017   
               INITIAL='DPKCS004'                                       00018   
        DFHMDF POS=(1,19),LENGTH=45,ATTRB=(ASKIP,BRT),                 X00019   
               INITIAL='K O H L S   D E P A R T M E N T   S T O R E S'  00020   
ADATE   DFHMDF POS=(1,72),LENGTH=8,ATTRB=(ASKIP,BRT)                    00021   
ATERM   DFHMDF POS=(2,3),LENGTH=4,ATTRB=(ASKIP,BRT)                     00022   
        DFHMDF POS=(2,27),LENGTH=29,ATTRB=(ASKIP,BRT),                 X00023   
               INITIAL='DB2 CHECKPOINT RESTART SYSTEM'                  00024   
ATIME   DFHMDF POS=(2,75),LENGTH=5,ATTRB=(ASKIP,BRT)                    00025   
        DFHMDF POS=(3,27),LENGTH=30,ATTRB=(ASKIP,BRT),                 X00026**4
               INITIAL='CHECKPOINT CONTROL MAINTENANCE'                 00027   
        DFHMDF POS=(5,10),LENGTH=7,ATTRB=(ASKIP,BRT),                  X00028**4
               INITIAL='ACTION:'                                        00029   
AACTION DFHMDF POS=(5,18),LENGTH=1,ATTRB=(IC,UNPROT,BRT,FSET),         X00030**6
               HILIGHT=UNDERLINE,COLOR=GREEN                            00031   
        DFHMDF POS=(5,20),LENGTH=27,ATTRB=(ASKIP,BRT),                 X00032   
               INITIAL='(A-ADD, C-CHANGE, D-DELETE)'                    00033   
        DFHMDF POS=(6,8),LENGTH=9,ATTRB=(ASKIP,BRT),                   X00034   
               INITIAL='JOB NAME:'                                      00035   
AJOBNME DFHMDF POS=(6,18),LENGTH=8,ATTRB=(UNPROT,BRT,FSET),            X00036**6
               HILIGHT=UNDERLINE,COLOR=GREEN                            00037   
        DFHMDF POS=(6,27),LENGTH=1,ATTRB=ASKIP                          00038   
        DFHMDF POS=(7,7),LENGTH=10,ATTRB=(ASKIP,BRT),                  X00039**3
               INITIAL='PLAN NAME:'                                     00040   
APLNNME DFHMDF POS=(7,18),LENGTH=8,ATTRB=(UNPROT,BRT,FSET),            X00041**3
               HILIGHT=UNDERLINE,COLOR=GREEN                            00042   
        DFHMDF POS=(7,27),LENGTH=1,ATTRB=ASKIP                          00043**3
        DFHMDF POS=(9,2),LENGTH=19,ATTRB=(ASKIP,BRT),                  X00044   
               INITIAL='CHECKPOINT CONTROLS'                            00045   
        DFHMDF POS=(10,9),LENGTH=8,ATTRB=(ASKIP,BRT),                  X00046   
               INITIAL='CONTROL:'                                       00047   
ACONTRL DFHMDF POS=(10,18),LENGTH=1,ATTRB=(UNPROT,BRT,FSET),           X00048   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00049   
        DFHMDF POS=(10,20),LENGTH=37,ATTRB=(ASKIP,BRT),                X00050   
               INITIAL='(A-AUTOMATIC, R-REQUESTED BY PROGRAM)'          00051   
        DFHMDF POS=(11,12),LENGTH=5,ATTRB=(ASKIP,BRT),                 X00052   
               INITIAL='TYPE:'                                          00053   
ATYPE   DFHMDF POS=(11,18),LENGTH=1,ATTRB=(UNPROT,BRT,FSET),           X00054   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00055   
        DFHMDF POS=(11,20),LENGTH=57,ATTRB=(ASKIP,BRT),                X00056**7
               INITIAL='(C-CONTROL BREAK, L-LOGICAL TRANSACTION, T-TIMEX00057**7
                INTERVAL)'                                              00058**7
        DFHMDF POS=(12,7),LENGTH=10,ATTRB=(ASKIP,BRT),                 X00059   
               INITIAL='FREQUENCY:'                                     00060   
AFREQ   DFHMDF POS=(12,18),LENGTH=5,ATTRB=(UNPROT,NUM,BRT,FSET),       X00061   
               HILIGHT=UNDERLINE,COLOR=GREEN,PICOUT='ZZZZ9'             00062   
        DFHMDF POS=(12,24),LENGTH=1,ATTRB=(ASKIP,NORM)                  00063   
        DFHMDF POS=(13,10),LENGTH=7,ATTRB=(ASKIP,BRT),                 X00064   
               INITIAL='STATUS:'                                        00065   
ASTATUS DFHMDF POS=(13,18),LENGTH=1,ATTRB=(UNPROT,BRT,FSET),           X00066**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00067**5
        DFHMDF POS=(13,20),LENGTH=1,ATTRB=(ASKIP,NORM)                  00068**4
        DFHMDF POS=(23,2),LENGTH=70,ATTRB=(ASKIP,BRT),                 X00069   
               INITIAL='PF2 =CONFIRM  PF4 = SYS MENU  PF5 = INQUIRY    X00070**8
                       '                                                00071**2
AMSG    DFHMDF POS=(24,1),LENGTH=79,ATTRB=(ASKIP,BRT),COLOR=RED         00072   
        DFHMSD TYPE=FINAL                                               00073   
        PRINT NOGEN                                                     00074   
        END                                                             00075   
