*          DATA SET DPKM043    AT LEVEL 004 AS OF 04/07/93                      
        PRINT  NOGEN                                                    00001**1
DPKM043 DFHMSD TYPE=DSECT,                                             C00002**1
               LANG=COBOL,                                             C00003**1
               MODE=INOUT,                                             C00004**1
               STORAGE=AUTO,                                           C00005**1
               TERM=3270-2,                                            C00006**1
               TIOAPFX=YES                                              00007**1
**************                                                          00008**1
DP043A  DFHMDI LINE=2,COLUMN=1,                                        C00009**1
               SIZE=(19,80),                                           C00010**1
               CTRL=(FREEKB),                                          C00011**1
               MAPATTS=(COLOR,HILIGHT),                                C00012**1
               DSATTS=(COLOR,HILIGHT)                                   00013**1
**************                                                          00014**1
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,BRT),                C00015**1
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00016**1
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00017**1
               COLOR=GREEN,                                            C00018**1
               HILIGHT=UNDERLINE,                                      C00019**1
               PICOUT='ZZZZ9'                                           00020**1
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,BRT),                C00021**1
               COLOR=NEUTRAL,                                          C00022**1
               INITIAL='TO'                                             00023**1
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00024**1
               COLOR=BLUE,                                             C00025**1
               PICOUT='ZZZZ9'                                           00026**1
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,BRT),                C00027**1
               COLOR=NEUTRAL,                                          C00028**1
               INITIAL='OF'                                             00029**1
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00030**1
               COLOR=BLUE,                                             C00031**1
               PICOUT='ZZZZ9'                                           00032**1
*                                                                       00033**1
        DFHMDF POS=(04,02),LENGTH=04,ATTRB=(PROT,BRT),                 C00034**1
               COLOR=NEUTRAL,                                          C00035**1
               INITIAL='TYPE'                                           00036**1
        DFHMDF POS=(04,08),LENGTH=09,ATTRB=(PROT,BRT),                 C00037**1
               COLOR=NEUTRAL,                                          C00038**1
               INITIAL='OBJECT ID'                                      00039**1
        DFHMDF POS=(04,38),LENGTH=06,ATTRB=(PROT,BRT),                 C00040**1
               COLOR=NEUTRAL,                                          C00041**1
               INITIAL='USERID'                                         00042**1
        DFHMDF POS=(04,47),LENGTH=08,ATTRB=(PROT,BRT),                 C00043**1
               COLOR=NEUTRAL,                                          C00044**1
               INITIAL='MNEMONIC'                                       00045**1
        DFHMDF POS=(04,58),LENGTH=12,ATTRB=(PROT,BRT),                 C00046**1
               COLOR=NEUTRAL,                                          C00047**1
               INITIAL='TIME'                                           00048**1
*                                                                       00049**1
ATYPE01 DFHMDF POS=(05,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00050**2
               COLOR=BLUE                                               00051**1
AOBID01 DFHMDF POS=(05,07),LENGTH=30,ATTRB=(ASKIP,NORM),               C00052**2
               COLOR=BLUE                                               00053**2
AUSER01 DFHMDF POS=(05,38),LENGTH=08,ATTRB=(ASKIP,NORM),               C00054**2
               COLOR=BLUE                                               00055**1
AMNEM01 DFHMDF POS=(05,47),LENGTH=08,ATTRB=(ASKIP,NORM),               C00056**2
               COLOR=BLUE                                               00057**1
ATIME01 DFHMDF POS=(05,56),LENGTH=19,ATTRB=(ASKIP,NORM),               C00058**4
               COLOR=BLUE                                               00059**1
*                                                                       00060**3
ATYPE02 DFHMDF POS=(06,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00061**3
               COLOR=BLUE                                               00062**3
AOBID02 DFHMDF POS=(06,07),LENGTH=30,ATTRB=(ASKIP,NORM),               C00063**3
               COLOR=BLUE                                               00064**3
AUSER02 DFHMDF POS=(06,38),LENGTH=08,ATTRB=(ASKIP,NORM),               C00065**3
               COLOR=BLUE                                               00066**3
AMNEM02 DFHMDF POS=(06,47),LENGTH=08,ATTRB=(ASKIP,NORM),               C00067**3
               COLOR=BLUE                                               00068**3
ATIME02 DFHMDF POS=(06,56),LENGTH=19,ATTRB=(ASKIP,NORM),               C00069**4
               COLOR=BLUE                                               00070**3
*                                                                       00071**3
ATYPE03 DFHMDF POS=(07,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00072**3
               COLOR=BLUE                                               00073**3
AOBID03 DFHMDF POS=(07,07),LENGTH=30,ATTRB=(ASKIP,NORM),               C00074**3
               COLOR=BLUE                                               00075**3
AUSER03 DFHMDF POS=(07,38),LENGTH=08,ATTRB=(ASKIP,NORM),               C00076**3
               COLOR=BLUE                                               00077**3
AMNEM03 DFHMDF POS=(07,47),LENGTH=08,ATTRB=(ASKIP,NORM),               C00078**3
               COLOR=BLUE                                               00079**3
ATIME03 DFHMDF POS=(07,56),LENGTH=19,ATTRB=(ASKIP,NORM),               C00080**4
               COLOR=BLUE                                               00081**3
*                                                                       00082**3
ATYPE04 DFHMDF POS=(08,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00083**3
               COLOR=BLUE                                               00084**3
AOBID04 DFHMDF POS=(08,07),LENGTH=30,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086**3
AUSER04 DFHMDF POS=(08,38),LENGTH=08,ATTRB=(ASKIP,NORM),               C00087**3
               COLOR=BLUE                                               00088**3
AMNEM04 DFHMDF POS=(08,47),LENGTH=08,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090**3
ATIME04 DFHMDF POS=(08,56),LENGTH=19,ATTRB=(ASKIP,NORM),               C00091**4
               COLOR=BLUE                                               00092**3
*                                                                       00093**3
ATYPE05 DFHMDF POS=(09,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00094**3
               COLOR=BLUE                                               00095**3
AOBID05 DFHMDF POS=(09,07),LENGTH=30,ATTRB=(ASKIP,NORM),               C00096**3
               COLOR=BLUE                                               00097**3
AUSER05 DFHMDF POS=(09,38),LENGTH=08,ATTRB=(ASKIP,NORM),               C00098**3
               COLOR=BLUE                                               00099**3
AMNEM05 DFHMDF POS=(09,47),LENGTH=08,ATTRB=(ASKIP,NORM),               C00100**3
               COLOR=BLUE                                               00101**3
ATIME05 DFHMDF POS=(09,56),LENGTH=19,ATTRB=(ASKIP,NORM),               C00102**4
               COLOR=BLUE                                               00103**3
*                                                                       00104**3
ATYPE06 DFHMDF POS=(10,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00105**3
               COLOR=BLUE                                               00106**3
AOBID06 DFHMDF POS=(10,07),LENGTH=30,ATTRB=(ASKIP,NORM),               C00107**3
               COLOR=BLUE                                               00108**3
AUSER06 DFHMDF POS=(10,38),LENGTH=08,ATTRB=(ASKIP,NORM),               C00109**3
               COLOR=BLUE                                               00110**3
AMNEM06 DFHMDF POS=(10,47),LENGTH=08,ATTRB=(ASKIP,NORM),               C00111**3
               COLOR=BLUE                                               00112**3
ATIME06 DFHMDF POS=(10,56),LENGTH=19,ATTRB=(ASKIP,NORM),               C00113**4
               COLOR=BLUE                                               00114**3
*                                                                       00115**3
ATYPE07 DFHMDF POS=(11,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00116**3
               COLOR=BLUE                                               00117**3
AOBID07 DFHMDF POS=(11,07),LENGTH=30,ATTRB=(ASKIP,NORM),               C00118**3
               COLOR=BLUE                                               00119**3
AUSER07 DFHMDF POS=(11,38),LENGTH=08,ATTRB=(ASKIP,NORM),               C00120**3
               COLOR=BLUE                                               00121**3
AMNEM07 DFHMDF POS=(11,47),LENGTH=08,ATTRB=(ASKIP,NORM),               C00122**3
               COLOR=BLUE                                               00123**3
ATIME07 DFHMDF POS=(11,56),LENGTH=19,ATTRB=(ASKIP,NORM),               C00124**4
               COLOR=BLUE                                               00125**3
*                                                                       00126**3
ATYPE08 DFHMDF POS=(12,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00127**3
               COLOR=BLUE                                               00128**3
AOBID08 DFHMDF POS=(12,07),LENGTH=30,ATTRB=(ASKIP,NORM),               C00129**3
               COLOR=BLUE                                               00130**3
AUSER08 DFHMDF POS=(12,38),LENGTH=08,ATTRB=(ASKIP,NORM),               C00131**3
               COLOR=BLUE                                               00132**3
AMNEM08 DFHMDF POS=(12,47),LENGTH=08,ATTRB=(ASKIP,NORM),               C00133**3
               COLOR=BLUE                                               00134**3
ATIME08 DFHMDF POS=(12,56),LENGTH=19,ATTRB=(ASKIP,NORM),               C00135**4
               COLOR=BLUE                                               00136**3
*                                                                       00137**3
ATYPE09 DFHMDF POS=(13,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00138**3
               COLOR=BLUE                                               00139**3
AOBID09 DFHMDF POS=(13,07),LENGTH=30,ATTRB=(ASKIP,NORM),               C00140**3
               COLOR=BLUE                                               00141**3
AUSER09 DFHMDF POS=(13,38),LENGTH=08,ATTRB=(ASKIP,NORM),               C00142**3
               COLOR=BLUE                                               00143**3
AMNEM09 DFHMDF POS=(13,47),LENGTH=08,ATTRB=(ASKIP,NORM),               C00144**3
               COLOR=BLUE                                               00145**3
ATIME09 DFHMDF POS=(13,56),LENGTH=19,ATTRB=(ASKIP,NORM),               C00146**4
               COLOR=BLUE                                               00147**3
*                                                                       00148**3
ATYPE10 DFHMDF POS=(14,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00149**3
               COLOR=BLUE                                               00150**3
AOBID10 DFHMDF POS=(14,07),LENGTH=30,ATTRB=(ASKIP,NORM),               C00151**3
               COLOR=BLUE                                               00152**3
AUSER10 DFHMDF POS=(14,38),LENGTH=08,ATTRB=(ASKIP,NORM),               C00153**3
               COLOR=BLUE                                               00154**3
AMNEM10 DFHMDF POS=(14,47),LENGTH=08,ATTRB=(ASKIP,NORM),               C00155**3
               COLOR=BLUE                                               00156**3
ATIME10 DFHMDF POS=(14,56),LENGTH=19,ATTRB=(ASKIP,NORM),               C00157**4
               COLOR=BLUE                                               00158**3
*                                                                       00159**3
ATYPE11 DFHMDF POS=(15,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00160**3
               COLOR=BLUE                                               00161**3
AOBID11 DFHMDF POS=(15,07),LENGTH=30,ATTRB=(ASKIP,NORM),               C00162**3
               COLOR=BLUE                                               00163**3
AUSER11 DFHMDF POS=(15,38),LENGTH=08,ATTRB=(ASKIP,NORM),               C00164**3
               COLOR=BLUE                                               00165**3
AMNEM11 DFHMDF POS=(15,47),LENGTH=08,ATTRB=(ASKIP,NORM),               C00166**3
               COLOR=BLUE                                               00167**3
ATIME11 DFHMDF POS=(15,56),LENGTH=19,ATTRB=(ASKIP,NORM),               C00168**4
               COLOR=BLUE                                               00169**3
*                                                                       00170**3
ATYPE12 DFHMDF POS=(16,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00171**3
               COLOR=BLUE                                               00172**3
AOBID12 DFHMDF POS=(16,07),LENGTH=30,ATTRB=(ASKIP,NORM),               C00173**3
               COLOR=BLUE                                               00174**3
AUSER12 DFHMDF POS=(16,38),LENGTH=08,ATTRB=(ASKIP,NORM),               C00175**3
               COLOR=BLUE                                               00176**3
AMNEM12 DFHMDF POS=(16,47),LENGTH=08,ATTRB=(ASKIP,NORM),               C00177**3
               COLOR=BLUE                                               00178**3
ATIME12 DFHMDF POS=(16,56),LENGTH=19,ATTRB=(ASKIP,NORM),               C00179**4
               COLOR=BLUE                                               00180**3
*                                                                       00181**3
ATYPE13 DFHMDF POS=(17,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00182**3
               COLOR=BLUE                                               00183**3
AOBID13 DFHMDF POS=(17,07),LENGTH=30,ATTRB=(ASKIP,NORM),               C00184**3
               COLOR=BLUE                                               00185**3
AUSER13 DFHMDF POS=(17,38),LENGTH=08,ATTRB=(ASKIP,NORM),               C00186**3
               COLOR=BLUE                                               00187**3
AMNEM13 DFHMDF POS=(17,47),LENGTH=08,ATTRB=(ASKIP,NORM),               C00188**3
               COLOR=BLUE                                               00189**3
ATIME13 DFHMDF POS=(17,56),LENGTH=19,ATTRB=(ASKIP,NORM),               C00190**4
               COLOR=BLUE                                               00191**3
*                                                                       00192**3
ATYPE14 DFHMDF POS=(18,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00193**3
               COLOR=BLUE                                               00194**3
AOBID14 DFHMDF POS=(18,07),LENGTH=30,ATTRB=(ASKIP,NORM),               C00195**3
               COLOR=BLUE                                               00196**3
AUSER14 DFHMDF POS=(18,38),LENGTH=08,ATTRB=(ASKIP,NORM),               C00197**3
               COLOR=BLUE                                               00198**3
AMNEM14 DFHMDF POS=(18,47),LENGTH=08,ATTRB=(ASKIP,NORM),               C00199**3
               COLOR=BLUE                                               00200**3
ATIME14 DFHMDF POS=(18,56),LENGTH=19,ATTRB=(ASKIP,NORM),               C00201**4
               COLOR=BLUE                                               00202**3
*                                                                       00203**3
ATYPE15 DFHMDF POS=(19,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00204**3
               COLOR=BLUE                                               00205**3
AOBID15 DFHMDF POS=(19,07),LENGTH=30,ATTRB=(ASKIP,NORM),               C00206**3
               COLOR=BLUE                                               00207**3
AUSER15 DFHMDF POS=(19,38),LENGTH=08,ATTRB=(ASKIP,NORM),               C00208**3
               COLOR=BLUE                                               00209**3
AMNEM15 DFHMDF POS=(19,47),LENGTH=08,ATTRB=(ASKIP,NORM),               C00210**3
               COLOR=BLUE                                               00211**3
ATIME15 DFHMDF POS=(19,56),LENGTH=19,ATTRB=(ASKIP,NORM),               C00212**4
               COLOR=BLUE                                               00213**3
*                                                                       00214**1
**************                                                          00215**1
        DFHMSD TYPE=FINAL                                               00216**1
**************                                                          00217**1
        END                                                             00218**1
