*          DATA SET DPKM018    AT LEVEL 005 AS OF 07/22/92                      
        PRINT  NOGEN                                                    00001   
DPKM018 DFHMSD TYPE=DSECT,                                             C00002   
               LANG=COBOL,                                             C00003   
               MODE=INOUT,                                             C00004   
               STORAGE=AUTO,                                           C00005   
               TERM=3270-2,                                            C00006   
               TIOAPFX=YES                                              00007   
**************                                                          00008   
DP018A  DFHMDI LINE=2,COLUMN=1,                                        C00010   
               SIZE=(19,80),                                           C00009   
               CTRL=(FREEKB),                                          C00010   
               MAPATTS=(COLOR,HILIGHT),                                C00011   
               DSATTS=(COLOR,HILIGHT)                                   00012   
**************                                                          00013   
AMNEM   DFHMDF POS=(02,13),LENGTH=08,ATTRB=(ASKIP,BRT,FSET),           C00024   
               COLOR=BLUE                                               00025   
        DFHMDF POS=(02,22),LENGTH=01,ATTRB=(ASKIP)                      00026   
AMNTTLE DFHMDF POS=(02,24),LENGTH=30,ATTRB=(ASKIP,BRT,FSET),           C00027   
               COLOR=BLUE                                               00028   
ASTRTIT DFHMDF POS=(03,56),LENGTH=05,ATTRB=(NUM,UNPROT,NORM,FSET),     C00029   
               COLOR=GREEN,                                            C00030   
               PICOUT='ZZZZ9'                                           00031   
        DFHMDF POS=(03,62),LENGTH=02,ATTRB=(ASKIP,NORM),               C00032   
               INITIAL='TO',                                           C00033   
               COLOR=NEUTRAL                                            00034   
AENDIT  DFHMDF POS=(03,65),LENGTH=05,ATTRB=(ASKIP,NORM),               C00035   
               COLOR=BLUE,                                             C00036   
               PICOUT='ZZZZ9'                                           00037   
        DFHMDF POS=(03,71),LENGTH=02,ATTRB=(ASKIP,NORM),               C00038   
               COLOR=NEUTRAL,                                          C00039   
               INITIAL='OF'                                             00040   
ATOTIT  DFHMDF POS=(03,74),LENGTH=05,ATTRB=(ASKIP,NORM),               C00041   
               COLOR=BLUE,                                             C00042   
               PICOUT='ZZZZ9'                                           00043   
        DFHMDF POS=(04,01),LENGTH=03,ATTRB=(PROT,NORM),                C00044   
               COLOR=NEUTRAL,                                          C00045   
               INITIAL='SEL'                                            00046   
        DFHMDF POS=(04,05),LENGTH=08,ATTRB=(PROT,NORM),                C00047   
               COLOR=NEUTRAL,                                          C00048   
               INITIAL='MNEMONIC'                                       00049   
        DFHMDF POS=(04,17),LENGTH=08,ATTRB=(PROT,NORM),                C00050**4
               COLOR=NEUTRAL,                                          C00051   
               INITIAL='SEQ  FMT'                                       00052**4
        DFHMDF POS=(04,33),LENGTH=05,ATTRB=(PROT,NORM),                C00053   
               COLOR=NEUTRAL,                                          C00054   
               INITIAL='TITLE'                                          00055   
        DFHMDF POS=(04,56),LENGTH=07,ATTRB=(PROT,NORM),                C00056**5
               COLOR=NEUTRAL,                                          C00057   
               INITIAL='PROGRAM'                                        00058   
*                                                                       00059   
ASEL01  DFHMDF POS=(05,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00060   
               HILIGHT=UNDERLINE,                                      C00061   
               COLOR=GREEN                                              00062   
        DFHMDF POS=(05,03),LENGTH=01,ATTRB=(ASKIP)                      00063   
AIMNE01 DFHMDF POS=(05,05),LENGTH=08,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00065   
        DFHMDF POS=(05,14),LENGTH=01,ATTRB=(ASKIP)                      00066   
AISEQ01 DFHMDF POS=(05,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00067   
               COLOR=BLUE,                                             C00068   
               PICOUT='Z(4)'                                            00069   
        DFHMDF POS=(05,21),LENGTH=01,ATTRB=(ASKIP,DRK)                  00070   
AFRMT01 DFHMDF POS=(05,23),LENGTH=01,ATTRB=(ASKIP,NORM),               C00071**2
               COLOR=BLUE                                               00072   
AITTL01 DFHMDF POS=(05,25),LENGTH=30,ATTRB=(ASKIP,NORM),               C00073**2
               COLOR=BLUE                                               00074**2
AIPRG01 DFHMDF POS=(05,56),LENGTH=08,ATTRB=(ASKIP,NORM),               C00075**2
               COLOR=BLUE                                               00076   
ARSLT01 DFHMDF POS=(05,65),LENGTH=14,ATTRB=(ASKIP,NORM),               C00077**2
               COLOR=BLUE                                               00078   
*                                                                       00079**2
ASEL02  DFHMDF POS=(06,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00080**2
               HILIGHT=UNDERLINE,                                      C00081**2
               COLOR=GREEN                                              00082**2
        DFHMDF POS=(06,03),LENGTH=01,ATTRB=(ASKIP)                      00083**2
AIMNE02 DFHMDF POS=(06,05),LENGTH=08,ATTRB=(ASKIP,NORM),               C00084**2
               COLOR=BLUE                                               00085**2
        DFHMDF POS=(06,14),LENGTH=01,ATTRB=(ASKIP)                      00086**2
AISEQ02 DFHMDF POS=(06,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00087**2
               COLOR=BLUE,                                             C00088**2
               PICOUT='Z(4)'                                            00089**2
        DFHMDF POS=(06,21),LENGTH=01,ATTRB=(ASKIP,DRK)                  00090**2
AFRMT02 DFHMDF POS=(06,23),LENGTH=01,ATTRB=(ASKIP,NORM),               C00091**2
               COLOR=BLUE                                               00092**2
AITTL02 DFHMDF POS=(06,25),LENGTH=30,ATTRB=(ASKIP,NORM),               C00093**2
               COLOR=BLUE                                               00094**2
AIPRG02 DFHMDF POS=(06,56),LENGTH=08,ATTRB=(ASKIP,NORM),               C00095**2
               COLOR=BLUE                                               00096**2
ARSLT02 DFHMDF POS=(06,65),LENGTH=14,ATTRB=(ASKIP,NORM),               C00097**2
               COLOR=BLUE                                               00098**3
*                                                                       00099**2
ASEL03  DFHMDF POS=(07,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00100**2
               HILIGHT=UNDERLINE,                                      C00101**2
               COLOR=GREEN                                              00102**2
        DFHMDF POS=(07,03),LENGTH=01,ATTRB=(ASKIP)                      00103**2
AIMNE03 DFHMDF POS=(07,05),LENGTH=08,ATTRB=(ASKIP,NORM),               C00104**2
               COLOR=BLUE                                               00105**2
        DFHMDF POS=(07,14),LENGTH=01,ATTRB=(ASKIP)                      00106**2
AISEQ03 DFHMDF POS=(07,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00107**2
               COLOR=BLUE,                                             C00108**2
               PICOUT='Z(4)'                                            00109**2
        DFHMDF POS=(07,21),LENGTH=01,ATTRB=(ASKIP,DRK)                  00110**2
AFRMT03 DFHMDF POS=(07,23),LENGTH=01,ATTRB=(ASKIP,NORM),               C00111**2
               COLOR=BLUE                                               00112**2
AITTL03 DFHMDF POS=(07,25),LENGTH=30,ATTRB=(ASKIP,NORM),               C00113**2
               COLOR=BLUE                                               00114**2
AIPRG03 DFHMDF POS=(07,56),LENGTH=08,ATTRB=(ASKIP,NORM),               C00115**2
               COLOR=BLUE                                               00116**2
ARSLT03 DFHMDF POS=(07,65),LENGTH=14,ATTRB=(ASKIP,NORM),               C00117**2
               COLOR=BLUE                                               00118**2
*                                                                       00119**2
ASEL04  DFHMDF POS=(08,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00120**2
               HILIGHT=UNDERLINE,                                      C00121**2
               COLOR=GREEN                                              00122**2
        DFHMDF POS=(08,03),LENGTH=01,ATTRB=(ASKIP)                      00123**2
AIMNE04 DFHMDF POS=(08,05),LENGTH=08,ATTRB=(ASKIP,NORM),               C00124**2
               COLOR=BLUE                                               00125**2
        DFHMDF POS=(08,14),LENGTH=01,ATTRB=(ASKIP)                      00126**2
AISEQ04 DFHMDF POS=(08,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00127**2
               COLOR=BLUE,                                             C00128**2
               PICOUT='Z(4)'                                            00129**2
        DFHMDF POS=(08,21),LENGTH=01,ATTRB=(ASKIP,DRK)                  00130**2
AFRMT04 DFHMDF POS=(08,23),LENGTH=01,ATTRB=(ASKIP,NORM),               C00131**2
               COLOR=BLUE                                               00132**2
AITTL04 DFHMDF POS=(08,25),LENGTH=30,ATTRB=(ASKIP,NORM),               C00133**2
               COLOR=BLUE                                               00134**2
AIPRG04 DFHMDF POS=(08,56),LENGTH=08,ATTRB=(ASKIP,NORM),               C00135**2
               COLOR=BLUE                                               00136**2
ARSLT04 DFHMDF POS=(08,65),LENGTH=14,ATTRB=(ASKIP,NORM),               C00137**2
               COLOR=BLUE                                               00138**2
*                                                                       00139**2
ASEL05  DFHMDF POS=(09,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00140**2
               HILIGHT=UNDERLINE,                                      C00141**2
               COLOR=GREEN                                              00142**2
        DFHMDF POS=(09,03),LENGTH=01,ATTRB=(ASKIP)                      00143**2
AIMNE05 DFHMDF POS=(09,05),LENGTH=08,ATTRB=(ASKIP,NORM),               C00144**2
               COLOR=BLUE                                               00145**2
        DFHMDF POS=(09,14),LENGTH=01,ATTRB=(ASKIP)                      00146**2
AISEQ05 DFHMDF POS=(09,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00147**2
               COLOR=BLUE,                                             C00148**2
               PICOUT='Z(4)'                                            00149**2
        DFHMDF POS=(09,21),LENGTH=01,ATTRB=(ASKIP,DRK)                  00150**2
AFRMT05 DFHMDF POS=(09,23),LENGTH=01,ATTRB=(ASKIP,NORM),               C00151**2
               COLOR=BLUE                                               00152**2
AITTL05 DFHMDF POS=(09,25),LENGTH=30,ATTRB=(ASKIP,NORM),               C00153**2
               COLOR=BLUE                                               00154**2
AIPRG05 DFHMDF POS=(09,56),LENGTH=08,ATTRB=(ASKIP,NORM),               C00155**2
               COLOR=BLUE                                               00156**2
ARSLT05 DFHMDF POS=(09,65),LENGTH=14,ATTRB=(ASKIP,NORM),               C00157**2
               COLOR=BLUE                                               00158**2
*                                                                       00159**2
ASEL06  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00160**2
               HILIGHT=UNDERLINE,                                      C00161**2
               COLOR=GREEN                                              00162**2
        DFHMDF POS=(10,03),LENGTH=01,ATTRB=(ASKIP)                      00163**2
AIMNE06 DFHMDF POS=(10,05),LENGTH=08,ATTRB=(ASKIP,NORM),               C00164**2
               COLOR=BLUE                                               00165**2
        DFHMDF POS=(10,14),LENGTH=01,ATTRB=(ASKIP)                      00166**2
AISEQ06 DFHMDF POS=(10,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00167**2
               COLOR=BLUE,                                             C00168**2
               PICOUT='Z(4)'                                            00169**2
        DFHMDF POS=(10,21),LENGTH=01,ATTRB=(ASKIP,DRK)                  00170**2
AFRMT06 DFHMDF POS=(10,23),LENGTH=01,ATTRB=(ASKIP,NORM),               C00171**2
               COLOR=BLUE                                               00172**2
AITTL06 DFHMDF POS=(10,25),LENGTH=30,ATTRB=(ASKIP,NORM),               C00173**2
               COLOR=BLUE                                               00174**2
AIPRG06 DFHMDF POS=(10,56),LENGTH=08,ATTRB=(ASKIP,NORM),               C00175**2
               COLOR=BLUE                                               00176**2
ARSLT06 DFHMDF POS=(10,65),LENGTH=14,ATTRB=(ASKIP,NORM),               C00177**2
               COLOR=BLUE                                               00178**3
*                                                                       00179**2
ASEL07  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00180**2
               HILIGHT=UNDERLINE,                                      C00181**2
               COLOR=GREEN                                              00182**2
        DFHMDF POS=(11,03),LENGTH=01,ATTRB=(ASKIP)                      00183**2
AIMNE07 DFHMDF POS=(11,05),LENGTH=08,ATTRB=(ASKIP,NORM),               C00184**2
               COLOR=BLUE                                               00185**2
        DFHMDF POS=(11,14),LENGTH=01,ATTRB=(ASKIP)                      00186**2
AISEQ07 DFHMDF POS=(11,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00187**2
               COLOR=BLUE,                                             C00188**2
               PICOUT='Z(4)'                                            00189**2
        DFHMDF POS=(11,21),LENGTH=01,ATTRB=(ASKIP,DRK)                  00190**2
AFRMT07 DFHMDF POS=(11,23),LENGTH=01,ATTRB=(ASKIP,NORM),               C00191**2
               COLOR=BLUE                                               00192**2
AITTL07 DFHMDF POS=(11,25),LENGTH=30,ATTRB=(ASKIP,NORM),               C00193**2
               COLOR=BLUE                                               00194**2
AIPRG07 DFHMDF POS=(11,56),LENGTH=08,ATTRB=(ASKIP,NORM),               C00195**2
               COLOR=BLUE                                               00196**2
ARSLT07 DFHMDF POS=(11,65),LENGTH=14,ATTRB=(ASKIP,NORM),               C00197**2
               COLOR=BLUE                                               00198**2
*                                                                       00199**2
ASEL08  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00200**2
               HILIGHT=UNDERLINE,                                      C00201**2
               COLOR=GREEN                                              00202**2
        DFHMDF POS=(12,03),LENGTH=01,ATTRB=(ASKIP)                      00203**2
AIMNE08 DFHMDF POS=(12,05),LENGTH=08,ATTRB=(ASKIP,NORM),               C00204**2
               COLOR=BLUE                                               00205**2
        DFHMDF POS=(12,14),LENGTH=01,ATTRB=(ASKIP)                      00206**2
AISEQ08 DFHMDF POS=(12,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00207**2
               COLOR=BLUE,                                             C00208**2
               PICOUT='Z(4)'                                            00209**2
        DFHMDF POS=(12,21),LENGTH=01,ATTRB=(ASKIP,DRK)                  00210**2
AFRMT08 DFHMDF POS=(12,23),LENGTH=01,ATTRB=(ASKIP,NORM),               C00211**2
               COLOR=BLUE                                               00212**2
AITTL08 DFHMDF POS=(12,25),LENGTH=30,ATTRB=(ASKIP,NORM),               C00213**2
               COLOR=BLUE                                               00214**2
AIPRG08 DFHMDF POS=(12,56),LENGTH=08,ATTRB=(ASKIP,NORM),               C00215**2
               COLOR=BLUE                                               00216**2
ARSLT08 DFHMDF POS=(12,65),LENGTH=14,ATTRB=(ASKIP,NORM),               C00217**2
               COLOR=BLUE                                               00218**2
*                                                                       00219**2
ASEL09  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00220**2
               HILIGHT=UNDERLINE,                                      C00221**2
               COLOR=GREEN                                              00222**2
        DFHMDF POS=(13,03),LENGTH=01,ATTRB=(ASKIP)                      00223**2
AIMNE09 DFHMDF POS=(13,05),LENGTH=08,ATTRB=(ASKIP,NORM),               C00224**2
               COLOR=BLUE                                               00225**2
        DFHMDF POS=(13,14),LENGTH=01,ATTRB=(ASKIP)                      00226**2
AISEQ09 DFHMDF POS=(13,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00227**2
               COLOR=BLUE,                                             C00228**2
               PICOUT='Z(4)'                                            00229**2
        DFHMDF POS=(13,21),LENGTH=01,ATTRB=(ASKIP,DRK)                  00230**2
AFRMT09 DFHMDF POS=(13,23),LENGTH=01,ATTRB=(ASKIP,NORM),               C00231**2
               COLOR=BLUE                                               00232**2
AITTL09 DFHMDF POS=(13,25),LENGTH=30,ATTRB=(ASKIP,NORM),               C00233**2
               COLOR=BLUE                                               00234**2
AIPRG09 DFHMDF POS=(13,56),LENGTH=08,ATTRB=(ASKIP,NORM),               C00235**2
               COLOR=BLUE                                               00236**2
ARSLT09 DFHMDF POS=(13,65),LENGTH=14,ATTRB=(ASKIP,NORM),               C00237**2
               COLOR=BLUE                                               00238**3
*                                                                       00239**2
ASEL10  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00240**2
               HILIGHT=UNDERLINE,                                      C00241**2
               COLOR=GREEN                                              00242**2
        DFHMDF POS=(14,03),LENGTH=01,ATTRB=(ASKIP)                      00243**2
AIMNE10 DFHMDF POS=(14,05),LENGTH=08,ATTRB=(ASKIP,NORM),               C00244**2
               COLOR=BLUE                                               00245**2
        DFHMDF POS=(14,14),LENGTH=01,ATTRB=(ASKIP)                      00246**2
AISEQ10 DFHMDF POS=(14,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00247**2
               COLOR=BLUE,                                             C00248**2
               PICOUT='Z(4)'                                            00249**2
        DFHMDF POS=(14,21),LENGTH=01,ATTRB=(ASKIP,DRK)                  00250**2
AFRMT10 DFHMDF POS=(14,23),LENGTH=01,ATTRB=(ASKIP,NORM),               C00251**2
               COLOR=BLUE                                               00252**2
AITTL10 DFHMDF POS=(14,25),LENGTH=30,ATTRB=(ASKIP,NORM),               C00253**2
               COLOR=BLUE                                               00254**2
AIPRG10 DFHMDF POS=(14,56),LENGTH=08,ATTRB=(ASKIP,NORM),               C00255**2
               COLOR=BLUE                                               00256**2
ARSLT10 DFHMDF POS=(14,65),LENGTH=14,ATTRB=(ASKIP,NORM),               C00257**2
               COLOR=BLUE                                               00258**2
*                                                                       00259**2
ASEL11  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00260**2
               HILIGHT=UNDERLINE,                                      C00261**2
               COLOR=GREEN                                              00262**2
        DFHMDF POS=(15,03),LENGTH=01,ATTRB=(ASKIP)                      00263**2
AIMNE11 DFHMDF POS=(15,05),LENGTH=08,ATTRB=(ASKIP,NORM),               C00264**2
               COLOR=BLUE                                               00265**2
        DFHMDF POS=(15,14),LENGTH=01,ATTRB=(ASKIP)                      00266**2
AISEQ11 DFHMDF POS=(15,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00267**2
               COLOR=BLUE,                                             C00268**2
               PICOUT='Z(4)'                                            00269**2
        DFHMDF POS=(15,21),LENGTH=01,ATTRB=(ASKIP,DRK)                  00270**2
AFRMT11 DFHMDF POS=(15,23),LENGTH=01,ATTRB=(ASKIP,NORM),               C00271**2
               COLOR=BLUE                                               00272**2
AITTL11 DFHMDF POS=(15,25),LENGTH=30,ATTRB=(ASKIP,NORM),               C00273**2
               COLOR=BLUE                                               00274**2
AIPRG11 DFHMDF POS=(15,56),LENGTH=08,ATTRB=(ASKIP,NORM),               C00275**2
               COLOR=BLUE                                               00276**2
ARSLT11 DFHMDF POS=(15,65),LENGTH=14,ATTRB=(ASKIP,NORM),               C00277**2
               COLOR=BLUE                                               00278**2
*                                                                       00279**2
ASEL12  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00280**2
               HILIGHT=UNDERLINE,                                      C00281**2
               COLOR=GREEN                                              00282**2
        DFHMDF POS=(16,03),LENGTH=01,ATTRB=(ASKIP)                      00283**2
AIMNE12 DFHMDF POS=(16,05),LENGTH=08,ATTRB=(ASKIP,NORM),               C00284**2
               COLOR=BLUE                                               00285**2
        DFHMDF POS=(16,14),LENGTH=01,ATTRB=(ASKIP)                      00286**2
AISEQ12 DFHMDF POS=(16,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00287**2
               COLOR=BLUE,                                             C00288**2
               PICOUT='Z(4)'                                            00289**2
        DFHMDF POS=(16,21),LENGTH=01,ATTRB=(ASKIP,DRK)                  00290**2
AFRMT12 DFHMDF POS=(16,23),LENGTH=01,ATTRB=(ASKIP,NORM),               C00291**2
               COLOR=BLUE                                               00292**2
AITTL12 DFHMDF POS=(16,25),LENGTH=30,ATTRB=(ASKIP,NORM),               C00293**2
               COLOR=BLUE                                               00294**2
AIPRG12 DFHMDF POS=(16,56),LENGTH=08,ATTRB=(ASKIP,NORM),               C00295**2
               COLOR=BLUE                                               00296**2
ARSLT12 DFHMDF POS=(16,65),LENGTH=14,ATTRB=(ASKIP,NORM),               C00297**2
               COLOR=BLUE                                               00298**2
*                                                                       00299**2
ASEL13  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00300**2
               HILIGHT=UNDERLINE,                                      C00301**2
               COLOR=GREEN                                              00302**2
        DFHMDF POS=(17,03),LENGTH=01,ATTRB=(ASKIP)                      00303**2
AIMNE13 DFHMDF POS=(17,05),LENGTH=08,ATTRB=(ASKIP,NORM),               C00304**2
               COLOR=BLUE                                               00305**2
        DFHMDF POS=(17,14),LENGTH=01,ATTRB=(ASKIP)                      00306**2
AISEQ13 DFHMDF POS=(17,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00307**2
               COLOR=BLUE,                                             C00308**2
               PICOUT='Z(4)'                                            00309**2
        DFHMDF POS=(17,21),LENGTH=01,ATTRB=(ASKIP,DRK)                  00310**2
AFRMT13 DFHMDF POS=(17,23),LENGTH=01,ATTRB=(ASKIP,NORM),               C00311**2
               COLOR=BLUE                                               00312**2
AITTL13 DFHMDF POS=(17,25),LENGTH=30,ATTRB=(ASKIP,NORM),               C00313**2
               COLOR=BLUE                                               00314**2
AIPRG13 DFHMDF POS=(17,56),LENGTH=08,ATTRB=(ASKIP,NORM),               C00315**2
               COLOR=BLUE                                               00316**2
ARSLT13 DFHMDF POS=(17,65),LENGTH=14,ATTRB=(ASKIP,NORM),               C00317**2
               COLOR=BLUE                                               00318**3
*                                                                       00319**2
ASEL14  DFHMDF POS=(18,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00320**2
               HILIGHT=UNDERLINE,                                      C00321**2
               COLOR=GREEN                                              00322**2
        DFHMDF POS=(18,03),LENGTH=01,ATTRB=(ASKIP)                      00323**2
AIMNE14 DFHMDF POS=(18,05),LENGTH=08,ATTRB=(ASKIP,NORM),               C00324**2
               COLOR=BLUE                                               00325**2
        DFHMDF POS=(18,14),LENGTH=01,ATTRB=(ASKIP)                      00326**2
AISEQ14 DFHMDF POS=(18,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00327**2
               COLOR=BLUE,                                             C00328**2
               PICOUT='Z(4)'                                            00329**2
        DFHMDF POS=(18,21),LENGTH=01,ATTRB=(ASKIP,DRK)                  00330**2
AFRMT14 DFHMDF POS=(18,23),LENGTH=01,ATTRB=(ASKIP,NORM),               C00331**2
               COLOR=BLUE                                               00332**2
AITTL14 DFHMDF POS=(18,25),LENGTH=30,ATTRB=(ASKIP,NORM),               C00333**2
               COLOR=BLUE                                               00334**2
AIPRG14 DFHMDF POS=(18,56),LENGTH=08,ATTRB=(ASKIP,NORM),               C00335**2
               COLOR=BLUE                                               00336**2
ARSLT14 DFHMDF POS=(18,65),LENGTH=14,ATTRB=(ASKIP,NORM),               C00337**2
               COLOR=BLUE                                               00338**2
*                                                                       00339**2
ASEL15  DFHMDF POS=(19,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00340**2
               HILIGHT=UNDERLINE,                                      C00341**2
               COLOR=GREEN                                              00342**2
        DFHMDF POS=(19,03),LENGTH=01,ATTRB=(ASKIP)                      00343**2
AIMNE15 DFHMDF POS=(19,05),LENGTH=08,ATTRB=(ASKIP,NORM),               C00344**2
               COLOR=BLUE                                               00345**2
        DFHMDF POS=(19,14),LENGTH=01,ATTRB=(ASKIP)                      00346**2
AISEQ15 DFHMDF POS=(19,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00347**2
               COLOR=BLUE,                                             C00348**2
               PICOUT='Z(4)'                                            00349**2
        DFHMDF POS=(19,21),LENGTH=01,ATTRB=(ASKIP,DRK)                  00350**2
AFRMT15 DFHMDF POS=(19,23),LENGTH=01,ATTRB=(ASKIP,NORM),               C00351**2
               COLOR=BLUE                                               00352**2
AITTL15 DFHMDF POS=(19,25),LENGTH=30,ATTRB=(ASKIP,NORM),               C00353**2
               COLOR=BLUE                                               00354**2
AIPRG15 DFHMDF POS=(19,56),LENGTH=08,ATTRB=(ASKIP,NORM),               C00355**2
               COLOR=BLUE                                               00356**2
ARSLT15 DFHMDF POS=(19,65),LENGTH=14,ATTRB=(ASKIP,NORM),               C00357**2
               COLOR=BLUE                                               00358**2
*                                                                       00359**2
**************                                                          00383   
        DFHMSD TYPE=FINAL                                               00384   
**************                                                          00385   
        END                                                             00386   
