*          DATA SET DPKM205    AT LEVEL 020 AS OF 04/01/93                      
*          DATA SET DPKM205A1  AT LEVEL 001 AS OF 03/18/93              00001**2
*                                                                       00002**2
*********************************************************************** 00003**2
*       MAPSET  DPKM205                                                 00004**2
*       MAP     DP205A                                                  00005**2
*       PROGRAM DPKCS205 - COMMAND LEVEL SIGN ON PROGRAM                00006**2
*       TRANSID Z205                                                    00007**2
*       SYSTEM  CICS                                                    00008**2
*********************************************************************** 00009**2
        PRINT  NOGEN                                                    00010**2
DPKM205 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES,             C00011**2
               CTRL=(FREEKB)                                            00012**2
DP205A  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),                   C00013**2
               DSATTS=(COLOR,HILIGHT)                                   00014**2
ADATE   DFHMDF POS=(1,02),LENGTH=10,ATTRB=(PROT,NORM),COLOR=BLUE        00015**8
ANETNAM DFHMDF POS=(1,67),LENGTH=08,ATTRB=(PROT,NORM),COLOR=BLUE        00016*10
ATIME   DFHMDF POS=(2,02),LENGTH=08,ATTRB=(PROT,NORM),COLOR=BLUE        00017**8
ASYSTEM DFHMDF POS=(2,67),LENGTH=08,ATTRB=(PROT,NORM),COLOR=BLUE        00018*10
ATITLE1 DFHMDF POS=(3,19),LENGTH=43,ATTRB=(PROT,BRT),COLOR=TURQUOISE,  C00019**8
               INITIAL='K O H L S  D E P A R T M E N T  S T O R E S'    00020**3
ATITLE2 DFHMDF POS=(4,33),LENGTH=14,ATTRB=(PROT,NORM),COLOR=TURQUOISE, C00021**9
               INITIAL='SYSTEM SIGN-ON'                                 00022**3
*                                                                       00023**2
        DFHMDF POS=(10,18),LENGTH=07,                                  C00024**3
               INITIAL='USERID:',                                      C00025**3
               ATTRB=(PROT,NORM),COLOR=TURQUOISE                        00026**8
AUSERID DFHMDF POS=(10,26),LENGTH=07,ATTRB=(UNPROT,BRT),               C00027**6
               COLOR=NEUTRAL                                            00028**3
        DFHMDF POS=(10,34),LENGTH=01,ATTRB=(ASKIP)                      00029**4
        DFHMDF POS=(12,18),LENGTH=09,                                  C00030**4
               INITIAL='PASSWORD:',                                    C00031**4
               ATTRB=(PROT,NORM),COLOR=TURQUOISE                        00032**8
APSSWRD DFHMDF POS=(12,28),LENGTH=08,ATTRB=(UNPROT,DRK),               C00033*13
               COLOR=NEUTRAL                                            00034**3
        DFHMDF POS=(12,37),LENGTH=01,ATTRB=(ASKIP)                      00035**5
        DFHMDF POS=(14,16),LENGTH=34,                                  C00036**4
               INITIAL='* KEY IN THE ABOVE INFORMATION AND',           C00037**4
               ATTRB=(PROT,NORM),COLOR=BLUE                             00038**8
        DFHMDF POS=(15,16),LENGTH=36,                                  C00039**4
               INITIAL='  PRESS ENTER TO SIGN ON TO CICS/ESA',         C00040**4
               ATTRB=(PROT,NORM),COLOR=BLUE                             00041**8
        DFHMDF POS=(16,16),LENGTH=36,                                  C00042**4
               INITIAL='             OR                     ',         C00043**4
               ATTRB=(PROT,NORM),COLOR=BLUE                             00044**8
        DFHMDF POS=(17,16),LENGTH=36,                                  C00045**4
               INITIAL='* PRESS PF3 TO RETURN TO VTAM       ',         C00046**4
               ATTRB=(PROT,NORM),COLOR=BLUE                             00047**8
AMESSGE DFHMDF POS=(24,02),LENGTH=70,ATTRB=(PROT,BRT),                 C00048*17
               COLOR=RED                                                00049*16
DP205B  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),                   C00050*11
               DSATTS=(COLOR,HILIGHT)                                   00051*11
BDATE   DFHMDF POS=(1,02),LENGTH=10,ATTRB=(PROT,NORM),COLOR=BLUE        00052*11
BNETNAM DFHMDF POS=(1,67),LENGTH=08,ATTRB=(PROT,NORM),COLOR=BLUE        00053*11
BTIME   DFHMDF POS=(2,02),LENGTH=08,ATTRB=(PROT,NORM),COLOR=BLUE        00054*11
BSYSTEM DFHMDF POS=(2,67),LENGTH=08,ATTRB=(PROT,NORM),COLOR=BLUE        00055*11
BTITLE1 DFHMDF POS=(3,19),LENGTH=43,ATTRB=(PROT,BRT),COLOR=RED,        C00056*11
               INITIAL='YOUR PASSWORD HAS EXPIRED                  '    00057*11
BTITLE2 DFHMDF POS=(4,19),LENGTH=31,ATTRB=(PROT,NORM),COLOR=RED,       C00058*12
               INITIAL='PLEASE ENTER NEW PASSWORD TWICE'                00059*11
*                                                                       00060*11
        DFHMDF POS=(10,18),LENGTH=13,                                  C00061*11
               INITIAL='NEW PASSWORD:',                                C00062*11
               ATTRB=(PROT,NORM),COLOR=TURQUOISE                        00063*11
BNEWPW1 DFHMDF POS=(10,32),LENGTH=08,ATTRB=(UNPROT,DRK),               C00064*14
               COLOR=NEUTRAL                                            00065*11
        DFHMDF POS=(10,41),LENGTH=01,ATTRB=(ASKIP)                      00066*14
        DFHMDF POS=(12,18),LENGTH=10,                                  C00067*18
               INITIAL='AND AGAIN:',                                   C00068*12
               ATTRB=(PROT,NORM),COLOR=TURQUOISE                        00069*11
BNEWPW2 DFHMDF POS=(12,32),LENGTH=08,ATTRB=(UNPROT,DRK),               C00070*13
               COLOR=NEUTRAL                                            00071*11
        DFHMDF POS=(12,41),LENGTH=01,ATTRB=(ASKIP)                      00072*15
        DFHMDF POS=(14,16),LENGTH=34,                                  C00073*20
               INITIAL='* KEY IN THE ABOVE INFORMATION AND',           C00074*20
               ATTRB=(PROT,NORM),COLOR=BLUE                             00075*20
        DFHMDF POS=(15,16),LENGTH=36,                                  C00076*20
               INITIAL='  PRESS ENTER TO SIGN ON TO CICS/ESA',         C00077*20
               ATTRB=(PROT,NORM),COLOR=BLUE                             00078*20
        DFHMDF POS=(16,16),LENGTH=36,                                  C00079*20
               INITIAL='             OR                     ',         C00080*20
               ATTRB=(PROT,NORM),COLOR=BLUE                             00081*20
        DFHMDF POS=(17,16),LENGTH=36,                                  C00082*20
               INITIAL='* PRESS PF3 TO RETURN TO VTAM       ',         C00083*20
               ATTRB=(PROT,NORM),COLOR=BLUE                             00084*20
BMESSGE DFHMDF POS=(24,02),LENGTH=70,ATTRB=(PROT,BRT),                 C00085*17
               COLOR=RED                                                00086*16
        DFHMSD TYPE=FINAL                                               00087**4
        PRINT NOGEN                                                     00088**4
        END                                                             00089**4
