  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  DPKM056                                            *   00005   
*        MAP     DP056A                                             *   00006   
*        PROGRAM DPKCS056                                           *   00007   
*        TRANSID Z056 - CRITERIA SPEC FOR MNEMONIC/MENUITEM LOG     *   00008   
*        SYSTEM  CICS ARCHITECTURE                                  *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
DPKM056 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
DP056A  DFHMDI LINE=2,COLUMN=1,                                        X00016**4
               SIZE=(19,80),                                           X00017**2
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00041   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00042   
               INITIAL='ENTER A MNEMONIC OR LEAVE BLANK TO BROWSE ALL MX00043   
               MNEMONICS (IN DATE ORDER)',                             X00043   
               LENGTH=72,                                              X00044   
               COLOR=NEUTRAL,                                          X00045   
               POS=(03,02)                                              00046   
*                                                                       00047   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00048   
               INITIAL='MNEMONIC................:',                    X00049   
               LENGTH=25,                                              X00050   
               COLOR=NEUTRAL,                                          X00051   
               POS=(05,22)                                              00052   
AMNEM   DFHMDF ATTRB=(UNPROT,NORM),                                    X00053   
               LENGTH=8,                                               X00054   
               COLOR=GREEN,                                            X00055   
               HILIGHT=UNDERLINE,                                      X00056   
               POS=(05,48)                                              00057   
        DFHMDF ATTRB=(ASKIP),                                          X00058   
               LENGTH=1,                                               X00059   
               COLOR=NEUTRAL,                                          X00060   
               POS=(05,57)                                              00061   
*                                                                       00068**2
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00069**2
               LENGTH=1,                                               X00070**2
               COLOR=NEUTRAL,                                          X00071**2
               POS=(07,59)                                              00072**2
*                                                                       00062   
         DFHMSD TYPE=FINAL                                              00161   
         END                                                            00162   
