*          DATA SET DPKM030    AT LEVEL 007 AS OF 01/15/93                      
**********************************************************************  00001**3
*       THIS IS THE MAPSET FOR THE CICS ARCHITECTURE APPLICATION     *  00002**3
*  PROGRAM INTERFACE MODULE DPKCS030.  THIS MAP CONTAINS ONLY THE    *  00003**3
*  HEADER AND TRAILER LINES FOR THE APPLICATION PROGRAMS.            *  00004**3
*                                                                    *  00005**3
*                                                                    *  00006**3
*                                                                    *  00007**3
*                                                                    *  00008**3
*                                                                    *  00009**3
*       THE FIRST BYTE OF THE MAP IS LEFT BLANK FOR THE FORMFEED     *  00010**3
*  CHARACTER.                                                        *  00011**3
**********************************************************************  00012**3
        PRINT NOGEN                                                     00013   
DPKM030 DFHMSD TYPE=MAP,                                               X00014   
               MODE=INOUT,                                             X00015   
               LANG=COBOL,                                             X00016   
               STORAGE=AUTO,                                           X00017**5
               TIOAPFX=YES                                              00018   
DP030A  DFHMDI SIZE=(01,80),                                           X00019   
               CTRL=FREEKB,                                            X00020   
               LINE=1,                                                 X00021   
               COLUMN=1,                                               X00022   
               MAPATTS=(COLOR,HILIGHT),                                X00023   
               DSATTS=(COLOR,HILIGHT)                                   00024   
ADATE   DFHMDF POS=(1,2),                                              X00025   
               LENGTH=10,                                              X00026   
               ATTRB=(ASKIP,BRT),                                      X00027   
               COLOR=NEUTRAL                                            00028   
ATIME   DFHMDF POS=(1,14),                                             X00029   
               LENGTH=8,                                               X00030   
               ATTRB=(ASKIP,BRT),                                      X00031   
               COLOR=NEUTRAL                                            00032   
ATITLE  DFHMDF POS=(1,25),                                             X00033   
               LENGTH=30,                                              X00034   
               ATTRB=(ASKIP,BRT),                                      X00035   
               COLOR=NEUTRAL                                            00036   
ANETNAM DFHMDF POS=(1,61),                                             X00037   
               LENGTH=8,                                               X00038   
               ATTRB=(ASKIP,BRT),                                      X00039   
               COLOR=NEUTRAL                                            00040   
AMNEMIC DFHMDF POS=(1,71),                                             X00041   
               LENGTH=8,                                               X00042   
               ATTRB=(ASKIP,BRT),                                      X00043   
               COLOR=NEUTRAL                                            00044   
*                                                                       00045   
*                                                                       00046   
*                                                                       00047   
DP030B  DFHMDI SIZE=(04,80),                                           X00048**3
               CTRL=FREEKB,                                            X00049   
               LINE=21,                                                X00050   
               COLUMN=1,                                               X00051   
               MAPATTS=(COLOR,HILIGHT),                                X00052   
               DSATTS=(COLOR,HILIGHT)                                   00053   
BMSG    DFHMDF POS=(01,1),                                             X00054**4
               LENGTH=78,                                              X00055   
               ATTRB=(ASKIP,BRT),                                      X00056   
               COLOR=NEUTRAL                                            00057   
        DFHMDF POS=(02,1),                                             X00058**2
               LENGTH=11,                                              X00059   
               ATTRB=(ASKIP,BRT),                                      X00060   
               COLOR=NEUTRAL,                                          X00061   
               INITIAL='COMMAND ==>'                                    00062   
BNAVCMD DFHMDF POS=(02,13),                                            X00063**4
               LENGTH=8,                                               X00064   
               ATTRB=UNPROT,                                           X00065   
               HILIGHT=UNDERLINE,                                      X00066   
               COLOR=GREEN                                              00067   
        DFHMDF POS=(02,22),                                            X00068**2
               LENGTH=1,                                               X00069   
               ATTRB=ASKIP                                              00070   
        DFHMDF POS=(02,24),                                            X00071**2
               LENGTH=7,                                               X00072   
               ATTRB=(ASKIP,BRT),                                      X00073   
               COLOR=NEUTRAL,                                          X00074   
               INITIAL='KEY ==>'                                        00075   
BNAVKEY DFHMDF POS=(02,32),                                            X00076**4
               LENGTH=25,                                              X00077   
               ATTRB=UNPROT,                                           X00078   
               HILIGHT=UNDERLINE,                                      X00079   
               COLOR=GREEN                                              00080   
BDUMMY  DFHMDF POS=(02,58),                                            X00081**7
               LENGTH=1,                                               X00082**6
               INITIAL=' ',                                            X00083**6
               ATTRB=(ASKIP,DRK,FSET)                                   00084**6
        DFHMDF POS=(02,63),                                            X00085**2
               LENGTH=16,                                              X00086   
               ATTRB=(ASKIP,BRT),                                      X00087   
               COLOR=NEUTRAL,                                          X00088   
               INITIAL='PA2=OTHER F KEYS'                               00089   
BFKLIN1 DFHMDF POS=(03,1),                                             X00090**4
               LENGTH=78,                                              X00091   
               ATTRB=(ASKIP,BRT),                                      X00092   
               COLOR=NEUTRAL                                            00093   
BFKLIN2 DFHMDF POS=(04,1),                                             X00094**4
               LENGTH=78,                                              X00095   
               ATTRB=(ASKIP,BRT),                                      X00096   
               COLOR=NEUTRAL                                            00097   
        DFHMSD TYPE=FINAL                                               00098   
        END                                                             00099   
