*          DATA SET DPKM021    AT LEVEL 001 AS OF 07/07/92                      
        PRINT  NOGEN                                                    00001   
DPKM021 DFHMSD TYPE=DSECT,                                             C00002   
               LANG=COBOL,                                             C00003   
               MODE=INOUT,                                             C00004   
               STORAGE=AUTO,                                           C00005   
               TERM=3270-2,                                            C00006   
               TIOAPFX=YES                                              00007   
**************                                                          00008   
DP021A  DFHMDI SIZE=(24,80),                                           C00009   
               CTRL=FREEKB,                                            C00010   
               MAPATTS=(COLOR,HILIGHT),                                C00011   
               DSATTS=(COLOR,HILIGHT)                                   00012   
**************                                                          00013   
ADATE   DFHMDF POS=(01,02),LENGTH=10,ATTRB=(ASKIP,NORM),               C00014   
               COLOR=NEUTRAL                                            00015   
ATIME   DFHMDF POS=(01,14),LENGTH=08,ATTRB=(ASKIP,NORM),               C00016   
               COLOR=NEUTRAL                                            00017   
ATITLE  DFHMDF POS=(01,25),LENGTH=30,ATTRB=(ASKIP,BRT),                C00018   
               COLOR=NEUTRAL                                            00019   
ANETNAM DFHMDF POS=(01,61),LENGTH=08,ATTRB=(ASKIP,NORM),               C00020   
               COLOR=NEUTRAL                                            00021   
AMNEMIC DFHMDF POS=(01,71),LENGTH=08,ATTRB=(ASKIP,NORM),               C00022   
               COLOR=NEUTRAL                                            00023   
*                                                                       00024   
        DFHMDF POS=(03,17),LENGTH=05,ATTRB=(PROT,NORM),                C00025   
               COLOR=NEUTRAL,                                          C00026   
               INITIAL='MENU:'                                          00027   
AMNUNAM DFHMDF POS=(03,23),LENGTH=08,ATTRB=(ASKIP,NORM),               C00028   
               COLOR=BLUE                                               00029   
AMNUTTL DFHMDF POS=(03,32),LENGTH=30,ATTRB=(ASKIP,NORM),               C00030   
               COLOR=BLUE                                               00031   
*                                                                       00032   
        DFHMDF POS=(05,01),LENGTH=70,ATTRB=(ASKIP,BRT),                C00033   
               COLOR=NEUTRAL,                                          C00034   
               INITIAL='ENTER THE CHANGES BELOW AND PRESS F15 TO UPDATEC00035   
                THIS ITEM        '                                      00036   
*                                                                       00037   
        DFHMDF POS=(07,17),LENGTH=18,ATTRB=(PROT,NORM),                C00038   
               COLOR=NEUTRAL,                                          C00039   
               INITIAL='MNEMONIC.........:'                             00040   
AMNEMON DFHMDF POS=(07,36),LENGTH=08,ATTRB=(ASKIP,NORM),               C00041   
               COLOR=BLUE,                                              00042   
*                                                                       00043   
        DFHMDF POS=(09,17),LENGTH=18,ATTRB=(PROT,NORM),                C00044   
               COLOR=NEUTRAL,                                          C00045   
               INITIAL='PANEL TITLE......:'                             00046   
APANEL  DFHMDF POS=(09,36),LENGTH=30,ATTRB=(ASKIP,NORM),               C00047   
               COLOR=BLUE                                               00048   
*                                                                       00049   
        DFHMDF POS=(11,17),LENGTH=18,ATTRB=(PROT,NORM),                C00050   
               COLOR=NEUTRAL,                                          C00051   
               INITIAL='TRANSACTION ID...:'                             00052   
ATRANID DFHMDF POS=(11,36),LENGTH=04,ATTRB=(ASKIP,NORM),               C00053   
               COLOR=BLUE                                               00054   
*                                                                       00055   
        DFHMDF POS=(13,17),LENGTH=18,ATTRB=(PROT,NORM),                C00056   
               COLOR=NEUTRAL,                                          C00057   
               INITIAL='SEQUENCE.........:'                             00058   
ASEQNUM DFHMDF POS=(13,36),LENGTH=04,ATTRB=(NUM,UNPROT,NORM),          C00059   
               COLOR=GREEN,HILIGHT=UNDERLINE,                          C00060   
               PICOUT='ZZZ9'                                            00061   
        DFHMDF POS=(13,41),LENGTH=01,ATTRB=(ASKIP)                      00062   
*                                                                       00063   
        DFHMDF POS=(15,17),LENGTH=18,ATTRB=(PROT,NORM),                C00064   
               COLOR=NEUTRAL,                                          C00065   
               INITIAL='INTER-APPL FORMAT:'                             00066   
AFORMAT DFHMDF POS=(15,36),LENGTH=01,ATTRB=(UNPROT,NORM),              C00067   
               COLOR=GREEN,HILIGHT=UNDERLINE                            00068   
        DFHMDF POS=(15,38),LENGTH=01,ATTRB=(ASKIP)                      00069   
*                                                                       00070   
        DFHMDF POS=(17,17),LENGTH=18,ATTRB=(PROT,NORM),                C00071   
               COLOR=NEUTRAL,                                          C00072   
               INITIAL='MENU DESCRIPTION.:'                             00073   
ATITTLE DFHMDF POS=(17,36),LENGTH=30,ATTRB=(UNPROT,NORM),              C00074   
               COLOR=GREEN,HILIGHT=UNDERLINE                            00075   
        DFHMDF POS=(17,67),LENGTH=01,ATTRB=(ASKIP)                      00076   
*                                                                       00077   
AMSG    DFHMDF POS=(21,01),LENGTH=78,ATTRB=(ASKIP,BRT),                C00078   
               COLOR=RED                                                00079   
        DFHMDF POS=(22,01),LENGTH=11,ATTRB=(PROT,BRT),                 C00080   
               COLOR=NEUTRAL,                                          C00081   
               INITIAL='COMMAND===>'                                    00082   
ANAVCMD DFHMDF POS=(22,14),LENGTH=08,ATTRB=(UNPROT,NORM,FSET),         C00083   
               COLOR=GREEN,                                            C00084   
               HILIGHT=UNDERLINE                                        00085   
        DFHMDF POS=(22,23),LENGTH=01,ATTRB=(ASKIP)                      00086   
        DFHMDF POS=(22,25),LENGTH=07,ATTRB=(PROT,BRT),                 C00087   
               COLOR=NEUTRAL,                                          C00088   
               INITIAL='KEY===>'                                        00089   
ANAVKEY DFHMDF POS=(22,33),LENGTH=25,ATTRB=(UNPROT,NORM,FSET),         C00090   
               COLOR=GREEN,                                            C00091   
               HILIGHT=UNDERLINE                                        00092   
        DFHMDF POS=(22,59),LENGTH=01,ATTRB=(ASKIP)                      00093   
        DFHMDF POS=(22,63),LENGTH=16,ATTRB=(PROT,NORM),                C00094   
               COLOR=NEUTRAL,                                          C00095   
               INITIAL='PA2=OTHER F KEYS'                               00096   
AFKLIN1 DFHMDF POS=(23,01),LENGTH=78,ATTRB=(ASKIP,NORM),               C00097   
               COLOR=NEUTRAL                                            00098   
AFKLIN2 DFHMDF POS=(24,01),LENGTH=78,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=NEUTRAL                                            00100   
**************                                                          00101   
        DFHMSD TYPE=FINAL                                               00102   
**************                                                          00103   
        END                                                             00104   
*                                                                       00105   
                                                                        00106   
