*          DATA SET DPKM009    AT LEVEL 001 AS OF 07/07/92                      
        PRINT  NOGEN                                                            
DPKM009 DFHMSD LANG=COBOL,                                             -        
               MODE=INOUT,                                             -        
               STORAGE=AUTO,                                           -        
               TERM=3270-2,                                            -        
               TIOAPFX=YES,                                            -        
               TYPE=&&SYSPARM                                                   
**************                                                                  
DP009A  DFHMDI CTRL=(FREEKB),                                          -        
               DSATTS=(COLOR,HILIGHT),                                 -        
               MAPATTS=(COLOR,HILIGHT),                                -        
               SIZE=(24,80)                                                     
**************                                                                  
ADATE   DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=10,                                              -        
               POS=(1,2)                                                        
ATIME   DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=8,                                               -        
               POS=(1,14)                                                       
ATITLE  DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=30,                                              -        
               POS=(1,25)                                                       
ANETNAM DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=8,                                               -        
               POS=(1,61)                                                       
AMNEMIC DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=8,                                               -        
               POS=(1,71)                                                       
AOBJECT DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=10,                                              -        
               POS=(3,39)                                                       
ASTRTIT DFHMDF ATTRB=(IC,NORM,NUM,UNPROT),                             -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=5,                                               -        
               PICOUT='ZZZZ9',                                         -        
               POS=(3,52)                                                       
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=2,                                               -        
               POS=(3,58),                                             -        
               INITIAL='TO'                                                     
AENDIT  DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -        
               COLOR=BLUE,                                             -        
               LENGTH=5,                                               -        
               PICOUT='ZZZZ9',                                         -        
               POS=(3,62)                                                       
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=2,                                               -        
               POS=(3,69),                                             -        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=5,                                               -        
               PICOUT='ZZZZ9',                                         -        
               POS=(3,73)                                                       
*                                                                               
        DFHMDF ATTRB=(NORM,PROT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=3,                                               -        
               POS=(5,1),                                              -        
               INITIAL='SEL'                                                    
        DFHMDF ATTRB=(NORM,PROT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=3,                                               -        
               POS=(5,6),                                              -        
               INITIAL='ACT'                                                    
        DFHMDF ATTRB=(NORM,PROT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=8,                                               -        
               POS=(5,11),                                             -        
               INITIAL='MNEMONIC'                                               
        DFHMDF ATTRB=(NORM,PROT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=7,                                               -        
               POS=(5,21),                                             -        
               INITIAL='PROGRAM'                                                
        DFHMDF ATTRB=(NORM,PROT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=4,                                               -        
               POS=(5,31),                                             -        
               INITIAL='TRAN'                                                   
        DFHMDF ATTRB=(NORM,PROT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=3,                                               -        
               POS=(5,37),                                             -        
               INITIAL='PKG'                                                    
        DFHMDF ATTRB=(NORM,PROT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=11,                                              -        
               POS=(5,42),                                             -        
               INITIAL='PANEL TITLE'                                            
        DFHMDF ATTRB=(NORM,PROT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=3,                                               -        
               POS=(5,73),                                             -        
               INITIAL='UPD'                                                    
        DFHMDF ATTRB=(NORM,PROT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=3,                                               -        
               POS=(5,77),                                             -        
               INITIAL='LOC'                                                    
*                                                                               
ASEL01  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(6,2)                                                        
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(6,4)                                                        
AACT01  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=3,                                               -        
               POS=(6,6)                                                        
AMNEM01 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(6,11)                                                       
APROG01 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(6,21)                                                       
ATRAN01 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               POS=(6,31)                                                       
APKG01  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(6,38)                                                       
ATTLE01 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=30,                                              -        
               POS=(6,42)                                                       
AUPDV01 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(6,74)                                                       
ALOC01  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(6,78)                                                       
*                                                                               
ASEL02  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(7,2)                                                        
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(7,4)                                                        
AACT02  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=3,                                               -        
               POS=(7,6)                                                        
AMNEM02 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(7,11)                                                       
APROG02 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(7,21)                                                       
ATRAN02 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               POS=(7,31)                                                       
APKG02  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(7,38)                                                       
ATTLE02 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=30,                                              -        
               POS=(7,42)                                                       
AUPDV02 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(7,74)                                                       
ALOC02  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(7,78)                                                       
*                                                                               
ASEL03  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(8,2)                                                        
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(8,4)                                                        
AACT03  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=3,                                               -        
               POS=(8,6)                                                        
AMNEM03 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(8,11)                                                       
APROG03 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(8,21)                                                       
ATRAN03 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               POS=(8,31)                                                       
APKG03  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(8,38)                                                       
ATTLE03 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=30,                                              -        
               POS=(8,42)                                                       
AUPDV03 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(8,74)                                                       
ALOC03  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(8,78)                                                       
*                                                                               
ASEL04  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(9,2)                                                        
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(9,4)                                                        
AACT04  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=3,                                               -        
               POS=(9,6)                                                        
AMNEM04 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(9,11)                                                       
APROG04 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(9,21)                                                       
ATRAN04 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               POS=(9,31)                                                       
APKG04  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(9,38)                                                       
ATTLE04 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=30,                                              -        
               POS=(9,42)                                                       
AUPDV04 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(9,74)                                                       
ALOC04  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(9,78)                                                       
*                                                                               
ASEL05  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(10,2)                                                       
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(10,4)                                                       
AACT05  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=3,                                               -        
               POS=(10,6)                                                       
AMNEM05 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(10,11)                                                      
APROG05 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(10,21)                                                      
ATRAN05 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               POS=(10,31)                                                      
APKG05  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(10,38)                                                      
ATTLE05 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=30,                                              -        
               POS=(10,42)                                                      
AUPDV05 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(10,74)                                                      
ALOC05  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(10,78)                                                      
*                                                                               
ASEL06  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(11,2)                                                       
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(11,4)                                                       
AACT06  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=3,                                               -        
               POS=(11,6)                                                       
AMNEM06 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(11,11)                                                      
APROG06 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(11,21)                                                      
ATRAN06 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               POS=(11,31)                                                      
APKG06  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(11,38)                                                      
ATTLE06 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=30,                                              -        
               POS=(11,42)                                                      
AUPDV06 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(11,74)                                                      
ALOC06  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(11,78)                                                      
*                                                                               
ASEL07  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(12,2)                                                       
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(12,4)                                                       
AACT07  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=3,                                               -        
               POS=(12,6)                                                       
AMNEM07 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(12,11)                                                      
APROG07 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(12,21)                                                      
ATRAN07 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               POS=(12,31)                                                      
APKG07  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(12,38)                                                      
ATTLE07 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=30,                                              -        
               POS=(12,42)                                                      
AUPDV07 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(12,74)                                                      
ALOC07  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(12,78)                                                      
*                                                                               
ASEL08  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(13,2)                                                       
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(13,4)                                                       
AACT08  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=3,                                               -        
               POS=(13,6)                                                       
AMNEM08 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(13,11)                                                      
APROG08 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(13,21)                                                      
ATRAN08 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               POS=(13,31)                                                      
APKG08  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(13,38)                                                      
ATTLE08 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=30,                                              -        
               POS=(13,42)                                                      
AUPDV08 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(13,74)                                                      
ALOC08  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(13,78)                                                      
*                                                                               
ASEL09  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(14,2)                                                       
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(14,4)                                                       
AACT09  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=3,                                               -        
               POS=(14,6)                                                       
AMNEM09 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(14,11)                                                      
APROG09 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(14,21)                                                      
ATRAN09 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               POS=(14,31)                                                      
APKG09  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(14,38)                                                      
ATTLE09 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=30,                                              -        
               POS=(14,42)                                                      
AUPDV09 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(14,74)                                                      
ALOC09  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(14,78)                                                      
*                                                                               
ASEL10  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(15,2)                                                       
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(15,4)                                                       
AACT10  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=3,                                               -        
               POS=(15,6)                                                       
AMNEM10 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(15,11)                                                      
APROG10 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(15,21)                                                      
ATRAN10 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               POS=(15,31)                                                      
APKG10  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(15,38)                                                      
ATTLE10 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=30,                                              -        
               POS=(15,42)                                                      
AUPDV10 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(15,74)                                                      
ALOC10  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(15,78)                                                      
*                                                                               
ASEL11  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(16,2)                                                       
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(16,4)                                                       
AACT11  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=3,                                               -        
               POS=(16,6)                                                       
AMNEM11 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(16,11)                                                      
APROG11 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(16,21)                                                      
ATRAN11 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               POS=(16,31)                                                      
APKG11  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(16,38)                                                      
ATTLE11 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=30,                                              -        
               POS=(16,42)                                                      
AUPDV11 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(16,74)                                                      
ALOC11  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(16,78)                                                      
*                                                                               
ASEL12  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(17,2)                                                       
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(17,4)                                                       
AACT12  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=3,                                               -        
               POS=(17,6)                                                       
AMNEM12 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(17,11)                                                      
APROG12 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(17,21)                                                      
ATRAN12 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               POS=(17,31)                                                      
APKG12  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(17,38)                                                      
ATTLE12 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=30,                                              -        
               POS=(17,42)                                                      
AUPDV12 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(17,74)                                                      
ALOC12  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(17,78)                                                      
*                                                                               
ASEL13  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(18,2)                                                       
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(18,4)                                                       
AACT13  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=3,                                               -        
               POS=(18,6)                                                       
AMNEM13 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(18,11)                                                      
APROG13 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(18,21)                                                      
ATRAN13 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               POS=(18,31)                                                      
APKG13  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(18,38)                                                      
ATTLE13 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=30,                                              -        
               POS=(18,42)                                                      
AUPDV13 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(18,74)                                                      
ALOC13  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(18,78)                                                      
*                                                                               
ASEL14  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(19,2)                                                       
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(19,4)                                                       
AACT14  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=3,                                               -        
               POS=(19,6)                                                       
AMNEM14 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(19,11)                                                      
APROG14 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(19,21)                                                      
ATRAN14 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               POS=(19,31)                                                      
APKG14  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(19,38)                                                      
ATTLE14 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=30,                                              -        
               POS=(19,42)                                                      
AUPDV14 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(19,74)                                                      
ALOC14  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(19,78)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=25,                                              -        
               POS=(20,40),                                            -        
               INITIAL='NUMBER OF SELECTED ITEMS:'                              
ASELIT  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=7,                                               -        
               PICOUT='ZZZ,ZZ9',                                       -        
               POS=(20,67)                                                      
*                                                                               
AMSG    DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=78,                                              -        
               POS=(21,1)                                                       
        DFHMDF ATTRB=(BRT,PROT),                                       -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=11,                                              -        
               POS=(22,1),                                             -        
               INITIAL='COMMAND===>'                                            
ANAVCMD DFHMDF ATTRB=(NORM,UNPROT),                                    -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=8,                                               -        
               POS=(22,14)                                                      
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(22,23)                                                      
        DFHMDF ATTRB=(BRT,PROT),                                       -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=7,                                               -        
               POS=(22,25),                                            -        
               INITIAL='KEY===>'                                                
ANAVKEY DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=25,                                              -        
               POS=(22,33)                                                      
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(22,59)                                                      
        DFHMDF ATTRB=(NORM,PROT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=16,                                              -        
               POS=(22,63),                                            -        
               INITIAL='PA2=OTHER F KEYS'                                       
AFKLIN1 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=78,                                              -        
               POS=(23,1)                                                       
AFKLIN2 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=78,                                              -        
               POS=(24,1)                                                       
**************                                                                  
        DFHMSD TYPE=FINAL                                                       
**************                                                                  
        END                                                                     
