*          DATA SET DPKM029    AT LEVEL 001 AS OF 07/07/92                      
  PRINT  NOGEN                                                                  
*-------------------------------------------------------------------*           
*                                                                   *           
*        MAPSET  DPKM029                                            *           
*        MAP     DP029A                                             *           
*        PROGRAM DPKCS029                                           *           
*        TRANSID Z029 - MNEMONIC CRITERIA SPEC                      *           
*        SYSTEM  CICS ARCHITECTURE                                  *           
*                                                                   *           
*-------------------------------------------------------------------*           
DPKM029 DFHMSD CTRL=(FREEKB),                                          -        
               LANG=COBOL,                                             -        
               MODE=INOUT,                                             -        
               TIOAPFX=YES,                                            -        
               TYPE=&&SYSPARM                                                   
DP029A  DFHMDI DSATTS=(COLOR,HILIGHT),                                 -        
               MAPATTS=(COLOR,HILIGHT),                                -        
               SIZE=(24,80)                                                     
*                                                                               
ADATE   DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=10,                                              -        
               POS=(1,2)                                                        
ATIME   DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=8,                                               -        
               POS=(1,14)                                                       
ATITLE  DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=30,                                              -        
               POS=(1,25)                                                       
ANETNAM DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=8,                                               -        
               POS=(1,61)                                                       
AMNEMIC DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=8,                                               -        
               POS=(1,71)                                                       
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=66,                                              -        
               POS=(3,2),                                              -        
               INITIAL='ENTER A MNEMONIC FOR DETAIL FUNCTIONS OR OTHER -        
               CRITERIA FOR A LIST'                                             
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=13,                                              -        
               POS=(5,22),                                             -        
               INITIAL='MNEMONIC....:'                                          
AMNEM   DFHMDF ATTRB=(NORM,UNPROT),                                    -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=8,                                               -        
               POS=(5,36)                                                       
        DFHMDF ATTRB=(ASKIP),                                          -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=1,                                               -        
               POS=(5,45)                                                       
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=13,                                              -        
               POS=(6,22),                                             -        
               INITIAL='PROGRAM.....:'                                          
APROG   DFHMDF ATTRB=(NORM,UNPROT),                                    -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=8,                                               -        
               POS=(6,36)                                                       
        DFHMDF ATTRB=(ASKIP),                                          -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=1,                                               -        
               POS=(6,45)                                                       
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=13,                                              -        
               POS=(7,22),                                             -        
               INITIAL='TRANSACTION.:'                                          
ATRAN   DFHMDF ATTRB=(NORM,UNPROT),                                    -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=4,                                               -        
               POS=(7,36)                                                       
        DFHMDF ATTRB=(ASKIP),                                          -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=1,                                               -        
               POS=(7,41)                                                       
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=13,                                              -        
               POS=(9,22),                                             -        
               INITIAL='UPD VSAM IND:'                                          
AUVIND  DFHMDF ATTRB=(NORM,UNPROT),                                    -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(9,36)                                                       
        DFHMDF ATTRB=(ASKIP),                                          -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=1,                                               -        
               POS=(9,38)                                                       
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=11,                                              -        
               POS=(11,22),                                            -        
               INITIAL='SCREEN TYPE'                                            
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=11,                                              -        
               POS=(12,24),                                            -        
               INITIAL='LIST......:'                                            
ALIST   DFHMDF ATTRB=(IC,NORM,UNPROT),                                 -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(12,36)                                                      
        DFHMDF ATTRB=(ASKIP),                                          -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=1,                                               -        
               POS=(12,38)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=11,                                              -        
               POS=(13,24),                                            -        
               INITIAL='DETAIL....:'                                            
ADETAIL DFHMDF ATTRB=(NORM,UNPROT),                                    -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(13,36)                                                      
        DFHMDF ATTRB=(ASKIP),                                          -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=1,                                               -        
               POS=(13,38)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=11,                                              -        
               POS=(14,24),                                            -        
               INITIAL='MENU......:'                                            
AMENU   DFHMDF ATTRB=(NORM,UNPROT),                                    -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(14,36)                                                      
        DFHMDF ATTRB=(ASKIP),                                          -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=1,                                               -        
               POS=(14,38)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=13,                                              -        
               POS=(16,22),                                            -        
               INITIAL='DB2 PACKAGE.:'                                          
APKG    DFHMDF ATTRB=(NORM,UNPROT),                                    -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(16,36)                                                      
        DFHMDF ATTRB=(ASKIP),                                          -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=1,                                               -        
               POS=(16,38)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=13,                                              -        
               POS=(18,22),                                            -        
               INITIAL='ACCURATE LOC:'                                          
ALOC    DFHMDF ATTRB=(NORM,UNPROT),                                    -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=1,                                               -        
               POS=(18,36)                                                      
        DFHMDF ATTRB=(ASKIP),                                          -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=1,                                               -        
               POS=(18,38)                                                      
*                                                                               
AMSG    DFHMDF ATTRB=(FSET,UNPROT),                                    -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=78,                                              -        
               POS=(21,1)                                                       
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=7,                                               -        
               POS=(22,1),                                             -        
               INITIAL='COMMAND'                                                
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=4,                                               -        
               POS=(22,9),                                             -        
               INITIAL='===>'                                                   
ANAVCMD DFHMDF ATTRB=(FSET,UNPROT),                                    -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=8,                                               -        
               POS=(22,14)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=3,                                               -        
               POS=(22,23),                                            -        
               INITIAL='KEY'                                                    
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=4,                                               -        
               POS=(22,27),                                            -        
               INITIAL='===>'                                                   
ANAVKEY DFHMDF ATTRB=(FSET,UNPROT),                                    -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=25,                                              -        
               POS=(22,32)                                                      
        DFHMDF ATTRB=(ASKIP,DRK),                                      -        
               LENGTH=1,                                               -        
               POS=(22,58),                                            -        
               INITIAL=' '                                                      
*                                                                               
AFKLIN1 DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=78,                                              -        
               POS=(23,1)                                                       
AFKLIN2 DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=78,                                              -        
               POS=(24,1)                                                       
        DFHMSD TYPE=FINAL                                                       
        END                                                                     
