*          DATA SET DPKM012    AT LEVEL 001 AS OF 07/07/92                      
        PRINT  NOGEN                                                            
DPKM012 DFHMSD TYPE=DSECT,                                             C        
               LANG=COBOL,                                             C        
               MODE=INOUT,                                             C        
               STORAGE=AUTO,                                           C        
               TERM=3270-2,                                            C        
               TIOAPFX=YES                                                      
**************                                                                  
DP012A  DFHMDI SIZE=(24,80),                                           C        
               CTRL=FREEKB,                                            C        
               MAPATTS=(COLOR,HILIGHT),                                C        
               DSATTS=(COLOR,HILIGHT)                                           
**************                                                                  
ADATE   DFHMDF POS=(01,02),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL                                                    
ATIME   DFHMDF POS=(01,14),LENGTH=08,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL                                                    
ATITLE  DFHMDF POS=(01,25),LENGTH=30,ATTRB=(ASKIP,BRT),                C        
               COLOR=NEUTRAL                                                    
ANETNAM DFHMDF POS=(01,61),LENGTH=08,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL                                                    
AMNEMIC DFHMDF POS=(01,71),LENGTH=08,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL                                                    
*                                                                               
        DFHMDF POS=(03,17),LENGTH=05,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='MENU:'                                                  
AMNUNAM DFHMDF POS=(03,23),LENGTH=08,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AMNUTTL DFHMDF POS=(03,32),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
        DFHMDF POS=(05,01),LENGTH=70,ATTRB=(ASKIP,BRT),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='ENTER THE INFORMATION BELOW FOR THE ITEM TO BE C        
               ADDED TO THIS MENU'                                              
*                                                                               
        DFHMDF POS=(07,17),LENGTH=18,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='MNEMONIC.........:'                                     
AMNEMON DFHMDF POS=(07,36),LENGTH=08,ATTRB=(UNPROT,NORM),              C        
               COLOR=GREEN,HILIGHT=UNDERLINE                                    
        DFHMDF POS=(07,45),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
        DFHMDF POS=(09,17),LENGTH=18,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='PANEL TITLE......:'                                     
APANEL  DFHMDF POS=(09,36),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
        DFHMDF POS=(11,17),LENGTH=18,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='TRANSACTION ID...:'                                     
ATRANID DFHMDF POS=(11,36),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
        DFHMDF POS=(11,41),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
        DFHMDF POS=(13,17),LENGTH=18,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='SEQUENCE.........:'                                     
ASEQNUM DFHMDF POS=(13,36),LENGTH=04,ATTRB=(NUM,UNPROT,NORM),          C        
               COLOR=GREEN,HILIGHT=UNDERLINE                                    
        DFHMDF POS=(13,41),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
        DFHMDF POS=(15,17),LENGTH=18,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='INTER-APPL FORMAT:'                                     
AFORMAT DFHMDF POS=(15,36),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               COLOR=GREEN,HILIGHT=UNDERLINE                                    
        DFHMDF POS=(15,38),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
        DFHMDF POS=(17,17),LENGTH=18,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='MENU DESCRIPTION.:'                                     
ATITTLE DFHMDF POS=(17,36),LENGTH=30,ATTRB=(UNPROT,NORM),              C        
               COLOR=GREEN,HILIGHT=UNDERLINE                                    
        DFHMDF POS=(17,67),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
AMSG    DFHMDF POS=(21,01),LENGTH=78,ATTRB=(ASKIP,BRT),                C        
               COLOR=RED                                                        
        DFHMDF POS=(22,01),LENGTH=11,ATTRB=(PROT,BRT),                 C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='COMMAND===>'                                            
ANAVCMD DFHMDF POS=(22,14),LENGTH=08,ATTRB=(UNPROT,NORM,FSET),         C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(22,23),LENGTH=01,ATTRB=(ASKIP)                              
        DFHMDF POS=(22,25),LENGTH=07,ATTRB=(PROT,BRT),                 C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='KEY===>'                                                
ANAVKEY DFHMDF POS=(22,33),LENGTH=25,ATTRB=(UNPROT,NORM,FSET),         C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(22,59),LENGTH=01,ATTRB=(ASKIP)                              
        DFHMDF POS=(22,63),LENGTH=16,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='PA2=OTHER F KEYS'                                       
AFKLIN1 DFHMDF POS=(23,01),LENGTH=78,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL                                                    
AFKLIN2 DFHMDF POS=(24,01),LENGTH=78,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL                                                    
**************                                                                  
        DFHMSD TYPE=FINAL                                                       
**************                                                                  
        END                                                                     
