DPKM028 DFHMSD LANG=COBOL,                                             -        
               MODE=INOUT,                                             -        
               TERM=3270-2,                                            -        
               TIOAPFX=YES,                                            -        
               TYPE=&&SYSPARM                                                   
**-|                                                                            
**-| Map DP028A                                                                 
**-|                                                                            
DP028A  DFHMDI COLUMN=1,                                               -        
               DSATTS=(COLOR,HILIGHT),                                 -        
               LINE=1,                                                 -        
               MAPATTS=(COLOR,HILIGHT),                                -        
               SIZE=(24,80)                                                     
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=20,                                              -        
               POS=(1,2),                                              -        
               INITIAL='LOGON IN PROGRESS AT'                                   
ATIME   DFHMDF ATTRB=(BRT,PROT),                                       -        
               LENGTH=8,                                               -        
               POS=(1,23)                                                       
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=2,                                               -        
               POS=(1,32),                                             -        
               INITIAL='ON'                                                     
ADATE   DFHMDF ATTRB=(BRT,PROT),                                       -        
               LENGTH=10,                                              -        
               POS=(1,35)                                                       
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               LENGTH=0, (Stopper),                                    -        
               POS=(1,46)                                                       
**-|                                                                            
**-| Map DP028B                                                                 
**-|                                                                            
DP028B  DFHMDI COLUMN=1,                                               -        
               CTRL=(FREEKB),                                          -        
               DATA=FIELD,                                             -        
               DSATTS=(COLOR,HILIGHT),                                 -        
               LINE=1,                                                 -        
               MAPATTS=(COLOR,HILIGHT),                                -        
               OBFMT=NO,                                               -        
               SIZE=(24,80),                                           -        
               TIOAPFX=YES                                                      
ADUMMY  DFHMDF ATTRB=(ASKIP,DRK),                                      -        
               LENGTH=1,                                               -        
               POS=(1,3)                                                        
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               LENGTH=0, (Stopper),                                    -        
               POS=(1,5)                                                        
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=30,                                              -        
               POS=(1,25),                                             -        
               INITIAL='KOHL''S DEPARTMENT STORES, INC.'                        
MSGBX1  DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=54,                                              -        
               POS=(3,13),                                             -        
               INITIAL='***********************************************-        
               *******'                                                         
MSGBX21 DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=2,                                               -        
               POS=(4,13),                                             -        
               INITIAL='**'                                                     
MSGBXT1 DFHMDF ATTRB=(ASKIP,DRK),                                      -        
               HILIGHT=OFF,                                            -        
               LENGTH=48,                                              -        
               POS=(4,16),                                             -        
               INITIAL='                                              '         
MSGBX22 DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=2,                                               -        
               POS=(4,65),                                             -        
               INITIAL='**'                                                     
MSGBX31 DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=2,                                               -        
               POS=(5,13),                                             -        
               INITIAL='**'                                                     
MSGBXT2 DFHMDF ATTRB=(ASKIP,DRK),                                      -        
               HILIGHT=OFF,                                            -        
               LENGTH=48,                                              -        
               POS=(5,16),                                             -        
               INITIAL='                                              '         
MSGBX32 DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=2,                                               -        
               POS=(5,65),                                             -        
               INITIAL='**'                                                     
MSGBX41 DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=2,                                               -        
               POS=(6,13),                                             -        
               INITIAL='**'                                                     
MSGBXT3 DFHMDF ATTRB=(ASKIP,DRK),                                      -        
               HILIGHT=OFF,                                            -        
               LENGTH=48,                                              -        
               POS=(6,16),                                             -        
               INITIAL='                                              '         
MSGBX42 DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=2,                                               -        
               POS=(6,65),                                             -        
               INITIAL='**'                                                     
MSGBX51 DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=2,                                               -        
               POS=(7,13),                                             -        
               INITIAL='**'                                                     
MSGBXT4 DFHMDF ATTRB=(ASKIP,DRK),                                      -        
               HILIGHT=OFF,                                            -        
               LENGTH=48,                                              -        
               POS=(7,16),                                             -        
               INITIAL='                                              '         
MSGBX52 DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=2,                                               -        
               POS=(7,65),                                             -        
               INITIAL='**'                                                     
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=54,                                              -        
               POS=(8,13),                                             -        
               INITIAL='***********************************************-        
               *******'                                                         
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=2,                                               -        
               POS=(9,13),                                             -        
               INITIAL='**'                                                     
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=2,                                               -        
               POS=(9,65),                                             -        
               INITIAL='**'                                                     
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=54,                                              -        
               POS=(10,13),                                            -        
               INITIAL='** THE INFORMATION CONTAINED IN THIS ON-LINE SY-        
               STEM **'                                                         
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=54,                                              -        
               POS=(11,13),                                            -        
               INITIAL='** IS UNPUBLISHED AND CONFIDENTIAL AND THE PROP-        
               ERTY **'                                                         
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=54,                                              -        
               POS=(12,13),                                            -        
               INITIAL='** OF KOHL''S CORPORATION.  DUPLICATION, DISCLO-        
               SURE  **'                                                        
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=54,                                              -        
               POS=(13,13),                                            -        
               INITIAL='** OR USE IN ANY WAY WITHOUT THE SPECIFIC WRITT-        
               EN   **'                                                         
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=54,                                              -        
               POS=(14,13),                                            -        
               INITIAL='** AUTHORIZATION OF KOHL''S CORPORATION IS STRI-        
               CTLY  **'                                                        
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=14,                                              -        
               POS=(15,13),                                            -        
               INITIAL='** PROHIBITED.'                                         
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=2,                                               -        
               POS=(15,65),                                            -        
               INITIAL='**'                                                     
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=2,                                               -        
               POS=(16,13),                                            -        
               INITIAL='**'                                                     
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=2,                                               -        
               POS=(16,65),                                            -        
               INITIAL='**'                                                     
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=54,                                              -        
               POS=(17,13),                                            -        
               INITIAL='***********************************************-        
               *******'                                                         
CLOCTL  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=17,                                              -        
               POS=(20,29),                                            -        
               INITIAL='CURRENT LOCATION:'                                      
CLOCFL  DFHMDF COLOR=BLUE,                                             -        
               ATTRB=(ASKIP,NORM),                                     -        
               LENGTH=5,                                               -        
               PICOUT='99999',                                         -        
               POS=(20,47)                                                      
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               LENGTH=0, (Stopper),                                    -        
               POS=(20,53)                                                      
OLOCTL  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=18,                                              -        
               POS=(21,28),                                            -        
               INITIAL='OVERRIDE LOCATION:'                                     
OLOCFL  DFHMDF COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=5,                                               -        
               POS=(21,47)                                                      
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               LENGTH=0, (Stopper),                                    -        
               POS=(21,53)                                                      
BMSG    DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=RED,                                              -        
               LENGTH=31,                                              -        
               POS=(22,25)                                                      
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               LENGTH=0, (Stopper),                                    -        
               POS=(22,57)                                                      
        DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               LENGTH=31,                                              -        
               POS=(23,25),                                            -        
               INITIAL='PRESS  ENTER  TO CONTINUE LOGON'                        
        DFHMSD TYPE=FINAL                                                       
        END                                                                     
