        PRINT NOGEN                                                     00001   
DPKM278  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=(FREEKB,FRSET)                                      00006   
*                                                                       00007   
DP278A   DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
         DFHMDF POS=(01,01),                                           X00012**5
               LENGTH=008,                                             X00013*29
               INITIAL='PROGRAM:',                                     X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
APGM     DFHMDF POS=(01,10),                                           X00012**5
               LENGTH=008,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00011   
         DFHMDF POS=(02,01),                                           X00012**5
               LENGTH=012,                                             X00013*29
               INITIAL='COMPILED ON:',                                 X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00011   
ADATE    DFHMDF POS=(03,03),                                           X00012**5
               LENGTH=015,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00011   
         DFHMDF POS=(04,01),                                           X00012**5
               LENGTH=009,                                             X00013*29
               INITIAL='LOCATION:',                                    X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
AOPER    DFHMDF POS=(04,11),                                           X00012**5
               LENGTH=004,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00011   
         DFHMDF POS=(05,01),                                           X00012**5
               LENGTH=008,                                             X00013*29
               INITIAL='USER-ID:',                                     X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
AUSER    DFHMDF POS=(05,10),                                           X00012**5
               LENGTH=008,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00011   
         DFHMDF POS=(06,01),                                           X00012**5
               LENGTH=010,                                             X00013*29
               INITIAL='USER NAME:',                                   X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00011   
ANAME    DFHMDF POS=(07,01),                                           X00012**5
               LENGTH=019,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00011   
AMSG8    DFHMDF POS=(08,01),                                           X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='ENTER = PREV SCREEN'                                    
*                                                                       00068   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
