*          DATA SET DPKM013    AT LEVEL 001 AS OF 07/07/92                      
*********************************************************************** 00001   
* THIS IS THE MAPSET FOR THE COMMON ABEND PROCESSOR.                    00002   
*                                                                       00003   
* THE FIRST BYTE OF THE MAP IS LEFT BLANK FOR THE FORMFEED CHARACTER.   00004   
*********************************************************************** 00005   
        PRINT NOGEN                                                     00006   
DPKM013  DFHMSD TYPE=MAP,                                              X00007   
               MODE=INOUT,                                             X00008   
               LANG=COBOL,                                             X00009   
               TIOAPFX=YES                                              00010   
*                                                                       00011   
DP013A   DFHMDI SIZE=(24,80),                                          X00012   
               LINE=1,                                                 X00013   
               COLUMN=1,                                               X00014   
               MAPATTS=(HILIGHT,COLOR),                                X00015   
               DSATTS=(HILIGHT,COLOR),                                 X00016   
               CTRL=FREEKB                                              00017   
*                                                                       00018   
ADATE    DFHMDF POS=(1,2),                                             X00019   
               LENGTH=10,                                              X00020   
               ATTRB=(PROT,BRT),                                       X00021   
               COLOR=NEUTRAL                                            00022   
ATIME    DFHMDF POS=(01,15),                                           X00023   
               LENGTH=8,                                               X00024   
               ATTRB=(PROT,BRT),                                       X00025   
               COLOR=NEUTRAL                                            00026   
         DFHMDF POS=(01,29),                                           X00027   
               LENGTH=21,                                              X00028   
               ATTRB=(PROT,BRT),                                       X00029   
               COLOR=NEUTRAL,                                          X00030   
               INITIAL='***  ABEND PANEL  ***'                          00031   
ATERM    DFHMDF POS=(01,65),                                           X00032   
               LENGTH=4,                                               X00033   
               ATTRB=(PROT,BRT),                                       X00034   
               COLOR=NEUTRAL                                            00035   
         DFHMDF POS=(01,72),                                           X00036   
               LENGTH=08,                                              X00037   
               ATTRB=(PROT,BRT),                                       X00038   
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='DPKCS013'                                       00040   
ALINE01  DFHMDF POS=(03,01),                                           X00041   
               LENGTH=79,                                              X00042   
               ATTRB=(PROT,BRT),                                       X00043   
               COLOR=RED                                                00044   
ALINE02  DFHMDF POS=(04,01),                                           X00045   
               LENGTH=79,                                              X00046   
               ATTRB=(PROT,NORM),                                      X00047   
               COLOR=BLUE                                               00048   
ALINE03  DFHMDF POS=(05,01),                                           X00049   
               LENGTH=79,                                              X00050   
               ATTRB=(PROT,NORM),                                      X00051   
               COLOR=BLUE                                               00052   
ALINE04  DFHMDF POS=(06,01),                                           X00053   
               LENGTH=79,                                              X00054   
               ATTRB=(PROT,NORM),                                      X00055   
               COLOR=BLUE                                               00056   
ALINE05  DFHMDF POS=(07,01),                                           X00057   
               LENGTH=79,                                              X00058   
               ATTRB=(PROT,NORM),                                      X00059   
               COLOR=BLUE                                               00060   
ALINE06  DFHMDF POS=(08,01),                                           X00061   
               LENGTH=79,                                              X00062   
               ATTRB=(PROT,NORM),                                      X00063   
               COLOR=BLUE                                               00064   
ALINE07  DFHMDF POS=(09,01),                                           X00065   
               LENGTH=79,                                              X00066   
               ATTRB=(PROT,NORM),                                      X00067   
               COLOR=BLUE                                               00068   
ALINE08  DFHMDF POS=(10,01),                                           X00069   
               LENGTH=79,                                              X00070   
               ATTRB=(PROT,NORM),                                      X00071   
               COLOR=BLUE                                               00072   
ALINE09  DFHMDF POS=(11,01),                                           X00073   
               LENGTH=79,                                              X00074   
               ATTRB=(PROT,NORM),                                      X00075   
               COLOR=BLUE                                               00076   
ALINE10  DFHMDF POS=(12,01),                                           X00077   
               LENGTH=79,                                              X00078   
               ATTRB=(PROT,NORM),                                      X00079   
               COLOR=BLUE                                               00080   
ALINE11  DFHMDF POS=(13,01),                                           X00081   
               LENGTH=79,                                              X00082   
               ATTRB=(PROT,NORM),                                      X00083   
               COLOR=BLUE                                               00084   
ALINE12  DFHMDF POS=(14,01),                                           X00085   
               LENGTH=79,                                              X00086   
               ATTRB=(PROT,NORM),                                      X00087   
               COLOR=BLUE                                               00088   
ALINE13  DFHMDF POS=(15,01),                                           X00089   
               LENGTH=79,                                              X00090   
               ATTRB=(PROT,NORM),                                      X00091   
               COLOR=BLUE                                               00092   
ALINE14  DFHMDF POS=(16,01),                                           X00093   
               LENGTH=79,                                              X00094   
               ATTRB=(PROT,NORM),                                      X00095   
               COLOR=BLUE                                               00096   
ALINE15  DFHMDF POS=(17,01),                                           X00097   
               LENGTH=79,                                              X00098   
               ATTRB=(PROT,NORM),                                      X00099   
               COLOR=BLUE                                               00100   
ALINE16  DFHMDF POS=(18,01),                                           X00101   
               LENGTH=79,                                              X00102   
               ATTRB=(PROT,NORM),                                      X00103   
               COLOR=BLUE                                               00104   
ALINE17  DFHMDF POS=(19,01),                                           X00105   
               LENGTH=79,                                              X00106   
               ATTRB=(PROT,NORM),                                      X00107   
               COLOR=BLUE                                               00108   
ALINE18  DFHMDF POS=(20,01),                                           X00109   
               LENGTH=79,                                              X00110   
               ATTRB=(PROT,NORM),                                      X00111   
               COLOR=BLUE                                               00112   
ALINE19  DFHMDF POS=(21,01),                                           X00113   
               LENGTH=79,                                              X00114   
               ATTRB=(PROT,NORM),                                      X00115   
               COLOR=BLUE                                               00116   
ALINE20  DFHMDF POS=(22,01),                                           X00117   
               LENGTH=79,                                              X00118   
               ATTRB=(PROT,NORM),                                      X00119   
               COLOR=BLUE                                               00120   
ALINE21  DFHMDF POS=(23,01),                                           X00121   
               LENGTH=79,                                              X00122   
               ATTRB=(PROT,NORM),                                      X00123   
               COLOR=BLUE                                               00124   
AMESSAG  DFHMDF POS=(24,01),                                           X00125   
               LENGTH=79,                                              X00126   
               ATTRB=(PROT,BRT),                                       X00127   
               COLOR=NEUTRAL                                            00128   
         DFHMSD TYPE=FINAL                                              00129   
        END                                                             00130   
