*          DATA SET DPKM023    AT LEVEL 001 AS OF 07/07/92                      
        PRINT  NOGEN                                                            
DPKM023 DFHMSD LANG=COBOL,                                             -        
               MODE=INOUT,                                             -        
               STORAGE=AUTO,                                           -        
               TERM=3270-2,                                            -        
               TIOAPFX=YES,                                            -        
               TYPE=&&SYSPARM                                                   
**************                                                                  
DP023A  DFHMDI CTRL=(FREEKB),                                          -        
               DSATTS=(COLOR,HILIGHT),                                 -        
               MAPATTS=(COLOR,HILIGHT),                                -        
               SIZE=(24,80)                                                     
**************                                                                  
ADATE   DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=10,                                              -        
               POS=(1,2)                                                        
ATIME   DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=8,                                               -        
               POS=(1,14)                                                       
ATITLE  DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=30,                                              -        
               POS=(1,25)                                                       
ANETNAM DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=8,                                               -        
               POS=(1,61)                                                       
AMNEMIC DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=8,                                               -        
               POS=(1,71)                                                       
*                                                                               
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=22,                                              -        
               POS=(7,13),                                             -        
               INITIAL='MNEMONIC.............:'                                 
AMNEM   DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(7,37)                                                       
*                                                                               
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=12,                                              -        
               POS=(7,48),                                             -        
               INITIAL='UPDATE VSAM:'                                           
AUVIND  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(7,61)                                                       
*                                                                               
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=22,                                              -        
               POS=(8,13),                                             -        
               INITIAL='PROGRAM-ID...........:'                                 
APROG   DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=8,                                               -        
               POS=(8,37)                                                       
*                                                                               
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=22,                                              -        
               POS=(9,13),                                             -        
               INITIAL='TRANSACTION ID.......:'                                 
ATRANID DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               POS=(9,37)                                                       
*                                                                               
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=22,                                              -        
               POS=(10,13),                                            -        
               INITIAL='PANEL TITLE..........:'                                 
ATRNTLE DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=30,                                              -        
               POS=(10,37)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=22,                                              -        
               POS=(11,13),                                            -        
               INITIAL='TRANSACTION AVAILABLE:'                                 
AAVAIL  DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(11,37)                                                      
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=9,                                               -        
               POS=(11,39),                                            -        
               INITIAL='    (Y/N)'                                              
*                                                                               
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=22,                                              -        
               POS=(12,13),                                            -        
               INITIAL='STANDARD COMMAREA....:'                                 
AFORMAT DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(12,37)                                                      
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=9,                                               -        
               POS=(12,39),                                            -        
               INITIAL='    (Y/N)'                                              
*                                                                               
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=22,                                              -        
               POS=(13,13),                                            -        
               INITIAL='SAVE COMMAREA........:'                                 
ASAVCOM DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(13,37)                                                      
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=9,                                               -        
               POS=(13,39),                                            -        
               INITIAL='    (Y/N)'                                              
*                                                                               
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=22,                                              -        
               POS=(14,13),                                            -        
               INITIAL='COMMAREA LENGTH......:'                                 
ACOMLEN DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=4,                                               -        
               PICOUT='9(4)',                                          -        
               POS=(14,37)                                                      
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=25,                                              -        
               POS=(14,42),                                            -        
               INITIAL=' (MUST BE LESS THAN 2866)'                              
*                                                                               
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=22,                                              -        
               POS=(15,13),                                            -        
               INITIAL='GLOBAL ACCESS........:'                                 
AGLBACC DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(15,37)                                                      
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=9,                                               -        
               POS=(15,39),                                            -        
               INITIAL='    (Y/N)'                                              
*                                                                               
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=22,                                              -        
               POS=(16,13),                                            -        
               INITIAL='SCREEN TYPE CODE.....:'                                 
ASCRTYP DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(16,37)                                                      
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=11,                                              -        
               POS=(16,39),                                            -        
               INITIAL='    (M/L/D)'                                            
*                                                                               
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=22,                                              -        
               POS=(17,13),                                            -        
               INITIAL='DB2 PACKAGE CODE.....:'                                 
APKG    DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(17,37)                                                      
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=29,                                              -        
               POS=(17,39),                                            -        
               INITIAL='    (P=PRODUCTION, A=ARCHIVE)'                          
*                                                                               
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=22,                                              -        
               POS=(18,13),                                            -        
               INITIAL='COMMENT..............:'                                 
ACMNT   DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=40,                                              -        
               POS=(18,37)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=22,                                              -        
               POS=(19,13),                                            -        
               INITIAL='ACCURATE LOCATION REQ:'                                 
ALOC    DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=BLUE,                                             -        
               LENGTH=1,                                               -        
               POS=(19,37)                                                      
        DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=9,                                               -        
               POS=(19,39),                                            -        
               INITIAL='    (Y/N)'                                              
*                                                                               
AMSG    DFHMDF ATTRB=(ASKIP,BRT),                                      -        
               COLOR=RED,                                              -        
               LENGTH=78,                                              -        
               POS=(21,1)                                                       
        DFHMDF ATTRB=(BRT,PROT),                                       -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=11,                                              -        
               POS=(22,1),                                             -        
               INITIAL='COMMAND===>'                                            
ANAVCMD DFHMDF ATTRB=(IC,NORM,UNPROT),                                 -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=8,                                               -        
               POS=(22,14)                                                      
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(22,23)                                                      
        DFHMDF ATTRB=(BRT,PROT),                                       -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=7,                                               -        
               POS=(22,25),                                            -        
               INITIAL='KEY===>'                                                
ANAVKEY DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -        
               COLOR=GREEN,                                            -        
               HILIGHT=UNDERLINE,                                      -        
               LENGTH=25,                                              -        
               POS=(22,33)                                                      
        DFHMDF ATTRB=(ASKIP),                                          -        
               LENGTH=1,                                               -        
               POS=(22,59)                                                      
        DFHMDF ATTRB=(NORM,PROT),                                      -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=16,                                              -        
               POS=(22,63),                                            -        
               INITIAL='PA2=OTHER F KEYS'                                       
AFKLIN1 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=78,                                              -        
               POS=(23,1)                                                       
AFKLIN2 DFHMDF ATTRB=(ASKIP,NORM),                                     -        
               COLOR=NEUTRAL,                                          -        
               LENGTH=78,                                              -        
               POS=(24,1)                                                       
**************                                                                  
        DFHMSD TYPE=FINAL                                                       
**************                                                                  
        END                                                                     
