*          DATA SET DPKM996    AT LEVEL 009 AS OF 10/05/93                      
  PRINT  NOGEN                                                          00001**7
*--------------------------------------------------------------------*  00002**7
*                                                                    *  00003**5
*        MAPSET   DPKM996                                            *  00004**5
*        MAP      DP996A                                             *  00005**5
*        PROGRAM  DPKCS996                                           *  00006**5
*        TRANSID  Z996 - CICSAUTH TEST PANEL                         *  00007**5
*        SYSTEM                                                      *  00008**5
*                                                                    *  00009**5
*--------------------------------------------------------------------*  00010**5
DPKM996  DFHMSD TYPE=MAP,                                              X00011**4
               CTRL=(FREEKB),                                          X00012**4
               MAPATTS=(COLOR,HILIGHT),                                X00013**4
               DSATTS=(COLOR,HILIGHT),                                 X00014**4
               LANG=COBOL,                                             X00015**4
               MODE=INOUT,                                             X00016**4
               TIOAPFX=YES                                              00017**4
DP996A   DFHMDI LINE=2,COLUMN=1,                                       X00018**9
               SIZE=(19,080),                                          X00019**9
               MAPATTS=(COLOR,HILIGHT),                                X00020**4
               DSATTS=(COLOR,HILIGHT),                                 X00021**4
               TIOAPFX=YES                                              00022**4
*                                                                       00023**5
         DFHMDF POS=(03,014),                                          X00024**4
               COLOR=NEUTRAL,                                          X00025**5
               ATTRB=(ASKIP,BRT),                                      X00026**5
               HILIGHT=OFF,                                            X00027**4
               LENGTH=014,                                             X00028**4
               INITIAL='RESOURCE TYPE:'                                 00029**4
ARESTYP  DFHMDF POS=(03,029),                                          X00030**4
               COLOR=GREEN,                                            X00031**5
               ATTRB=(UNPROT,NORM),                                    X00032**4
               HILIGHT=UNDERLINE,                                      X00033**5
               LENGTH=001                                               00034**4
         DFHMDF POS=(03,031),                                          X00035**5
               COLOR=NEUTRAL,                                          X00036**5
               ATTRB=(ASKIP),                                          X00037**5
               LENGTH=01                                                00038**8
         DFHMDF POS=(03,049),                                          X00039**5
               COLOR=NEUTRAL,                                          X00040**5
               ATTRB=(ASKIP,BRT),                                      X00041**7
               HILIGHT=OFF,                                            X00042**5
               LENGTH=015,                                             X00043**5
               INITIAL='T - TRANSACTION'                                00044**5
*                                                                       00045**5
         DFHMDF POS=(04,049),                                          X00046**4
               COLOR=NEUTRAL,                                          X00047**5
               ATTRB=(ASKIP,BRT),                                      X00048**6
               HILIGHT=OFF,                                            X00049**4
               LENGTH=008,                                             X00050**4
               INITIAL='M - MENU'                                       00051**4
*                                                                       00052**5
         DFHMDF POS=(05,049),                                          X00053**4
               COLOR=NEUTRAL,                                          X00054**5
               ATTRB=(ASKIP,BRT),                                      X00055**7
               HILIGHT=OFF,                                            X00056**4
               LENGTH=012,                                             X00057**4
               INITIAL='F - FUNCTION'                                   00058**4
*                                                                       00059**5
         DFHMDF POS=(06,049),                                          X00060**4
               COLOR=NEUTRAL,                                          X00061**5
               ATTRB=(ASKIP,BRT),                                      X00062**7
               HILIGHT=OFF,                                            X00063**4
               LENGTH=009,                                             X00064**4
               INITIAL='S - STORE'                                      00065**4
*                                                                       00066**5
         DFHMDF POS=(07,049),                                          X00067**4
               COLOR=NEUTRAL,                                          X00068**5
               ATTRB=(ASKIP,BRT),                                      X00069**7
               HILIGHT=OFF,                                            X00070**4
               LENGTH=014,                                             X00071**4
               INITIAL='D - DEPARTMENT'                                 00072**4
*                                                                       00073**5
         DFHMDF POS=(09,014),                                          X00074**4
               COLOR=NEUTRAL,                                          X00075**5
               ATTRB=(ASKIP,BRT),                                      X00076**7
               HILIGHT=OFF,                                            X00077**4
               LENGTH=014,                                             X00078**4
               INITIAL='RESOURCE NAME:'                                 00079**4
ARESNAM  DFHMDF POS=(09,029),                                          X00080**4
               COLOR=GREEN,                                            X00081**6
               ATTRB=(UNPROT,NORM),                                    X00082**4
               HILIGHT=UNDERLINE,                                      X00083**6
               LENGTH=015                                               00084**4
         DFHMDF POS=(09,045),                                          X00085**6
               COLOR=NEUTRAL,                                          X00086**6
               ATTRB=(ASKIP),                                          X00087**6
               LENGTH=01                                                00088**8
*                                                                       00089**7
         DFHMDF POS=(11,014),                                          X00090**4
               COLOR=NEUTRAL,                                          X00091**5
               ATTRB=(ASKIP,BRT),                                      X00092**7
               HILIGHT=OFF,                                            X00093**4
               LENGTH=014,                                             X00094**4
               INITIAL='ACCESS TYPE..:'                                 00095**4
ACCTYP   DFHMDF POS=(11,029),                                          X00096**4
               COLOR=GREEN,                                            X00097**7
               ATTRB=(UNPROT,NORM),                                    X00098**4
               HILIGHT=UNDERLINE,                                      X00099**7
               LENGTH=001                                               00100**4
         DFHMDF POS=(11,031),                                          X00101**7
               COLOR=NEUTRAL,                                          X00102**7
               ATTRB=(ASKIP),                                          X00103**7
               LENGTH=01                                                00104**8
         DFHMDF POS=(11,049),                                          X00105**4
               COLOR=NEUTRAL,                                          X00106**5
               ATTRB=(ASKIP,BRT),                                      X00107**7
               HILIGHT=OFF,                                            X00108**4
               LENGTH=024,                                             X00109**4
               INITIAL='R - READ      U - UPDATE'                       00110**4
*                                                                       00111**7
         DFHMDF POS=(12,049),                                          X00112**4
               COLOR=NEUTRAL,                                          X00113**5
               ATTRB=(ASKIP,BRT),                                      X00114**7
               HILIGHT=OFF,                                            X00115**4
               LENGTH=024,                                             X00116**4
               INITIAL='A - ADD       D - DELETE'                       00117**4
*                                                                       00118**7
         DFHMDF POS=(15,014),                                          X00119**4
               COLOR=NEUTRAL,                                          X00120**5
               ATTRB=(ASKIP,BRT),                                      X00121**7
               HILIGHT=OFF,                                            X00122**4
               LENGTH=014,                                             X00123**4
               INITIAL='ERROR CODE...:'                                 00124**4
AERRCOD  DFHMDF POS=(15,029),                                          X00125**4
               COLOR=NEUTRAL,                                          X00126**5
               ATTRB=(ASKIP,NORM),                                     X00127**4
               HILIGHT=OFF,                                            X00128**4
               LENGTH=004,                                             X00129**4
               PICOUT='ZZZ9'                                            00130**4
*                                                                       00131**7
         DFHMDF POS=(17,014),                                          X00132**4
               COLOR=NEUTRAL,                                          X00133**5
               ATTRB=(ASKIP,BRT),                                      X00134**7
               HILIGHT=OFF,                                            X00135**4
               LENGTH=014,                                             X00136**4
               INITIAL='ACCESS SWITCH:'                                 00137**4
ACCSSW   DFHMDF POS=(17,029),                                          X00138**4
               COLOR=NEUTRAL,                                          X00139**5
               ATTRB=(ASKIP,NORM),                                     X00140**4
               HILIGHT=OFF,                                            X00141**4
               LENGTH=009                                               00142**4
*                                                                       00143**7
         DFHMDF POS=(19,014),                                          X00144**4
               COLOR=NEUTRAL,                                          X00145**5
               ATTRB=(ASKIP,BRT),                                      X00146**7
               HILIGHT=OFF,                                            X00147**4
               LENGTH=043,                                             X00148**4
               INITIAL='SEE COPYBOOK DPWS008 FOR FIELD DESCRIPTIONS'    00149**4
         DFHMSD TYPE=FINAL                                              00150**4
         END                                                            00151**4
