*          DATA SET DPKM035    AT LEVEL 005 AS OF 02/05/93                      
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  DPKM035                                            *   00004   
*        MAP     DP035A                                             *   00005   
*        PROGRAM DPKCS035                                           *   00006   
*        TRANSID Z035 - MNEMONIC CRITERIA SPEC                      *   00007   
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
DPKM035 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
DP035A  DFHMDI LINE=2,COLUMN=1,                                        X00016**4
               SIZE=(19,80),                                           X00017**2
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='ENTER SYSTEM ID AND/OR MESSAGE TEXT OR A MESSAGX00022   
               E NUMBER',                                              X00023   
               LENGTH=57,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(02,02)                                              00026**2
*                                                                       00027**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='MESSAGE NUMBER:',                              X00029**3
               LENGTH=15,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(06,18)                                              00032**3
AMSGNUM DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00033**3
               LENGTH=5,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(06,35),                                            X00037**5
               PICOUT='ZZZZZ'                                           00038**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(06,41)                                              00042**3
*                                                                       00043   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00044   
               INITIAL='SYSTEM ID.....:',                              X00045   
               LENGTH=15,                                              X00046   
               COLOR=NEUTRAL,                                          X00047   
               POS=(08,18)                                              00048**3
ASYSID  DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00049   
               LENGTH=2,                                               X00050   
               COLOR=GREEN,                                            X00051   
               HILIGHT=UNDERLINE,                                      X00052   
               POS=(08,35)                                              00053**3
        DFHMDF ATTRB=(ASKIP),                                          X00054   
               LENGTH=1,                                               X00055   
               COLOR=NEUTRAL,                                          X00056   
               POS=(08,38)                                              00057**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00059   
               INITIAL='MESSAGE TEXT..:',                              X00060   
               LENGTH=15,                                              X00061   
               COLOR=NEUTRAL,                                          X00062   
               POS=(10,18)                                              00063**3
ASHTTXT DFHMDF ATTRB=(UNPROT,NORM),                                    X00064   
               LENGTH=30,                                              X00065   
               COLOR=GREEN,                                            X00066   
               HILIGHT=UNDERLINE,                                      X00067   
               POS=(10,35)                                              00068**3
        DFHMDF ATTRB=(ASKIP),                                          X00069   
               LENGTH=1,                                               X00070   
               COLOR=NEUTRAL,                                          X00071   
               POS=(10,66)                                              00072**3
*                                                                       00073   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00074   
               INITIAL='REVIEWED......:',                              X00075   
               LENGTH=15,                                              X00076   
               COLOR=NEUTRAL,                                          X00077   
               POS=(12,18)                                              00078**3
ARVWIND DFHMDF ATTRB=(UNPROT,NORM),                                    X00079   
               LENGTH=1,                                               X00080   
               COLOR=GREEN,                                            X00081   
               HILIGHT=UNDERLINE,                                      X00082   
               POS=(12,35)                                              00083**3
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(12,37)                                              00087**3
         DFHMSD TYPE=FINAL                                              00088   
         END                                                            00089   
