*          DATA SET DPKM020    AT LEVEL 002 AS OF 07/20/92                      
*********************************************************************** 00001   
*       MAPSET  DPKM020                                                 00002   
*       MAP     DP020A                                                  00003   
*       PROGRAM DPKCS020 - MAINTAIN USER TABLE                          00004   
*       TRANSID Z020                                                    00005   
*       SYSTEM  CICS ARCHITECTURE                                       00006   
*********************************************************************** 00007   
        PRINT  NOGEN                                                    00008   
DPKM020 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES,             C00009   
               CTRL=(FREEKB)                                            00010   
DP020A  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),                   C00011   
               DSATTS=(COLOR,HILIGHT)                                   00012   
ADATE   DFHMDF POS=(1,2),LENGTH=10,ATTRB=(PROT,BRT),COLOR=NEUTRAL       00013**2
ATIME   DFHMDF POS=(1,14),LENGTH=8,ATTRB=(PROT,BRT),COLOR=NEUTRAL       00014**2
ATITLE  DFHMDF POS=(1,25),LENGTH=30,ATTRB=(PROT,BRT)                    00015   
ANETNAM DFHMDF POS=(1,61),LENGTH=8,ATTRB=(PROT,BRT),COLOR=NEUTRAL       00016**2
AMNEMIC DFHMDF POS=(1,71),LENGTH=8,ATTRB=(PROT,BRT)                     00017   
        DFHMDF POS=(3,7),LENGTH=63,INITIAL='ENTER THE USER ID FOR THE UC00018   
               SER WHOSE RECORD YOU WANT TO PROCESS',ATTRB=(PROT,BRT)   00019   
        DFHMDF POS=(4,7),LENGTH=64,INITIAL='AND THEN PRESS THE FUNCTIONC00020   
                KEY FOR ADD, READ, UPDATE OR DELETE.',ATTRB=(PROT,BRT)  00021   
        DFHMDF POS=(6,7),LENGTH=60,INITIAL='THE MNEMLIST FUNCTION KEY WC00022   
               ILL DISPLAY A LIST OF TRANSACTION',ATTRB=(PROT,BRT)      00023   
        DFHMDF POS=(7,7),LENGTH=57,INITIAL='MNEMONICS.  A MNEMONIC CAN C00024   
               BE SELECTED FROM THAT LIST AND',ATTRB=(PROT,BRT)         00025   
        DFHMDF POS=(8,7),LENGTH=45,INITIAL='RETURNED TO THE FIELD ON THC00026   
               IS PANEL.',ATTRB=(PROT,BRT)                              00027   
        DFHMDF POS=(11,10),LENGTH=51,INITIAL='USER ID .  .  .  .  .  . C00028   
                .  .  .  .  .  .  .  .  .',ATTRB=(PROT,BRT)             00029   
AUSERID DFHMDF POS=(11,62),LENGTH=8,ATTRB=(UNPROT,IC),                 C00030   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00031   
        DFHMDF POS=(11,71),LENGTH=1,ATTRB=(ASKIP)                       00032   
        DFHMDF POS=(14,10),LENGTH=51,INITIAL='MNEMONIC FOR THE USERS INC00033   
               ITIAL TRANSACTION .  .  .',ATTRB=(PROT,BRT)              00034   
AMNEM   DFHMDF POS=(14,62),LENGTH=8,ATTRB=(UNPROT),                    C00035   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00036   
        DFHMDF POS=(14,71),LENGTH=1,ATTRB=(ASKIP)                       00037   
AMSG    DFHMDF POS=(21,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=RED          00038   
        DFHMDF POS=(22,1),LENGTH=11,INITIAL='COMMAND==>',              C00039   
               ATTRB=(PROT,BRT)                                         00040   
ANAVCMD DFHMDF POS=(22,13),LENGTH=8,ATTRB=(UNPROT),                    C00041   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00042   
        DFHMDF POS=(22,22),LENGTH=1,ATTRB=(ASKIP)                       00043   
        DFHMDF POS=(22,24),LENGTH=7,INITIAL='KEY===>',ATTRB=(PROT,BRT)  00044   
ANAVKEY DFHMDF POS=(22,32),LENGTH=25,ATTRB=(UNPROT),                   C00045   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00046   
        DFHMDF POS=(22,58),LENGTH=1,ATTRB=(ASKIP)                       00047   
        DFHMDF POS=(22,63),LENGTH=16,INITIAL='PA2=OTHER FKEYS',        C00048   
               ATTRB=(PROT,BRT)                                         00049   
AFKLIN1 DFHMDF POS=(23,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00050   
AFKLIN2 DFHMDF POS=(24,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00051   
        DFHMSD TYPE=FINAL                                               00052   
        END                                                             00053   
