000100 IDENTIFICATION DIVISION.                                         00010005
000200 PROGRAM-ID.     DPKUT951.                                        00020005
000300 AUTHOR.         DOUG DOUGLAS (STRATAGEM) / CHERI MASTEL.         00030005
000400 DATE-WRITTEN.   06/10/1998.                                      00040005
000500 DATE-COMPILED.                                                   00050005
000600******************************************************************00060005
000700* *                                                            * *00070005
000800* *  THIS PROGRAM PROVIDES THE TEST UTILITY FOR THE            * *00080005
000900* *  KOHL'S CALENDAR ROUTINE, DPKUT500 (COMMONLY CALLED        * *00090005
001000* *  THE DATE ROUTINE).                                        * *00100005
001100* *                                                            * *00110005
001200* *  THIS PROGRAM WAS DEVELOPED AS PART OF THE TEST PLAN       * *00120005
001300* *  FOR SYSTEM AND ACCEPTANCE TESTING FOR THE Y2K-COMPLIANT   * *00130005
001400* *  VERSION OF THE DATE ROUTINE.  IT WILL BE RETAINED FOR     * *00140005
001500* *  ONGOING REGRESSION TESTING FOR ANY FUTURE ENHANCEMENTS    * *00150005
001600* *  TO THE DATE ROUTINE.                                      * *00160005
001700* *                                                            * *00170005
001800* *  ADDITIONALLY IT IS USEFUL FOR ANY APPLICATIONS            * *00180005
001900* *  PROGRAMMER INTERESTED IN CONDUCTING 'WHAT IF...'          * *00190005
002000* *  TESTING AS AN AID TO THEIR UNDERSTANDING OF THE DATE      * *00200005
002100* *  ROUTINE AND THE INFORMATION PRESENTED TO THEM             * *00210005
002200* *  IN RESPONSE TO PROVIDING VARIOUS DIFFERENT COMBINATIONS   * *00220005
002300* *  OF INPUT PARMS.                                           * *00230005
002400* *                                                            * *00240005
002500* *  THIS PROGRAM POPULATES THE DPG51, DPG52, AND DPG53        * *00250005
002600* *  COPYBOOK INPUT PARMS AND CALLS THE CALENDAR ROUTINE.      * *00260005
002700* *  UPON RETURN FROM THE CALENDAR ROUTINE THE DPG51, DPG52,   * *00270005
002800* *  AND DPG53 COPYBOOK INPUT PARMS AND THE OUTPARMS IN        * *00280005
002900* *  DPG54, DPG55, AND DPG56 ARE FORMATTED ONTO A REPORT.      * *00290005
003000* *                                                            * *00300005
003100* *  PROCESSING FLOW:                                          * *00310005
003200* *  - PROGRAM RUNS USING JCL PARMS SPECIFIED ON THE EXECUTE   * *00320005
003300* *    STATEMENT.                                              * *00330005
003400* *  - PROGRAM READS CONTROL CARD INPUT WHICH MAY BE PROVIDED  * *00340005
003500* *    PROCESSING CONTINUES AS DESCRIBED BELOW UNTIL           * *00350005
003600* *    END-OF-FILE.                                            * *00360005
003700* *    - READS CONTROL CARD INPUT.                             * *00370005
003800* *      - FOR CC '51', POPULATES DPG51 COPYBOOK INPUT PARMS.  * *00380005
003900* *      - FOR CC '52', POPULATES DPG52 COPYBOOK INPUT PARMS.  * *00390005
004000* *      - FOR CC '53', POPULATES DPG53 COPYBOOK INPUT PARMS.  * *00400005
004100* *      - NOTE THAT ALL THREE CARDS ARE REQUIRED FOR EACH     * *00410005
004200* *        CALL.                                               * *00420005
004300* *    - CALLS CALENDAR ROUTINE WITH COPYBOOK INPUT PARMS.     * *00430005
004400* *      - BASED ON JCL PARMS PROVIDED, CALLS THE PROD AND/OR  * *00440005
004500* *        TEST VERSION OF THE CALENDAR ROUTINE.               * *00450005
004600* *    - UPON RETURN FROM THE CALENDAR ROUTINE, FORMATS THE    * *00460005
004700* *      COPYBOOK INPUT PARMS ALONG WITH THE RESPONSE PARMS    * *00470005
004800* *      IN DPG54, DPG55, AND DPG56 ONTO A REPORT.             * *00480005
004900* *      - BASED ON JCL PARMS PROVIDED, ONE OF THREE REPORTS   * *00490005
005000* *        IS PROVIDED: 1 = RESULTS FROM OLD/PROD ROUTINE      * *00500005
005100* *                     2 = RESULTS FROM NEW/TEST ROUTINE      * *00510005
005200* *                     3 = DELTAS  FROM OLD-NEW  ROUTINES     * *00520005
005300* *                                                            * *00530005
005400* *  ABEND CODES ISSUED:                                       * *00540005
005500* *  +4003 INVALID CONTROL CARD PARAMETER(S)                   * *00550005
005600* *  +4008 INVALID DATA ON DATASET                             * *00560005
005700* *  +4019 CALENDAR SUB-ROUTINE ERROR                          * *00570005
005800* *  +4095 EMPTY FILE                                          * *00580005
005900* ************************************************************** *00590005
006000                                                                  00600005
006100 ENVIRONMENT DIVISION.                                            00610005
006200 CONFIGURATION SECTION.                                           00620005
006300 SOURCE-COMPUTER.    IBM-3090.                                    00630005
006400 OBJECT-COMPUTER.    IBM-3090.                                    00640005
006500                                                                  00650005
006600 INPUT-OUTPUT SECTION.                                            00660005
006700 FILE-CONTROL.                                                    00670005
006800     SELECT CONTROL-CARDS ASSIGN TO  CCIN.                        00680005
006900     SELECT PRINT-REPORT  ASSIGN TO  RPT01.                       00690005
007000                                                                  00700005
007100                                                                  00710005
007200 DATA DIVISION.                                                   00720005
007300 FILE SECTION.                                                    00730005
007400 FD  CONTROL-CARDS                                                00740005
007500     RECORDING MODE IS F                                          00750005
007600     LABEL RECORDS ARE STANDARD                                   00760005
007700     RECORD CONTAINS 80 CHARACTERS                                00770005
007800     BLOCK CONTAINS 0 RECORDS.                                    00780005
007900 01  CONTROL-CARD-IN.                                             00790005
008000     05  CC-CARD-BASE.                                            00800005
008100         10  CC-CARD-CODE         PIC X(02).                      00810005
008200             88  CC51                         VALUE '51'.         00820005
008300             88  CC52                         VALUE '52'.         00830005
008400             88  CC53                         VALUE '53'.         00840005
008500         10  FILLER               PIC X(36).                      00850005
008600         10  CC-TESTCASE-ID-LEN33.                                00860005
008700             15  CC-TESTCASE-SEPARATOR1                           00870005
008800                                  PIC X(01).                      00880005
008900             15  CC-TESTCASE-ID   PIC X(07).                      00890005
009000             15  CC-TESTCASE-SEPARATOR2                           00900005
009100                                  PIC X(01).                      00910005
009200             15  CC-TESTCASE-DESC PIC X(24).                      00920005
009300             15  CC-TESTCASE-SEPARATOR3                           00930005
009400                                  PIC X(01).                      00940005
009500         10  FILLER               PIC X(08).                      00950005
009600                                                                  00960005
009700     05  CC-FOR-DPG51                                             00970005
009800         REDEFINES CC-CARD-BASE.                                  00980005
009900         10  CC51-CODE            PIC XX.                         00990005
010000         10  F01                  PIC X.                          01000005
010100         10  CC51-SYS-DT-X.                                       01010005
010200             15  CC51-SYS-DT-N    PIC 9(6).                       01020005
010300         10  F02                  PIC X.                          01030005
010400         10  CC51-CAL             PIC XX.                         01040005
010500         10  F03                  PIC X.                          01050005
010600         10  CC51-ID-FLAG         PIC X.                          01060005
010700         10  F04                  PIC X.                          01070005
010800         10  CC51-ID-BUS-DAYS-X.                                  01080005
010900             15  CC51-ID-BUS-DAYS-9                               01090005
011000                                  PIC 9(5).                       01100005
011100         10  F05                  PIC X.                          01110005
011200         10  CC51-ID-DAYS-X.                                      01120005
011300             15  CC51-ID-DAYS-9   PIC 9(5).                       01130005
011400         10  F06                  PIC X.                          01140005
011500         10  CC51-ID-FSCL-WK-X.                                   01150005
011600             15  CC51-ID-FSCL-WK-9                                01160005
011700                                  PIC 9(3).                       01170005
011800         10  F07                  PIC X.                          01180005
011900         10  CC51-ID-FSCL-PRD-X.                                  01190005
012000             15  CC51-ID-FSCL-PRD-9                               01200005
012100                                  PIC 9(3).                       01210005
012200         10  F08                  PIC X.                          01220005
012300         10  FILLER.                                              01230005
012400             15  CC51-CC-PVT-YR-X PIC X(2).                       01240005
012500         10  F09                  PIC X(43).                      01250005
012600                                                                  01260005
012700     05  CC-FOR-DPG52                                             01270005
012800         REDEFINES CC-CARD-BASE.                                  01280005
012900         10  CC52-CODE            PIC XX.                         01290005
013000         10  F01                  PIC X.                          01300005
013100         10  CC52-DT-FMT-CD       PIC X(10).                      01310005
013200         10  F02                  PIC X.                          01320005
013300         10  FILLER.                                              01330005
013400             15  CC52-DT-INPUT    PIC X(10).                      01340005
013500         10  F03                  PIC X(56).                      01350005
013600                                                                  01360005
013700     05  CC-FOR-DPG53                                             01370005
013800         REDEFINES CC-CARD-BASE.                                  01380005
013900         10  CC53-CODE            PIC XX.                         01390005
014000         10  F01                  PIC X.                          01400005
014100         10  CC53-CMPR-DT-FMT-CODE                                01410005
014200                                  PIC X(10).                      01420005
014300         10  F02                  PIC X.                          01430005
014400         10  FILLER.                                              01440005
014500             15  CC53-CMPR-DT-INPUT                               01450005
014600                                  PIC X(10).                      01460005
014700         10  F03                  PIC X(56).                      01470005
014800                                                                  01480005
014900 FD  PRINT-REPORT                                                 01490005
015000     RECORDING MODE IS F                                          01500005
015100     LABEL RECORDS ARE OMITTED                                    01510005
015200     BLOCK CONTAINS 0 RECORDS                                     01520005
015300     RECORD CONTAINS 132 CHARACTERS.                              01530005
015400 01  PRINT-REC.                                                   01540005
015500     05  PRINT-LINE              PIC X(132).                      01550005
015600                                                                  01560005
015700                                                                  01570005
015800 WORKING-STORAGE SECTION.                                         01580005
015900                                                                  01590005
016000* ************************************************************** *01600005
016100* * PROGRAM CONSTANTS.                                         * *01610005
016200* ************************************************************** *01620005
016300 01  PC-PROGRAM-CONSTANTS.                                        01630005
016400     05  FILLER                   PIC X(40)   VALUE               01640005
016500                  'DPKUT951 WORKING STORAGE STARTS HERE.'.        01650005
016600     05  PC-CURRENT-PROGRAM-NAME  PIC X(08)   VALUE 'DPKUT951'.   01660005
016700     05  PC-ABEND-EYE-CATCHER     PIC X(13)   VALUE               01670005
016800                                              ' ** ABEND ** '.    01680005
016900     05  PC-HILITE                PIC X(01)   VALUE '#'.          01690005
017000     05  PC-PARM-END-OF-RUN       PIC X(01)   VALUE '4'.          01700005
017100     05  PC-TESTCASE-ID-FOLLOWS   PIC X(01)   VALUE '#'.          01710005
017200     05  PC-ASTERS49              PIC X(49)   VALUE ALL '*'.      01720005
017300     05  PC-ASTERS39              PIC X(39)   VALUE ALL '*'.      01730005
017400     05  PC-ASTERS28              PIC X(28)   VALUE ALL '*'.      01740005
017500     05  PC-ASTERS17              PIC X(17)   VALUE ALL '*'.      01750005
017600     05  PC-TXT-CUSTOM-HEADINGS.                                  01760005
017700         10  PC-TXT-PROD-51       PIC X(08)   VALUE ' DPG51 *'.   01770005
017800         10  PC-TXT-PROD-52       PIC X(08)   VALUE ' DPG52 *'.   01780005
017900         10  PC-TXT-PROD-53       PIC X(08)   VALUE ' DPG53 *'.   01790005
018000         10  PC-TXT-PROD-54       PIC X(08)   VALUE ' DPG54 *'.   01800005
018100         10  PC-TXT-PROD-55       PIC X(08)   VALUE ' DPG55 *'.   01810005
018200         10  PC-TXT-PROD-56       PIC X(08)   VALUE ' DPG56 *'.   01820005
018300         10  PC-TXT-TEST-51       PIC X(08)   VALUE ' DTG51 *'.   01830005
018400         10  PC-TXT-TEST-52       PIC X(08)   VALUE ' DTG52 *'.   01840005
018500         10  PC-TXT-TEST-53       PIC X(08)   VALUE ' DTG53 *'.   01850005
018600         10  PC-TXT-TEST-54       PIC X(08)   VALUE ' DTG54 *'.   01860005
018700         10  PC-TXT-TEST-55       PIC X(08)   VALUE ' DTG55 *'.   01870005
018800         10  PC-TXT-TEST-56       PIC X(08)   VALUE ' DTG56 *'.   01880005
018900         10  PC-PROD-DESC         PIC X(34)   VALUE               01890005
019000                             ' DATE DRIVER - PROD MODULE REPORT '.01900005
019100         10  PC-DELTA-DESC        PIC X(34)   VALUE               01910005
019200                             '*** DATE DRIVER - DELTA REPORT ***'.01920005
019300     05  PC-REPORT-FIELD-IDENTIFIERS.                             01930005
019400         10  PC-RFI-51.                                           01940005
019500             15  PC-RFI-51-SYS-DT PIC X(11)   VALUE 'SYSTEM DATE'.01950005
019600             15  PC-RFI-51-CALTYP PIC X(13)   VALUE               01960005
019700                                              'CALENDAR TYPE'.    01970005
019800             15  PC-RFI-51-ID-IND PIC X(08)   VALUE 'I/D FLAG'.   01980005
019900             15  PC-RFI-51-ID-BUS PIC X(12)   VALUE               01990005
020000                                              'I/D BUS DAYS'.     02000005
020100             15  PC-RFI-51-ID-DAYS                                02010005
020200                                  PIC X(08)   VALUE 'I/D DAYS'.   02020005
020300             15  PC-RFI-51-PVT-YR PIC X(16)   VALUE               02030005
020400                                              'CENTURY PIVOT YR'. 02040005
020500             15  PC-RFI-51-ID-FW  PIC X(15)   VALUE               02050005
020600                                              'I/D FISCAL WEEK'.  02060005
020700             15  PC-RFI-51-ID-FP  PIC X(14)   VALUE               02070005
020800                                              'I/D FISCAL PRD'.   02080005
020900         10  PC-RFI-52.                                           02090005
021000             15  PC-RFI-52-FMT-I  PIC X(16)   VALUE               02100005
021100                                              'DATE FMT CODE(I)'. 02110005
021200             15  PC-RFI-52-FMT-O  PIC X(16)   VALUE               02120005
021300                                              'DATE FMT CODE(O)'. 02130005
021400             15  PC-RFI-52-DT-I   PIC X(16)   VALUE               02140005
021500                                              'LK DATE INPUT(I)'. 02150005
021600             15  PC-RFI-52-DT-O   PIC X(16)   VALUE               02160005
021700                                              'LK DATE INPUT(O)'. 02170005
021800         10  PC-RFI-53.                                           02180005
021900             15  PC-RFI-53-CFMT-I PIC X(17)   VALUE               02190005
022000                                             'CMPR DT FMT CD(I)'. 02200005
022100             15  PC-RFI-53-CFMT-O PIC X(17)   VALUE               02210005
022200                                             'CMPR DT FMT CD(O)'. 02220005
022300             15  PC-RFI-53-CDT-I  PIC X(16)   VALUE               02230005
022400                                             'CMPR DT INPUT(I)'.  02240005
022500             15  PC-RFI-53-CDT-O  PIC X(16)   VALUE               02250005
022600                                             'CMPR DT INPUT(O)'.  02260005
022700         10  PC-RFI-54.                                           02270005
022800             15  PC-RFI-54-CAL-IND                                02280005
022900                                  PIC X(15)   VALUE               02290005
023000                                             'CALNDR TYPE IND'.   02300005
023100             15  PC-RFI-54-DT-IND PIC X(14)   VALUE               02310005
023200                                             'DATE VALID IND'.    02320005
023300             15  PC-RFI-54-CDT-IND                                02330005
023400                                  PIC X(15)   VALUE               02340005
023500                                             'CMPR DATE VALID'.   02350005
023600             15  PC-RFI-54-ID-IND PIC X(13)   VALUE               02360005
023700                                             'INCR DECR IND'.     02370005
023800             15  PC-RFI-54-ERR-IND                                02380005
023900                                  PIC X(15)   VALUE               02390005
024000                                             'ERROR INDICATOR'.   02400005
024100             15  PC-RFI-54-EMSG1  PIC X(16)   VALUE               02410005
024200                                             'ERROR MSG - PT 1'.  02420005
024300             15  PC-RFI-54-EMSG2  PIC X(16)   VALUE               02430005
024400                                             'ERROR MSG - PT 2'.  02440005
024500             15  PC-RFI-54-EMSG3  PIC X(16)   VALUE               02450005
024600                                             'ERROR MSG - PT 3'.  02460005
024700         10  PC-RFI-55.                                           02470005
024800             15  PC-RFI-55-A01    PIC X(16)  VALUE                02480005
024900                                             'DB2 ISO DATE FMT'.  02490005
025000             15  PC-RFI-55-A02    PIC X(12)  VALUE                02500005
025100                                             'DB2 ISO DATE'.      02510005
025200             15  PC-RFI-55-A03    PIC X(16)  VALUE                02520005
025300                                             'GREG CC DATE FMT'.  02530005
025400             15  PC-RFI-55-A04    PIC X(12)  VALUE                02540005
025500                                             'GREG CC DATE'.      02550005
025600             15  PC-RFI-55-A05    PIC X(13)  VALUE                02560005
025700                                             'GREG DATE FMT'.     02570005
025800             15  PC-RFI-55-A06    PIC X(09)  VALUE                02580005
025900                                             'GREG DATE'.         02590005
026000             15  PC-RFI-55-A07    PIC X(14)  VALUE                02600005
026100                                             'JULIAN DATE/CC'.    02610005
026200             15  PC-RFI-55-A08    PIC X(15)  VALUE                02620005
026300                                             'JULIAN DATE/FMT'.   02630005
026400             15  PC-RFI-55-A09    PIC X(11)  VALUE                02640005
026500                                             'JULIAN DATE'.       02650005
026600             15  PC-RFI-55-A10    PIC X(16)  VALUE                02660005
026700                                             'YEAR/MONTH DATE'.   02670005
026800             15  PC-RFI-55-A11    PIC X(12)  VALUE                02680005
026900                                             'ALPHA MONTH'.       02690005
027000             15  PC-RFI-55-A12    PIC X(14)  VALUE                02700005
027100                                             'ALPHA MON ABBR'.    02710005
027200             15  PC-RFI-55-A13    PIC X(13)  VALUE                02720005
027300                                             'DAYS IN MONTH'.     02730005
027400             15  PC-RFI-55-A14    PIC X(13)  VALUE                02740005
027500                                             'WEEK DAY'.          02750005
027600             15  PC-RFI-55-A15    PIC X(15)  VALUE                02760005
027700                                             'WEEK DAY/ABBR-3'.   02770005
027800             15  PC-RFI-55-A16    PIC X(15)  VALUE                02780005
027900                                             'WEEK DAY/ABBR-2'.   02790005
028000             15  PC-RFI-55-A17    PIC X(13)  VALUE                02800005
028100                                             'WEEK DAY/NMBR'.     02810005
028200             15  PC-RFI-55-A18    PIC X(15)  VALUE                02820005
028300                                             '1ST WKDY/DB2ISO'.   02830005
028400             15  PC-RFI-55-A19    PIC X(16)  VALUE                02840005
028500                                             '1ST WKDY/GREG-CC'.  02850005
028600             15  PC-RFI-55-A20    PIC X(17)  VALUE                02860005
028700                                             '1ST WKDY/GREG-FMT'. 02870005
028800             15  PC-RFI-55-A21    PIC X(13)  VALUE                02880005
028900                                             '1ST WKDY/GREG'.     02890005
029000             15  PC-RFI-55-A22    PIC X(15)  VALUE                02900005
029100                                             '1ST WKDY/JULIAN'.   02910005
029200             15  PC-RFI-55-A23    PIC X(15)  VALUE                02920005
029300                                             'LST WKDY/DB2ISO'.   02930005
029400             15  PC-RFI-55-A24    PIC X(16)  VALUE                02940005
029500                                             'LST WKDY/GREG-CC'.  02950005
029600             15  PC-RFI-55-A25    PIC X(17)  VALUE                02960005
029700                                             'LST WKDY/GREG-FMT'. 02970005
029800             15  PC-RFI-55-A26    PIC X(13)  VALUE                02980005
029900                                             'LST WKDY/GREG'.     02990005
030000             15  PC-RFI-55-A27    PIC X(15)  VALUE                03000005
030100                                             'LST WKDY/JULIAN'.   03010005
030200             15  PC-RFI-55-A28    PIC X(12)  VALUE                03020005
030300                                             'CORP BUS DAY'.      03030005
030400             15  PC-RFI-55-A29    PIC X(12)  VALUE                03040005
030500                                             'CORP HOLIDAY'.      03050005
030600             15  PC-RFI-55-A30    PIC X(13)  VALUE                03060005
030700                                             'STORE HOLIDAY'.     03070005
030800             15  PC-RFI-55-A31    PIC X(16)  VALUE                03080005
030900                                             'CMPR GREG CC FMT'.  03090005
031000             15  PC-RFI-55-A32    PIC X(09)  VALUE                03100005
031100                                             'DAYS DIFF'.         03110005
031200             15  PC-RFI-55-A33    PIC X(13)  VALUE                03120005
031300                                             'BUS DAYS DIFF'.     03130005
031400             15  PC-RFI-55-A34    PIC X(15)  VALUE                03140005
031500                                             'ACT HOLIDAY IND'.   03150005
031600             15  PC-RFI-55-A35    PIC X(12)  VALUE                03160005
031700                                             'HOLIDAY NAME'.      03170005
031800         10  PC-RFI-56.                                           03180005
031900             15  PC-RFI-56-F01    PIC X(16)  VALUE                03190005
032000                                             'CURR FISCAL YEAR'.  03200005
032100             15  PC-RFI-56-F02    PIC X(18)  VALUE                03210005
032200                                             '1ST FD DB2 ISO FMT'.03220005
032300             15  PC-RFI-56-F03    PIC X(14)  VALUE                03230005
032400                                             '1ST FD GREG CC'.    03240005
032500             15  PC-RFI-56-F04    PIC X(15)  VALUE                03250005
032600                                             '1ST FD GREG FMT'.   03260005
032700             15  PC-RFI-56-F05    PIC X(11)  VALUE                03270005
032800                                             '1ST FD GREG'.       03280005
032900             15  PC-RFI-56-F06    PIC X(13)  VALUE                03290005
033000                                             '1ST FD JULIAN'.     03300005
033100             15  PC-RFI-56-F07    PIC X(18)  VALUE                03310005
033200                                             'LST FD DB2 ISO FMT'.03320005
033300             15  PC-RFI-56-F08    PIC X(14)  VALUE                03330005
033400                                             'LST FD GREG CC'.    03340005
033500             15  PC-RFI-56-F09    PIC X(15)  VALUE                03350005
033600                                             'LST FD GREG FMT'.   03360005
033700             15  PC-RFI-56-F10    PIC X(11)  VALUE                03370005
033800                                             'LST FD GREG'.       03380005
033900             15  PC-RFI-56-F11    PIC X(13)  VALUE                03390005
034000                                             'LST FD JULIAN'.     03400005
034100             15  PC-RFI-56-F12    PIC X(16)  VALUE                03410005
034200                                             'NBR FISCAL WEEKS'.  03420005
034300             15  PC-RFI-56-F13    PIC X(15)  VALUE                03430005
034400                                             'FISCAL WEEK NBR'.   03440005
034500             15  PC-RFI-56-F14    PIC X(15)  VALUE                03450005
034600                                             'FISCAL DAY NMBR'.   03460005
034700             15  PC-RFI-56-F15    PIC X(18)  VALUE                03470005
034800                                             'CURR FISCAL SEASON'.03480005
034900             15  PC-RFI-56-F16    PIC X(14)  VALUE                03490005
035000                                             'FISCAL QTR NBR'.    03500005
035100             15  PC-RFI-56-F17    PIC X(18)  VALUE                03510005
035200                                             '1ST FQ DB2 ISO FMT'.03520005
035300             15  PC-RFI-56-F18    PIC X(14)  VALUE                03530005
035400                                             '1ST FQ GREG CC'.    03540005
035500             15  PC-RFI-56-F19    PIC X(15)  VALUE                03550005
035600                                             '1ST FQ GREG FMT'.   03560005
035700             15  PC-RFI-56-F20    PIC X(11)  VALUE                03570005
035800                                             '1ST FQ GREG'.       03580005
035900             15  PC-RFI-56-F21    PIC X(13)  VALUE                03590005
036000                                             '1ST FQ JULIAN'.     03600005
036100             15  PC-RFI-56-F22    PIC X(18)  VALUE                03610005
036200                                             'LST FQ DB2 ISO FMT'.03620005
036300             15  PC-RFI-56-F23    PIC X(14)  VALUE                03630005
036400                                             'LST FQ GREG CC'.    03640005
036500             15  PC-RFI-56-F24    PIC X(15)  VALUE                03650005
036600                                             'LST FQ GREG FMT'.   03660005
036700             15  PC-RFI-56-F25    PIC X(11)  VALUE                03670005
036800                                             'LST FQ GREG'.       03680005
036900             15  PC-RFI-56-F26    PIC X(13)  VALUE                03690005
037000                                             'LST FQ JULIAN'.     03700005
037100             15  PC-RFI-56-F27    PIC X(20)  VALUE                03710005
037200                                           'NBR FISCAL QTR WEEKS'.03720005
037300             15  PC-RFI-56-F28    PIC X(19)  VALUE                03730005
037400                                           'FISCAL QTR WEEK NBR'. 03740005
037500             15  PC-RFI-56-F29    PIC X(19)  VALUE                03750005
037600                                           'FISCAL PERIOD NBR'.   03760005
037700             15  PC-RFI-56-F30    PIC X(18)  VALUE                03770005
037800                                             '1ST FP DB2 ISO FMT'.03780005
037900             15  PC-RFI-56-F31    PIC X(14)  VALUE                03790005
038000                                             '1ST FP GREG CC'.    03800005
038100             15  PC-RFI-56-F32    PIC X(15)  VALUE                03810005
038200                                             '1ST FP GREG FMT'.   03820005
038300             15  PC-RFI-56-F33    PIC X(11)  VALUE                03830005
038400                                             '1ST FP GREG'.       03840005
038500             15  PC-RFI-56-F34    PIC X(13)  VALUE                03850005
038600                                             '1ST FP JULIAN'.     03860005
038700             15  PC-RFI-56-F35    PIC X(18)  VALUE                03870005
038800                                             'LST FP DB2 ISO FMT'.03880005
038900             15  PC-RFI-56-F36    PIC X(14)  VALUE                03890005
039000                                             'LST FP GREG CC'.    03900005
039100             15  PC-RFI-56-F37    PIC X(15)  VALUE                03910005
039200                                             'LST FP GREG FMT'.   03920005
039300             15  PC-RFI-56-F38    PIC X(11)  VALUE                03930005
039400                                             'LST FP GREG'.       03940005
039500             15  PC-RFI-56-F39    PIC X(13)  VALUE                03950005
039600                                             'LST FP JULIAN'.     03960005
039700             15  PC-RFI-56-F40    PIC X(20)  VALUE                03970005
039800                                           'NBR FISCAL PERIOD WK'.03980005
039900             15  PC-RFI-56-F41    PIC X(18)  VALUE                03990005
040000                                             'FISCAL PERIOD WEEK'.04000005
040100             15  PC-RFI-56-F42    PIC X(16)  VALUE                04010005
040200                                             'FISCAL YEAR/CCYY'.  04020005
040300             15  PC-RFI-56-F43    PIC X(18)  VALUE                04030005
040400                                             '1ST FS DB2 ISO FMT'.04040005
040500             15  PC-RFI-56-F44    PIC X(18)  VALUE                04050005
040600                                             'LST FS DB2 ISO FMT'.04060005
040700             15  PC-RFI-56-F45    PIC X(16)  VALUE                04070005
040800                                             'WEEKS DIFFERENCE'.  04080005
040900             15  PC-RFI-56-F46    PIC X(18)  VALUE                04090005
041000                                             'PERIODS DIFFERENCE'.04100005
041100             15  PC-RFI-56-F47    PIC X(18)  VALUE                04110005
041200                                             'FISCAL PERIOD NAME'.04120005
041300             15  PC-RFI-56-F48    PIC X(19)  VALUE                04130005
041400                                            'FISCAL PERIOD ABBR3'.04140005
041500                                                                  04150005
041600     05  PC-POSSIBLE-ENDINGS.                                     04160005
041700         10  PC-NORMAL-EOJ        PIC X(11)   VALUE ' NORMAL EOJ'.04170005
041800         10  PC-ABEND-EOJ         PIC X(17)   VALUE               04180005
041900                                              'ABEND- SEE SYSOUT'.04190005
042000                                                                  04200005
042100* ************************************************************** *04210005
042200* * PROGRAM VARIABLES.                                         * *04220005
042300* ************************************************************** *04230005
042400 01  PV-PROGRAM-VARIABLES.                                        04240005
042500     05  PV-ABEND-CODE            PIC S9(4)   VALUE +0            04250005
042600                                              COMP SYNC.          04260005
042700     05  PV-LS-PARM-VERSION       PIC X(01).                      04270005
042800         88  PV-PARM-PROD-RUN                 VALUE '1'.          04280005
042900         88  PV-PARM-TEST-RUN                 VALUE '2'.          04290005
043000         88  PV-PARM-DELTA-RUN                VALUE '3'.          04300005
043100         88  PV-PARM-END-OF-RUN               VALUE '4'.          04310005
043200     05  PV-COUNTERS.                                             04320005
043300         10  PV-PAGE-CNT          PIC 9(4)    VALUE 0.            04330005
043400         10  PV-CC-51-CNT         PIC 9(4)    VALUE 0.            04340005
043500         10  PV-CC-52-CNT         PIC 9(4)    VALUE 0.            04350005
043600         10  PV-CC-53-CNT         PIC 9(4)    VALUE 0.            04360005
043700         10  PV-TEST-CASES-PROCESSED                              04370005
043800                                  PIC 9(4)    VALUE 0.            04380005
043900     05  PV-TESTMODULE-DESC.                                      04390005
044000         10 FILLER                PIC X(21)   VALUE               04400005
044100                                  ' DATE DRIVER - TEST <'.        04410005
044200         10 PV-TESTMODULE-LOADMOD PIC X(08)   VALUE SPACE.        04420005
044300         10 FILLER                PIC X(05)   VALUE               04430005
044400                                  '> ** '.                        04440005
044500     05  PV-MISC-REFORMAT-AREAS.                                  04450005
044600         10  PV-PIC-X-6           PIC 999999+ VALUE SPACE.        04460005
044700         10  PV-PIC-X-5           PIC 99999+  VALUE SPACE.        04470005
044800         10  PV-PIC-X-4           PIC 9999+   VALUE SPACE.        04480005
044900         10  PV-PIC-X-3           PIC 999+    VALUE SPACE.        04490005
045000         10  PV-TODAY-IS.                                         04500005
045100             15  PV-TODAY-YY      PIC 99      VALUE 0.            04510005
045200             15  PV-TODAY-MM      PIC 99      VALUE 0.            04520005
045300             15  PV-TODAY-DD      PIC 99      VALUE 0.            04530005
045400         10  PV-TIME-IS.                                          04540005
045500             15  PV-TIME-HH       PIC 99      VALUE 0.            04550005
045600             15  PV-TIME-MM       PIC 99      VALUE 0.            04560005
045700             15  PV-TIME-SS       PIC 99      VALUE 0.            04570005
045800             15  PV-TIME-100S     PIC 99      VALUE 0.            04580005
045900         10  PV-PROD-MESSAGE-WORK-AREA.                           04590005
046000             15  PV-EMSG-P1       PIC X(15)   VALUE SPACES.       04600005
046100             15  PV-EMSG-P2       PIC X(15)   VALUE SPACES.       04610005
046200             15  PV-EMSG-P3       PIC X(10)   VALUE SPACES.       04620005
046300         10  PV-TEST-MESSAGE-WORK-AREA.                           04630005
046400             15  PV-EMSG-T1       PIC X(15)   VALUE SPACES.       04640005
046500             15  PV-EMSG-T2       PIC X(15)   VALUE SPACES.       04650005
046600             15  PV-EMSG-T3       PIC X(10)   VALUE SPACES.       04660005
046700                                                                  04670005
046800* ************************************************************** *04680005
046900* * PROGRAM SWITCHES / INDICATORS.                             * *04690005
047000* ************************************************************** *04700005
047100     05  PV-CCIN-EOF-INDICATOR    PIC 9       VALUE ZERO.         04710005
047200         88  PV-CCIN-NOT-EOF                  VALUE 0.            04720005
047300         88  PV-CCIN-EOF                      VALUE 1.            04730005
047400* ************************************************************** *04740005
047500* *      DPG54 DIFFERENCES: MISC, KNOWN ERRS, NEW VALUES.      * *04750005
047600* ************************************************************** *04760005
047700     05  PV-DPG54-DIFFS-MISC-IND  PIC X(8)    VALUE SPACES.       04770005
047800         88  PV-DPG54-DIFFS-MISC-FOUND        VALUE '54-MISC '.   04780005
047900     05  PV-DPG54-DIFFS-KNOWN-IND PIC X(8)    VALUE SPACES.       04790005
048000         88  PV-DPG54-DIFFS-KNOWN-ERRORS      VALUE '54-KNOWN'.   04800005
048100     05  PV-DPG54-DIFFS-NEW-IND   PIC X(8)    VALUE SPACES.       04810005
048200         88  PV-DPG54-DIFFS-NEW-VALUES        VALUE '54-NEW  '.   04820005
048300     05  PV-DPG54-DIFFS-IND-IND   PIC X(8)    VALUE SPACES.       04830005
048400         88  PV-DPG54-DIFFS-INDICATORS        VALUE '54-IND  '.   04840005
048500     05  PV-DPG54-DIFFS-W-IND     PIC X(8)    VALUE SPACES.       04850005
048600         88  PV-DPG54-DIFFS-WARNING           VALUE '54-WARN '.   04860005
048700     05  PV-DPG54-DIFFS-ERMSG-IND PIC X(8)    VALUE SPACES.       04870005
048800         88  PV-DPG54-DIFFS-ERRMSG-TEXT       VALUE '54-TEXT '.   04880005
048900         88  PV-DPG54-DIFFS-ERRMSG-NONE       VALUE '54-NOERR'.   04890005
049000* ************************************************************** *04900005
049100* *      DPG55 DIFFERENCES: MISC, KNOWN ERRS, NEW VALUES.      * *04910005
049200* ************************************************************** *04920005
049300     05  PV-DPG55-DIFFS-MISC-IND  PIC X(8)    VALUE SPACES.       04930005
049400         88  PV-DPG55-DIFFS-MISC-FOUND        VALUE '55-MISC '.   04940005
049500     05  PV-DPG55-DIFFS-KNOWN-IND PIC X(8)    VALUE SPACES.       04950005
049600         88  PV-DPG55-DIFFS-KNOWN-ERRORS      VALUE '55-KNOWN'.   04960005
049700     05  PV-DPG55-DIFFS-NEW-IND   PIC X(8)    VALUE SPACES.       04970005
049800         88  PV-DPG55-DIFFS-NEW-FIELDS        VALUE '55-NEW  '.   04980005
049900* ************************************************************** *04990005
050000* *      DPG56 DIFFERENCES: MISC, KNOWN ERRS, NEW VALUES.      * *05000005
050100* ************************************************************** *05010005
050200     05  PV-DPG56-DIFFS-MISC-IND  PIC X(8)    VALUE SPACES.       05020005
050300         88  PV-DPG56-DIFFS-MISC-FOUND        VALUE '56-MISC '.   05030005
050400     05  PV-DPG56-DIFFS-KNOWN-IND PIC X(8)    VALUE SPACES.       05040005
050500         88  PV-DPG56-DIFFS-KNOWN-ERRORS      VALUE '56-KNOWN'.   05050005
050600     05  PV-DPG56-DIFFS-NEW-IND   PIC X(8)    VALUE SPACES.       05060005
050700         88  PV-DPG56-DIFFS-NEW-FIELDS        VALUE '56-NEW  '.   05070005
050800                                                                  05080005
050900                                                                  05090005
051000* ************************************************************** *05100005
051100* * OUTPUT PRINT LINE.                                         * *05110005
051200* ************************************************************** *05120005
051300 01  OUTPUT-PRINT-LINE.                                           05130005
051400     05  OPL-LEVEL05              PIC X(132)  VALUE SPACES.       05140005
051500     05  PROD-HEADER-LINE REDEFINES OPL-LEVEL05.                  05150005
051600         10  PHL-HEADER-LEFT      PIC X(49).                      05160005
051700         10  PHL-HEADER-TITLE     PIC X(34).                      05170005
051800         10  PHL-HEADER-RIGHT.                                    05180005
051900             15  PHL-HEADER-RIGHT-FLD1                            05190005
052000                                  PIC X(1).                       05200005
052100             15  PHL-HEADER-RIGHT-FLD2                            05210005
052200                                  PIC X(1).                       05220005
052300             15  PHL-TESTCASE-ID  PIC X(7).                       05230005
052400             15  PHL-HEADER-RIGHT-FLD3                            05240005
052500                                  PIC X(1).                       05250005
052600             15  PHL-HEADER-RIGHT-FLD4                            05260005
052700                                  PIC X(39).                      05270005
052800                                                                  05280005
052900     05  OUTPUT-HEADER-LINE-1 REDEFINES OPL-LEVEL05.              05290005
053000         10  OHL-1-PART1.                                         05300005
053100             15  OHL1-LEFT11      PIC X(17).                      05310005
053200             15  OHL1-TITLE11     PIC X(08).                      05320005
053300             15  OHL1-RIGHT11     PIC X(17).                      05330005
053400             15  FILLER           PIC X(03).                      05340005
053500         10  OHL-1-PART2.                                         05350005
053600             15  OHL1-LEFT12      PIC X(17).                      05360005
053700             15  OHL1-TITLE12     PIC X(08).                      05370005
053800             15  OHL1-RIGHT12     PIC X(17).                      05380005
053900             15  FILLER           PIC X(03).                      05390005
054000         10  OHL-1-PART3.                                         05400005
054100             15  OHL1-LEFT13      PIC X(17).                      05410005
054200             15  OHL1-TITLE13     PIC X(08).                      05420005
054300             15  OHL1-RIGHT13     PIC X(17).                      05430005
054400     05  OUTPUT-HEADER-LINE-2 REDEFINES OPL-LEVEL05.              05440005
054500         10  OHL-2-PART1.                                         05450005
054600             15  OHL2-LEFT21      PIC X(28).                      05460005
054700             15  OHL2-TITLE21     PIC X(08).                      05470005
054800             15  OHL2-RIGHT21     PIC X(28).                      05480005
054900         10  FILLER               PIC X(04).                      05490005
055000         10  OHL-2-PART2.                                         05500005
055100             15  OHL2-LEFT22      PIC X(28).                      05510005
055200             15  OHL2-TITLE22     PIC X(08).                      05520005
055300             15  OHL2-RIGHT22     PIC X(28).                      05530005
055400     05  OUTPUT-DATA-LINE-1 REDEFINES OPL-LEVEL05.                05540005
055500         10  ODL-1-PART1.                                         05550005
055600             15  ODL1-T11         PIC X(19).                      05560005
055700             15  ODL1-V11         PIC X(23).                      05570005
055800             15  FILLER           PIC X(03).                      05580005
055900         10  ODL-1-PART2.                                         05590005
056000             15  ODL1-T21         PIC X(19).                      05600005
056100             15  ODL1-V21         PIC X(23).                      05610005
056200             15  FILLER           PIC X(03).                      05620005
056300         10  ODL-1-PART3.                                         05630005
056400             15  ODL1-T31         PIC X(19).                      05640005
056500             15  ODL1-V31         PIC X(23).                      05650005
056600     05  OUTPUT-DATA-LINE-2 REDEFINES OPL-LEVEL05.                05660005
056700         10  ODL-2-PART1.                                         05670005
056800             15  ODL2-ASTER1      PIC X(01).                      05680005
056900             15  ODL2-T11         PIC X(25).                      05690005
057000             15  FILLER           PIC X(01).                      05700005
057100             15  ODL2-V11         PIC X(18).                      05710005
057200             15  FILLER           PIC X(01).                      05720005
057300             15  ODL2-V12         PIC X(18).                      05730005
057400         10  FILLER               PIC X(04).                      05740005
057500         10  ODL-2-PART2.                                         05750005
057600             15  ODL2-ASTER2      PIC X(01).                      05760005
057700             15  ODL2-T21         PIC X(25).                      05770005
057800             15  FILLER           PIC X(01).                      05780005
057900             15  ODL2-V21         PIC X(18).                      05790005
058000             15  FILLER           PIC X(01).                      05800005
058100             15  ODL2-V22         PIC X(18).                      05810005
058200                                                                  05820005
058300                                                                  05830005
058400* ************************************************************** *05840005
058500* * WORKING STORAGE AREA FOR DPKUT500.  USED FOR PROD VERSION. * *05850005
058600* ************************************************************** *05860005
058700     COPY DPWS500.                                                05870005
058800                                                                  05880005
058900* ************************************************************** *05890005
059000* * WORKING STORAGE AREA FOR DPKUT500.  COPY FOR TEST VERSION. * *05900005
059100* ************************************************************** *05910005
059200     COPY DPWS500 REPLACING DP500 BY DT500                        05920005
059300                  REPLACING DPG51 BY DTG51                        05930005
059400                  REPLACING DPG52 BY DTG52                        05940005
059500                  REPLACING DPG53 BY DTG53                        05950005
059600                  REPLACING DPG54 BY DTG54                        05960005
059700                  REPLACING DPG55 BY DTG55                        05970005
059800                  REPLACING DPG56 BY DTG56.                       05980005
059900                                                                  05990005
060000* ************************************************************** *06000005
060100* * SAVE AREA FOR DPWS500 - PROD VERSION.                      * *06010005
060200* * ONLY AREAS USED ARE XPG51, XPG52, XPG53.                   * *06020005
060300* ************************************************************** *06030005
060400     COPY DPWS500 REPLACING DP500 BY XP500                        06040005
060500                  REPLACING DPG51 BY XPG51                        06050005
060600                  REPLACING DPG52 BY XPG52                        06060005
060700                  REPLACING DPG53 BY XPG53                        06070005
060800                  REPLACING DPG54 BY XPG54                        06080005
060900                  REPLACING DPG55 BY XPG55                        06090005
061000                  REPLACING DPG56 BY XPG56.                       06100005
061100                                                                  06110005
061200* ************************************************************** *06120005
061300* * SAVE AREA FOR DPWS500 - TEST VERSION.                      * *06130005
061400* * ONLY AREAS USED ARE XPG51, XPG52, XPG53.                   * *06140005
061500* ************************************************************** *06150005
061600     COPY DPWS500 REPLACING DP500 BY XT500                        06160005
061700                  REPLACING DPG51 BY XTG51                        06170005
061800                  REPLACING DPG52 BY XTG52                        06180005
061900                  REPLACING DPG53 BY XTG53                        06190005
062000                  REPLACING DPG54 BY XTG54                        06200005
062100                  REPLACING DPG55 BY XTG55                        06210005
062200                  REPLACING DPG56 BY XTG56.                       06220005
062300                                                                  06230005
062400* ************************************************************** *06240005
062500* * WORKING STORAGE AREA FOR STANDARD REPORT HEADER            * *06250005
062600* ************************************************************** *06260005
062700     COPY DPWS132O.                                               06270005
062800                                                                  06280005
062900 01  FILLER                     PIC X(55)    VALUE                06290005
063000                '** END OF DPKUT951 WORKING STORAGE **'.          06300005
063100                                                                  06310005
063200* ************************************************************** *06320005
063300 LINKAGE SECTION.                                                 06330005
063400* * THIS DEFINES THE EXECUTION-TIME PARAMETERS.                * *06340005
063500* ************************************************************** *06350005
063600 01  LS-EXEC-PARMS.                                               06360005
063700     05  LS-PARM-LEN            PIC S9(4)  COMP.                  06370005
063800     05  LS-PARM-VERSION        PIC X(1).                         06380005
063900     05  LS-PARM-LOADMOD        PIC X(8).                         06390005
064000                                                                  06400005
064100* ************************************************************** *06410005
064200* * PROGRAM MAINLINE                                           * *06420005
064300* ************************************************************** *06430005
064400 PROCEDURE DIVISION USING LS-EXEC-PARMS.                          06440005
064500                                                                  06450005
064600 0000-MAINLINE.                                                   06460005
064700                                                                  06470005
064800     PERFORM 1000-HOUSEKEEPING.                                   06480005
064900                                                                  06490005
065000     PERFORM UNTIL PV-CCIN-EOF                                    06500005
065100         IF  CC51                                                 06510005
065200             ADD 1 TO PV-CC-51-CNT                                06520005
065300             IF  PV-CC-51-CNT = 1                                 06530005
065400             AND PV-CC-52-CNT = 0                                 06540005
065500             AND PV-CC-53-CNT = 0                                 06550005
065600                 CONTINUE                                         06560005
065700             ELSE                                                 06570005
065800                 PERFORM 9998-CONTROL-CARD-ERROR                  06580005
065900             END-IF                                               06590005
066000                                                                  06600005
066100            MOVE CC51-SYS-DT-N                                    06610005
066200              TO DPG51-SYSTEM-DATE-N                              06620005
066300                 DTG51-SYSTEM-DATE-N                              06630005
066400                                                                  06640005
066500            MOVE CC51-CAL                                         06650005
066600              TO DPG51-CALENDAR-TYPE                              06660005
066700                 DTG51-CALENDAR-TYPE                              06670005
066800                                                                  06680005
066900            MOVE CC51-ID-FLAG                                     06690005
067000              TO DPG51-INCREMENT-DECREMENT-FLAG                   06700005
067100                 DTG51-INCREMENT-DECREMENT-FLAG                   06710005
067200                                                                  06720005
067300            MOVE CC51-ID-BUS-DAYS-X                               06730005
067400              TO DPG51-INCR-DECR-BUS-DAYS-X                       06740005
067500                 DTG51-INCR-DECR-BUS-DAYS-X                       06750005
067600                                                                  06760005
067700            MOVE CC51-ID-DAYS-X                                   06770005
067800              TO DPG51-INCR-DECR-DAYS-X                           06780005
067900                 DTG51-INCR-DECR-DAYS-X                           06790005
068000                                                                  06800005
068100            MOVE CC51-ID-FSCL-WK-X                                06810005
068200              TO DPG51-INCR-DECR-FISCAL-WEEK-X                    06820005
068300                 DTG51-INCR-DECR-FISCAL-WEEK-X                    06830005
068400                                                                  06840005
068500            MOVE CC51-ID-FSCL-PRD-X                               06850005
068600              TO DPG51-INCR-DECR-FISCAL-PRD-X                     06860005
068700                 DTG51-INCR-DECR-FISCAL-PRD-X                     06870005
068800                                                                  06880005
068900            MOVE CC51-CC-PVT-YR-X                                 06890005
069000              TO DPG51-CENTURY-PIVOT-YEAR-X                       06900005
069100                 DTG51-CENTURY-PIVOT-YEAR-X                       06910005
069200                                                                  06920005
069300         ELSE                                                     06930005
069400             IF CC52                                              06940005
069500                 ADD 1 TO PV-CC-52-CNT                            06950005
069600                 IF  PV-CC-51-CNT = 1                             06960005
069700                 AND PV-CC-52-CNT = 1                             06970005
069800                 AND PV-CC-53-CNT = 0                             06980005
069900                      CONTINUE                                    06990005
070000                 ELSE                                             07000005
070100                      PERFORM 9998-CONTROL-CARD-ERROR             07010005
070200                 END-IF                                           07020005
070300                                                                  07030005
070400                 MOVE CC52-DT-FMT-CD                              07040005
070500                   TO DPG52-LK-DATE-FORMAT-CODE                   07050005
070600                      DTG52-LK-DATE-FORMAT-CODE                   07060005
070700                                                                  07070005
070800                 MOVE CC52-DT-INPUT                               07080005
070900                   TO DPG52-LK-DATE-INPUT                         07090005
071000                      DTG52-LK-DATE-INPUT                         07100005
071100                                                                  07110005
071200             ELSE                                                 07120005
071300                 IF CC53                                          07130005
071400                     ADD 1 TO PV-CC-53-CNT                        07140005
071500                                                                  07150005
071600                     IF  PV-CC-51-CNT = 1                         07160005
071700                     AND PV-CC-52-CNT = 1                         07170005
071800                     AND PV-CC-53-CNT = 1                         07180005
071900                         INITIALIZE PV-CC-51-CNT                  07190005
072000                                    PV-CC-52-CNT                  07200005
072100                                    PV-CC-53-CNT                  07210005
072200                     ELSE                                         07220005
072300                          PERFORM 9998-CONTROL-CARD-ERROR         07230005
072400                     END-IF                                       07240005
072500                                                                  07250005
072600                     MOVE CC53-CMPR-DT-FMT-CODE                   07260005
072700                       TO DPG53-LK-CMPR-DATE-FORMAT-CODE          07270005
072800                          DTG53-LK-CMPR-DATE-FORMAT-CODE          07280005
072900                                                                  07290005
073000                     MOVE CC53-CMPR-DT-INPUT                      07300005
073100                       TO DPG53-LK-CMPR-DATE-INPUT                07310005
073200                          DTG53-LK-CMPR-DATE-INPUT                07320005
073300                                                                  07330005
073400                     EVALUATE TRUE                                07340005
073500                         WHEN PV-PARM-PROD-RUN                    07350005
073600                             PERFORM 3000-PROCESS-PROD-REQUEST    07360005
073700                         WHEN PV-PARM-TEST-RUN                    07370005
073800                             PERFORM 4000-PROCESS-TEST-REQUEST    07380005
073900                         WHEN PV-PARM-DELTA-RUN                   07390005
074000                             PERFORM 5000-PROCESS-DELTA-REQUEST   07400005
074100                     END-EVALUATE                                 07410005
074200                                                                  07420005
074300                     ADD 1 TO PV-TEST-CASES-PROCESSED             07430005
074400                                                                  07440005
074500                     INITIALIZE DPG51  DPG52  DPG53               07450005
074600                                DPG54  DPG55  DPG56               07460005
074700                                XPG51  XPG52  XPG53               07470005
074800                                XPG54  XPG55  XPG56               07480005
074900                                                                  07490005
075000                     INITIALIZE DTG51  DTG52  DTG53               07500005
075100                                DTG54  DTG55  DTG56               07510005
075200                                XTG51  XTG52  XTG53               07520005
075300                                XTG54  XTG55  XTG56               07530005
075400                 END-IF                                           07540005
075500             END-IF                                               07550005
075600         END-IF                                                   07560005
075700                                                                  07570005
075800         PERFORM 7002-READ-CCIN                                   07580005
075900                                                                  07590005
076000     END-PERFORM.                                                 07600005
076100                                                                  07610005
076200     PERFORM 1100-NORMAL-EOJ.                                     07620005
076300                                                                  07630005
076400     GOBACK.                                                      07640005
076500                                                                  07650005
076600                                                                  07660005
076700* ************************************************************** *07670005
076800* * HOUSEKEEPING: OPEN FILES, INITIALIZE, VALIDATE RUN PARMS.  * *07680005
076900* ************************************************************** *07690005
077000 1000-HOUSEKEEPING.                                               07700005
077100                                                                  07710005
077200     OPEN INPUT  CONTROL-CARDS.                                   07720005
077300     OPEN OUTPUT PRINT-REPORT.                                    07730005
077400                                                                  07740005
077500     INITIALIZE DPG51  DPG52  DPG53                               07750005
077600                DPG54  DPG55  DPG56                               07760005
077700                XPG51  XPG52  XPG53                               07770005
077800                XPG54  XPG55  XPG56.                              07780005
077900                                                                  07790005
078000     INITIALIZE DTG51  DTG52  DTG53                               07800005
078100                DTG54  DTG55  DTG56                               07810005
078200                XTG51  XTG52  XTG53                               07820005
078300                XTG54  XTG55  XTG56.                              07830005
078400                                                                  07840005
078500     INITIALIZE OUTPUT-PRINT-LINE.                                07850007
078600                                                                  07860007
078700     MOVE LS-PARM-VERSION TO PV-LS-PARM-VERSION.                  07870005
078800     EVALUATE TRUE                                                07880005
078900         WHEN PV-PARM-PROD-RUN                                    07890005
079000             CONTINUE                                             07900005
079100         WHEN PV-PARM-TEST-RUN                                    07910005
079200         WHEN PV-PARM-DELTA-RUN                                   07920005
079300             MOVE LS-PARM-LOADMOD TO DT500-KOHLS-CALENDAR-ROUTINE 07930005
079400                                     PV-TESTMODULE-LOADMOD        07940005
079500         WHEN OTHER                                               07950005
079600             PERFORM 9996-EXEC-PARM-ERROR                         07960005
079700     END-EVALUATE.                                                07970005
079800                                                                  07980005
079900     PERFORM 1001-SETUP-RPT-HEADING.                              07990005
080000                                                                  08000005
080100     SET PV-CCIN-NOT-EOF TO TRUE.                                 08010005
080200     PERFORM 7001-READ-CCIN-PRIME.                                08020005
080300                                                                  08030005
080400                                                                  08040005
080500* ************************************************************** *08050005
080600* * THIS PARAGRAPH SETS UP THE KOHLS STD REPORT HEADER.        * *08060005
080700* ************************************************************** *08070005
080800 1001-SETUP-RPT-HEADING.                                          08080005
080900                                                                  08090005
081000     ACCEPT PV-TODAY-IS FROM DATE.                                08100005
081100     ACCEPT PV-TIME-IS  FROM TIME.                                08110005
081200                                                                  08120005
081300     MOVE PV-TODAY-MM     TO DP132O-RUN-MONTH.                    08130005
081400     MOVE PV-TODAY-DD     TO DP132O-RUN-DAY.                      08140005
081500     MOVE PV-TODAY-YY     TO DP132O-RUN-YEAR.                     08150005
081600                                                                  08160005
081700     MOVE PV-TIME-HH      TO DP132O-RUN-HOUR.                     08170005
081800     MOVE PV-TIME-MM      TO DP132O-RUN-MINUTE.                   08180005
081900                                                                  08190005
082000     MOVE PC-CURRENT-PROGRAM-NAME                                 08200005
082100                          TO DP132O-PROGRAM-NAME.                 08210005
082200     MOVE PV-LS-PARM-VERSION                                      08220005
082300                          TO DP132O-REPORT-NUMBER.                08230005
082400                                                                  08240005
082500     MOVE PV-PAGE-CNT     TO DP132O-PAGE-NUMBER.                  08250005
082600                                                                  08260005
082700                                                                  08270005
082800* ************************************************************** *08280005
082900* * NORMAL END OF RUN.                                         * *08290005
083000* ************************************************************** *08300005
083100 1100-NORMAL-EOJ.                                                 08310005
083200     DISPLAY PC-CURRENT-PROGRAM-NAME                              08320005
083300             PC-NORMAL-EOJ.                                       08330005
083400     DISPLAY PC-CURRENT-PROGRAM-NAME                              08340005
083500             ' NUMBER OF TEST CASES PROCESSED...: *'              08350005
083600             PV-TEST-CASES-PROCESSED '*'.                         08360005
083700     EVALUATE TRUE                                                08370005
083800         WHEN PV-PARM-PROD-RUN                                    08380005
083900             DISPLAY PC-CURRENT-PROGRAM-NAME                      08390005
084000                     ' THRU PROD VERSION OF DATE ROUTINE.'        08400005
084100         WHEN PV-PARM-TEST-RUN                                    08410005
084200             DISPLAY PC-CURRENT-PROGRAM-NAME                      08420005
084300                     ' THRU TEST VERSION OF DATE ROUTINE: '       08430005
084400                     PV-TESTMODULE-LOADMOD '.'                    08440005
084500         WHEN PV-PARM-DELTA-RUN                                   08450005
084600             DISPLAY PC-CURRENT-PROGRAM-NAME                      08460005
084700                     ' THRU PROD VERSION OF DATE ROUTINE,'        08470005
084800             DISPLAY PC-CURRENT-PROGRAM-NAME                      08480005
084900                     ' AND  TEST VERSION OF DATE ROUTINE: '       08490005
085000                     PV-TESTMODULE-LOADMOD '.'                    08500005
085100     END-EVALUATE.                                                08510005
085200                                                                  08520005
085300     MOVE PC-PARM-END-OF-RUN TO PV-LS-PARM-VERSION.               08530005
085400     PERFORM 6100-PRINT-RPT-HEADING.                              08540005
085500     MOVE  PC-NORMAL-EOJ     TO OHL1-LEFT11.                      08550005
085600     PERFORM 6104-WRITE-AFTER-4.                                  08560005
085700                                                                  08570005
085800                                                                  08580005
085900* ************************************************************** *08590005
086000* *  PROCESS REQUEST TO EXERCISE THE PROD ROUTINE.             * *08600005
086100* ************************************************************** *08610005
086200 3000-PROCESS-PROD-REQUEST.                                       08620005
086300                                                                  08630005
086400     MOVE DPG51 TO XPG51.                                         08640005
086500     MOVE DPG52 TO XPG52.                                         08650005
086600     MOVE DPG53 TO XPG53.                                         08660005
086700                                                                  08670005
086800     CALL DP500-KOHLS-CALENDAR-ROUTINE                            08680005
086900          USING DPG51 DPG52 DPG53 DPG54 DPG55 DPG56.              08690005
087000                                                                  08700005
087100     PERFORM 6100-PRINT-RPT-HEADING.                              08710005
087200     PERFORM 3100-FORMAT-PROD-INPUTS.                             08720005
087300     PERFORM 3200-FORMAT-PROD-OUTPUTS.                            08730005
087400                                                                  08740005
087500                                                                  08750005
087600* ************************************************************** *08760005
087700* * THIS PARAGRAPH PRINTS THE PROD REPORT INPUTS (51-53).      * *08770005
087800* ************************************************************** *08780005
087900 3100-FORMAT-PROD-INPUTS.                                         08790005
088000                                                                  08800005
088100     MOVE PC-RFI-51-SYS-DT     TO ODL1-T11.                       08810005
088200     STRING '(' DPG51-SYSTEM-DATE-N ')'                           08820005
088300            DELIMITED BY SIZE  INTO ODL1-V11.                     08830005
088400                                                                  08840005
088500     MOVE  PC-RFI-52-FMT-I     TO ODL1-T21.                       08850005
088600     STRING '(' XPG52-LK-DATE-FORMAT-CODE ')'                     08860005
088700            DELIMITED BY SIZE  INTO ODL1-V21.                     08870005
088800                                                                  08880005
088900     MOVE PC-RFI-53-CFMT-I     TO ODL1-T31.                       08890005
089000     STRING '(' XPG53-LK-CMPR-DATE-FORMAT-CODE ')'                08900005
089100            DELIMITED BY SIZE  INTO ODL1-V31.                     08910005
089200     PERFORM 6101-WRITE-AFTER-1.                                  08920005
089300                                                                  08930005
089400                                                                  08940005
089500     MOVE PC-RFI-51-CALTYP     TO ODL1-T11.                       08950005
089600     STRING '(' DPG51-CALENDAR-TYPE ')'                           08960005
089700            DELIMITED BY SIZE  INTO ODL1-V11.                     08970005
089800                                                                  08980005
089900     MOVE PC-RFI-52-DT-I       TO ODL1-T21.                       08990005
090000     STRING '(' XPG52-LK-DATE-INPUT ')'                           09000005
090100            DELIMITED BY SIZE  INTO ODL1-V21.                     09010005
090200                                                                  09020005
090300     MOVE PC-RFI-53-CDT-I       TO ODL1-T31.                      09030005
090400     STRING '(' XPG53-LK-CMPR-DATE-INPUT ')'                      09040005
090500            DELIMITED BY SIZE  INTO ODL1-V31.                     09050005
090600     PERFORM 6101-WRITE-AFTER-1.                                  09060005
090700                                                                  09070005
090800                                                                  09080005
090900     MOVE PC-RFI-51-ID-IND     TO ODL1-T11.                       09090005
091000     STRING '(' DPG51-INCREMENT-DECREMENT-FLAG ')'                09100005
091100            DELIMITED BY SIZE  INTO ODL1-V11.                     09110005
091200     PERFORM 6101-WRITE-AFTER-1.                                  09120005
091300                                                                  09130005
091400                                                                  09140005
091500     MOVE PC-RFI-51-ID-BUS     TO ODL1-T11.                       09150005
091600     STRING '(' DPG51-INCR-DECR-BUS-DAYS-X ')'                    09160005
091700            DELIMITED BY SIZE  INTO ODL1-V11.                     09170005
091800                                                                  09180005
091900     MOVE PC-RFI-52-FMT-O      TO ODL1-T21.                       09190005
092000     STRING '(' DPG52-LK-DATE-FORMAT-CODE ')'                     09200005
092100            DELIMITED BY SIZE  INTO ODL1-V21.                     09210005
092200                                                                  09220005
092300     MOVE PC-RFI-53-CFMT-O     TO ODL1-T31.                       09230005
092400     STRING '(' DPG53-LK-CMPR-DATE-FORMAT-CODE ')'                09240005
092500            DELIMITED BY SIZE  INTO ODL1-V31.                     09250005
092600     PERFORM 6101-WRITE-AFTER-1.                                  09260005
092700                                                                  09270005
092800                                                                  09280005
092900     MOVE  PC-RFI-51-ID-DAYS   TO ODL1-T11.                       09290005
093000     STRING '(' DPG51-INCR-DECR-DAYS-X ')'                        09300005
093100            DELIMITED BY SIZE  INTO ODL1-V11.                     09310005
093200                                                                  09320005
093300     MOVE PC-RFI-52-DT-O       TO ODL1-T21.                       09330005
093400     STRING '(' DPG52-LK-DATE-INPUT ')'                           09340005
093500            DELIMITED BY SIZE  INTO ODL1-V21.                     09350005
093600                                                                  09360005
093700     MOVE PC-RFI-53-CDT-O       TO ODL1-T31.                      09370005
093800     STRING '(' DPG53-LK-CMPR-DATE-INPUT ')'                      09380005
093900            DELIMITED BY SIZE  INTO ODL1-V31.                     09390005
094000     PERFORM 6101-WRITE-AFTER-1.                                  09400005
094100                                                                  09410005
094200                                                                  09420005
094300* ************************************************************** *09430005
094400* * THIS PARAGRAPH PRINTS THE PROD REPORT OUTPUTS (54-56).     * *09440005
094500* ************************************************************** *09450005
094600 3200-FORMAT-PROD-OUTPUTS.                                        09460005
094700                                                                  09470005
094800*--> PROD  OUTPARMS, LINE 01.                                     09480005
094900     MOVE PC-TXT-PROD-54 TO OHL2-TITLE21.                         09490005
095000     MOVE PC-TXT-PROD-56 TO OHL2-TITLE22.                         09500005
095100     MOVE PC-ASTERS28    TO OHL2-LEFT21  OHL2-RIGHT21             09510005
095200                            OHL2-LEFT22  OHL2-RIGHT22.            09520005
095300     PERFORM 6102-WRITE-AFTER-2.                                  09530005
095400                                                                  09540005
095500*--> PROD  OUTPARMS, LINE 02.                                     09550005
095600     MOVE PC-RFI-54-CAL-IND    TO ODL2-T11.                       09560005
095700     STRING '(' DPG54-CALENDAR-TYPE-IND ')'                       09570005
095800            DELIMITED BY SIZE  INTO ODL2-V11.                     09580005
095900                                                                  09590005
096000     MOVE  PC-RFI-56-F01        TO ODL2-T21.                      09600005
096100     STRING '(' DPG56-FISCAL-YEAR-NBR-X ')'                       09610005
096200            DELIMITED BY SIZE  INTO ODL2-V21.                     09620005
096300     PERFORM 6101-WRITE-AFTER-1.                                  09630005
096400                                                                  09640005
096500*--> PROD  OUTPARMS, LINE 03.                                     09650005
096600     MOVE PC-RFI-54-DT-IND     TO ODL2-T11.                       09660005
096700     STRING '(' DPG54-DATE-VALID-IND ')'                          09670005
096800            DELIMITED BY SIZE  INTO ODL2-V11.                     09680005
096900                                                                  09690005
097000     MOVE PC-RFI-56-F02         TO ODL2-T21.                      09700005
097100     STRING '(' DPG56-FIRST-FD-DB2-ISO-FMT ')'                    09710005
097200            DELIMITED BY SIZE  INTO ODL2-V21.                     09720005
097300     PERFORM 6101-WRITE-AFTER-1.                                  09730005
097400                                                                  09740005
097500*--> PROD  OUTPARMS, LINE 04.                                     09750005
097600     MOVE  PC-RFI-54-CDT-IND   TO ODL2-T11.                       09760005
097700     STRING '(' DPG54-CMPR-DATE-VALID-IND ')'                     09770005
097800            DELIMITED BY SIZE  INTO ODL2-V11.                     09780005
097900                                                                  09790005
098000     MOVE  PC-RFI-56-F03        TO ODL2-T21.                      09800005
098100     STRING '(' DPG56-FIRST-FD-GREG-CC ')'                        09810005
098200            DELIMITED BY SIZE  INTO ODL2-V21.                     09820005
098300     PERFORM 6101-WRITE-AFTER-1.                                  09830005
098400                                                                  09840005
098500*--> PROD  OUTPARMS, LINE 05.                                     09850005
098600     MOVE  PC-RFI-54-ID-IND    TO ODL2-T11.                       09860005
098700     STRING '(' DPG54-INCR-DECR-IND ')'                           09870005
098800            DELIMITED BY SIZE  INTO ODL2-V11.                     09880005
098900                                                                  09890005
099000     MOVE  PC-RFI-56-F04        TO ODL2-T21.                      09900005
099100     STRING '(' DPG56-FIRST-FD-GREG-FMT ')'                       09910005
099200            DELIMITED BY SIZE  INTO ODL2-V21.                     09920005
099300     PERFORM 6101-WRITE-AFTER-1.                                  09930005
099400                                                                  09940005
099500*--> PROD  OUTPARMS, LINE 06.                                     09950005
099600     MOVE PC-RFI-54-ERR-IND    TO ODL2-T11.                       09960005
099700     STRING '(' DPG54-ERROR-IND ')'                               09970005
099800            DELIMITED BY SIZE  INTO ODL2-V11.                     09980005
099900                                                                  09990005
100000     MOVE  PC-RFI-56-F05        TO ODL2-T21.                      10000005
100100     STRING '(' DPG56-FIRST-FD-GREG ')'                           10010005
100200            DELIMITED BY SIZE  INTO ODL2-V21.                     10020005
100300     PERFORM 6101-WRITE-AFTER-1.                                  10030005
100400                                                                  10040005
100500*--> PROD  OUTPARMS, LINE 07.                                     10050005
100600     MOVE DPG54-ERROR-MESSAGE TO                                  10060005
100700                PV-PROD-MESSAGE-WORK-AREA.                        10070005
100800     MOVE PC-RFI-54-EMSG1      TO ODL2-T11.                       10080005
100900     STRING '(' PV-EMSG-P1 ')'                                    10090005
101000            DELIMITED BY SIZE  INTO ODL2-V11.                     10100005
101100                                                                  10110005
101200     MOVE  PC-RFI-56-F06        TO ODL2-T21.                      10120005
101300     STRING '(' DPG56-FIRST-FD-JULIAN ')'                         10130005
101400            DELIMITED BY SIZE  INTO ODL2-V21.                     10140005
101500     PERFORM 6101-WRITE-AFTER-1.                                  10150005
101600                                                                  10160005
101700*--> PROD  OUTPARMS, LINE 08.                                     10170005
101800     MOVE PC-RFI-54-EMSG2      TO ODL2-T11.                       10180005
101900     STRING '(' PV-EMSG-P2 ')'                                    10190005
102000            DELIMITED BY SIZE  INTO ODL2-V11.                     10200005
102100                                                                  10210005
102200     MOVE PC-RFI-56-F07         TO ODL2-T21.                      10220005
102300     STRING '(' DPG56-LAST-FD-DB2-ISO-FMT ')'                     10230005
102400            DELIMITED BY SIZE  INTO ODL2-V21.                     10240005
102500     PERFORM 6101-WRITE-AFTER-1.                                  10250005
102600                                                                  10260005
102700*--> PROD  OUTPARMS, LINE 09.                                     10270005
102800     MOVE PC-RFI-54-EMSG3      TO ODL2-T11.                       10280005
102900     STRING '(' PV-EMSG-P3 ')'                                    10290005
103000            DELIMITED BY SIZE  INTO ODL2-V11.                     10300005
103100                                                                  10310005
103200     MOVE  PC-RFI-56-F08        TO ODL2-T21.                      10320005
103300     STRING '(' DPG56-LAST-FD-GREG-CC ')'                         10330005
103400            DELIMITED BY SIZE  INTO ODL2-V21.                     10340005
103500     PERFORM 6101-WRITE-AFTER-1.                                  10350005
103600                                                                  10360005
103700*--> PROD  OUTPARMS, LINE 10.                                     10370005
103800     MOVE  PC-RFI-56-F09        TO ODL2-T21.                      10380005
103900     STRING '(' DPG56-LAST-FD-GREG-FMT ')'                        10390005
104000            DELIMITED BY SIZE  INTO ODL2-V21.                     10400005
104100     PERFORM 6101-WRITE-AFTER-1.                                  10410005
104200                                                                  10420005
104300*--> PROD  OUTPARMS, LINE 11.                                     10430005
104400     MOVE  PC-RFI-56-F10        TO ODL2-T21.                      10440005
104500     STRING '(' DPG56-LAST-FD-GREG ')'                            10450005
104600            DELIMITED BY SIZE  INTO ODL2-V21.                     10460005
104700     PERFORM 6101-WRITE-AFTER-1.                                  10470005
104800                                                                  10480005
104900*--> PROD  OUTPARMS, LINE 12.                                     10490005
105000     MOVE PC-TXT-PROD-55 TO OHL2-TITLE21.                         10500005
105100     MOVE PC-ASTERS28    TO OHL2-LEFT21  OHL2-RIGHT21.            10510005
105200                                                                  10520005
105300     MOVE  PC-RFI-56-F11        TO ODL2-T21.                      10530005
105400     STRING '(' DPG56-LAST-FD-JULIAN ')'                          10540005
105500            DELIMITED BY SIZE  INTO ODL2-V21.                     10550005
105600     PERFORM 6101-WRITE-AFTER-1.                                  10560005
105700                                                                  10570005
105800*--> PROD  OUTPARMS, LINE 13.                                     10580005
105900     MOVE  PC-RFI-55-A01       TO ODL2-T11.                       10590005
106000     STRING '(' DPG55-DB2-ISO-DATE-FMT ')'                        10600005
106100            DELIMITED BY SIZE  INTO ODL2-V11.                     10610005
106200                                                                  10620005
106300     MOVE  PC-RFI-56-F12        TO ODL2-T21.                      10630005
106400     STRING '(' DPG56-NBR-FISCAL-WEEKS-X ')'                      10640005
106500            DELIMITED BY SIZE  INTO ODL2-V21.                     10650005
106600     PERFORM 6101-WRITE-AFTER-1.                                  10660005
106700                                                                  10670005
106800*--> PROD  OUTPARMS, LINE 14.                                     10680005
106900     MOVE  PC-RFI-55-A02       TO ODL2-T11.                       10690005
107000     STRING '(' DPG55-DB2-ISO-DATE ')'                            10700005
107100            DELIMITED BY SIZE  INTO ODL2-V11.                     10710005
107200                                                                  10720005
107300     MOVE  PC-RFI-56-F13        TO ODL2-T21.                      10730005
107400     STRING '(' DPG56-FISCAL-WEEK-NBR-X ')'                       10740005
107500            DELIMITED BY SIZE  INTO ODL2-V21.                     10750005
107600     PERFORM 6101-WRITE-AFTER-1.                                  10760005
107700                                                                  10770005
107800*--> PROD  OUTPARMS, LINE 15.                                     10780005
107900     MOVE  PC-RFI-55-A03       TO ODL2-T11.                       10790005
108000     STRING '(' DPG55-GREG-CC-DATE-FMT ')'                        10800005
108100            DELIMITED BY SIZE  INTO ODL2-V11.                     10810005
108200                                                                  10820005
108300     MOVE  PC-RFI-56-F14        TO ODL2-T21.                      10830005
108400     STRING '(' DPG56-NBR-FISCAL-DAYS-X ')'                       10840005
108500            DELIMITED BY SIZE  INTO ODL2-V21.                     10850005
108600     PERFORM 6101-WRITE-AFTER-1.                                  10860005
108700                                                                  10870005
108800*--> PROD  OUTPARMS, LINE 16.                                     10880005
108900     MOVE  PC-RFI-55-A04       TO ODL2-T11.                       10890005
109000     STRING '(' DPG55-GREG-CC-DATE ')'                            10900005
109100            DELIMITED BY SIZE  INTO ODL2-V11.                     10910005
109200                                                                  10920005
109300     MOVE  PC-RFI-56-F15        TO ODL2-T21.                      10930005
109400     STRING '(' DPG56-CURR-FISCAL-SEASON ')'                      10940005
109500            DELIMITED BY SIZE  INTO ODL2-V21.                     10950005
109600     PERFORM 6101-WRITE-AFTER-1.                                  10960005
109700                                                                  10970005
109800*--> PROD  OUTPARMS, LINE 17.                                     10980005
109900     MOVE  PC-RFI-55-A05       TO ODL2-T11.                       10990005
110000     STRING '(' DPG55-GREG-DATE-FMT ')'                           11000005
110100            DELIMITED BY SIZE  INTO ODL2-V11.                     11010005
110200                                                                  11020005
110300     MOVE  PC-RFI-56-F16        TO ODL2-T21.                      11030005
110400     STRING '(' DPG56-FISCAL-QTR-NBR-X ')'                        11040005
110500            DELIMITED BY SIZE  INTO ODL2-V21.                     11050005
110600     PERFORM 6101-WRITE-AFTER-1.                                  11060005
110700                                                                  11070005
110800*--> PROD  OUTPARMS, LINE 18.                                     11080005
110900     MOVE  PC-RFI-55-A06       TO ODL2-T11.                       11090005
111000     STRING '(' DPG55-GREG-DATE ')'                               11100005
111100            DELIMITED BY SIZE  INTO ODL2-V11.                     11110005
111200                                                                  11120005
111300     MOVE  PC-RFI-56-F17        TO ODL2-T21.                      11130005
111400     STRING '(' DPG56-FIRST-FQ-DB2-ISO-FMT ')'                    11140005
111500            DELIMITED BY SIZE  INTO ODL2-V21.                     11150005
111600     PERFORM 6101-WRITE-AFTER-1.                                  11160005
111700                                                                  11170005
111800*--> PROD  OUTPARMS, LINE 19.                                     11180005
111900     MOVE  PC-RFI-55-A07       TO ODL2-T11.                       11190005
112000     STRING '(' DPG55-JULIAN-DATE-CCYYDDD ')'                     11200005
112100            DELIMITED BY SIZE  INTO ODL2-V11.                     11210005
112200                                                                  11220005
112300     MOVE  PC-RFI-56-F18        TO ODL2-T21.                      11230005
112400     STRING '(' DPG56-FIRST-FQ-GREG-CC ')'                        11240005
112500            DELIMITED BY SIZE  INTO ODL2-V21.                     11250005
112600     PERFORM 6101-WRITE-AFTER-1.                                  11260005
112700                                                                  11270005
112800*--> PROD  OUTPARMS, LINE 20.                                     11280005
112900     MOVE  PC-RFI-55-A08       TO ODL2-T11.                       11290005
113000     STRING '(' DPG55-JULIAN-DATE-FMT ')'                         11300005
113100            DELIMITED BY SIZE  INTO ODL2-V11.                     11310005
113200                                                                  11320005
113300     MOVE  PC-RFI-56-F19        TO ODL2-T21.                      11330005
113400     STRING '(' DPG56-FIRST-FQ-GREG-FMT ')'                       11340005
113500            DELIMITED BY SIZE  INTO ODL2-V21.                     11350005
113600     PERFORM 6101-WRITE-AFTER-1.                                  11360005
113700                                                                  11370005
113800*--> PROD  OUTPARMS, LINE 21.                                     11380005
113900     MOVE  PC-RFI-55-A09       TO ODL2-T11.                       11390005
114000     STRING '(' DPG55-JULIAN-DATE ')'                             11400005
114100            DELIMITED BY SIZE  INTO ODL2-V11.                     11410005
114200                                                                  11420005
114300     MOVE  PC-RFI-56-F20        TO ODL2-T21.                      11430005
114400     STRING '(' DPG56-FIRST-FQ-GREG ')'                           11440005
114500            DELIMITED BY SIZE  INTO ODL2-V21.                     11450005
114600     PERFORM 6101-WRITE-AFTER-1.                                  11460005
114700                                                                  11470005
114800*--> PROD  OUTPARMS, LINE 22.                                     11480005
115200                                                                  11520005
115300     MOVE  PC-RFI-56-F21        TO ODL2-T21.                      11530005
115400     STRING '(' DPG56-FIRST-FQ-JULIAN ')'                         11540005
115500            DELIMITED BY SIZE  INTO ODL2-V21.                     11550005
115600     PERFORM 6101-WRITE-AFTER-1.                                  11560005
115700                                                                  11570005
115800*--> PROD  OUTPARMS, LINE 23.                                     11580005
115900     MOVE  PC-RFI-55-A11       TO ODL2-T11.                       11590005
116000     STRING '(' DPG55-ALPHA-MONTH ')'                             11600005
116100            DELIMITED BY SIZE  INTO ODL2-V11.                     11610005
116200                                                                  11620005
116300     MOVE  PC-RFI-56-F22        TO ODL2-T21.                      11630005
116400     STRING '(' DPG56-LAST-FQ-DB2-ISO-FMT ')'                     11640005
116500            DELIMITED BY SIZE  INTO ODL2-V21.                     11650005
116600     PERFORM 6101-WRITE-AFTER-1.                                  11660005
116700                                                                  11670005
116800*--> PROD  OUTPARMS, LINE 24.                                     11680005
116900     MOVE  PC-RFI-55-A12       TO ODL2-T11.                       11690005
117000     STRING '(' DPG55-ALPHA-MONTH-ABBR3 ')'                       11700005
117100            DELIMITED BY SIZE  INTO ODL2-V11.                     11710005
117200                                                                  11720005
117300     MOVE  PC-RFI-56-F23        TO ODL2-T21.                      11730005
117400     STRING '(' DPG56-LAST-FQ-GREG-CC ')'                         11740005
117500            DELIMITED BY SIZE  INTO ODL2-V21.                     11750005
117600     PERFORM 6101-WRITE-AFTER-1.                                  11760005
117700                                                                  11770005
117800*--> PROD  OUTPARMS, LINE 25.                                     11780005
117900     MOVE  PC-RFI-55-A13       TO ODL2-T11.                       11790005
118000     STRING '(' DPG55-DAYS-IN-MONTH ')'                           11800005
118100            DELIMITED BY SIZE  INTO ODL2-V11.                     11810005
118200                                                                  11820005
118300     MOVE  PC-RFI-56-F24        TO ODL2-T21.                      11830005
118400     STRING '(' DPG56-LAST-FQ-GREG-FMT ')'                        11840005
118500            DELIMITED BY SIZE  INTO ODL2-V21.                     11850005
118600     PERFORM 6101-WRITE-AFTER-1.                                  11860005
118700                                                                  11870005
118800*--> PROD  OUTPARMS, LINE 26.                                     11880005
118900     MOVE  PC-RFI-55-A14       TO ODL2-T11.                       11890005
119000     STRING '(' DPG55-ALPHA-WEEK-DAY ')'                          11900005
119100            DELIMITED BY SIZE  INTO ODL2-V11.                     11910005
119200                                                                  11920005
119300     MOVE  PC-RFI-56-F25        TO ODL2-T21.                      11930005
119400     STRING '(' DPG56-LAST-FQ-GREG ')'                            11940005
119500            DELIMITED BY SIZE  INTO ODL2-V21.                     11950005
119600     PERFORM 6101-WRITE-AFTER-1.                                  11960005
119700                                                                  11970005
119800*--> PROD  OUTPARMS, LINE 27.                                     11980005
119900     MOVE  PC-RFI-55-A15       TO ODL2-T11.                       11990005
120000     STRING '(' DPG55-ALPHA-WEEK-DAY-ABBR3 ')'                    12000005
120100            DELIMITED BY SIZE  INTO ODL2-V11.                     12010005
120200                                                                  12020005
120300     MOVE  PC-RFI-56-F26        TO ODL2-T21.                      12030005
120400     STRING '(' DPG56-LAST-FQ-JULIAN ')'                          12040005
120500            DELIMITED BY SIZE  INTO ODL2-V21.                     12050005
120600     PERFORM 6101-WRITE-AFTER-1.                                  12060005
120700                                                                  12070005
120800*--> PROD  OUTPARMS, LINE 28.                                     12080005
120900     MOVE  PC-RFI-55-A16       TO ODL2-T11.                       12090005
121000     STRING '(' DPG55-ALPHA-WEEK-DAY-ABBR2 ')'                    12100005
121100            DELIMITED BY SIZE  INTO ODL2-V11.                     12110005
121200                                                                  12120005
121300     MOVE  PC-RFI-56-F27        TO ODL2-T21.                      12130005
121400     STRING '(' DPG56-NBR-FISCAL-QTR-WEEKS-X ')'                  12140005
121500            DELIMITED BY SIZE  INTO ODL2-V21.                     12150005
121600     PERFORM 6101-WRITE-AFTER-1.                                  12160005
121700                                                                  12170005
121800*--> PROD  OUTPARMS, LINE 29.                                     12180005
121900     MOVE  PC-RFI-55-A17       TO ODL2-T11.                       12190005
122000     STRING '(' DPG55-NUMERIC-WEEK-DAY-X ')'                      12200005
122100            DELIMITED BY SIZE  INTO ODL2-V11.                     12210005
122200                                                                  12220005
122300     MOVE  PC-RFI-56-F28        TO ODL2-T21.                      12230005
122400     STRING '(' DPG56-FISCAL-QTR-WEEK-X ')'                       12240005
122500            DELIMITED BY SIZE  INTO ODL2-V21.                     12250005
122600     PERFORM 6101-WRITE-AFTER-1.                                  12260005
122700                                                                  12270005
122800*--> PROD  OUTPARMS, LINE 30.                                     12280005
122900     MOVE  PC-RFI-55-A18       TO ODL2-T11.                       12290005
123000     STRING '(' DPG55-1ST-WKDY-DB2ISO-FMT ')'                     12300005
123100            DELIMITED BY SIZE  INTO ODL2-V11.                     12310005
123200                                                                  12320005
123300     MOVE  PC-RFI-56-F29        TO ODL2-T21.                      12330005
123400     STRING '(' DPG56-FISCAL-PERIOD-NBR-X ')'                     12340005
123500            DELIMITED BY SIZE  INTO ODL2-V21.                     12350005
123600     PERFORM 6101-WRITE-AFTER-1.                                  12360005
123700                                                                  12370005
123800*--> PROD  OUTPARMS, LINE 31.                                     12380005
123900     MOVE  PC-RFI-55-A19       TO ODL2-T11.                       12390005
124000     STRING '(' DPG55-1ST-WKDY-GREG-CC ')'                        12400005
124100            DELIMITED BY SIZE  INTO ODL2-V11.                     12410005
124200                                                                  12420005
124300     MOVE  PC-RFI-56-F30        TO ODL2-T21.                      12430005
124400     STRING '(' DPG56-FIRST-FP-DB2-ISO-FMT ')'                    12440005
124500            DELIMITED BY SIZE  INTO ODL2-V21.                     12450005
124600     PERFORM 6101-WRITE-AFTER-1.                                  12460005
124700                                                                  12470005
124800*--> PROD  OUTPARMS, LINE 32.                                     12480005
124900     MOVE  PC-RFI-55-A20       TO ODL2-T11.                       12490005
125000     STRING '(' DPG55-1ST-WKDY-GREG-FMT ')'                       12500005
125100            DELIMITED BY SIZE  INTO ODL2-V11.                     12510005
125200                                                                  12520005
125300     MOVE  PC-RFI-56-F31        TO ODL2-T21.                      12530005
125400     STRING '(' DPG56-FIRST-FP-GREG-CC ')'                        12540005
125500            DELIMITED BY SIZE  INTO ODL2-V21.                     12550005
125600     PERFORM 6101-WRITE-AFTER-1.                                  12560005
125700                                                                  12570005
125800*--> PROD  OUTPARMS, LINE 33.                                     12580005
125900     MOVE  PC-RFI-55-A21       TO ODL2-T11.                       12590005
126000     STRING '(' DPG55-1ST-WKDY-GREG ')'                           12600005
126100            DELIMITED BY SIZE  INTO ODL2-V11.                     12610005
126200                                                                  12620005
126300     MOVE  PC-RFI-56-F32        TO ODL2-T21.                      12630005
126400     STRING '(' DPG56-FIRST-FP-GREG-FMT ')'                       12640005
126500            DELIMITED BY SIZE  INTO ODL2-V21.                     12650005
126600     PERFORM 6101-WRITE-AFTER-1.                                  12660005
126700                                                                  12670005
126800*--> PROD  OUTPARMS, LINE 34.                                     12680005
126900     MOVE  PC-RFI-55-A22       TO ODL2-T11.                       12690005
127000     STRING '(' DPG55-1ST-WKDY-JULIAN ')'                         12700005
127100            DELIMITED BY SIZE  INTO ODL2-V11.                     12710005
127200                                                                  12720005
127300     MOVE  PC-RFI-56-F33        TO ODL2-T21.                      12730005
127400     STRING '(' DPG56-FIRST-FP-GREG ')'                           12740005
127500            DELIMITED BY SIZE  INTO ODL2-V21.                     12750005
127600     PERFORM 6101-WRITE-AFTER-1.                                  12760005
127700                                                                  12770005
127800*--> PROD  OUTPARMS, LINE 35.                                     12780005
127900     MOVE  PC-RFI-55-A23       TO ODL2-T11.                       12790005
128000     STRING '(' DPG55-LAST-WKDY-DB2ISO-FMT ')'                    12800005
128100            DELIMITED BY SIZE  INTO ODL2-V11.                     12810005
128200                                                                  12820005
128300     MOVE  PC-RFI-56-F34        TO ODL2-T21.                      12830005
128400     STRING '(' DPG56-FIRST-FP-JULIAN ')'                         12840005
128500            DELIMITED BY SIZE  INTO ODL2-V21.                     12850005
128600     PERFORM 6101-WRITE-AFTER-1.                                  12860005
128700                                                                  12870005
128800*--> PROD  OUTPARMS, LINE 36.                                     12880005
128900     MOVE  PC-RFI-55-A24       TO ODL2-T11.                       12890005
129000     STRING '(' DPG55-LAST-WKDY-GREG-CC ')'                       12900005
129100            DELIMITED BY SIZE  INTO ODL2-V11.                     12910005
129200                                                                  12920005
129300     MOVE  PC-RFI-56-F35        TO ODL2-T21.                      12930005
129400     STRING '(' DPG56-LAST-FP-DB2-ISO-FMT ')'                     12940005
129500            DELIMITED BY SIZE  INTO ODL2-V21.                     12950005
129600     PERFORM 6101-WRITE-AFTER-1.                                  12960005
129700                                                                  12970005
129800*--> PROD  OUTPARMS, LINE 37.                                     12980005
129900     MOVE  PC-RFI-55-A25       TO ODL2-T11.                       12990005
130000     STRING '(' DPG55-LAST-WKDY-GREG-FMT ')'                      13000005
130100            DELIMITED BY SIZE  INTO ODL2-V11.                     13010005
130200                                                                  13020005
130300     MOVE  PC-RFI-56-F36        TO ODL2-T21.                      13030005
130400     STRING '(' DPG56-LAST-FP-GREG-CC ')'                         13040005
130500            DELIMITED BY SIZE  INTO ODL2-V21.                     13050005
130600     PERFORM 6101-WRITE-AFTER-1.                                  13060005
130700                                                                  13070005
130800*--> PROD  OUTPARMS, LINE 38.                                     13080005
130900     MOVE  PC-RFI-55-A26       TO ODL2-T11.                       13090005
131000     STRING '(' DPG55-LAST-WKDY-GREG ')'                          13100005
131100            DELIMITED BY SIZE  INTO ODL2-V11.                     13110005
131200                                                                  13120005
131300     MOVE  PC-RFI-56-F37        TO ODL2-T21.                      13130005
131400     STRING '(' DPG56-LAST-FP-GREG-FMT ')'                        13140005
131500            DELIMITED BY SIZE  INTO ODL2-V21.                     13150005
131600     PERFORM 6101-WRITE-AFTER-1.                                  13160005
131700                                                                  13170005
131800*--> PROD  OUTPARMS, LINE 39.                                     13180005
131900     MOVE  PC-RFI-55-A27       TO ODL2-T11.                       13190005
132000     STRING '(' DPG55-LAST-WKDY-JULIAN ')'                        13200005
132100            DELIMITED BY SIZE  INTO ODL2-V11.                     13210005
132200                                                                  13220005
132300     MOVE  PC-RFI-56-F38        TO ODL2-T21.                      13230005
132400     STRING '(' DPG56-LAST-FP-GREG ')'                            13240005
132500            DELIMITED BY SIZE  INTO ODL2-V21.                     13250005
132600     PERFORM 6101-WRITE-AFTER-1.                                  13260005
132700                                                                  13270005
132800*--> PROD  OUTPARMS, LINE 40.                                     13280005
132900     MOVE  PC-RFI-55-A28       TO ODL2-T11.                       13290005
133000     STRING '(' DPG55-CORP-BUS-DAY-IND ')'                        13300005
133100            DELIMITED BY SIZE  INTO ODL2-V11.                     13310005
133200                                                                  13320005
133300     MOVE  PC-RFI-56-F39        TO ODL2-T21.                      13330005
133400     STRING '(' DPG56-LAST-FP-JULIAN ')'                          13340005
133500            DELIMITED BY SIZE  INTO ODL2-V21.                     13350005
133600     PERFORM 6101-WRITE-AFTER-1.                                  13360005
133700                                                                  13370005
133800*--> PROD  OUTPARMS, LINE 41.                                     13380005
133900     MOVE  PC-RFI-55-A29       TO ODL2-T11.                       13390005
134000     STRING '(' DPG55-CORP-HOLIDAY-IND ')'                        13400005
134100            DELIMITED BY SIZE  INTO ODL2-V11.                     13410005
134200                                                                  13420005
134300     MOVE  PC-RFI-56-F40        TO ODL2-T21.                      13430005
134400     STRING '(' DPG56-NBR-FISCAL-PERIOD-WEEK-X ')'                13440005
134500            DELIMITED BY SIZE  INTO ODL2-V21.                     13450005
134600     PERFORM 6101-WRITE-AFTER-1.                                  13460005
134700                                                                  13470005
134800*--> NOTE: PC-RFI-55-A30, STORE HOLIDAY , NOT PRINTED ON PROD RPT.13480005
134900                                                                  13490005
135000*--> PROD  OUTPARMS, LINE 42.                                     13500005
135100     MOVE  PC-RFI-55-A31       TO ODL2-T11.                       13510005
135200     STRING '(' DPG55-CMPR-GREG-CC-FMT ')'                        13520005
135300            DELIMITED BY SIZE  INTO ODL2-V11.                     13530005
135400                                                                  13540005
135500     MOVE  PC-RFI-56-F41        TO ODL2-T21.                      13550005
135600     STRING '(' DPG56-FISCAL-PERIOD-WEEK-X ')'                    13560005
135700            DELIMITED BY SIZE  INTO ODL2-V21.                     13570005
135800     PERFORM 6101-WRITE-AFTER-1.                                  13580005
135900                                                                  13590005
136000*--> PROD  OUTPARMS, LINE 43.                                     13600005
136100     MOVE  PC-RFI-55-A32       TO ODL2-T11.                       13610005
136200     MOVE  DPG55-DAYS-DIFFERENCE  TO PV-PIC-X-5.                  13620005
136300     STRING '(' PV-PIC-X-5 ')' DELIMITED BY SIZE INTO ODL2-V11.   13630005
136400     PERFORM 6101-WRITE-AFTER-1.                                  13640005
136500                                                                  13650005
136600*--> PROD  OUTPARMS, LINE 44.                                     13660005
136700     MOVE  PC-RFI-55-A33       TO ODL2-T11.                       13670005
136800     MOVE  DPG55-BUS-DAYS-DIFFERENCE  TO PV-PIC-X-5.              13680005
136900     STRING '(' PV-PIC-X-5 ')' DELIMITED BY SIZE INTO ODL2-V11.   13690005
137000     PERFORM 6101-WRITE-AFTER-1.                                  13700005
137100                                                                  13710005
137200*--> NOTE: PC-RFI-55-A34, ACTUAL HOL IND, NOT PRINTED ON PROD RPT.13720005
137300*--> NOTE: PC-RFI-55-A35, HOLIDAY NAME  , NOT PRINTED ON PROD RPT.13730005
137400*--> NOTE: PC-RFI-56-F42, FISCAL YR CCYY, NOT PRINTED ON PROD RPT.13740005
137500*--> NOTE: PC-RFI-56-F43, 1ST FS ISO FMT, NOT PRINTED ON PROD RPT.13750005
137600*--> NOTE: PC-RFI-56-F44, LST FS ISO FMT, NOT PRINTED ON PROD RPT.13760005
137700*--> NOTE: PC-RFI-56-F45, WEEKS DIFF    , NOT PRINTED ON PROD RPT.13770005
137800*--> NOTE: PC-RFI-56-F46, PERIODS DIFF  , NOT PRINTED ON PROD RPT.13780005
137900*--> NOTE: PC-RFI-56-F47, FSCL PRD NAME , NOT PRINTED ON PROD RPT.13790005
138000*--> NOTE: PC-RFI-56-F48, FSCL PRD ABBR3, NOT PRINTED ON PROD RPT.13800005
138100                                                                  13810005
138200                                                                  13820005
138300* ************************************************************** *13830005
138400* *  PROCESS REQUEST TO EXERCISE THE TEST ROUTINE.             * *13840005
138500* ************************************************************** *13850005
138600 4000-PROCESS-TEST-REQUEST.                                       13860005
138700                                                                  13870005
138800     PERFORM 6100-PRINT-RPT-HEADING.                              13880005
138900                                                                  13890005
139000     MOVE DTG51 TO XTG51.                                         13900005
139100     MOVE DTG52 TO XTG52.                                         13910005
139200     MOVE DTG53 TO XTG53.                                         13920005
139300                                                                  13930005
139400     CALL DT500-KOHLS-CALENDAR-ROUTINE                            13940005
139500          USING DTG51 DTG52 DTG53 DTG54 DTG55 DTG56.              13950005
139600                                                                  13960005
139700     PERFORM 4100-FORMAT-TEST-INPUTS.                             13970005
139800     PERFORM 4200-FORMAT-TEST-OUTPUTS.                            13980005
139900                                                                  13990005
140000                                                                  14000005
140100* ************************************************************** *14010005
140200* * THIS PARAGRAPH PRINTS THE TEST REPORT INPUTS (51-53).      * *14020005
140300* ************************************************************** *14030005
140400 4100-FORMAT-TEST-INPUTS.                                         14040005
140500                                                                  14050005
140600     MOVE PC-RFI-51-SYS-DT     TO ODL1-T11.                       14060005
140700     STRING '(' DTG51-SYSTEM-DATE-N  ')'                          14070005
140800            DELIMITED BY SIZE  INTO ODL1-V11.                     14080005
140900                                                                  14090005
141000     MOVE  PC-RFI-52-FMT-I     TO ODL1-T21.                       14100005
141100     STRING '(' XTG52-LK-DATE-FORMAT-CODE  ')'                    14110005
141200            DELIMITED BY SIZE  INTO ODL1-V21.                     14120005
141300                                                                  14130005
141400     MOVE PC-RFI-53-CFMT-I     TO ODL1-T31.                       14140005
141500     STRING '(' XTG53-LK-CMPR-DATE-FORMAT-CODE  ')'               14150005
141600            DELIMITED BY SIZE  INTO ODL1-V31.                     14160005
141700     PERFORM 6101-WRITE-AFTER-1.                                  14170005
141800                                                                  14180005
141900                                                                  14190005
142000     MOVE PC-RFI-51-CALTYP     TO ODL1-T11.                       14200005
142100     STRING '(' DTG51-CALENDAR-TYPE  ')'                          14210005
142200            DELIMITED BY SIZE  INTO ODL1-V11.                     14220005
142300                                                                  14230005
142400     MOVE PC-RFI-52-DT-I       TO ODL1-T21.                       14240005
142500     STRING '(' XTG52-LK-DATE-INPUT  ')'                          14250005
142600            DELIMITED BY SIZE  INTO ODL1-V21.                     14260005
142700                                                                  14270005
142800     MOVE PC-RFI-53-CDT-I       TO ODL1-T31.                      14280005
142900     STRING '(' XTG53-LK-CMPR-DATE-INPUT  ')'                     14290005
143000            DELIMITED BY SIZE  INTO ODL1-V31.                     14300005
143100     PERFORM 6101-WRITE-AFTER-1.                                  14310005
143200                                                                  14320005
143300                                                                  14330005
143400     MOVE PC-RFI-51-ID-IND     TO ODL1-T11.                       14340005
143500     STRING '(' DTG51-INCREMENT-DECREMENT-FLAG  ')'               14350005
143600            DELIMITED BY SIZE  INTO ODL1-V11.                     14360005
143700     PERFORM 6101-WRITE-AFTER-1.                                  14370005
143800                                                                  14380005
143900                                                                  14390005
144000     MOVE PC-RFI-51-ID-BUS     TO ODL1-T11.                       14400005
144100     STRING '(' DTG51-INCR-DECR-BUS-DAYS-X  ')'                   14410005
144200            DELIMITED BY SIZE  INTO ODL1-V11.                     14420005
144300                                                                  14430005
144400     MOVE  PC-RFI-52-FMT-I     TO ODL1-T21.                       14440005
144500     STRING '(' DTG52-LK-DATE-FORMAT-CODE  ')'                    14450005
144600            DELIMITED BY SIZE  INTO ODL1-V21.                     14460005
144700                                                                  14470005
144800     MOVE PC-RFI-53-CFMT-O     TO ODL1-T31.                       14480005
144900     STRING '(' DTG53-LK-CMPR-DATE-FORMAT-CODE  ')'               14490005
145000            DELIMITED BY SIZE  INTO ODL1-V31.                     14500005
145100     PERFORM 6101-WRITE-AFTER-1.                                  14510005
145200                                                                  14520005
145300                                                                  14530005
145400     MOVE  PC-RFI-51-ID-DAYS   TO ODL1-T11.                       14540005
145500     STRING '(' DTG51-INCR-DECR-DAYS-X  ')'                       14550005
145600            DELIMITED BY SIZE  INTO ODL1-V11.                     14560005
145700                                                                  14570005
145800     MOVE PC-RFI-52-DT-O       TO ODL1-T21.                       14580005
145900     STRING '(' DTG52-LK-DATE-INPUT  ')'                          14590005
146000            DELIMITED BY SIZE  INTO ODL1-V21.                     14600005
146100                                                                  14610005
146200     MOVE PC-RFI-53-CDT-O       TO ODL1-T31.                      14620005
146300     STRING '(' DTG53-LK-CMPR-DATE-INPUT  ')'                     14630005
146400            DELIMITED BY SIZE  INTO ODL1-V31.                     14640005
146500     PERFORM 6101-WRITE-AFTER-1.                                  14650005
146600                                                                  14660005
146700                                                                  14670005
146800     MOVE PC-RFI-51-PVT-YR     TO ODL1-T11.                       14680005
146900     STRING '(' DTG51-CENTURY-PIVOT-YEAR-X  ')'                   14690005
147000            DELIMITED BY SIZE  INTO ODL1-V11.                     14700005
147100     PERFORM 6101-WRITE-AFTER-1.                                  14710005
147200                                                                  14720005
147300                                                                  14730005
147400     MOVE PC-RFI-51-ID-FW    TO ODL1-T11.                         14740005
147500     STRING '(' DTG51-INCR-DECR-FISCAL-WEEK-X  ')'                14750005
147600            DELIMITED BY SIZE  INTO ODL1-V11.                     14760005
147700     PERFORM 6101-WRITE-AFTER-1.                                  14770005
147800                                                                  14780005
147900                                                                  14790005
148000     MOVE PC-RFI-51-ID-FP   TO ODL1-T11.                          14800005
148100     STRING '(' DTG51-INCR-DECR-FISCAL-PRD-X  ')'                 14810005
148200            DELIMITED BY SIZE  INTO ODL1-V11.                     14820005
148300     PERFORM 6101-WRITE-AFTER-1.                                  14830005
148400                                                                  14840005
148500                                                                  14850005
148600* ************************************************************** *14860005
148700* * THIS PARAGRAPH PRINTS THE TEST REPORT OUTPUTS (54-56).     * *14870005
148800* ************************************************************** *14880005
148900 4200-FORMAT-TEST-OUTPUTS.                                        14890005
149000                                                                  14900005
149100*--> TEST  OUTPARMS, LINE 01.                                     14910005
149200     MOVE PC-TXT-TEST-54 TO OHL2-TITLE21.                         14920005
149300     MOVE PC-TXT-TEST-56 TO OHL2-TITLE22.                         14930005
149400     MOVE PC-ASTERS28    TO OHL2-LEFT21  OHL2-RIGHT21             14940005
149500                            OHL2-LEFT22  OHL2-RIGHT22.            14950005
149600     PERFORM 6102-WRITE-AFTER-2.                                  14960005
149700                                                                  14970005
149800*--> TEST  OUTPARMS, LINE 02.                                     14980005
149900     MOVE PC-RFI-54-CAL-IND    TO ODL2-T11.                       14990005
150000     STRING '(' DTG54-CALENDAR-TYPE-IND  ')'                      15000005
150100            DELIMITED BY SIZE  INTO ODL2-V12.                     15010005
150200                                                                  15020005
150300     MOVE  PC-RFI-56-F01        TO ODL2-T21.                      15030005
150400     STRING '(' DTG56-FISCAL-YEAR-NBR-X  ')'                      15040005
150500            DELIMITED BY SIZE  INTO ODL2-V22.                     15050005
150600     PERFORM 6101-WRITE-AFTER-1.                                  15060005
150700                                                                  15070005
150800*--> TEST  OUTPARMS, LINE 03.                                     15080005
150900     MOVE PC-RFI-54-DT-IND     TO ODL2-T11.                       15090005
151000     STRING '(' DTG54-DATE-VALID-IND  ')'                         15100005
151100            DELIMITED BY SIZE  INTO ODL2-V12.                     15110005
151200                                                                  15120005
151300     MOVE PC-RFI-56-F02         TO ODL2-T21.                      15130005
151400     STRING '(' DTG56-FIRST-FD-DB2-ISO-FMT  ')'                   15140005
151500            DELIMITED BY SIZE  INTO ODL2-V22.                     15150005
151600     PERFORM 6101-WRITE-AFTER-1.                                  15160005
151700                                                                  15170005
151800*--> TEST  OUTPARMS, LINE 04.                                     15180005
151900     MOVE  PC-RFI-54-CDT-IND   TO ODL2-T11.                       15190005
152000     STRING '(' DTG54-CMPR-DATE-VALID-IND  ')'                    15200005
152100            DELIMITED BY SIZE  INTO ODL2-V12.                     15210005
152200                                                                  15220005
152300     MOVE  PC-RFI-56-F03        TO ODL2-T21.                      15230005
152400     STRING '(' DTG56-FIRST-FD-GREG-CC  ')'                       15240005
152500            DELIMITED BY SIZE  INTO ODL2-V22.                     15250005
152600     PERFORM 6101-WRITE-AFTER-1.                                  15260005
152700                                                                  15270005
152800*--> TEST  OUTPARMS, LINE 05.                                     15280005
152900     MOVE  PC-RFI-54-ID-IND    TO ODL2-T11.                       15290005
153000     STRING '(' DTG54-INCR-DECR-IND  ')'                          15300005
153100            DELIMITED BY SIZE  INTO ODL2-V12.                     15310005
153200                                                                  15320005
153300     MOVE  PC-RFI-56-F04        TO ODL2-T21.                      15330005
153400     STRING '(' DTG56-FIRST-FD-GREG-FMT  ')'                      15340005
153500            DELIMITED BY SIZE  INTO ODL2-V22.                     15350005
153600     PERFORM 6101-WRITE-AFTER-1.                                  15360005
153700                                                                  15370005
153800*--> TEST  OUTPARMS, LINE 06.                                     15380005
153900     MOVE PC-RFI-54-ERR-IND    TO ODL2-T11.                       15390005
154000     STRING '(' DTG54-ERROR-IND  ')'                              15400005
154100            DELIMITED BY SIZE  INTO ODL2-V12.                     15410005
154200                                                                  15420005
154300     MOVE  PC-RFI-56-F05        TO ODL2-T21.                      15430005
154400     STRING '(' DTG56-FIRST-FD-GREG  ')'                          15440005
154500            DELIMITED BY SIZE  INTO ODL2-V22.                     15450005
154600     PERFORM 6101-WRITE-AFTER-1.                                  15460005
154700                                                                  15470005
154800*--> TEST  OUTPARMS, LINE 07.                                     15480005
154900     MOVE DTG54-ERROR-MESSAGE TO                                  15490005
155000                PV-TEST-MESSAGE-WORK-AREA.                        15500005
155100     MOVE PC-RFI-54-EMSG1      TO ODL2-T11.                       15510005
155200     STRING '(' PV-EMSG-T1 ')'                                    15520005
155300            DELIMITED BY SIZE  INTO ODL2-V12.                     15530005
155400                                                                  15540005
155500     MOVE  PC-RFI-56-F06        TO ODL2-T21.                      15550005
155600     STRING '(' DTG56-FIRST-FD-JULIAN  ')'                        15560005
155700            DELIMITED BY SIZE  INTO ODL2-V22.                     15570005
155800     PERFORM 6101-WRITE-AFTER-1.                                  15580005
155900                                                                  15590005
156000*--> TEST  OUTPARMS, LINE 08.                                     15600005
156100     MOVE PC-RFI-54-EMSG2      TO ODL2-T11.                       15610005
156200     STRING '(' PV-EMSG-T2 ')'                                    15620005
156300            DELIMITED BY SIZE  INTO ODL2-V12.                     15630005
156400                                                                  15640005
156500     MOVE PC-RFI-56-F07         TO ODL2-T21.                      15650005
156600     STRING '(' DTG56-LAST-FD-DB2-ISO-FMT  ')'                    15660005
156700            DELIMITED BY SIZE  INTO ODL2-V22.                     15670005
156800     PERFORM 6101-WRITE-AFTER-1.                                  15680005
156900                                                                  15690005
157000*--> TEST  OUTPARMS, LINE 09.                                     15700005
157100     MOVE PC-RFI-54-EMSG3      TO ODL2-T11.                       15710005
157200     STRING '(' PV-EMSG-T3 ')'                                    15720005
157300            DELIMITED BY SIZE  INTO ODL2-V12.                     15730005
157400                                                                  15740005
157500     MOVE  PC-RFI-56-F08        TO ODL2-T21.                      15750005
157600     STRING '(' DTG56-LAST-FD-GREG-CC  ')'                        15760005
157700            DELIMITED BY SIZE  INTO ODL2-V22.                     15770005
157800     PERFORM 6101-WRITE-AFTER-1.                                  15780005
157900                                                                  15790005
158000*--> TEST  OUTPARMS, LINE 10.                                     15800005
158100     MOVE  PC-RFI-56-F09        TO ODL2-T21.                      15810005
158200     STRING '(' DTG56-LAST-FD-GREG-FMT  ')'                       15820005
158300            DELIMITED BY SIZE  INTO ODL2-V22.                     15830005
158400     PERFORM 6101-WRITE-AFTER-1.                                  15840005
158500                                                                  15850005
158600*--> TEST  OUTPARMS, LINE 11.                                     15860005
158700     MOVE  PC-RFI-56-F10        TO ODL2-T21.                      15870005
158800     STRING '(' DTG56-LAST-FD-GREG  ')'                           15880005
158900            DELIMITED BY SIZE  INTO ODL2-V22.                     15890005
159000     PERFORM 6101-WRITE-AFTER-1.                                  15900005
159100                                                                  15910005
159200*--> TEST  OUTPARMS, LINE 12.                                     15920005
159300     MOVE PC-TXT-TEST-55 TO OHL2-TITLE21.                         15930005
159400     MOVE PC-ASTERS28    TO OHL2-LEFT21  OHL2-RIGHT21.            15940005
159500                                                                  15950005
159600     MOVE  PC-RFI-56-F11        TO ODL2-T21.                      15960005
159700     STRING '(' DTG56-LAST-FD-JULIAN  ')'                         15970005
159800            DELIMITED BY SIZE  INTO ODL2-V22.                     15980005
159900     PERFORM 6101-WRITE-AFTER-1.                                  15990005
160000                                                                  16000005
160100*--> TEST  OUTPARMS, LINE 13.                                     16010005
160200     MOVE  PC-RFI-55-A01       TO ODL2-T11.                       16020005
160300     STRING '(' DTG55-DB2-ISO-DATE-FMT  ')'                       16030005
160400            DELIMITED BY SIZE  INTO ODL2-V12.                     16040005
160500                                                                  16050005
160600     MOVE  PC-RFI-56-F12        TO ODL2-T21.                      16060005
160700     STRING '(' DTG56-NBR-FISCAL-WEEKS-X  ')'                     16070005
160800            DELIMITED BY SIZE  INTO ODL2-V22.                     16080005
160900     PERFORM 6101-WRITE-AFTER-1.                                  16090005
161000                                                                  16100005
161100*--> TEST  OUTPARMS, LINE 14.                                     16110005
161200     MOVE  PC-RFI-55-A02       TO ODL2-T11.                       16120005
161300     STRING '(' DTG55-DB2-ISO-DATE  ')'                           16130005
161400            DELIMITED BY SIZE  INTO ODL2-V12.                     16140005
161500                                                                  16150005
161600     MOVE  PC-RFI-56-F13        TO ODL2-T21.                      16160005
161700     STRING '(' DTG56-FISCAL-WEEK-NBR-X  ')'                      16170005
161800            DELIMITED BY SIZE  INTO ODL2-V22.                     16180005
161900     PERFORM 6101-WRITE-AFTER-1.                                  16190005
162000                                                                  16200005
162100*--> TEST  OUTPARMS, LINE 15.                                     16210005
162200     MOVE  PC-RFI-55-A03       TO ODL2-T11.                       16220005
162300     STRING '(' DTG55-GREG-CC-DATE-FMT  ')'                       16230005
162400            DELIMITED BY SIZE  INTO ODL2-V12.                     16240005
162500                                                                  16250005
162600     MOVE  PC-RFI-56-F14        TO ODL2-T21.                      16260005
162700     STRING '(' DTG56-NBR-FISCAL-DAYS-X  ')'                      16270005
162800            DELIMITED BY SIZE  INTO ODL2-V22.                     16280005
162900     PERFORM 6101-WRITE-AFTER-1.                                  16290005
163000                                                                  16300005
163100*--> TEST  OUTPARMS, LINE 16.                                     16310005
163200     MOVE  PC-RFI-55-A04       TO ODL2-T11.                       16320005
163300     STRING '(' DTG55-GREG-CC-DATE  ')'                           16330005
163400            DELIMITED BY SIZE  INTO ODL2-V12.                     16340005
163500                                                                  16350005
163600     MOVE  PC-RFI-56-F15        TO ODL2-T21.                      16360005
163700     STRING '(' DTG56-CURR-FISCAL-SEASON  ')'                     16370005
163800            DELIMITED BY SIZE  INTO ODL2-V22.                     16380005
163900     PERFORM 6101-WRITE-AFTER-1.                                  16390005
164000                                                                  16400005
164100*--> TEST  OUTPARMS, LINE 17.                                     16410005
164200     MOVE  PC-RFI-55-A05       TO ODL2-T11.                       16420005
164300     STRING '(' DTG55-GREG-DATE-FMT  ')'                          16430005
164400            DELIMITED BY SIZE  INTO ODL2-V12.                     16440005
164500                                                                  16450005
164600     MOVE  PC-RFI-56-F16        TO ODL2-T21.                      16460005
164700     STRING '(' DTG56-FISCAL-QTR-NBR-X  ')'                       16470005
164800            DELIMITED BY SIZE  INTO ODL2-V22.                     16480005
164900     PERFORM 6101-WRITE-AFTER-1.                                  16490005
165000                                                                  16500005
165100*--> TEST  OUTPARMS, LINE 18.                                     16510005
165200     MOVE  PC-RFI-55-A06       TO ODL2-T11.                       16520005
165300     STRING '(' DTG55-GREG-DATE  ')'                              16530005
165400            DELIMITED BY SIZE  INTO ODL2-V12.                     16540005
165500                                                                  16550005
165600     MOVE  PC-RFI-56-F17        TO ODL2-T21.                      16560005
165700     STRING '(' DTG56-FIRST-FQ-DB2-ISO-FMT  ')'                   16570005
165800            DELIMITED BY SIZE  INTO ODL2-V22.                     16580005
165900     PERFORM 6101-WRITE-AFTER-1.                                  16590005
166000                                                                  16600005
166100*--> TEST  OUTPARMS, LINE 19.                                     16610005
166200     MOVE  PC-RFI-55-A07       TO ODL2-T11.                       16620005
166300     STRING '(' DTG55-JULIAN-DATE-CCYYDDD  ')'                    16630005
166400            DELIMITED BY SIZE  INTO ODL2-V12.                     16640005
166500                                                                  16650005
166600     MOVE  PC-RFI-56-F18        TO ODL2-T21.                      16660005
166700     STRING '(' DTG56-FIRST-FQ-GREG-CC  ')'                       16670005
166800            DELIMITED BY SIZE  INTO ODL2-V22.                     16680005
166900     PERFORM 6101-WRITE-AFTER-1.                                  16690005
167000                                                                  16700005
167100*--> TEST  OUTPARMS, LINE 20.                                     16710005
167200     MOVE  PC-RFI-55-A08       TO ODL2-T11.                       16720005
167300     STRING '(' DTG55-JULIAN-DATE-FMT  ')'                        16730005
167400            DELIMITED BY SIZE  INTO ODL2-V12.                     16740005
167500                                                                  16750005
167600     MOVE  PC-RFI-56-F19        TO ODL2-T21.                      16760005
167700     STRING '(' DTG56-FIRST-FQ-GREG-FMT  ')'                      16770005
167800            DELIMITED BY SIZE  INTO ODL2-V22.                     16780005
167900     PERFORM 6101-WRITE-AFTER-1.                                  16790005
168000                                                                  16800005
168100*--> TEST  OUTPARMS, LINE 21.                                     16810005
168200     MOVE  PC-RFI-55-A09       TO ODL2-T11.                       16820005
168300     STRING '(' DTG55-JULIAN-DATE  ')'                            16830005
168400            DELIMITED BY SIZE  INTO ODL2-V12.                     16840005
168500                                                                  16850005
168600     MOVE  PC-RFI-56-F20        TO ODL2-T21.                      16860005
168700     STRING '(' DTG56-FIRST-FQ-GREG  ')'                          16870005
168800            DELIMITED BY SIZE  INTO ODL2-V22.                     16880005
168900     PERFORM 6101-WRITE-AFTER-1.                                  16890005
169000                                                                  16900005
169100*--> TEST  OUTPARMS, LINE 22.                                     16910005
169500                                                                  16950005
169600     MOVE  PC-RFI-56-F21        TO ODL2-T21.                      16960005
169700     STRING '(' DTG56-FIRST-FQ-JULIAN  ')'                        16970005
169800            DELIMITED BY SIZE  INTO ODL2-V22.                     16980005
169900     PERFORM 6101-WRITE-AFTER-1.                                  16990005
170000                                                                  17000005
170100*--> TEST  OUTPARMS, LINE 23.                                     17010005
170200     MOVE  PC-RFI-55-A11       TO ODL2-T11.                       17020005
170300     STRING '(' DTG55-ALPHA-MONTH  ')'                            17030005
170400            DELIMITED BY SIZE  INTO ODL2-V12.                     17040005
170500                                                                  17050005
170600     MOVE  PC-RFI-56-F22        TO ODL2-T21.                      17060005
170700     STRING '(' DTG56-LAST-FQ-DB2-ISO-FMT  ')'                    17070005
170800            DELIMITED BY SIZE  INTO ODL2-V22.                     17080005
170900     PERFORM 6101-WRITE-AFTER-1.                                  17090005
171000                                                                  17100005
171100*--> TEST  OUTPARMS, LINE 24.                                     17110005
171200     MOVE  PC-RFI-55-A12       TO ODL2-T11.                       17120005
171300     STRING '(' DTG55-ALPHA-MONTH-ABBR3  ')'                      17130005
171400            DELIMITED BY SIZE  INTO ODL2-V12.                     17140005
171500                                                                  17150005
171600     MOVE  PC-RFI-56-F23        TO ODL2-T21.                      17160005
171700     STRING '(' DTG56-LAST-FQ-GREG-CC  ')'                        17170005
171800            DELIMITED BY SIZE  INTO ODL2-V22.                     17180005
171900     PERFORM 6101-WRITE-AFTER-1.                                  17190005
172000                                                                  17200005
172100*--> TEST  OUTPARMS, LINE 25.                                     17210005
172200     MOVE  PC-RFI-55-A13       TO ODL2-T11.                       17220005
172300     STRING '(' DTG55-DAYS-IN-MONTH  ')'                          17230005
172400            DELIMITED BY SIZE  INTO ODL2-V12.                     17240005
172500                                                                  17250005
172600     MOVE  PC-RFI-56-F24        TO ODL2-T21.                      17260005
172700     STRING '(' DTG56-LAST-FQ-GREG-FMT  ')'                       17270005
172800            DELIMITED BY SIZE  INTO ODL2-V22.                     17280005
172900     PERFORM 6101-WRITE-AFTER-1.                                  17290005
173000                                                                  17300005
173100*--> TEST  OUTPARMS, LINE 26.                                     17310005
173200     MOVE  PC-RFI-55-A14       TO ODL2-T11.                       17320005
173300     STRING '(' DTG55-ALPHA-WEEK-DAY  ')'                         17330005
173400            DELIMITED BY SIZE  INTO ODL2-V12.                     17340005
173500                                                                  17350005
173600     MOVE  PC-RFI-56-F25        TO ODL2-T21.                      17360005
173700     STRING '(' DTG56-LAST-FQ-GREG  ')'                           17370005
173800            DELIMITED BY SIZE  INTO ODL2-V22.                     17380005
173900     PERFORM 6101-WRITE-AFTER-1.                                  17390005
174000                                                                  17400005
174100*--> TEST  OUTPARMS, LINE 27.                                     17410005
174200     MOVE  PC-RFI-55-A15       TO ODL2-T11.                       17420005
174300     STRING '(' DTG55-ALPHA-WEEK-DAY-ABBR3  ')'                   17430005
174400            DELIMITED BY SIZE  INTO ODL2-V12.                     17440005
174500                                                                  17450005
174600     MOVE  PC-RFI-56-F26        TO ODL2-T21.                      17460005
174700     STRING '(' DTG56-LAST-FQ-JULIAN  ')'                         17470005
174800            DELIMITED BY SIZE  INTO ODL2-V22.                     17480005
174900     PERFORM 6101-WRITE-AFTER-1.                                  17490005
175000                                                                  17500005
175100*--> TEST  OUTPARMS, LINE 28.                                     17510005
175200     MOVE  PC-RFI-55-A16       TO ODL2-T11.                       17520005
175300     STRING '(' DTG55-ALPHA-WEEK-DAY-ABBR2  ')'                   17530005
175400            DELIMITED BY SIZE  INTO ODL2-V12.                     17540005
175500                                                                  17550005
175600     MOVE  PC-RFI-56-F27        TO ODL2-T21.                      17560005
175700     STRING '(' DTG56-NBR-FISCAL-QTR-WEEKS-X  ')'                 17570005
175800            DELIMITED BY SIZE  INTO ODL2-V22.                     17580005
175900     PERFORM 6101-WRITE-AFTER-1.                                  17590005
176000                                                                  17600005
176100*--> TEST  OUTPARMS, LINE 29.                                     17610005
176200     MOVE  PC-RFI-55-A17       TO ODL2-T11.                       17620005
176300     STRING '(' DTG55-NUMERIC-WEEK-DAY-X  ')'                     17630005
176400            DELIMITED BY SIZE  INTO ODL2-V12.                     17640005
176500                                                                  17650005
176600     MOVE  PC-RFI-56-F28        TO ODL2-T21.                      17660005
176700     STRING '(' DTG56-FISCAL-QTR-WEEK-X  ')'                      17670005
176800            DELIMITED BY SIZE  INTO ODL2-V22.                     17680005
176900     PERFORM 6101-WRITE-AFTER-1.                                  17690005
177000                                                                  17700005
177100*--> TEST  OUTPARMS, LINE 30.                                     17710005
177200     MOVE  PC-RFI-55-A18       TO ODL2-T11.                       17720005
177300     STRING '(' DTG55-1ST-WKDY-DB2ISO-FMT  ')'                    17730005
177400            DELIMITED BY SIZE  INTO ODL2-V12.                     17740005
177500                                                                  17750005
177600     MOVE  PC-RFI-56-F29        TO ODL2-T21.                      17760005
177700     STRING '(' DTG56-FISCAL-PERIOD-NBR-X  ')'                    17770005
177800            DELIMITED BY SIZE  INTO ODL2-V22.                     17780005
177900     PERFORM 6101-WRITE-AFTER-1.                                  17790005
178000                                                                  17800005
178100*--> TEST  OUTPARMS, LINE 31.                                     17810005
178200     MOVE  PC-RFI-55-A19       TO ODL2-T11.                       17820005
178300     STRING '(' DTG55-1ST-WKDY-GREG-CC  ')'                       17830005
178400            DELIMITED BY SIZE  INTO ODL2-V12.                     17840005
178500                                                                  17850005
178600     MOVE  PC-RFI-56-F30        TO ODL2-T21.                      17860005
178700     STRING '(' DTG56-FIRST-FP-DB2-ISO-FMT  ')'                   17870005
178800            DELIMITED BY SIZE  INTO ODL2-V22.                     17880005
178900     PERFORM 6101-WRITE-AFTER-1.                                  17890005
179000                                                                  17900005
179100*--> TEST  OUTPARMS, LINE 32.                                     17910005
179200     MOVE  PC-RFI-55-A20       TO ODL2-T11.                       17920005
179300     STRING '(' DTG55-1ST-WKDY-GREG-FMT  ')'                      17930005
179400            DELIMITED BY SIZE  INTO ODL2-V12.                     17940005
179500                                                                  17950005
179600     MOVE  PC-RFI-56-F31        TO ODL2-T21.                      17960005
179700     STRING '(' DTG56-FIRST-FP-GREG-CC  ')'                       17970005
179800            DELIMITED BY SIZE  INTO ODL2-V22.                     17980005
179900     PERFORM 6101-WRITE-AFTER-1.                                  17990005
180000                                                                  18000005
180100*--> TEST  OUTPARMS, LINE 33.                                     18010005
180200     MOVE  PC-RFI-55-A21       TO ODL2-T11.                       18020005
180300     STRING '(' DTG55-1ST-WKDY-GREG  ')'                          18030005
180400            DELIMITED BY SIZE  INTO ODL2-V12.                     18040005
180500                                                                  18050005
180600     MOVE  PC-RFI-56-F32        TO ODL2-T21.                      18060005
180700     STRING '(' DTG56-FIRST-FP-GREG-FMT  ')'                      18070005
180800            DELIMITED BY SIZE  INTO ODL2-V22.                     18080005
180900     PERFORM 6101-WRITE-AFTER-1.                                  18090005
181000                                                                  18100005
181100*--> TEST  OUTPARMS, LINE 34.                                     18110005
181200     MOVE  PC-RFI-55-A22       TO ODL2-T11.                       18120005
181300     STRING '(' DTG55-1ST-WKDY-JULIAN  ')'                        18130005
181400            DELIMITED BY SIZE  INTO ODL2-V12.                     18140005
181500                                                                  18150005
181600     MOVE  PC-RFI-56-F33        TO ODL2-T21.                      18160005
181700     STRING '(' DTG56-FIRST-FP-GREG  ')'                          18170005
181800            DELIMITED BY SIZE  INTO ODL2-V22.                     18180005
181900     PERFORM 6101-WRITE-AFTER-1.                                  18190005
182000                                                                  18200005
182100*--> TEST  OUTPARMS, LINE 35.                                     18210005
182200     MOVE  PC-RFI-55-A23       TO ODL2-T11.                       18220005
182300     STRING '(' DTG55-LAST-WKDY-DB2ISO-FMT  ')'                   18230005
182400            DELIMITED BY SIZE  INTO ODL2-V12.                     18240005
182500                                                                  18250005
182600     MOVE  PC-RFI-56-F34        TO ODL2-T21.                      18260005
182700     STRING '(' DTG56-FIRST-FP-JULIAN  ')'                        18270005
182800            DELIMITED BY SIZE  INTO ODL2-V22.                     18280005
182900     PERFORM 6101-WRITE-AFTER-1.                                  18290005
183000                                                                  18300005
183100*--> TEST  OUTPARMS, LINE 36.                                     18310005
183200     MOVE  PC-RFI-55-A24       TO ODL2-T11.                       18320005
183300     STRING '(' DTG55-LAST-WKDY-GREG-CC  ')'                      18330005
183400            DELIMITED BY SIZE  INTO ODL2-V12.                     18340005
183500                                                                  18350005
183600     MOVE  PC-RFI-56-F35        TO ODL2-T21.                      18360005
183700     STRING '(' DTG56-LAST-FP-DB2-ISO-FMT  ')'                    18370005
183800            DELIMITED BY SIZE  INTO ODL2-V22.                     18380005
183900     PERFORM 6101-WRITE-AFTER-1.                                  18390005
184000                                                                  18400005
184100*--> TEST  OUTPARMS, LINE 37.                                     18410005
184200     MOVE  PC-RFI-55-A25       TO ODL2-T11.                       18420005
184300     STRING '(' DTG55-LAST-WKDY-GREG-FMT  ')'                     18430005
184400            DELIMITED BY SIZE  INTO ODL2-V12.                     18440005
184500                                                                  18450005
184600     MOVE  PC-RFI-56-F36        TO ODL2-T21.                      18460005
184700     STRING '(' DTG56-LAST-FP-GREG-CC  ')'                        18470005
184800            DELIMITED BY SIZE  INTO ODL2-V22.                     18480005
184900     PERFORM 6101-WRITE-AFTER-1.                                  18490005
185000                                                                  18500005
185100*--> TEST  OUTPARMS, LINE 38.                                     18510005
185200     MOVE  PC-RFI-55-A26       TO ODL2-T11.                       18520005
185300     STRING '(' DTG55-LAST-WKDY-GREG  ')'                         18530005
185400            DELIMITED BY SIZE  INTO ODL2-V12.                     18540005
185500                                                                  18550005
185600     MOVE  PC-RFI-56-F37        TO ODL2-T21.                      18560005
185700     STRING '(' DTG56-LAST-FP-GREG-FMT  ')'                       18570005
185800            DELIMITED BY SIZE  INTO ODL2-V22.                     18580005
185900     PERFORM 6101-WRITE-AFTER-1.                                  18590005
186000                                                                  18600005
186100*--> TEST  OUTPARMS, LINE 39.                                     18610005
186200     MOVE  PC-RFI-55-A27       TO ODL2-T11.                       18620005
186300     STRING '(' DTG55-LAST-WKDY-JULIAN  ')'                       18630005
186400            DELIMITED BY SIZE  INTO ODL2-V12.                     18640005
186500                                                                  18650005
186600     MOVE  PC-RFI-56-F38        TO ODL2-T21.                      18660005
186700     STRING '(' DTG56-LAST-FP-GREG  ')'                           18670005
186800            DELIMITED BY SIZE  INTO ODL2-V22.                     18680005
186900     PERFORM 6101-WRITE-AFTER-1.                                  18690005
187000                                                                  18700005
187100*--> TEST  OUTPARMS, LINE 40.                                     18710005
187200     MOVE  PC-RFI-55-A28       TO ODL2-T11.                       18720005
187300     STRING '(' DTG55-CORP-BUS-DAY-IND  ')'                       18730005
187400            DELIMITED BY SIZE  INTO ODL2-V12.                     18740005
187500                                                                  18750005
187600     MOVE  PC-RFI-56-F39        TO ODL2-T21.                      18760005
187700     STRING '(' DTG56-LAST-FP-JULIAN  ')'                         18770005
187800            DELIMITED BY SIZE  INTO ODL2-V22.                     18780005
187900     PERFORM 6101-WRITE-AFTER-1.                                  18790005
188000                                                                  18800005
188100*--> TEST  OUTPARMS, LINE 41.                                     18810005
188200     MOVE  PC-RFI-55-A29       TO ODL2-T11.                       18820005
188300     STRING '(' DTG55-CORP-HOLIDAY-IND  ')'                       18830005
188400            DELIMITED BY SIZE  INTO ODL2-V12.                     18840005
188500                                                                  18850005
188600     MOVE  PC-RFI-56-F40        TO ODL2-T21.                      18860005
188700     STRING '(' DTG56-NBR-FISCAL-PERIOD-WEEK-X  ')'               18870005
188800            DELIMITED BY SIZE  INTO ODL2-V22.                     18880005
188900     PERFORM 6101-WRITE-AFTER-1.                                  18890005
189000                                                                  18900005
189100*--> TEST  OUTPARMS, LINE 42.                                     18910005
189200     MOVE  PC-RFI-55-A30       TO ODL2-T11.                       18920005
189300     STRING '(' DTG55-STORE-HOLIDAY-IND ')'                       18930005
189400            DELIMITED BY SIZE  INTO ODL2-V12.                     18940005
189500                                                                  18950005
189600     MOVE  PC-RFI-56-F41        TO ODL2-T21.                      18960005
189700     STRING '(' DTG56-FISCAL-PERIOD-WEEK-X  ')'                   18970005
189800            DELIMITED BY SIZE  INTO ODL2-V22.                     18980005
189900     PERFORM 6101-WRITE-AFTER-1.                                  18990005
190000                                                                  19000005
190100*--> TEST  OUTPARMS, LINE 43.                                     19010005
190200     MOVE  PC-RFI-55-A31       TO ODL2-T11.                       19020005
190300     STRING '(' DTG55-CMPR-GREG-CC-FMT  ')'                       19030005
190400            DELIMITED BY SIZE  INTO ODL2-V12.                     19040005
190500                                                                  19050005
190600     MOVE  PC-RFI-56-F42        TO ODL2-T21.                      19060005
190700     STRING '(' DTG56-FISCAL-YEAR-CCYY ')'                        19070005
190800            DELIMITED BY SIZE  INTO ODL2-V22.                     19080005
190900     PERFORM 6101-WRITE-AFTER-1.                                  19090005
191000                                                                  19100005
191100*--> TEST  OUTPARMS, LINE 44.                                     19110005
191200     MOVE  PC-RFI-55-A32       TO ODL2-T11.                       19120005
191300     MOVE  DTG55-DAYS-DIFFERENCE  TO PV-PIC-X-5.                  19130005
191400     STRING '(' PV-PIC-X-5 ')' DELIMITED BY SIZE INTO ODL2-V12.   19140005
191500                                                                  19150005
191600     MOVE  PC-RFI-56-F43        TO ODL2-T21.                      19160005
191700     STRING '(' DTG56-FIRST-FS-DB2-ISO-FMT ')'                    19170005
191800            DELIMITED BY SIZE  INTO ODL2-V22.                     19180005
191900     PERFORM 6101-WRITE-AFTER-1.                                  19190005
192000                                                                  19200005
192100*--> TEST  OUTPARMS, LINE 45.                                     19210005
192200     MOVE  PC-RFI-55-A33       TO ODL2-T11.                       19220005
192300     MOVE  DTG55-BUS-DAYS-DIFFERENCE  TO PV-PIC-X-5.              19230005
192400     STRING '(' PV-PIC-X-5 ')' DELIMITED BY SIZE INTO ODL2-V12.   19240005
192500                                                                  19250005
192600     MOVE  PC-RFI-56-F44        TO ODL2-T21.                      19260005
192700     STRING '(' DTG56-LAST-FS-DB2-ISO-FMT ')'                     19270005
192800            DELIMITED BY SIZE  INTO ODL2-V22.                     19280005
192900     PERFORM 6101-WRITE-AFTER-1.                                  19290005
193000                                                                  19300005
193100*--> TEST  OUTPARMS, LINE 46.                                     19310005
193200     MOVE  PC-RFI-55-A34       TO ODL2-T11.                       19320005
193300     STRING '(' DTG55-ACTUAL-HOLIDAY-IND  ')'                     19330005
193400            DELIMITED BY SIZE  INTO ODL2-V12.                     19340005
193500                                                                  19350005
193600     MOVE  PC-RFI-56-F45        TO ODL2-T21.                      19360005
193700     MOVE  DTG56-WEEKS-DIFFERENCE TO PV-PIC-X-4.                  19370005
193800     STRING '(' PV-PIC-X-4 ')' DELIMITED BY SIZE INTO ODL2-V22.   19380005
193900     PERFORM 6101-WRITE-AFTER-1.                                  19390005
194000                                                                  19400005
194100*--> TEST  OUTPARMS, LINE 47.                                     19410005
194200     MOVE  PC-RFI-55-A35       TO ODL2-T11.                       19420005
194300     STRING '(' DTG55-HOLIDAY-NAME ')'                            19430005
194400            DELIMITED BY SIZE  INTO ODL2-V12.                     19440005
194500                                                                  19450005
194600     MOVE  PC-RFI-56-F46        TO ODL2-T21.                      19460005
194700     MOVE  DTG56-PERIODS-DIFFERENCE TO PV-PIC-X-4.                19470005
194800     STRING '(' PV-PIC-X-4 ')' DELIMITED BY SIZE INTO ODL2-V22.   19480005
194900     PERFORM 6101-WRITE-AFTER-1.                                  19490005
195000                                                                  19500005
195100*--> TEST  OUTPARMS, LINE 48.                                     19510005
195200     MOVE  PC-RFI-56-F47        TO ODL2-T21.                      19520005
195300     STRING '(' DTG56-FISCAL-PERIOD-NAME ')'                      19530005
195400            DELIMITED BY SIZE  INTO ODL2-V22.                     19540005
195500     PERFORM 6101-WRITE-AFTER-1.                                  19550005
195600                                                                  19560005
195700*--> TEST  OUTPARMS, LINE 49.                                     19570005
195800     MOVE  PC-RFI-56-F48        TO ODL2-T21.                      19580005
195900     STRING '(' DTG56-FISCAL-PERIOD-NAME-ABBR3 ')'                19590005
196000            DELIMITED BY SIZE  INTO ODL2-V22.                     19600005
196100     PERFORM 6101-WRITE-AFTER-1.                                  19610005
196200                                                                  19620005
196300                                                                  19630005
196400* ************************************************************** *19640005
196500* *  PROCESS REQUEST TO EXERCISE BOTHE PROD AND TEST ROUTINES  * *19650005
196600* *  AND COMPARE RESULTS.                                      * *19660005
196700* ************************************************************** *19670005
196800 5000-PROCESS-DELTA-REQUEST.                                      19680005
196900                                                                  19690005
197000     MOVE DPG51 TO XPG51.                                         19700005
197100     MOVE DPG52 TO XPG52.                                         19710005
197200     MOVE DPG53 TO XPG53.                                         19720005
197300                                                                  19730005
197400     MOVE DTG51 TO XTG51.                                         19740005
197500     MOVE DTG52 TO XTG52.                                         19750005
197600     MOVE DTG53 TO XTG53.                                         19760005
197700                                                                  19770005
197800     CALL DP500-KOHLS-CALENDAR-ROUTINE                            19780005
197900          USING DPG51 DPG52 DPG53 DPG54 DPG55 DPG56.              19790005
198000                                                                  19800005
198100     CALL DT500-KOHLS-CALENDAR-ROUTINE                            19810005
198200          USING DTG51 DTG52 DTG53 DTG54 DTG55 DTG56.              19820005
198300                                                                  19830005
198400     PERFORM 5001-COMPARE-54.                                     19840005
198500     PERFORM 5002-COMPARE-55.                                     19850005
198600     PERFORM 5003-COMPARE-56.                                     19860005
198700* ************************************************************** *19870005
198800*>>  IMPORTANT NOTE:                                              19880005
198900*>>  THE TESTING OF THESE SWITCHES WILL DETERMINE WHAT CATEGORIES 19890005
199000*>>  OF DELTAS WILL BE PRINTED ON A GIVEN RUN.                    19900005
199100*                                                                 19910005
199200     IF  PV-DPG54-DIFFS-INDICATORS                                19920005
199300     OR  PV-DPG54-DIFFS-MISC-FOUND                                19930005
199400     OR  PV-DPG54-DIFFS-KNOWN-ERRORS                              19940005
199500*>>  OR  PV-DPG54-DIFFS-NEW-VALUES                                19950005
199600     OR  PV-DPG55-DIFFS-MISC-FOUND                                19960005
199700     OR  PV-DPG55-DIFFS-KNOWN-ERRORS                              19970005
199800*>>  OR  PV-DPG55-DIFFS-NEW-FIELDS                                19980005
199900     OR  PV-DPG56-DIFFS-MISC-FOUND                                19990005
200000     OR  PV-DPG56-DIFFS-KNOWN-ERRORS                              20000005
200100*>>  OR  PV-DPG56-DIFFS-NEW-FIELDS                                20010005
200200* ************************************************************** *20020005
200300         PERFORM 6100-PRINT-RPT-HEADING                           20030005
200400         PERFORM 5100-FORMAT-DELTA-INPUTS                         20040005
200500         PERFORM 5200-FORMAT-DELTA-OUTPUTS                        20050005
200600     END-IF.                                                      20060005
200700                                                                  20070005
200800                                                                  20080005
200900* ************************************************************** *20090005
201000* * THIS PARAGRAPH COMPARES THE OUTPUTS IN THE DPG54 COPYBOOK  * *20100005
201100* * RESULTING FROM THE CALLS TO THE PROD & TEST ROUTINES,      * *20110005
201200* * TO DETERMINE WHETHER ANY DIFFERENCES EXIST.                * *20120005
201300* ************************************************************** *20130005
201400 5001-COMPARE-54.                                                 20140005
201500                                                                  20150005
201600     INITIALIZE PV-DPG54-DIFFS-MISC-IND                           20160005
201700                PV-DPG54-DIFFS-KNOWN-IND                          20170005
201800                PV-DPG54-DIFFS-NEW-IND                            20180005
201900                PV-DPG54-DIFFS-IND-IND                            20190005
202000                PV-DPG54-DIFFS-W-IND                              20200005
202100                PV-DPG54-DIFFS-ERMSG-IND.                         20210005
202200                                                                  20220005
202300     IF  DPG54-ERROR-MESSAGE       =  DTG54-ERROR-MESSAGE         20230005
202400         IF  DPG54-ERROR-MESSAGE   = SPACES                       20240005
202500             SET PV-DPG54-DIFFS-ERRMSG-NONE                       20250005
202600                                       TO TRUE                    20260005
202700         END-IF                                                   20270005
202800     ELSE                                                         20280005
202900         SET PV-DPG54-DIFFS-ERRMSG-TEXT                           20290005
203000                                       TO TRUE                    20300005
203100     END-IF.                                                      20310005
203200                                                                  20320005
203300     IF  DPG54-ERROR-IND           =  'W'                         20330005
203400         SET PV-DPG54-DIFFS-WARNING    TO TRUE                    20340005
203500     END-IF.                                                      20350005
203600                                                                  20360005
203700     IF  DPG54-CALENDAR-TYPE-IND   =  DTG54-CALENDAR-TYPE-IND     20370005
203800     AND DPG54-DATE-VALID-IND      =  DTG54-DATE-VALID-IND        20380005
203900     AND DPG54-CMPR-DATE-VALID-IND =  DTG54-CMPR-DATE-VALID-IND   20390005
204000     AND DPG54-INCR-DECR-IND       =  DTG54-INCR-DECR-IND         20400005
204100         CONTINUE                                                 20410005
204200     ELSE                                                         20420005
204300         SET PV-DPG54-DIFFS-INDICATORS TO TRUE                    20430005
204400     END-IF.                                                      20440005
204500                                                                  20450005
204600     IF  DPG54-CALENDAR-TYPE-IND   =  DTG54-CALENDAR-TYPE-IND     20460005
204700     AND DPG54-DATE-VALID-IND      =  DTG54-DATE-VALID-IND        20470005
204800     AND DPG54-CMPR-DATE-VALID-IND =  DTG54-CMPR-DATE-VALID-IND   20480005
204900     AND DPG54-INCR-DECR-IND       =  DTG54-INCR-DECR-IND         20490005
205000     AND DPG54-ERROR-IND           =  DTG54-ERROR-IND             20500005
205100     AND DPG54-ERROR-MESSAGE       =  DTG54-ERROR-MESSAGE         20510005
205200         CONTINUE                                                 20520005
205300     ELSE                                                         20530005
205400         SET PV-DPG54-DIFFS-MISC-FOUND TO TRUE                    20540005
205500     END-IF.                                                      20550005
205600                                                                  20560005
205700                                                                  20570005
205800* ************************************************************** *20580005
205900* * THIS PARAGRAPH COMPARES THE OUTPUTS IN THE DPG55 COPYBOOK  * *20590005
206000* * RESULTING FROM THE CALLS TO THE PROD & TEST ROUTINES,      * *20600005
206100* * TO DETERMINE WHETHER ANY DIFFERENCES EXIST.                * *20610005
206200* ************************************************************** *20620005
206300 5002-COMPARE-55.                                                 20630005
206400                                                                  20640005
206500     INITIALIZE PV-DPG55-DIFFS-MISC-IND                           20650005
206600                PV-DPG55-DIFFS-KNOWN-IND                          20660005
206700                PV-DPG55-DIFFS-NEW-IND.                           20670005
206800                                                                  20680005
207500     IF  DPG55-ACTUAL-HOLIDAY-IND  =  DTG55-ACTUAL-HOLIDAY-IND    20750005
207600     AND DPG55-HOLIDAY-NAME        =  DTG55-HOLIDAY-NAME          20760005
207700         CONTINUE                                                 20770005
207800     ELSE                                                         20780005
207900         SET PV-DPG55-DIFFS-NEW-FIELDS TO TRUE                    20790005
208000     END-IF.                                                      20800005
208100                                                                  20810005
208200     IF  DPG55-DB2-ISO-DATE-FMT    =  DTG55-DB2-ISO-DATE-FMT      20820005
208300     AND DPG55-GREG-CC-DATE-FMT    =  DTG55-GREG-CC-DATE-FMT      20830005
208400     AND DPG55-GREG-CC-DATE        =  DTG55-GREG-CC-DATE          20840005
208500     AND DPG55-GREG-DATE-FMT       =  DTG55-GREG-DATE-FMT         20850005
208600     AND DPG55-GREG-DATE           =  DTG55-GREG-DATE             20860005
208700     AND DPG55-JULIAN-DATE-CCYYDDD =  DTG55-JULIAN-DATE-CCYYDDD   20870005
208800     AND DPG55-JULIAN-DATE-FMT     =  DTG55-JULIAN-DATE-FMT       20880005
208900     AND DPG55-JULIAN-DATE         =  DTG55-JULIAN-DATE           20890005
209000     AND DPG55-ALPHA-MONTH         =  DTG55-ALPHA-MONTH           20900005
209100     AND DPG55-ALPHA-MONTH-ABBR3   =  DTG55-ALPHA-MONTH-ABBR3     20910005
209200     AND DPG55-DAYS-IN-MONTH-X     =  DTG55-DAYS-IN-MONTH-X       20920005
209300     AND DPG55-ALPHA-WEEK-DAY      =  DTG55-ALPHA-WEEK-DAY        20930005
209400     AND DPG55-ALPHA-WEEK-DAY-ABBR3 = DTG55-ALPHA-WEEK-DAY-ABBR3  20940005
209500     AND DPG55-ALPHA-WEEK-DAY-ABBR2 = DTG55-ALPHA-WEEK-DAY-ABBR2  20950005
209600     AND DPG55-NUMERIC-WEEK-DAY-X   = DTG55-NUMERIC-WEEK-DAY-X    20960005
209700     AND DPG55-1ST-WKDY-DB2ISO-FMT  = DTG55-1ST-WKDY-DB2ISO-FMT   20970005
209800     AND DPG55-1ST-WKDY-GREG-CC     = DTG55-1ST-WKDY-GREG-CC      20980005
209900     AND DPG55-1ST-WKDY-GREG-FMT    = DTG55-1ST-WKDY-GREG-FMT     20990005
210000     AND DPG55-1ST-WKDY-GREG        = DTG55-1ST-WKDY-GREG         21000005
210100     AND DPG55-1ST-WKDY-JULIAN      = DTG55-1ST-WKDY-JULIAN       21010005
210200     AND DPG55-LAST-WKDY-DB2ISO-FMT = DTG55-LAST-WKDY-DB2ISO-FMT  21020005
210300     AND DPG55-LAST-WKDY-GREG-CC    = DTG55-LAST-WKDY-GREG-CC     21030005
210400     AND DPG55-LAST-WKDY-GREG-FMT   = DTG55-LAST-WKDY-GREG-FMT    21040005
210500     AND DPG55-LAST-WKDY-GREG       = DTG55-LAST-WKDY-GREG        21050005
210600     AND DPG55-LAST-WKDY-JULIAN     = DTG55-LAST-WKDY-JULIAN      21060005
210700     AND DPG55-CORP-BUS-DAY-IND     = DTG55-CORP-BUS-DAY-IND      21070005
210800     AND DPG55-CORP-HOLIDAY-IND     = DTG55-CORP-HOLIDAY-IND      21080005
210900     AND DPG55-STORE-HOLIDAY-IND    = DTG55-STORE-HOLIDAY-IND     21090005
211000     AND DPG55-CMPR-GREG-CC-FMT     = DTG55-CMPR-GREG-CC-FMT      21100005
211100     AND DPG55-DAYS-DIFFERENCE-X    = DTG55-DAYS-DIFFERENCE-X     21110005
211200     AND DPG55-BUS-DAYS-DIFFERENCE-X                              21120005
211300                                    = DTG55-BUS-DAYS-DIFFERENCE-X 21130005
211400         CONTINUE                                                 21140005
211500     ELSE                                                         21150005
211600         SET PV-DPG55-DIFFS-MISC-FOUND TO TRUE                    21160005
211700     END-IF.                                                      21170005
211800                                                                  21180005
211900                                                                  21190005
212000* ************************************************************** *21200005
212100* * THIS PARAGRAPH COMPARES THE OUTPUTS IN THE DPG56 COPYBOOK  * *21210005
212200* * RESULTING FROM THE CALLS TO THE PROD & TEST ROUTINES,      * *21220005
212300* * TO DETERMINE WHETHER ANY DIFFERENCES EXIST.                * *21230005
212400* ************************************************************** *21240005
212500 5003-COMPARE-56.                                                 21250005
212600                                                                  21260005
212700     INITIALIZE PV-DPG56-DIFFS-MISC-IND                           21270005
212800                PV-DPG56-DIFFS-KNOWN-IND                          21280005
212900                PV-DPG56-DIFFS-NEW-IND.                           21290005
213000                                                                  21300005
213100     IF  DPG56-FISCAL-YEAR-CCYY-X  =  DTG56-FISCAL-YEAR-CCYY-X    21310005
213200     AND DPG56-FIRST-FS-DB2-ISO-FMT = DTG56-FIRST-FS-DB2-ISO-FMT  21320005
213300     AND DPG56-LAST-FS-DB2-ISO-FMT =  DTG56-LAST-FS-DB2-ISO-FMT   21330005
213400     AND DPG56-WEEKS-DIFFERENCE-X  =  DTG56-WEEKS-DIFFERENCE-X    21340005
213500     AND DPG56-PERIODS-DIFFERENCE-X = DTG56-PERIODS-DIFFERENCE-X  21350005
213600     AND DPG56-FISCAL-PERIOD-NAME   = DTG56-FISCAL-PERIOD-NAME    21360005
213700     AND DPG56-FISCAL-PERIOD-NAME-ABBR3                           21370005
213800                                    =                             21380005
213900                                    DTG56-FISCAL-PERIOD-NAME-ABBR321390005
214000         CONTINUE                                                 21400005
214100     ELSE                                                         21410005
214200         SET PV-DPG56-DIFFS-NEW-FIELDS TO TRUE                    21420005
214300     END-IF.                                                      21430005
214400                                                                  21440005
214500     IF  DPG56-FISCAL-YEAR-CCYY-X  =  DTG56-FISCAL-YEAR-CCYY-X    21450005
214600     AND DPG56-FIRST-FD-DB2-ISO-FMT = DTG56-FIRST-FD-DB2-ISO-FMT  21460005
214700     AND DPG56-FIRST-FD-GREG-CC-X   = DTG56-FIRST-FD-GREG-CC-X    21470005
214800     AND DPG56-FIRST-FD-GREG-FMT    = DTG56-FIRST-FD-GREG-FMT     21480005
214900     AND DPG56-FIRST-FD-GREG-X      = DTG56-FIRST-FD-GREG-X       21490005
215000     AND DPG56-FIRST-FD-JULIAN-X    = DTG56-FIRST-FD-JULIAN-X     21500005
215100     AND DPG56-LAST-FD-DB2-ISO-FMT =  DTG56-LAST-FD-DB2-ISO-FMT   21510005
215200     AND DPG56-LAST-FD-GREG-CC-X    = DTG56-LAST-FD-GREG-CC-X     21520005
215300     AND DPG56-LAST-FD-GREG-FMT     = DTG56-LAST-FD-GREG-FMT      21530005
215400     AND DPG56-LAST-FD-GREG-X       = DTG56-LAST-FD-GREG-X        21540005
215500     AND DPG56-LAST-FD-JULIAN-X     = DTG56-LAST-FD-JULIAN-X      21550005
215600     AND DPG56-NBR-FISCAL-WEEKS-X   = DTG56-NBR-FISCAL-WEEKS-X    21560005
215700     AND DPG56-FISCAL-WEEK-NBR-X    = DTG56-FISCAL-WEEK-NBR-X     21570005
215800     AND DPG56-NBR-FISCAL-DAYS-X    = DTG56-NBR-FISCAL-DAYS-X     21580005
215900     AND DPG56-CURR-FISCAL-SEASON   = DTG56-CURR-FISCAL-SEASON    21590005
216000     AND DPG56-FISCAL-QTR-NBR-X     = DTG56-FISCAL-QTR-NBR-X      21600005
216100     AND DPG56-FIRST-FQ-DB2-ISO-FMT = DTG56-FIRST-FQ-DB2-ISO-FMT  21610005
216200     AND DPG56-FIRST-FQ-GREG-CC-X   = DTG56-FIRST-FQ-GREG-CC-X    21620005
216300     AND DPG56-FIRST-FQ-GREG-FMT    = DTG56-FIRST-FQ-GREG-FMT     21630005
216400     AND DPG56-FIRST-FQ-GREG-X      = DTG56-FIRST-FQ-GREG-X       21640005
216500     AND DPG56-FIRST-FQ-JULIAN-X    = DTG56-FIRST-FQ-JULIAN-X     21650005
216600     AND DPG56-LAST-FQ-DB2-ISO-FMT =  DTG56-LAST-FQ-DB2-ISO-FMT   21660005
216700     AND DPG56-LAST-FQ-GREG-CC-X    = DTG56-LAST-FQ-GREG-CC-X     21670005
216800     AND DPG56-LAST-FQ-GREG-FMT     = DTG56-LAST-FQ-GREG-FMT      21680005
216900     AND DPG56-LAST-FQ-GREG-X       = DTG56-LAST-FQ-GREG-X        21690005
217000     AND DPG56-LAST-FQ-JULIAN-X     = DTG56-LAST-FQ-JULIAN-X      21700005
217100     AND DPG56-NBR-FISCAL-QTR-WEEKS-X                             21710005
217200                                    = DTG56-NBR-FISCAL-QTR-WEEKS-X21720005
217300     AND DPG56-FISCAL-QTR-WEEK-X    = DTG56-FISCAL-QTR-WEEK-X     21730005
217400     AND DPG56-FISCAL-PERIOD-NBR-X  = DTG56-FISCAL-PERIOD-NBR-X   21740005
217500     AND DPG56-FIRST-FP-DB2-ISO-FMT = DTG56-FIRST-FP-DB2-ISO-FMT  21750005
217600     AND DPG56-FIRST-FP-GREG-CC-X   = DTG56-FIRST-FP-GREG-CC-X    21760005
217700     AND DPG56-FIRST-FP-GREG-FMT    = DTG56-FIRST-FP-GREG-FMT     21770005
217800     AND DPG56-FIRST-FP-GREG-X      = DTG56-FIRST-FP-GREG-X       21780005
217900     AND DPG56-FIRST-FP-JULIAN-X    = DTG56-FIRST-FP-JULIAN-X     21790005
218000     AND DPG56-LAST-FP-DB2-ISO-FMT =  DTG56-LAST-FP-DB2-ISO-FMT   21800005
218100     AND DPG56-LAST-FP-GREG-CC-X    = DTG56-LAST-FP-GREG-CC-X     21810005
218200     AND DPG56-LAST-FP-GREG-FMT     = DTG56-LAST-FP-GREG-FMT      21820005
218300     AND DPG56-LAST-FP-GREG-X       = DTG56-LAST-FP-GREG-X        21830005
218400     AND DPG56-LAST-FP-JULIAN-X     = DTG56-LAST-FP-JULIAN-X      21840005
218500     AND DPG56-NBR-FISCAL-PERIOD-WEEK-X                           21850005
218600                                    =                             21860005
218700                                    DTG56-NBR-FISCAL-PERIOD-WEEK-X21870005
218800         CONTINUE                                                 21880005
218900     ELSE                                                         21890005
219000         SET PV-DPG56-DIFFS-MISC-FOUND TO TRUE                    21900005
219100     END-IF.                                                      21910005
219200                                                                  21920005
219300                                                                  21930005
219400* ************************************************************** *21940005
219500* * THIS PARAGRAPH PRINTS THE DELTA REPORT INPUTS (51-53)      * *21950005
219600* *   THIS PARAGRAPH FORMATS AND PRINTS THE INPUT RECORDS      * *21960005
219700* *   USED TO CALL THE PROD AND TEST DATE ROUTINES.            * *21970005
219800* ************************************************************** *21980005
219900 5100-FORMAT-DELTA-INPUTS.                                        21990005
220000                                                                  22000005
220100     MOVE PC-RFI-51-SYS-DT     TO ODL1-T11.                       22010005
220200     STRING '(' DTG51-SYSTEM-DATE-N  ')'                          22020005
220300            DELIMITED BY SIZE  INTO ODL1-V11.                     22030005
220400                                                                  22040005
220500     MOVE  PC-RFI-52-FMT-I     TO ODL2-T21.                       22050005
220600     STRING '(' XPG52-LK-DATE-FORMAT-CODE  ')'                    22060005
220700            DELIMITED BY SIZE  INTO ODL2-V21.                     22070005
220800     STRING '(' XTG52-LK-DATE-FORMAT-CODE  ')'                    22080005
220900            DELIMITED BY SIZE  INTO ODL2-V22.                     22090005
221000     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        22100005
221100                                                                  22110005
221200                                                                  22120005
221300     MOVE PC-RFI-51-CALTYP     TO ODL1-T11.                       22130005
221400     STRING '(' DTG51-CALENDAR-TYPE  ')'                          22140005
221500            DELIMITED BY SIZE  INTO ODL1-V11.                     22150005
221600                                                                  22160005
221700     MOVE PC-RFI-52-DT-I       TO ODL2-T21.                       22170005
221800     STRING '(' XPG52-LK-DATE-INPUT  ')'                          22180005
221900            DELIMITED BY SIZE  INTO ODL2-V21.                     22190005
222000     STRING '(' XTG52-LK-DATE-INPUT  ')'                          22200005
222100            DELIMITED BY SIZE  INTO ODL2-V22.                     22210005
222200     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        22220005
222300                                                                  22230005
222400                                                                  22240005
222500     MOVE PC-RFI-51-ID-IND     TO ODL1-T11.                       22250005
222600     STRING '(' DTG51-INCREMENT-DECREMENT-FLAG  ')'               22260005
222700            DELIMITED BY SIZE  INTO ODL1-V11.                     22270005
222800                                                                  22280005
222900     MOVE PC-RFI-52-FMT-O      TO ODL2-T21.                       22290005
223000     STRING '(' DPG52-LK-DATE-FORMAT-CODE  ')'                    22300005
223100            DELIMITED BY SIZE  INTO ODL2-V21.                     22310005
223200     STRING '(' DTG52-LK-DATE-FORMAT-CODE  ')'                    22320005
223300            DELIMITED BY SIZE  INTO ODL2-V22.                     22330005
223400     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        22340005
223500                                                                  22350005
223600                                                                  22360005
223700     MOVE PC-RFI-51-ID-BUS     TO ODL1-T11.                       22370005
223800     STRING '(' DTG51-INCR-DECR-BUS-DAYS-X  ')'                   22380005
223900            DELIMITED BY SIZE  INTO ODL1-V11.                     22390005
224000                                                                  22400005
224100     MOVE PC-RFI-52-DT-O       TO ODL2-T21.                       22410005
224200     STRING '(' DPG52-LK-DATE-INPUT  ')'                          22420005
224300            DELIMITED BY SIZE  INTO ODL2-V21.                     22430005
224400     STRING '(' DTG52-LK-DATE-INPUT  ')'                          22440005
224500            DELIMITED BY SIZE  INTO ODL2-V22.                     22450005
224600     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        22460005
224700                                                                  22470005
224800                                                                  22480005
224900     MOVE  PC-RFI-51-ID-DAYS   TO ODL1-T11.                       22490005
225000     STRING '(' DTG51-INCR-DECR-DAYS-X  ')'                       22500005
225100            DELIMITED BY SIZE  INTO ODL1-V11.                     22510005
225200                                                                  22520005
225300     MOVE PC-ASTERS28    TO OHL2-LEFT22  OHL2-RIGHT22.            22530005
225400     MOVE PC-TXT-PROD-53 TO OHL2-TITLE22.                         22540005
225500     PERFORM 6101-WRITE-AFTER-1.                                  22550005
225600                                                                  22560005
225700     MOVE PC-RFI-51-PVT-YR     TO ODL1-T11.                       22570005
225800     STRING '(' DTG51-CENTURY-PIVOT-YEAR-X  ')'                   22580005
225900            DELIMITED BY SIZE  INTO ODL1-V11.                     22590005
226000                                                                  22600005
226100     MOVE PC-RFI-53-CFMT-I     TO ODL2-T21.                       22610005
226200     STRING '(' XPG53-LK-CMPR-DATE-FORMAT-CODE  ')'               22620005
226300            DELIMITED BY SIZE  INTO ODL2-V21.                     22630005
226400     STRING '(' XTG53-LK-CMPR-DATE-FORMAT-CODE  ')'               22640005
226500            DELIMITED BY SIZE  INTO ODL2-V22.                     22650005
226600     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        22660005
226700                                                                  22670005
226800                                                                  22680005
226900     MOVE PC-RFI-51-ID-FW    TO ODL1-T11.                         22690005
227000     STRING '(' DTG51-INCR-DECR-FISCAL-WEEK-X  ')'                22700005
227100            DELIMITED BY SIZE  INTO ODL1-V11.                     22710005
227200     MOVE PC-RFI-53-CDT-I      TO ODL2-T21.                       22720005
227300     STRING '(' XPG53-LK-CMPR-DATE-INPUT  ')'                     22730005
227400            DELIMITED BY SIZE  INTO ODL2-V21.                     22740005
227500     STRING '(' XTG53-LK-CMPR-DATE-INPUT  ')'                     22750005
227600            DELIMITED BY SIZE  INTO ODL2-V22.                     22760005
227700     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        22770005
227800                                                                  22780005
227900                                                                  22790005
228000     MOVE PC-RFI-51-ID-FP   TO ODL1-T11.                          22800005
228100     STRING '(' DTG51-INCR-DECR-FISCAL-PRD-X  ')'                 22810005
228200            DELIMITED BY SIZE  INTO ODL1-V11.                     22820005
228300                                                                  22830005
228400     MOVE PC-RFI-53-CFMT-O     TO ODL2-T21.                       22840005
228500     STRING '(' DPG53-LK-CMPR-DATE-FORMAT-CODE  ')'               22850005
228600            DELIMITED BY SIZE  INTO ODL2-V21.                     22860005
228700     STRING '(' DTG53-LK-CMPR-DATE-FORMAT-CODE  ')'               22870005
228800            DELIMITED BY SIZE  INTO ODL2-V22.                     22880005
228900     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        22890005
229000                                                                  22900005
229100                                                                  22910005
229200     MOVE PC-RFI-53-CDT-O      TO ODL2-T21.                       22920005
229300     STRING '(' DPG53-LK-CMPR-DATE-INPUT  ')'                     22930005
229400            DELIMITED BY SIZE  INTO ODL2-V21.                     22940005
229500     STRING '(' DTG53-LK-CMPR-DATE-INPUT  ')'                     22950005
229600            DELIMITED BY SIZE  INTO ODL2-V22.                     22960005
229700     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        22970005
229800                                                                  22980005
229900                                                                  22990005
230000* ************************************************************** *23000005
230100* * THIS PARAGRAPH PRINTS THE DELTA REPORT OUTPUTS (54-56).    * *23010005
230200* ************************************************************** *23020005
230300 5200-FORMAT-DELTA-OUTPUTS.                                       23030005
230400                                                                  23040005
230500*--> DELTA OUTPARMS, LINE 01.                                     23050005
230600     MOVE PC-TXT-PROD-54 TO OHL2-TITLE21.                         23060005
230700     MOVE PC-TXT-PROD-56 TO OHL2-TITLE22.                         23070005
230800     MOVE PC-ASTERS28    TO OHL2-LEFT21  OHL2-RIGHT21             23080005
230900                            OHL2-LEFT22  OHL2-RIGHT22.            23090005
231000     PERFORM 6101-WRITE-AFTER-1.                                  23100005
231100                                                                  23110005
231200*--> DELTA OUTPARMS, LINE 02.                                     23120005
231300     MOVE PC-RFI-54-CAL-IND    TO ODL2-T11.                       23130005
231400     STRING '(' DPG54-CALENDAR-TYPE-IND ')'                       23140005
231500            DELIMITED BY SIZE  INTO ODL2-V11.                     23150005
231600     STRING '(' DTG54-CALENDAR-TYPE-IND  ')'                      23160005
231700            DELIMITED BY SIZE  INTO ODL2-V12.                     23170005
231800                                                                  23180005
231900     MOVE  PC-RFI-56-F01        TO ODL2-T21.                      23190005
232000     STRING '(' DPG56-FISCAL-YEAR-NBR-X ')'                       23200005
232100            DELIMITED BY SIZE  INTO ODL2-V21.                     23210005
232200     STRING '(' DTG56-FISCAL-YEAR-NBR-X  ')'                      23220005
232300            DELIMITED BY SIZE  INTO ODL2-V22.                     23230005
232400     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        23240005
232500                                                                  23250005
232600*--> DELTA OUTPARMS, LINE 03.                                     23260005
232700     MOVE PC-RFI-54-DT-IND     TO ODL2-T11.                       23270005
232800     STRING '(' DPG54-DATE-VALID-IND ')'                          23280005
232900            DELIMITED BY SIZE  INTO ODL2-V11.                     23290005
233000     STRING '(' DTG54-DATE-VALID-IND  ')'                         23300005
233100            DELIMITED BY SIZE  INTO ODL2-V12.                     23310005
233200                                                                  23320005
233300     MOVE PC-RFI-56-F02         TO ODL2-T21.                      23330005
233400     STRING '(' DPG56-FIRST-FD-DB2-ISO-FMT ')'                    23340005
233500            DELIMITED BY SIZE  INTO ODL2-V21.                     23350005
233600     STRING '(' DTG56-FIRST-FD-DB2-ISO-FMT  ')'                   23360005
233700            DELIMITED BY SIZE  INTO ODL2-V22.                     23370005
233800     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        23380005
233900                                                                  23390005
234000*--> DELTA OUTPARMS, LINE 04.                                     23400005
234100     MOVE  PC-RFI-54-CDT-IND   TO ODL2-T11.                       23410005
234200     STRING '(' DPG54-CMPR-DATE-VALID-IND ')'                     23420005
234300            DELIMITED BY SIZE  INTO ODL2-V11.                     23430005
234400     STRING '(' DTG54-CMPR-DATE-VALID-IND  ')'                    23440005
234500            DELIMITED BY SIZE  INTO ODL2-V12.                     23450005
234600                                                                  23460005
234700     MOVE  PC-RFI-56-F03        TO ODL2-T21.                      23470005
234800     STRING '(' DPG56-FIRST-FD-GREG-CC ')'                        23480005
234900            DELIMITED BY SIZE  INTO ODL2-V21.                     23490005
235000     STRING '(' DTG56-FIRST-FD-GREG-CC  ')'                       23500005
235100            DELIMITED BY SIZE  INTO ODL2-V22.                     23510005
235200     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        23520005
235300                                                                  23530005
235400*--> DELTA OUTPARMS, LINE 05.                                     23540005
235500     MOVE  PC-RFI-54-ID-IND    TO ODL2-T11.                       23550005
235600     STRING '(' DPG54-INCR-DECR-IND ')'                           23560005
235700            DELIMITED BY SIZE  INTO ODL2-V11.                     23570005
235800     STRING '(' DTG54-INCR-DECR-IND  ')'                          23580005
235900            DELIMITED BY SIZE  INTO ODL2-V12.                     23590005
236000                                                                  23600005
236100     MOVE  PC-RFI-56-F04        TO ODL2-T21.                      23610005
236200     STRING '(' DPG56-FIRST-FD-GREG-FMT ')'                       23620005
236300            DELIMITED BY SIZE  INTO ODL2-V21.                     23630005
236400     STRING '(' DTG56-FIRST-FD-GREG-FMT  ')'                      23640005
236500            DELIMITED BY SIZE  INTO ODL2-V22.                     23650005
236600     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        23660005
236700                                                                  23670005
236800*--> DELTA OUTPARMS, LINE 06.                                     23680005
236900     MOVE PC-RFI-54-ERR-IND    TO ODL2-T11.                       23690005
237000     STRING '(' DPG54-ERROR-IND ')'                               23700005
237100            DELIMITED BY SIZE  INTO ODL2-V11.                     23710005
237200     STRING '(' DTG54-ERROR-IND  ')'                              23720005
237300            DELIMITED BY SIZE  INTO ODL2-V12.                     23730005
237400                                                                  23740005
237500     MOVE  PC-RFI-56-F05        TO ODL2-T21.                      23750005
237600     STRING '(' DPG56-FIRST-FD-GREG ')'                           23760005
237700            DELIMITED BY SIZE  INTO ODL2-V21.                     23770005
237800     STRING '(' DTG56-FIRST-FD-GREG  ')'                          23780005
237900            DELIMITED BY SIZE  INTO ODL2-V22.                     23790005
238000     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        23800005
238100                                                                  23810005
238200*--> DELTA OUTPARMS, LINE 07.                                     23820005
238300     MOVE DPG54-ERROR-MESSAGE TO                                  23830005
238400                PV-PROD-MESSAGE-WORK-AREA.                        23840005
238500     MOVE DTG54-ERROR-MESSAGE TO                                  23850005
238600                PV-TEST-MESSAGE-WORK-AREA.                        23860005
238700     MOVE PC-RFI-54-EMSG1      TO ODL2-T11.                       23870005
238800     STRING '(' PV-EMSG-P1 ')'                                    23880005
238900            DELIMITED BY SIZE  INTO ODL2-V11.                     23890005
239000     STRING '(' PV-EMSG-T1 ')'                                    23900005
239100            DELIMITED BY SIZE  INTO ODL2-V12.                     23910005
239200                                                                  23920005
239300     MOVE  PC-RFI-56-F06        TO ODL2-T21.                      23930005
239400     STRING '(' DPG56-FIRST-FD-JULIAN ')'                         23940005
239500            DELIMITED BY SIZE  INTO ODL2-V21.                     23950005
239600     STRING '(' DTG56-FIRST-FD-JULIAN  ')'                        23960005
239700            DELIMITED BY SIZE  INTO ODL2-V22.                     23970005
239800     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        23980005
239900                                                                  23990005
240000*--> DELTA OUTPARMS, LINE 08.                                     24000005
240100     MOVE PC-RFI-54-EMSG2      TO ODL2-T11.                       24010005
240200     STRING '(' PV-EMSG-P2 ')'                                    24020005
240300            DELIMITED BY SIZE  INTO ODL2-V11.                     24030005
240400     STRING '(' PV-EMSG-T2 ')'                                    24040005
240500            DELIMITED BY SIZE  INTO ODL2-V12.                     24050005
240600                                                                  24060005
240700     MOVE PC-RFI-56-F07         TO ODL2-T21.                      24070005
240800     STRING '(' DPG56-LAST-FD-DB2-ISO-FMT ')'                     24080005
240900            DELIMITED BY SIZE  INTO ODL2-V21.                     24090005
241000     STRING '(' DTG56-LAST-FD-DB2-ISO-FMT  ')'                    24100005
241100            DELIMITED BY SIZE  INTO ODL2-V22.                     24110005
241200     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        24120005
241300                                                                  24130005
241400*--> DELTA OUTPARMS, LINE 09.                                     24140005
241500     MOVE PC-RFI-54-EMSG3      TO ODL2-T11.                       24150005
241600     STRING '(' PV-EMSG-P3 ')'                                    24160005
241700            DELIMITED BY SIZE  INTO ODL2-V11.                     24170005
241800     STRING '(' PV-EMSG-T3 ')'                                    24180005
241900            DELIMITED BY SIZE  INTO ODL2-V12.                     24190005
242000                                                                  24200005
242100     MOVE  PC-RFI-56-F08        TO ODL2-T21.                      24210005
242200     STRING '(' DPG56-LAST-FD-GREG-CC ')'                         24220005
242300            DELIMITED BY SIZE  INTO ODL2-V21.                     24230005
242400     STRING '(' DTG56-LAST-FD-GREG-CC  ')'                        24240005
242500            DELIMITED BY SIZE  INTO ODL2-V22.                     24250005
242600     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        24260005
242700                                                                  24270005
242800*--> DELTA OUTPARMS, LINE 10.                                     24280005
242900     MOVE  PC-RFI-56-F09        TO ODL2-T21.                      24290005
243000     STRING '(' DPG56-LAST-FD-GREG-FMT ')'                        24300005
243100            DELIMITED BY SIZE  INTO ODL2-V21.                     24310005
243200     STRING '(' DTG56-LAST-FD-GREG-FMT  ')'                       24320005
243300            DELIMITED BY SIZE  INTO ODL2-V22.                     24330005
243400     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        24340005
243500                                                                  24350005
243600*--> DELTA OUTPARMS, LINE 11.                                     24360005
243700     MOVE  PC-RFI-56-F10        TO ODL2-T21.                      24370005
243800     STRING '(' DPG56-LAST-FD-GREG ')'                            24380005
243900            DELIMITED BY SIZE  INTO ODL2-V21.                     24390005
244000     STRING '(' DTG56-LAST-FD-GREG  ')'                           24400005
244100            DELIMITED BY SIZE  INTO ODL2-V22.                     24410005
244200     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        24420005
244300                                                                  24430005
244400*--> DELTA OUTPARMS, LINE 12.                                     24440005
244500     MOVE PC-TXT-PROD-55 TO OHL2-TITLE21.                         24450005
244600     MOVE PC-ASTERS28    TO OHL2-LEFT21  OHL2-RIGHT21.            24460005
244700                                                                  24470005
244800     MOVE  PC-RFI-56-F11        TO ODL2-T21.                      24480005
244900     STRING '(' DPG56-LAST-FD-JULIAN ')'                          24490005
245000            DELIMITED BY SIZE  INTO ODL2-V21.                     24500005
245100     STRING '(' DTG56-LAST-FD-JULIAN  ')'                         24510005
245200            DELIMITED BY SIZE  INTO ODL2-V22.                     24520005
245300     PERFORM 5320-HILITE-COL2-DIFF.                               24530005
245400     PERFORM 6101-WRITE-AFTER-1.                                  24540005
245500                                                                  24550005
245600*--> DELTA OUTPARMS, LINE 13.                                     24560005
245700     MOVE  PC-RFI-55-A01       TO ODL2-T11.                       24570005
245800     STRING '(' DPG55-DB2-ISO-DATE-FMT ')'                        24580005
245900            DELIMITED BY SIZE  INTO ODL2-V11.                     24590005
246000     STRING '(' DTG55-DB2-ISO-DATE-FMT  ')'                       24600005
246100            DELIMITED BY SIZE  INTO ODL2-V12.                     24610005
246200                                                                  24620005
246300     MOVE  PC-RFI-56-F12        TO ODL2-T21.                      24630005
246400     STRING '(' DPG56-NBR-FISCAL-WEEKS-X ')'                      24640005
246500            DELIMITED BY SIZE  INTO ODL2-V21.                     24650005
246600     STRING '(' DTG56-NBR-FISCAL-WEEKS-X  ')'                     24660005
246700            DELIMITED BY SIZE  INTO ODL2-V22.                     24670005
246800     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        24680005
246900                                                                  24690005
247000*--> DELTA OUTPARMS, LINE 14.                                     24700005
247100     MOVE  PC-RFI-55-A02       TO ODL2-T11.                       24710005
247200     STRING '(' DPG55-DB2-ISO-DATE ')'                            24720005
247300            DELIMITED BY SIZE  INTO ODL2-V11.                     24730005
247400     STRING '(' DTG55-DB2-ISO-DATE  ')'                           24740005
247500            DELIMITED BY SIZE  INTO ODL2-V12.                     24750005
247600                                                                  24760005
247700     MOVE  PC-RFI-56-F13        TO ODL2-T21.                      24770005
247800     STRING '(' DPG56-FISCAL-WEEK-NBR-X ')'                       24780005
247900            DELIMITED BY SIZE  INTO ODL2-V21.                     24790005
248000     STRING '(' DTG56-FISCAL-WEEK-NBR-X  ')'                      24800005
248100            DELIMITED BY SIZE  INTO ODL2-V22.                     24810005
248200     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        24820005
248300                                                                  24830005
248400*--> DELTA OUTPARMS, LINE 15.                                     24840005
248500     MOVE  PC-RFI-55-A03       TO ODL2-T11.                       24850005
248600     STRING '(' DPG55-GREG-CC-DATE-FMT ')'                        24860005
248700            DELIMITED BY SIZE  INTO ODL2-V11.                     24870005
248800     STRING '(' DTG55-GREG-CC-DATE-FMT  ')'                       24880005
248900            DELIMITED BY SIZE  INTO ODL2-V12.                     24890005
249000                                                                  24900005
249100     MOVE  PC-RFI-56-F14        TO ODL2-T21.                      24910005
249200     STRING '(' DPG56-NBR-FISCAL-DAYS-X ')'                       24920005
249300            DELIMITED BY SIZE  INTO ODL2-V21.                     24930005
249400     STRING '(' DTG56-NBR-FISCAL-DAYS-X  ')'                      24940005
249500            DELIMITED BY SIZE  INTO ODL2-V22.                     24950005
249600     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        24960005
249700                                                                  24970005
249800*--> DELTA OUTPARMS, LINE 16.                                     24980005
249900     MOVE  PC-RFI-55-A04       TO ODL2-T11.                       24990005
250000     STRING '(' DPG55-GREG-CC-DATE ')'                            25000005
250100            DELIMITED BY SIZE  INTO ODL2-V11.                     25010005
250200     STRING '(' DTG55-GREG-CC-DATE  ')'                           25020005
250300            DELIMITED BY SIZE  INTO ODL2-V12.                     25030005
250400                                                                  25040005
250500     MOVE  PC-RFI-56-F15        TO ODL2-T21.                      25050005
250600     STRING '(' DPG56-CURR-FISCAL-SEASON ')'                      25060005
250700            DELIMITED BY SIZE  INTO ODL2-V21.                     25070005
250800     STRING '(' DTG56-CURR-FISCAL-SEASON  ')'                     25080005
250900            DELIMITED BY SIZE  INTO ODL2-V22.                     25090005
251000     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        25100005
251100                                                                  25110005
251200*--> DELTA OUTPARMS, LINE 17.                                     25120005
251300     MOVE  PC-RFI-55-A05       TO ODL2-T11.                       25130005
251400     STRING '(' DPG55-GREG-DATE-FMT ')'                           25140005
251500            DELIMITED BY SIZE  INTO ODL2-V11.                     25150005
251600     STRING '(' DTG55-GREG-DATE-FMT  ')'                          25160005
251700            DELIMITED BY SIZE  INTO ODL2-V12.                     25170005
251800                                                                  25180005
251900     MOVE  PC-RFI-56-F16        TO ODL2-T21.                      25190005
252000     STRING '(' DPG56-FISCAL-QTR-NBR-X ')'                        25200005
252100            DELIMITED BY SIZE  INTO ODL2-V21.                     25210005
252200     STRING '(' DTG56-FISCAL-QTR-NBR-X  ')'                       25220005
252300            DELIMITED BY SIZE  INTO ODL2-V22.                     25230005
252400     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        25240005
252500                                                                  25250005
252600*--> DELTA OUTPARMS, LINE 18.                                     25260005
252700     MOVE  PC-RFI-55-A06       TO ODL2-T11.                       25270005
252800     STRING '(' DPG55-GREG-DATE ')'                               25280005
252900            DELIMITED BY SIZE  INTO ODL2-V11.                     25290005
253000     STRING '(' DTG55-GREG-DATE  ')'                              25300005
253100            DELIMITED BY SIZE  INTO ODL2-V12.                     25310005
253200                                                                  25320005
253300     MOVE  PC-RFI-56-F17        TO ODL2-T21.                      25330005
253400     STRING '(' DPG56-FIRST-FQ-DB2-ISO-FMT ')'                    25340005
253500            DELIMITED BY SIZE  INTO ODL2-V21.                     25350005
253600     STRING '(' DTG56-FIRST-FQ-DB2-ISO-FMT  ')'                   25360005
253700            DELIMITED BY SIZE  INTO ODL2-V22.                     25370005
253800     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        25380005
253900                                                                  25390005
254000*--> DELTA OUTPARMS, LINE 19.                                     25400005
254100     MOVE  PC-RFI-55-A07       TO ODL2-T11.                       25410005
254200     STRING '(' DPG55-JULIAN-DATE-CCYYDDD ')'                     25420005
254300            DELIMITED BY SIZE  INTO ODL2-V11.                     25430005
254400     STRING '(' DTG55-JULIAN-DATE-CCYYDDD  ')'                    25440005
254500            DELIMITED BY SIZE  INTO ODL2-V12.                     25450005
254600                                                                  25460005
254700     MOVE  PC-RFI-56-F18        TO ODL2-T21.                      25470005
254800     STRING '(' DPG56-FIRST-FQ-GREG-CC ')'                        25480005
254900            DELIMITED BY SIZE  INTO ODL2-V21.                     25490005
255000     STRING '(' DTG56-FIRST-FQ-GREG-CC  ')'                       25500005
255100            DELIMITED BY SIZE  INTO ODL2-V22.                     25510005
255200     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        25520005
255300                                                                  25530005
255400*--> DELTA OUTPARMS, LINE 20.                                     25540005
255500     MOVE  PC-RFI-55-A08       TO ODL2-T11.                       25550005
255600     STRING '(' DPG55-JULIAN-DATE-FMT ')'                         25560005
255700            DELIMITED BY SIZE  INTO ODL2-V11.                     25570005
255800     STRING '(' DTG55-JULIAN-DATE-FMT  ')'                        25580005
255900            DELIMITED BY SIZE  INTO ODL2-V12.                     25590005
256000                                                                  25600005
256100     MOVE  PC-RFI-56-F19        TO ODL2-T21.                      25610005
256200     STRING '(' DPG56-FIRST-FQ-GREG-FMT ')'                       25620005
256300            DELIMITED BY SIZE  INTO ODL2-V21.                     25630005
256400     STRING '(' DTG56-FIRST-FQ-GREG-FMT  ')'                      25640005
256500            DELIMITED BY SIZE  INTO ODL2-V22.                     25650005
256600     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        25660005
256700                                                                  25670005
256800*--> DELTA OUTPARMS, LINE 21.                                     25680005
256900     MOVE  PC-RFI-55-A09       TO ODL2-T11.                       25690005
257000     STRING '(' DPG55-JULIAN-DATE ')'                             25700005
257100            DELIMITED BY SIZE  INTO ODL2-V11.                     25710005
257200     STRING '(' DTG55-JULIAN-DATE  ')'                            25720005
257300            DELIMITED BY SIZE  INTO ODL2-V12.                     25730005
257400                                                                  25740005
257500     MOVE  PC-RFI-56-F20        TO ODL2-T21.                      25750005
257600     STRING '(' DPG56-FIRST-FQ-GREG ')'                           25760005
257700            DELIMITED BY SIZE  INTO ODL2-V21.                     25770005
257800     STRING '(' DTG56-FIRST-FQ-GREG  ')'                          25780005
257900            DELIMITED BY SIZE  INTO ODL2-V22.                     25790005
258000     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        25800005
258100                                                                  25810005
258200*--> DELTA OUTPARMS, LINE 22.                                     25820005
258800                                                                  25880005
258900     MOVE  PC-RFI-56-F21        TO ODL2-T21.                      25890005
259000     STRING '(' DPG56-FIRST-FQ-JULIAN ')'                         25900005
259100            DELIMITED BY SIZE  INTO ODL2-V21.                     25910005
259200     STRING '(' DTG56-FIRST-FQ-JULIAN  ')'                        25920005
259300            DELIMITED BY SIZE  INTO ODL2-V22.                     25930005
259400     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        25940005
259500                                                                  25950005
259600*--> DELTA OUTPARMS, LINE 23.                                     25960005
259700     MOVE  PC-RFI-55-A11       TO ODL2-T11.                       25970005
259800     STRING '(' DPG55-ALPHA-MONTH ')'                             25980005
259900            DELIMITED BY SIZE  INTO ODL2-V11.                     25990005
260000     STRING '(' DTG55-ALPHA-MONTH  ')'                            26000005
260100            DELIMITED BY SIZE  INTO ODL2-V12.                     26010005
260200                                                                  26020005
260300     MOVE  PC-RFI-56-F22        TO ODL2-T21.                      26030005
260400     STRING '(' DPG56-LAST-FQ-DB2-ISO-FMT ')'                     26040005
260500            DELIMITED BY SIZE  INTO ODL2-V21.                     26050005
260600     STRING '(' DTG56-LAST-FQ-DB2-ISO-FMT  ')'                    26060005
260700            DELIMITED BY SIZE  INTO ODL2-V22.                     26070005
260800     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        26080005
260900                                                                  26090005
261000*--> DELTA OUTPARMS, LINE 24.                                     26100005
261100     MOVE  PC-RFI-55-A12       TO ODL2-T11.                       26110005
261200     STRING '(' DPG55-ALPHA-MONTH-ABBR3 ')'                       26120005
261300            DELIMITED BY SIZE  INTO ODL2-V11.                     26130005
261400     STRING '(' DTG55-ALPHA-MONTH-ABBR3  ')'                      26140005
261500            DELIMITED BY SIZE  INTO ODL2-V12.                     26150005
261600                                                                  26160005
261700     MOVE  PC-RFI-56-F23        TO ODL2-T21.                      26170005
261800     STRING '(' DPG56-LAST-FQ-GREG-CC ')'                         26180005
261900            DELIMITED BY SIZE  INTO ODL2-V21.                     26190005
262000     STRING '(' DTG56-LAST-FQ-GREG-CC  ')'                        26200005
262100            DELIMITED BY SIZE  INTO ODL2-V22.                     26210005
262200     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        26220005
262300                                                                  26230005
262400*--> DELTA OUTPARMS, LINE 25.                                     26240005
262500     MOVE  PC-RFI-55-A13       TO ODL2-T11.                       26250005
262600     STRING '(' DPG55-DAYS-IN-MONTH ')'                           26260005
262700            DELIMITED BY SIZE  INTO ODL2-V11.                     26270005
262800     STRING '(' DTG55-DAYS-IN-MONTH  ')'                          26280005
262900            DELIMITED BY SIZE  INTO ODL2-V12.                     26290005
263000                                                                  26300005
263100     MOVE  PC-RFI-56-F24        TO ODL2-T21.                      26310005
263200     STRING '(' DPG56-LAST-FQ-GREG-FMT ')'                        26320005
263300            DELIMITED BY SIZE  INTO ODL2-V21.                     26330005
263400     STRING '(' DTG56-LAST-FQ-GREG-FMT  ')'                       26340005
263500            DELIMITED BY SIZE  INTO ODL2-V22.                     26350005
263600     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        26360005
263700                                                                  26370005
263800*--> DELTA OUTPARMS, LINE 26.                                     26380005
263900     MOVE  PC-RFI-55-A14       TO ODL2-T11.                       26390005
264000     STRING '(' DPG55-ALPHA-WEEK-DAY ')'                          26400005
264100            DELIMITED BY SIZE  INTO ODL2-V11.                     26410005
264200     STRING '(' DTG55-ALPHA-WEEK-DAY  ')'                         26420005
264300            DELIMITED BY SIZE  INTO ODL2-V12.                     26430005
264400                                                                  26440005
264500     MOVE  PC-RFI-56-F25        TO ODL2-T21.                      26450005
264600     STRING '(' DPG56-LAST-FQ-GREG ')'                            26460005
264700            DELIMITED BY SIZE  INTO ODL2-V21.                     26470005
264800     STRING '(' DTG56-LAST-FQ-GREG  ')'                           26480005
264900            DELIMITED BY SIZE  INTO ODL2-V22.                     26490005
265000     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        26500005
265100                                                                  26510005
265200*--> DELTA OUTPARMS, LINE 27.                                     26520005
265300     MOVE  PC-RFI-55-A15       TO ODL2-T11.                       26530005
265400     STRING '(' DPG55-ALPHA-WEEK-DAY-ABBR3 ')'                    26540005
265500            DELIMITED BY SIZE  INTO ODL2-V11.                     26550005
265600     STRING '(' DTG55-ALPHA-WEEK-DAY-ABBR3  ')'                   26560005
265700            DELIMITED BY SIZE  INTO ODL2-V12.                     26570005
265800                                                                  26580005
265900     MOVE  PC-RFI-56-F26        TO ODL2-T21.                      26590005
266000     STRING '(' DPG56-LAST-FQ-JULIAN ')'                          26600005
266100            DELIMITED BY SIZE  INTO ODL2-V21.                     26610005
266200     STRING '(' DTG56-LAST-FQ-JULIAN  ')'                         26620005
266300            DELIMITED BY SIZE  INTO ODL2-V22.                     26630005
266400     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        26640005
266500                                                                  26650005
266600*--> DELTA OUTPARMS, LINE 28.                                     26660005
266700     MOVE  PC-RFI-55-A16       TO ODL2-T11.                       26670005
266800     STRING '(' DPG55-ALPHA-WEEK-DAY-ABBR2 ')'                    26680005
266900            DELIMITED BY SIZE  INTO ODL2-V11.                     26690005
267000     STRING '(' DTG55-ALPHA-WEEK-DAY-ABBR2  ')'                   26700005
267100            DELIMITED BY SIZE  INTO ODL2-V12.                     26710005
267200                                                                  26720005
267300     MOVE  PC-RFI-56-F27        TO ODL2-T21.                      26730005
267400     STRING '(' DPG56-NBR-FISCAL-QTR-WEEKS-X ')'                  26740005
267500            DELIMITED BY SIZE  INTO ODL2-V21.                     26750005
267600     STRING '(' DTG56-NBR-FISCAL-QTR-WEEKS-X  ')'                 26760005
267700            DELIMITED BY SIZE  INTO ODL2-V22.                     26770005
267800     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        26780005
267900                                                                  26790005
268000*--> DELTA OUTPARMS, LINE 29.                                     26800005
268100     MOVE  PC-RFI-55-A17       TO ODL2-T11.                       26810005
268200     STRING '(' DPG55-NUMERIC-WEEK-DAY-X ')'                      26820005
268300            DELIMITED BY SIZE  INTO ODL2-V11.                     26830005
268400     STRING '(' DTG55-NUMERIC-WEEK-DAY-X  ')'                     26840005
268500            DELIMITED BY SIZE  INTO ODL2-V12.                     26850005
268600                                                                  26860005
268700     MOVE  PC-RFI-56-F28        TO ODL2-T21.                      26870005
268800     STRING '(' DPG56-FISCAL-QTR-WEEK-X ')'                       26880005
268900            DELIMITED BY SIZE  INTO ODL2-V21.                     26890005
269000     STRING '(' DTG56-FISCAL-QTR-WEEK-X  ')'                      26900005
269100            DELIMITED BY SIZE  INTO ODL2-V22.                     26910005
269200     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        26920005
269300                                                                  26930005
269400*--> DELTA OUTPARMS, LINE 30.                                     26940005
269500     MOVE  PC-RFI-55-A18       TO ODL2-T11.                       26950005
269600     STRING '(' DPG55-1ST-WKDY-DB2ISO-FMT ')'                     26960005
269700            DELIMITED BY SIZE  INTO ODL2-V11.                     26970005
269800     STRING '(' DTG55-1ST-WKDY-DB2ISO-FMT  ')'                    26980005
269900            DELIMITED BY SIZE  INTO ODL2-V12.                     26990005
270000                                                                  27000005
270100     MOVE  PC-RFI-56-F29        TO ODL2-T21.                      27010005
270200     STRING '(' DPG56-FISCAL-PERIOD-NBR-X ')'                     27020005
270300            DELIMITED BY SIZE  INTO ODL2-V21.                     27030005
270400     STRING '(' DTG56-FISCAL-PERIOD-NBR-X  ')'                    27040005
270500            DELIMITED BY SIZE  INTO ODL2-V22.                     27050005
270600     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        27060005
270700                                                                  27070005
270800*--> DELTA OUTPARMS, LINE 31.                                     27080005
270900     MOVE  PC-RFI-55-A19       TO ODL2-T11.                       27090005
271000     STRING '(' DPG55-1ST-WKDY-GREG-CC ')'                        27100005
271100            DELIMITED BY SIZE  INTO ODL2-V11.                     27110005
271200     STRING '(' DTG55-1ST-WKDY-GREG-CC  ')'                       27120005
271300            DELIMITED BY SIZE  INTO ODL2-V12.                     27130005
271400                                                                  27140005
271500     MOVE  PC-RFI-56-F30        TO ODL2-T21.                      27150005
271600     STRING '(' DPG56-FIRST-FP-DB2-ISO-FMT ')'                    27160005
271700            DELIMITED BY SIZE  INTO ODL2-V21.                     27170005
271800     STRING '(' DTG56-FIRST-FP-DB2-ISO-FMT  ')'                   27180005
271900            DELIMITED BY SIZE  INTO ODL2-V22.                     27190005
272000     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        27200005
272100                                                                  27210005
272200*--> DELTA OUTPARMS, LINE 32.                                     27220005
272300     MOVE  PC-RFI-55-A20       TO ODL2-T11.                       27230005
272400     STRING '(' DPG55-1ST-WKDY-GREG-FMT ')'                       27240005
272500            DELIMITED BY SIZE  INTO ODL2-V11.                     27250005
272600     STRING '(' DTG55-1ST-WKDY-GREG-FMT  ')'                      27260005
272700            DELIMITED BY SIZE  INTO ODL2-V12.                     27270005
272800                                                                  27280005
272900     MOVE  PC-RFI-56-F31        TO ODL2-T21.                      27290005
273000     STRING '(' DPG56-FIRST-FP-GREG-CC ')'                        27300005
273100            DELIMITED BY SIZE  INTO ODL2-V21.                     27310005
273200     STRING '(' DTG56-FIRST-FP-GREG-CC  ')'                       27320005
273300            DELIMITED BY SIZE  INTO ODL2-V22.                     27330005
273400     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        27340005
273500                                                                  27350005
273600*--> DELTA OUTPARMS, LINE 33.                                     27360005
273700     MOVE  PC-RFI-55-A21       TO ODL2-T11.                       27370005
273800     STRING '(' DPG55-1ST-WKDY-GREG ')'                           27380005
273900            DELIMITED BY SIZE  INTO ODL2-V11.                     27390005
274000     STRING '(' DTG55-1ST-WKDY-GREG  ')'                          27400005
274100            DELIMITED BY SIZE  INTO ODL2-V12.                     27410005
274200                                                                  27420005
274300     MOVE  PC-RFI-56-F32        TO ODL2-T21.                      27430005
274400     STRING '(' DPG56-FIRST-FP-GREG-FMT ')'                       27440005
274500            DELIMITED BY SIZE  INTO ODL2-V21.                     27450005
274600     STRING '(' DTG56-FIRST-FP-GREG-FMT  ')'                      27460005
274700            DELIMITED BY SIZE  INTO ODL2-V22.                     27470005
274800     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        27480005
274900                                                                  27490005
275000*--> DELTA OUTPARMS, LINE 34.                                     27500005
275100     MOVE  PC-RFI-55-A22       TO ODL2-T11.                       27510005
275200     STRING '(' DPG55-1ST-WKDY-JULIAN ')'                         27520005
275300            DELIMITED BY SIZE  INTO ODL2-V11.                     27530005
275400     STRING '(' DTG55-1ST-WKDY-JULIAN  ')'                        27540005
275500            DELIMITED BY SIZE  INTO ODL2-V12.                     27550005
275600                                                                  27560005
275700     MOVE  PC-RFI-56-F33        TO ODL2-T21.                      27570005
275800     STRING '(' DPG56-FIRST-FP-GREG ')'                           27580005
275900            DELIMITED BY SIZE  INTO ODL2-V21.                     27590005
276000     STRING '(' DTG56-FIRST-FP-GREG  ')'                          27600005
276100            DELIMITED BY SIZE  INTO ODL2-V22.                     27610005
276200     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        27620005
276300                                                                  27630005
276400*--> DELTA OUTPARMS, LINE 35.                                     27640005
276500     MOVE  PC-RFI-55-A23       TO ODL2-T11.                       27650005
276600     STRING '(' DPG55-LAST-WKDY-DB2ISO-FMT ')'                    27660005
276700            DELIMITED BY SIZE  INTO ODL2-V11.                     27670005
276800     STRING '(' DTG55-LAST-WKDY-DB2ISO-FMT  ')'                   27680005
276900            DELIMITED BY SIZE  INTO ODL2-V12.                     27690005
277000                                                                  27700005
277100     MOVE  PC-RFI-56-F34        TO ODL2-T21.                      27710005
277200     STRING '(' DPG56-FIRST-FP-JULIAN ')'                         27720005
277300            DELIMITED BY SIZE  INTO ODL2-V21.                     27730005
277400     STRING '(' DTG56-FIRST-FP-JULIAN  ')'                        27740005
277500            DELIMITED BY SIZE  INTO ODL2-V22.                     27750005
277600     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        27760005
277700                                                                  27770005
277800*--> DELTA OUTPARMS, LINE 36.                                     27780005
277900     MOVE  PC-RFI-55-A24       TO ODL2-T11.                       27790005
278000     STRING '(' DPG55-LAST-WKDY-GREG-CC ')'                       27800005
278100            DELIMITED BY SIZE  INTO ODL2-V11.                     27810005
278200     STRING '(' DTG55-LAST-WKDY-GREG-CC  ')'                      27820005
278300            DELIMITED BY SIZE  INTO ODL2-V12.                     27830005
278400                                                                  27840005
278500     MOVE  PC-RFI-56-F35        TO ODL2-T21.                      27850005
278600     STRING '(' DPG56-LAST-FP-DB2-ISO-FMT ')'                     27860005
278700            DELIMITED BY SIZE  INTO ODL2-V21.                     27870005
278800     STRING '(' DTG56-LAST-FP-DB2-ISO-FMT  ')'                    27880005
278900            DELIMITED BY SIZE  INTO ODL2-V22.                     27890005
279000     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        27900005
279100                                                                  27910005
279200*--> DELTA OUTPARMS, LINE 37.                                     27920005
279300     MOVE  PC-RFI-55-A25       TO ODL2-T11.                       27930005
279400     STRING '(' DPG55-LAST-WKDY-GREG-FMT ')'                      27940005
279500            DELIMITED BY SIZE  INTO ODL2-V11.                     27950005
279600     STRING '(' DTG55-LAST-WKDY-GREG-FMT  ')'                     27960005
279700            DELIMITED BY SIZE  INTO ODL2-V12.                     27970005
279800                                                                  27980005
279900     MOVE  PC-RFI-56-F36        TO ODL2-T21.                      27990005
280000     STRING '(' DPG56-LAST-FP-GREG-CC ')'                         28000005
280100            DELIMITED BY SIZE  INTO ODL2-V21.                     28010005
280200     STRING '(' DTG56-LAST-FP-GREG-CC  ')'                        28020005
280300            DELIMITED BY SIZE  INTO ODL2-V22.                     28030005
280400     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        28040005
280500                                                                  28050005
280600*--> DELTA OUTPARMS, LINE 38.                                     28060005
280700     MOVE  PC-RFI-55-A26       TO ODL2-T11.                       28070005
280800     STRING '(' DPG55-LAST-WKDY-GREG ')'                          28080005
280900            DELIMITED BY SIZE  INTO ODL2-V11.                     28090005
281000     STRING '(' DTG55-LAST-WKDY-GREG  ')'                         28100005
281100            DELIMITED BY SIZE  INTO ODL2-V12.                     28110005
281200                                                                  28120005
281300     MOVE  PC-RFI-56-F37        TO ODL2-T21.                      28130005
281400     STRING '(' DPG56-LAST-FP-GREG-FMT ')'                        28140005
281500            DELIMITED BY SIZE  INTO ODL2-V21.                     28150005
281600     STRING '(' DTG56-LAST-FP-GREG-FMT  ')'                       28160005
281700            DELIMITED BY SIZE  INTO ODL2-V22.                     28170005
281800     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        28180005
281900                                                                  28190005
282000*--> DELTA OUTPARMS, LINE 39.                                     28200005
282100     MOVE  PC-RFI-55-A27       TO ODL2-T11.                       28210005
282200     STRING '(' DPG55-LAST-WKDY-JULIAN ')'                        28220005
282300            DELIMITED BY SIZE  INTO ODL2-V11.                     28230005
282400     STRING '(' DTG55-LAST-WKDY-JULIAN  ')'                       28240005
282500            DELIMITED BY SIZE  INTO ODL2-V12.                     28250005
282600                                                                  28260005
282700     MOVE  PC-RFI-56-F38        TO ODL2-T21.                      28270005
282800     STRING '(' DPG56-LAST-FP-GREG ')'                            28280005
282900            DELIMITED BY SIZE  INTO ODL2-V21.                     28290005
283000     STRING '(' DTG56-LAST-FP-GREG  ')'                           28300005
283100            DELIMITED BY SIZE  INTO ODL2-V22.                     28310005
283200     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        28320005
283300                                                                  28330005
283400*--> DELTA OUTPARMS, LINE 40.                                     28340005
283500     MOVE  PC-RFI-55-A28       TO ODL2-T11.                       28350005
283600     STRING '(' DPG55-CORP-BUS-DAY-IND ')'                        28360005
283700            DELIMITED BY SIZE  INTO ODL2-V11.                     28370005
283800     STRING '(' DTG55-CORP-BUS-DAY-IND  ')'                       28380005
283900            DELIMITED BY SIZE  INTO ODL2-V12.                     28390005
284000                                                                  28400005
284100     MOVE  PC-RFI-56-F39        TO ODL2-T21.                      28410005
284200     STRING '(' DPG56-LAST-FP-JULIAN ')'                          28420005
284300            DELIMITED BY SIZE  INTO ODL2-V21.                     28430005
284400     STRING '(' DTG56-LAST-FP-JULIAN  ')'                         28440005
284500            DELIMITED BY SIZE  INTO ODL2-V22.                     28450005
284600     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        28460005
284700                                                                  28470005
284800*--> DELTA OUTPARMS, LINE 41.                                     28480005
284900     MOVE  PC-RFI-55-A29       TO ODL2-T11.                       28490005
285000     STRING '(' DPG55-CORP-HOLIDAY-IND ')'                        28500005
285100            DELIMITED BY SIZE  INTO ODL2-V11.                     28510005
285200     STRING '(' DTG55-CORP-HOLIDAY-IND  ')'                       28520005
285300            DELIMITED BY SIZE  INTO ODL2-V12.                     28530005
285400                                                                  28540005
285500     MOVE  PC-RFI-56-F40        TO ODL2-T21.                      28550005
285600     STRING '(' DPG56-NBR-FISCAL-PERIOD-WEEK-X ')'                28560005
285700            DELIMITED BY SIZE  INTO ODL2-V21.                     28570005
285800     STRING '(' DTG56-NBR-FISCAL-PERIOD-WEEK-X  ')'               28580005
285900            DELIMITED BY SIZE  INTO ODL2-V22.                     28590005
286000     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        28600005
286100                                                                  28610005
286200*--> DELTA OUTPARMS, LINE 42.                                     28620005
286300     MOVE  PC-RFI-55-A30       TO ODL2-T11.                       28630005
286400     STRING '(' DPG55-STORE-HOLIDAY-IND ')'                       28640005
286500            DELIMITED BY SIZE  INTO ODL2-V11.                     28650005
286600     STRING '(' DTG55-STORE-HOLIDAY-IND ')'                       28660005
286700            DELIMITED BY SIZE  INTO ODL2-V12.                     28670005
286800                                                                  28680005
286900     MOVE  PC-RFI-56-F41        TO ODL2-T21.                      28690005
287000     STRING '(' DPG56-FISCAL-PERIOD-WEEK-X  ')'                   28700005
287100            DELIMITED BY SIZE  INTO ODL2-V21.                     28710005
287200     STRING '(' DTG56-FISCAL-PERIOD-WEEK-X  ')'                   28720005
287300            DELIMITED BY SIZE  INTO ODL2-V22.                     28730005
287400     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        28740005
287500                                                                  28750005
287600*--> DELTA OUTPARMS, LINE 43.                                     28760005
287700     MOVE  PC-RFI-55-A31       TO ODL2-T11.                       28770005
287800     STRING '(' DPG55-CMPR-GREG-CC-FMT ')'                        28780005
287900            DELIMITED BY SIZE  INTO ODL2-V11.                     28790005
288000     STRING '(' DTG55-CMPR-GREG-CC-FMT  ')'                       28800005
288100            DELIMITED BY SIZE  INTO ODL2-V12.                     28810005
288200                                                                  28820005
288300     MOVE  PC-RFI-56-F42        TO ODL2-T21.                      28830005
288400     STRING '(' DTG56-FISCAL-YEAR-CCYY ')'                        28840005
288500            DELIMITED BY SIZE  INTO ODL2-V22.                     28850005
288600     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        28860005
288700                                                                  28870005
288800*--> DELTA OUTPARMS, LINE 44.                                     28880005
288900     MOVE  PC-RFI-55-A32       TO ODL2-T11.                       28890005
289000     MOVE  DPG55-DAYS-DIFFERENCE TO PV-PIC-X-5.                   28900005
289100     STRING '(' PV-PIC-X-5 ')' DELIMITED BY SIZE INTO ODL2-V11.   28910005
289200     MOVE  DTG55-DAYS-DIFFERENCE TO PV-PIC-X-5.                   28920005
289300     STRING '(' PV-PIC-X-5 ')' DELIMITED BY SIZE INTO ODL2-V12.   28930005
289400                                                                  28940005
289500     MOVE  PC-RFI-56-F43        TO ODL2-T21.                      28950005
289600     STRING '(' DTG56-FIRST-FS-DB2-ISO-FMT ')'                    28960005
289700            DELIMITED BY SIZE  INTO ODL2-V22.                     28970005
289800     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        28980005
289900                                                                  28990005
290000*--> DELTA OUTPARMS, LINE 45.                                     29000005
290100     MOVE  PC-RFI-55-A33       TO ODL2-T11.                       29010005
290200     MOVE  DPG55-BUS-DAYS-DIFFERENCE TO PV-PIC-X-5.               29020005
290300     STRING '(' PV-PIC-X-5 ')' DELIMITED BY SIZE INTO ODL2-V11.   29030005
290400     MOVE  DTG55-BUS-DAYS-DIFFERENCE TO PV-PIC-X-5.               29040005
290500     STRING '(' PV-PIC-X-5 ')' DELIMITED BY SIZE INTO ODL2-V12.   29050005
290600                                                                  29060005
290700     MOVE  PC-RFI-56-F44        TO ODL2-T21.                      29070005
290800     STRING '(' DTG56-LAST-FS-DB2-ISO-FMT ')'                     29080005
290900            DELIMITED BY SIZE  INTO ODL2-V22.                     29090005
291000     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        29100005
291100                                                                  29110005
291200*--> DELTA OUTPARMS, LINE 46.                                     29120005
291300     MOVE  PC-RFI-55-A34       TO ODL2-T11.                       29130005
291400     STRING '(' DTG55-ACTUAL-HOLIDAY-IND  ')'                     29140005
291500            DELIMITED BY SIZE  INTO ODL2-V12.                     29150005
291600                                                                  29160005
291700     MOVE  PC-RFI-56-F45        TO ODL2-T21.                      29170005
291800     MOVE DTG56-WEEKS-DIFFERENCE TO PV-PIC-X-4.                   29180005
291900     STRING '(' PV-PIC-X-4 ')' DELIMITED BY SIZE INTO ODL2-V22.   29190005
292000     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        29200005
292100                                                                  29210005
292200*--> DELTA OUTPARMS, LINE 47.                                     29220005
292300     MOVE  PC-RFI-55-A35       TO ODL2-T11.                       29230005
292400     STRING '(' DTG55-HOLIDAY-NAME ')'                            29240005
292500            DELIMITED BY SIZE  INTO ODL2-V12.                     29250005
292600                                                                  29260005
292700     MOVE DTG56-PERIODS-DIFFERENCE TO PV-PIC-X-4.                 29270005
292800     MOVE  PC-RFI-56-F46        TO ODL2-T21.                      29280005
292900     STRING '(' PV-PIC-X-4 ')' DELIMITED BY SIZE INTO ODL2-V22.   29290005
293000     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        29300005
293100                                                                  29310005
293200*--> DELTA OUTPARMS, LINE 48.                                     29320005
293300     MOVE  PC-RFI-56-F47        TO ODL2-T21.                      29330005
293400     STRING '(' DTG56-FISCAL-PERIOD-NAME ')'                      29340005
293500            DELIMITED BY SIZE  INTO ODL2-V22.                     29350005
293600     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        29360005
293700                                                                  29370005
293800*--> DELTA OUTPARMS, LINE 49.                                     29380005
293900     MOVE  PC-RFI-56-F48        TO ODL2-T21.                      29390005
294000     STRING '(' DTG56-FISCAL-PERIOD-NAME-ABBR3 ')'                29400005
294100            DELIMITED BY SIZE  INTO ODL2-V22.                     29410005
294200     PERFORM 5300-HILITE-DELTAS-AND-PRINT.                        29420005
294300                                                                  29430005
294400                                                                  29440005
294500* ************************************************************** *29450005
294600* *  THIS PARAGRAPH HIGHLIGHTS DIFFERENCES BETWEEN THE PROD    * *29460005
294700* *  AND TEST VERSIONS OF THE DATE ROUTINE, FOR EASY           * *29470005
294800* *  IDENTIFICATION.                                           * *29480005
294900* *  IT IS EXECUTED ONLY FOR THE "DELTA" REPORT.               * *29490005
295000* ************************************************************** *29500005
295100 5300-HILITE-DELTAS-AND-PRINT.                                    29510005
295200                                                                  29520005
295300     PERFORM 5310-HILITE-COL1-DIFF.                               29530005
295400     PERFORM 5320-HILITE-COL2-DIFF.                               29540005
295500                                                                  29550005
295600     PERFORM 6101-WRITE-AFTER-1.                                  29560005
295700                                                                  29570005
295800                                                                  29580005
295900* ************************************************************** *29590005
296000* *  THIS PARAGRAPH HIGHLIGHTS DIFFERENCES IN COLUMN 1         * *29600005
296100* *  ("ACTUAL" DATE RESULTS.)                                  * *29610005
296200* ************************************************************** *29620005
296300 5310-HILITE-COL1-DIFF.                                           29630005
296400                                                                  29640005
296500     IF ODL2-V11 = ODL2-V12                                       29650005
296600        CONTINUE                                                  29660005
296700     ELSE                                                         29670005
296800        MOVE PC-HILITE TO ODL2-ASTER1                             29680005
296900     END-IF.                                                      29690005
297000                                                                  29700005
297100                                                                  29710005
297200* ************************************************************** *29720005
297300* *  THIS PARAGRAPH HIGHLIGHTS DIFFERENCES IN COLUMN 2         * *29730005
297400* *  ("FISCAL" DATE RESULTS.)                                  * *29740005
297500* ************************************************************** *29750005
297600 5320-HILITE-COL2-DIFF.                                           29760005
297700                                                                  29770005
297800     IF ODL2-V21 = ODL2-V22                                       29780005
297900        CONTINUE                                                  29790005
298000     ELSE                                                         29800005
298100        MOVE PC-HILITE TO ODL2-ASTER2                             29810005
298200     END-IF.                                                      29820005
298300                                                                  29830005
298400                                                                  29840005
298500* ************************************************************** *29850005
298600* * THIS PARAGRAPH PRINTS THE REPORT HEADING.                  * *29860005
298700* ************************************************************** *29870005
298800 6100-PRINT-RPT-HEADING.                                          29880005
298900                                                                  29890005
299000     ADD 1                TO PV-PAGE-CNT.                         29900005
299100     MOVE PV-PAGE-CNT     TO DP132O-PAGE-NUMBER.                  29910005
299200                                                                  29920005
299300     IF PV-PAGE-CNT = 1                                           29930005
299400        WRITE PRINT-REC                                           29940005
299500              FROM  DP132O-STANDRD-HEADER-132-COLS                29950005
299600     ELSE                                                         29960005
299700        WRITE PRINT-REC                                           29970005
299800              FROM  DP132O-STANDRD-HEADER-132-COLS                29980005
299900              AFTER ADVANCING PAGE                                29990005
300000     END-IF.                                                      30000005
300100                                                                  30010005
300200     INITIALIZE OUTPUT-PRINT-LINE.                                30020007
300300                                                                  30030007
300400     MOVE PC-ASTERS49               TO PHL-HEADER-LEFT.           30040005
300500     MOVE PC-TESTCASE-ID-FOLLOWS    TO PHL-HEADER-RIGHT-FLD1.     30050005
300600     MOVE CC-TESTCASE-ID            TO PHL-TESTCASE-ID.           30060005
300700     MOVE PC-ASTERS39               TO PHL-HEADER-RIGHT-FLD4.     30070005
300800                                                                  30080005
300900     EVALUATE TRUE                                                30090005
301000         WHEN PV-PARM-PROD-RUN                                    30100005
301100            MOVE PC-PROD-DESC       TO PHL-HEADER-TITLE           30110005
301200         WHEN PV-PARM-TEST-RUN                                    30120005
301300            MOVE PV-TESTMODULE-DESC TO PHL-HEADER-TITLE           30130005
301400         WHEN PV-PARM-DELTA-RUN                                   30140005
301500            MOVE PC-DELTA-DESC      TO PHL-HEADER-TITLE           30150005
301600     END-EVALUATE.                                                30160005
301700                                                                  30170005
301800     PERFORM 6103-WRITE-AFTER-3.                                  30180005
301900                                                                  30190005
302000     MOVE PC-ASTERS17 TO OHL1-LEFT11                              30200005
302100                         OHL1-RIGHT11.                            30210005
302200                                                                  30220005
302300     EVALUATE TRUE                                                30230005
302400         WHEN PV-PARM-PROD-RUN                                    30240005
302500            MOVE PC-TXT-PROD-51 TO OHL1-TITLE11                   30250005
302600            MOVE PC-TXT-PROD-52 TO OHL1-TITLE12                   30260005
302700            MOVE PC-TXT-PROD-53 TO OHL1-TITLE13                   30270005
302800            MOVE PC-ASTERS17    TO OHL1-LEFT12  OHL1-RIGHT12      30280005
302900                                   OHL1-LEFT13  OHL1-RIGHT13      30290005
303000         WHEN PV-PARM-TEST-RUN                                    30300005
303100            MOVE PC-TXT-TEST-51 TO OHL1-TITLE11                   30310005
303200            MOVE PC-TXT-TEST-52 TO OHL1-TITLE12                   30320005
303300            MOVE PC-TXT-TEST-53 TO OHL1-TITLE13                   30330005
303400            MOVE PC-ASTERS17    TO OHL1-LEFT12  OHL1-RIGHT12      30340005
303500                                   OHL1-LEFT13  OHL1-RIGHT13      30350005
303600         WHEN PV-PARM-DELTA-RUN                                   30360005
303700            MOVE PC-TXT-PROD-51 TO OHL1-TITLE11                   30370005
303800            MOVE PC-TXT-PROD-52 TO OHL2-TITLE22                   30380005
303900            MOVE PC-ASTERS28    TO OHL2-LEFT22  OHL2-RIGHT22      30390005
304000                                                                  30400005
304100         WHEN PV-PARM-END-OF-RUN                                  30410005
304200            INITIALIZE OUTPUT-PRINT-LINE                          30420005
304300     END-EVALUATE.                                                30430005
304400                                                                  30440005
304500     PERFORM 6102-WRITE-AFTER-2.                                  30450005
304600                                                                  30460005
304700                                                                  30470005
304800* ************************************************************** *30480005
304900* * THIS PARAGRAPH PRINTS REPORT LINE AFTER ADVANCING 1.       * *30490005
305000* ************************************************************** *30500005
305100 6101-WRITE-AFTER-1.                                              30510005
305200     WRITE PRINT-REC FROM OUTPUT-PRINT-LINE                       30520005
305300           AFTER ADVANCING 1 LINES.                               30530005
305400     INITIALIZE OUTPUT-PRINT-LINE.                                30540007
305500                                                                  30550007
305600                                                                  30560005
305700* ************************************************************** *30570005
305800* * THIS PARAGRAPH PRINTS REPORT LINE AFTER ADVANCING 2.       * *30580005
305900* ************************************************************** *30590005
306000 6102-WRITE-AFTER-2.                                              30600005
306100     WRITE PRINT-REC FROM OUTPUT-PRINT-LINE                       30610005
306200           AFTER ADVANCING 2 LINES.                               30620005
306300     INITIALIZE OUTPUT-PRINT-LINE.                                30630007
306400                                                                  30640007
306500                                                                  30650005
306600* ************************************************************** *30660005
306700* * THIS PARAGRAPH PRINTS REPORT LINE AFTER ADVANCING 3.       * *30670005
306800* ************************************************************** *30680005
306900 6103-WRITE-AFTER-3.                                              30690005
307000     WRITE PRINT-REC FROM OUTPUT-PRINT-LINE                       30700005
307100           AFTER ADVANCING 3 LINES.                               30710005
307200     INITIALIZE OUTPUT-PRINT-LINE.                                30720007
307300                                                                  30730005
307400                                                                  30740007
307500* ************************************************************** *30750005
307600* * THIS PARAGRAPH PRINTS REPORT LINE AFTER ADVANCING 4.       * *30760005
307700* ************************************************************** *30770005
307800 6104-WRITE-AFTER-4.                                              30780005
307900     WRITE PRINT-REC FROM OUTPUT-PRINT-LINE                       30790005
308000           AFTER ADVANCING 4 LINES.                               30800005
308100     INITIALIZE OUTPUT-PRINT-LINE.                                30810007
308200                                                                  30820005
308300                                                                  30830007
308400* ************************************************************** *30840005
308500* * THIS PARAGRAPH READS A RECORD FROM THE CONTROL CARD FILE.  * *30850005
308600* * "PRIME" READ OF CONTROL CARD INPUT.                        * *30860005
308700* ************************************************************** *30870005
308800 7001-READ-CCIN-PRIME.                                            30880005
308900                                                                  30890005
309000     READ CONTROL-CARDS                                           30900005
309100         AT END                                                   30910005
309200             SET PV-CCIN-EOF TO TRUE                              30920005
309300             PERFORM 9997-NO-RECORDS-IN-FILE.                     30930005
309400                                                                  30940005
309500                                                                  30950005
309600* ************************************************************** *30960005
309700* * THIS PARAGRAPH READS A RECORD FROM THE CONTROL CARD FILE.  * *30970005
309800* * "SUBSEQUENT" READ OF CONTROL CARD INPUT.                   * *30980005
309900* ************************************************************** *30990005
310000 7002-READ-CCIN.                                                  31000005
310100                                                                  31010005
310200       READ CONTROL-CARDS                                         31020005
310300           AT END                                                 31030005
310400               SET PV-CCIN-EOF TO TRUE.                           31040005
310500                                                                  31050005
310600                                                                  31060005
310700* ************************************************************** *31070005
310800* * THE EXEC PARM DOES NOT INDICATE A VALID RUN OPTION         * *31080005
310900* ************************************************************** *31090005
311000 9996-EXEC-PARM-ERROR.                                            31100005
311100                                                                  31110005
311200     DISPLAY PC-CURRENT-PROGRAM-NAME                              31120005
311300             PC-ABEND-EYE-CATCHER.                                31130005
311400     DISPLAY PC-CURRENT-PROGRAM-NAME                              31140005
311500             ' +4003 INVALID CONTROL CARD PARAMETER(S). DETAILS:'.31150005
311600     DISPLAY PC-CURRENT-PROGRAM-NAME                              31160005
311700             ' EXEC PARM IN JCL DOES NOT INDICATE A VALID OPTION.'31170005
311800     DISPLAY PC-CURRENT-PROGRAM-NAME                              31180005
311900             ' SEE PGMDOC, CORRECT JCL, AND RUN AGAIN.'.          31190005
312000     MOVE +4003                TO PV-ABEND-CODE.                  31200005
312100     PERFORM 9999-ABNORMAL-END-OF-RUN.                            31210005
312200                                                                  31220005
312300                                                                  31230005
312400* ************************************************************** *31240005
312500* * NO INPUT RECORDS - JOB ENDING                              * *31250005
312600* ************************************************************** *31260005
312700 9997-NO-RECORDS-IN-FILE.                                         31270005
312800                                                                  31280005
312900     DISPLAY PC-CURRENT-PROGRAM-NAME                              31290005
313000             PC-ABEND-EYE-CATCHER.                                31300005
313100     DISPLAY PC-CURRENT-PROGRAM-NAME                              31310005
313200             ' +4095 EMPTY FILE.  DETAILS FOLLOW.'                31320005
313300     DISPLAY PC-CURRENT-PROGRAM-NAME                              31330005
313400             ' NO RECORDS IN CONTROL CARD FILE.'.                 31340005
313500     DISPLAY PC-CURRENT-PROGRAM-NAME                              31350005
313600             ' CARDS 51, 52, 53 REQUIRED FOR EACH CALL.'.         31360005
313700     DISPLAY PC-CURRENT-PROGRAM-NAME                              31370005
313800             ' MULTIPLE SETS OF CARDS MAY BE PROCESSED IN A RUN.'.31380005
313900     DISPLAY PC-CURRENT-PROGRAM-NAME                              31390005
314000             ' PLEASE PROVIDE DATA AND RUN AGAIN.'.               31400005
314100     MOVE +4095                TO PV-ABEND-CODE.                  31410005
314200     PERFORM 9999-ABNORMAL-END-OF-RUN.                            31420005
314300                                                                  31430005
314400                                                                  31440005
314500* ************************************************************** *31450005
314600* * CONTROL CARD ERROR - JOB ENDING                            * *31460005
314700* ************************************************************** *31470005
314800 9998-CONTROL-CARD-ERROR.                                         31480005
314900                                                                  31490005
315000     DISPLAY PC-CURRENT-PROGRAM-NAME                              31500005
315100             PC-ABEND-EYE-CATCHER.                                31510005
315200     DISPLAY PC-CURRENT-PROGRAM-NAME                              31520005
315300             ' +4008 INVALID DATA ON DATASET.  DETAILS FOLLOW.'   31530005
315400     DISPLAY PC-CURRENT-PROGRAM-NAME                              31540005
315500             ' INCOMPLETE CONTROL CARD TESTSET FOR TESTCASE ID: *'31550005
315600             CC-TESTCASE-ID '*.'.                                 31560005
315700     DISPLAY PC-CURRENT-PROGRAM-NAME                              31570005
315800             ' CARDS 51, 52, 53 REQUIRED IN ORDER FOR EACH CALL.'.31580005
315900     DISPLAY PC-CURRENT-PROGRAM-NAME                              31590005
316000             ' NUMBER OF TEST CASES PROCESSED. . . . . . . . :  *'31600005
316100             PV-TEST-CASES-PROCESSED '*'.                         31610005
316200     DISPLAY PC-CURRENT-PROGRAM-NAME                              31620005
316300             ' PLEASE CORRECT DATA AND RUN AGAIN.'.               31630005
316400     MOVE +4008                TO PV-ABEND-CODE.                  31640005
316500     PERFORM 9999-ABNORMAL-END-OF-RUN.                            31650005
316600                                                                  31660005
316700                                                                  31670005
316800* ************************************************************** *31680005
316900* * ABNORMAL END OF RUN.                                       * *31690005
317000* ************************************************************** *31700005
317100 9999-ABNORMAL-END-OF-RUN.                                        31710005
317200     DISPLAY PC-CURRENT-PROGRAM-NAME                              31720005
317300             PC-ABEND-EYE-CATCHER.                                31730005
317400     MOVE PC-PARM-END-OF-RUN   TO PV-LS-PARM-VERSION.             31740005
317500     PERFORM 6100-PRINT-RPT-HEADING.                              31750005
317600     MOVE PC-ABEND-EOJ         TO OHL1-LEFT11.                    31760005
317700     WRITE PRINT-REC FROM OUTPUT-PRINT-LINE                       31770005
317800           AFTER ADVANCING 4 LINES.                               31780005
317900     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         31790005
