000100******************************************************************00010000
000200 IDENTIFICATION DIVISION.                                         00020000
000300******************************************************************00030000
000400                                                                  00040000
000500 PROGRAM-ID.             DPKUT501.                                00050000
000600 AUTHOR.                 RICK TULLOCH.                            00060000
000700 INSTALLATION.           KOHLS DEPARTMENT STORES.                 00070000
000800 DATE-WRITTEN.           12/05/97.                                00080000
000900 DATE-COMPILED.                                                   00090000
001000                                                                  00100000
001100******************************************************************00110000
001200*  THIS PROGRAM WILL CREATE HOLIDAY TABLE DEFINITIONS FOR THE    *00120000
001210*  KOHL'S CALENDAR ROUTINE, DPKUT500.  THIS WILL ENABLE THE      *00121000
001220*  ROUTINE TO REMAIN MATHEMATICALLY BASED, WITHOUT HAVING TO     *00122000
001230*  INCUR THE OVERHEAD OF REPEATING THESE CALCULATIONS WITH EACH  *00123000
001300*  CALENDAR ROUTINE CALL.  THE OUTPUT FILE WILL CONTAIN A        *00130000
001310*  COBOL WORKING-STORAGE DEFINITION OF THE HOLIDAY DESIGNATIONS  *00131000
001320*  THAT WILL BE TAKEN AND EMBEDDED IN THE CALENDAR ROUTINE.      *00132000
001400******************************************************************00140000
001500                                                                  00150000
001600******************************************************************00160000
001700 ENVIRONMENT DIVISION.                                            00170000
001800******************************************************************00180000
001900                                                                  00190000
002000 CONFIGURATION SECTION.                                           00200000
002100                                                                  00210000
002200 SOURCE-COMPUTER. IBM-3090.                                       00220000
002300 OBJECT-COMPUTER. IBM-3090.                                       00230000
002400                                                                  00240000
002500 INPUT-OUTPUT SECTION.                                            00250000
002600                                                                  00260000
002700 FILE-CONTROL.                                                    00270000
002800      SELECT HOLIDAY-TABLE-FILE                                   00280000
002900            ASSIGN TO OUT01.                                      00290000
003000                                                                  00300000
003100******************************************************************00310000
003200 DATA DIVISION.                                                   00320000
003300******************************************************************00330000
003400                                                                  00340000
003500 FILE SECTION.                                                    00350000
003600                                                                  00360000
003700 FD  HOLIDAY-TABLE-FILE                                           00370000
003800     RECORDING MODE IS F                                          00380000
003900     LABEL RECORDS ARE STANDARD                                   00390000
004000     BLOCK CONTAINS 0 RECORDS                                     00400000
004100     RECORD CONTAINS 80 CHARACTERS                                00410000
004200     DATA RECORD IS HT-HOLIDAY-TABLE-RECORD.                      00420000
004300                                                                  00430000
004400 01  HT-HOLIDAY-TABLE-RECORD     PIC X(80).                       00440000
004500                                                                  00450000
004600 WORKING-STORAGE SECTION.                                         00460000
004601                                                                  00460101
004610 01  ABEND-CODE                  PIC S9(4)    VALUE ZEROS         00461001
004700                                              COMP SYNC.          00470001
004800     88  AC-INVLD-DATA-ON-DATASET-ERROR       VALUE +4008.        00480001
004900                                                                  00490002
004910 01  PS-PROGRAM-SWITCHES.                                         00491002
005212     05  PS-LEAP-YEAR-IND        PIC X(1)     VALUE SPACE.        00521202
005213         88  PS-LY-LEAP-YEAR                  VALUE 'Y'.          00521302
005214         88  PS-LY-NOT-LEAP-YEAR              VALUE 'N'.          00521402
005300                                                                  00530000
005400 01  PC-PROGRAM-CONSTANTS.                                        00540000
005600     05  PC-CURRENT-PROGRAM-NAME PIC X(8)     VALUE 'DPKUT501'.   00560001
005610     05  PC-STARTING-YEAR        PIC 9(4)     VALUE 1901.         00561001
005700     05  PC-ENDING-YEAR          PIC 9(4)     VALUE 2100.         00570000
005701     05  PC-CENTURY-LEAP-YEAR-CHECK                               00570100
005702                                 PIC S9(4)    VALUE +400          00570200
005703                                              COMP SYNC.          00570300
005704     05  PC-LEAP-YEAR-CHECK      PIC S9(4)    VALUE +4            00570400
005705                                              COMP SYNC.          00570500
005706     05  PC-DAYS-PER-WEEK        PIC S9(4)    VALUE +7            00570600
005707                                              COMP SYNC.          00570700
005708     05  PC-MONTHS-PER-YEAR      PIC S9(4)    VALUE +12           00570802
005709                                              COMP SYNC.          00570902
005710     05  PC-DAYS-PER-YEAR        PIC S9(3)V99 VALUE +365.25       00571002
005711                                              COMP-3.             00571102
005712     05  PC-MONDAY               PIC S9(4)    VALUE +2            00571202
005713                                              COMP SYNC.          00571302
005714     05  PC-THURSDAY             PIC S9(4)    VALUE +5            00571402
005720                                              COMP SYNC.          00572000
005730     05  PC-FEBRUARY             PIC S9(4)    VALUE +2            00573001
005740                                              COMP SYNC.          00574000
005800                                                                  00580000
005900 01  PV-PROGRAM-VARIABLES.                                        00590000
006000     05  PV-CURRENT-YEAR         PIC 9(4)     VALUE ZEROS.        00600000
006010     05  PV-DAYS-SINCE-EASTER    PIC 9(3)     VALUE ZEROS.        00601000
006020     05  PV-NUMBER-OF-WEEKS      PIC 9(3)     VALUE ZEROS.        00602000
006030     05  PV-DAY-OF-WEEK          PIC 9(1)     VALUE ZEROS.        00603000
006040     05  PV-DAY-ADJUSTMENT       PIC 9(2)     VALUE ZEROS.        00604000
006050     05  PV-LEAP-YEAR-WORK-CCYY  PIC 9(4)     VALUE ZEROS.        00605002
006051     05  FILLER                  REDEFINES                        00605102
006052                                   PV-LEAP-YEAR-WORK-CCYY.        00605202
006300         10  PV-LEAP-YEAR-WORK-CC                                 00630002
006310                                 PIC 9(2).                        00631002
006320         10  PV-LEAP-YEAR-WORK-YY                                 00632002
006330                                 PIC 9(2).                        00633002
006500     05  PV-REQUESTED-DATE-CCYYMMDD.                              00650003
006600         10  PV-RD-CCYYMMDD-CCYY PIC 9(4)     VALUE ZERO.         00660003
006700         10  PV-RD-CCYYMMDD-MM   PIC 9(2)     VALUE ZERO.         00670003
006800         10  PV-RD-CCYYMMDD-DD   PIC 9(2)     VALUE ZERO.         00680003
007200     05  PV-DAYS-SINCE-BASELINE  PIC S9(7)    VALUE ZERO          00720002
007300                                              COMP-3.             00730000
007400                                                                  00740000
007500     05  PV-LEAP-YEAR-REMAINDER  PIC S9(6)V9(3)                   00750002
007600                                              VALUE ZERO          00760000
007700                                              COMP-3.             00770000
007800                                                                  00780000
007900     05  PV-MONTH-SUBSCRIPT      PIC S9(4)    VALUE ZERO          00790002
008000                                              COMP SYNC.          00800000
008800                                                                  00880000
008900     05  MD-MONTH-DATA.                                           00890003
009200         10  FILLER              PIC X(17)    VALUE               00920000
009210             '01 JANUARY  31000'.                                 00921000
009300         10  FILLER              PIC X(17)    VALUE               00930000
009310             '02 FEBRUARY 28031'.                                 00931000
009400         10  FILLER              PIC X(17)    VALUE               00940000
009410             '03 MARCH    31059'.                                 00941000
009500         10  FILLER              PIC X(17)    VALUE               00950000
009510             '04 APRIL    30090'.                                 00951000
009600         10  FILLER              PIC X(17)    VALUE               00960000
009610             '05 MAY      31120'.                                 00961000
009700         10  FILLER              PIC X(17)    VALUE               00970000
009710             '06 JUNE     30151'.                                 00971000
009800         10  FILLER              PIC X(17)    VALUE               00980000
009810             '07 JULY     31181'.                                 00981000
009900         10  FILLER              PIC X(17)    VALUE               00990000
009910             '08 AUGUST   31212'.                                 00991000
010000         10  FILLER              PIC X(17)    VALUE               01000000
010010             '09 SEPTEMBER30243'.                                 01001000
010100         10  FILLER              PIC X(17)    VALUE               01010000
010110             '10 OCTOBER  31273'.                                 01011000
010200         10  FILLER              PIC X(17)    VALUE               01020000
010210             '11 NOVEMBER 30304'.                                 01021000
010300         10  FILLER              PIC X(17)    VALUE               01030000
010310             '12 DECEMBER 31334'.                                 01031000
010500     05  MT-MONTH-TABLE          REDEFINES MD-MONTH-DATA.         01050003
010800         10  MT-MONTH-ENTRY      OCCURS 12 TIMES.                 01080003
011000             15  MT-ME-MONTH-NUMBER                               01100003
011010                                 PIC 9(2).                        01101000
011100             15  FILLER          PIC X(1).                        01110000
011200             15  MT-ME-MONTH-NAME.                                01120003
011300                 20  MT-ME-MONTH-ABBREV                           01130003
011310                                 PIC X(3).                        01131000
011400                 20  FILLER      PIC X(6).                        01140000
011500             15  MT-ME-DAYS-IN-MONTH                              01150003
011510                                 PIC 9(2).                        01151000
011600             15  MT-ME-ACCUM-DAYS-PRIOR-MONTHS                    01160003
011700                                 PIC 9(3).                        01170000
012300                                                                  01230000
012400 01  CD-CURRENT-DATE.                                             01240000
012500     05  CD-CURRENT-YEAR         PIC 9(2)     VALUE ZERO.         01250000
012600     05  CD-CURRENT-MONTH        PIC 9(2)     VALUE ZERO.         01260000
012700     05  CD-CURRENT-DAY          PIC 9(2)     VALUE ZERO.         01270000
012800                                                                  01280000
012900 01  ED-EASTER-DATA.                                              01290000
013000     05  FILLER                  PIC 9(4)     VALUE 0407.         01300000
013100     05  FILLER                  PIC 9(4)     VALUE 0330.         01310000
013200     05  FILLER                  PIC 9(4)     VALUE 0412.         01320000
013300     05  FILLER                  PIC 9(4)     VALUE 0403.         01330000
013400     05  FILLER                  PIC 9(4)     VALUE 0423.         01340000
013500     05  FILLER                  PIC 9(4)     VALUE 0415.         01350000
013600     05  FILLER                  PIC 9(4)     VALUE 0331.         01360000
013700     05  FILLER                  PIC 9(4)     VALUE 0419.         01370000
013800     05  FILLER                  PIC 9(4)     VALUE 0411.         01380000
013900     05  FILLER                  PIC 9(4)     VALUE 0327.         01390000
014000     05  FILLER                  PIC 9(4)     VALUE 0416.         01400000
014100     05  FILLER                  PIC 9(4)     VALUE 0407.         01410000
014200     05  FILLER                  PIC 9(4)     VALUE 0323.         01420000
014300     05  FILLER                  PIC 9(4)     VALUE 0412.         01430000
014400     05  FILLER                  PIC 9(4)     VALUE 0404.         01440000
014500     05  FILLER                  PIC 9(4)     VALUE 0423.         01450000
014600     05  FILLER                  PIC 9(4)     VALUE 0408.         01460000
014700     05  FILLER                  PIC 9(4)     VALUE 0331.         01470000
014800     05  FILLER                  PIC 9(4)     VALUE 0420.         01480000
014900     05  FILLER                  PIC 9(4)     VALUE 0404.         01490000
015000     05  FILLER                  PIC 9(4)     VALUE 0327.         01500000
015100     05  FILLER                  PIC 9(4)     VALUE 0416.         01510000
015200     05  FILLER                  PIC 9(4)     VALUE 0401.         01520000
015300     05  FILLER                  PIC 9(4)     VALUE 0420.         01530000
015400     05  FILLER                  PIC 9(4)     VALUE 0412.         01540000
015500     05  FILLER                  PIC 9(4)     VALUE 0404.         01550000
015600     05  FILLER                  PIC 9(4)     VALUE 0417.         01560000
015700     05  FILLER                  PIC 9(4)     VALUE 0408.         01570000
015800     05  FILLER                  PIC 9(4)     VALUE 0331.         01580000
015900     05  FILLER                  PIC 9(4)     VALUE 0420.         01590000
016000     05  FILLER                  PIC 9(4)     VALUE 0405.         01600000
016100     05  FILLER                  PIC 9(4)     VALUE 0327.         01610000
016200     05  FILLER                  PIC 9(4)     VALUE 0416.         01620000
016300     05  FILLER                  PIC 9(4)     VALUE 0401.         01630000
016400     05  FILLER                  PIC 9(4)     VALUE 0421.         01640000
016500     05  FILLER                  PIC 9(4)     VALUE 0412.         01650000
016600     05  FILLER                  PIC 9(4)     VALUE 0328.         01660000
016700     05  FILLER                  PIC 9(4)     VALUE 0417.         01670000
016800     05  FILLER                  PIC 9(4)     VALUE 0409.         01680000
016900     05  FILLER                  PIC 9(4)     VALUE 0324.         01690000
017000     05  FILLER                  PIC 9(4)     VALUE 0413.         01700000
017100     05  FILLER                  PIC 9(4)     VALUE 0405.         01710000
017200     05  FILLER                  PIC 9(4)     VALUE 0425.         01720000
017300     05  FILLER                  PIC 9(4)     VALUE 0409.         01730000
017400     05  FILLER                  PIC 9(4)     VALUE 0401.         01740000
017500     05  FILLER                  PIC 9(4)     VALUE 0421.         01750000
017600     05  FILLER                  PIC 9(4)     VALUE 0406.         01760000
017700     05  FILLER                  PIC 9(4)     VALUE 0328.         01770000
017800     05  FILLER                  PIC 9(4)     VALUE 0417.         01780000
017900     05  FILLER                  PIC 9(4)     VALUE 0409.         01790000
018000     05  FILLER                  PIC 9(4)     VALUE 0325.         01800000
018100     05  FILLER                  PIC 9(4)     VALUE 0413.         01810000
018200     05  FILLER                  PIC 9(4)     VALUE 0405.         01820000
018300     05  FILLER                  PIC 9(4)     VALUE 0418.         01830000
018400     05  FILLER                  PIC 9(4)     VALUE 0410.         01840000
018500     05  FILLER                  PIC 9(4)     VALUE 0401.         01850000
018600     05  FILLER                  PIC 9(4)     VALUE 0421.         01860000
018700     05  FILLER                  PIC 9(4)     VALUE 0406.         01870000
018800     05  FILLER                  PIC 9(4)     VALUE 0329.         01880000
018900     05  FILLER                  PIC 9(4)     VALUE 0417.         01890000
019000     05  FILLER                  PIC 9(4)     VALUE 0402.         01900000
019100     05  FILLER                  PIC 9(4)     VALUE 0422.         01910000
019200     05  FILLER                  PIC 9(4)     VALUE 0414.         01920000
019300     05  FILLER                  PIC 9(4)     VALUE 0329.         01930000
019400     05  FILLER                  PIC 9(4)     VALUE 0418.         01940000
019500     05  FILLER                  PIC 9(4)     VALUE 0410.         01950000
019600     05  FILLER                  PIC 9(4)     VALUE 0326.         01960000
019700     05  FILLER                  PIC 9(4)     VALUE 0414.         01970000
019800     05  FILLER                  PIC 9(4)     VALUE 0406.         01980000
019900     05  FILLER                  PIC 9(4)     VALUE 0329.         01990000
020000     05  FILLER                  PIC 9(4)     VALUE 0411.         02000000
020100     05  FILLER                  PIC 9(4)     VALUE 0402.         02010000
020200     05  FILLER                  PIC 9(4)     VALUE 0422.         02020000
020300     05  FILLER                  PIC 9(4)     VALUE 0414.         02030000
020400     05  FILLER                  PIC 9(4)     VALUE 0330.         02040000
020500     05  FILLER                  PIC 9(4)     VALUE 0418.         02050000
020600     05  FILLER                  PIC 9(4)     VALUE 0410.         02060000
020700     05  FILLER                  PIC 9(4)     VALUE 0326.         02070000
020800     05  FILLER                  PIC 9(4)     VALUE 0415.         02080000
020900     05  FILLER                  PIC 9(4)     VALUE 0406.         02090000
021000     05  FILLER                  PIC 9(4)     VALUE 0419.         02100000
021100     05  FILLER                  PIC 9(4)     VALUE 0411.         02110000
021200     05  FILLER                  PIC 9(4)     VALUE 0403.         02120000
021300     05  FILLER                  PIC 9(4)     VALUE 0422.         02130000
021400     05  FILLER                  PIC 9(4)     VALUE 0407.         02140000
021500     05  FILLER                  PIC 9(4)     VALUE 0330.         02150000
021600     05  FILLER                  PIC 9(4)     VALUE 0419.         02160000
021700     05  FILLER                  PIC 9(4)     VALUE 0403.         02170000
021800     05  FILLER                  PIC 9(4)     VALUE 0326.         02180000
021900     05  FILLER                  PIC 9(4)     VALUE 0415.         02190000
022000     05  FILLER                  PIC 9(4)     VALUE 0331.         02200000
022100     05  FILLER                  PIC 9(4)     VALUE 0419.         02210000
022200     05  FILLER                  PIC 9(4)     VALUE 0411.         02220000
022300     05  FILLER                  PIC 9(4)     VALUE 0403.         02230000
022400     05  FILLER                  PIC 9(4)     VALUE 0416.         02240000
022500     05  FILLER                  PIC 9(4)     VALUE 0407.         02250000
022600     05  FILLER                  PIC 9(4)     VALUE 0330.         02260000
022700     05  FILLER                  PIC 9(4)     VALUE 0412.         02270000
022800     05  FILLER                  PIC 9(4)     VALUE 0404.         02280000
022900     05  FILLER                  PIC 9(4)     VALUE 0423.         02290000
023000     05  FILLER                  PIC 9(4)     VALUE 0415.         02300000
023100     05  FILLER                  PIC 9(4)     VALUE 0331.         02310000
023200     05  FILLER                  PIC 9(4)     VALUE 0420.         02320000
023300     05  FILLER                  PIC 9(4)     VALUE 0411.         02330000
023400     05  FILLER                  PIC 9(4)     VALUE 0327.         02340000
023500     05  FILLER                  PIC 9(4)     VALUE 0416.         02350000
023600     05  FILLER                  PIC 9(4)     VALUE 0408.         02360000
023700     05  FILLER                  PIC 9(4)     VALUE 0323.         02370000
023800     05  FILLER                  PIC 9(4)     VALUE 0412.         02380000
023900     05  FILLER                  PIC 9(4)     VALUE 0404.         02390000
024000     05  FILLER                  PIC 9(4)     VALUE 0424.         02400000
024100     05  FILLER                  PIC 9(4)     VALUE 0408.         02410000
024200     05  FILLER                  PIC 9(4)     VALUE 0331.         02420000
024300     05  FILLER                  PIC 9(4)     VALUE 0420.         02430000
024400     05  FILLER                  PIC 9(4)     VALUE 0405.         02440000
024500     05  FILLER                  PIC 9(4)     VALUE 0327.         02450000
024600     05  FILLER                  PIC 9(4)     VALUE 0416.         02460000
024700     05  FILLER                  PIC 9(4)     VALUE 0401.         02470000
024800     05  FILLER                  PIC 9(4)     VALUE 0421.         02480000
024900     05  FILLER                  PIC 9(4)     VALUE 0412.         02490000
025000     05  FILLER                  PIC 9(4)     VALUE 0404.         02500000
025100     05  FILLER                  PIC 9(4)     VALUE 0417.         02510000
025200     05  FILLER                  PIC 9(4)     VALUE 0409.         02520000
025300     05  FILLER                  PIC 9(4)     VALUE 0331.         02530000
025400     05  FILLER                  PIC 9(4)     VALUE 0420.         02540000
025500     05  FILLER                  PIC 9(4)     VALUE 0405.         02550000
025600     05  FILLER                  PIC 9(4)     VALUE 0328.         02560000
025700     05  FILLER                  PIC 9(4)     VALUE 0416.         02570000
025800     05  FILLER                  PIC 9(4)     VALUE 0401.         02580000
025900     05  FILLER                  PIC 9(4)     VALUE 0421.         02590000
026000     05  FILLER                  PIC 9(4)     VALUE 0413.         02600000
026100     05  FILLER                  PIC 9(4)     VALUE 0328.         02610000
026200     05  FILLER                  PIC 9(4)     VALUE 0417.         02620000
026300     05  FILLER                  PIC 9(4)     VALUE 0409.         02630000
026400     05  FILLER                  PIC 9(4)     VALUE 0325.         02640000
026500     05  FILLER                  PIC 9(4)     VALUE 0413.         02650000
026600     05  FILLER                  PIC 9(4)     VALUE 0405.         02660000
026700     05  FILLER                  PIC 9(4)     VALUE 0425.         02670000
026800     05  FILLER                  PIC 9(4)     VALUE 0410.         02680000
026900     05  FILLER                  PIC 9(4)     VALUE 0401.         02690000
027000     05  FILLER                  PIC 9(4)     VALUE 0421.         02700000
027100     05  FILLER                  PIC 9(4)     VALUE 0406.         02710000
027200     05  FILLER                  PIC 9(4)     VALUE 0329.         02720000
027300     05  FILLER                  PIC 9(4)     VALUE 0417.         02730000
027400     05  FILLER                  PIC 9(4)     VALUE 0409.         02740000
027500     05  FILLER                  PIC 9(4)     VALUE 0325.         02750000
027600     05  FILLER                  PIC 9(4)     VALUE 0414.         02760000
027700     05  FILLER                  PIC 9(4)     VALUE 0405.         02770000
027800     05  FILLER                  PIC 9(4)     VALUE 0418.         02780000
027900     05  FILLER                  PIC 9(4)     VALUE 0410.         02790000
028000     05  FILLER                  PIC 9(4)     VALUE 0402.         02800000
028100     05  FILLER                  PIC 9(4)     VALUE 0421.         02810000
028200     05  FILLER                  PIC 9(4)     VALUE 0406.         02820000
028300     05  FILLER                  PIC 9(4)     VALUE 0329.         02830000
028400     05  FILLER                  PIC 9(4)     VALUE 0418.         02840000
028500     05  FILLER                  PIC 9(4)     VALUE 0402.         02850000
028600     05  FILLER                  PIC 9(4)     VALUE 0422.         02860000
028700     05  FILLER                  PIC 9(4)     VALUE 0414.         02870000
028800     05  FILLER                  PIC 9(4)     VALUE 0330.         02880000
028900     05  FILLER                  PIC 9(4)     VALUE 0418.         02890000
029000     05  FILLER                  PIC 9(4)     VALUE 0410.         02900000
029100     05  FILLER                  PIC 9(4)     VALUE 0326.         02910000
029200     05  FILLER                  PIC 9(4)     VALUE 0415.         02920000
029300     05  FILLER                  PIC 9(4)     VALUE 0406.         02930000
029400     05  FILLER                  PIC 9(4)     VALUE 0329.         02940000
029500     05  FILLER                  PIC 9(4)     VALUE 0411.         02950000
029600     05  FILLER                  PIC 9(4)     VALUE 0403.         02960000
029700     05  FILLER                  PIC 9(4)     VALUE 0422.         02970000
029800     05  FILLER                  PIC 9(4)     VALUE 0414.         02980000
029900     05  FILLER                  PIC 9(4)     VALUE 0330.         02990000
030000     05  FILLER                  PIC 9(4)     VALUE 0419.         03000000
030100     05  FILLER                  PIC 9(4)     VALUE 0410.         03010000
030200     05  FILLER                  PIC 9(4)     VALUE 0326.         03020000
030300     05  FILLER                  PIC 9(4)     VALUE 0415.         03030000
030400     05  FILLER                  PIC 9(4)     VALUE 0407.         03040000
030500     05  FILLER                  PIC 9(4)     VALUE 0419.         03050000
030600     05  FILLER                  PIC 9(4)     VALUE 0411.         03060000
030700     05  FILLER                  PIC 9(4)     VALUE 0403.         03070000
030800     05  FILLER                  PIC 9(4)     VALUE 0423.         03080000
030900     05  FILLER                  PIC 9(4)     VALUE 0407.         03090000
031000     05  FILLER                  PIC 9(4)     VALUE 0330.         03100000
031100     05  FILLER                  PIC 9(4)     VALUE 0419.         03110000
031200     05  FILLER                  PIC 9(4)     VALUE 0404.         03120000
031300     05  FILLER                  PIC 9(4)     VALUE 0326.         03130000
031400     05  FILLER                  PIC 9(4)     VALUE 0415.         03140000
031500     05  FILLER                  PIC 9(4)     VALUE 0331.         03150000
031600     05  FILLER                  PIC 9(4)     VALUE 0420.         03160000
031700     05  FILLER                  PIC 9(4)     VALUE 0411.         03170000
031800     05  FILLER                  PIC 9(4)     VALUE 0403.         03180000
031900     05  FILLER                  PIC 9(4)     VALUE 0416.         03190000
032000     05  FILLER                  PIC 9(4)     VALUE 0408.         03200000
032100     05  FILLER                  PIC 9(4)     VALUE 0330.         03210000
032200     05  FILLER                  PIC 9(4)     VALUE 0412.         03220000
032300     05  FILLER                  PIC 9(4)     VALUE 0404.         03230000
032400     05  FILLER                  PIC 9(4)     VALUE 0424.         03240000
032500     05  FILLER                  PIC 9(4)     VALUE 0415.         03250000
032600     05  FILLER                  PIC 9(4)     VALUE 0331.         03260000
032700     05  FILLER                  PIC 9(4)     VALUE 0420.         03270000
032800     05  FILLER                  PIC 9(4)     VALUE 0412.         03280000
032900     05  FILLER                  PIC 9(4)     VALUE 0328.         03290000
033000 01  ET-EASTER-TABLE             REDEFINES ED-EASTER-DATA.        03300000
033100     05  ET-EASTER-TABLE-ENTRY   OCCURS 200 TIMES                 03310000
033200                                 INDEXED BY ET-INDEX.             03320000
033300         10  ET-EASTER-MONTH     PIC 9(2).                        03330000
033400         10  ET-EASTER-DAY       PIC 9(2).                        03340000
033500                                                                  03350000
033600 01  HD1-HOLIDAY-DATA-1.                                          03360000
033700     05  FILLER                  PIC X(39)    VALUE               03370000
033800         '           05  FILLER'.                                 03380000
033900     05  FILLER                  PIC X(41)    VALUE               03390000
034000         'PIC X(30)    VALUE'.                                    03400000
034100                                                                  03410000
034200 01  HD2-HOLIDAY-DATA-2.                                          03420000
034300     05  FILLER                  PIC X(15)    VALUE SPACES.       03430000
034400     05  FILLER                  PIC X(1)     VALUE QUOTE.        03440000
034500     05  HD2-HOLIDAY-DATE        PIC 9(8)     VALUE ZEROS.        03450000
034510     05  FILLER                  REDEFINES HD2-HOLIDAY-DATE.      03451000
034520         10  HD2-HOLIDAY-YEAR    PIC 9(4).                        03452000
034530         10  HD2-HOLIDAY-MONTH   PIC 9(2).                        03453000
034531             88  HD2-HM-NEW-YEARS-DAY         VALUE 01.           03453100
034533             88  HD2-HM-MEMORIAL-DAY-START    VALUE 05.           03453300
034534             88  HD2-HM-FOURTH-OF-JULY        VALUE 07.           03453400
034535             88  HD2-HM-LABOR-DAY-START       VALUE 09.           03453500
034536             88  HD2-HM-THANKSGIVING-START    VALUE 11.           03453600
034537             88  HD2-HM-CHRISTMAS-DAY         VALUE 12.           03453700
034540         10  HD2-HOLIDAY-DAY     PIC 9(2).                        03454000
034550             88  HD2-HD-NEW-YEARS-DAY         VALUE 01.           03455000
034570             88  HD2-HD-MEMORIAL-DAY-START    VALUE 31.           03457000
034580             88  HD2-HD-FOURTH-OF-JULY        VALUE 04.           03458000
034590             88  HD2-HD-LABOR-DAY-START       VALUE 01.           03459000
034591             88  HD2-HD-THANKSGIVING-START    VALUE 30.           03459100
034592             88  HD2-HD-CHRISTMAS-DAY         VALUE 25.           03459200
034600     05  HD2-HOLIDAY-NAME        PIC X(15)    VALUE SPACES.       03460000
034601         88  HD2-HN-NEW-YEARS-DAY             VALUE               03460100
034602             'NEW YEARS DAY  '.                                   03460200
034603         88  HD2-HN-EASTER-SUNDAY             VALUE               03460300
034604             'EASTER         '.                                   03460400
034605         88  HD2-HN-MEMORIAL-DAY              VALUE               03460500
034606             'MEMORIAL DAY   '.                                   03460600
034607         88  HD2-HN-FOURTH-OF-JULY            VALUE               03460700
034608             'FOURTH OF JULY '.                                   03460800
034609         88  HD2-HN-LABOR-DAY                 VALUE               03460900
034610             'LABOR DAY      '.                                   03461000
034611         88  HD2-HN-THANKSGIVING              VALUE               03461100
034612             'THANKSGIVING   '.                                   03461200
034613         88  HD2-HN-CHRISTMAS-DAY             VALUE               03461300
034620             'CHRISTMAS DAY  '.                                   03462000
034700     05  HD2-DAYS-SINCE-BASELINE PIC 9(7)     VALUE ZEROS.        03470000
034900     05  FILLER                  PIC X(1)     VALUE QUOTE.        03490000
035000     05  FILLER                  PIC X(1)     VALUE '.'.          03500000
035100     05  FILLER                  PIC X(32)    VALUE SPACES.       03510000
035200                                                                  03520000
035300******************************************************************03530000
035400 PROCEDURE DIVISION.                                              03540000
035500******************************************************************03550000
035600                                                                  03560000
035700 0000-MAINLINE.                                                   03570000
035800                                                                  03580000
035801     PERFORM 1000-INITIALIZE.                                     03580100
035810                                                                  03581000
036000     PERFORM 2000-COMPUTE-HOLIDAYS                                03600000
036100         UNTIL PV-CURRENT-YEAR > PC-ENDING-YEAR.                  03610000
036200                                                                  03620000
036300     PERFORM 9000-EOJ-ROUTINE.                                    03630000
044000                                                                  04400000
044100     GOBACK.                                                      04410000
044110                                                                  04411000
044200******************************************************************04420000
044201*  INITIALIZE FOR PROGRAM PROCESSING.  OPEN ALL FILES.  SET THE  *04420103
044210*  CURRENT PROCESSING YEAR TO THE BASELINE DATE YEAR, AND SET    *04421003
044300*  THE EASTER TABLE INDEX TO THE BASELINE YEAR'S ENTRY.          *04430003
044400******************************************************************04440000
044410                                                                  04441000
044500 1000-INITIALIZE.                                                 04450000
044510     OPEN OUTPUT HOLIDAY-TABLE-FILE.                              04451000
044520                                                                  04452000
044521     MOVE PC-STARTING-YEAR TO PV-CURRENT-YEAR.                    04452100
044530     SET ET-INDEX TO 1.                                           04453000
044600*1000-EXIT.                                                       04460000
044700                                                                  04470000
044800******************************************************************04480000
044900*  COMPUTE THE DATES AND CHARACTERISTICS OF THE DATES FOR EACH   *04490003
044901*  HOLIDAY THAT AFFECTS KOHL'S PROCESSING FOR A GIVEN YEAR.      *04490103
044902*  HOLIDAYS THAT FALL ON THE SAME DATE EACH YEAR WILL BE SET UP  *04490203
044903*  DIRECTLY.  EASTER WILL BE DETERMINED VIA A TABLE LOOKUP, DUE  *04490303
044904*  TO THE LUNAR BASIS IN THAT CALCULATION.  OTHER HOLIDAYS WILL  *04490403
044905*  BE DERIVED BASED ON ITS RELATIVE LOCATION TO A TARGER DATE,   *04490503
044910*  MAKING ADJUSTMENTS BASED ON WHICH DAY OF THE WEEK THE TARGET  *04491003
044920*  DATE LIES.                                                    *04492003
045000******************************************************************04500000
045100                                                                  04510000
045200 2000-COMPUTE-HOLIDAYS.                                           04520000
045210     MOVE PV-CURRENT-YEAR TO HD2-HOLIDAY-YEAR.                    04521000
045310                                                                  04531000
045320     SET HD2-HN-NEW-YEARS-DAY                                     04532000
045321         HD2-HM-NEW-YEARS-DAY                                     04532100
045322         HD2-HD-NEW-YEARS-DAY TO TRUE.                            04532200
045323     PERFORM 3000-FINISH-WRITE-HOLIDAY-DATA.                      04532300
045326                                                                  04532600
045327     SET HD2-HN-EASTER-SUNDAY TO TRUE.                            04532700
045328     MOVE ET-EASTER-MONTH (ET-INDEX) TO HD2-HOLIDAY-MONTH.        04532800
045329     MOVE ET-EASTER-DAY (ET-INDEX) TO HD2-HOLIDAY-DAY.            04532900
045331     PERFORM 3000-FINISH-WRITE-HOLIDAY-DATA.                      04533100
045332                                                                  04533200
045333     SET HD2-HN-MEMORIAL-DAY                                      04533300
045334         HD2-HM-MEMORIAL-DAY-START                                04533400
045335         HD2-HD-MEMORIAL-DAY-START TO TRUE.                       04533500
045336     PERFORM 2100-COMPUTE-TARGET-DAY-OF-WK.                       04533600
045337     IF PV-DAY-OF-WEEK < PC-MONDAY                                04533700
045338         COMPUTE PV-DAY-ADJUSTMENT =                              04533800
045340                   (PC-DAYS-PER-WEEK - PV-DAY-OF-WEEK)            04534000
045341     ELSE                                                         04534100
045342         COMPUTE PV-DAY-ADJUSTMENT =                              04534200
045343                   (PV-DAY-OF-WEEK - PC-MONDAY)                   04534300
045344     END-IF.                                                      04534400
045345*    DISPLAY PC-CURRENT-PROGRAM-NAME  ' - START DATE = '          04534502
045346*              HD2-HOLIDAY-DATE ' (' HD2-HOLIDAY-NAME ') - '      04534602
045347*              ET-EASTER-TABLE-ENTRY (ET-INDEX)  ' = '            04534700
045348*              PV-DAYS-SINCE-EASTER  ' DAYS, DAY OF WEEK = '      04534800
045349*              PV-DAY-OF-WEEK  ' -- ADJ = '                       04534900
045350*              PV-DAY-ADJUSTMENT.                                 04535000
045351     SUBTRACT PV-DAY-ADJUSTMENT FROM HD2-HOLIDAY-DAY.             04535100
045352     PERFORM 3000-FINISH-WRITE-HOLIDAY-DATA.                      04535200
045353                                                                  04535300
045354     SET HD2-HN-FOURTH-OF-JULY                                    04535400
045355         HD2-HM-FOURTH-OF-JULY                                    04535500
045356         HD2-HD-FOURTH-OF-JULY TO TRUE.                           04535600
045357     PERFORM 3000-FINISH-WRITE-HOLIDAY-DATA.                      04535700
045358                                                                  04535800
045359     SET HD2-HN-LABOR-DAY                                         04535900
045360         HD2-HM-LABOR-DAY-START                                   04536000
045361         HD2-HD-LABOR-DAY-START TO TRUE.                          04536100
045362     PERFORM 2100-COMPUTE-TARGET-DAY-OF-WK.                       04536200
045363     IF PV-DAY-OF-WEEK > PC-MONDAY                                04536300
045364         COMPUTE PV-DAY-ADJUSTMENT =                              04536400
045365                   (PC-DAYS-PER-WEEK - PV-DAY-OF-WEEK + PC-MONDAY)04536500
045366     ELSE                                                         04536600
045367         COMPUTE PV-DAY-ADJUSTMENT =                              04536700
045368                   (PC-MONDAY - PV-DAY-OF-WEEK)                   04536800
045369     END-IF.                                                      04536900
045370*    DISPLAY PC-CURRENT-PROGRAM-NAME  ' - START DATE = '          04537002
045371*              HD2-HOLIDAY-DATE ' (' HD2-HOLIDAY-NAME ') - '      04537102
045372*              ET-EASTER-TABLE-ENTRY (ET-INDEX)  ' = '            04537200
045373*              PV-DAYS-SINCE-EASTER  ' DAYS, DAY OF WEEK = '      04537300
045374*              PV-DAY-OF-WEEK  ' -- ADJ = '                       04537400
045375*              PV-DAY-ADJUSTMENT.                                 04537500
045376     ADD PV-DAY-ADJUSTMENT TO HD2-HOLIDAY-DAY.                    04537600
045377     PERFORM 3000-FINISH-WRITE-HOLIDAY-DATA.                      04537700
045378                                                                  04537800
045379     SET HD2-HN-THANKSGIVING                                      04537900
045380         HD2-HM-THANKSGIVING-START                                04538000
045381         HD2-HD-THANKSGIVING-START TO TRUE.                       04538100
045382     PERFORM 2100-COMPUTE-TARGET-DAY-OF-WK.                       04538200
045383     IF PV-DAY-OF-WEEK < PC-THURSDAY                              04538300
045384         COMPUTE PV-DAY-ADJUSTMENT =                              04538400
045385                   (PC-DAYS-PER-WEEK - PC-THURSDAY +              04538500
045386                   PV-DAY-OF-WEEK)                                04538600
045387     ELSE                                                         04538700
045388         COMPUTE PV-DAY-ADJUSTMENT =                              04538800
045389                   (PV-DAY-OF-WEEK - PC-THURSDAY)                 04538900
045390         IF PV-DAY-OF-WEEK < PC-DAYS-PER-WEEK                     04539000
045391*                                                                 04539100
045392*  THERE ARE FIVE THURSDAYS IN THE MONTH, BACK UP TO FOURTH WEEK  04539200
045393*                                                                 04539300
045394             ADD PC-DAYS-PER-WEEK TO PV-DAY-ADJUSTMENT            04539400
045395         END-IF                                                   04539500
045396     END-IF.                                                      04539600
045397*    DISPLAY PC-CURRENT-PROGRAM-NAME  ' - START DATE = '          04539702
045398*              HD2-HOLIDAY-DATE ' (' HD2-HOLIDAY-NAME ') - '      04539802
045399*              ET-EASTER-TABLE-ENTRY (ET-INDEX)  ' = '            04539900
045400*              PV-DAYS-SINCE-EASTER  ' DAYS, DAY OF WEEK = '      04540000
045401*              PV-DAY-OF-WEEK  ' -- ADJ = '                       04540100
045402*              PV-DAY-ADJUSTMENT.                                 04540200
045403     SUBTRACT PV-DAY-ADJUSTMENT FROM HD2-HOLIDAY-DAY.             04540300
045404     PERFORM 3000-FINISH-WRITE-HOLIDAY-DATA.                      04540400
045405                                                                  04540500
045406     SET HD2-HN-CHRISTMAS-DAY                                     04540600
045407         HD2-HM-CHRISTMAS-DAY                                     04540700
045408         HD2-HD-CHRISTMAS-DAY TO TRUE.                            04540800
045409     PERFORM 3000-FINISH-WRITE-HOLIDAY-DATA.                      04540900
045410                                                                  04541000
045411     ADD 1 TO PV-CURRENT-YEAR.                                    04541100
045412     SET ET-INDEX UP BY 1.                                        04541200
045413*2000-EXIT.                                                       04541300
045420                                                                  04542000
045500******************************************************************04550000
045600*  DETERMINE THE DAY OF THE WEEK FOR A REQUESTED DATE.  ONLY     *04560003
045610*  DATES THAT OCCUR AFTER EASTER OF A GIVEN YEAR CAN USE THIS    *04561003
045620*  PARAGRAPH.  DETERMINE THE NUMBER OF DAYS PAST EASTER ON WHICH *04562003
045630*  THE REQUESTED DATE LIES.  SINCE EASTER FALLS ON A SUNDAY,     *04563003
045640*  DIVIDING THIS NUMBER OF ELAPSED DAYS BY THE NUMBER OF DAYS    *04564003
045650*  PER WEEK WILL YIELD THE NUMERIC DAY OF THE WEEK AS THE        *04565003
045660*  REMAINDER, OFFSET BY 1.                                       *04566003
045700******************************************************************04570000
045800                                                                  04580000
045900 2100-COMPUTE-TARGET-DAY-OF-WK.                                   04590000
045901     MOVE ET-EASTER-MONTH (ET-INDEX) TO PV-MONTH-SUBSCRIPT.       04590102
045902     COMPUTE PV-DAYS-SINCE-EASTER =                               04590200
045903               ((MT-ME-DAYS-IN-MONTH (PV-MONTH-SUBSCRIPT) -       04590303
045905               ET-EASTER-DAY (ET-INDEX)) +                        04590500
045906               (MT-ME-ACCUM-DAYS-PRIOR-MONTHS                     04590603
045907                                     (HD2-HOLIDAY-MONTH) -        04590703
045908               MT-ME-ACCUM-DAYS-PRIOR-MONTHS                      04590803
045910                                     (PV-MONTH-SUBSCRIPT + 1)) +  04591002
045911               HD2-HOLIDAY-DAY).                                  04591100
045912                                                                  04591200
045913     DIVIDE PV-DAYS-SINCE-EASTER                                  04591300
045914         BY PC-DAYS-PER-WEEK                                      04591400
045915         GIVING PV-NUMBER-OF-WEEKS                                04591500
045916         REMAINDER PV-DAY-OF-WEEK.                                04591600
045917                                                                  04591700
045918     ADD 1 TO PV-DAY-OF-WEEK.                                     04591800
045922*2100-EXIT.                                                       04592200
045923                                                                  04592300
045924******************************************************************04592400
045925*  COMPLETE THE PAIR OF ENTRIES FOR THE HOLIDAY TABLE, AND       *04592503
045926*  WRITE THEM TO THE HOLIDAY TABLE FILE.  DETERMINE THE NUMBER   *04592603
045927*  OF DAYS SINCE THE BASELINE DATE FOR THE HOLIDAY, AND MOVE     *04592703
045928*  THAT TO THE HOLIDAY TABLE DATA DEFINITION ENTRY.              *04592803
045929******************************************************************04592903
045930                                                                  04593003
045931 3000-FINISH-WRITE-HOLIDAY-DATA.                                  04593103
045933     MOVE HD2-HOLIDAY-DATE TO PV-REQUESTED-DATE-CCYYMMDD.         04593303
045934     PERFORM 5000-COMPUTE-DAYS-SINCE-BASE.                        04593403
045935     MOVE PV-DAYS-SINCE-BASELINE TO HD2-DAYS-SINCE-BASELINE.      04593503
045936                                                                  04593603
045937     MOVE HD1-HOLIDAY-DATA-1 TO HT-HOLIDAY-TABLE-RECORD.          04593703
045938     PERFORM 8000-WRITE-HOLIDAY-DATA.                             04593803
045939     MOVE HD2-HOLIDAY-DATA-2 TO HT-HOLIDAY-TABLE-RECORD.          04593903
045940     PERFORM 8000-WRITE-HOLIDAY-DATA.                             04594000
046000*3000-EXIT.                                                       04600000
068410                                                                  06841000
068420******************************************************************06842000
068431*  DETERMINE THE NUMBER OF DAYS THAT HAVE ELAPSED SINCE THE      *06843102
068432*  BASELINE DATE OF 01-01-1901 (REFERRED TO AS "CREL", COMPARE   *06843202
068433*  RELATIVE DATE, IN THE CALENDAR ROUTINE), WHICH SERVES AS THE  *06843302
068434*  FOUNDATION FOR ALL DATE MATH.  DETERMINE THE NUMBER OF YEARS  *06843402
068436*  THAT HAVE ELAPSED, AND MULTIPLY BY A DAYS PER YEAR FACTOR     *06843602
068437*  THAT IS INCLUSIVE OF LEAP DAYS, TO SEED THE ELAPSED DAYS      *06843702
068438*  VARIABLE WITH THE DAYS THAT HAVE ELAPSED UP TO THE REQUESTED  *06843802
068439*  YEAR.  EVALUATE THE REQUESTED MONTH, AND IF VALID, ADD THE    *06843902
068440*  NUMBER OF DAYS IN THE REQUESTED YEAR THAT OCCURRED PRIOR TO   *06844002
068441*  THE REQUESTED MONTH, TO ELAPSED DAYS VARIABLE.  IF THE        *06844102
068443*  REQUESTED MONTH IS AFTER FEBRUARY, DETERMINE IF THE REQUESTED *06844302
068444*  YEAR IS A LEAP YEAR, AND IF SO, ADD LEAP DAY TO THE ELAPSED   *06844402
068445*  DAYS.  FINALLY, ADD THE REQUESTED DAY NUMBER, LESS 1, TO      *06844502
068446*  THE ELAPSED DAYS TO COMPLETE THE CALCULATION.                 *06844602
068451******************************************************************06845100
068460                                                                  06846000
068710 5000-COMPUTE-DAYS-SINCE-BASE.                                    06871000
068711     INITIALIZE PV-LEAP-YEAR-WORK-CCYY.                           06871104
068712                                                                  06871204
068720     COMPUTE PV-DAYS-SINCE-BASELINE =                             06872002
068730               ((PV-RD-CCYYMMDD-CCYY - PC-STARTING-YEAR) *        06873003
068732               PC-DAYS-PER-YEAR).                                 06873202
068770                                                                  06877000
068920     IF ((PV-RD-CCYYMMDD-MM > ZERO)                               06892003
068921             AND (PV-RD-CCYYMMDD-MM NOT > PC-MONTHS-PER-YEAR))    06892103
068922         MOVE PV-RD-CCYYMMDD-MM TO PV-MONTH-SUBSCRIPT             06892205
068980         ADD MT-ME-ACCUM-DAYS-PRIOR-MONTHS (PV-MONTH-SUBSCRIPT) TO06898003
068990                   PV-DAYS-SINCE-BASELINE                         06899002
068991         IF PV-MONTH-SUBSCRIPT > PC-FEBRUARY                      06899102
068992             MOVE PV-RD-CCYYMMDD-CCYY TO PV-LEAP-YEAR-WORK-CCYY   06899203
068994             PERFORM 5100-CHECK-LEAP-YEAR                         06899402
068995             IF PS-LY-LEAP-YEAR                                   06899502
068997                 ADD +1 TO PV-DAYS-SINCE-BASELINE                 06899702
068998             END-IF                                               06899802
068999         END-IF                                                   06899902
069006     ELSE                                                         06900600
069007         DISPLAY '** ABEND **'                                    06900702
069008         DISPLAY PC-CURRENT-PROGRAM-NAME  ' - ERROR CONVERTING '  06900802
069009                   'DATE '  PV-REQUESTED-DATE-CCYYMMDD  '.'       06900903
069010         SET AC-INVLD-DATA-ON-DATASET-ERROR TO TRUE               06901002
069011         CALL 'ILBOABN0' USING ABEND-CODE                         06901102
069020     END-IF.                                                      06902000
069030                                                                  06903002
069040     COMPUTE PV-DAYS-SINCE-BASELINE =                             06904002
069050               ((PV-DAYS-SINCE-BASELINE + PV-RD-CCYYMMDD-DD) - 1).06905003
069610*5000-EXIT.                                                       06961000
069700                                                                  06970000
076300******************************************************************07630002
076400*  DETERMINE IF THE SPECIFIED YEAR IS A LEAP YEAR.               *07640002
076500******************************************************************07650002
076510                                                                  07651002
076600 5100-CHECK-LEAP-YEAR.                                            07660000
076800     IF PV-LEAP-YEAR-WORK-YY = ZERO                               07680002
077000         DIVIDE PC-CENTURY-LEAP-YEAR-CHECK INTO                   07700000
077010             PV-LEAP-YEAR-WORK-CCYY GIVING                        07701002
077020             PV-LEAP-YEAR-WORK-CCYY ROUNDED                       07702002
077300             REMAINDER PV-LEAP-YEAR-REMAINDER                     07730002
077400     ELSE                                                         07740000
077500         DIVIDE PC-LEAP-YEAR-CHECK INTO                           07750000
077600             PV-LEAP-YEAR-WORK-CCYY GIVING                        07760002
077610             PV-LEAP-YEAR-WORK-CCYY ROUNDED                       07761002
077900             REMAINDER PV-LEAP-YEAR-REMAINDER                     07790002
078000     END-IF.                                                      07800000
078100                                                                  07810000
078200     IF PV-LEAP-YEAR-REMAINDER = ZERO                             07820002
078300         SET PS-LY-LEAP-YEAR TO TRUE                              07830002
078500     ELSE                                                         07850000
078600         SET PS-LY-NOT-LEAP-YEAR TO TRUE                          07860002
078800     END-IF.                                                      07880000
078810*5100-EXIT.                                                       07881002
078900                                                                  07890000
079000******************************************************************07900000
079100*  WRITE A HOLIDAY TABLE RECORD.                                 *07910003
079200******************************************************************07920000
079300                                                                  07930000
079400 8000-WRITE-HOLIDAY-DATA.                                         07940000
079500     WRITE HT-HOLIDAY-TABLE-RECORD.                               07950000
079600*8000-EXIT.                                                       07960000
079700                                                                  07970000
079800******************************************************************07980000
079900*  CLOSE ALL FILES.                                              *07990003
080000******************************************************************08000000
080100                                                                  08010000
080200 9000-EOJ-ROUTINE.                                                08020000
080300     CLOSE HOLIDAY-TABLE-FILE.                                    08030000
080400*9000-EXIT.                                                       08040000
