00002  IDENTIFICATION DIVISION.                                         DPKUT012
00003                                                                      LV018
00004  PROGRAM-ID.    DPKUT012.                                         DPKUT012
00005                                                                   DPKUT012
00006  AUTHOR.        CALVIN BUSH.                                      DPKUT012
00007  INSTALLATION.  KOHLS DEPARTMENT STORES.                          DPKUT012
00008  DATE-WRITTEN.  07/23/90.                                         DPKUT012
00009  DATE-COMPILED.                                                   DPKUT012
00010                                                                   DPKUT012
00011 ***************************************************************** DPKUT012
00012 **  CONVERT FIELDS TO HEX REPRESENTATION.                         DPKUT012
00013 **                                                                DPKUT012
00014 **                                                                DPKUT012
00015 **                                                                DPKUT012
00016 **                                                                DPKUT012
00017 ***************************************************************** DPKUT012
00018                                                                   DPKUT012
00019  ENVIRONMENT DIVISION.                                            DPKUT012
00020 *                                                                 DPKUT012
00021  CONFIGURATION SECTION.                                           DPKUT012
00022 *                                                                 DPKUT012
00023  SOURCE-COMPUTER.  IBM-3090.                                      DPKUT012
00024  OBJECT-COMPUTER.  IBM-3090.                                      DPKUT012
00025 *                                                                 DPKUT012
00026  DATA DIVISION.                                                      CL**4
00027                                                                   DPKUT012
00028  WORKING-STORAGE SECTION.                                         DPKUT012
00029  01  PV-PROGRAM-VARIABLES.                                        DPKUT012
00030      05  PV-CONV-SUB                  PIC S9(04)  VALUE ZERO         CL**2
00031                                                   COMP.              CL**2
00032      05  PV-CONVERSION-FIELD.                                        CL**2
00033          10  PV-CONVERSION-CHARACTER  OCCURS 20 TIMES                CL**2
00034                                       PIC  X(01)  VALUE SPACE.       CL**2
00035      05  PV-CONVERTED-FIELD.                                         CL**2
00036          10  PV-CONVERTED-CHARACTER   OCCURS 20 TIMES                CL**2
00037                                       PIC  X(02)  VALUE SPACE.       CL**2
00038  01  PC-PROGRAM-CONSTANTS.                                           CL**2
00039      05  PC-MAX-CONV-LENGTH           PIC S9(04)  VALUE +21          CL**2
00040                                                   COMP.              CL**2
00041 *                                                                    CL**4
00042 **   PARAMETER LIST USED TO CALL THIS MODULE.                        CL**4
00043 *                                                                    CL**4
00044      COPY DPWS012.                                                   CL*18
00045  01  HT-HEX-CHAR-CONVERSION-TABLE.                                   CL**3
00046      05  HT-HEX-CHAR-TABLE-ENTRIES.                                  CL**3
               10  FILLER              PIC  X(01)  VALUE X'00'.                 
               10  FILLER              PIC  X(02)  VALUE  '00'.                 
               10  FILLER              PIC  X(01)  VALUE X'01'.                 
               10  FILLER              PIC  X(02)  VALUE  '01'.                 
               10  FILLER              PIC  X(01)  VALUE X'02'.                 
               10  FILLER              PIC  X(02)  VALUE  '02'.                 
               10  FILLER              PIC  X(01)  VALUE X'03'.                 
               10  FILLER              PIC  X(02)  VALUE  '03'.                 
               10  FILLER              PIC  X(01)  VALUE X'04'.                 
               10  FILLER              PIC  X(02)  VALUE  '04'.                 
               10  FILLER              PIC  X(01)  VALUE X'05'.                 
               10  FILLER              PIC  X(02)  VALUE  '05'.                 
               10  FILLER              PIC  X(01)  VALUE X'06'.                 
               10  FILLER              PIC  X(02)  VALUE  '06'.                 
               10  FILLER              PIC  X(01)  VALUE X'07'.                 
               10  FILLER              PIC  X(02)  VALUE  '07'.                 
               10  FILLER              PIC  X(01)  VALUE X'08'.                 
               10  FILLER              PIC  X(02)  VALUE  '08'.                 
               10  FILLER              PIC  X(01)  VALUE X'09'.                 
               10  FILLER              PIC  X(02)  VALUE  '09'.                 
               10  FILLER              PIC  X(01)  VALUE X'0A'.                 
               10  FILLER              PIC  X(02)  VALUE  '0A'.                 
               10  FILLER              PIC  X(01)  VALUE X'0B'.                 
               10  FILLER              PIC  X(02)  VALUE  '0B'.                 
               10  FILLER              PIC  X(01)  VALUE X'0C'.                 
               10  FILLER              PIC  X(02)  VALUE  '0C'.                 
               10  FILLER              PIC  X(01)  VALUE X'0D'.                 
               10  FILLER              PIC  X(02)  VALUE  '0D'.                 
               10  FILLER              PIC  X(01)  VALUE X'0E'.                 
               10  FILLER              PIC  X(02)  VALUE  '0E'.                 
               10  FILLER              PIC  X(01)  VALUE X'0F'.                 
               10  FILLER              PIC  X(02)  VALUE  '0F'.                 
               10  FILLER              PIC  X(01)  VALUE X'10'.                 
               10  FILLER              PIC  X(02)  VALUE  '10'.                 
               10  FILLER              PIC  X(01)  VALUE X'11'.                 
               10  FILLER              PIC  X(02)  VALUE  '11'.                 
               10  FILLER              PIC  X(01)  VALUE X'12'.                 
               10  FILLER              PIC  X(02)  VALUE  '12'.                 
               10  FILLER              PIC  X(01)  VALUE X'13'.                 
               10  FILLER              PIC  X(02)  VALUE  '13'.                 
               10  FILLER              PIC  X(01)  VALUE X'14'.                 
               10  FILLER              PIC  X(02)  VALUE  '14'.                 
               10  FILLER              PIC  X(01)  VALUE X'15'.                 
               10  FILLER              PIC  X(02)  VALUE  '15'.                 
               10  FILLER              PIC  X(01)  VALUE X'16'.                 
               10  FILLER              PIC  X(02)  VALUE  '16'.                 
               10  FILLER              PIC  X(01)  VALUE X'17'.                 
               10  FILLER              PIC  X(02)  VALUE  '17'.                 
               10  FILLER              PIC  X(01)  VALUE X'18'.                 
               10  FILLER              PIC  X(02)  VALUE  '18'.                 
               10  FILLER              PIC  X(01)  VALUE X'19'.                 
               10  FILLER              PIC  X(02)  VALUE  '19'.                 
               10  FILLER              PIC  X(01)  VALUE X'1A'.                 
               10  FILLER              PIC  X(02)  VALUE  '1A'.                 
               10  FILLER              PIC  X(01)  VALUE X'1B'.                 
               10  FILLER              PIC  X(02)  VALUE  '1B'.                 
               10  FILLER              PIC  X(01)  VALUE X'1C'.                 
               10  FILLER              PIC  X(02)  VALUE  '1C'.                 
               10  FILLER              PIC  X(01)  VALUE X'1D'.                 
               10  FILLER              PIC  X(02)  VALUE  '1D'.                 
               10  FILLER              PIC  X(01)  VALUE X'1E'.                 
               10  FILLER              PIC  X(02)  VALUE  '1E'.                 
               10  FILLER              PIC  X(01)  VALUE X'1F'.                 
               10  FILLER              PIC  X(02)  VALUE  '1F'.                 
               10  FILLER              PIC  X(01)  VALUE X'20'.                 
               10  FILLER              PIC  X(02)  VALUE  '20'.                 
               10  FILLER              PIC  X(01)  VALUE X'21'.                 
               10  FILLER              PIC  X(02)  VALUE  '21'.                 
               10  FILLER              PIC  X(01)  VALUE X'22'.                 
               10  FILLER              PIC  X(02)  VALUE  '22'.                 
               10  FILLER              PIC  X(01)  VALUE X'23'.                 
               10  FILLER              PIC  X(02)  VALUE  '23'.                 
               10  FILLER              PIC  X(01)  VALUE X'24'.                 
               10  FILLER              PIC  X(02)  VALUE  '24'.                 
               10  FILLER              PIC  X(01)  VALUE X'25'.                 
               10  FILLER              PIC  X(02)  VALUE  '25'.                 
               10  FILLER              PIC  X(01)  VALUE X'26'.                 
               10  FILLER              PIC  X(02)  VALUE  '26'.                 
               10  FILLER              PIC  X(01)  VALUE X'27'.                 
               10  FILLER              PIC  X(02)  VALUE  '27'.                 
               10  FILLER              PIC  X(01)  VALUE X'28'.                 
               10  FILLER              PIC  X(02)  VALUE  '28'.                 
               10  FILLER              PIC  X(01)  VALUE X'29'.                 
               10  FILLER              PIC  X(02)  VALUE  '29'.                 
               10  FILLER              PIC  X(01)  VALUE X'2A'.                 
               10  FILLER              PIC  X(02)  VALUE  '2A'.                 
               10  FILLER              PIC  X(01)  VALUE X'2B'.                 
               10  FILLER              PIC  X(02)  VALUE  '2B'.                 
               10  FILLER              PIC  X(01)  VALUE X'2C'.                 
               10  FILLER              PIC  X(02)  VALUE  '2C'.                 
               10  FILLER              PIC  X(01)  VALUE X'2D'.                 
               10  FILLER              PIC  X(02)  VALUE  '2D'.                 
               10  FILLER              PIC  X(01)  VALUE X'2E'.                 
               10  FILLER              PIC  X(02)  VALUE  '2E'.                 
               10  FILLER              PIC  X(01)  VALUE X'2F'.                 
               10  FILLER              PIC  X(02)  VALUE  '2F'.                 
               10  FILLER              PIC  X(01)  VALUE X'30'.                 
               10  FILLER              PIC  X(02)  VALUE  '30'.                 
               10  FILLER              PIC  X(01)  VALUE X'31'.                 
               10  FILLER              PIC  X(02)  VALUE  '31'.                 
               10  FILLER              PIC  X(01)  VALUE X'32'.                 
               10  FILLER              PIC  X(02)  VALUE  '32'.                 
               10  FILLER              PIC  X(01)  VALUE X'33'.                 
               10  FILLER              PIC  X(02)  VALUE  '33'.                 
               10  FILLER              PIC  X(01)  VALUE X'34'.                 
               10  FILLER              PIC  X(02)  VALUE  '34'.                 
               10  FILLER              PIC  X(01)  VALUE X'35'.                 
               10  FILLER              PIC  X(02)  VALUE  '35'.                 
               10  FILLER              PIC  X(01)  VALUE X'36'.                 
               10  FILLER              PIC  X(02)  VALUE  '36'.                 
               10  FILLER              PIC  X(01)  VALUE X'37'.                 
               10  FILLER              PIC  X(02)  VALUE  '37'.                 
               10  FILLER              PIC  X(01)  VALUE X'38'.                 
               10  FILLER              PIC  X(02)  VALUE  '38'.                 
               10  FILLER              PIC  X(01)  VALUE X'39'.                 
               10  FILLER              PIC  X(02)  VALUE  '39'.                 
               10  FILLER              PIC  X(01)  VALUE X'3A'.                 
               10  FILLER              PIC  X(02)  VALUE  '3A'.                 
               10  FILLER              PIC  X(01)  VALUE X'3B'.                 
               10  FILLER              PIC  X(02)  VALUE  '3B'.                 
               10  FILLER              PIC  X(01)  VALUE X'3C'.                 
               10  FILLER              PIC  X(02)  VALUE  '3C'.                 
               10  FILLER              PIC  X(01)  VALUE X'3D'.                 
               10  FILLER              PIC  X(02)  VALUE  '3D'.                 
               10  FILLER              PIC  X(01)  VALUE X'3E'.                 
               10  FILLER              PIC  X(02)  VALUE  '3E'.                 
               10  FILLER              PIC  X(01)  VALUE X'3F'.                 
               10  FILLER              PIC  X(02)  VALUE  '3F'.                 
               10  FILLER              PIC  X(01)  VALUE X'40'.                 
               10  FILLER              PIC  X(02)  VALUE  '40'.                 
               10  FILLER              PIC  X(01)  VALUE X'41'.                 
               10  FILLER              PIC  X(02)  VALUE  '41'.                 
               10  FILLER              PIC  X(01)  VALUE X'42'.                 
               10  FILLER              PIC  X(02)  VALUE  '42'.                 
               10  FILLER              PIC  X(01)  VALUE X'43'.                 
               10  FILLER              PIC  X(02)  VALUE  '43'.                 
               10  FILLER              PIC  X(01)  VALUE X'44'.                 
               10  FILLER              PIC  X(02)  VALUE  '44'.                 
               10  FILLER              PIC  X(01)  VALUE X'45'.                 
               10  FILLER              PIC  X(02)  VALUE  '45'.                 
               10  FILLER              PIC  X(01)  VALUE X'46'.                 
               10  FILLER              PIC  X(02)  VALUE  '46'.                 
               10  FILLER              PIC  X(01)  VALUE X'47'.                 
               10  FILLER              PIC  X(02)  VALUE  '47'.                 
               10  FILLER              PIC  X(01)  VALUE X'48'.                 
               10  FILLER              PIC  X(02)  VALUE  '48'.                 
               10  FILLER              PIC  X(01)  VALUE X'49'.                 
               10  FILLER              PIC  X(02)  VALUE  '49'.                 
               10  FILLER              PIC  X(01)  VALUE X'4A'.                 
               10  FILLER              PIC  X(02)  VALUE  '4A'.                 
               10  FILLER              PIC  X(01)  VALUE X'4B'.                 
               10  FILLER              PIC  X(02)  VALUE  '4B'.                 
               10  FILLER              PIC  X(01)  VALUE X'4C'.                 
               10  FILLER              PIC  X(02)  VALUE  '4C'.                 
               10  FILLER              PIC  X(01)  VALUE X'4D'.                 
               10  FILLER              PIC  X(02)  VALUE  '4D'.                 
               10  FILLER              PIC  X(01)  VALUE X'4E'.                 
               10  FILLER              PIC  X(02)  VALUE  '4E'.                 
               10  FILLER              PIC  X(01)  VALUE X'4F'.                 
               10  FILLER              PIC  X(02)  VALUE  '4F'.                 
               10  FILLER              PIC  X(01)  VALUE X'50'.                 
               10  FILLER              PIC  X(02)  VALUE  '50'.                 
               10  FILLER              PIC  X(01)  VALUE X'51'.                 
               10  FILLER              PIC  X(02)  VALUE  '51'.                 
               10  FILLER              PIC  X(01)  VALUE X'52'.                 
               10  FILLER              PIC  X(02)  VALUE  '52'.                 
               10  FILLER              PIC  X(01)  VALUE X'53'.                 
               10  FILLER              PIC  X(02)  VALUE  '53'.                 
               10  FILLER              PIC  X(01)  VALUE X'54'.                 
               10  FILLER              PIC  X(02)  VALUE  '54'.                 
               10  FILLER              PIC  X(01)  VALUE X'55'.                 
               10  FILLER              PIC  X(02)  VALUE  '55'.                 
               10  FILLER              PIC  X(01)  VALUE X'56'.                 
               10  FILLER              PIC  X(02)  VALUE  '56'.                 
               10  FILLER              PIC  X(01)  VALUE X'57'.                 
               10  FILLER              PIC  X(02)  VALUE  '57'.                 
               10  FILLER              PIC  X(01)  VALUE X'58'.                 
               10  FILLER              PIC  X(02)  VALUE  '58'.                 
               10  FILLER              PIC  X(01)  VALUE X'59'.                 
               10  FILLER              PIC  X(02)  VALUE  '59'.                 
               10  FILLER              PIC  X(01)  VALUE X'5A'.                 
               10  FILLER              PIC  X(02)  VALUE  '5A'.                 
               10  FILLER              PIC  X(01)  VALUE X'5B'.                 
               10  FILLER              PIC  X(02)  VALUE  '5B'.                 
               10  FILLER              PIC  X(01)  VALUE X'5C'.                 
               10  FILLER              PIC  X(02)  VALUE  '5C'.                 
               10  FILLER              PIC  X(01)  VALUE X'5D'.                 
               10  FILLER              PIC  X(02)  VALUE  '5D'.                 
               10  FILLER              PIC  X(01)  VALUE X'5E'.                 
               10  FILLER              PIC  X(02)  VALUE  '5E'.                 
               10  FILLER              PIC  X(01)  VALUE X'5F'.                 
               10  FILLER              PIC  X(02)  VALUE  '5F'.                 
               10  FILLER              PIC  X(01)  VALUE X'60'.                 
               10  FILLER              PIC  X(02)  VALUE  '60'.                 
               10  FILLER              PIC  X(01)  VALUE X'61'.                 
               10  FILLER              PIC  X(02)  VALUE  '61'.                 
               10  FILLER              PIC  X(01)  VALUE X'62'.                 
               10  FILLER              PIC  X(02)  VALUE  '62'.                 
               10  FILLER              PIC  X(01)  VALUE X'63'.                 
               10  FILLER              PIC  X(02)  VALUE  '63'.                 
               10  FILLER              PIC  X(01)  VALUE X'64'.                 
               10  FILLER              PIC  X(02)  VALUE  '64'.                 
               10  FILLER              PIC  X(01)  VALUE X'65'.                 
               10  FILLER              PIC  X(02)  VALUE  '65'.                 
               10  FILLER              PIC  X(01)  VALUE X'66'.                 
               10  FILLER              PIC  X(02)  VALUE  '66'.                 
               10  FILLER              PIC  X(01)  VALUE X'67'.                 
               10  FILLER              PIC  X(02)  VALUE  '67'.                 
               10  FILLER              PIC  X(01)  VALUE X'68'.                 
               10  FILLER              PIC  X(02)  VALUE  '68'.                 
               10  FILLER              PIC  X(01)  VALUE X'69'.                 
               10  FILLER              PIC  X(02)  VALUE  '69'.                 
               10  FILLER              PIC  X(01)  VALUE X'6A'.                 
               10  FILLER              PIC  X(02)  VALUE  '6A'.                 
               10  FILLER              PIC  X(01)  VALUE X'6B'.                 
               10  FILLER              PIC  X(02)  VALUE  '6B'.                 
               10  FILLER              PIC  X(01)  VALUE X'6C'.                 
               10  FILLER              PIC  X(02)  VALUE  '6C'.                 
               10  FILLER              PIC  X(01)  VALUE X'6D'.                 
               10  FILLER              PIC  X(02)  VALUE  '6D'.                 
               10  FILLER              PIC  X(01)  VALUE X'6E'.                 
               10  FILLER              PIC  X(02)  VALUE  '6E'.                 
               10  FILLER              PIC  X(01)  VALUE X'6F'.                 
               10  FILLER              PIC  X(02)  VALUE  '6F'.                 
               10  FILLER              PIC  X(01)  VALUE X'70'.                 
               10  FILLER              PIC  X(02)  VALUE  '70'.                 
               10  FILLER              PIC  X(01)  VALUE X'71'.                 
               10  FILLER              PIC  X(02)  VALUE  '71'.                 
               10  FILLER              PIC  X(01)  VALUE X'72'.                 
               10  FILLER              PIC  X(02)  VALUE  '72'.                 
               10  FILLER              PIC  X(01)  VALUE X'73'.                 
               10  FILLER              PIC  X(02)  VALUE  '73'.                 
               10  FILLER              PIC  X(01)  VALUE X'74'.                 
               10  FILLER              PIC  X(02)  VALUE  '74'.                 
               10  FILLER              PIC  X(01)  VALUE X'75'.                 
               10  FILLER              PIC  X(02)  VALUE  '75'.                 
               10  FILLER              PIC  X(01)  VALUE X'76'.                 
               10  FILLER              PIC  X(02)  VALUE  '76'.                 
               10  FILLER              PIC  X(01)  VALUE X'77'.                 
               10  FILLER              PIC  X(02)  VALUE  '77'.                 
               10  FILLER              PIC  X(01)  VALUE X'78'.                 
               10  FILLER              PIC  X(02)  VALUE  '78'.                 
               10  FILLER              PIC  X(01)  VALUE X'79'.                 
               10  FILLER              PIC  X(02)  VALUE  '79'.                 
               10  FILLER              PIC  X(01)  VALUE X'7A'.                 
               10  FILLER              PIC  X(02)  VALUE  '7A'.                 
               10  FILLER              PIC  X(01)  VALUE X'7B'.                 
               10  FILLER              PIC  X(02)  VALUE  '7B'.                 
               10  FILLER              PIC  X(01)  VALUE X'7C'.                 
               10  FILLER              PIC  X(02)  VALUE  '7C'.                 
               10  FILLER              PIC  X(01)  VALUE X'7D'.                 
               10  FILLER              PIC  X(02)  VALUE  '7D'.                 
               10  FILLER              PIC  X(01)  VALUE X'7E'.                 
               10  FILLER              PIC  X(02)  VALUE  '7E'.                 
               10  FILLER              PIC  X(01)  VALUE X'7F'.                 
               10  FILLER              PIC  X(02)  VALUE  '7F'.                 
               10  FILLER              PIC  X(01)  VALUE X'80'.                 
               10  FILLER              PIC  X(02)  VALUE  '80'.                 
               10  FILLER              PIC  X(01)  VALUE X'81'.                 
               10  FILLER              PIC  X(02)  VALUE  '81'.                 
               10  FILLER              PIC  X(01)  VALUE X'82'.                 
               10  FILLER              PIC  X(02)  VALUE  '82'.                 
               10  FILLER              PIC  X(01)  VALUE X'83'.                 
               10  FILLER              PIC  X(02)  VALUE  '83'.                 
               10  FILLER              PIC  X(01)  VALUE X'84'.                 
               10  FILLER              PIC  X(02)  VALUE  '84'.                 
               10  FILLER              PIC  X(01)  VALUE X'85'.                 
               10  FILLER              PIC  X(02)  VALUE  '85'.                 
               10  FILLER              PIC  X(01)  VALUE X'86'.                 
               10  FILLER              PIC  X(02)  VALUE  '86'.                 
               10  FILLER              PIC  X(01)  VALUE X'87'.                 
               10  FILLER              PIC  X(02)  VALUE  '87'.                 
               10  FILLER              PIC  X(01)  VALUE X'88'.                 
               10  FILLER              PIC  X(02)  VALUE  '88'.                 
               10  FILLER              PIC  X(01)  VALUE X'89'.                 
               10  FILLER              PIC  X(02)  VALUE  '89'.                 
               10  FILLER              PIC  X(01)  VALUE X'8A'.                 
               10  FILLER              PIC  X(02)  VALUE  '8A'.                 
               10  FILLER              PIC  X(01)  VALUE X'8B'.                 
               10  FILLER              PIC  X(02)  VALUE  '8B'.                 
               10  FILLER              PIC  X(01)  VALUE X'8C'.                 
               10  FILLER              PIC  X(02)  VALUE  '8C'.                 
               10  FILLER              PIC  X(01)  VALUE X'8D'.                 
               10  FILLER              PIC  X(02)  VALUE  '8D'.                 
               10  FILLER              PIC  X(01)  VALUE X'8E'.                 
               10  FILLER              PIC  X(02)  VALUE  '8E'.                 
               10  FILLER              PIC  X(01)  VALUE X'8F'.                 
               10  FILLER              PIC  X(02)  VALUE  '8F'.                 
               10  FILLER              PIC  X(01)  VALUE X'90'.                 
               10  FILLER              PIC  X(02)  VALUE  '90'.                 
               10  FILLER              PIC  X(01)  VALUE X'91'.                 
               10  FILLER              PIC  X(02)  VALUE  '91'.                 
               10  FILLER              PIC  X(01)  VALUE X'92'.                 
               10  FILLER              PIC  X(02)  VALUE  '92'.                 
               10  FILLER              PIC  X(01)  VALUE X'93'.                 
               10  FILLER              PIC  X(02)  VALUE  '93'.                 
               10  FILLER              PIC  X(01)  VALUE X'94'.                 
               10  FILLER              PIC  X(02)  VALUE  '94'.                 
               10  FILLER              PIC  X(01)  VALUE X'95'.                 
               10  FILLER              PIC  X(02)  VALUE  '95'.                 
               10  FILLER              PIC  X(01)  VALUE X'96'.                 
               10  FILLER              PIC  X(02)  VALUE  '96'.                 
               10  FILLER              PIC  X(01)  VALUE X'97'.                 
               10  FILLER              PIC  X(02)  VALUE  '97'.                 
               10  FILLER              PIC  X(01)  VALUE X'98'.                 
               10  FILLER              PIC  X(02)  VALUE  '98'.                 
               10  FILLER              PIC  X(01)  VALUE X'99'.                 
               10  FILLER              PIC  X(02)  VALUE  '99'.                 
               10  FILLER              PIC  X(01)  VALUE X'9A'.                 
               10  FILLER              PIC  X(02)  VALUE  '9A'.                 
               10  FILLER              PIC  X(01)  VALUE X'9B'.                 
               10  FILLER              PIC  X(02)  VALUE  '9B'.                 
               10  FILLER              PIC  X(01)  VALUE X'9C'.                 
               10  FILLER              PIC  X(02)  VALUE  '9C'.                 
               10  FILLER              PIC  X(01)  VALUE X'9D'.                 
               10  FILLER              PIC  X(02)  VALUE  '9D'.                 
               10  FILLER              PIC  X(01)  VALUE X'9E'.                 
               10  FILLER              PIC  X(02)  VALUE  '9E'.                 
               10  FILLER              PIC  X(01)  VALUE X'9F'.                 
               10  FILLER              PIC  X(02)  VALUE  '9F'.                 
               10  FILLER              PIC  X(01)  VALUE X'A0'.                 
               10  FILLER              PIC  X(02)  VALUE  'A0'.                 
               10  FILLER              PIC  X(01)  VALUE X'A1'.                 
               10  FILLER              PIC  X(02)  VALUE  'A1'.                 
               10  FILLER              PIC  X(01)  VALUE X'A2'.                 
               10  FILLER              PIC  X(02)  VALUE  'A2'.                 
               10  FILLER              PIC  X(01)  VALUE X'A3'.                 
               10  FILLER              PIC  X(02)  VALUE  'A3'.                 
               10  FILLER              PIC  X(01)  VALUE X'A4'.                 
               10  FILLER              PIC  X(02)  VALUE  'A4'.                 
               10  FILLER              PIC  X(01)  VALUE X'A5'.                 
               10  FILLER              PIC  X(02)  VALUE  'A5'.                 
               10  FILLER              PIC  X(01)  VALUE X'A6'.                 
               10  FILLER              PIC  X(02)  VALUE  'A6'.                 
               10  FILLER              PIC  X(01)  VALUE X'A7'.                 
               10  FILLER              PIC  X(02)  VALUE  'A7'.                 
               10  FILLER              PIC  X(01)  VALUE X'A8'.                 
               10  FILLER              PIC  X(02)  VALUE  'A8'.                 
               10  FILLER              PIC  X(01)  VALUE X'A9'.                 
               10  FILLER              PIC  X(02)  VALUE  'A9'.                 
               10  FILLER              PIC  X(01)  VALUE X'AA'.                 
               10  FILLER              PIC  X(02)  VALUE  'AA'.                 
               10  FILLER              PIC  X(01)  VALUE X'AB'.                 
               10  FILLER              PIC  X(02)  VALUE  'AB'.                 
               10  FILLER              PIC  X(01)  VALUE X'AC'.                 
               10  FILLER              PIC  X(02)  VALUE  'AC'.                 
               10  FILLER              PIC  X(01)  VALUE X'AD'.                 
               10  FILLER              PIC  X(02)  VALUE  'AD'.                 
               10  FILLER              PIC  X(01)  VALUE X'AE'.                 
               10  FILLER              PIC  X(02)  VALUE  'AE'.                 
               10  FILLER              PIC  X(01)  VALUE X'AF'.                 
               10  FILLER              PIC  X(02)  VALUE  'AF'.                 
               10  FILLER              PIC  X(01)  VALUE X'B0'.                 
               10  FILLER              PIC  X(02)  VALUE  'B0'.                 
               10  FILLER              PIC  X(01)  VALUE X'B1'.                 
               10  FILLER              PIC  X(02)  VALUE  'B1'.                 
               10  FILLER              PIC  X(01)  VALUE X'B2'.                 
               10  FILLER              PIC  X(02)  VALUE  'B2'.                 
               10  FILLER              PIC  X(01)  VALUE X'B3'.                 
               10  FILLER              PIC  X(02)  VALUE  'B3'.                 
               10  FILLER              PIC  X(01)  VALUE X'B4'.                 
               10  FILLER              PIC  X(02)  VALUE  'B4'.                 
               10  FILLER              PIC  X(01)  VALUE X'B5'.                 
               10  FILLER              PIC  X(02)  VALUE  'B5'.                 
               10  FILLER              PIC  X(01)  VALUE X'B6'.                 
               10  FILLER              PIC  X(02)  VALUE  'B6'.                 
               10  FILLER              PIC  X(01)  VALUE X'B7'.                 
               10  FILLER              PIC  X(02)  VALUE  'B7'.                 
               10  FILLER              PIC  X(01)  VALUE X'B8'.                 
               10  FILLER              PIC  X(02)  VALUE  'B8'.                 
               10  FILLER              PIC  X(01)  VALUE X'B9'.                 
               10  FILLER              PIC  X(02)  VALUE  'B9'.                 
               10  FILLER              PIC  X(01)  VALUE X'BA'.                 
               10  FILLER              PIC  X(02)  VALUE  'BA'.                 
               10  FILLER              PIC  X(01)  VALUE X'BB'.                 
               10  FILLER              PIC  X(02)  VALUE  'BB'.                 
               10  FILLER              PIC  X(01)  VALUE X'BC'.                 
               10  FILLER              PIC  X(02)  VALUE  'BC'.                 
               10  FILLER              PIC  X(01)  VALUE X'BD'.                 
               10  FILLER              PIC  X(02)  VALUE  'BD'.                 
               10  FILLER              PIC  X(01)  VALUE X'BE'.                 
               10  FILLER              PIC  X(02)  VALUE  'BE'.                 
               10  FILLER              PIC  X(01)  VALUE X'BF'.                 
               10  FILLER              PIC  X(02)  VALUE  'BF'.                 
               10  FILLER              PIC  X(01)  VALUE X'C0'.                 
               10  FILLER              PIC  X(02)  VALUE  'C0'.                 
               10  FILLER              PIC  X(01)  VALUE X'C1'.                 
               10  FILLER              PIC  X(02)  VALUE  'C1'.                 
               10  FILLER              PIC  X(01)  VALUE X'C2'.                 
               10  FILLER              PIC  X(02)  VALUE  'C2'.                 
               10  FILLER              PIC  X(01)  VALUE X'C3'.                 
               10  FILLER              PIC  X(02)  VALUE  'C3'.                 
               10  FILLER              PIC  X(01)  VALUE X'C4'.                 
               10  FILLER              PIC  X(02)  VALUE  'C4'.                 
               10  FILLER              PIC  X(01)  VALUE X'C5'.                 
               10  FILLER              PIC  X(02)  VALUE  'C5'.                 
               10  FILLER              PIC  X(01)  VALUE X'C6'.                 
               10  FILLER              PIC  X(02)  VALUE  'C6'.                 
               10  FILLER              PIC  X(01)  VALUE X'C7'.                 
               10  FILLER              PIC  X(02)  VALUE  'C7'.                 
               10  FILLER              PIC  X(01)  VALUE X'C8'.                 
               10  FILLER              PIC  X(02)  VALUE  'C8'.                 
               10  FILLER              PIC  X(01)  VALUE X'C9'.                 
               10  FILLER              PIC  X(02)  VALUE  'C9'.                 
               10  FILLER              PIC  X(01)  VALUE X'CA'.                 
               10  FILLER              PIC  X(02)  VALUE  'CA'.                 
               10  FILLER              PIC  X(01)  VALUE X'CB'.                 
               10  FILLER              PIC  X(02)  VALUE  'CB'.                 
               10  FILLER              PIC  X(01)  VALUE X'CC'.                 
               10  FILLER              PIC  X(02)  VALUE  'CC'.                 
               10  FILLER              PIC  X(01)  VALUE X'CD'.                 
               10  FILLER              PIC  X(02)  VALUE  'CD'.                 
               10  FILLER              PIC  X(01)  VALUE X'CE'.                 
               10  FILLER              PIC  X(02)  VALUE  'CE'.                 
               10  FILLER              PIC  X(01)  VALUE X'CF'.                 
               10  FILLER              PIC  X(02)  VALUE  'CF'.                 
               10  FILLER              PIC  X(01)  VALUE X'D0'.                 
               10  FILLER              PIC  X(02)  VALUE  'D0'.                 
               10  FILLER              PIC  X(01)  VALUE X'D1'.                 
               10  FILLER              PIC  X(02)  VALUE  'D1'.                 
               10  FILLER              PIC  X(01)  VALUE X'D2'.                 
               10  FILLER              PIC  X(02)  VALUE  'D2'.                 
               10  FILLER              PIC  X(01)  VALUE X'D3'.                 
               10  FILLER              PIC  X(02)  VALUE  'D3'.                 
               10  FILLER              PIC  X(01)  VALUE X'D4'.                 
               10  FILLER              PIC  X(02)  VALUE  'D4'.                 
               10  FILLER              PIC  X(01)  VALUE X'D5'.                 
               10  FILLER              PIC  X(02)  VALUE  'D5'.                 
               10  FILLER              PIC  X(01)  VALUE X'D6'.                 
               10  FILLER              PIC  X(02)  VALUE  'D6'.                 
               10  FILLER              PIC  X(01)  VALUE X'D7'.                 
               10  FILLER              PIC  X(02)  VALUE  'D7'.                 
               10  FILLER              PIC  X(01)  VALUE X'D8'.                 
               10  FILLER              PIC  X(02)  VALUE  'D8'.                 
               10  FILLER              PIC  X(01)  VALUE X'D9'.                 
               10  FILLER              PIC  X(02)  VALUE  'D9'.                 
               10  FILLER              PIC  X(01)  VALUE X'DA'.                 
               10  FILLER              PIC  X(02)  VALUE  'DA'.                 
               10  FILLER              PIC  X(01)  VALUE X'DB'.                 
               10  FILLER              PIC  X(02)  VALUE  'DB'.                 
               10  FILLER              PIC  X(01)  VALUE X'DC'.                 
               10  FILLER              PIC  X(02)  VALUE  'DC'.                 
               10  FILLER              PIC  X(01)  VALUE X'DD'.                 
               10  FILLER              PIC  X(02)  VALUE  'DD'.                 
               10  FILLER              PIC  X(01)  VALUE X'DE'.                 
               10  FILLER              PIC  X(02)  VALUE  'DE'.                 
               10  FILLER              PIC  X(01)  VALUE X'DF'.                 
               10  FILLER              PIC  X(02)  VALUE  'DF'.                 
               10  FILLER              PIC  X(01)  VALUE X'E0'.                 
               10  FILLER              PIC  X(02)  VALUE  'E0'.                 
               10  FILLER              PIC  X(01)  VALUE X'E1'.                 
               10  FILLER              PIC  X(02)  VALUE  'E1'.                 
               10  FILLER              PIC  X(01)  VALUE X'E2'.                 
               10  FILLER              PIC  X(02)  VALUE  'E2'.                 
               10  FILLER              PIC  X(01)  VALUE X'E3'.                 
               10  FILLER              PIC  X(02)  VALUE  'E3'.                 
               10  FILLER              PIC  X(01)  VALUE X'E4'.                 
               10  FILLER              PIC  X(02)  VALUE  'E4'.                 
               10  FILLER              PIC  X(01)  VALUE X'E5'.                 
               10  FILLER              PIC  X(02)  VALUE  'E5'.                 
               10  FILLER              PIC  X(01)  VALUE X'E6'.                 
               10  FILLER              PIC  X(02)  VALUE  'E6'.                 
               10  FILLER              PIC  X(01)  VALUE X'E7'.                 
               10  FILLER              PIC  X(02)  VALUE  'E7'.                 
               10  FILLER              PIC  X(01)  VALUE X'E8'.                 
               10  FILLER              PIC  X(02)  VALUE  'E8'.                 
               10  FILLER              PIC  X(01)  VALUE X'E9'.                 
               10  FILLER              PIC  X(02)  VALUE  'E9'.                 
               10  FILLER              PIC  X(01)  VALUE X'EA'.                 
               10  FILLER              PIC  X(02)  VALUE  'EA'.                 
               10  FILLER              PIC  X(01)  VALUE X'EB'.                 
               10  FILLER              PIC  X(02)  VALUE  'EB'.                 
               10  FILLER              PIC  X(01)  VALUE X'EC'.                 
               10  FILLER              PIC  X(02)  VALUE  'EC'.                 
               10  FILLER              PIC  X(01)  VALUE X'ED'.                 
               10  FILLER              PIC  X(02)  VALUE  'ED'.                 
               10  FILLER              PIC  X(01)  VALUE X'EE'.                 
               10  FILLER              PIC  X(02)  VALUE  'EE'.                 
               10  FILLER              PIC  X(01)  VALUE X'EF'.                 
               10  FILLER              PIC  X(02)  VALUE  'EF'.                 
               10  FILLER              PIC  X(01)  VALUE X'F0'.                 
               10  FILLER              PIC  X(02)  VALUE  'F0'.                 
               10  FILLER              PIC  X(01)  VALUE X'F1'.                 
               10  FILLER              PIC  X(02)  VALUE  'F1'.                 
               10  FILLER              PIC  X(01)  VALUE X'F2'.                 
               10  FILLER              PIC  X(02)  VALUE  'F2'.                 
               10  FILLER              PIC  X(01)  VALUE X'F3'.                 
               10  FILLER              PIC  X(02)  VALUE  'F3'.                 
               10  FILLER              PIC  X(01)  VALUE X'F4'.                 
               10  FILLER              PIC  X(02)  VALUE  'F4'.                 
               10  FILLER              PIC  X(01)  VALUE X'F5'.                 
               10  FILLER              PIC  X(02)  VALUE  'F5'.                 
               10  FILLER              PIC  X(01)  VALUE X'F6'.                 
               10  FILLER              PIC  X(02)  VALUE  'F6'.                 
               10  FILLER              PIC  X(01)  VALUE X'F7'.                 
               10  FILLER              PIC  X(02)  VALUE  'F7'.                 
               10  FILLER              PIC  X(01)  VALUE X'F8'.                 
               10  FILLER              PIC  X(02)  VALUE  'F8'.                 
               10  FILLER              PIC  X(01)  VALUE X'F9'.                 
               10  FILLER              PIC  X(02)  VALUE  'F9'.                 
               10  FILLER              PIC  X(01)  VALUE X'FA'.                 
               10  FILLER              PIC  X(02)  VALUE  'FA'.                 
               10  FILLER              PIC  X(01)  VALUE X'FB'.                 
               10  FILLER              PIC  X(02)  VALUE  'FB'.                 
               10  FILLER              PIC  X(01)  VALUE X'FC'.                 
               10  FILLER              PIC  X(02)  VALUE  'FC'.                 
               10  FILLER              PIC  X(01)  VALUE X'FD'.                 
               10  FILLER              PIC  X(02)  VALUE  'FD'.                 
               10  FILLER              PIC  X(01)  VALUE X'FE'.                 
               10  FILLER              PIC  X(02)  VALUE  'FE'.                 
               10  FILLER              PIC  X(01)  VALUE X'FF'.                 
               10  FILLER              PIC  X(02)  VALUE  'FF'.                 
00303      05  FILLER                  REDEFINES                           CL*12
00304                                  HT-HEX-CHAR-TABLE-ENTRIES.          CL*13
00305          10  HT-HEX-CHARACTER-ENTRY                                  CL*12
00306                                  OCCURS 256 TIMES                    CL*12
00307                                  ASCENDING KEY HT-HEX-FIELD          CL*12
00308                                  INDEXED BY HT-HEX-INDEX.            CL*12
00309              15  HT-HEX-FIELD    PIC  X(01).                         CL*12
00310              15  HT-DISPLAY-FIELD                                    CL*12
00311                                  PIC  X(02).                         CL*12
00312                                                                   DPKUT012
00312                                                                   DPKUT012
00313  LINKAGE SECTION.                                                    CL**2
00314  01  LS-LINKAGE-PARAMETER-LIST   PIC  X(63).                         CL**7
00315                                                                      CL**2
00316  PROCEDURE DIVISION USING LS-LINKAGE-PARAMETER-LIST.                 CL**7
00317  0000-MAIN-DRIVER.                                                   CL**2
00318      MOVE LS-LINKAGE-PARAMETER-LIST TO DP012-HEX-PARAMETER-LIST.     CL**7
00319      IF  DP012-LENGTH > ZERO AND < PC-MAX-CONV-LENGTH                CL**2
00320          MOVE DP012-CONVERSION-FIELD                                 CL*14
00321                                     TO PV-CONVERSION-FIELD           CL*14
00322          PERFORM 1000-CONVERT-HEX                                    CL**2
00323          MOVE PV-CONVERTED-FIELD    TO DP012-CONVERTED-FIELD         CL**6
00324          SET DP012-CALL-SUCCESSFUL  TO TRUE                          CL**6
00325      ELSE                                                            CL**2
00326          SET DP012-CALL-IN-ERROR    TO TRUE                          CL*14
00327      END-IF.                                                         CL**2
00328      MOVE DP012-HEX-PARAMETER-LIST  TO LS-LINKAGE-PARAMETER-LIST.    CL**7
00329      GOBACK.                                                         CL**2
00330 ***************************************************************** DPKUT012
00331 **                                                                   CL**2
00332 **                                                                DPKUT012
00333 ***************************************************************** DPKUT012
00334  1000-CONVERT-HEX.                                                   CL**2
00335      PERFORM                                                         CL*14
00336          VARYING PV-CONV-SUB                                         CL**2
00337          FROM 1 BY 1                                                 CL**2
00338          UNTIL PV-CONV-SUB > DP012-LENGTH                            CL*15
00339              SEARCH ALL HT-HEX-CHARACTER-ENTRY                       CL**2
00340                  AT END                                              CL**8
00341                      SET DP012-CALL-IN-ERROR TO TRUE                 CL*14
00342                  WHEN HT-HEX-FIELD (HT-HEX-INDEX)                    CL**2
00343                            = PV-CONVERSION-CHARACTER (PV-CONV-SUB)   CL*14
00344                      MOVE HT-DISPLAY-FIELD (HT-HEX-INDEX)            CL**2
00345                            TO PV-CONVERTED-CHARACTER (PV-CONV-SUB)   CL**5
00346              END-SEARCH                                              CL*14
00347      END-PERFORM.                                                    CL*14
