00001 ******************************************************************02/05/90
00002 *  DB2 CHECKPOINT RESTART SYSTEM - TRANSACTION PRESENTATION      *DPLS001 
00003 *                                  MODULE LINKAGE SECTION.       *   LV001
00004 *                                                                *DPLS001 
00005 *  DATA AREAS USED BY ALL DB2 MAINTENANCE PROGRAMS RUNNING UNDER *DPLS001 
00006 *  THE DB2 CHECKPOINT RESTART SYSTEM TO COMMUNICATE WITH THE     *DPLS001 
00007 *  TRANSACTION PRESENTATION MODULE.                              *DPLS001 
00008 *                                                                *DPLS001 
00009 *  USED AS LINKAGE SECTION BY DPKUT901 AND USED AS WORKING-STOR  *DPLS001 
00010 *  AGE BY ALL DB2 MAINTENANCE PROGRAMS.                          *DPLS001 
00011 *                                                                *DPLS001 
00012 ******************************************************************DPLS001 
00013  01  DP001-TRANS-PRES-PARAMETERS.                                 DPLS001 
00014      05  DP001-REQUEST-PARMS.                                     DPLS001 
00015          10  DP001-FUNC-CODE         PIC  X(05).                  DPLS001 
00016          10  DP001-JOB-NAME          PIC  X(08).                  DPLS001 
00017          10  DP001-PLAN-NAME         PIC  X(08).                  DPLS001 
00018      05  DP001-RETURN-PARMS.                                      DPLS001 
00019          10  DP001-RET-CODE          PIC  9(04).                  DPLS001 
00020              88  DP001-GOOD-RET-CODE                VALUE 0000.   DPLS001 
00021              88  DP001-BAD-SQLCODE                  VALUE 4013.   DPLS001 
00022              88  DP001-JOB-PLAN-DOESNT-EXIST        VALUE 4031.   DPLS001 
00023              88  DP001-INVALID-FUNC-CODE            VALUE 4032.   DPLS001 
00024              88  DP001-PREP-TRANS-NOT-CREATED       VALUE 4033.   DPLS001 
00025              88  DP001-CKPT-CNTLS-IN-USE            VALUE 4034.   DPLS001 
00026              88  DP001-CKPT-TAKEN                   VALUE 4035.   DPLS001 
00027              88  DP001-RESTART                      VALUE 4036.   DPLS001 
00028              88  DP001-BAD-WS-LENGTH                VALUE 4037.   DPLS001 
00029          10  DP001-PREP-TRANS-EOF-IND                             DPLS001 
00030                                      PIC  X(01).                  DPLS001 
00031              88  DP001-PREP-TRANS-EOF               VALUE 'Y'.    DPLS001 
00032          10  DP001-SQLCODE           PIC  S9(09).                 DPLS001 
00033          10  DP001-SQLERRD3          PIC  S9(09).                 DPLS001 
00034          10  DP001-SQLERRMC          PIC  X(70).                  DPLS001 
00035          10  DP001-SQLWARN.                                       DPLS001 
00036              15  DP001-SQLWARN0      PIC  X(01).                  DPLS001 
00037              15  DP001-SQLWARN1      PIC  X(01).                  DPLS001 
00038              15  DP001-SQLWARN2      PIC  X(01).                  DPLS001 
00039              15  DP001-SQLWARN3      PIC  X(01).                  DPLS001 
00040              15  DP001-SQLWARN4      PIC  X(01).                  DPLS001 
00041              15  DP001-SQLWARN5      PIC  X(01).                  DPLS001 
00042              15  DP001-SQLWARN6      PIC  X(01).                  DPLS001 
00043              15  DP001-SQLWARN7      PIC  X(01).                  DPLS001 
00044          10  DP001-MESSAGE           PIC  X(80).                  DPLS001 
00045      05  DP001-WORK-STRG-LENGTH      PIC S9(09)     COMP-3.       DPLS001 
00046                                                                   DPLS001 
00047  01  DP001-TRANS-RECORD              PIC X(2000).                 DPLS001 
00048                                                                   DPLS001 
00049  01  DP001-WORK-STRG-AREA.                                        DPLS001 
