00001 ******************************************************************12/08/89
00002 *  DB2 CHECKPOINT RESTART SYSTEM - TRANSACTION PREPARATION       *DPLS000 
00003 *                                  MODULE LINKAGE SECTION.       *   LV012
00004 *                                                                *   CL**1
00005 *  DATA AREA USED BY ALL DB2 TRANSACTION PREPARATION PROGRAMS TO *   CL**2
00006 *  COMMUNICATE WITH THE TRANSACTION PREPARATION MODULE.          *   CL**2
00007 *                                                                *   CL**1
00008 *  USED AS LINKAGE SECTION BY DPKUT900 AND USED AS WORKING-STOR  *   CL**2
00009 *  AGE BY ALL DB2 TRANSACTION PREPARATION PROGRAMS.              *   CL**2
00010 *                                                                *   CL**1
00011 ******************************************************************   CL**1
00012  01  DP000-TRANS-PREP-PARAMETERS.                                    CL**4
00013      05  DP000-REQUEST-PARMS.                                        CL**3
00014          10  DP000-FUNC-CODE         PIC  X(05).                     CL**3
00015          10  DP000-JOB-NAME          PIC  X(08).                     CL**3
00016          10  DP000-PLAN-NAME         PIC  X(08).                     CL**3
00017      05  DP000-RETURN-PARMS.                                         CL**3
00018          10  DP000-RET-CODE          PIC  9(04).                     CL**4
00019              88  DP000-GOOD-RET-CODE                VALUE 0000.      CL*11
00020              88  DP000-BAD-SQLCODE                  VALUE 4013.      CL*11
00021              88  DP000-JOB-PLAN-DOESNT-EXIST        VALUE 4021.      CL*11
00022              88  DP000-INVALID-FUNC-CODE            VALUE 4022.      CL*12
00023              88  DP000-TRAN-PREP-EXISTS             VALUE 4023.      CL*12
00024              88  DP000-CKPT-CNTLS-IN-USE            VALUE 4024.      CL*12
00025          10  DP000-CKPT-TYPE-CODE    PIC  X(01).                     CL**4
00026          10  DP000-SQLCODE           PIC  S9(09).                    CL*11
00027          10  DP000-SQLERRD3          PIC  S9(09).                    CL*11
00028          10  DP000-SQLERRMC          PIC  X(70).                     CL*11
00029          10  DP000-SQLWARN.                                          CL*12
00030              15  DP000-SQLWARN0      PIC  X(01).                     CL*12
00031              15  DP000-SQLWARN1      PIC  X(01).                     CL*12
00032              15  DP000-SQLWARN2      PIC  X(01).                     CL*12
00033              15  DP000-SQLWARN3      PIC  X(01).                     CL*12
00034              15  DP000-SQLWARN4      PIC  X(01).                     CL*12
00035              15  DP000-SQLWARN5      PIC  X(01).                     CL*12
00036              15  DP000-SQLWARN6      PIC  X(01).                     CL*12
00037              15  DP000-SQLWARN7      PIC  X(01).                     CL*12
00038          10  DP000-MESSAGE           PIC  X(80).                     CL**4
00039      05  DP000-TRANS-RECORD.                                         CL**5
00040          10  DP000-CHECKPOINT-IND    PIC  X(01).                     CL*10
00041          10  DP000-TRANS-REC-LENGTH  PIC  S9(04)    COMP.            CL**5
00042          10  DP000-TRANS-REC.                                        CL**9
00043              15  DP000-TRANS-REC-BYTE                                CL**8
00044                  OCCURS 0 TO 2000 TIMES                              CL**9
00045                  DEPENDING ON DP000-TRANS-REC-LENGTH                 CL**9
00046                                      PIC  X(01).                     CL**6
