00001 ******************************************************************03/07/90
00002 *             DPRD500I  DB2 CHECKPOINT MAINTENANCE LOG FILE      *DPRD500I
00003 *                                                                *   LV004
00004 *  THIS VSAM ESDS FILE CONTAINS A RECORD FOR EVERY SUCCESSFUL    *DPRD500I
00005 *  MAINTENANCE TRANSACTION PROCESSED BY ONLINE TRANSACTION G004  *DPRD500I
00006 *  (PROGRAM DPKCS004).                                           *DPRD500I
00007 *  RECORD LENGTH = 60 BYTES                                      *DPRD500I
00008 ******************************************************************DPRD500I
00009                                                                   DPRD500I
00010  01  DP500I-DB2-CHKPT-MAINT-RECORD.                                  CL**2
00011      05  DP500I-MAINTAINED-DATE.                                     CL**4
00012          10  DP500I-MAINT-YY         PIC X(2)  VALUE SPACES.         CL**4
00013          10  DP500I-MAINT-MM         PIC X(2)  VALUE SPACES.         CL**4
00014          10  DP500I-MAINT-DD         PIC X(2)  VALUE SPACES.         CL**4
00015      05  DP500I-MAINTAINED-TIME.                                     CL**4
00016          10  DP500I-MAINT-HRS        PIC X(2)  VALUE SPACES.         CL**4
00017          10  DP500I-MAINT-MIN        PIC X(2)  VALUE SPACES.         CL**4
00018          10  DP500I-MAINT-SEC        PIC X(2)  VALUE SPACES.         CL**4
00019      05  DP500I-JOB-NAME             PIC X(8)  VALUE SPACES.      DPRD500I
00020      05  DP500I-PLAN-NAME            PIC X(8)  VALUE SPACES.         CL**3
00021      05  DP500I-USER-ID              PIC X(8)  VALUE SPACES.         CL**4
00022      05  DP500I-BEFORE-CHKPT-IMAGE.                               DPRD500I
00023          10  DP500I-BEFORE-STATUS    PIC X(1)  VALUE SPACES.      DPRD500I
00024          10  DP500I-BEFORE-CONTROL   PIC X(1)  VALUE SPACES.      DPRD500I
00025          10  DP500I-BEFORE-TYPE      PIC X(1)  VALUE SPACES.      DPRD500I
00026          10  DP500I-BEFORE-FREQ      PIC S9(5) VALUE +0   COMP-3. DPRD500I
00027      05  DP500I-AFTER-CHKPT-IMAGE.                                DPRD500I
00028          10  DP500I-AFTER-STATUS     PIC X(1)  VALUE SPACES.      DPRD500I
00029          10  DP500I-AFTER-CONTROL    PIC X(1)  VALUE SPACES.      DPRD500I
00030          10  DP500I-AFTER-TYPE       PIC X(1)  VALUE SPACES.      DPRD500I
00031          10  DP500I-AFTER-FREQ       PIC S9(5) VALUE +0   COMP-3. DPRD500I
00032      05  DP500I-FILLER               PIC X(12) VALUE SPACES.      DPRD500I
