00001 ******************************************************************07/22/91
00002 **  THIS IS THE INPUT RECORD DESCRIPTION FOR THE SYSTEM         **DPRD507I
00003 **  MESSAGES FILE USED FOR CICS MESSAGES.                       **   LV001
00004 **                                                              **DPRD507I
00005 **  FORMAT:  VSAM KSDS                                          **DPRD507I
00006 **   LRECL:  75 BYTES                                           **DPRD507I
00007 ******************************************************************DPRD507I
00008  01  DP507I-MESSAGES-INPUT-RECORD.                                DPRD507I
00009      05  DP507I-MSG-NUMBER               PIC  9(05)  VALUE ZERO.  DPRD507I
00010      05  DP507I-MSG-TEXT                 PIC  X(70)  VALUE SPACE. DPRD507I
