00001 ******************************************************************04/26/93
00002 **  THIS IS THE OUTPUT RECORD DESCRIPTION FROM THE DB2 RACF     **DPRD600 
00003 **  USER BASIC DATA TABLE, USED FOR COMPARISON TO HR            **   LV010
00004 **                                                              **   CL**1
00005 **  FORMAT:  SEQUENTIAL                                         **   CL**1
00006 **   LRECL:  102 BYTES                                          **   CL**9
00007 ******************************************************************   CL**1
00008  01  DP600-RACFUSER-RECORD.                                          CL**4
00009      05  DP600-RACFUSER-USERID           PIC  X(8).                  CL**3
00010      05  DP600-RACFUSER-NAME             PIC  X(39).                 CL**3
00011      05  DP600-RACFUSER-SSN              PIC  X(09).                 CL**5
00012      05  DP600-RACFUSER-DEFGRPID         PIC  X(08).                 CL**2
00013      05  DP600-RACFUSER-OWNER            PIC  X(08).                 CL**6
00014      05  DP600-RACFUSER-CATEGORY         PIC  X(08).                 CL**7
00015      05  DP600-RACFUSER-REVOKE           PIC  X(01).                 CL**1
00016          88  DP600-RACFUSER-REVOKED                  VALUE 'Y'.      CL**2
00017          88  DP600-RACFUSER-ACTIVE                   VALUE 'N'.      CL**2
00018      05  DP600-RACFUSER-LASTUSED         PIC  X(10).                 CL**8
00019      05  DP600-RACFUSER-CREADATE         PIC  X(10).                 CL**9
00020      05  DP600-RACFUSER-AGENCY           PIC  X(8).                  CL*10
00021      05  FILLER                          PIC  X(24).                 CL**8
