00001 ******************************************************************04/10/89
00002 *            CROSS REFERENCE CONTROL MEMBER RECORD               *DPRD004O
00003 *                    RL = 28                                     *   LV005
00004 *                    KL = 00                                     *   CL**3
00005 *                    DL = 28                                     *   CL**3
00006 ******************************************************************   CL**3
00007  01  DP004O-RECORD.                                                  CL**5
00008      05  DP004O-CONTROL-NAME     PIC X(08)      VALUE SPACES.        CL**2
00009      05  DP004O-PROGRAM-NAME     PIC X(08)      VALUE SPACES.        CL**2
00010      05  DP004O-TYPE             PIC X(04)      VALUE SPACES.        CL**2
00011      05  DP004O-PLAN-NAME        PIC X(08)      VALUE SPACES.        CL**2
00012                                                                   DPRD004O
