00001 ******************************************************************03/07/90
00002 *             DPRD500O  DB2 CHECKPOINT MAINTENANCE LOG FILE      *DPRD500O
00003 *                                                                *   LV006
00004 *  THIS VSAM ESDS FILE CONTAINS A RECORD FOR EVERY SUCCESSFUL    *DPRD500O
00005 *  MAINTENANCE TRANSACTION PROCESSED BY ONLINE TRANSACTION G004  *DPRD500O
00006 *  (PROGRAM DPKCS004).                                           *DPRD500O
00007 *  RECORD LENGTH = 60 BYTES                                      *DPRD500O
00008 ******************************************************************DPRD500O
00009                                                                   DPRD500O
00010  01  DP500O-DB2-CHKPT-MAINT-RECORD.                                  CL**4
00011      05  DP500O-MAINTAINED-DATE.                                     CL**6
00012          10  DP500O-MAINT-YY         PIC X(2)  VALUE SPACES.         CL**6
00013          10  DP500O-MAINT-MM         PIC X(2)  VALUE SPACES.         CL**6
00014          10  DP500O-MAINT-DD         PIC X(2)  VALUE SPACES.         CL**6
00015      05  DP500O-MAINTAINED-TIME.                                     CL**6
00016          10  DP500O-MAINT-HRS        PIC X(2)  VALUE SPACES.         CL**6
00017          10  DP500O-MAINT-MIN        PIC X(2)  VALUE SPACES.         CL**6
00018          10  DP500O-MAINT-SEC        PIC X(2)  VALUE SPACES.         CL**6
00019      05  DP500O-JOB-NAME             PIC X(8)  VALUE SPACES.      DPRD500O
00020      05  DP500O-PLAN-NAME            PIC X(8)  VALUE SPACES.         CL**5
00021      05  DP500O-USER-ID              PIC X(8)  VALUE SPACES.         CL**6
00022      05  DP500O-BEFORE-CHKPT-IMAGE.                               DPRD500O
00023          10  DP500O-BEFORE-STATUS    PIC X(1)  VALUE SPACES.      DPRD500O
00024          10  DP500O-BEFORE-CONTROL   PIC X(1)  VALUE SPACES.      DPRD500O
00025          10  DP500O-BEFORE-TYPE      PIC X(1)  VALUE SPACES.      DPRD500O
00026          10  DP500O-BEFORE-FREQ      PIC S9(5) VALUE +0   COMP-3. DPRD500O
00027      05  DP500O-AFTER-CHKPT-IMAGE.                                DPRD500O
00028          10  DP500O-AFTER-STATUS     PIC X(1)  VALUE SPACES.      DPRD500O
00029          10  DP500O-AFTER-CONTROL    PIC X(1)  VALUE SPACES.      DPRD500O
00030          10  DP500O-AFTER-TYPE       PIC X(1)  VALUE SPACES.      DPRD500O
00031          10  DP500O-AFTER-FREQ       PIC S9(5) VALUE +0   COMP-3. DPRD500O
00032      05  DP500O-FILLER               PIC X(12) VALUE SPACES.         CL**2
