00001 ******************************************************************04/10/89
00002 *           CROSS REFERENCE IEBPTPCH RECORD                      *DPRD003I
00003 *                    RL = 81                                     *   LV005
00004 *                    KL = 00                                     *   CL**3
00005 *                    DL = 81                                     *   CL**3
00006 ******************************************************************   CL**3
00007  01  DP003I-CONTROL-IEBPTPCH-RECORD.                                 CL**4
00008      05  DP003I-MACHINE-CHAR     PIC X(01)      VALUE SPACES.        CL**2
00009      05  DP003I-CONTROL-LINE     PIC X(80)      VALUE SPACES.        CL**2
00010      05  FILLER  REDEFINES  DP003I-CONTROL-LINE.                     CL**2
00011          10  DP003I-MEMBER-NAME  PIC X(11).                          CL**2
00012          10  FILLER              PIC X(02).                       DPRD003I
00013          10  DP003I-CONTROL-NAME PIC X(08).                          CL**2
00014          10  FILLER              PIC X(59).                       DPRD003I
00015                                                                   DPRD003I
