000100******************************************************************00010000
000200**  THIS IS THE RECORD DESCRIPTION USED BY THE CICS ARCHITECTURE**00020000
000300**  TO SAVE THE APPLICATION COMMAREA AS NAVIGATION AND STACKING **00030000
000400**  IS DONE. THE RECORD IS CALCULATED AS THE APPLICATION        **00040000
000500**  SPECIFIC COMMAREA LENGTH (DP020-APPL-COMMAREA-LENGTH) PLUS  **00050000
000600**  30 BYTES  (KEY= 15 BYTES, DATE/TIME= 14 BYTES, PGM= 1 BYTE) **00060004
000700**                                                              **00070000
000800** SOURCE OF FIELDS:                                            **00080000
000900**  DP515-NETNAME               DP020-NETNAME                   **00090000
001000**  DP515-TASK-NUMBER           DP020-TASK-NUMBER               **00100000
001100**  DP515-CREATE-EIBDATE        EIBDATE                         **00110000
001200**  DP515-CREATE-EIBTIME        EIBTIME                         **00120000
001210**  DP515-CREATE-PGM            7=DPKCS007, 8=DPKCS008          **00121002
001300**  DP515-APPL-COMMAREA         DP020-APPL-COMM-AREA            **00130000
001400**                                                              **00140000
001500**  FORMAT:  VSAM KSDS                                          **00150000
001600**   LRECL:  (VARIABLE) 3000 BYTES MAXIMUM                      **00160000
001700******************************************************************00170000
001800 01  DP515-SAVED-COMMAREA-RECORD.                                 00180000
001900     05  DP515-KEY.                                               00190000
002000         10  DP515-NETNAME.                                       00200000
002100             15  DP515-LINE-ADDR       PIC  X(02)  VALUE SPACE.   00210000
002200             15  DP515-PHYSICAL-UNIT-ADDR                         00220000
002300                                       PIC  X(02)  VALUE SPACE.   00230000
002400             15  DP515-TERM-ID         PIC  X(04)  VALUE SPACE.   00240000
002500         10  DP515-TASK-NUMBER         PIC  9(07)  VALUE ZERO.    00250000
002620     05  DP515-CREATE-EIBDATE          PIC  9(07)  VALUE ZERO.    00262005
002901     05  DP515-CREATE-EIBTIME          PIC  9(07)  VALUE ZERO.    00290105
002902     05  DP515-CREATE-PGM              PIC  X(01)  VALUE SPACE.   00290205
002903         88  DP515-CREATE-PGM-DPKCS007             VALUE '7'.     00290305
002904         88  DP515-CREATE-PGM-DPKCS008             VALUE '8'.     00290405
003000     05  DP515-APPL-COMMAREA           PIC  X(2865)               00300000
003100                                                   VALUE SPACE.   00310000
