00001 ******************************************************************04/11/89
00002 *           CROSS REFERENCE FILE CONTROL RECORD                  *DPRD007O
00003 *                    RL = 83                                     *   LV003
00004 *                    KL = 00                                     *DPRD007O
00005 *                    DL = 83                                     *DPRD007O
00006 ******************************************************************DPRD007O
00007  01  DP007O-RECORD.                                                  CL**2
00008      05  DP007O-FILE-NAME        PIC X(44)      VALUE SPACES.        CL**2
00009      05  DP007O-TYPE-CODE        PIC X(04)      VALUE SPACES.        CL**2
00010      05  DP007O-MEDIA-CODE       PIC X(01)      VALUE SPACES.        CL**2
00011      05  DP007O-RECL-NUMBER      PIC S9(05)     VALUE ZERO COMP-3.   CL**3
00012      05  DP007O-ALLOC-DESC       PIC X(30)      VALUE SPACES.        CL**2
00013      05  DP007O-MTLVOL-CODE      PIC X(01)      VALUE SPACES.        CL**2
