      ******************************************************************        
      **  THIS IS THE RECORD DESCRIPTION FOR THE MNEMONIC             **        
      **  FILE USED TO GET SPECIFIC CALL DATA ASSOCIATED WITH A       **        
      **  MNEMONIC 'FAST-PATH' REQUEST MADE IN CICS.                  **        
      **                                                              **        
      **  FORMAT:  VSAM KSDS                                          **        
      **   LRECL:  850 BYTES                                          **        
      ******************************************************************        
       01  DP503-MNEMONIC-RECORD.                                               
           05  DP503-MNEMONIC                  PIC  X(08)  VALUE SPACE.         
           05  DP503-TRAN-ID                   PIC  X(04)  VALUE SPACE.         
           05  DP503-GLOBAL-ACCESS-IND         PIC  X(01)  VALUE 'N'.           
               88  DP503-GLOBAL-ACCESS                     VALUE 'Y'.           
               88  DP503-LIMITED-ACCESS                    VALUE 'N'.           
           05  DP503-TRAN-AVAILABLE-SW         PIC  X(01)  VALUE 'N'.           
               88  DP503-TRAN-AVAILABLE                    VALUE 'Y'.           
               88  DP503-TRAN-NOT-AVAILABLE                VALUE 'N'.           
           05  DP503-COMMAREA-FORMAT           PIC  X(01)  VALUE 'N'.           
               88  DP503-COMMAREA-STANDARD                 VALUE 'K'.           
               88  DP503-COMMAREA-NOT-STANDARD             VALUE 'N'.           
           05  DP503-COMMAREA-VERSION          PIC  X(01)  VALUE SPACE.         
           05  DP503-APPL-COMMAREA-LENGTH      PIC S9(04)  VALUE ZERO           
                                                           COMP.                
           05  DP503-SAVE-COMMAREA-SW          PIC  X(01)  VALUE 'N'.           
               88  DP503-SAVE-COMMAREA                     VALUE 'Y'.           
               88  DP503-DONT-SAVE-COMMAREA                VALUE 'N'.           
           05  DP503-PANEL-TITLE               PIC  X(30)  VALUE SPACE.         
           05  DP503-FUNCTION-KEY-ARRAY.                                        
               10  DP503-FUNCTION-KEY          OCCURS 29                        
                                               INDEXED BY                       
                                                   DP503-FK-INDEX.              
                   15  DP503-FK-ACTION         PIC  X(01).                      
                       88  DP503-FK-GO-TO-TRAN             VALUE '1'.           
                       88  DP503-FK-RETURN                 VALUE '2'.           
                       88  DP503-FK-CONFIRM                VALUE '3'.           
                       88  DP503-FK-REFRESH                VALUE '4'.           
                       88  DP503-FK-PREV-PAGE              VALUE '5'.           
                       88  DP503-FK-NEXT-PAGE              VALUE '6'.           
                       88  DP503-FK-FIRST-PAGE             VALUE '7'.           
                       88  DP503-FK-LOCAL-KEY              VALUE '8'.           
                       88  DP503-FK-DESELECT               VALUE '9'.           
                       88  DP503-FK-SELECT-ALL             VALUE 'A'.           
                       88  DP503-FK-EDIT-GOTO              VALUE 'B'.           
                   15  DP503-FK-TRAN-ID        PIC  X(04).                      
                   15  DP503-FK-MNEMONIC       PIC  X(08).                      
                   15  DP503-FK-LABEL          PIC  X(08).                      
                   15  DP503-FK-ALT-LABEL-IND PIC   X(01).                      
                       88  DP503-FK-ALT-LABEL              VALUE 'Y'.           
                       88  DP503-FK-NOT-ALT-LABEL          VALUE 'N'.           
                   15  DP503-FK-STACK-IND      PIC  X(01).                      
                       88  DP503-FK-STACK                  VALUE 'Y'.           
                       88  DP503-FK-DONT-STACK             VALUE 'N'.           
                   15  DP503-FK-INT-APPL-FORMAT-IND                             
                                               PIC  X(01).                      
                   15  DP503-FK-DISPN-IND      PIC  X(01).                      
                   15  FILLER                  PIC  X(02).                      
           05  DP503-DB2-PKG-IND               PIC  X(01)  VALUE SPACE.         
           05  DP503-ACRT-LOC-REQR-IND         PIC  X(01)  VALUE SPACE.         
               88  DP503-ACRT-LOC-REQR                     VALUE 'Y'.           
               88  DP503-ACRT-LOC-NOT-REQR                 VALUE 'N',           
                                                                 ' '.           
           05  FILLER                          PIC  X(16)  VALUE SPACE.         
