00001 ******************************************************************06/05/91
00002 **  THIS IS THE OUTPUT RECORD DESCRIPTION FOR THE SYSTEM        **DPRD507O
00003 **  MESSAGES FILE USED FOR CICS MESSAGES.                       **   LV002
00004 **                                                              **   CL**1
00005 **  FORMAT:  VSAM KSDS                                          **   CL**1
00006 **   LRECL:  75 BYTES                                           **   CL**1
00007 ******************************************************************   CL**1
00008  01  DP507O-MESSAGES-OUTPUT-RECORD.                                  CL**2
00009      05  DP507O-MSG-NUMBER               PIC  9(05)  VALUE ZERO.     CL**2
00010      05  DP507O-MSG-TEXT                 PIC  X(70)  VALUE SPACE.    CL**2
