00001 ******************************************************************04/10/89
00002 *           CROSS REFERENCE FILE CONTROL RECORD                  *DPRD006O
00003 *                    RL = 60                                     *   LV002
00004 *                    KL = 00                                     *   CL**2
00005 *                    DL = 60                                     *   CL**2
00006 ******************************************************************   CL**2
00007  01  DP006O-RECORD.                                                  CL**2
00008      05  DP006O-PROC-STEP.                                           CL**2
00009          10  DP006O-PROCNAME     PIC X(08)      VALUE SPACES.        CL**2
00010          10  DP006O-STEPNAME     PIC X(08)      VALUE SPACES.        CL**2
00011      05  DP006O-FILE-NAME        PIC X(44)      VALUE SPACES.        CL**2
