      *****************************************************************         
      **                                                             **         
      ** DPRD502 CONTAINS THE INFORMATION NEEDED TO BACKOUT A        **         
      ** MNEMONIC PROMOTE.  NUMERIC VALUES ARE ASSIGNED TO TABLE AND **         
      ** BACKOUT ACTION SO THAT THE RECORDS CAN BE SORTED AND THEN   **         
      ** PROCESSED IN THE CORRECT ORDER.                             **         
      **                                                             **         
      *****************************************************************         
       01  DP502-BACKOUT-RECORD.                                                
           05  DP502-TABLE           PIC 9(001)  VALUE ZERO.                    
               88  DP502-MNEMONIC                VALUE 1.                       
               88  DP502-MENUITEM                VALUE 2.                       
               88  DP502-CICSROUTE               VALUE 3.                       
           05  DP502-BACKOUT-ACTION  PIC 9(001)  VALUE ZERO.                    
               88  DP502-CHANGE                  VALUE 1.                       
               88  DP502-DELETE                  VALUE 2.                       
               88  DP502-ADD                     VALUE 3.                       
           05  DP502-BACKOUT-DATA    PIC X(198)  VALUE SPACES.                  
