00001 ****************************************************************  04/02/92
00002 *  THESE ARE THE REQUIRED VARIABLES FOR THE ROUTINE DPPD019   **  DPWS025 
00003 *  WHICH PERFORMS VALIDATION EDITS ON ALPHA FIELDS            **     LV001
00004 *  REFER TO THE ROUTINE DPPD019 FOR FURTHER DETAILS           **  DPWS025 
00005 ****************************************************************  DPWS025 
00006  01  DP019-WORK-AREA.                                             DPWS025 
00007                                                                   DPWS025 
00008      05  DP019-FLD-LENGTH               PIC S9(03)                DPWS025 
00009                                         COMP-3      VALUE 0.      DPWS025 
00010      05  DP019-IN-FLD.                                            DPWS025 
00011          10  DP019-FLD-IN               OCCURS 1 TO 99 TIMES      DPWS025 
00012                                         DEPENDING ON              DPWS025 
00013                                         DP019-FLD-LENGTH.         DPWS025 
00014              15  DP019-FLD-IN-X         PIC X(01).                DPWS025 
00015                                                                   DPWS025 
00016      05  DP019-IN-FLD-INDEX             PIC S9(03)  COMP-3.       DPWS025 
00017                                                                   DPWS025 
00018      05  DP019-OUT-FLD.                                           DPWS025 
00019          10  DP019-FLD-OUT              OCCURS 1 TO 99 TIMES      DPWS025 
00020                                         DEPENDING ON              DPWS025 
00021                                         DP019-FLD-LENGTH.         DPWS025 
00022              15  DP019-FLD-OUT-X        PIC X(01).                DPWS025 
00023                                                                   DPWS025 
00024      05  DP019-TEST-BYTE                PIC X(01).                DPWS025 
00025          88  DP019-INVALID-CHARACTER       VALUES                 DPWS025 
00026              '`', '~', '|', '@', '#', '$', '%',                   DPWS025 
00027              '^', '&', '(', ')', '_', '=', '+',                   DPWS025 
00028              '›', '!', 'º', '\', '/', ':', ';',                   DPWS025 
00029              '?', '{', '}', '<', '>', '!'.                        DPWS025 
00030 *            ** REPRESENT A DOUBLE QUOTE HOW?  ( ' " ' )          DPWS025 
00031          88  DP019-SINGLE-QUOTE            VALUE '"'.             DPWS025 
00032          88  DP019-VALID-CHARACTER         VALUES                    CL**2
00033              'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J',       CL**2
00034              'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T',       CL**2
00035              'U', 'V', 'W', 'X', 'Y', 'Z',                           CL**2
00036              '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',       CL**2
00037              '"', '-', ' '.                                          CL**2
00038                                                                   DPWS025 
00039      05  DP019-OUT-FLD-INDEX            PIC S9(03)  COMP-3.       DPWS025 
00040                                                                   DPWS025 
00041      05  DP019-TEMP-INDEX               PIC S9(03)  COMP-3.       DPWS025 
00042                                                                   DPWS025 
00043                                                                   DPWS025 
00044      05  DP019-INSPECT-CTR              PIC S9(03)  COMP-3.       DPWS025 
00045                                                                   DPWS025 
00046      05  DP019-REMAINDER                PIC S9(03)  COMP-3.       DPWS025 
00047                                                                   DPWS025 
00048      05  DP019-ERROR-CODES.                                       DPWS025 
00049          10  DP019-ERROR-SW            PIC X(01).                 DPWS025 
00050              88 DP019-ERROR                          VALUE 'Y'.   DPWS025 
00051              88 DP019-NO-ERROR                       VALUE 'N'.   DPWS025 
00052          10  FILLER                    PIC X(01).                 DPWS025 
00053              88 DP019-ALL-SPACES                     VALUE 'Y'.   DPWS025 
00054          10  FILLER                    PIC X(01).                 DPWS025 
00055              88 DP019-ASTERISK-WILDCARD-USED         VALUE 'Y'.   DPWS025 
00056          10  FILLER                    PIC X(01).                 DPWS025 
00057              88 DP019-GT-1BLANK-BETWEEN              VALUE 'Y'.   DPWS025 
00058          10  FILLER                    PIC X(01).                 DPWS025 
00059              88 DP019-ALL-NUMERIC                    VALUE 'Y'.   DPWS025 
00060          10  FILLER                    PIC X(01).                 DPWS025 
00061              88 DP019-INVALID-CHAR                   VALUE 'Y'.   DPWS025 
00062                                                                   DPWS025 
00063      05  DP019-BEGINNING-SW             PIC X(01).                DPWS025 
00064          88  DP019-BEGINNING                         VALUE 'Y'.   DPWS025 
00065          88  DP019-NOT-BEGINNING                     VALUE 'N'.   DPWS025 
00066                                                                   DPWS025 
00067      05  DP019-END-OF-FLD-SW            PIC X(01).                DPWS025 
00068          88  DP019-END-OF-FLD                        VALUE 'Y'.   DPWS025 
00069          88  DP019-NOT-END-OF-FLD                    VALUE 'N'.   DPWS025 
00070                                                                   DPWS025 
00071      05  DP019-LEFT-JUSTIFIED-SW        PIC X(01).                DPWS025 
00072          88  DP019-LEFT-JUSTIFIED                    VALUE 'Y'.   DPWS025 
00073                                                                   DPWS025 
