00001  01  DP133-STANDRD-HEADER-133-COLS.                               04/12/90
00002      05  DP133-LASER-NEW-PAGE-INDICATR     PIC X(02) VALUE SPACE. DPWS133O
00003      05  DP133-RUN-DATE.                                             LV003
00004          10  DP133-RUN-MONTH               PIC 9(02) VALUE ZERO.     CL**1
00005          10  FILLER                        PIC X(01) VALUE '/'.      CL**1
00006          10  DP133-RUN-DAY                 PIC 9(02) VALUE ZERO.     CL**1
00007          10  FILLER                        PIC X(01) VALUE '/'.      CL**1
00008          10  DP133-RUN-YEAR                PIC 9(04) VALUE ZERO.     CL**1
00009      05  FILLER                            PIC X(02) VALUE SPACE.    CL**1
00010      05  DP133-RUN-TIME.                                             CL**1
00011          10  DP133-RUN-HOUR                PIC 9(02) VALUE ZERO.     CL**1
00012          10  FILLER                        PIC X(01) VALUE ':'.      CL**1
00013          10  DP133-RUN-MINUTE              PIC 9(02) VALUE ZERO.     CL**1
00014      05  FILLER                            PIC X(25) VALUE SPACE.    CL**1
00015      05  FILLER                            PIC X(45)                 CL**1
00016          VALUE 'K O H L S   D E P A R T M E N T   S T O R E S'.      CL**1
00017      05  FILLER                            PIC X(21) VALUE SPACE.    CL**1
00018      05  DP133-PROGRAM-NAME                PIC X(08) VALUE SPACE.    CL**1
00019      05  FILLER                            PIC X(01) VALUE '-'.      CL**1
00020      05  DP133-REPORT-NUMBER               PIC 9(01) VALUE ZERO.     CL**1
00021      05  FILLER                            PIC X(02) VALUE SPACE.    CL**1
00022      05  FILLER                            PIC X(05) VALUE 'PAGE'.   CL**1
00023      05  DP133-PAGE-NUMBER                 PIC ZZZZ9 VALUE ZERO.     CL**1
00024      05  DP133-FONT-INDICATOR              PIC 9     VALUE  1.       CL**3
