000010******************************************************************01/26/96
000020**                   DPWS402                                    **DPWS402 
000030**                                                              **   LV001
000040**  THIS COPYBOOK CONTAINS THE WORKING-STORAGE ELEMENTS         **        
000050**  REQUIRED BY THE GET ORACLE TABLE INFO SUBROUTINE (DPKUT402).**        
000070******************************************************************        
000080 01  DP402-PARAMETERS.                                                    
000090     05  DP402-INPUT-PARMS.                                               
000100         10  DP402-FUNCTION-CODE         PIC   X(1).                      
000130             88  DP402-SELECT-POHEAD-INFO            VALUE 'H'.           
000130             88  DP402-GET-STRCONST-AUTH             VALUE 'A'.           
000140         10  DP402-PO-NBR                PIC  S9(10) COMP-3.              
000140         10  DP402-USERID                PIC   X(08).                     
000140         10  DP402-CICS-REGION-IND       PIC   X(01).                     
000130             88  DP402-CICS-REGION-PRODUCTION        VALUE 'P'.           
000130             88  DP402-CICS-REGION-TEST              VALUE 'T'.           
000140         10  FILLER                      PIC   X(20).                     
000090     05  DP402-OUTPUT-PARMS.                                              
000140         10  DP402-ENT-ID                PIC  S9(10) COMP-3.              
000150*            -- THE ENTERPRISE ID OF THE PO --                            
000310     05  DP402-SQLCODE                   PIC  S9(9)  COMP.                
000320     05  DP402-ERROR-MESSAGE             PIC  X(79).                      
000320     05  DP402-SQLCA                     PIC  X(136).                     
000330     05  DP402-RETURN-CODE               PIC  9(01).                      
000340         88  DP402-SUCCESSFUL-CALL                   VALUE 0.             
000350         88  DP402-ROW-NOT-FOUND                     VALUE 1.             
000350         88  DP402-ERROR-CALL                        VALUE 2.             
