000100******************************************************************        
000200**                        DPWS251                               **        
000300**                                                              **        
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR PHYSICAL  **        
000500**  UNIT MAINTENANCE.                                           **        
000600**  LENGTH:  200 BYTES                                          **        
000700******************************************************************        
000800         10  DP251-INTER-APPL-COMMAREA  REDEFINES                         
000900             INTER-APPL-COMM-AREA.                                        
001000             15  FILLER                         PIC X(01).                
001100             15  DP251-NUMBER-OF-SELECTED-ITEMS PIC S9(09)                
001200                                                    COMP-3.               
001300             15  DP251-NUMBER-OF-TS-ITEMS       PIC S9(05)                
001400                                                    COMP-3.               
001500             15  DP251-SEL-QUEUE-NAME           PIC X(8).                 
001600             15  FILLER                         PIC X(183).               
