00001  01  DP250O-STANDRD-HEADER-250-COLS.                              06/24/03
00002      05  DP250O-LASER-NEW-PAGE-INDICATR    PIC X(02) VALUE SPACE. DPWS250O
00003      05  DP250O-RUN-DATE.                                            LV003
00004          10  DP250O-RUN-MONTH              PIC 9(02) VALUE ZERO.  DPWS250O
00005          10  FILLER                        PIC X(01) VALUE '/'.   DPWS250O
00006          10  DP250O-RUN-DAY                PIC 9(02) VALUE ZERO.  DPWS250O
00007          10  FILLER                        PIC X(01) VALUE '/'.   DPWS250O
00008          10  DP250O-RUN-YEAR               PIC 9(02) VALUE ZERO.  DPWS250O
00009      05  FILLER                            PIC X(02) VALUE SPACE. DPWS250O
00010      05  DP250O-RUN-TIME.                                         DPWS250O
00011          10  DP250O-RUN-HOUR               PIC 9(02) VALUE ZERO.  DPWS250O
00012          10  FILLER                        PIC X(01) VALUE ':'.   DPWS250O
00013          10  DP250O-RUN-MINUTE             PIC 9(02) VALUE ZERO.  DPWS250O
00014      05  FILLER                            PIC X(86) VALUE SPACE. DPWS250O
00015      05  FILLER                            PIC X(45)              DPWS250O
00016          VALUE 'K O H L S   D E P A R T M E N T   S T O R E S'.   DPWS250O
00017      05  FILLER                            PIC X(80) VALUE SPACE. DPWS250O
00018      05  DP250O-PROGRAM-NAME               PIC X(08) VALUE SPACE. DPWS250O
00019      05  FILLER                            PIC X(01) VALUE '-'.   DPWS250O
00020      05  DP250O-REPORT-NUMBER              PIC 9(01) VALUE ZERO.  DPWS250O
00021      05  FILLER                            PIC X(02) VALUE SPACE. DPWS250O
00022      05  FILLER                            PIC X(05) VALUE 'PAGE'.DPWS250O
00023      05  DP250O-PAGE-NUMBER                PIC ZZZZ9 VALUE ZERO.  DPWS250O
00024                                                                      CL**2
00025  01  DP250O-CNFDL-HDR-250-COLS.                                      CL**2
00026      05  FILLER                            PIC X(98) VALUE SPACE.    CL**2
00027      05  DP250O-CNFDL-MSG-54-COLS.                                   CL**2
00028          10  FILLER                        PIC X(05)                 CL**2
00029                                                    VALUE '**** '.    CL**2
00030          10  DP250O-CNFDL-MSG-44-COLS      PIC X(44) VALUE           CL**2
00031                   'CONFIDENTIAL - NOT TO BE COPIED OR DISCLOSED'.    CL**2
00032          10  FILLER                        PIC X(05)                 CL**2
00033                                                    VALUE ' ****'.    CL**3
00034      05  FILLER                            PIC X(98) VALUE SPACE.    CL**2
00035                                                                      CL**2
