000100******************************************************************00010000
000200*  PARAMETER LIST FOR THE EBCDIC-ASCII CONVERSION SUBROUTINE.     00020000
000520*                                                                 00030000
000600*  USE "DP053-EBCDIC-ASCII-ROUTINE" AS THE VARIABLE FOR THE       00040000
000700*  SUBROUTINE NAME FOR ALL DYNAMIC CALLS.                         00050000
000701*                                                                 00060000
000702*  CALL DP053-EBCDIC-ASCII-ROUTINE USING DP053-CONVERSION-TYPE    00070000
000703*                                        DP053-FIELD-LENGTH       00070100
000705*                                        DP053-INPUT-FIELD        00070300
000706*                                        DP053-OUTPUT-FIELD       00070400
000707*                                        DP053-RETURN-CODE.       00070500
000710******************************************************************00070600
000800                                                                  00070700
000900 01  DP053-EBCDIC-ASCII-ROUTINE  PIC X(8)     VALUE 'DPKUT052'.   00070800
001000                                                                  00070900
014700 01  DP053-EBCDIC-ASCII-PARMS.                                    00071000
014800     05  DP053-CONVERSION-TYPE   PIC X(1)     VALUE SPACES.       00072000
014810         88  DP053-CT-EBCDIC-TO-ASCII         VALUE '1'.          00073000
014811         88  DP053-CT-ASCII-TO-EBCDIC         VALUE '2'.          00074000
014821     05  DP053-FIELD-LENGTH      PIC S9(3)    VALUE ZEROS         00075000
014822                                              COMP-3.             00076000
014823     05  DP053-INPUT-FIELD       PIC X(50)    VALUE SPACES.       00077000
014824     05  FILLER                  PIC X(250)   VALUE SPACES.       00078000
014825     05  DP053-OUTPUT-FIELD      PIC X(50)    VALUE SPACES.       00079000
014826     05  FILLER                  PIC X(250)   VALUE SPACES.       00080000
014828     05  DP053-RETURN-CODE       PIC X(2)     VALUE '00'.         00090000
014829         88  DP053-RC-SUCCESSFUL              VALUE '00'.         00100000
014830         88  DP053-RC-INVALID-LENGTH          VALUE '04'.         00110000
014840         88  DP053-RC-INVALID-CONV-TYPE       VALUE '08'.         00120000
014850         88  DP053-RC-CHARACTER-NOT-FOUND     VALUE '12'.         00130000
