      ****************************************************************  00010002
      * DPWS036                                                         00020002
      ****************************************************************  00030002
206118* 08/20/18  CHG0206118  RENAMED FROM CGU042MC WHICH DID NOT       00040002
206118*                       MEET STANDARDS FOR MAINFRAME REFACTORING  00050002
      ****************************************************************  00060002
000100*     BEGIN DPWS036                                               00070001
000200*     WORKING STORAGE DATA FOR MOD 10 CHECKDIGIT ROUTINE DPPD036  00080002
000300*                                                                 00090000
000400 01  BASE-NUMBER             PIC 9(18)   VALUE 0.                 00100000
000500 01  BASE-NUMBER-RED REDEFINES BASE-NUMBER.                       00110000
000600     02  BASE-DIGIT          PIC 9   OCCURS 18 TIMES INDEXED CD-X.00120000
000700 01  NO-DIGITS               PIC 9(2)    VALUE 18.                00130000
000800 01  CHECK-DIGIT             PIC 9       VALUE 0.                 00140000
000900*     END DPWS036                                                 00150001
