00001  01  DP150O-STANDRD-HEADER-150-COLS.                              12/03/92
00002      05  DP150O-LASER-NEW-PAGE-INDICATR    PIC X(02) VALUE SPACE. DPWS150O
00003      05  DP150O-RUN-DATE.                                            LV001
00004          10  DP150O-RUN-MONTH              PIC 9(02) VALUE ZERO.  DPWS150O
00005          10  FILLER                        PIC X(01) VALUE '/'.   DPWS150O
00006          10  DP150O-RUN-DAY                PIC 9(02) VALUE ZERO.  DPWS150O
00007          10  FILLER                        PIC X(01) VALUE '/'.   DPWS150O
00008          10  DP150O-RUN-YEAR               PIC 9(02) VALUE ZERO.  DPWS150O
00009      05  FILLER                            PIC X(02) VALUE SPACE. DPWS150O
00010      05  DP150O-RUN-TIME.                                         DPWS150O
00011          10  DP150O-RUN-HOUR               PIC 9(02) VALUE ZERO.  DPWS150O
00012          10  FILLER                        PIC X(01) VALUE ':'.   DPWS150O
00013          10  DP150O-RUN-MINUTE             PIC 9(02) VALUE ZERO.  DPWS150O
00014      05  FILLER                            PIC X(36) VALUE SPACE. DPWS150O
00015      05  FILLER                            PIC X(45)              DPWS150O
00016          VALUE 'K O H L S   D E P A R T M E N T   S T O R E S'.   DPWS150O
00017      05  FILLER                            PIC X(30) VALUE SPACE. DPWS150O
00018      05  DP150O-PROGRAM-NAME               PIC X(08) VALUE SPACE. DPWS150O
00019      05  FILLER                            PIC X(01) VALUE '-'.   DPWS150O
00020      05  DP150O-REPORT-NUMBER              PIC 9(01) VALUE ZERO.  DPWS150O
W26603     05  DP150O-REPORT-NUMBER-CHAR REDEFINES                              
00020          DP150O-REPORT-NUMBER              PIC X(01).                     
00021      05  FILLER                            PIC X(02) VALUE SPACE. DPWS150O
00022      05  FILLER                            PIC X(05) VALUE 'PAGE'.DPWS150O
00023      05  DP150O-PAGE-NUMBER                PIC ZZZZ9 VALUE ZERO.  DPWS150O
00024                                                                   DPWS150O
00025  01  DP150O-CNFDL-HDR-150-COLS.                                   DPWS150O
00026      05  FILLER                            PIC X(48) VALUE SPACE. DPWS150O
00027      05  DP150O-CNFDL-MSG-54-COLS.                                DPWS150O
00028          10  FILLER                        PIC X(05)              DPWS150O
00029                                                    VALUE '**** '. DPWS150O
00030          10  DP150O-CNFDL-MSG-44-COLS      PIC X(44) VALUE        DPWS150O
00031                   'CONFIDENTIAL - NOT TO BE COPIED OR DISCLOSED'. DPWS150O
00032          10  FILLER                        PIC X(05)              DPWS150O
00033                                                    VALUE ' ****'. DPWS150O
00034      05  FILLER                            PIC X(48) VALUE SPACE. DPWS150O
00035                                                                   DPWS150O
