00001 ******************************************************************09/27/93
00002 ** THIS COPYBOOK CONTAINS THE CALLING PARAMETERS USED TO        **DPWS030 
00003 ** COMMUNICATE TO THE CICS ARCHITECTURE APPLICATION PROGRAMMING **   LV002
00004 ** INTERFACE MODULE, DPKCS030.                                  **DPWS030 
00005 ******************************************************************DPWS030 
00006  01  DP030-CICS-API-FIELDS.                                       DPWS030 
00007      05  DP030-LOCAL-GO-OVERRIDE-SW       PIC  X(01).             DPWS030 
00008          88  DP030-CONTINUE-GO                        VALUE ' '.  DPWS030 
00009          88  DP030-OVERRIDE-GO                        VALUE 'Y'.  DPWS030 
00010      05  DP030-NUMBER-OF-MAPS             PIC S9(04)  COMP.       DPWS030 
00011      05  DP030-MAPSET-NAME                PIC  X(08).             DPWS030 
00012      05  DP030-RECEIVE-APPL-MAP-SW        PIC  X(01).             DPWS030 
00013          88  DP030-RECEIVE-APPL-MAP                   VALUE ' '.  DPWS030 
00014          88  DP030-DONT-RECEIVE-APPL-MAP              VALUE 'N'.  DPWS030 
00015      05  DP030-MAP-TABLE.                                         DPWS030 
00016          10  DP030-MAP-SEND-PARAMETERS    OCCURS 6 TIMES          DPWS030 
00017                                           INDEXED BY              DPWS030 
00018                                           DP030-MAP-INDEX.        DPWS030 
00019              15  DP030-MAP-NAME           PIC  X(08).             DPWS030 
00020              15  DP030-MAP-LENGTH         PIC S9(04)  COMP.       DPWS030 
00021              15  DP030-SEND-TYPE-IND      PIC  X(01).             DPWS030 
00022                  88  DP030-DONT-SEND                  VALUE ' '.  DPWS030 
00023                  88  DP030-SEND-DATAONLY              VALUE 'D'.  DPWS030 
00024                  88  DP030-SEND-MAPONLY               VALUE 'M'.  DPWS030 
00025                  88  DP030-SEND-MAP-AND-DATA          VALUE 'B'.  DPWS030 
00026              15  FILLER                   PIC  X(03).             DPWS030 
00027      05  DP030-SEND-PARAMETERS.                                   DPWS030 
00028          10  DP030-SET-CURSOR-MAP-IND     PIC  X(01).             DPWS030 
00029              88  DP030-SET-CURSOR-APPL-1              VALUE '1'.  DPWS030 
00030              88  DP030-SET-CURSOR-APPL-2              VALUE '2'.  DPWS030 
00031              88  DP030-SET-CURSOR-APPL-3              VALUE '3'.  DPWS030 
00032              88  DP030-SET-CURSOR-APPL-4              VALUE '4'.  DPWS030 
00033              88  DP030-SET-CURSOR-APPL-5              VALUE '5'.  DPWS030 
00034              88  DP030-SET-CURSOR-APPL-6              VALUE '6'.  DPWS030 
00035              88  DP030-SET-CURSOR-TRAILER             VALUE '7'.  DPWS030 
00036              88  DP030-SET-CURSOR-ABSOLUTE            VALUE '8'.  DPWS030 
00037          10  DP030-CURSOR-POSITION        PIC S9(04)  COMP.       DPWS030 
00038          10  DP030-SEND-ALARM-SW          PIC  X(01).             DPWS030 
00039              88  DP030-SEND-ALARM                     VALUE 'Y'.  DPWS030 
00040          10  DP030-ERASE-IND              PIC  X(01).             DPWS030 
00041              88  DP030-DONT-ERASE                     VALUE ' '.  DPWS030 
00042              88  DP030-ERASE                          VALUE 'E'.  DPWS030 
00043              88  DP030-ERASE-UNPROT                   VALUE 'A'.  DPWS030 
00044      05  DP030-RETURN-CODE                PIC  9(02).             DPWS030 
00045          88  DP030-RC-CALL-SUCCESSFUL                 VALUE ZERO. DPWS030 
00046          88  DP030-RC-INVALID-NEXT-ACT                VALUE 01.   DPWS030 
00047          88  DP030-RC-NO-COMMAREA                     VALUE 02.   DPWS030 
00048          88  DP030-RC-RECEIVE-SCREEN                  VALUE 04.   DPWS030 
00049          88  DP030-RC-RECEIVE-MAP                     VALUE 05.   DPWS030 
00050          88  DP030-RC-START-NAVIGATOR                 VALUE 06.   DPWS030 
00051          88  DP030-RC-SEND-MAP-CURSOR                 VALUE 07.   DPWS030 
00052          88  DP030-RC-SEND-MAP                        VALUE 08.   DPWS030 
00053          88  DP030-RC-SEND-DATA-CURSOR                VALUE 09.   DPWS030 
00054          88  DP030-RC-SEND-DATA                       VALUE 10.   DPWS030 
00055          88  DP030-RC-SEND-BOTH-CURSOR                VALUE 11.   DPWS030 
00056          88  DP030-RC-SEND-BOTH                       VALUE 12.   DPWS030 
00057          88  DP030-RC-SEND-PAGE                       VALUE 13.   DPWS030 
00058          88  DP030-RC-APPL-ERROR                      VALUE 14.      CL**2
00059      05  DP030-APPL-ERR-OVERRIDE-SW       PIC  X(01).             DPWS030 
00060          88  DP030-CONTINUE-APPL-ERROR                VALUE ' '.     CL**2
00061          88  DP030-OVERRIDE-APPL-ERROR                VALUE 'Y'.     CL**2
00062      05  FILLER                           PIC  X(06).             DPWS030 
