      ******************************************************************        
      **                        DPWS026                               **        
      **                                                              **        
      ** ------------------------------------------------------------ **        
      **  USE DPPD026 TO READ THE TEMP STORAGE INFO INTO THIS LAYOUT! **        
      ** ------------------------------------------------------------ **        
      **                                                              **        
      **  THIS IS THE LAYOUT FOR THE TEMPORARY STORAGE QUEUE CONTAIN- **        
      **  LOGON- / UNIT- RELATED INFORMATION CAPTURED AT LOGON TIME   **        
      **  AND IS PROVIDED FOR NON-ARCHITECTURE PROGRAMS.              **        
      **                                                              **        
      **  THE TEMP STORAGE QUEUE ID IS (TERMID + 'INFO')              **        
      **                                                              **        
      **  LENGTH:  40 BYTES (INFO RECORD PORTION)                     **        
      **------------------------------------------------------------- **        
      ** DATE      BY           DESCRIPTION                           **        
      ** 03/04/98  CAL BUSH     ADDED CALL-VARIABLES AND DFLT-PRTR.   **        
      ** 12/16/03  JEFF ROUBIK  ADDED EXPANDED LOCATION.              **        
      ** 03/10/04  LYNN MCCANN  EXPANDED DEFAULT PRINTER ID TO CHAR(8)**        
      ******************************************************************        
       01  DP026-CALL-VARIABLES.                                                
           05  DP026-LOGON-ROUTINE          PIC  X(04)  VALUE 'Z028'.           
           05  DP026-SYSID                  PIC  X(04)  VALUE SPACE.            
           05  DP026-QUEUE-NAME.                                                
               10  DP026-QUEUE-TERM         PIC  X(04)  VALUE SPACE.            
               10  FILLER                   PIC  X(04)  VALUE 'INFO'.           
           05  DP026-TS-ITEM                PIC S9(04)  COMP                    
                                                        VALUE ZERO.             
           05  DP026-CICS-RESPONSE          PIC S9(09)  COMP                    
                                                        VALUE ZERO.             
       01  DP026-SIGN-ON-INFO.                                                  
           05  DP026-UNIT-SPECIFIC-DATA.                                        
               10  DP026-NETNAME.                                               
                   15  DP026-LINE-ADDR      PIC  X(02)  VALUE SPACE.            
                   15  DP026-PHYSICAL-UNIT-ADDR                                 
                                            PIC  X(02)  VALUE SPACE.            
                   15  FILLER               PIC  X(04)  VALUE SPACE.            
                                                                                
     **** Below is being obsoleted.  Use DP026-LOCATION-NBR instead.            
               10  DP026-LOCATION           PIC  X(03)  VALUE SPACE.            
               10  DP026-OPER-UNT-ID REDEFINES                                  
                   DP026-LOCATION           PIC  9(03).                         
     **** Above is being obsoleted.  Use DP026-LOCATION-NBR instead.            
                                                                                
               10  DP026-LOCATION-TYPE      PIC  X(02)  VALUE SPACE.            
               10  DP026-FCLTY-ID           PIC S9(04)  VALUE +0                
                                                        COMP.                   
               10  DP026-LOCATION-ACRT-SW                                       
                                            PIC  X(01)  VALUE SPACE.            
                   88 DP026-LOCATION-ACRT               VALUE 'Y'.              
                   88 DP026-LOCATION-DFLT               VALUE 'N'.              
               10  DP026-LOCATION-NBR       PIC S9(04)  VALUE ZERO              
                                                        COMP.                   
               10  FILLER                   PIC  X(05)  VALUE SPACE.            
           05  DP026-USER-SPECIFIC-DATA.                                        
               10  DP026-USERID             PIC  X(08)  VALUE SPACE.            
               10  DP026-DFLT-PRTR-ID       PIC  X(08)  VALUE SPACE.            
               10  FILLER                   PIC  X(01)  VALUE SPACE.            
