00001  01  DP108O-STANDRD-HEADER-108-COLS.                              12/06/89
00002      05  FILLER                            PIC X(02) VALUE SPACE. DPWS108O
00003      05  DP108O-RUN-DATE.                                            LV004
00004          10 DP108O-RUN-MONTH               PIC 9(02) VALUE ZERO.     CL**4
00005          10 FILLER                         PIC X(01) VALUE '/'.      CL**2
00006          10 DP108O-RUN-DAY                 PIC 9(02) VALUE ZERO.     CL**4
00007          10 FILLER                         PIC X(01) VALUE '/'.      CL**2
00008          10 DP108O-RUN-YEAR                PIC 9(02) VALUE ZERO.     CL**4
00009      05  FILLER                            PIC X(02) VALUE SPACE.    CL**4
00010      05  DP108O-RUN-TIME.                                            CL**4
00011          10  DP108O-RUN-HOUR               PIC 9(02) VALUE ZERO.     CL**4
00012          10  FILLER                        PIC X(01) VALUE ':'.      CL**2
00013          10  DP108O-RUN-MINUTE             PIC 9(02) VALUE ZERO.     CL**4
00014      05  FILLER                            PIC X(22) VALUE SPACE.    CL**4
00015      05  FILLER                            PIC X(23)                 CL**2
00016          VALUE 'KOHLS DEPARTMENT STORES'.                            CL**2
00017      05  FILLER                            PIC X(22) VALUE SPACE.    CL**4
00018      05  DP108O-PROGRAM-NAME               PIC X(08) VALUE SPACE.    CL**4
00019      05  FILLER                            PIC X(01) VALUE '-'.      CL**2
00020      05  DP108O-REPORT-NUMBER              PIC 9(01) VALUE ZERO.     CL**4
00021      05  FILLER                            PIC X(01) VALUE SPACE.    CL**2
00022      05  FILLER                            PIC X(05) VALUE 'PAGE'.   CL**2
00023      05  DP108O-PAGE-NUMBER                PIC ZZZZ9 VALUE ZERO.     CL**4
00024      05  FILLER                            PIC X(03) VALUE SPACES.   CL**4
