00001 ******************************************************************10/06/93
00002 ** THIS INCLUDE CONTAINS THE PARAMETERS USED TO COMMUNICATE     **DPWS044 
00003 ** TO THE CICS OBJECT LOCKING SUBROUTINE, DPKCS044.             **   LV001
00004 **                                                              **DPWS044 
00005 ** INSTRUCTIONS FOR USE:                                        **DPWS044 
00006 **  -- FOR ARCHITECTURE PROGRAMS, THE PROCEDURE DIVISION INCLUDE**DPWS044 
00007 **     DPPD044 SHOULD BE USED.  FOR NON-ARCHITECTURE PROGRAMS,  **DPWS044 
00008 **     FOLLOW THE STRUCTURE OF DPPD044, BUT YOU WILL HAVE TO USE**DPWS044 
00009 **     DIFFERENT DATA NAMES FOR THE DP020 FIELDS.  FOR NON-     **DPWS044 
00010 **     ARCHITECTURE PROGRAMS, USE THE PROGRAM NAME FOR THE      **DPWS044 
00011 **     MNEMONIC.                                                **DPWS044 
00012 **  -- THE SUBROUTINE WILL RETURN THE RETURN-CODE, AND IF IT IS **DPWS044 
00013 **     A DB2 ERROR, IT WILL ALSO RETURN THE SQLCODE.  IF THE    **DPWS044 
00014 **     ACTION REQUESTED IS 'UNLOCK-OBJECT', THEN THE FIELD      **DPWS044 
00015 **     'RETURN-UNLOCK-STATUS' WILL INDICATE WHETHER ANY MORE    **DPWS044 
00016 **     LOCKS REMAIN FOR THE TASK.                               **DPWS044 
00017 **  -- THE CALLING PROGRAM MUST BE BOUND AS A PACKAGE. (PACKAGE **DPWS044 
00018 **     IS A NEW FEATURE OF DB2.)                                **DPWS044 
00019 **  -- THERE IS A CICS PROGRAM WHICH WILL DISPLAY ALL LOCKS     **DPWS044 
00020 **     CURRENTLY IN THE OBJECT LOCK TABLE. THE MNEMONIC FOR     **DPWS044 
00021 **     THIS PROGRAM IS DPLOBJLK (THE PROGRAM IS DPKCS043).      **DPWS044 
00022 **                                                              **DPWS044 
00023 ******************************************************************DPWS044 
00024  01  DP044-OBJECT-LOCK-FIELDS.                                    DPWS044 
00025      05  DP044-OBJECT-KEY                 PIC  X(30).             DPWS044 
00026      05  DP044-OBJECT-TYPE                PIC  X(02).             DPWS044 
00027          88  DP044-DP-SYSTEM-MESSAGE                  VALUE 'A1'. DPWS044 
00028          88  DP044-DP-MNEMONIC                        VALUE 'A2'. DPWS044 
00029          88  DP044-MP-RECEIVER-LINE                   VALUE 'A3'. DPWS044 
00030          88  DP044-MB-DEPT                            VALUE 'A4'. DPWS044 
00031          88  DP044-MB-DEPT-CLASS                      VALUE 'A5'. DPWS044 
00032          88  DP044-MB-DEPT-CLASS-STR                  VALUE 'A6'. DPWS044 
00033          88  DP044-MB-CO-DMA-GMA-MCL-SCL              VALUE 'A7'. DPWS044 
00034          88  DP044-PM-CO-ADITEM-MDSE-SEL              VALUE 'A8'. DPWS044 
00035          88  DP044-PE-IN-STORE-DOC-NBR                VALUE 'A9'. DPWS044 
00036      05  DP044-ACTION-REQUESTED           PIC  X(01).             DPWS044 
00037          88  DP044-ACTION-LOCK-OBJECT                 VALUE '1'.  DPWS044 
00038          88  DP044-ACTION-UNLOCK-OBJECT               VALUE '2'.  DPWS044 
00039          88  DP044-ACTION-UNLOCK-TASK                 VALUE '3'.  DPWS044 
00040      05  DP044-TASK-NUMBER                PIC S9(07)  COMP-3.     DPWS044 
00041      05  DP044-NETNAME                    PIC  X(08).             DPWS044 
00042      05  DP044-USERID                     PIC  X(08).             DPWS044 
00043      05  DP044-MNEMONIC                   PIC  X(08).             DPWS044 
00044      05  DP044-RETURN-CODE                PIC  9(02).             DPWS044 
00045          88  DP044-RC-CALL-SUCCESSFUL                 VALUE ZERO. DPWS044 
00046          88  DP044-RC-OBJECT-ALREADY-HELD             VALUE 01.   DPWS044 
00047          88  DP044-RC-WRN-LOCK-NOT-FOUND              VALUE 02.   DPWS044 
00048          88  DP044-RC-ERR-CALL-FAILED                 VALUES      DPWS044 
00049                                                       98  99.     DPWS044 
00050          88  DP044-RC-ERR-BAD-PARAMETERS              VALUE 98.   DPWS044 
00051          88  DP044-RC-ERR-VSAM-ERROR                  VALUE 99.   DPWS044 
00052      05  DP044-RETURN-UNLOCK-STATUS       PIC  9(01).             DPWS044 
00053          88  DP044-NO-LOCKS-REMAIN-FOR-TASK           VALUE ZERO. DPWS044 
00054          88  DP044-LOCKS-REMAIN-FOR-TASK              VALUE 1.    DPWS044 
00055      05  FILLER                           PIC  X(08).             DPWS044 
