000100******************************************************************        
000200**                        DPWS250                               **        
000300**                                                              **        
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **        
000500**  PHYSICAL UNIT CRITERIA SPECIFICATION.                       **        
000600**  LENGTH:  200 BYTES                                          **        
000700******************************************************************        
000800         10  DP250-INTER-APPL-COMMAREA  REDEFINES                         
000900             INTER-APPL-COMM-AREA.                                        
001000             15  FILLER                      PIC  X(01).                  
001002             15  DP250-LOCATION-NBR          PIC S9(04) COMP.             
001005*                    *********************************************        
001006*                    * "FACILITY" NOT POPULATED BY CRIT SPEC.    *        
001008*                    *********************************************        
001009             15  DP250-FCLTY.                                             
001010                 20  DP250-FCLTY-N           PIC  9(04).                  
001011             15  DP250-VTAM.                                              
001012                 20  DP250-LINE              PIC  X(02).                  
001013                 20  DP250-PHYSICAL-UNIT     PIC  X(02).                  
001014             15  DP250-IP-ADDR.                                           
001015*                    *********************************************        
001016*                    * "IP-ADDR" POPULATED BY CRIT SPEC.         *        
001017*                    * THIS FIELD ALSO USED AS IP-ADDR-BEGIN.    *        
001018*                    *********************************************        
001019                 20  DP250-IP-ADDR-OCTET1    PIC  9(03).                  
001020                 20  DP250-IP-ADDR-DOT1      PIC  X(01).                  
001021                 20  DP250-IP-ADDR-OCTET2    PIC  9(03).                  
001022                 20  DP250-IP-ADDR-DOT2      PIC  X(01).                  
001023                 20  DP250-IP-ADDR-OCTET3    PIC  9(03).                  
001024                 20  DP250-IP-ADDR-DOT3      PIC  X(01).                  
001030                 20  DP250-IP-ADDR-OCTET4    PIC  9(03).                  
001040             15  DP250-IP-ADDR-END.                                       
001041*                    *********************************************        
001042*                    * "IP-ADDR-END" NOT POPULATED BY CRIT SPEC. *        
001043*                    *********************************************        
001044                 20  DP250-IP-ADDR-E-OCTET1  PIC  9(03).                  
001045                 20  DP250-IP-ADDR-E-DOT1    PIC  X(01).                  
001046                 20  DP250-IP-ADDR-E-OCTET2  PIC  9(03).                  
001047                 20  DP250-IP-ADDR-E-DOT2    PIC  X(01).                  
001048                 20  DP250-IP-ADDR-E-OCTET3  PIC  9(03).                  
001049                 20  DP250-IP-ADDR-E-DOT3    PIC  X(01).                  
001050                 20  DP250-IP-ADDR-E-OCTET4  PIC  9(03).                  
001500             15  FILLER                      PIC  X(159).                 
