00001 ******************************************************************07/02/90
00002 **                                                              **DPWS016 
00003 **  THIS COPYBOOK CONTAINS THE STANDARD PF-KEY INTERPRETATIONS  **   LV001
00004 **  (SIMILAR TO DFHAID) AS USED IN CICS NAVIGATION AT KOHL'S.   **DPWS016 
00005 **                                                              **DPWS016 
00006 ******************************************************************DPWS016 
00007  01  DP016-FUNCTION-KEYS.                                         DPWS016 
00008      05  DP016-PF1                     PIC  9(02)  VALUE 01.      DPWS016 
00009      05  DP016-PF2                     PIC  9(02)  VALUE 02.      DPWS016 
00010      05  DP016-PF3                     PIC  9(02)  VALUE 03.      DPWS016 
00011      05  DP016-PF4                     PIC  9(02)  VALUE 04.      DPWS016 
00012      05  DP016-PF5                     PIC  9(02)  VALUE 05.      DPWS016 
00013      05  DP016-PF6                     PIC  9(02)  VALUE 06.      DPWS016 
00014      05  DP016-PF7                     PIC  9(02)  VALUE 07.      DPWS016 
00015      05  DP016-PF8                     PIC  9(02)  VALUE 08.      DPWS016 
00016      05  DP016-PF9                     PIC  9(02)  VALUE 09.      DPWS016 
00017      05  DP016-PF10                    PIC  9(02)  VALUE 10.      DPWS016 
00018      05  DP016-PF11                    PIC  9(02)  VALUE 11.      DPWS016 
00019      05  DP016-PF12                    PIC  9(02)  VALUE 12.      DPWS016 
00020      05  DP016-PF13                    PIC  9(02)  VALUE 13.      DPWS016 
00021      05  DP016-PF14                    PIC  9(02)  VALUE 14.      DPWS016 
00022      05  DP016-PF15                    PIC  9(02)  VALUE 15.      DPWS016 
00023      05  DP016-PF16                    PIC  9(02)  VALUE 16.      DPWS016 
00024      05  DP016-PF17                    PIC  9(02)  VALUE 17.      DPWS016 
00025      05  DP016-PF18                    PIC  9(02)  VALUE 18.      DPWS016 
00026      05  DP016-PF19                    PIC  9(02)  VALUE 19.      DPWS016 
00027      05  DP016-PF20                    PIC  9(02)  VALUE 20.      DPWS016 
00028      05  DP016-PF21                    PIC  9(02)  VALUE 21.      DPWS016 
00029      05  DP016-PF22                    PIC  9(02)  VALUE 22.      DPWS016 
00030      05  DP016-PF23                    PIC  9(02)  VALUE 23.      DPWS016 
00031      05  DP016-PF24                    PIC  9(02)  VALUE 24.      DPWS016 
00032      05  DP016-PA1                     PIC  9(02)  VALUE 25.      DPWS016 
00033      05  DP016-PA2                     PIC  9(02)  VALUE 26.      DPWS016 
00034      05  DP016-CLEAR                   PIC  9(02)  VALUE 27.      DPWS016 
00035      05  DP016-ENTER                   PIC  9(02)  VALUE 28.      DPWS016 
00036      05  DP016-PA3                     PIC  9(02)  VALUE 29.      DPWS016 
