       01  DP200O-STANDRD-HEADER-200-COLS.                                      
           05  DP200O-LASER-NEW-PAGE-INDICATR    PIC X(02) VALUE SPACE.         
           05  DP200O-RUN-DATE.                                                 
               10  DP200O-RUN-MONTH              PIC 9(02) VALUE ZERO.          
               10  FILLER                        PIC X(01) VALUE '/'.           
               10  DP200O-RUN-DAY                PIC 9(02) VALUE ZERO.          
               10  FILLER                        PIC X(01) VALUE '/'.           
               10  DP200O-RUN-YEAR               PIC 9(02) VALUE ZERO.          
           05  FILLER                            PIC X(02) VALUE SPACE.         
           05  DP200O-RUN-TIME.                                                 
               10  DP200O-RUN-HOUR               PIC 9(02) VALUE ZERO.          
               10  FILLER                        PIC X(01) VALUE ':'.           
               10  DP200O-RUN-MINUTE             PIC 9(02) VALUE ZERO.          
           05  FILLER                            PIC X(61) VALUE SPACE.         
           05  FILLER                            PIC X(45)                      
               VALUE 'K O H L S   D E P A R T M E N T   S T O R E S'.           
           05  FILLER                            PIC X(55) VALUE SPACE.         
           05  DP200O-PROGRAM-NAME               PIC X(08) VALUE SPACE.         
           05  FILLER                            PIC X(01) VALUE '-'.           
           05  DP200O-REPORT-NUMBER              PIC 9(01) VALUE ZERO.          
           05  FILLER                            PIC X(02) VALUE SPACE.         
           05  FILLER                            PIC X(05) VALUE 'PAGE'.        
           05  DP200O-PAGE-NUMBER                PIC ZZZZ9 VALUE ZERO.          
                                                                                
       01  DP200O-CNFDL-HDR-200-COLS.                                           
           05  FILLER                            PIC X(73) VALUE SPACE.         
           05  DP200O-CNFDL-MSG-54-COLS.                                        
               10  FILLER                        PIC X(05)                      
                                                         VALUE '**** '.         
               10  DP200O-CNFDL-MSG-44-COLS      PIC X(44) VALUE                
                        'CONFIDENTIAL - NOT TO BE COPIED OR DISCLOSED'.         
               10  FILLER                        PIC X(05)                      
                                                         VALUE ' ****'.         
           05  FILLER                            PIC X(73) VALUE SPACE.         
                                                                                
       01  DP200O-ATRNY-CLNT-HDR-200-COLS.                                      
           05  FILLER                            PIC X(55) VALUE SPACE.         
           05  DP200O-ATRNY-CLNT-MSG-90-COLS.                                   
               10  FILLER                        PIC X(05)                      
                                                         VALUE '**** '.         
               10  DP200O-ATRNY-CLNT-MSG-80-COLS.                               
                   15  DP200O-ATRNY-CLNT-MSG-40A-COLS                           
                                                 PIC X(40) VALUE                
                       'PRIVILEGED AND CONFIDENTIAL, ATTORNEY-CL'.              
                   15  DP200O-ATRNY-CLNT-MSG-40B-COLS                           
                                                 PIC X(40) VALUE                
                       'IENT PRIVILEGE AND ATTORNEY WORK PRODUCT'.              
               10  FILLER                        PIC X(05)                      
                                                         VALUE ' ****'.         
           05  FILLER                            PIC X(55) VALUE SPACE.         
