00001 *----------------------------------------------------------------*05/01/92
00002 *                         DPWS002                                *DPWS002 
00003 *                                                                *   LV003
00004 *   THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE *DPWS002 
00005 *   MAINTENANCE PROGRAMS.                                        *DPWS002 
00006 *                                                                *DPWS002 
00007 *----------------------------------------------------------------*DPWS002 
00008                                                                   DPWS002 
00009  01  DP002-ARCH-MAINT-TSQB-REC.                                      CL**2
00010        05  DP002-SELECTED-ITEMS            PIC 999    VALUE ZERO. DPWS002 
00011        05  DP002-MAX-ITEMS                 PIC 999    VALUE 100.  DPWS002 
00012        05  DP002-ACTION                    PIC X.                 DPWS002 
00013            88  DP002-INQUIRY                          VALUE 'I'.  DPWS002 
00014            88  DP002-UPDATE                           VALUE 'U'.  DPWS002 
00015            88  DP002-DELETE                           VALUE 'D'.  DPWS002 
00016            88  DP002-ADD                              VALUE 'A'.  DPWS002 
00017        05  DP002-COMPANY                   PIC X(02).             DPWS002 
00018                                                                   DPWS002 
00019        05  DP002-SELECTED-ITEM-ARRAY       OCCURS 100 TIMES       DPWS002 
00020                                            INDEXED BY DP002-IDX.  DPWS002 
00021            10  DP002-ITEM                             PIC S9(09)  DPWS002 
00022                                                       COMP-3.     DPWS002 
00023            10  DP002-ACTION-SW                        PIC X(01).  DPWS002 
00024                88  DP002-INQ                          VALUE 'I'.  DPWS002 
00025                88  DP002-UPD                          VALUE 'U'.  DPWS002 
00026                88  DP002-DEL                          VALUE 'D'.  DPWS002 
00027                88  DP002-ERR                          VALUE 'E'.     CL**3
00028            10  DP002-KEY-DATA.                                    DPWS002 
00029                15  DP002-MNEMONIC                     PIC X(08).  DPWS002 
