      ****************************************************************          
      * DPWS035                                                                 
      ****************************************************************          
206118* 08/20/18  CHG0206118  RENAMED FROM KDU1804 WHICH DID NOT                
206118*                       MEET STANDARDS FOR MAINFRAME REFACTORING          
      ****************************************************************          
       01  CHECK-DIGIT-WORK-AREA.                                           000 
           05  CD-STORE-NO         PIC X(5).                                000 
           05  STORE-DIGIT REDEFINES CD-STORE-NO  PIC 9 OCCURS 5 TIMES.     000 
           05  ODD-DIGITS          PIC 99.                                  000 
           05  ODD-BYTE REDEFINES  ODD-DIGITS  PIC 9 OCCURS 2 TIMES.        000 
           05  EVEN-DIGITS         PIC 99.                                  000 
           05  EVEN-BYTE REDEFINES EVEN-DIGITS PIC 9 OCCURS 2 TIMES.        000 
           05  ODD-RESULT          PIC 999.                                 000 
           05  ODD-RESULT-BYTE  REDEFINES ODD-RESULT PIC 9 OCCURS           000 
                                                           3 TIMES.         000 
           05  ODD-EVEN-RESULT     PIC 999.                                 001 
           05  ODD-EVEN-BYTE REDEFINES ODD-EVEN-RESULT PIC 9 OCCURS         001 
                                                             3 TIMES.       001 
           05  CHECK-DIGIT         PIC 9.                                   001 
