      ******************************************************************        
      **                        DPWS055                               **        
      **                                                              **        
      **  THIS IS THE NEW INTERAPPLICATION COMMUNICATIONS AREA FOR:   **        
      **                                         DPKCS009             **        
      **                                         DPKCS010             **        
      **                                         DPKCS012             **        
      **                                         DPKCS017             **        
      **                                         DPKCS018             **        
      **                                         DPKCS019             **        
      **                                         DPKCS020             **        
      **                                         DPKCS021             **        
      **                                         DPKCS022             **        
      **                                         DPKCS023             **        
      **                                         DPKCS024             **        
      **                                         DPKCS029             **        
      **                                         DPKCS032             **        
      **                                                              **        
      **  LENGTH:  200 BYTES                                          **        
      ******************************************************************        
               10  DP055-INTER-APPL-COMMAREA  REDEFINES                         
                   INTER-APPL-COMM-AREA.                                        
                                                                                
                   15  FILLER                         PIC X(100).               
                   15  DP055-NUMBER-OF-SELECTED-ITEMS PIC S9(09)                
                                                          COMP-3.               
                   15  DP055-NUMBER-PROCESSED-ITEMS   PIC S9(09)                
                                                          COMP-3.               
                   15  DP055-TSQB-QUEUE-NAME          PIC X(8).                 
                   15  DP055-TSQB-QUEUE-LENGTH        PIC S9(4)                 
                                                          COMP.                 
                   15  DP055-MNEMONIC                 PIC X(08).                
                   15  DP055-ACTION                   PIC X(01).                
                       88  DP055-CREATED                  VALUE  '1'.           
                       88  DP055-UPDATED                  VALUE  '2'.           
                       88  DP055-DELETED                  VALUE  '3'.           
                       88  DP055-SELECTED                 VALUE  '4'.           
                       88  DP055-ERROR                    VALUE  '5'.           
                       88  DP055-NOT-FOUND                VALUE  '6'.           
                   15  DP055-MENU-NAME                PIC X(08).                
                   15  DP055-PROG                     PIC X(08).                
                   15  DP055-UPD-VSAM-IND             PIC X(01).                
                   15  DP055-LIST-CRITERION           PIC X(01).                
                   15  DP055-DETAIL-CRITERION         PIC X(01).                
                   15  DP055-MENU-CRITERION           PIC X(01).                
                   15  DP055-SYSTEM-ID                PIC X(02).                
                   15  DP055-MESSAGE-TEXT             PIC X(30).                
                   15  DP055-REVIEW-IND               PIC X(01).                
                   15  DP055-MESSAGE-NUMBER           PIC 9(05).                
                   15  DP055-DB2-PKG-CDE              PIC X(01).                
                   15  DP055-TRAN                     PIC X(04).                
                   15  DP055-ACCURATE-LOCATION-REQ    PIC X(01).                
                   15  FILLER                         PIC X(07).                
