000100***************************************************************** 00010000
000200**                                                                00020000
000300**   DATA AREAS FOR 'DYNALC' DYNAMIC ALLOCATION CALL.             00030000
000400**   THE ROUTINE SHOULD BE EXECUTED VIA THE DPPD023 PROCEDURE     00040000
000410**        DIVISION COPYBOOK, AS A DYNAMIC CALL USING THE          00041000
000420**        DP023-DYNALC CONSTANT.                                  00042000
000430**                                                                00043000
000500***************************************************************** 00050000
000600 01  DP023-DYNALC                PIC X(8)    VALUE 'DYNALC'.      00060000
000700 01  DP023-DYNALC-PARMS.                                          00070000
002900     05  DP023-LASTRC            PIC 9(8)    COMP SYNC.           00071023
000800     05  DP023-DDNAME            PIC X(8)    VALUE SPACES.        00080000
000900     05  DP023-DSNAME            PIC X(44)   VALUE SPACES.        00090000
000910         88  DP023-DSNAME-SYSOUT             VALUE SPACES.        00091000
000920     05  DP023-DISP              PIC X(4)    VALUE SPACES.        00092000
000930         88  DP023-DISP-FREE                 VALUE 'FREE'.        00093000
000940         88  DP023-DISP-NEW                  VALUE 'NEW'.         00094000
000950         88  DP023-DISP-SHARE                VALUE 'SHR'.         00095000
000960         88  DP023-DISP-OLD                  VALUE 'OLD'.         00096000
000970         88  DP023-DISP-MODIFY               VALUE 'MOD'.         00097000
000980         88  DP023-DISP-DELETE               VALUE 'DEL'.         00098000
000990         88  DP023-DISP-CREATE-PDS           VALUE 'PDS'.         00099000
001000     05  DP023-FREE-CLOSE        PIC X(3)    VALUE SPACES.        00100000
001100         88  DP023-FREE-CLOSE-YES            VALUE 'YES'.         00110000
001200         88  DP023-FREE-CLOSE-NO             VALUE 'NO'.          00120000
001300     05  DP023-RECFM             PIC X(3)    VALUE SPACES.        00130000
001400         88  DP023-RECFM-FIXED-BLOCK         VALUE 'FB'.          00140000
001500         88  DP023-RECFM-FIXED-BLOCK-ARCH    VALUE 'FBA'.         00150000
001600         88  DP023-RECFM-VARIABLE            VALUE 'V'.           00160000
001700         88  DP023-RECFM-VAR-BLOCK           VALUE 'VB'.          00170000
001800         88  DP023-RECFM-VAR-BLOCK-ARCH      VALUE 'VBA'.         00180000
001900     05  DP023-RECSZ             PIC 9(4)    VALUE ZEROES.        00190000
002000     05  DP023-RECOUNT           PIC 9(7)    VALUE ZEROES.        00200000
002100         88  DP023-RECOUNT-ALLOCATE-TAPE     VALUE ZEROES.        00210000
002200     05  DP023-MEMBER-NAME       PIC X(8)    VALUE SPACES.        00220000
002300     05  DP023-MEMBER-DISP       PIC X(4)    VALUE SPACES.        00230000
002310         88  DP023-MEMDISP-LOCATE            VALUE 'LOC'.         00231000
002320         88  DP023-MEMDISP-READ              VALUE 'READ'.        00232000
002330         88  DP023-MEMDISP-DELETE            VALUE 'DEL'.         00233000
002340         88  DP023-MEMDISP-NEW               VALUE 'NEW'.         00234000
002350         88  DP023-MEMDISP-UPDATE            VALUE 'UPD'.         00235000
002360         88  DP023-MEMDISP-MODIFY            VALUE 'MOD'.         00236000
002370     05  DP023-PRINT-CLASS       PIC X(1)    VALUE SPACES.        00237000
002380         88  DP023-PRINT-CLASS-A             VALUE 'A'.           00238000
002390     05  DP023-PRINT-DEST        PIC X(8)    VALUE SPACES.        00239000
002400     05  DP023-PRINT-COPIES      PIC X(3)    VALUE SPACES.        00240000
002500     05  DP023-PRINT-COPIES-N    REDEFINES DP023-PRINT-COPIES     00250000
002600                                 PIC 9(3).                        00260000
002700     05  DP023-PRINT-FCB         PIC X(4)    VALUE SPACES.        00270000
002800     05  DP023-PRINT-CHARS       PIC X(4)    VALUE SPACES.        00280000
002910     05  DP023-PRINT-WRITER      PIC X(8)    VALUE SPACES.        00291823
002911     05  FILLER                  PIC X(80)   VALUE SPACES.        00291924
002920 01  DP023-DYNALC-PD-PARMS.                                       00292000
002930     05  DP023-DISPLAY-ABEND-IND PIC X(1)    VALUE 'E'.           00293000
002940         88  DP023-DISABLE-DISPLAY-ABEND     VALUE 'D'.           00294000
002950         88  DP023-ENABLE-DISPLAY-ABEND      VALUE 'E'.           00295000
002960                                                                  00296000
002970                                                                  00297000
002980                                                                  00298000
002990*** DP023-MAX SHOULD BE SET TO ONE LESS THAN NUMBER OF            00299000
003000*** ERRORS IN TABLE BELOW.                                        00300000
003100                                                                  00310000
003200 01  DP023-ABEND-CODE            PIC S9(04)  VALUE +0             00320000
003300                                             COMP SYNC.           00330000
003400 01  DP023-SUB                   PIC 9(2)    VALUE ZERO.          00340000
003500 01  DP023-MAX                   PIC 9(2)    VALUE 16.            00350000
003600                                                                  00360000
003700 01  DP023-RETURN-CODES.                                          00370000
003800     05  PIC X(45) VALUE                                          00380000
003900            '4001INVALID OR NO DDNAME                     '.      00390000
004000     05  PIC X(45) VALUE                                          00400000
004100            '4002INVALID OR NO DSNAME                     '.      00410000
004200     05  PIC X(45) VALUE                                          00420000
004300            '4003INVALID OR NO DISP                       '.      00430000
004400     05  PIC X(45) VALUE                                          00440000
004500            '4004PDS PROCESSING WITH INVALID MEMBER NAME  '.      00450000
004600     05  PIC X(45) VALUE                                          00460000
004700            '4005NON-NUMERIC RECORD QUANTITY GIVEN        '.      00470000
004800     05  PIC X(45) VALUE                                          00480000
004900            '4006RECORD SIZE LARGER THAN 6200             '.      00490000
005000     05  PIC X(45) VALUE                                          00500000
005100            '4007NEW SPECIFIED FOR EXISTING DATASET/MEMBER'.      00510000
005200     05  PIC X(45) VALUE                                          00520000
005300            '4008ZERO OR NON-NUMERIC LRECL                '.      00530000
005400     05  PIC X(45) VALUE                                          00540000
005500            '4009DATASET DOES NOT EXIST                   '.      00550000
005600     05  PIC X(45) VALUE                                          00560000
005700            '4010MEMBER DOES NOT EXIST                    '.      00570000
005800     05  PIC X(45) VALUE                                          00580000
005900            '4011CANNOT OPEN PDS FOR BLDL                 '.      00590000
006000     05  PIC X(45) VALUE                                          00600000
006100            '4012SYSOUT COPIES IS INVALID                 '.      00610000
006200     05  PIC X(45) VALUE                                          00620000
006300            '4013FREE=CLOSE NOT YES OR NO OR BLANK        '.      00630000
006400     05  PIC X(45) VALUE                                          00640000
006500            '4014PDS PROCESSING IN DISP=SHR ONLY          '.      00650000
006600     05  PIC X(45) VALUE                                          00660000
006700            '4015INVALID PARM LIST PASSED                 '.      00670000
006800     05  PIC X(45) VALUE                                          00680000
006900            '4016RECFM = FB OR FBA ONLY                   '.      00690000
007000     05  PIC X(45) VALUE                                          00700000
007100            '????NON-ZERO RETURN CODE FROM "SVC 99"       '.      00710000
007200 01  FILLER  REDEFINES DP023-RETURN-CODES.                        00720000
007300     05  FILLER  OCCURS 17 TIMES.                                 00730000
007400         10  DP023-RC            PIC 9(4).                        00740000
007500         10  DP023-DESC          PIC X(41).                       00750000
007600                                                                  00760000
007700 01  DP023-RETURN-CODE-CONSTANTS.                                 00770000
007800     05  DP023-RC-DATASET-DOESNT-EXIST                            00780000
007900                                 PIC 9(4)    VALUE 4009.          00790000
008000     05  DP023-RC-MEMBER-DOESNT-EXIST                             00800000
008100                                 PIC 9(4)    VALUE 4010.          00810000
