       01  DP200-STANDRD-HEADER-200-COLS.                                       
           05  DP200-LASER-NEW-PAGE-INDICATR     PIC X(02) VALUE SPACE.         
           05  DP200-RUN-DATE.                                                  
               10  DP200-RUN-MONTH               PIC 9(02) VALUE ZERO.          
               10  FILLER                        PIC X(01) VALUE '/'.           
               10  DP200-RUN-DAY                 PIC 9(02) VALUE ZERO.          
               10  FILLER                        PIC X(01) VALUE '/'.           
               10  DP200-RUN-YEAR                PIC 9(04) VALUE ZERO.          
           05  FILLER                            PIC X(02) VALUE SPACE.         
           05  DP200-RUN-TIME.                                                  
               10  DP200-RUN-HOUR                PIC 9(02) VALUE ZERO.          
               10  FILLER                        PIC X(01) VALUE ':'.           
               10  DP200-RUN-MINUTE              PIC 9(02) VALUE ZERO.          
           05  FILLER                            PIC X(59) VALUE SPACE.         
           05  FILLER                            PIC X(45)                      
               VALUE 'K O H L S   D E P A R T M E N T   S T O R E S'.           
           05  FILLER                            PIC X(55) VALUE SPACE.         
           05  DP200-PROGRAM-NAME                PIC X(08) VALUE SPACE.         
           05  FILLER                            PIC X(01) VALUE '-'.           
           05  DP200-REPORT-NUMBER               PIC 9(01) VALUE ZERO.          
           05  FILLER                            PIC X(02) VALUE SPACE.         
           05  FILLER                            PIC X(05) VALUE 'PAGE'.        
           05  DP200-PAGE-NUMBER                 PIC ZZZZ9 VALUE ZERO.          
                                                                                
       01  DP200-CNFDL-HDR-200-COLS.                                            
           05  FILLER                            PIC X(73) VALUE SPACE.         
           05  DP200-CNFDL-MSG-54-COLS.                                         
               10  FILLER                        PIC X(05)                      
                                                         VALUE '**** '.         
               10  DP200-CNFDL-MSG-44-COLS       PIC X(44) VALUE                
                        'CONFIDENTIAL - NOT TO BE COPIED OR DISCLOSED'.         
               10  FILLER                        PIC X(05)                      
                                                         VALUE ' ****'.         
           05  FILLER                            PIC X(73) VALUE SPACE.         
                                                                                
       01  DP200-ATRNY-CLNT-HDR-200-COLS.                                       
           05  FILLER                            PIC X(55) VALUE SPACE.         
           05  DP200-ATRNY-CLNT-MSG-90-COLS.                                    
               10  FILLER                        PIC X(05)                      
                                                         VALUE '**** '.         
               10  DP200-ATRNY-CLNT-MSG-80-COLS.                                
                   15  DP200-ATRNY-CLNT-MSG-40A-COLS                            
                                                 PIC X(40) VALUE                
                       'PRIVILEGED AND CONFIDENTIAL, ATTORNEY-CL'.              
                   15  DP200-ATRNY-CLNT-MSG-40B-COLS                            
                                                 PIC X(40) VALUE                
                       'IENT PRIVILEGE AND ATTORNEY WORK PRODUCT'.              
               10  FILLER                        PIC X(05)                      
                                                         VALUE ' ****'.         
           05  FILLER                            PIC X(55) VALUE SPACE.         
