00001  01  USERNAME                        PIC X(10)      VARYING.      01/25/96
00002  01  PASSWD                          PIC X(10)      VARYING.      DPW00031
00003  01  PV-PROGRAM-VARS-FOR-ORA-LOGON.                                  LV003
00004      05  PV-CICS-ID.                                              DPW00031
00005          10  PV-FIRST-4              PIC X(4).                       CL**3
00006          10  PV-CICS-REGION-TYPE     PIC X.                       DPW00031
00007              88  PV-CICS-REGION-PRODUCTION  VALUE 'P'.            DPW00031
00008              88  PV-CICS-REGION-ACCEPTANCE  VALUE 'A'.            DPW00031
00009              88  PV-CICS-REGION-QUALITY     VALUE 'Q'.            DPW00031
00010              88  PV-CICS-REGION-LEARNING    VALUE 'L'.            DPW00031
00011              88  PV-CICS-REGION-TEST        VALUE 'T'.            DPW00031
00012              88  PV-CICS-REGION-SYSTEST     VALUE 'S'.            DPW00031
00013          10  PV-CICS-REGION-CODE     PIC X.                       DPW00031
00014          10  PV-LAST-2               PIC X(2).                       CL**3
