000100*----------------------------------------------------------------*        
000200*                         DPWS252                                *        
000300*                                                                *        
000400*   THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE *        
000500*   MAINTENANCE PROGRAMS TO PASS THE PHYSICAL UNIT.              *        
000600*                                                                *        
000700*----------------------------------------------------------------*        
000800                                                                          
000900 01  DP252-PHYS-UNIT-SEL-REC.                                             
001000       05  DP252-SELECTED-ITEMS         PIC S9(05)  COMP-3                
001100                                                    VALUE ZERO.           
001200       05  DP252-MAX-ITEMS              PIC  9(02)  VALUE 20.             
001300       05  DP252-SELECTED-ITEM-ARRAY.                                     
001400           10  FILLER                   OCCURS 20 TIMES                   
001500                                        INDEXED BY DP252-IDX.             
001600               15  DP252-ITEM           PIC S9(09)  COMP-3.               
001700               15  DP252-ACTION-SW      PIC  X(01).                       
001800                   88  DP252-INQ                    VALUE 'I'.            
001900                   88  DP252-UPD                    VALUE 'U'.            
002000                   88  DP252-DEL                    VALUE 'D'.            
002100                   88  DP252-ERR                    VALUE 'E'.            
002200               15  DP252-KEY-DATA.                                        
002300                   20  DP252-LOCATION.                                    
002600                       25  DP252-FCLTY.                                   
002700                           30  DP252-FCLTY-N        PIC  9(04).           
002800                       25  DP252-LOCATION-NBR       PIC S9(04)            
002900                                                        COMP.             
003000                       25  DP252-FCLTY-N4-COMP      PIC S9(04)            
003100                                                        COMP.             
003200                   20  DP252-VTAM.                                        
003300                       25  DP252-LNE-ADDR-NBR       PIC  X(02).           
003400                       25  DP252-PHYSICAL-UNIT      PIC  X(02).           
003500                   20  DP252-IP-ADDR-BEG.                                 
003600                       25  DP252-IP-ADDR-BEG-OCTET1.                      
003700                           30  DP252-IP-ADDR-BEG-OCTET1-N                 
003800                                                    PIC  9(03).           
003900                       25  DP252-IP-ADDR-BEG-DOT1   PIC  X(01).           
004000                       25  DP252-IP-ADDR-BEG-OCTET2.                      
004100                           30  DP252-IP-ADDR-BEG-OCTET2-N                 
004200                                                    PIC  9(03).           
004300                       25  DP252-IP-ADDR-BEG-DOT2   PIC  X(01).           
004400                       25  DP252-IP-ADDR-BEG-OCTET3.                      
004500                           30  DP252-IP-ADDR-BEG-OCTET3-N                 
004600                                                    PIC  9(03).           
004700                       25  DP252-IP-ADDR-BEG-DOT3   PIC  X(01).           
004800                       25  DP252-IP-ADDR-BEG-OCTET4.                      
004900                           30  DP252-IP-ADDR-BEG-OCTET4-N                 
005000                                                    PIC  9(03).           
005100                   20  DP252-IP-ADDR-END.                                 
005200                       25  DP252-IP-ADDR-END-OCTET1.                      
005300                           30  DP252-IP-ADDR-END-OCTET1-N                 
005400                                                    PIC  9(03).           
005500                       25  DP252-IP-ADDR-END-DOT1   PIC  X(01).           
005600                       25  DP252-IP-ADDR-END-OCTET2.                      
005700                           30  DP252-IP-ADDR-END-OCTET2-N                 
005800                                                    PIC  9(03).           
005900                       25  DP252-IP-ADDR-END-DOT2   PIC  X(01).           
006000                       25  DP252-IP-ADDR-END-OCTET3.                      
006100                           30  DP252-IP-ADDR-END-OCTET3-N                 
006200                                                    PIC  9(03).           
006300                       25  DP252-IP-ADDR-END-DOT3   PIC  X(01).           
006400                       25  DP252-IP-ADDR-END-OCTET4.                      
006500                           30  DP252-IP-ADDR-END-OCTET4-N                 
006600                                                    PIC  9(03).           
