00001 ******************************************************************03/10/93
00002 **                        DPWS058                               **DPWS058 
00003 **                                                              **   LV002
00004 **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT USED WHEN     **DPWS058 
00005 **  PASSING INFORMATION BETWEEN SYSTEM MESSAGE 'ADD' PROGRAMS.  **DPWS058 
00006 **  LENGTH:  200 BYTES                                          **DPWS058 
00007 ******************************************************************DPWS058 
00008          10  DP058-INTER-APPL-COMMAREA  REDEFINES                 DPWS058 
00009              INTER-APPL-COMM-AREA.                                DPWS058 
00010              15  FILLER                         PIC  X(01).       DPWS058 
00011              15  DP058-MESSAGE-NUMBER           PIC S9(05)        DPWS058 
00012                                                      COMP-3.      DPWS058 
00013              15  FILLER                         PIC  X(196).         CL**2
