00001  01  DP100O-STANDRD-HEADER-100-COLS.                              12/03/92
00002      05  DP100O-LASER-NEW-PAGE-INDICATR    PIC X(02) VALUE SPACE. DPWS100O
00003      05  DP100O-RUN-DATE.                                            LV001
00004          10 DP100O-RUN-MONTH               PIC 9(02) VALUE ZERO.  DPWS100O
00005          10 FILLER                         PIC X(01) VALUE '/'.   DPWS100O
00006          10 DP100O-RUN-DAY                 PIC 9(02) VALUE ZERO.  DPWS100O
00007          10 FILLER                         PIC X(01) VALUE '/'.   DPWS100O
00008          10 DP100O-RUN-YEAR                PIC 9(02) VALUE ZERO.  DPWS100O
00009      05  FILLER                            PIC X(01) VALUE SPACE. DPWS100O
00010      05  DP100O-RUN-TIME.                                         DPWS100O
00011          10  DP100O-RUN-HOUR               PIC 9(02) VALUE ZERO.  DPWS100O
00012          10  FILLER                        PIC X(01) VALUE ':'.   DPWS100O
00013          10  DP100O-RUN-MINUTE             PIC 9(02) VALUE ZERO.  DPWS100O
00014      05  FILLER                            PIC X(23) VALUE SPACE. DPWS100O
00015      05  FILLER                            PIC X(23)              DPWS100O
00016          VALUE 'KOHLS DEPARTMENT STORES'.                         DPWS100O
00017      05  FILLER                            PIC X(17) VALUE SPACE. DPWS100O
00018      05  DP100O-PROGRAM-NAME               PIC X(08) VALUE SPACE. DPWS100O
00019      05  FILLER                            PIC X(01) VALUE '-'.   DPWS100O
00020      05  DP100O-REPORT-NUMBER              PIC 9(01) VALUE ZERO.  DPWS100O
00021      05  FILLER                            PIC X(01) VALUE SPACE. DPWS100O
00022      05  FILLER                            PIC X(05) VALUE 'PAGE'.DPWS100O
00023      05  DP100O-PAGE-NUMBER                PIC ZZZZ9 VALUE ZERO.  DPWS100O
00024                                                                   DPWS100O
00025  01  DP100O-CNFDL-HDR-100-COLS.                                   DPWS100O
00026      05  FILLER                            PIC X(23) VALUE SPACE. DPWS100O
00027      05  DP100O-CNFDL-MSG-54-COLS.                                DPWS100O
00028          10  FILLER                        PIC X(05)              DPWS100O
00029                                                    VALUE '**** '. DPWS100O
00030          10  DP100O-CNFDL-MSG-44-COLS      PIC X(44) VALUE        DPWS100O
00031                   'CONFIDENTIAL - NOT TO BE COPIED OR DISCLOSED'. DPWS100O
00032          10  FILLER                        PIC X(05)              DPWS100O
00033                                                    VALUE ' ****'. DPWS100O
00034      05  FILLER                            PIC X(23) VALUE SPACE. DPWS100O
00035                                                                   DPWS100O
