00001 *                                                                 08/29/91
00002 *  THIS IS THE LAYOUT FOR THE DYNAMIC REPORT SYSTEM COMMAREA      DRRD001O
00003 *                                                                    LV005
00004  01  DRS01-COMMAREA.                                              DRRD001O
00005      05  DRS01-COMM-DRRB.                                         DRRD001O
00006          10  DRS01-DRRB-ID         PIC X(4)      VALUE 'DRRB'.    DRRD001O
00007          10  DRS01-DRRB-FUNC       PIC X(4)      VALUE SPACES.    DRRD001O
00008          10  DRS01-DRRB-RID        PIC X(8)      VALUE SPACES.    DRRD001O
00009          10  DRS01-DRRD-OPTIONS    PIC X(4)      VALUE SPACES.    DRRD001O
00010          10  FILLER                PIC X(8)      VALUE SPACES.    DRRD001O
00011          10  DRS01-DRRB-RC         PIC S9(8)     VALUE +000 COMP. DRRD001O
00012          10  DRS01-DRRB-RCS.                                      DRRD001O
00013              15  DRS01-DRRB-RCS1   PIC S9(4)     VALUE +000 COMP. DRRD001O
00014              15  DRS01-DRRB-RCS2   PIC S9(4)     VALUE +000 COMP. DRRD001O
00015          10  DRS01-DRRB-ATTR-ERROR PIC S9(4)     VALUE +000 COMP. DRRD001O
00016          10  FILLER                PIC X(2)      VALUE SPACES.    DRRD001O
00017          10  DRS01-DRRB-DRDC       PIC S9(8)     VALUE +000 COMP. DRRD001O
00018          10  DRS01-DRRB01-LINES    PIC S9(8)     VALUE +000 COMP. DRRD001O
00019      05  DRS01-COMM-DRIB.                                         DRRD001O
00020          10  DRS01-COMM-DRIB-HDR   PIC X(24)     VALUE ZERO.      DRRD001O
00021          10  DRS01-COMM-DRIB-AT1   PIC X(192)    VALUE ZERO.         CL**5
00022      05  DRS01-COMM-PRT-LINE REDEFINES DRS01-COMM-DRIB.           DRRD001O
00023          10  DRS01-COMM-CTL        PIC X(1).                      DRRD001O
00024          10  DRS01-COMM-DATA       PIC X(132).                    DRRD001O
00025          10  FILLER                PIC X(83).                        CL**5
