      *                                                                         
      *  THIS IS THE LAYOUT FOR THE DRS TERMINATION BLOCK.                      
      *                                                                         
       01  DRS07-DRTB.                                                          
           05  DRS07-DRTB-TERM-BLOCK.                                           
               10  DRS07-DRTB-ID            PIC X(04)  VALUE 'DRTB'.            
               10  DRS07-DRTB-NBR-ATTR-GRPS PIC S9(04) VALUE +1 COMP.           
               10  FILLER                   PIC X(10) VALUE LOW-VALUES.         
      *****************************************************************         
      *    THE "OCCURS" VALUE ON FIELD DRS07-DRTB-ATTR-GROUP CAN BE   *         
      *    CHANGED TO INCREASE OR DECREASE THE AMOUNT OF STORAGE      *         
      *    NEEDED FOR THIS CONTROL BLOCK.  THIS GROUP LEVEL ITEM CAN  *         
      *    OCCUR UP TO 1,024 TIMES.                                   *         
      *****************************************************************         
               10  DRS07-DRTB-ATTR-GROUP OCCURS 1 TO 256 TIMES                  
                   DEPENDING ON DRS07-DRTB-NBR-ATTR-GRPS.                       
                   15  DRS07-DRTB-ATTR-INDX PIC S9(04)             COMP.        
                   15  DRS07-DRTB-DISP      PIC X(01).                          
                   15  DRS07-DRTB-CLASS     PIC X(01).                          
                   15  DRS07-DRTB-HOLD      PIC X(01).                          
                   15  DRS07-DRTB-NHOLD     PIC X(01).                          
                   15  DRS07-DRTB-DEST      PIC X(08).                          
                   15  FILLER               PIC X(18).                          
