00001 *                                                                 06/06/94
00002 *  THIS IS THE LAYOUT FOR THE DYNAMIC REPORT DETAIL LINES         DRRD004 
00003 *                                                                    LV003
00004  01  DRS02-DRIB.                                                  DRRD004 
00005      05  DRS02-DRIB-HEADER.                                       DRRD004 
00006          10  DRS02-DRIB-ID-1       PIC X(4)      VALUE 'DRIB'.    DRRD004 
00007          10  DRS02-DRIB-ATTR-COUNT PIC S9(4)     VALUE +001 COMP. DRRD004 
00008          10  DRS02-DRIB-EXTN-IND   PIC X         VALUE 'N'.       DRRD004 
00009          10  FILLER                PIC X(09)     VALUE SPACES.    DRRD004 
00010          10  DRS02-DRIB-RECFM-1    PIC X         VALUE 'F'.       DRRD004 
00011          10  DRS02-DRIB-CNTL-1     PIC X         VALUE 'A'.       DRRD004 
00012          10  FILLER                PIC X(2)      VALUE SPACES.    DRRD004 
00013          10  DRS02-DRIB-LRECL-1    PIC S9(4)     VALUE +201 COMP.    CL**3
00014          10  DRS02-DRIB-BLKSIZE-1  PIC S9(4)     VALUE +201 COMP.    CL**3
00015      05  DRS02-DRIB-ATTRIB.                                       DRRD004 
00016          10  DRS02-DRIB-DEST       PIC X(8)      VALUE SPACES.    DRRD004 
00017          10  DRS02-DRIB-WRTR       PIC X(8)      VALUE SPACES.    DRRD004 
00018          10  DRS02-DRIB-FORM       PIC X(4)      VALUE SPACES.    DRRD004 
00019          10  DRS02-DRIB-FCB        PIC X(4)      VALUE SPACES.    DRRD004 
00020          10  DRS02-DRIB-UCS        PIC X(4)      VALUE SPACES.    DRRD004 
00021          10  DRS02-DRIB-CLASS      PIC X         VALUE 'A'.       DRRD004 
00022          10  DRS02-DRIB-HOLD       PIC X         VALUE 'N'.       DRRD004 
00023          10  DRS02-DRIB-COPIES     PIC S9(4)     VALUE +001 COMP. DRRD004 
00024          10  FILLER                PIC X(8)      VALUE SPACES.    DRRD004 
00025          10  DRS02-DRIB-EXTN-ATTR.                                DRRD004 
00026              15  FILLER            PIC X(44)     VALUE SPACES.    DRRD004 
00027              15  FILLER            PIC X(01)     VALUE LOW-VALUES.DRRD004 
00028              15  FILLER            PIC X(01)     VALUE LOW-VALUES.DRRD004 
00029              15  FILLER            PIC X(01)     VALUE LOW-VALUES.DRRD004 
00030              15  FILLER            PIC X(01)     VALUE LOW-VALUES.DRRD004 
00031              15  FILLER            PIC X(01)     VALUE LOW-VALUES.DRRD004 
00032              15  FILLER            PIC X(01)     VALUE LOW-VALUES.DRRD004 
00033              15  FILLER            PIC X(01)     VALUE LOW-VALUES.DRRD004 
00034              15  FILLER            PIC X(01)     VALUE LOW-VALUES.DRRD004 
00035              15  FILLER            PIC X(28)     VALUE SPACES.    DRRD004 
00036              15  FILLER            PIC X(01)     VALUE LOW-VALUES.DRRD004 
00037              15  FILLER            PIC X(01)     VALUE SPACES.    DRRD004 
00038              15  DRS02-DRIB-SUBSYS-NAME                           DRRD004 
00039                                    PIC X(4)      VALUE SPACES.    DRRD004 
00040              15  DRS02-DRIB-SUBSYS-PARM                           DRRD004 
00041                                    PIC X(16)     VALUE SPACES.    DRRD004 
00042              15  FILLER            PIC X(50)     VALUE SPACES.    DRRD004 
