00001 *                                                                 06/06/94
00002 *  THIS IS THE LAYOUT FOR THE DYNAMIC REPORT SYSTEM COMMAREA      DRRD003 
00003 *                                                                    LV003
00004 *************************************************************     DRRD003 
00005 *   NOTE:  THIS IS A COPY OF THE DRRD001O INCLUDE.                DRRD003 
00006 *          IT HAS BEEN CHANGED TO INCREASE THE COMM-DATA FIELD    DRRD003 
00007 *          FROM 132 CHARACTERS TO 190 CHARACTERS.                    CL**2
00008 *************************************************************     DRRD003 
00009  01  DRS01-COMMAREA.                                              DRRD003 
00010      05  DRS01-COMM-DRRB.                                         DRRD003 
00011          10  DRS01-DRRB-ID         PIC X(4)      VALUE 'DRRB'.    DRRD003 
00012          10  DRS01-DRRB-FUNC       PIC X(4)      VALUE SPACES.    DRRD003 
00013          10  DRS01-DRRB-RID        PIC X(8)      VALUE SPACES.    DRRD003 
00014          10  DRS01-DRRD-OPTIONS    PIC X(4)      VALUE SPACES.    DRRD003 
00015          10  FILLER                PIC X(8)      VALUE SPACES.    DRRD003 
00016          10  DRS01-DRRB-RC         PIC S9(8)     VALUE +000 COMP. DRRD003 
00017          10  DRS01-DRRB-RCS.                                      DRRD003 
00018              15  DRS01-DRRB-RCS1   PIC S9(4)     VALUE +000 COMP. DRRD003 
00019              15  DRS01-DRRB-RCS2   PIC S9(4)     VALUE +000 COMP. DRRD003 
00020          10  DRS01-DRRB-ATTR-ERROR PIC S9(4)     VALUE +000 COMP. DRRD003 
00021          10  FILLER                PIC X(2)      VALUE SPACES.    DRRD003 
00022          10  DRS01-DRRB-DRDC       PIC S9(8)     VALUE +000 COMP. DRRD003 
00023          10  DRS01-DRRB01-LINES    PIC S9(8)     VALUE +000 COMP. DRRD003 
00024      05  DRS01-COMM-DRIB.                                         DRRD003 
00025          10  DRS01-COMM-DRIB-HDR   PIC X(24)     VALUE ZERO.      DRRD003 
00026          10  DRS01-COMM-DRIB-AT1   PIC X(192)    VALUE ZERO.      DRRD003 
00027      05  DRS01-COMM-PRT-LINE REDEFINES DRS01-COMM-DRIB.           DRRD003 
00028          10  DRS01-COMM-CTL        PIC X(1).                      DRRD003 
00029          10  DRS01-COMM-DATA       PIC X(200).                       CL**3
00030          10  FILLER                PIC X(15).                        CL**3
