00001 *                                                                 08/29/91
00002 *  THIS IS THE LAYOUT FOR THE DYNAMIC REPORT DETAIL LINES         DRRD002O
00003 *                                                                    LV007
00004  01  DRS02-DRIB.                                                  DRRD002O
00005      05  DRS02-DRIB-HEADER.                                       DRRD002O
00006          10  DRS02-DRIB-ID-1       PIC X(4)      VALUE 'DRIB'.    DRRD002O
00007          10  DRS02-DRIB-ATTR-COUNT PIC S9(4)     VALUE +001 COMP. DRRD002O
00008          10  DRS02-DRIB-EXTN-IND   PIC X         VALUE 'N'.          CL**2
00009          10  FILLER                PIC X(09)     VALUE SPACES.       CL**2
00010          10  DRS02-DRIB-RECFM-1    PIC X         VALUE 'F'.       DRRD002O
00011          10  DRS02-DRIB-CNTL-1     PIC X         VALUE 'A'.       DRRD002O
00012          10  FILLER                PIC X(2)      VALUE SPACES.    DRRD002O
00013          10  DRS02-DRIB-LRECL-1    PIC S9(4)     VALUE +133 COMP. DRRD002O
00014          10  DRS02-DRIB-BLKSIZE-1  PIC S9(4)     VALUE +133 COMP. DRRD002O
00015      05  DRS02-DRIB-ATTRIB.                                       DRRD002O
00016          10  DRS02-DRIB-DEST       PIC X(8)      VALUE SPACES.    DRRD002O
00017          10  DRS02-DRIB-WRTR       PIC X(8)      VALUE SPACES.    DRRD002O
00018          10  DRS02-DRIB-FORM       PIC X(4)      VALUE SPACES.    DRRD002O
00019          10  DRS02-DRIB-FCB        PIC X(4)      VALUE SPACES.    DRRD002O
00020          10  DRS02-DRIB-UCS        PIC X(4)      VALUE SPACES.    DRRD002O
00021          10  DRS02-DRIB-CLASS      PIC X         VALUE 'A'.       DRRD002O
00022          10  DRS02-DRIB-HOLD       PIC X         VALUE 'N'.       DRRD002O
00023          10  DRS02-DRIB-COPIES     PIC S9(4)     VALUE +001 COMP. DRRD002O
00024          10  FILLER                PIC X(8)      VALUE SPACES.    DRRD002O
00025          10  DRS02-DRIB-EXTN-ATTR.                                   CL**2
00026              15  FILLER            PIC X(44)     VALUE SPACES.       CL**3
00027              15  FILLER            PIC X(01)     VALUE LOW-VALUES.   CL**7
00028              15  FILLER            PIC X(01)     VALUE LOW-VALUES.   CL**7
00029              15  FILLER            PIC X(01)     VALUE LOW-VALUES.   CL**7
00030              15  FILLER            PIC X(01)     VALUE LOW-VALUES.   CL**7
00031              15  FILLER            PIC X(01)     VALUE LOW-VALUES.   CL**7
00032              15  FILLER            PIC X(01)     VALUE LOW-VALUES.   CL**7
00033              15  FILLER            PIC X(01)     VALUE LOW-VALUES.   CL**7
00034              15  FILLER            PIC X(01)     VALUE LOW-VALUES.   CL**7
00035              15  FILLER            PIC X(28)     VALUE SPACES.       CL**3
00036              15  FILLER            PIC X(01)     VALUE LOW-VALUES.   CL**7
00037              15  FILLER            PIC X(01)     VALUE SPACES.       CL**3
00038              15  DRS02-DRIB-SUBSYS-NAME                              CL**2
00039                                    PIC X(4)      VALUE SPACES.       CL**2
00040              15  DRS02-DRIB-SUBSYS-PARM                              CL**2
00041                                    PIC X(16)     VALUE SPACES.       CL**2
00042              15  FILLER            PIC X(50)     VALUE SPACES.       CL**2
