00001 *                                                                 08/29/91
00002 *  THIS IS THE LAYOUT FOR THE DYNAMIC REPORT SYSTEM COMMAREA      DRRD001O
00002 *  INCLUDING THE OUTPUT BLOCK                                     DRRD001O
00003 *                                                                    LV005
00004  01  DRS05-COMMAREA.                                              DRRD001O
00005      05  DRS05-COMM-DRRB.                                         DRRD001O
00006          10  DRS05-DRRB-ID         PIC X(4)      VALUE 'DRRB'.    DRRD001O
00007          10  DRS05-DRRB-FUNC       PIC X(4)      VALUE SPACES.    DRRD001O
00008          10  DRS05-DRRB-RID        PIC X(8)      VALUE SPACES.    DRRD001O
00009          10  DRS05-DRRD-OPTIONS    PIC X(4)      VALUE SPACES.    DRRD001O
00010          10  FILLER                PIC X(8)      VALUE SPACES.    DRRD001O
00011          10  DRS05-DRRB-RC         PIC S9(8)     VALUE +000 COMP. DRRD001O
00012          10  DRS05-DRRB-RCS.                                      DRRD001O
00013              15  DRS05-DRRB-RCS1   PIC S9(4)     VALUE +000 COMP. DRRD001O
00014              15  DRS05-DRRB-RCS2   PIC S9(4)     VALUE +000 COMP. DRRD001O
00015          10  DRS05-DRRB-ATTR-ERROR PIC S9(4)     VALUE +000 COMP. DRRD001O
00016          10  FILLER                PIC X(2)      VALUE SPACES.    DRRD001O
00017          10  DRS05-DRRB-DRDC       PIC S9(8)     VALUE +000 COMP. DRRD001O
00018          10  DRS05-DRRB01-LINES    PIC S9(8)     VALUE +000 COMP. DRRD001O
      *****************************************************************         
      *                                                               *         
      *  DYNAMIC REPORT SYSTEM - RELEASE 3.2                          *         
      *                                                               *         
      *  (C) COPYRIGHT - 1995                                         *         
      *                  LEVI, RAY & SHOUP, INC.                      *         
      *                  2401 WEST MONROE                             *         
      *                  SPRINGFIELD, IL 62704                        *         
      *                                                               *         
      *  DRSDROBC                                                     *         
      *  THIS IS THE COBOL VERSION OF THE DRS OUTPUT BLOCK            *         
      *                                                               *         
      ***************************************************************** DRS31009
      *                                                               * DRS31009
      *  FIX DRS31009 CHANGED THE 'VALUE' CLAUSE ON CERTAIN FIELDS    * DRS31009
      *  FROM 'N' TO SPACES TO PREVENT PROBLEMS ON VERSIONS OF JES    * DRS31009
      *  PRIOR TO JES2 4.1.                                           * DRS31009
      *                                                               * DRS31009
      ***************************************************************** DRS31009
           SKIP1                                                                
           05  DRS05-DROB-OUTPUT-BLOCK.                                         
               10  DRS05-DROB-ID           PIC X(04)  VALUE 'DROB'.             
               10  DRS05-DROB-OUTPUT-ID    PIC X(08)  VALUE SPACES.             
               10  DRS05-DROB-FUNCTION     PIC X(03)  VALUE SPACES.             
               10  DRS05-DROB-XATTR        PIC X(01)  VALUE 'N'.                
               10  DRS05-DROB-RETURN-CODE  PIC S9(08) VALUE ZEROES COMP.        
               10  DRS05-DROB-REASON-CODE  PIC S9(08) VALUE ZEROES COMP.        
               10  DRS05-DROB-TEXT-UNIT-KEY                             .       
                                           PIC S9(08) VALUE ZEROES COMP..       
               10  FILLER                  PIC X(12)  VALUE LOW-VALUES.         
           SKIP1                                                                
               10  DRS05-DROB-OUTPUT-STMT-ATTRS.                                
                   15  DRS05-DROB-ADDRESS.                                      
                       20  DRS05-DROB-ADDR1 PIC X(60) VALUE SPACES.             
                       20  DRS05-DROB-ADDR2 PIC X(60) VALUE SPACES.             
                       20  DRS05-DROB-ADDR3 PIC X(60) VALUE SPACES.             
                       20  DRS05-DROB-ADDR4 PIC X(60) VALUE SPACES.             
                   15  DRS05-DROB-BUILDING PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROB-BURST    PIC X(01)  VALUE SPACES.     DRS31009
                   15  FILLER              PIC X(03)  VALUE LOW-VALUES.         
                   15  DRS05-DROB-CHAR-ARR-TABLES.                              
                       20  DRS05-DROB-CHAR1 PIC X(04) VALUE SPACES.             
                       20  DRS05-DROB-CHAR2 PIC X(04) VALUE SPACES.             
                       20  DRS05-DROB-CHAR3 PIC X(04) VALUE SPACES.             
                       20  DRS05-DROB-CHAR4 PIC X(04) VALUE SPACES.             
                   15  DRS05-DROB-CHECKPOINT-LINES                              
                                           PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS05-DROB-CHECKPOINT-PAGES                              
                                           PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS05-DROB-CHECKPOINT-SECONDS                            
                                           PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS05-DROB-CLASS    PIC X(01)  VALUE SPACES.             
                   15  FILLER              PIC X(01)  VALUE LOW-VALUES.         
                   15  DRS05-DROB-COMPACTION-TABLE                              
                                           PIC X(08)  VALUE SPACES.             
                   15  DRS05-DROB-CONTROL  PIC X(08)  VALUE SPACES.             
                   15  DRS05-DROB-COPIES   PIC S9(04) VALUE +001 COMP.          
                   15  FILLER              PIC X(02)  VALUE LOW-VALUES.         
                   15  DRS05-DROB-COPY-GROUPS.                                  
                       20  DRS05-DROB-CPYG1 PIC X(01) VALUE LOW-VALUES.         
                       20  DRS05-DROB-CPYG2 PIC X(01) VALUE LOW-VALUES.         
                       20  DRS05-DROB-CPYG3 PIC X(01) VALUE LOW-VALUES.         
                       20  DRS05-DROB-CPYG4 PIC X(01) VALUE LOW-VALUES.         
                       20  DRS05-DROB-CPYG5 PIC X(01) VALUE LOW-VALUES.         
                       20  DRS05-DROB-CPYG6 PIC X(01) VALUE LOW-VALUES.         
                       20  DRS05-DROB-CPYG7 PIC X(01) VALUE LOW-VALUES.         
                       20  DRS05-DROB-CPYG8 PIC X(01) VALUE LOW-VALUES.         
                   15  DRS05-DROB-DATACK   PIC X(08)  VALUE SPACES.             
                   15  DRS05-DROB-DEFLT    PIC X(01)  VALUE SPACES.     DRS31009
                   15  FILLER              PIC X(03)  VALUE LOW-VALUES.         
                   15  DRS05-DROB-DEPARTMENT                                    
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROB-DESTINATION                                   
                                           PIC X(17)  VALUE SPACES.             
                   15  DRS05-DROB-DPAGELBL PIC X(01)  VALUE SPACES.     DRS31009
                   15  DRS05-DROB-FCB      PIC X(04)  VALUE SPACES.             
                   15  DRS05-DROB-FLASH    PIC X(04)  VALUE SPACES.             
                   15  DRS05-DROB-FLASH-COUNT                                   
                                           PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS05-DROB-FORMDEF  PIC X(06)  VALUE SPACES.             
                   15  DRS05-DROB-FORM     PIC X(08)  VALUE SPACES.             
                   15  DRS05-DROB-GROUP-ID PIC X(08)  VALUE SPACES.             
                   15  DRS05-DROB-INDEX    PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS05-DROB-LINDX    PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS05-DROB-LINECT   PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS05-DROB-COPY-MOD PIC X(04)  VALUE SPACES.             
                   15  DRS05-DROB-COPY-MOD-TRC                                  
                                           PIC X(01)  VALUE SPACES.             
                   15  FILLER              PIC X(03)  VALUE LOW-VALUES.         
                   15  DRS05-DROB-NAME     PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROB-NOTIFY   PIC X(17)  VALUE SPACES.             
                   15  FILLER              PIC X(01)  VALUE LOW-VALUES.         
                   15  DRS05-DROB-NORMAL-DISP                                   
                                           PIC X(08)  VALUE SPACES.             
                   15  DRS05-DROB-ABNORMAL-DISP                                 
                                           PIC X(08)  VALUE SPACES.             
                   15  DRS05-DROB-PAGEDEF  PIC X(06)  VALUE SPACES.             
                   15  DRS05-DROB-PIMSG    PIC X(01)  VALUE SPACES.     DRS31009
                   15  FILLER              PIC X(01)  VALUE LOW-VALUES.         
                   15  DRS05-DROB-PIMSG-COUNT                                   
                                           PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS05-DROB-PRMODE   PIC X(08)  VALUE SPACES.             
                   15  DRS05-DROB-INITIAL-PRIORITY                              
                                           PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS05-DROB-ROOM     PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROB-SYSAREA  PIC X(01)  VALUE SPACES.     DRS31009
                   15  FILLER              PIC X(03)  VALUE LOW-VALUES.         
                   15  DRS05-DROB-TITLE    PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROB-TRC      PIC X(01)  VALUE SPACES.     DRS31009
                   15  FILLER              PIC X(03)  VALUE LOW-VALUES.         
                   15  DRS05-DROB-UCS      PIC X(04)  VALUE SPACES.             
                   15  DRS05-DROB-WRITER   PIC X(08)  VALUE SPACES.             
                   15  DRS05-DROB-OUTPUT-DESCRIPTION                            
                                           PIC X(60)  VALUE SPACES.             
                   15  FILLER              PIC X(74)  VALUE LOW-VALUES.         
                   15  DRS05-DROBX-USERLIB-1 PIC X(44) VALUE SPACES.            
                   15  DRS05-DROBX-USERLIB-2 PIC X(44) VALUE SPACES.            
                   15  DRS05-DROBX-USERLIB-3 PIC X(44) VALUE SPACES.            
                   15  DRS05-DROBX-USERLIB-4 PIC X(44) VALUE SPACES.            
                   15  DRS05-DROBX-USERLIB-5 PIC X(44) VALUE SPACES.            
                   15  DRS05-DROBX-USERLIB-6 PIC X(44) VALUE SPACES.            
                   15  DRS05-DROBX-USERLIB-7 PIC X(44) VALUE SPACES.            
                   15  DRS05-DROBX-USERLIB-8 PIC X(44) VALUE SPACES.            
                   15  DRS05-DROBX-USERDATA-1                                   
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROBX-USERDATA-2                                   
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROBX-USERDATA-3                                   
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROBX-USERDATA-4                                   
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROBX-USERDATA-5                                   
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROBX-USERDATA-6                                   
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROBX-USERDATA-7                                   
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROBX-USERDATA-8                                   
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROBX-USERDATA-9                                   
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROBX-USERDATA-10                                  
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROBX-USERDATA-11                                  
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROBX-USERDATA-12                                  
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROBX-USERDATA-13                                  
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROBX-USERDATA-14                                  
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROBX-USERDATA-15                                  
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS05-DROBX-USERDATA-16                                  
                                           PIC X(60)  VALUE SPACES.             
                   15  FILLER              PIC X(1024) VALUE SPACES.            
