      *****************************************************************         
      *                                                               *         
      *  DYNAMIC REPORT SYSTEM - RELEASE 3.2                          *         
      *                                                               *         
      *  (C) COPYRIGHT - 1995                                         *         
      *                  LEVI, RAY & SHOUP, INC.                      *         
      *                  2401 WEST MONROE                             *         
      *                  SPRINGFIELD, IL 62704                        *         
      *                                                               *         
      *  DRSDROBC                                                     *         
      *  THIS IS THE COBOL VERSION OF THE DRS OUTPUT BLOCK            *         
      *                                                               *         
      ***************************************************************** DRS31009
      *                                                               * DRS31009
      *  FIX DRS31009 CHANGED THE 'VALUE' CLAUSE ON CERTAIN FIELDS    * DRS31009
      *  FROM 'N' TO SPACES TO PREVENT PROBLEMS ON VERSIONS OF JES    * DRS31009
      *  PRIOR TO JES2 4.1.                                           * DRS31009
      *                                                               * DRS31009
      ***************************************************************** DRS31009
           SKIP1                                                                
           05  DRS-DROB-OUTPUT-BLOCK.                                           
               10  DRS-DROB-ID             PIC X(04)  VALUE 'DROB'.             
               10  DRS-DROB-OUTPUT-ID      PIC X(08)  VALUE SPACES.             
               10  DRS-DROB-FUNCTION       PIC X(03)  VALUE SPACES.             
               10  DRS-DROB-XATTR          PIC X(01)  VALUE 'N'.                
               10  DRS-DROB-RETURN-CODE    PIC S9(08) VALUE ZEROES COMP.        
               10  DRS-DROB-REASON-CODE    PIC S9(08) VALUE ZEROES COMP.        
               10  DRS-DROB-TEXT-UNIT-KEY  PIC S9(08) VALUE ZEROES COMP.        
               10  FILLER                  PIC X(12)  VALUE LOW-VALUES.         
           SKIP1                                                                
               10  DRS-DROB-OUTPUT-STMT-ATTRS.                                  
                   15  DRS-DROB-ADDRESS.                                        
                       20  DRS-DROB-ADDR1  PIC X(60)  VALUE SPACES.             
                       20  DRS-DROB-ADDR2  PIC X(60)  VALUE SPACES.             
                       20  DRS-DROB-ADDR3  PIC X(60)  VALUE SPACES.             
                       20  DRS-DROB-ADDR4  PIC X(60)  VALUE SPACES.             
                   15  DRS-DROB-BUILDING   PIC X(60)  VALUE SPACES.             
                   15  DRS-DROB-BURST      PIC X(01)  VALUE SPACES.     DRS31009
                   15  FILLER              PIC X(03)  VALUE LOW-VALUES.         
                   15  DRS-DROB-CHAR-ARR-TABLES.                                
                       20  DRS-DROB-CHAR1  PIC X(04)  VALUE SPACES.             
                       20  DRS-DROB-CHAR2  PIC X(04)  VALUE SPACES.             
                       20  DRS-DROB-CHAR3  PIC X(04)  VALUE SPACES.             
                       20  DRS-DROB-CHAR4  PIC X(04)  VALUE SPACES.             
                   15  DRS-DROB-CHECKPOINT-LINES                                
                                           PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS-DROB-CHECKPOINT-PAGES                                
                                           PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS-DROB-CHECKPOINT-SECONDS                              
                                           PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS-DROB-CLASS      PIC X(01)  VALUE SPACES.             
                   15  FILLER              PIC X(01)  VALUE LOW-VALUES.         
                   15  DRS-DROB-COMPACTION-TABLE                                
                                           PIC X(08)  VALUE SPACES.             
                   15  DRS-DROB-CONTROL    PIC X(08)  VALUE SPACES.             
                   15  DRS-DROB-COPIES     PIC S9(04) VALUE ZEROES COMP.        
                   15  FILLER              PIC X(02)  VALUE LOW-VALUES.         
                   15  DRS-DROB-COPY-GROUPS.                                    
                       20  DRS-DROB-CPYG1  PIC X(01)  VALUE LOW-VALUES.         
                       20  DRS-DROB-CPYG2  PIC X(01)  VALUE LOW-VALUES.         
                       20  DRS-DROB-CPYG3  PIC X(01)  VALUE LOW-VALUES.         
                       20  DRS-DROB-CPYG4  PIC X(01)  VALUE LOW-VALUES.         
                       20  DRS-DROB-CPYG5  PIC X(01)  VALUE LOW-VALUES.         
                       20  DRS-DROB-CPYG6  PIC X(01)  VALUE LOW-VALUES.         
                       20  DRS-DROB-CPYG7  PIC X(01)  VALUE LOW-VALUES.         
                       20  DRS-DROB-CPYG8  PIC X(01)  VALUE LOW-VALUES.         
                   15  DRS-DROB-DATACK     PIC X(08)  VALUE SPACES.             
                   15  DRS-DROB-DEFLT      PIC X(01)  VALUE SPACES.     DRS31009
                   15  FILLER              PIC X(03)  VALUE LOW-VALUES.         
                   15  DRS-DROB-DEPARTMENT                                      
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROB-DESTINATION                                     
                                           PIC X(17)  VALUE SPACES.             
                   15  DRS-DROB-DPAGELBL   PIC X(01)  VALUE SPACES.     DRS31009
                   15  DRS-DROB-FCB        PIC X(04)  VALUE SPACES.             
                   15  DRS-DROB-FLASH      PIC X(04)  VALUE SPACES.             
                   15  DRS-DROB-FLASH-COUNT                                     
                                           PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS-DROB-FORMDEF    PIC X(06)  VALUE SPACES.             
                   15  DRS-DROB-FORM       PIC X(08)  VALUE SPACES.             
                   15  DRS-DROB-GROUP-ID   PIC X(08)  VALUE SPACES.             
                   15  DRS-DROB-INDEX      PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS-DROB-LINDX      PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS-DROB-LINECT     PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS-DROB-COPY-MOD   PIC X(04)  VALUE SPACES.             
                   15  DRS-DROB-COPY-MOD-TRC                                    
                                           PIC X(01)  VALUE SPACES.             
                   15  FILLER              PIC X(03)  VALUE LOW-VALUES.         
                   15  DRS-DROB-NAME       PIC X(60)  VALUE SPACES.             
                   15  DRS-DROB-NOTIFY     PIC X(17)  VALUE SPACES.             
                   15  FILLER              PIC X(01)  VALUE LOW-VALUES.         
                   15  DRS-DROB-NORMAL-DISP                                     
                                           PIC X(08)  VALUE SPACES.             
                   15  DRS-DROB-ABNORMAL-DISP                                   
                                           PIC X(08)  VALUE SPACES.             
                   15  DRS-DROB-PAGEDEF    PIC X(06)  VALUE SPACES.             
                   15  DRS-DROB-PIMSG      PIC X(01)  VALUE SPACES.     DRS31009
                   15  FILLER              PIC X(01)  VALUE LOW-VALUES.         
                   15  DRS-DROB-PIMSG-COUNT                                     
                                           PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS-DROB-PRMODE     PIC X(08)  VALUE SPACES.             
                   15  DRS-DROB-INITIAL-PRIORITY                                
                                           PIC S9(04) VALUE ZEROES COMP.        
                   15  DRS-DROB-ROOM       PIC X(60)  VALUE SPACES.             
                   15  DRS-DROB-SYSAREA    PIC X(01)  VALUE SPACES.     DRS31009
                   15  FILLER              PIC X(03)  VALUE LOW-VALUES.         
                   15  DRS-DROB-TITLE      PIC X(60)  VALUE SPACES.             
                   15  DRS-DROB-TRC        PIC X(01)  VALUE SPACES.     DRS31009
                   15  FILLER              PIC X(03)  VALUE LOW-VALUES.         
                   15  DRS-DROB-UCS        PIC X(04)  VALUE SPACES.             
                   15  DRS-DROB-WRITER     PIC X(08)  VALUE SPACES.             
                   15  DRS-DROB-OUTPUT-DESCRIPTION                              
                                           PIC X(60)  VALUE SPACES.             
                   15  FILLER              PIC X(74)  VALUE LOW-VALUES.         
                   15  DRS-DROBX-USERLIB-1 PIC X(44)  VALUE SPACES.             
                   15  DRS-DROBX-USERLIB-2 PIC X(44)  VALUE SPACES.             
                   15  DRS-DROBX-USERLIB-3 PIC X(44)  VALUE SPACES.             
                   15  DRS-DROBX-USERLIB-4 PIC X(44)  VALUE SPACES.             
                   15  DRS-DROBX-USERLIB-5 PIC X(44)  VALUE SPACES.             
                   15  DRS-DROBX-USERLIB-6 PIC X(44)  VALUE SPACES.             
                   15  DRS-DROBX-USERLIB-7 PIC X(44)  VALUE SPACES.             
                   15  DRS-DROBX-USERLIB-8 PIC X(44)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-1                                     
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-2                                     
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-3                                     
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-4                                     
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-5                                     
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-6                                     
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-7                                     
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-8                                     
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-9                                     
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-10                                    
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-11                                    
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-12                                    
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-13                                    
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-14                                    
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-15                                    
                                           PIC X(60)  VALUE SPACES.             
                   15  DRS-DROBX-USERDATA-16                                    
                                           PIC X(60)  VALUE SPACES.             
                   15  FILLER              PIC X(1024) VALUE SPACES.            
