000100 IDENTIFICATION DIVISION.                                         00010009
000200 PROGRAM-ID.     DSKUT407.                                        00020009
000300 AUTHOR.         RICHARD MOORE.                                   00030009
000400*DATE-WRITTEN.   12/01/98.                                        00040009
000500*DATE-COMPILED.                                                   00050009
000600*************************************************************     00060009
000700*    INSERT GROUP 2 DATA INTO QA                                  00070009
000700*                                                                 00070109
000700* CHANGES:                                                        00070209
000700*                                                                 00070309
004510* 08/10/2022  J KURK   - RECOMPILE FOR COPYBOOK DSPD002           00071009
000800*************************************************************     00080009
000900                                                                  00090009
001000 ENVIRONMENT DIVISION.                                            00100009
001100                                                                  00110009
001200 INPUT-OUTPUT SECTION.                                            00120009
001300                                                                  00130009
001400 FILE-CONTROL.                                                    00140009
001500                                                                  00150009
001600     SELECT PO-NBR-FILE                                           00160009
001700         ASSIGN         TO UT-S-PO01.                             00170009
001800     SELECT TBLE-FILE                                             00180009
001900         ASSIGN         TO UT-S-TBL01.                            00190009
002000     SELECT CONTROL-FILE                                          00200009
002100         ASSIGN         TO UT-S-CTL01.                            00210009
002200                                                                  00220009
002300 DATA DIVISION.                                                   00230009
002400                                                                  00240009
002500 FILE SECTION.                                                    00250009
002600******************************************************************00260009
002700     COPY DSFD001.                                                00270009
002800                                                                  00280009
002900 WORKING-STORAGE SECTION.                                         00290009
003000 01  PV-OTHER-CRAPOLA.                                            00300009
003100     05  PV-TOTAL-COUNT               PIC S9(9) COMP-3 VALUE      00310009
003200                                                   ZERO.          00320009
003300     05  PV-DISP-SQLCODE              PIC -999.                   00330009
003400     05  PV-DISP-NBR                  PIC Z(8)9.                  00340009
003500     05  PV-WHEN-COMPILED.                                        00350009
003600         10  PV-COMPILE-DATE          PIC X(08).                  00360009
003700         10  PV-COMPILE-TIME          PIC X(08).                  00370009
003710                                                                  00371009
003720 01  PC-CONSTANTS.                                                00372009
003730     05  PC-90                       PIC S9(04)    COMP           00373009
003740                                                   VALUE 90.      00374009
003750     05  PC-A                        PIC  X(01)    VALUE 'A'.     00375009
003760     05  PC-Y                        PIC  X(01)    VALUE 'Y'.     00376009
003770     05  PC-RCV                      PIC  X(03)    VALUE 'RCV'.   00377009
003780     05  PC-KHL                      PIC  X(03)    VALUE 'KHL'.   00378009
003790     05  PC-PRDCHK                   PIC  X(06)    VALUE 'PRDCHK'.00379009
003791     05  PC-PARM-TEXT                PIC  X(25)    VALUE          00379109
003792         'LOWER LEVEL ONLY         '.                             00379209
003793     05  PC-CURRENT-PROGRAM-NAME     PIC  X(08)    VALUE          00379309
003794         'DSKUT407'.                                              00379409
003795                                                                  00379509
003796 01  WS-LOCAL-SERVER.                                             00379609
003797     05  WS-SUBSYS                   PIC X(04)  VALUE SPACES.     00379709
003798     05  FILLER                      PIC X(12)  VALUE SPACES.     00379809
003799/                                                                 00379909
003800     COPY DPWS004.                                                00380009
003900     COPY DSWS08Q.                                                00390009
004000     COPY DSWS009.                                                00400009
004100     COPY DSWS10Q.                                                00410009
004200     COPY DSRD002.                                                00420009
004300                                                                  00430009
004400*  COMMUNICATIONS AREA FOR PROD TO TEST UTILITIES                 00440009
004500     COPY DSWS11Q.                                                00450009
004600******************************************************************00460009
004700*                                                                 00470009
004800******************************************************************00480009
004900*LINKAGE SECTION.                                                 00490009
005000******************************************************************00500009
005100*                                                                 00510009
005200 PROCEDURE DIVISION.                                              00520009
005300                                                                  00530009
005400 A100-MAINLINE.                                                   00540009
005500                                                                  00550009
005600     MOVE WHEN-COMPILED TO PV-WHEN-COMPILED                       00560009
005700     DISPLAY SPACES                                               00570009
005800     DISPLAY ' *** DSKUT407 VERSION 2 ***'                        00580009
005900     DISPLAY 'COMPILE DATE: ' PV-COMPILE-DATE                     00590009
006000             ' ' PV-COMPILE-TIME                                  00600009
006100                                                                  00610009
006200     PERFORM 1100-GET-DB2-INSTANCE.                               00620009
006210     PERFORM 1200-CHECK-IF-PRODUCTION.                            00621009
006220                                                                  00622009
006230     SET DS009-I-PGM TO TRUE.                                     00623009
006240     PERFORM DS002-INITIAL-PROCESSING.                            00624009
006250     PERFORM B100-PROCESSING                                      00625009
006260         UNTIL TABLE-EOF.                                         00626009
006270                                                                  00627009
006280     PERFORM 9000-DUMP-COUNT-TABLE                                00628009
006290                                                                  00629009
006300     PERFORM DS002-END-OF-JOB.                                    00630009
006400                                                                  00640009
006500     GOBACK.                                                      00650009
006600 EJECT                                                            00660009
006700                                                                  00670009
006800 B100-PROCESSING.                                                 00680009
006900*                                                                 00690009
007000***************************************************************** 00700009
007100*     FOR EACH TABLE, INSERT DATA INTO THE TABLES                 00710009
007200***************************************************************** 00720009
007300*                                                                 00730009
007400     READ TBLE-FILE                                               00740009
007500         AT END SET TABLE-EOF TO TRUE.                            00750009
007600     IF NOT-TABLE-EOF                                             00760009
007700        MOVE TBLE-DATA-SIZE TO DS009-TBLE-DATA-SIZE               00770009
007800        MOVE TBLE-NAME  TO DS009-PROCESS-TABLE                    00780009
007900        MOVE TBLE-KEYS  TO DS009-PKYS                             00790009
008000        PERFORM DS002-DO-PROCESS                                  00800009
008100        IF DS009-DO-PROCESS                                       00810009
008200*       DISPLAY '**********************************'              00820009
008300*       DISPLAY DS009-PROCESS-TABLE                               00830009
008400        EVALUATE TRUE                                             00840009
008500         WHEN DS009-PROCESS-TABLE = 'TSHPTPO'                     00850009
008600             MOVE TBLE-DATA-ITEM TO WS-SHPTPO                     00860009
008700             MOVE WS-SHPTPO-PO-NBR TO HOLD-PO-NBR                 00870009
008800*            DISPLAY HOLD-PO-NBR                                  00880009
008900*            DISPLAY WS-SHPTPO                                    00890009
009000             PERFORM R100-INSERT                                  00900009
009100         WHEN DS009-PROCESS-TABLE = 'TPKSLIP'                     00910009
009200             MOVE TBLE-DATA-ITEM TO WS-PKSLIP                     00920009
009300             MOVE WS-PKSLIP-PO-NBR TO HOLD-PO-NBR                 00930009
009400*            DISPLAY HOLD-PO-NBR                                  00940009
009500*            DISPLAY WS-PKSLIP                                    00950009
009600             PERFORM R100-INSERT                                  00960009
009700         WHEN DS009-PROCESS-TABLE = 'TPKITEM'                     00970009
009800             MOVE TBLE-DATA-ITEM TO WS-PKITEM                     00980009
009900*            MOVE WS-PKITEM-PO-NBR TO HOLD-PO-NBR                 00990009
010000*            DISPLAY HOLD-PO-NBR                                  01000009
010100*            DISPLAY WS-PKITEM                                    01010009
010200             PERFORM R100-INSERT                                  01020009
010300         WHEN DS009-PROCESS-TABLE = 'TRECEIV'                     01030009
010400             MOVE TBLE-DATA-ITEM TO WS-RECEIV                     01040009
010500*            DISPLAY 'TBLE DATA ITEM' TBLE-DATA-ITEM              01050009
010600             MOVE WS-RECEIV-ORD-NBR TO HOLD-PO-NBR                01060009
010700*            DISPLAY HOLD-PO-NBR                                  01070009
010800*            DISPLAY WS-RECEIV                                    01080009
010900             PERFORM R100-INSERT                                  01090009
011000         WHEN DS009-PROCESS-TABLE = 'TRECITM'                     01100009
011100             MOVE TBLE-DATA-ITEM TO WS-RECITM                     01110009
011200             MOVE WS-RECITM-ORD-NBR TO HOLD-PO-NBR                01120009
011300*            DISPLAY HOLD-PO-NBR                                  01130009
011400*            DISPLAY WS-RECITM                                    01140009
011500             PERFORM R100-INSERT                                  01150009
011600         WHEN DS009-PROCESS-TABLE = 'TRECDIS'                     01160009
011700             MOVE TBLE-DATA-ITEM TO WS-RECDIS                     01170009
011800             MOVE WS-RECDIS-ORD-NBR TO HOLD-PO-NBR                01180009
011900*            DISPLAY HOLD-PO-NBR                                  01190009
012000*            DISPLAY WS-RECDIS                                    01200009
012100             PERFORM R100-INSERT                                  01210009
012200         WHEN DS009-PROCESS-TABLE = 'TVHTRIP'                     01220009
012300             MOVE TBLE-DATA-ITEM TO WS-VHTRIP                     01230009
012400             MOVE WS-VHTRIP-TRIP-ID  TO HOLD-TRIP-ID              01240009
012500             DISPLAY ' TVHTRIP-ID = ' HOLD-TRIP-ID                01250009
012600*            DISPLAY WS-VHTRIP                                    01260009
012700             PERFORM R100-INSERT                                  01270009
012800         WHEN DS009-PROCESS-TABLE = 'TSHIPMT'                     01280009
012900             MOVE TBLE-DATA-ITEM TO WS-SHIPMT                     01290009
013000             MOVE WS-SHIPMT-SHIPT-ID TO HOLD-SHIPT-ID             01300009
013100             DISPLAY 'SHIPMT-SHIPT-ID = ' HOLD-SHIPT-ID           01310009
013200             DISPLAY 'SHIPMT-TRIP-ID = ' HOLD-TRIP-ID             01320009
013300*            DISPLAY WS-SHIPMT                                    01330009
013400             PERFORM R100-INSERT                                  01340009
013500         WHEN DS009-PROCESS-TABLE = 'TSHIPST'                     01350009
013600             MOVE TBLE-DATA-ITEM TO WS-SHIPST                     01360009
013700             MOVE WS-SHIPST-SHIPT-ID TO HOLD-SHIPT-ID             01370009
013800*            DISPLAY HOLD-SHIPT-ID                                01380009
013900*            DISPLAY WS-SHIPST                                    01390009
014000             PERFORM R100-INSERT                                  01400009
014100         WHEN DS009-PROCESS-TABLE = 'TTRIPST'                     01410009
014200             MOVE TBLE-DATA-ITEM TO WS-TRIPST                     01420009
014300             MOVE WS-TRIPST-TRIP-ID  TO HOLD-TRIP-ID              01430009
014400*            DISPLAY HOLD-TRIP-ID                                 01440009
014500*            DISPLAY WS-TRIPST                                    01450009
014600             PERFORM R100-INSERT                                  01460009
014700         WHEN DS009-PROCESS-TABLE = 'TVEHICL'                     01470009
014800             MOVE TBLE-DATA-ITEM TO WS-VEHICL                     01480009
014900             MOVE WS-VEHICL-OWNER-SCAC-ID TO HOLD-SCAC-ID         01490009
015000             MOVE WS-VEHICL-VEH-NBR       TO HOLD-VEH-NBR         01500009
015100*            DISPLAY HOLD-VEH-NBR                                 01510009
015200*            DISPLAY HOLD-SCAC-ID                                 01520009
015300*            DISPLAY WS-VEHICL                                    01530009
015400             PERFORM R100-INSERT                                  01540009
015500         WHEN DS009-PROCESS-TABLE = 'TRECDVS'                     01550009
015600             MOVE TBLE-DATA-ITEM TO WS-RECDVS                     01560009
015700             MOVE WS-RECDVS-ORD-NBR       TO HOLD-PO-NBR          01570009
015800*            DISPLAY HOLD-PO-NBR                                  01580009
015900*            DISPLAY WS-RECDVS                                    01590009
016000             PERFORM R100-INSERT                                  01600009
016100         WHEN DS009-PROCESS-TABLE = 'TAUTRIP'                     01610009
016200             MOVE TBLE-DATA-ITEM TO WS-AUTRIP                     01620009
016300             MOVE WS-AUTRIP-TRIP-ID       TO HOLD-TRIP-ID         01630009
016400*            DISPLAY HOLD-TRIP-ID                                 01640009
016500*            DISPLAY WS-AUTRIP                                    01650009
016600             PERFORM R100-INSERT                                  01660009
016700         WHEN DS009-PROCESS-TABLE = 'TAUSHIP'                     01670009
016800             MOVE TBLE-DATA-ITEM          TO WS-AUSHIP            01680009
016900             MOVE WS-AUSHIP-SHIPT-ID      TO HOLD-SHIPT-ID        01690009
017000*            DISPLAY HOLD-SHIPT-ID                                01700009
017100*            DISPLAY WS-AUSHIP                                    01710009
017200             PERFORM R100-INSERT                                  01720009
017300         WHEN DS009-PROCESS-TABLE = 'TAUSHPO'                     01730009
017400             MOVE TBLE-DATA-ITEM          TO WS-AUSHPO            01740009
017500             MOVE WS-AUSHPO-PO-NBR        TO HOLD-PO-NBR          01750009
017600*            DISPLAY HOLD-PO-NBR                                  01760009
017700*            DISPLAY WS-AUSHPO                                    01770009
017800             PERFORM R100-INSERT                                  01780009
017900         WHEN DS009-PROCESS-TABLE = 'TAUVHCL'                     01790009
018000             MOVE TBLE-DATA-ITEM          TO WS-AUVHCL            01800009
018100             MOVE WS-AUVHCL-OWNER-SCAC-ID TO HOLD-OWNER-SCAC-ID   01810009
018200             MOVE WS-AUVHCL-VEH-NBR       TO HOLD-VEH-NBR         01820009
018300*            DISPLAY HOLD-OWNER-SCAC-ID                           01830009
018400*            DISPLAY HOLD-VEH-NBR                                 01840009
018500*            DISPLAY WS-AUVHCL                                    01850009
018600             PERFORM R100-INSERT                                  01860009
018700         WHEN DS009-PROCESS-TABLE = 'TDISTHD'                     01870009
018800             MOVE TBLE-DATA-ITEM          TO WS-DISTHD            01880009
018900             MOVE WS-DISTHD-ORD-NBR       TO HOLD-ORD-NBR         01890009
019000*            DISPLAY HOLD-ORD-NBR                                 01900009
019100*            DISPLAY WS-DISTHD                                    01910009
019200             PERFORM R100-INSERT                                  01920009
019300         WHEN DS009-PROCESS-TABLE = 'TDISTDT'                     01930009
019400             MOVE TBLE-DATA-ITEM          TO WS-DISTDT            01940009
019500             MOVE WS-DISTDT-ORD-NBR       TO HOLD-ORD-NBR         01950009
019600*            DISPLAY HOLD-ORD-NBR                                 01960009
019700*            DISPLAY WS-DISTDT                                    01970009
019800             PERFORM R100-INSERT                                  01980009
019900         WHEN DS009-PROCESS-TABLE = 'TWRKORD'                     01990009
020000             MOVE TBLE-DATA-ITEM          TO WS-WRKORD            02000009
020100             MOVE WS-WRKORD-ORD-NBR       TO HOLD-ORD-NBR         02010009
020200*            DISPLAY HOLD-ORD-NBR                                 02020009
020300*            DISPLAY WS-WRKORD                                    02030009
020400             PERFORM R100-INSERT                                  02040009
020500         WHEN DS009-PROCESS-TABLE = 'TWKORIN'                     02050009
020600             MOVE TBLE-DATA-ITEM          TO WS-WKORIN            02060009
020700             MOVE WS-WKORIN-ORD-NBR       TO HOLD-ORD-NBR         02070009
020800*            DISPLAY HOLD-ORD-NBR                                 02080009
020900*            DISPLAY WS-WKORIN                                    02090009
021000             PERFORM R100-INSERT                                  02100009
021100         WHEN DS009-PROCESS-TABLE = 'TSHPSUM'                     02110009
021200             MOVE TBLE-DATA-ITEM          TO WS-SHPSUM            02120009
021300             MOVE WS-SHPSUM-PO-NBR        TO HOLD-PO-NBR          02130009
021400*            DISPLAY HOLD-PO-NBR                                  02140009
021500*            DISPLAY WS-SHPSUM                                    02150009
021600             PERFORM R100-INSERT                                  02160009
021700         WHEN DS009-PROCESS-TABLE = 'TLBVRDA'                     02170009
021800             MOVE TBLE-DATA-ITEM          TO WS-LBVRDA            02180009
021900             MOVE WS-LBVRDA-PO-NBR        TO HOLD-PO-NBR          02190009
022000*            DISPLAY HOLD-PO-NBR                                  02200009
022100*            DISPLAY WS-LBVRDA                                    02210009
022200             PERFORM R100-INSERT                                  02220009
022300         WHEN DS009-PROCESS-TABLE = 'TLBPTDA'                     02230009
022400             MOVE TBLE-DATA-ITEM          TO WS-LBPTDA            02240009
022500             MOVE WS-LBPTDA-TRIP-ID       TO HOLD-TRIP-ID         02250009
022600*            DISPLAY HOLD-TRIP-ID                                 02260009
022700*            DISPLAY WS-LBPTDA                                    02270009
022800             PERFORM R100-INSERT                                  02280009
022900         END-EVALUATE                                             02290009
023000                                                                  02300009
023100         IF SQLCODE = ZERO                                        02310009
023200             SET DS009-SRCH-IDX TO +1                             02320009
023300             SEARCH DS009-CNTL-RECORDS                            02330009
023400                 VARYING DS009-SRCH-IDX                           02340009
023500                 AT END                                           02350009
023600                     CONTINUE                                     02360009
023700                 WHEN CNTL-TABLE (DS009-SRCH-IDX) =               02370009
023800                          DS009-PROCESS-TABLE                     02380009
023900*                    ADD SQLERRD(3)                               02390009
024000                     ADD +1                                       02400009
024100                        TO DS009-READ-COUNT (DS009-SRCH-IDX)      02410009
024200             END-SEARCH                                           02420009
024300         END-IF                                                   02430009
024400                                                                  02440009
024500                                                                  02450009
024600*        DISPLAY 'RETURN SQLCODE ON INSERT:' SQLCODE              02460009
024700*        DISPLAY 'NUMBER OF ROWS INSERTED:' SQLERRD (3)           02470009
024800         IF DS009-UPDATE-COUNT > DS009-COMMIT-COUNT               02480009
024900            EXEC SQL                                              02490009
025000                COMMIT                                            02500009
025100            END-EXEC                                              02510009
025200            IF SQLCODE NOT = ZERO                                 02520009
025300               PERFORM DS002-SQL-ABEND-COMMIT                     02530009
025400            END-IF                                                02540009
025500            MOVE +0  TO DS009-UPDATE-COUNT                        02550009
025600*           DISPLAY 'COMMIT TAKEN AFTER RECORD: '                 02560009
025700*                                     DS009-TUPDATE-COUNT         02570009
025800         END-IF                                                   02580009
025900         ADD SQLERRD(3) TO DS009-UPDATE-COUNT                     02590009
026000         ADD SQLERRD(3) TO DS009-TUPDATE-COUNT                    02600009
026100        END-IF                                                    02610009
026200     END-IF.                                                      02620009
026300                                                                  02630009
026400 EJECT                                                            02640009
026500***************************************************************** 02650009
026600*     INSERT SHPTPO DATA                                          02660009
026700***************************************************************** 02670009
026800*                                                                 02680009
026900 R100-INSERT.                                                     02690009
027000*                                                                 02700009
027100     PERFORM WITH TEST AFTER                                      02710009
027200        VARYING DS009-RETRY-COUNTER FROM 1 BY 1                   02720009
027300        UNTIL   DS009-RETRY-COUNTER > 3 OR                        02730009
027400                SQLCODE = ZERO OR -803 OR -530                    02740009
027500          EVALUATE TRUE                                           02750009
027600          WHEN DS009-PROCESS-TABLE = 'TSHPTPO'                    02760009
027700          EXEC SQL                                                02770009
027800              INSERT INTO TSHPTPO                                 02780009
027900                 (                                                02790009
028000                  SHIPT_ID                                        02800009
028100                 ,PO_NBR                                          02810009
028200*                ,DEPT_NBR                                        02820009
028300                 ,REC_SEQ_NBR                                     02830009
028400                 ,EXPTED_CART_CNT                                 02840009
028500                 ,ACTL_CART_CNT                                   02850009
028600                 ,DMG_CART_CNT                                    02860009
028700                 ,PKSL_IND                                        02870009
028800                 ,VEND_NAME                                       02880009
028900                 ,FRGT_CHG_AMT                                    02890009
029000                 ,LAST_UPD_PGM_ID                                 02900009
029100                 ,CRE_USER_ID                                     02910009
029200                 ,CARR_CART_CT                                    02920009
029300                 ,CARR_LAST_UPD_DTE                               02930009
029400                 ,CARR_LAST_UPD_TIME                              02940009
029500                 ,VEND_CART_CT                                    02950009
029600                 ,VEND_LAST_UPD_DTE                               02960009
029700                 ,VEND_LAST_UPD_TIME                              02970009
029800                 ,CRE_TMST                                        02980009
029900                 ,LAST_UPD_DTE                                    02990009
030000                 ,LAST_UPD_TIME                                   03000009
030100                 ,LAST_UPD_USER_ID                                03010009
030200                 ,PRIM_SHIPT_IND                                  03020009
030300                 ,SPLT_XMIT_IND                                   03030009
030400                 ,SPLT_XMIT_DTE                                   03040009
030500                 ,SPLT_XMIT_TM                                    03050009
030600                )                                                 03060009
030700            VALUES (                                              03070009
030800                 :WS-SHPTPO-SHIPT-ID                              03080009
030900                ,:WS-SHPTPO-PO-NBR                                03090009
031000*               ,:WS-SHPTPO-DEPT-NBR                              03100009
031100                ,:WS-SHPTPO-REC-SEQ-NBR                           03110009
031200                ,:WS-SHPTPO-EXPTED-CART-CNT                       03120009
031300                ,:WS-SHPTPO-ACTL-CART-CNT                         03130009
031400                ,:WS-SHPTPO-DMG-CART-CNT                          03140009
031500                ,:WS-SHPTPO-PKSL-IND                              03150009
031600                ,:WS-SHPTPO-VEND-NAME                             03160009
031700                ,:WS-SHPTPO-FRGT-CHG-AMT                          03170009
031800                ,:WS-SHPTPO-LAST-UPD-PGM-ID                       03180009
031900                ,:WS-SHPTPO-CRE-USER-ID                           03190009
032000                ,:WS-SHPTPO-CARR-CART-CT                          03200009
032100                ,:WS-SHPTPO-CARR-LAST-UPD-DTE                     03210009
032200                ,:WS-SHPTPO-CARR-LAST-UPD-TIME                    03220009
032300                ,:WS-SHPTPO-VEND-CART-CT                          03230009
032400                ,:WS-SHPTPO-VEND-LAST-UPD-DTE                     03240009
032500                ,:WS-SHPTPO-VEND-LAST-UPD-TIME                    03250009
032600                ,:WS-SHPTPO-CRE-TMST                              03260009
032700                ,:WS-SHPTPO-LAST-UPD-DTE                          03270009
032800                ,:WS-SHPTPO-LAST-UPD-TIME                         03280009
032900                ,:WS-SHPTPO-LAST-UPD-USER-ID                      03290009
033000                ,:WS-SHPTPO-PRIM-SHIPT-IND                        03300009
033100                ,:WS-SHPTPO-SPLT-XMIT-IND                         03310009
033200                ,:WS-SHPTPO-SPLT-XMIT-DTE                         03320009
033300                ,:WS-SHPTPO-SPLT-XMIT-TM                          03330009
033400                   )                                              03340009
033500          END-EXEC                                                03350009
033600          WHEN DS009-PROCESS-TABLE = 'TPKSLIP'                    03360009
033700          EXEC SQL                                                03370009
033800              INSERT INTO TPKSLIP                                 03380009
033900                (                                                 03390009
034000                  PO_NBR                                          03400009
034100                 ,SEQ_NBR                                         03410009
034200                 ,CRE_TMST                                        03420009
034300                 ,VER_STAT_CDE                                    03430009
034400                 ,OPER_UNT_ID                                     03440009
034500                 ,FCLTY_ID                                        03450009
034600                 ,PKSL_NBR                                        03460009
034700                 ,STR_DEST_NBR                                    03470009
034800                 ,REC_SEQ_NBR                                     03480009
034900                 ,SHIPT_ID                                        03490009
035000                 ,BOL_NBR                                         03500009
035100                 ,PRO_NBR                                         03510009
035200                 ,PKSL_STAT_CDE                                   03520009
035300                 ,CRE_UID                                         03530009
035400                 ,PO_VER_NBR                                      03540009
035500                 ,CRE_SRC_CDE                                     03550009
035600                 ,EXPTED_PKG_QTY                                  03560009
035700                 ,OWNER_SCAC_ID                                   03570009
035800                 ,ASN_NBR                                         03580009
035900                 ,VEND_SHIP_DTE                                   03590009
036000                 ,PKSL_PG_CNT                                     03600009
036100                 ,CONTNR_ID                                       03610009
036110                 ,ORIG_PKSL_SEQ_NBR                               03611009
036120                )                                                 03612009
036130            VALUES (                                              03613009
036140                 :WS-PKSLIP-PO-NBR                                03614009
036150                ,:WS-PKSLIP-SEQ-NBR                               03615009
036160                ,:WS-PKSLIP-CRE-TMST                              03616009
036170                ,:WS-PKSLIP-VER-STAT-CDE                          03617009
036180                ,:WS-PKSLIP-OPER-UNT-ID                           03618009
036190                ,:WS-PKSLIP-FCLTY-ID                              03619009
036200                ,:WS-PKSLIP-PKSL-NBR                              03620009
036300                ,:WS-PKSLIP-STR-DEST-NBR                          03630009
036400                ,:WS-PKSLIP-REC-SEQ-NBR                           03640009
036500                ,:WS-PKSLIP-SHIPT-ID                              03650009
036600                ,:WS-PKSLIP-BOL-NBR                               03660009
036700                ,:WS-PKSLIP-PRO-NBR                               03670009
036800                ,:WS-PKSLIP-PKSL-STAT-CDE                         03680009
036900                ,:WS-PKSLIP-CRE-UID                               03690009
037000                ,:WS-PKSLIP-PO-VER-NBR                            03700009
037100                ,:WS-PKSLIP-CRE-SRC-CDE                           03710009
037200                ,:WS-PKSLIP-EXPTED-PKG-QTY                        03720009
037300                ,:WS-PKSLIP-OWNER-SCAC-ID                         03730009
037400                ,:WS-PKSLIP-ASN-NBR                               03740009
037500                ,:WS-PKSLIP-VEND-SHIP-DTE                         03750009
037600                ,:WS-PKSLIP-PKSL-PG-CNT                           03760009
037700                ,:WS-PKSLIP-CONTNR-ID                             03770009
037800                ,:WS-PKSLIP-ORIG-PKSL-SEQ-NBR                     03780009
037900                   )                                              03790009
038000          END-EXEC                                                03800009
038100          WHEN DS009-PROCESS-TABLE = 'TPKITEM'                    03810009
038200          EXEC SQL                                                03820009
038300              INSERT INTO TPKITEM                                 03830009
038400                (                                                 03840009
038500                  PO_NBR                                          03850009
038600                 ,SEQ_NBR                                         03860009
038700                 ,PKSL_LNE_NBR                                    03870009
038800                 ,CRE_TMST                                        03880009
038900                 ,VER_STAT_CDE                                    03890009
039000                 ,PKSL_ITM_QTY                                    03900009
039100                 ,CRE_UID                                         03910009
039200                 ,PURITM_VER_NBR                                  03920009
039300                 ,ORIG_PKSL_ITM_QTY                               03930009
039400                )                                                 03940009
039500            VALUES (                                              03950009
039600                 :WS-PKITEM-PO-NBR                                03960009
039700                ,:WS-PKITEM-SEQ-NBR                               03970009
039800                ,:WS-PKITEM-PKSL-LNE-NBR                          03980009
039900                ,:WS-PKITEM-CRE-TMST                              03990009
040000                ,:WS-PKITEM-VER-STAT-CDE                          04000009
040100                ,:WS-PKITEM-PKSL-ITM-QTY                          04010009
040200                ,:WS-PKITEM-CRE-UID                               04020009
040300                ,:WS-PKITEM-PURITM-VER-NBR                        04030009
040400                ,:WS-PKITEM-ORIG-PKSL-ITM-QTY                     04040009
040500                   )                                              04050009
040600          END-EXEC                                                04060009
040700          WHEN DS009-PROCESS-TABLE = 'TRECEIV'                    04070009
040800*         DISPLAY 'WE-RECEIV' WS-RECEIV                           04080009
040900*         DISPLAY 'STAT CDE ' WS-RECEIV-STATUS-CDE                04090009
041000          EXEC SQL                                                04100009
041100              INSERT INTO TRECEIV                                 04110009
041200                (                                                 04120009
041300                  ORD_NBR                                         04130009
041400                 ,REC_SEQ_NBR                                     04140009
041500                 ,CRE_TMST                                        04150009
041600                 ,CRE_UID                                         04160009
041700                 ,PO_VER_NBR                                      04170009
041800                 ,OPER_UNT_ID                                     04180009
041900                 ,FCLTY_ID                                        04190009
042000                 ,STATUS_CDE                                      04200009
042100                 ,SYST_CRE_CDE                                    04210009
042200                 ,REC_TYP_CDE                                     04220009
042300                 ,VER_STATUS_CDE                                  04230009
042400                 ,PACK_BY_ST_IND                                  04240009
042500                 ,REC_TMST                                        04250009
042600                 ,EXPTED_CART_CNT                                 04260009
042700                 ,ACTL_CART_CNT                                   04270009
042800                 ,EXPTED_ITM_QTY                                  04280009
042900                 ,ACTL_ITM_QTY                                    04290009
043000                 ,RCVR_NBR                                        04300009
043100                 ,ML_POST_TMST                                    04310009
043200                 ,FS_POST_TMST                                    04320009
043300                 ,PRE_TKT_IND                                     04330009
043400                 ,AD_INFO_DESC                                    04340009
043500                 ,IN_TRBL_TMST                                    04350009
043600                 ,IN_TRBL_MIN_CNT                                 04360009
043700                 ,IN_TRBL_HOUR_CNT                                04370009
043800                 ,VERFYD_TMST                                     04380009
043900                 ,RCVG_CLERK_INIT_ID                              04390009
044000                 ,REFER_BACK_SEQ_NBR                              04400009
044100                 ,AP_PRC_CDE                                      04410009
044200                 ,AP_PRC_DTE                                      04420009
044300                 ,MIS_DIRECT_IND                                  04430009
044400                 ,IMPRT_IND                                       04440009
044500                 ,CRE_OPER_UNT_ID                                 04450009
044600                 ,CRE_FCLTY_ID                                    04460009
044700                 ,CURR_OPER_UNT_ID                                04470009
044800                 ,CURR_FCLTY_ID                                   04480009
044900                 ,UPD_TMST                                        04490009
045000                 ,UPD_UID                                         04500009
045100                 ,UPD_PGM_ID                                      04510009
045200                 ,APRON_LOC_DESC                                  04520009
045300                 ,MKNG_APRN_PRT_TMST                              04530009
045400                 ,GOH_IND                                         04540009
045500                 ,VRFD_USR_ID                                     04550009
045600                 ,AP_RVRSL_IND                                    04560009
045700                 ,AP_RVRSL_DTE                                    04570009
045800                 ,PKGNG_CDE                                       04580009
045900                )                                                 04590009
046000            VALUES (                                              04600009
046100                 :WS-RECEIV-ORD-NBR                               04610009
046200                ,:WS-RECEIV-REC-SEQ-NBR                           04620009
046300                ,:WS-RECEIV-CRE-TMST                              04630009
046400                ,:WS-RECEIV-CRE-UID                               04640009
046500                ,:WS-RECEIV-PO-VER-NBR                            04650009
046600                ,:WS-RECEIV-OPER-UNT-ID                           04660009
046700                ,:WS-RECEIV-FCLTY-ID                              04670009
046800                ,:WS-RECEIV-STATUS-CDE                            04680009
046900                ,:WS-RECEIV-SYST-CRE-CDE                          04690009
047000                ,:WS-RECEIV-REC-TYP-CDE                           04700009
047100                ,:WS-RECEIV-VER-STATUS-CDE                        04710009
047200                ,:WS-RECEIV-PACK-BY-ST-IND                        04720009
047300                ,:WS-RECEIV-REC-TMST                              04730009
047400                ,:WS-RECEIV-EXPTED-CART-CNT                       04740009
047500                ,:WS-RECEIV-ACTL-CART-CNT                         04750009
047600                ,:WS-RECEIV-EXPTED-ITM-QTY                        04760009
047700                ,:WS-RECEIV-ACTL-ITM-QTY                          04770009
047800                ,:WS-RECEIV-RCVR-NBR                              04780009
047900                ,:WS-RECEIV-ML-POST-TMST                          04790009
048000                ,:WS-RECEIV-FS-POST-TMST                          04800009
048100                ,:WS-RECEIV-PRE-TKT-IND                           04810009
048200                ,:WS-RECEIV-AD-INFO-DESC                          04820009
048300                ,:WS-RECEIV-IN-TRBL-TMST                          04830009
048400                ,:WS-RECEIV-IN-TRBL-MIN-CNT                       04840009
048500                ,:WS-RECEIV-IN-TRBL-HOUR-CNT                      04850009
048600                ,:WS-RECEIV-VERFYD-TMST                           04860009
048700                ,:WS-RECEIV-RCVG-CLERK-INIT-ID                    04870009
048800                ,:WS-RECEIV-REFER-BACK-SEQ-NBR                    04880009
048900                ,:WS-RECEIV-AP-PRC-CDE                            04890009
049000                ,:WS-RECEIV-AP-PRC-DTE                            04900009
049100                ,:WS-RECEIV-MIS-DIRECT-IND                        04910009
049200                ,:WS-RECEIV-IMPRT-IND                             04920009
049300                ,:WS-RECEIV-CRE-OPER-UNT-ID                       04930009
049400                ,:WS-RECEIV-CRE-FCLTY-ID                          04940009
049500                ,:WS-RECEIV-CURR-OPER-UNT-ID                      04950009
049600                ,:WS-RECEIV-CURR-FCLTY-ID                         04960009
049700                ,:WS-RECEIV-UPD-TMST                              04970009
049800                ,:WS-RECEIV-UPD-UID                               04980009
049900                ,:WS-RECEIV-UPD-PGM-ID                            04990009
050000                ,:WS-RECEIV-APRON-LOC-DESC                        05000009
050100                ,:WS-RECEIV-MKNG-APRN-PRT-TMST                    05010009
050200                ,:WS-RECEIV-GOH-IND                               05020009
050300                ,:WS-RECEIV-VRFD-USR-ID                           05030009
050400                ,:WS-RECEIV-AP-RVRSL-IND                          05040009
050500                ,:WS-RECEIV-AP-RVRSL-DTE                          05050009
050600                ,:WS-RECEIV-PKGNG-CDE                             05060009
050700                   )                                              05070009
050800          END-EXEC                                                05080009
050900          WHEN DS009-PROCESS-TABLE = 'TRECITM'                    05090009
051000          EXEC SQL                                                05100009
051100              INSERT INTO TRECITM                                 05110009
051200                (                                                 05120009
051300                  ORD_NBR                                         05130009
051400                 ,ORD_LNE_NBR                                     05140009
051500                 ,REC_SEQ_NBR                                     05150009
051600                 ,OPER_UNT_ID                                     05160009
051700                 ,FCLTY_ID                                        05170009
051800                 ,CRE_TMST                                        05180009
051900                 ,CRE_UID                                         05190009
052000                 ,PO_VER_NBR                                      05200009
052100                 ,ITM_NBR                                         05210009
052200                 ,PRE_TKT_IND                                     05220009
052300                 ,TKT_FMT_ID                                      05230009
052400                 ,RTV_IND                                         05240009
052500                 ,STATUS_CDE                                      05250009
052600                 ,VER_STATUS_CDE                                  05260009
052700                 ,PKSL_ITM_QTY                                    05270009
052800                 ,DTL_CK_ITM_QTY                                  05280009
052900                 ,INNR_PACK_QTY                                   05290009
053000                 ,CASE_PACK_QTY                                   05300009
053100                 ,RTV_QTY                                         05310009
053200                 ,EXPTED_CART_CNT                                 05320009
053300                 ,ACTL_CART_CNT                                   05330009
053400                 ,MKING_APRON_TMST                                05340009
053500                 ,UNT_COST_AMT                                    05350009
053600                 ,COLOR_DESC                                      05360009
053700                 ,SIZE_DESC                                       05370009
053800                 ,VEND_STYL_NAME                                  05380009
053900                 ,VEND_DESC                                       05390009
054000                 ,VERFYD_TMST                                     05400009
054100                 ,PKSL_NBR                                        05410009
054200                 ,REC_INV_LNE_NBR                                 05420009
054300                 ,DMG_ITM_QTY                                     05430009
054400                 ,UPD_TMST                                        05440009
054500                 ,UPD_UID                                         05450009
054600                 ,UPD_PGM_ID                                      05460009
054700                 ,RCPT_DISTR_UPD_CDE                              05470009
054800                 ,VRFD_USR_ID                                     05480009
054900                 ,LAST_TRSCP_TMST                                 05490009
055000                 ,LAST_TRSCP_USR_ID                               05500009
055100                 ,PREPK_ID                                        05510009
055200                 ,PREPK_RATO_QTY                                  05520009
055300                 ,PREPK_ODD_UNT_QTY                               05530009
055400                 ,PREPK_DRV_LNE_CDE                               05540009
055500                 ,UNT_RTL_AMT                                     05550009
055600                 ,GP_RTL_AMT                                      05560009
055700                 ,GP_QTY                                          05570009
055800                 ,ORIG_PKSL_ITM_QTY                               05580009
055900                )                                                 05590009
056000            VALUES (                                              05600009
056100                 :WS-RECITM-ORD-NBR                               05610009
056200                ,:WS-RECITM-ORD-LNE-NBR                           05620009
056300                ,:WS-RECITM-REC-SEQ-NBR                           05630009
056400                ,:WS-RECITM-OPER-UNT-ID                           05640009
056500                ,:WS-RECITM-FCLTY-ID                              05650009
056600                ,:WS-RECITM-CRE-TMST                              05660009
056700                ,:WS-RECITM-CRE-UID                               05670009
056800                ,:WS-RECITM-PO-VER-NBR                            05680009
056900                ,:WS-RECITM-ITM-NBR                               05690009
057000                ,:WS-RECITM-PRE-TKT-IND                           05700009
057100                ,:WS-RECITM-TKT-FMT-ID                            05710009
057200                ,:WS-RECITM-RTV-IND                               05720009
057300                ,:WS-RECITM-STATUS-CDE                            05730009
057400                ,:WS-RECITM-VER-STATUS-CDE                        05740009
057500                ,:WS-RECITM-PKSL-ITM-QTY                          05750009
057600                ,:WS-RECITM-DTL-CK-ITM-QTY                        05760009
057700                ,:WS-RECITM-INNR-PACK-QTY                         05770009
057800                ,:WS-RECITM-CASE-PACK-QTY                         05780009
057900                ,:WS-RECITM-RTV-QTY                               05790009
058000                ,:WS-RECITM-EXPTED-CART-CNT                       05800009
058100                ,:WS-RECITM-ACTL-CART-CNT                         05810009
058200                ,:WS-RECITM-MKING-APRON-TMST                      05820009
058300                ,:WS-RECITM-UNT-COST-AMT                          05830009
058400                ,:WS-RECITM-COLOR-DESC                            05840009
058500                ,:WS-RECITM-SIZE-DESC                             05850009
058600                ,:WS-RECITM-VEND-STYL-NAME                        05860009
058700                ,:WS-RECITM-VEND-DESC                             05870009
058800                ,:WS-RECITM-VERFYD-TMST                           05880009
058900                ,:WS-RECITM-PKSL-NBR                              05890009
059000                ,:WS-RECITM-REC-INV-LNE-NBR                       05900009
059100                ,:WS-RECITM-DMG-ITM-QTY                           05910009
059200                ,:WS-RECITM-UPD-TMST                              05920009
059300                ,:WS-RECITM-UPD-UID                               05930009
059400                ,:WS-RECITM-UPD-PGM-ID                            05940009
059500                ,:WS-RECITM-RCPT-DISTR-UPD-CDE                    05950009
059600                ,:WS-RECITM-VRFD-USR-ID                           05960009
059700                ,:WS-RECITM-LAST-TRSCP-TMST                       05970009
059800                ,:WS-RECITM-LAST-TRSCP-USR-ID                     05980009
059900                ,:WS-RECITM-PREPK-ID                              05990009
060000                ,:WS-RECITM-PREPK-RATO-QTY                        06000009
060100                ,:WS-RECITM-PREPK-ODD-UNT-QTY                     06010009
060200                ,:WS-RECITM-PREPK-DRV-LNE-CDE                     06020009
060300               , :WS-RECITM-UNT-RTL-AMT                           06030009
060400               , :WS-RECITM-GP-RTL-AMT                            06040009
060500               , :WS-RECITM-GP-QTY                                06050009
060600               , :WS-RECITM-ORIG-PKSL-ITM-QTY                     06060009
060700                   )                                              06070009
060800          END-EXEC                                                06080009
060900          WHEN DS009-PROCESS-TABLE = 'TRECDIS'                    06090009
061000          EXEC SQL                                                06100009
061100              INSERT INTO TRECDIS                                 06110009
061200                (                                                 06120009
061300                  ORD_NBR                                         06130009
061400                 ,ORD_LNE_NBR                                     06140009
061500                 ,REC_SEQ_NBR                                     06150009
061600                 ,OPER_UNT_ID                                     06160009
061700                 ,FCLTY_ID                                        06170009
061800                 ,CRE_TMST                                        06180009
061900                 ,CRE_UID                                         06190009
062000                 ,VER_STATUS_CDE                                  06200009
062100                 ,EXPTED_ITM_QTY                                  06210009
062200                 ,VERIFY_ITM_QTY                                  06220009
062300                 ,AP_VERIFY_ITM_QTY                               06230009
062400                 ,STR_NBR                                         06240009
062500                 ,STR_FCLTY_ID                                    06250009
062600                 ,PLAN_ITM_QTY                                    06260009
062700                 ,AP_PRC_CDE                                      06270009
062800                 ,AP_PRC_DTE                                      06280009
062900                )                                                 06290009
063000            VALUES (                                              06300009
063100                 :WS-RECDIS-ORD-NBR                               06310009
063200                ,:WS-RECDIS-ORD-LNE-NBR                           06320009
063300                ,:WS-RECDIS-REC-SEQ-NBR                           06330009
063400                ,:WS-RECDIS-OPER-UNT-ID                           06340009
063500                ,:WS-RECDIS-FCLTY-ID                              06350009
063600                ,:WS-RECDIS-CRE-TMST                              06360009
063700                ,:WS-RECDIS-CRE-UID                               06370009
063800                ,:WS-RECDIS-VER-STATUS-CDE                        06380009
063900                ,:WS-RECDIS-EXPTED-ITM-QTY                        06390009
064000                ,:WS-RECDIS-VERIFY-ITM-QTY                        06400009
064100                ,:WS-RECDIS-AP-VERIFY-ITM-QTY                     06410009
064200                ,:WS-RECDIS-STR-NBR                               06420009
064300                ,:WS-RECDIS-STR-FCLTY-ID                          06430009
064400                ,:WS-RECDIS-PLAN-ITM-QTY                          06440009
064500                ,:WS-RECDIS-AP-PRC-CDE                            06450009
064600                ,:WS-RECDIS-AP-PRC-DTE                            06460009
064700                   )                                              06470009
064800          END-EXEC                                                06480009
064900          WHEN DS009-PROCESS-TABLE = 'TSHIPMT'                    06490009
065000          EXEC SQL                                                06500009
065100              INSERT INTO TSHIPMT                                 06510009
065200                (                                                 06520009
065300                  TRIP_ID                                         06530009
065400                 ,SHIPT_ID                                        06540009
065500                 ,CRT_SRC_CDE                                     06550009
065600                 ,LAST_UPD_DTE                                    06560009
065700                 ,LAST_UPD_TME                                    06570009
065800                 ,LAST_UPD_UID                                    06580009
065900                 ,PRO_SCAC_ID                                     06590009
066000                 ,PRO_NBR                                         06600009
066100                 ,BOL_NBR                                         06610009
066200                 ,SHIPPER_NME                                     06620009
066300                 ,SHIPT_TYP_CDE                                   06630009
066400                 ,EXPTED_GRO_WGHT                                 06640009
066500                 ,PKG_TYP_CDE                                     06650009
066600                 ,EXPTED_PKG_QTY                                  06660009
066700                 ,FRGT_CHG_AMT                                    06670009
066800                 ,FRGT_TERMS_CDE                                  06680009
066900                 ,EXPTED_PLT_QTY                                  06690009
067000                 ,VEND_SHIP_DTE                                   06700009
067100                 ,EST_AR_TMST                                     06710009
067200                 ,ORIG_SCAC_ID                                    06720009
067300                 ,LAST_UPD_PGM_ID                                 06730009
067400                 ,CRE_USER_ID                                     06740009
067500                 ,CARR_CART_CT                                    06750009
067600                 ,CARR_LAST_UPD_DTE                               06760009
067700                 ,CARR_LAST_UPD_TIME                              06770009
067800                 ,VEND_CART_CT                                    06780009
067900                 ,VEND_LAST_UPD_DTE                               06790009
068000                 ,VEND_LAST_UPD_TIME                              06800009
068100                 ,VEH_NBR                                         06810009
068200                 ,AUTH_NBR                                        06820009
068300                 ,AUTH_DTE                                        06830009
068400                 ,CONFIRM_DTE                                     06840009
068500                 ,CONFIRM_TIME                                    06850009
068600                 ,COMPLETE_PRO_NBR                                06860009
068700                 ,COMPLETE_BOL_NBR                                06870009
068800                 ,PROCESSED_DTE                                   06880009
068900                 ,INVC_NBR                                        06890009
069000                 ,CARR_AUTH_ID                                    06900009
069100                )                                                 06910009
069200            VALUES (                                              06920009
069300                 :WS-SHIPMT-TRIP-ID                               06930009
069400                 :WS-SHIPMT-TRIP-ID-NN                            06940009
069500                ,:WS-SHIPMT-SHIPT-ID                              06950009
069600                ,:WS-SHIPMT-CRT-SRC-CDE                           06960009
069700                ,:WS-SHIPMT-LAST-UPD-DTE                          06970009
069800                ,:WS-SHIPMT-LAST-UPD-TME                          06980009
069900                ,:WS-SHIPMT-LAST-UPD-UID                          06990009
070000                ,:WS-SHIPMT-PRO-SCAC-ID                           07000009
070100                ,:WS-SHIPMT-PRO-NBR                               07010009
070200                ,:WS-SHIPMT-BOL-NBR                               07020009
070300                ,:WS-SHIPMT-SHIPPER-NME                           07030009
070400                ,:WS-SHIPMT-SHIPT-TYP-CDE                         07040009
070500                ,:WS-SHIPMT-EXPTED-GRO-WGHT                       07050009
070600                ,:WS-SHIPMT-PKG-TYP-CDE                           07060009
070700                ,:WS-SHIPMT-EXPTED-PKG-QTY                        07070009
070800                ,:WS-SHIPMT-FRGT-CHG-AMT                          07080009
070900                ,:WS-SHIPMT-FRGT-TERMS-CDE                        07090009
071000                ,:WS-SHIPMT-EXPTED-PLT-QTY                        07100009
071100                ,:WS-SHIPMT-VEND-SHIP-DTE                         07110009
071200                ,:WS-SHIPMT-EST-AR-TMST                           07120009
071300                 :WS-SHIPMT-EST-AR-TMST-NN                        07130009
071400                ,:WS-SHIPMT-ORIG-SCAC-ID                          07140009
071500                ,:WS-SHIPMT-LAST-UPD-PGM-ID                       07150009
071600                ,:WS-SHIPMT-CRE-USER-ID                           07160009
071700                ,:WS-SHIPMT-CARR-CART-CT                          07170009
071800                ,:WS-SHIPMT-CARR-LAST-UPD-DTE                     07180009
071900                ,:WS-SHIPMT-CARR-LAST-UPD-TIME                    07190009
072000                ,:WS-SHIPMT-VEND-CART-CT                          07200009
072100                ,:WS-SHIPMT-VEND-LAST-UPD-DTE                     07210009
072200                ,:WS-SHIPMT-VEND-LAST-UPD-TIME                    07220009
072300                ,:WS-SHIPMT-VEH-NBR                               07230009
072400                ,:WS-SHIPMT-AUTH-NBR                              07240009
072500                ,:WS-SHIPMT-AUTH-DTE                              07250009
072600                ,:WS-SHIPMT-CONFIRM-DTE                           07260009
072700                ,:WS-SHIPMT-CONFIRM-TIME                          07270009
072800                ,:WS-SHIPMT-COMPLETE-PRO-NBR                      07280009
072900                ,:WS-SHIPMT-COMPLETE-BOL-NBR                      07290009
073000                ,:WS-SHIPMT-PROCESSED-DTE                         07300009
073100                ,:WS-SHIPMT-INVC-NBR                              07310009
073200                ,:WS-SHIPMT-CARR-AUTH-ID                          07320009
073300                   )                                              07330009
073400          END-EXEC                                                07340009
073500             IF SQLCODE NOT = ZERO                                07350009
073600                 MOVE SQLCODE         TO PV-DISP-SQLCODE          07360009
073700                 DISPLAY 'TSHIPMT SQLCODE = ' PV-DISP-SQLCODE     07370009
073800                         ' TSHIPMT TRIP-ID = ' WS-SHIPMT-TRIP-ID  07380009
073900                         ' TSHIPMT SHIP-ID = ' WS-SHIPMT-SHIPT-ID 07390009
074000*                PERFORM DS002-SQL-ERROR                          07400009
074100             END-IF                                               07410009
074200          WHEN DS009-PROCESS-TABLE = 'TSHIPST'                    07420009
074300          EXEC SQL                                                07430009
074400              INSERT INTO TSHIPST                                 07440009
074500                (                                                 07450009
074600                  SHIPT_ID                                        07460009
074700                 ,SHIPT_STATUS_CDE                                07470009
074800                 ,STATUS_DTE                                      07480009
074900                 ,STATUS_TME                                      07490009
075000                 ,STATUS_UID                                      07500009
075100                 ,DELAY_RSN_CDE                                   07510009
075200                 ,CARR_STATUS_CDE                                 07520009
075300                 ,TIME_ZONE_CDE                                   07530009
075301                 ,CITY_NAME                                       07530109
075302                 ,STATE_CDE                                       07530209
075303                )                                                 07530309
075304            VALUES (                                              07530409
075305                 :WS-SHIPST-SHIPT-ID                              07530509
075306                ,:WS-SHIPST-SHIPT-STATUS-CDE                      07530609
075307                ,:WS-SHIPST-STATUS-DTE                            07530709
075308                ,:WS-SHIPST-STATUS-TME                            07530809
075309                ,:WS-SHIPST-STATUS-UID                            07530909
075310                ,:WS-SHIPST-DELAY-RSN-CDE                         07531009
075320                ,:WS-SHIPST-CARR-STATUS-CDE                       07532009
075330                ,:WS-SHIPST-TIME-ZONE-CDE                         07533009
075340                ,:WS-SHIPST-CITY-NAME                             07534009
075350                ,:WS-SHIPST-STATE-CDE                             07535009
075360                   )                                              07536009
075370          END-EXEC                                                07537009
075380          WHEN DS009-PROCESS-TABLE = 'TTRIPST'                    07538009
075390          EXEC SQL                                                07539009
075400              INSERT INTO TTRIPST                                 07540009
075500                (                                                 07550009
075600                  TRIP_ID                                         07560009
075700                 ,TRIP_STATUS_CDE                                 07570009
075800                 ,STATUS_DTE                                      07580009
075900                 ,STATUS_TME                                      07590009
076000                 ,STATUS_UID                                      07600009
076100                 ,OPER_UNT_ID                                     07610009
076200                 ,FCLTY_ID                                        07620009
076300                 ,FCLTY_AREA_ID                                   07630009
076400                )                                                 07640009
076500            VALUES (                                              07650009
076600                 :WS-TRIPST-TRIP-ID                               07660009
076700                ,:WS-TRIPST-TRIP-STATUS-CDE                       07670009
076800                ,:WS-TRIPST-STATUS-DTE                            07680009
076900                ,:WS-TRIPST-STATUS-TME                            07690009
077000                ,:WS-TRIPST-STATUS-UID                            07700009
077100                ,:WS-TRIPST-OPER-UNT-ID                           07710009
077200                ,:WS-TRIPST-FCLTY-ID                              07720009
077300                ,:WS-TRIPST-FCLTY-AREA-ID                         07730009
077400                   )                                              07740009
077500          END-EXEC                                                07750009
077600          WHEN DS009-PROCESS-TABLE = 'TVHTRIP'                    07760009
077700          EXEC SQL                                                07770009
077800              INSERT INTO TVHTRIP                                 07780009
077900                (                                                 07790009
078000                  OWNER_SCAC_ID                                   07800009
078100                 ,VEH_NBR                                         07810009
078200                 ,TRIP_ID                                         07820009
078300                 ,TRIP_BEG_DTE                                    07830009
078400                 ,TRIP_BEG_TME                                    07840009
078500                 ,CRT_SRC_CDE                                     07850009
078600                 ,LAST_UPD_DTE                                    07860009
078700                 ,LAST_UPD_TME                                    07870009
078800                 ,LAST_UPD_UID                                    07880009
078900                 ,MANIFEST_NBR                                    07890009
079000                 ,PLND_TRIP_SEQ                                   07900009
079100                 ,PLND_ACTVY_CDE                                  07910009
079200                 ,OWNR_SCAC_SHIP_DTE                              07920009
079300                 ,REF_TRIP_ID                                     07930009
079400                 ,EST_AR_TMST                                     07940009
079500                 ,SPLT_XMIT_IND                                   07950009
079600                 ,SPLT_XMIT_DTE                                   07960009
079700                 ,SPLT_XMIT_TM                                    07970009
079800                )                                                 07980009
079900            VALUES (                                              07990009
080000                 :WS-VHTRIP-OWNER-SCAC-ID                         08000009
080100                ,:WS-VHTRIP-VEH-NBR                               08010009
080200                 :WS-VHTRIP-VEH-NBR-NN                            08020009
080300                ,:WS-VHTRIP-TRIP-ID                               08030009
080400                ,:WS-VHTRIP-TRIP-BEG-DTE                          08040009
080500                ,:WS-VHTRIP-TRIP-BEG-TME                          08050009
080600                ,:WS-VHTRIP-CRT-SRC-CDE                           08060009
080700                ,:WS-VHTRIP-LAST-UPD-DTE                          08070009
080800                ,:WS-VHTRIP-LAST-UPD-TME                          08080009
080900                ,:WS-VHTRIP-LAST-UPD-UID                          08090009
081000                ,:WS-VHTRIP-MANIFEST-NBR                          08100009
081100                ,:WS-VHTRIP-PLND-TRIP-SEQ                         08110009
081200                ,:WS-VHTRIP-PLND-ACTVY-CDE                        08120009
081300                ,:WS-VHTRIP-OWNR-SCAC-SHIP-DTE                    08130009
081400                ,:WS-VHTRIP-REF-TRIP-ID                           08140009
081500                ,:WS-VHTRIP-EST-AR-TMST                           08150009
081600                 :WS-VHTRIP-EST-AR-TMST-NN                        08160009
081700                ,:WS-VHTRIP-SPLT-XMIT-IND                         08170009
081800                ,:WS-VHTRIP-SPLT-XMIT-DTE                         08180009
081900                ,:WS-VHTRIP-SPLT-XMIT-TM                          08190009
082000                )                                                 08200009
082100          END-EXEC                                                08210009
082200                                                                  08220009
082300          IF SQLCODE NOT = ZERO                                   08230009
082400             MOVE SQLCODE TO PV-DISP-SQLCODE                      08240009
082500             DISPLAY 'TVHTRIP SQLCODE= ' PV-DISP-SQLCODE          08250009
082600             MOVE WS-VHTRIP-TRIP-ID TO PV-DISP-NBR                08260009
082700             DISPLAY ' SCAC= ' WS-VHTRIP-OWNER-SCAC-ID            08270009
082800                     ' VEH= '  WS-VHTRIP-VEH-NBR                  08280009
082900                     'TRIP= '  PV-DISP-NBR                        08290009
083000         END-IF                                                   08300009
083100                                                                  08310009
083200          WHEN DS009-PROCESS-TABLE = 'TVEHICL'                    08320009
083300          EXEC SQL                                                08330009
083400              INSERT INTO TVEHICL                                 08340009
083500                (                                                 08350009
083600                  OWNER_SCAC_ID                                   08360009
083700                 ,VEH_NBR                                         08370009
083800                 ,CRT_SRC_CDE                                     08380009
083900                 ,LAST_UPD_DTE                                    08390009
084000                 ,LAST_UPD_TME                                    08400009
084100                 ,LAST_UPD_UID                                    08410009
084200                 ,USAGE_CDE                                       08420009
084300                 ,VEH_TYP_CDE                                     08430009
084400                 ,CURR_STATUS_CDE                                 08440009
084500                 ,CURR_STATUS_DTE                                 08450009
084600                 ,CURR_STATUS_TME                                 08460009
084700                 ,CURR_OPER_UNT_ID                                08470009
084800                 ,CURR_FCLTY_ID                                   08480009
084900                 ,CURR_FAC_AREA_ID                                08490009
085000                 ,CURR_LOC_DTE                                    08500009
085100                 ,CURR_LOC_TME                                    08510009
085200                 ,CURR_TRIP_ID                                    08520009
085300                 ,VEH_SIZE_CDE                                    08530009
085400                )                                                 08540009
085500             VALUES (                                             08550009
085600                 :WS-VEHICL-OWNER-SCAC-ID                         08560009
085700                ,:WS-VEHICL-VEH-NBR                               08570009
085800                ,:WS-VEHICL-CRT-SRC-CDE                           08580009
085900                ,:WS-VEHICL-LAST-UPD-DTE                          08590009
086000                ,:WS-VEHICL-LAST-UPD-TME                          08600009
086100                ,:WS-VEHICL-LAST-UPD-UID                          08610009
086200                ,:WS-VEHICL-USAGE-CDE                             08620009
086300                ,:WS-VEHICL-VEH-TYP-CDE                           08630009
086400                ,:WS-VEHICL-CURR-STATUS-CDE                       08640009
086500                ,:WS-VEHICL-CURR-STATUS-DTE                       08650009
086600                ,:WS-VEHICL-CURR-STATUS-TME                       08660009
086700                ,:WS-VEHICL-CURR-OPER-UNT-ID                      08670009
086800                ,:WS-VEHICL-CURR-FCLTY-ID                         08680009
086900                ,:WS-VEHICL-CURR-FAC-AREA-ID                      08690009
087000                ,:WS-VEHICL-CURR-LOC-DTE                          08700009
087100                ,:WS-VEHICL-CURR-LOC-TME                          08710009
087200                ,:WS-VEHICL-CURR-TRIP-ID                          08720009
087300                 :WS-VEHICL-CURR-TRIP-ID-NN                       08730009
087400                ,:WS-VEHICL-VEH-SIZE-CDE                          08740009
087500                   )                                              08750009
087600          END-EXEC                                                08760009
087700            WHEN DS009-PROCESS-TABLE = 'TRECDVS'                  08770009
087800               EXEC SQL                                           08780009
087900                  INSERT INTO TRECDVS                             08790009
088000                    (                                             08800009
088100                    ORD_NBR                                       08810009
088200                   ,ORD_LNE_NBR                                   08820009
088300                   ,REC_SEQ_NBR                                   08830009
088400                   ,STR_NBR                                       08840009
088500                   ,VRFY_SRC_CDE                                  08850009
088600                   ,EXPTED_ITM_QTY                                08860009
088700                   ,VRFY_ITM_QTY                                  08870009
088800                   ,VER_STAT_CDE                                  08880009
088900                    )                                             08890009
089000                VALUES (                                          08900009
089100                    :WS-RECDVS-ORD-NBR                            08910009
089200                   ,:WS-RECDVS-ORD-LNE-NBR                        08920009
089300                   ,:WS-RECDVS-REC-SEQ-NBR                        08930009
089400                   ,:WS-RECDVS-STR-NBR                            08940009
089500                   ,:WS-RECDVS-VRFY-SRC-CDE                       08950009
089600                   ,:WS-RECDVS-EXPTED-ITM-QTY                     08960009
089700                   ,:WS-RECDVS-VRFY-ITM-QTY                       08970009
089800                   ,:WS-RECDVS-VER-STAT-CDE                       08980009
089900                       )                                          08990009
090000               END-EXEC                                           09000009
090100            WHEN DS009-PROCESS-TABLE = 'TAUTRIP'                  09010009
090200               EXEC SQL                                           09020009
090300                  INSERT INTO TAUTRIP                             09030009
090400                    (                                             09040009
090500                     OWNER_SCAC_ID                                09050009
090600                    ,VEH_NBR                                      09060009
090700                    ,TRIP_ID                                      09070009
090800                    ,TRIP_BEG_DTE                                 09080009
090900                    ,TRIP_BEG_TME                                 09090009
091000                    ,CRT_SRC_CDE                                  09100009
091100                    ,LAST_UPD_DTE                                 09110009
091200                    ,LAST_UPD_TME                                 09120009
091300                    ,LAST_UPD_UID                                 09130009
091400                    ,MANIFEST_NBR                                 09140009
091500                    ,PLND_TRIP_SEQ                                09150009
091600                    ,PLND_ACTVY_CDE                               09160009
091700                    ,REF_TRIP_ID                                  09170009
091800                    ,EST_AR_TMST                                  09180009
091900                    ,OWNR_SCAC_SHIP_DTE                           09190009
092000                    ,AUD_STATUS_CDE                               09200009
092100                    ,SPLT_XMIT_IND                                09210009
092200                    ,SPLT_XMIT_DTE                                09220009
092300                    ,SPLT_XMIT_TM                                 09230009
092400                    )                                             09240009
092500                VALUES (                                          09250009
092600                      :WS-AUTRIP-OWNER-SCAC-ID                    09260009
092700                     ,:WS-AUTRIP-VEH-NBR                          09270009
092800                      :WS-AUTRIP-VEH-NBR-NN                       09280009
092900                     ,:WS-AUTRIP-TRIP-ID                          09290009
093000                     ,:WS-AUTRIP-TRIP-BEG-DTE                     09300009
093100                     ,:WS-AUTRIP-TRIP-BEG-TME                     09310009
093200                     ,:WS-AUTRIP-CRT-SRC-CDE                      09320009
093300                     ,:WS-AUTRIP-LAST-UPD-DTE                     09330009
093400                     ,:WS-AUTRIP-LAST-UPD-TME                     09340009
093500                     ,:WS-AUTRIP-LAST-UPD-UID                     09350009
093600                     ,:WS-AUTRIP-MANIFEST-NBR                     09360009
093700                     ,:WS-AUTRIP-PLND-TRIP-SEQ                    09370009
093800                     ,:WS-AUTRIP-PLND-ACTVY-CDE                   09380009
093900                     ,:WS-AUTRIP-REF-TRIP-ID                      09390009
094000                     ,:WS-AUTRIP-EST-AR-TMST                      09400009
094100                      :WS-AUTRIP-EST-AR-TMST-NN                   09410009
094200                     ,:WS-AUTRIP-OWNR-SCAC-SHIP-DTE               09420009
094300                     ,:WS-AUTRIP-AUD-STATUS-CDE                   09430009
094400                     ,:WS-AUTRIP-SPLT-XMIT-IND                    09440009
094500                     ,:WS-AUTRIP-SPLT-XMIT-DTE                    09450009
094600                     ,:WS-AUTRIP-SPLT-XMIT-TM                     09460009
094700                       )                                          09470009
094800               END-EXEC                                           09480009
094900          WHEN DS009-PROCESS-TABLE = 'TAUSHIP'                    09490009
095000             EXEC SQL                                             09500009
095100                INSERT INTO TAUSHIP                               09510009
095200                  (                                               09520009
095300                    TRIP_ID                                       09530009
095400                   ,SHIPT_ID                                      09540009
095500                   ,CRT_SRC_CDE                                   09550009
095600                   ,LAST_UPD_DTE                                  09560009
095700                   ,LAST_UPD_TME                                  09570009
095800                   ,LAST_UPD_UID                                  09580009
095900                   ,PRO_SCAC_ID                                   09590009
096000                   ,PRO_NBR                                       09600009
096100                   ,BOL_NBR                                       09610009
096200                   ,SHIPPER_NME                                   09620009
096300                   ,SHIPT_TYP_CDE                                 09630009
096400                   ,EXPTED_GRO_WGHT                               09640009
096500                   ,PKG_TYP_CDE                                   09650009
096600                   ,EXPTED_PKG_QTY                                09660009
096700                   ,FRGT_CHG_AMT                                  09670009
096800                   ,FRGT_TERMS_CDE                                09680009
096900                   ,EST_AR_TMST                                   09690009
097000                   ,VEND_SHIP_DTE                                 09700009
097100                   ,EXPTED_PLT_QTY                                09710009
097200                   ,ORIG_SCAC_ID                                  09720009
097300                   ,LAST_UPD_PGM_ID                               09730009
097400                   ,CRE_USER_ID                                   09740009
097500                   ,CARR_CART_CT                                  09750009
097600                   ,CARR_LAST_UPD_DTE                             09760009
097700                   ,CARR_LAST_UPD_TIME                            09770009
097800                   ,VEND_CART_CT                                  09780009
097900                   ,VEND_LAST_UPD_DTE                             09790009
098000                   ,VEND_LAST_UPD_TIME                            09800009
098100                   ,VEH_NBR                                       09810009
098200                   ,AUTH_NBR                                      09820009
098300                   ,AUTH_DTE                                      09830009
098400                   ,CONFIRM_DTE                                   09840009
098500                   ,CONFIRM_TIME                                  09850009
098600                   ,AUD_STATUS_CDE                                09860009
098700                   ,PROCESSED_DTE                                 09870009
098800                   ,INVC_NBR                                      09880009
098900                  )                                               09890009
099000              VALUES (                                            09900009
099100                   :WS-AUSHIP-TRIP-ID                             09910009
099200                   :WS-AUSHIP-TRIP-ID-NN                          09920009
099300                  ,:WS-AUSHIP-SHIPT-ID                            09930009
099400                  ,:WS-AUSHIP-CRT-SRC-CDE                         09940009
099500                  ,:WS-AUSHIP-LAST-UPD-DTE                        09950009
099600                  ,:WS-AUSHIP-LAST-UPD-TME                        09960009
099700                  ,:WS-AUSHIP-LAST-UPD-UID                        09970009
099800                  ,:WS-AUSHIP-PRO-SCAC-ID                         09980009
099900                  ,:WS-AUSHIP-PRO-NBR                             09990009
100000                  ,:WS-AUSHIP-BOL-NBR                             10000009
100100                  ,:WS-AUSHIP-SHIPPER-NME                         10010009
100200                  ,:WS-AUSHIP-SHIPT-TYP-CDE                       10020009
100300                  ,:WS-AUSHIP-EXPTED-GRO-WGHT                     10030009
100400                  ,:WS-AUSHIP-PKG-TYP-CDE                         10040009
100500                  ,:WS-AUSHIP-EXPTED-PKG-QTY                      10050009
100600                  ,:WS-AUSHIP-FRGT-CHG-AMT                        10060009
100700                  ,:WS-AUSHIP-FRGT-TERMS-CDE                      10070009
100800                  ,:WS-AUSHIP-EST-AR-TMST                         10080009
100900                   :WS-AUSHIP-EST-AR-TMST-NN                      10090009
101000                  ,:WS-AUSHIP-VEND-SHIP-DTE                       10100009
101100                  ,:WS-AUSHIP-EXPTED-PLT-QTY                      10110009
101200                  ,:WS-AUSHIP-ORIG-SCAC-ID                        10120009
101300                  ,:WS-AUSHIP-LAST-UPD-PGM-ID                     10130009
101400                  ,:WS-AUSHIP-CRE-USER-ID                         10140009
101500                  ,:WS-AUSHIP-CARR-CART-CT                        10150009
101600                  ,:WS-AUSHIP-CARR-LAST-UPD-DTE                   10160009
101700                  ,:WS-AUSHIP-CARR-LAST-UPD-TIME                  10170009
101800                  ,:WS-AUSHIP-VEND-CART-CT                        10180009
101900                  ,:WS-AUSHIP-VEND-LAST-UPD-DTE                   10190009
102000                  ,:WS-AUSHIP-VEND-LAST-UPD-TIME                  10200009
102100                  ,:WS-AUSHIP-VEH-NBR                             10210009
102200                  ,:WS-AUSHIP-AUTH-NBR                            10220009
102300                  ,:WS-AUSHIP-AUTH-DTE                            10230009
102400                  ,:WS-AUSHIP-CONFIRM-DTE                         10240009
102500                  ,:WS-AUSHIP-CONFIRM-TIME                        10250009
102600                  ,:WS-AUSHIP-AUD-STATUS-CDE                      10260009
102700                  ,:WS-AUSHIP-PROCESSED-DTE                       10270009
102800                  ,:WS-AUSHIP-INVC-NBR                            10280009
102900                     )                                            10290009
103000             END-EXEC                                             10300009
103100          WHEN DS009-PROCESS-TABLE = 'TAUSHPO'                    10310009
103200             EXEC SQL                                             10320009
103300                INSERT INTO TAUSHPO                               10330009
103400                  (                                               10340009
103500                    SHIPT_ID                                      10350009
103600                   ,PO_NBR                                        10360009
103700*                  ,DEPT_NBR                                      10370009
103800                   ,REC_SEQ_NBR                                   10380009
103900                   ,EXPTED_CART_CNT                               10390009
104000                   ,ACTL_CART_CNT                                 10400009
104100                   ,DMG_CART_CNT                                  10410009
104200                   ,PKSL_IND                                      10420009
104300                   ,VEND_NAME                                     10430009
104400                   ,FRGT_CHG_AMT                                  10440009
104500                   ,LAST_UPD_PGM_ID                               10450009
104600                   ,CRE_USER_ID                                   10460009
104700                   ,CARR_CART_CT                                  10470009
104800                   ,CARR_LAST_UPD_DTE                             10480009
104900                   ,CARR_LAST_UPD_TIME                            10490009
105000                   ,VEND_CART_CT                                  10500009
105100                   ,VEND_LAST_UPD_DTE                             10510009
105200                   ,VEND_LAST_UPD_TIME                            10520009
105300                   ,CRE_TMST                                      10530009
105400                   ,LAST_UPD_DTE                                  10540009
105500                   ,LAST_UPD_TIME                                 10550009
105600                   ,LAST_UPD_USER_ID                              10560009
105700                   ,PRIM_SHIPT_IND                                10570009
105800                   ,SPLT_XMIT_IND                                 10580009
105900                   ,SPLT_XMIT_DTE                                 10590009
106000                   ,SPLT_XMIT_TM                                  10600009
106100                   ,TRN_CDE                                       10610009
106200                  )                                               10620009
106300              VALUES (                                            10630009
106400                :WS-AUSHPO                                        10640009
106500                     )                                            10650009
106600             END-EXEC                                             10660009
106700          WHEN DS009-PROCESS-TABLE = 'TAUVHCL'                    10670009
106800             EXEC SQL                                             10680009
106900                INSERT INTO TAUVHCL                               10690009
107000                  (                                               10700009
107100                    OWNER_SCAC_ID                                 10710009
107200                   ,VEH_NBR                                       10720009
107300                   ,CRT_SRC_CDE                                   10730009
107400                   ,LAST_UPD_DTE                                  10740009
107500                   ,LAST_UPD_TME                                  10750009
107600                   ,LAST_UPD_UID                                  10760009
107700                   ,USAGE_CDE                                     10770009
107800                   ,VEH_TYP_CDE                                   10780009
107900                   ,CURR_STATUS_CDE                               10790009
108000                   ,CURR_STATUS_DTE                               10800009
108100                   ,CURR_STATUS_TME                               10810009
108200                   ,CURR_OPER_UNT_ID                              10820009
108300                   ,CURR_FCLTY_ID                                 10830009
108400                   ,CURR_FAC_AREA_ID                              10840009
108500                   ,CURR_LOC_DTE                                  10850009
108600                   ,CURR_LOC_TME                                  10860009
108700                   ,CURR_TRIP_ID                                  10870009
108800                   ,VEH_SIZE_CDE                                  10880009
108900                  )                                               10890009
109000              VALUES (                                            10900009
109100                   :WS-AUVHCL-OWNER-SCAC-ID                       10910009
109200                  ,:WS-AUVHCL-VEH-NBR                             10920009
109300                  ,:WS-AUVHCL-CRT-SRC-CDE                         10930009
109400                  ,:WS-AUVHCL-LAST-UPD-DTE                        10940009
109500                  ,:WS-AUVHCL-LAST-UPD-TME                        10950009
109600                  ,:WS-AUVHCL-LAST-UPD-UID                        10960009
109700                  ,:WS-AUVHCL-USAGE-CDE                           10970009
109800                  ,:WS-AUVHCL-VEH-TYP-CDE                         10980009
109900                  ,:WS-AUVHCL-CURR-STATUS-CDE                     10990009
110000                  ,:WS-AUVHCL-CURR-STATUS-DTE                     11000009
110100                  ,:WS-AUVHCL-CURR-STATUS-TME                     11010009
110200                  ,:WS-AUVHCL-CURR-OPER-UNT-ID                    11020009
110300                  ,:WS-AUVHCL-CURR-FCLTY-ID                       11030009
110400                  ,:WS-AUVHCL-CURR-FAC-AREA-ID                    11040009
110500                  ,:WS-AUVHCL-CURR-LOC-DTE                        11050009
110600                  ,:WS-AUVHCL-CURR-LOC-TME                        11060009
110700                  ,:WS-AUVHCL-CURR-TRIP-ID                        11070009
110800                   :WS-AUVHCL-CURR-TRIP-ID-NN                     11080009
110900                  ,:WS-AUVHCL-VEH-SIZE-CDE                        11090009
111000                     )                                            11100009
111100             END-EXEC                                             11110009
111200          WHEN DS009-PROCESS-TABLE = 'TDISTHD'                    11120009
111300             EXEC SQL                                             11130009
111400                INSERT INTO TDISTHD                               11140009
111500                  (                                               11150009
111600                   ORD_NBR                                        11160009
111700                  ,RCVR_SEQ_NBR                                   11170009
111800                  ,ORD_LNE_NBR                                    11180009
111900                  ,WRK_ORD_SEQ_NBR                                11190009
112000                  ,OPER_UNT_ID                                    11200009
112100                  ,DISTRB_PRC_AREA_ID                             11210009
112200                  ,PRCG_STAT_CDE                                  11220009
112300                  ,CRE_TMST                                       11230009
112400                  ,RSLTS_RCVD_TMST                                11240009
112500                  ,VRFD_TMST                                      11250009
112600                  ,PRC_AREA_MODU_ID                               11260009
112700                  ,CRE_USR_ID                                     11270009
112800                  ,TOT_CART_CNT                                   11280009
112900                  ,CART_DWNLD_DTE                                 11290009
113000                  ,CART_DWNLD_TM                                  11300009
113100                  ,CART_DWNLD_USR_ID                              11310009
113200                  ,FCSE_CART_CNT                                  11320009
113300                  ,FCSE_LBL_TYP_CDE                               11330009
113400                  ,P2L_CART_CNT                                   11340009
113500                  ,INPK_CART_CNT                                  11350009
113600                  ,INPK_UNT_QTY                                   11360009
113700                  ,INPK_CNVYB_IND                                 11370009
113800                  ,OTPK_UNT_QTY                                   11380009
113900                  ,SYS_CRE_CDE                                    11390009
114000                  ,SPC_INSTR_DESC                                 11400009
114100                  ,FCSE_CNFRMN_TMST                               11410009
114200                  ,FCSE_CNFRMN_USR_ID                             11420009
114300                  ,FCSE_CNFRMN_PGM_ID                             11430009
114400                  ,ACTV_IND                                       11440009
114500                  ,DLT_REQ_SRC_ID                                 11450009
114600                  ,DLT_REQ_TMST                                   11460009
114700                  ,DLT_RSLT_CDE                                   11470009
114800                  ,P2L_SCN_CART_CNT                               11480009
114900                  ,CRE_LBL_OPT_CDE                                11490009
115000                  ,FCSE_FCLTY_AREA_ID                             11500009
115100                  ,ODD_CART_UNT_QTY                               11510009
115200                  ,PREPK_LNE_PRC_CDE                              11520009
115300                  ,UCC128_DAT_USG_CDE                             11530009
115400                  ,CAL_UNT_PRCD_QTY                               11540009
115500                  )                                               11550009
115600              VALUES (                                            11560009
115700                :WS-DISTHD                                        11570009
115800                     )                                            11580009
115900             END-EXEC                                             11590009
116000          WHEN DS009-PROCESS-TABLE = 'TDISTDT'                    11600009
116100             EXEC SQL                                             11610009
116200                INSERT INTO TDISTDT                               11620009
116300                  (                                               11630009
116400                   ORD_NBR                                        11640009
116500                  ,RCVR_SEQ_NBR                                   11650009
116600                  ,ORD_LNE_NBR                                    11660009
116700                  ,WRK_ORD_SEQ_NBR                                11670009
116800                  ,STR_NBR                                        11680009
116900                  ,EXPTED_ALLOC_QTY                               11690009
117000                  ,ACTL_ALLOC_QTY                                 11700009
117100                  ,RCVG_PSTD_STAT_CDE                             11710009
117200                  ,P2L_SPLT_UNT_QTY                               11720009
117300                  ,FCSE_SPLT_UNT_QTY                              11730009
117400                  ,INPK_SPLT_UNT_QTY                              11740009
117500                  ,FCSE_ACTL_UNT_QTY                              11750009
117600                  ,ODD_CART_IND                                   11760009
117700                  ,PREPK_ODD_UNT_QTY                              11770009
117800                  )                                               11780009
117900              VALUES (                                            11790009
118000                :WS-DISTDT                                        11800009
118100                     )                                            11810009
118200             END-EXEC                                             11820009
118300          WHEN DS009-PROCESS-TABLE = 'TWRKORD'                    11830009
118400             EXEC SQL                                             11840009
118500                INSERT INTO TWRKORD                               11850009
118600                  (                                               11860009
118700                   ORD_NBR                                        11870009
118800                  ,RCVR_SEQ_NBR                                   11880009
118900                  ,ORD_LNE_NBR                                    11890009
119000                  ,WORK_ORD_SEQ_NBR                               11900009
119100                  ,OPER_UNT_ID                                    11910009
119200                  ,FCLTY_ID                                       11920009
119300                  ,CRE_TMST                                       11930009
119400                  ,VER_STATUS_CDE                                 11940009
119500                  ,CRE_UID_ID                                     11950009
119600                  ,EXPTED_CART_CNT                                11960009
119700                  ,ACTL_CART_CNT                                  11970009
119800                  ,EXPTED_ITM_CNT                                 11980009
119900                  ,ACTL_ITM_CNT                                   11990009
120000                  ,STAT_CDE                                       12000009
120100                  ,WORK_ORD_DISTR_IND                             12010009
120200                  ,OPER_SET_ID                                    12020009
120300                  ,INST_CART_CNT                                  12030009
120400                  ,INST_LNE_LOC_CDE                               12040009
120500                  ,INST_PRC_AREA_ID                               12050009
120600                  ,WO_INSTR_SEL_IND                               12060009
120700                  ,INST_ITM_CNT                                   12070009
120800                  )                                               12080009
120900              VALUES (                                            12090009
121000                :WS-WRKORD                                        12100009
121100                     )                                            12110009
121200             END-EXEC                                             12120009
121300          WHEN DS009-PROCESS-TABLE = 'TWKORIN'                    12130009
121400             EXEC SQL                                             12140009
121500                INSERT INTO TWKORIN                               12150009
121600                  (                                               12160009
121700                   ORD_NBR                                        12170009
121800                  ,RCVR_SEQ_NBR                                   12180009
121900                  ,ORD_LNE_NBR                                    12190009
122000                  ,WORK_ORD_SEQ_NBR                               12200009
122100                  ,OPER_UNT_ID                                    12210009
122200                  ,FCLTY_ID                                       12220009
122300                  ,WO_INSTR_SEQ_NBR                               12230009
122400                  ,CRE_TMST                                       12240009
122500                  ,VER_STATUS_CDE                                 12250009
122600                  ,CRE_UID_ID                                     12260009
122700                  ,OPER_ID                                        12270009
122800                  ,FCLTY_AREA_ID                                  12280009
122900                  ,PRC_FCLTY_AREA_ID                              12290009
123000                  ,EXPTED_CART_CNT                                12300009
123100                  ,ACTL_CART_CNT                                  12310009
123200                  ,ALLOC_IND                                      12320009
123300                  ,REPACK_IND                                     12330009
123400                  ,STRT_TMST                                      12340009
123500                  ,STOP_TMST                                      12350009
123600                  ,SCREEN_SEQ_NBR                                 12360009
123700                  ,LNE_LOC_CDE                                    12370009
123800                  ,REC_SEL_IND                                    12380009
123900                  )                                               12390009
124000              VALUES (                                            12400009
124100                :WS-WKORIN                                        12410009
124200                     )                                            12420009
124300             END-EXEC                                             12430009
124400          WHEN DS009-PROCESS-TABLE = 'TSHPSUM'                    12440009
124500             EXEC SQL                                             12450009
124600                INSERT INTO TSHPSUM                               12460009
124700                  (                                               12470009
124800                     PO_NBR                                       12480009
124900                    ,PKSL_SEQ_NBR                                 12490009
125000                    ,CART_COMB_NBR                                12500009
125100                    ,PO_LNE_NBR                                   12510009
125200                    ,TOT_CART_CNT                                 12520009
125300                    ,OTPK_UNT_QTY                                 12530009
125400                    ,CRE_TMST                                     12540009
125500                  )                                               12550009
125600              VALUES (                                            12560009
125700                :WS-SHPSUM                                        12570009
125800                     )                                            12580009
125900             END-EXEC                                             12590009
126000          WHEN DS009-PROCESS-TABLE = 'TLBVRDA'                    12600009
126100             EXEC SQL                                             12610009
126200                INSERT INTO TLBVRDA                               12620009
126300                  (                                               12630009
126400                      PO_NBR                                      12640009
126500                     ,RCVR_SEQ_NBR                                12650009
126600                     ,PO_LNE_NBR                                  12660009
126700                     ,PREPK_ID                                    12670009
126800                     ,OTPK_UNT_QTY                                12680009
126900                     ,LBL_ASG_IND                                 12690009
127000                     ,LBL_TYP_CDE                                 12700009
127100                     ,LBL_ASG_SEQ_NBR                             12710009
127200                     ,PRNT_CART_SEQ_ID                            12720009
127300                     ,CART_LBL_TYP_CDE                            12730009
127400                     ,PREPK_PRCG_LNE_NBR                          12740009
127500                     ,INPK_UNT_QTY                                12750009
127600                     ,PREPK_RATO_QTY                              12760009
127700                     ,PREPK_UNT_QTY                               12770009
127800                     ,DEST_OPER_UNT_ID                            12780009
127900                     ,CSE_PK_QTY                                  12790009
128000                     ,ODD_CART_IND                                12800009
128100                     ,INPK_CNVYB_IND                              12810009
128200                     ,LBL_TYP_LBL_SEQ_ID                          12820009
128300                     ,LBL_TYP_TOT_QTY                             12830009
128400                     ,BRCDE_NBR                                   12840009
128500                     ,STR_ZN_ID                                   12850009
128600                     ,MODU_DESC                                   12860009
128700                     ,ITM_NBR                                     12870009
128800                     ,DEPT_DESC                                   12880009
128900                     ,MAJ_CL_DESC                                 12890009
129000                     ,SEASET_NM                                   12900009
129100                     ,FIXT_ID                                     12910009
129200                     ,STRG_AREA_CDE                               12920009
129300                     ,RCLM_IND                                    12930009
129400*CLP 03/21/2016                                                   12940009
129500                     ,LBL_MSG_TXT                                 12950009
129600                  )                                               12960009
129700              VALUES (                                            12970009
129800                :WS-LBVRDA-PO-NBR                                 12980009
129900               ,:WS-LBVRDA-RCVR-SEQ-NBR                           12990009
130000               ,:WS-LBVRDA-PO-LNE-NBR                             13000009
130100               ,:WS-LBVRDA-PREPK-ID                               13010009
130200               ,:WS-LBVRDA-OTPK-UNT-QTY                           13020009
130300               ,:WS-LBVRDA-LBL-ASG-IND                            13030009
130400               ,:WS-LBVRDA-LBL-TYP-CDE                            13040009
130500               ,:WS-LBVRDA-LBL-ASG-SEQ-NBR                        13050009
130600               ,:WS-LBVRDA-PRNT-CART-SEQ-ID                       13060009
130700               ,:WS-LBVRDA-CART-LBL-TYP-CDE                       13070009
130800               ,:WS-LBVRDA-PREPK-PRCG-LNE-NBR                     13080009
130900               ,:WS-LBVRDA-INPK-UNT-QTY                           13090009
131000               ,:WS-LBVRDA-PREPK-RATO-QTY                         13100009
131100               ,:WS-LBVRDA-PREPK-UNT-QTY                          13110009
131200               ,:WS-LBVRDA-DEST-OPER-UNT-ID                       13120009
131300               ,:WS-LBVRDA-CSE-PK-QTY                             13130009
131400               ,:WS-LBVRDA-ODD-CART-IND                           13140009
131500               ,:WS-LBVRDA-INPK-CNVYB-IND                         13150009
131600               ,:WS-LBVRDA-LBL-TYP-LBL-SEQ-ID                     13160009
131700               ,:WS-LBVRDA-LBL-TYP-TOT-QTY                        13170009
131800               ,:WS-LBVRDA-BRCDE-NBR                              13180009
131900               ,:WS-LBVRDA-STR-ZN-ID                              13190009
132000               ,:WS-LBVRDA-MODU-DESC                              13200009
132100               ,:WS-LBVRDA-ITM-NBR                                13210009
132200               ,:WS-LBVRDA-DEPT-DESC                              13220009
132300               ,:WS-LBVRDA-MAJ-CL-DESC                            13230009
132400               ,:WS-LBVRDA-SEASET-NM                              13240009
132500               ,:WS-LBVRDA-FIXT-ID                                13250009
132600               ,:WS-LBVRDA-STRG-AREA-CDE                          13260009
132700               ,:WS-LBVRDA-RCLM-IND                               13270009
132800*CLP 03/21/2016                                                   13280009
132900               ,:WS-LBVRDA-LBL-MSG-TXT                            13290009
133000                     )                                            13300009
133100             END-EXEC                                             13310009
133200          WHEN DS009-PROCESS-TABLE = 'TLBPTDA'                    13320009
133300             EXEC SQL                                             13330009
133400                INSERT INTO TLBPTDA                               13340009
133500                  (                                               13350009
133600                         TRIP_ID                                  13360009
133700                        ,CRE_USR_ID                               13370009
133800                        ,LBL_PRT_BTCH_ID                          13380009
133900                        ,SHIPT_UNT_ID                             13390009
134000                        ,OPER_UNT_ID                              13400009
134100                        ,FCLTY_ID                                 13410009
134200                        ,CRE_TMST                                 13420009
134300                        ,OWNR_SCAC_ID                             13430009
134400                        ,VEH_NBR                                  13440009
134500                        ,RPRT_IND                                 13450009
134600                        ,SU_DUP_LBL_IND                           13460009
134700                        ,SU_FRE_ASTRA_IND                         13470009
134800                        ,SU_MSSG_DAT_IND                          13480009
134900                        ,SU_MISDIR_IND                            13490009
135000                        ,MISDIR_OPER_UNT_ID                       13500009
135100                        ,PO_NBR                                   13510009
135200                        ,RCVR_SEQ_NBR                             13520009
135300                        ,PO_LNE_NBR                               13530009
135400                        ,DEST_OPER_UNT_ID                         13540009
135500                        ,STR_NM                                   13550009
135600                        ,STR_ZN_ID                                13560009
135700                        ,SKU_DEPT_NBR                             13570009
135800                        ,SKU_CL_NBR                               13580009
135900                        ,VS_NBR                                   13590009
136000                        ,OTPK_UNT_QTY                             13600009
136100                        ,INPK_UNT_QTY                             13610009
136200                        ,PRTR_ID                                  13620009
136300                        ,BRCDE_NBR                                13630009
136400                        ,DC_PRTD_AT_CDE                           13640009
136500                        ,INVLD_DAT_ERR_CDE                        13650009
136600                        ,PREPK_ID                                 13660009
136700                        ,PREPK_RATO_QTY                           13670009
136800                        ,PREPK_UNT_QTY                            13680009
136900                        ,CSE_PK_QTY                               13690009
137000                        ,ODD_CART_IND                             13700009
137100                        ,INPK_CNVYB_IND                           13710009
137200                        ,LBL_TYP_LBL_SEQ_ID                       13720009
137300                        ,LBL_TYP_TOT_QTY                          13730009
137400                        ,MODU_DESC                                13740009
137500                        ,ITM_NBR                                  13750009
137600                        ,DEPT_DESC                                13760009
137700                        ,MAJ_CL_DESC                              13770009
137800                        ,SEASET_NM                                13780009
137900                        ,FIXT_ID                                  13790009
138000                        ,CART_LBL_TYP_CDE                         13800009
138100                        ,STRG_AREA_CDE                            13810009
138200                        ,CART_ACTN_CDE                            13820009
138300                        ,HNG_FOLD_SEQ_NBR                         13830009
138400                        ,BUS_AREA_ID                              13840009
138500                        ,SKU_NBR                                  13850009
138600***CLP 03/21/2016                                                 13860009
138700                        ,LBL_MSG_TXT                              13870009
138800                  )                                               13880009
138900              VALUES (                                            13890009
139000                :WS-LBPTDA                                        13900009
139100                     )                                            13910009
139200             END-EXEC                                             13920009
139300          END-EVALUATE                                            13930009
139400                                                                  13940009
139500     END-PERFORM.                                                 13950009
139600                                                                  13960009
139700     PERFORM DS002-SQL-ABEND-INSERT.                              13970009
139800 EJECT                                                            13980009
139900                                                                  13990009
140000 1100-GET-DB2-INSTANCE.                                           14000009
140100                                                                  14010009
140200     MOVE '1100-GET-DB2-INSTANCE'                                 14020009
140300          TO DS009-PARAGRAPH.                                     14030009
140400     MOVE 'GET DB2 INSTANCE'                                      14040009
140500          TO DS009-OPERATION.                                     14050009
140600                                                                  14060009
140700     EXEC SQL                                                     14070009
140800         SELECT CURRENT SERVER INTO :WS-LOCAL-SERVER              14080009
140900             FROM SYSIBM.SYSDUMMY1 WITH UR                        14090009
141000     END-EXEC.                                                    14100009
141100                                                                  14110009
141200     EVALUATE TRUE                                                14120009
141300         WHEN SQLCODE = +0                                        14130009
141310             CONTINUE                                             14131009
141320         WHEN SQLWARN0 NOT = SPACES                               14132009
141330         WHEN SQLCODE < +0                                        14133009
141340         WHEN SQLCODE > +0                                        14134009
141350             PERFORM DS002-SQL-ERROR                              14135009
141360     END-EVALUATE.                                                14136009
141370*                                                                 14137009
141380 1200-CHECK-IF-PRODUCTION.                                        14138009
141390                                                                  14139009
141391     MOVE '1200-CHECK-IF-PRODUCTION'                              14139109
141392          TO DS009-PARAGRAPH.                                     14139209
141393     MOVE 'SELECT PRDCHK TKRPRPM '                                14139309
141394          TO DS009-OPERATION.                                     14139409
141395                                                                  14139509
141396     EXEC SQL                                                     14139609
141397       SELECT FUNC_TXT                                            14139709
141398         INTO :KRPRPM-FUNC-TXT                                    14139809
141399       FROM   TKRPRPM                                             14139909
141400       WHERE  SYS_PRC_FUNC_CDE  = :PC-PRDCHK                      14140009
141401         AND  INTFC_SYS_CDE     = :PC-KHL                         14140109
141402         AND  LOC_ID            = :PC-90                          14140209
141403         AND  FUNC_TXT          = :PC-PARM-TEXT                   14140309
141404     END-EXEC                                                     14140409
141405                                                                  14140509
141406     EVALUATE TRUE                                                14140609
141407         WHEN SQLCODE = +0                                        14140709
141408             CONTINUE                                             14140809
141409         WHEN SQLCODE = +100                                      14140909
141410             DISPLAY '*******************************************'14141009
141411             DISPLAY '** ABEND - DO NOT RUN THIS DSKUT407 PROGRAM'14141109
141412             DISPLAY '** ABEND - AGAINST PRODUCTION'              14141209
141413             DISPLAY '** ABEND - THIS SHOULD ONLY EVER BE'        14141309
141414             DISPLAY '** ABEND - RUN AGAINST TEST DATA'           14141409
141415             DISPLAY '*******************************************'14141509
141416             DISPLAY '** ABEND - THIS RUN IS GOING AGAINST'       14141609
141417             DISPLAY '** ABEND - DB2 INSTANCE:  '                 14141709
141418                     WS-LOCAL-SERVER                              14141809
141419             DISPLAY '*******************************************'14141909
141420             PERFORM DS002-SQL-ERROR                              14142009
141421                                                                  14142109
141422         WHEN SQLWARN0 NOT = SPACES                               14142209
141423         WHEN SQLCODE < +0                                        14142309
141424         WHEN SQLCODE > +0                                        14142409
141425             PERFORM DS002-SQL-ERROR                              14142509
141426     END-EVALUATE.                                                14142609
141427                                                                  14142709
141428 9000-DUMP-COUNT-TABLE.                                           14142809
141429                                                                  14142909
141430     DISPLAY '  ****  INSERT TOTALS  ****'                        14143009
141431                                                                  14143109
141432     PERFORM VARYING CNTL-I FROM 1 BY 1 UNTIL                     14143209
141433           CNTL-I > CNTL-SUB-MAX OR CNTL-I > 200                  14143309
141434         IF CNTL-TABLE(CNTL-I) NOT = SPACES                       14143409
141435             IF DS009-GROUP-NBR(CNTL-I) = '2'                     14143509
141436                 MOVE DS009-READ-COUNT (CNTL-I) TO DS009-DISP-NBR 14143609
141437                 DISPLAY 'TABLE = ' CNTL-TABLE(CNTL-I)            14143709
141438                              DS009-DISP-NBR                      14143809
141439                 ADD DS009-READ-COUNT (CNTL-I) TO PV-TOTAL-COUNT  14143909
141440             END-IF                                               14144009
141450         END-IF                                                   14145009
141460     END-PERFORM.                                                 14146009
141470                                                                  14147009
141480     MOVE PV-TOTAL-COUNT            TO DS009-DISP-NBR             14148009
141490     DISPLAY SPACES.                                              14149009
141500     DISPLAY '**  TOTAL INSERTS = ' DS009-DISP-NBR.               14150009
141600/                                                                 14160009
141700***************************************************************** 14170009
141800*     PRODUCTION - TO - TEST STANDARD PARAGRAPHS                * 14180009
141900***************************************************************** 14190009
142000     COPY DSPD02Q.                                                14200009
