000100 IDENTIFICATION DIVISION.                                         00010016
000200 PROGRAM-ID.     DSKUT404.                                        00020016
000300 AUTHOR.         RICHARD MOORE.                                   00030016
000400 DATE-WRITTEN.   12/01/98.                                        00040016
000500 DATE-COMPILED.                                                   00050016
000600                                                                  00060016
000700******************************************************************00070016
000800*                                                                 00080016
000900*PURPOSE:   INSERT GROUP1 DATA  -  QA                             00090017
001000*                                                                 00100016
001100******************************************************************00110016
001200*CHANGE HISTORY:                                                  00120016
001300* WR/PROJ  DATE        DESCRIPTION OF CHANGES                     00130016
001400* -------  ----------  ----------------------------------------   00140016
001500* RWJ      05-02-2003  VSM REQUESTED CHANGES TO PROD TO TEST PER  00150016
001600*                      PAUL KEBER. - ROD JANSSEN                  00160016
001700*                      LOGIC REMOVAL FOR TABLES:                  00170016
001800*                       TSK       TUPC        TUPCSKU             00180016
001900*                       TSKXREF   TMDARVS     TUPCPLS             00190016
002000*                       TVNDSTL   TEXTENT     TENTNME             00200016
002100*                       TMDSEAR                                   00210016
002200* PJK      05-24-2007  TVNDDPT REMOVED TO BE ADDED TO VSM UPDATES 00220016
002210* J KURK   03-2021     REMOVE TPOUPC AND TSPSTDS                  00221016
002220* J KURK   08-2022     RECOMPILE FOR COPYBOOK DSPD002             00222016
004510* J KURK   04-2023     ADD LOC_NBR TO TASNORD                     00223018
004510*                      ADD TABLES TTRDPRT, TFGTRST, TINTTRN       00224018
002300******************************************************************00230016
002400                                                                  00240016
002500 ENVIRONMENT DIVISION.                                            00250016
002600 INPUT-OUTPUT SECTION.                                            00260016
002700 FILE-CONTROL.                                                    00270016
002800                                                                  00280016
002900     SELECT PO-NBR-FILE                                           00290016
003000         ASSIGN         TO UT-S-PO01.                             00300016
003100     SELECT TBLE-FILE                                             00310016
003200         ASSIGN         TO UT-S-TBL01.                            00320016
003300     SELECT CONTROL-FILE                                          00330016
003400         ASSIGN         TO UT-S-CTL01.                            00340016
003500                                                                  00350016
003600 DATA DIVISION.                                                   00360016
003700 FILE SECTION.                                                    00370016
003800     COPY DSFD001.                                                00380016
003900                                                                  00390016
004000******************************************************************00400016
004100 WORKING-STORAGE SECTION.                                         00410016
004200******************************************************************00420016
004300     COPY DSWS08Q.                                                00430016
004400     COPY DSWS009.                                                00440016
004500     COPY DSWS10Q.                                                00450016
004600     COPY DSRD002.                                                00460016
004700     COPY DPWS004.                                                00470016
004800                                                                  00480016
004900***CLP 08/04/2015 TABLES NEEDED FOR BRAND                         00490016
005000******************************************************************00500016
005100*  DCLGEN FOR XLT_BRND TABLE *                                    00510016
005200******************************************************************00520016
005300* CLP TAKE OUT IN DSWS011                                         00530016
005400*    EXEC SQL                                                     00540016
005500*         INCLUDE XLT00043                                        00550016
005600*    END-EXEC.                                                    00560016
005700******************************************************************00570016
005800*  DCLGEN FOR TMDARVS TABLE *                                     00580016
005900******************************************************************00590016
006000*    EXEC SQL                                                     00600016
006100*         INCLUDE TMDARVS                                         00610016
006200*    END-EXEC.                                                    00620016
006300******************************************************************00630016
006400*  DCLGEN FOR TVSCHVL TABLE *                                     00640016
006500******************************************************************00650016
006600*    EXEC SQL                                                     00660016
006700*         INCLUDE TVSCHVL                                         00670016
006800*    END-EXEC.                                                    00680016
006900******************************************************************00690016
007000*  DCLGEN FOR IMT_LBL TABLE *                                     00700016
007100******************************************************************00710016
007200* CLP IN DSWS011                                                  00720016
007300*    EXEC SQL                                                     00730016
007400*         INCLUDE IMT00000                                        00740016
007500*    END-EXEC.                                                    00750016
007600***CLP 08/04/2015 END                                             00760016
007700                                                                  00770016
007800******************************************************************00780016
007900 01  OTHER-CRAPOLA.                                               00790016
008000     05  PV-READ-COUNT                PIC S9(9) COMP-3 VALUE      00800016
008100                                                   ZERO.          00810016
008200     05  PV-TOTAL-COUNT               PIC S9(9) COMP-3 VALUE      00820016
008300                                                   ZERO.          00830016
008400     05  PV-DISPLAY-NBR               PIC Z(17)9.                 00840016
008400     05  PV-NULL                      PIC S9(04) COMP VALUE +0.   00841020
008500     05  PV-WHEN-COMPILED.                                        00850016
008600         10  PV-COMPILE-DATE          PIC X(08).                  00860016
008700         10  PV-COMPILE-TIME          PIC X(08).                  00870016
008701                                                                  00870116
008702 01  PC-CONSTANTS.                                                00870216
008703     05  PC-90                       PIC S9(04)    COMP           00870316
008704                                                   VALUE 90.      00870416
008705     05  PC-A                        PIC  X(01)    VALUE 'A'.     00870516
008706     05  PC-Y                        PIC  X(01)    VALUE 'Y'.     00870616
008707     05  PC-RCV                      PIC  X(03)    VALUE 'RCV'.   00870716
008708     05  PC-KHL                      PIC  X(03)    VALUE 'KHL'.   00870816
008709     05  PC-PRDCHK                   PIC  X(06)    VALUE 'PRDCHK'.00870916
008710     05  PC-PARM-TEXT                PIC  X(25)    VALUE          00871016
008720         'LOWER LEVEL ONLY         '.                             00872016
008730     05  PC-CURRENT-PROGRAM-NAME     PIC  X(08)    VALUE          00873016
008740         'DSKUT404'.                                              00874016
008750                                                                  00875016
008760 01  WS-LOCAL-SERVER.                                             00876016
008770     05  WS-SUBSYS                   PIC X(04)  VALUE SPACES.     00877016
008780     05  FILLER                      PIC X(12)  VALUE SPACES.     00878016
008790*                                                                 00879016
008800                                                                  00880016
008900*  COMMUNICATIONS AREA FOR PROD TO TEST UTILITIES                 00890016
009000     COPY DSWS11Q.                                                00900016
009100*                                                                 00910016
009200 PROCEDURE DIVISION.                                              00920016
009300                                                                  00930016
009400 A100-MAINLINE.                                                   00940016
009500                                                                  00950016
009600     DISPLAY SPACES                                               00960016
009700     MOVE WHEN-COMPILED TO PV-WHEN-COMPILED                       00970016
009800     DISPLAY ' *** DSKUT404 VERSION 3 ***'                        00980016
009900     DISPLAY 'COMPILE DATE: ' PV-COMPILE-DATE                     00990016
010000             ' ' PV-COMPILE-TIME                                  01000016
010100                                                                  01010016
010110     PERFORM 1100-GET-DB2-INSTANCE.                               01011016
010120     PERFORM 1200-CHECK-IF-PRODUCTION.                            01012016
010130                                                                  01013016
010140     SET DS009-I-PGM TO TRUE.                                     01014016
010150     PERFORM DS002-INITIAL-PROCESSING.                            01015016
010160     PERFORM B100-PROCESSING                                      01016016
010170         UNTIL TABLE-EOF.                                         01017016
010180                                                                  01018016
010190                                                                  01019016
010200     PERFORM 9000-DUMP-COUNT-TABLE                                01020016
010300                                                                  01030016
010400     PERFORM DS002-END-OF-JOB.                                    01040016
010500                                                                  01050016
010600     GOBACK.                                                      01060016
010700/                                                                 01070016
010800 B100-PROCESSING.                                                 01080016
010900*                                                                 01090016
011000***************************************************************** 01100016
011100*     FOR EACH TABLE, INSERT DATA INTO TEST TABLES                01110016
011200***************************************************************** 01120016
011300*                                                                 01130016
011400     READ TBLE-FILE INTO DS002-RECORD                             01140016
011500         AT END                                                   01150016
011600             SET TABLE-EOF TO TRUE                                01160016
011700         NOT AT END                                               01170016
011800             ADD 1 TO PV-READ-COUNT                               01180016
011900     END-READ.                                                    01190016
012000     IF NOT-TABLE-EOF                                             01200016
012100        MOVE DS002-DATA-SIZE TO DS009-TBLE-DATA-SIZE              01210016
012200        MOVE DS002-NAME TO DS009-PROCESS-TABLE                    01220016
012300        MOVE DS002-KEYS TO DS009-PKYS                             01230016
012400        PERFORM DS002-DO-PROCESS                                  01240016
012500                                                                  01250016
012600        IF DS009-DO-PROCESS                                       01260016
012700*       DISPLAY '**********************************'              01270016
012800*       DISPLAY DS009-PROCESS-TABLE                               01280016
012900        EVALUATE TRUE                                             01290016
013000         WHEN DS009-PROCESS-TABLE = 'TPURCHS'                     01300016
013100             MOVE DS002-DATA-ITEM TO WS-PURCHS                    01310016
013200             MOVE WS-PURCHS-PO-NBR        TO HOLD-PO-NBR          01320016
013300*            DISPLAY HOLD-PO-NBR                                  01330016
013400*            DISPLAY WS-PURCHS                                    01340016
013500             PERFORM R100-INSERT                                  01350016
013600*        WHEN DS009-PROCESS-TABLE = 'TWEBITM'                     01360016
013700*            MOVE DS002-DATA-ITEM        TO WS-WEBITM             01370016
013800*            MOVE WS-WEBITM-INTR-UPC-ID  TO HOLD-INTR-UPC-ID      01380016
013900*            DISPLAY HOLD-INTR-UPC-ID                             01390016
014000*            DISPLAY WS-WEBITM                                    01400016
014100*            PERFORM R100-INSERT                                  01410016
014200         WHEN DS009-PROCESS-TABLE = 'TPURITM'                     01420016
014300             MOVE DS002-DATA-ITEM TO WS-PURITM                    01430016
014400             MOVE WS-PURITM-PO-NBR        TO HOLD-PO-NBR          01440016
014500*            DISPLAY HOLD-PO-NBR                                  01450016
014600*            DISPLAY WS-PURITM                                    01460016
014700             PERFORM R100-INSERT                                  01470016
014800         WHEN DS009-PROCESS-TABLE = 'TPOAGMT'                     01480016
014900             MOVE DS002-DATA-ITEM TO WS-POAGMT                    01490016
015000             MOVE WS-POAGMT-PO-NBR        TO HOLD-PO-NBR          01500016
015100*            DISPLAY HOLD-PO-NBR                                  01510016
015200*            DISPLAY WS-POAGMT                                    01520016
015300             PERFORM R100-INSERT                                  01530016
015400         WHEN DS009-PROCESS-TABLE = 'TPOINST'                     01540016
015500             MOVE DS002-DATA-ITEM TO WS-POINST                    01550016
015600             MOVE WS-POINST-PO-NBR        TO HOLD-PO-NBR          01560016
015700*            DISPLAY HOLD-PO-NBR                                  01570016
015800*            DISPLAY WS-POINST                                    01580016
015900             PERFORM R100-INSERT                                  01590016
016000         WHEN DS009-PROCESS-TABLE = 'TIMPORL'                     01600016
016100             MOVE DS002-DATA-ITEM TO WS-IMPORL                    01610016
016200             MOVE WS-IMPORL-PO-NBR        TO HOLD-PO-NBR          01620016
016300*            DISPLAY HOLD-PO-NBR                                  01630016
016400*            DISPLAY WS-IMPORL                                    01640016
016500             PERFORM R100-INSERT                                  01650016
016600         WHEN DS009-PROCESS-TABLE = 'TALLPLN'                     01660016
016700             MOVE DS002-DATA-ITEM TO WS-ALLPLN                    01670016
016800             MOVE WS-ALLPLN-PO-NBR        TO HOLD-PO-NBR          01680016
016900*            DISPLAY HOLD-PO-NBR                                  01690016
017000*            DISPLAY WS-ALLPLN                                    01700016
017100             PERFORM R100-INSERT                                  01710016
017200         WHEN DS009-PROCESS-TABLE = 'TPLNSHP'                     01720016
017300             MOVE DS002-DATA-ITEM TO WS-PLNSHP                    01730016
017400             MOVE WS-PLNSHP-PO-NBR        TO HOLD-PO-NBR          01740016
017500*            DISPLAY HOLD-PO-NBR                                  01750016
017600*            DISPLAY WS-PLNSHP                                    01760016
017700             PERFORM R100-INSERT                                  01770016
017800*        WHEN DS009-PROCESS-TABLE = 'TSK'                         01780016
017900*            MOVE DS002-DATA-ITEM TO WS-SK                        01790016
018000*            MOVE WS-TSK-ITEM-NMBR        TO HOLD-ITEM-NBR        01800016
018100*            DISPLAY HOLD-ITEM-NBR                                01810016
018200*            DISPLAY WS-SK                                        01820016
018300*            PERFORM R100-INSERT                                  01830016
018400*        WHEN DS009-PROCESS-TABLE = 'TUPC' AND DS002-VERSION = 01 01840016
018500*            MOVE DS002-DATA-ITEM TO WS-UPC                       01850016
018600*            MOVE WS-UPC-UPC-ID           TO HOLD-UPC-NBR         01860016
018700**           DISPLAY HOLD-UPC-NBR                                 01870016
018800**           DISPLAY WS-UPC                                       01880016
018900*            PERFORM R100-INSERT                                  01890016
019000*        WHEN DS009-PROCESS-TABLE = 'TUPC'                        01900016
019100*        WHEN DS009-PROCESS-TABLE = 'TUPC' AND DS002-VERSION = 02 01910016
019200*            MOVE DS002-DATA-ITEM TO WS-UPC                       01920016
019300*            MOVE WS-UPC-UPC-ID           TO HOLD-UPC-NBR         01930016
019400*            DISPLAY HOLD-UPC-NBR                                 01940016
019500*            DISPLAY WS-UPC                                       01950016
019600*            PERFORM R100-INSERT                                  01960016
019700*        WHEN DS009-PROCESS-TABLE = 'TUPCSKU'                     01970016
019800*            MOVE DS002-DATA-ITEM TO WS-UPCSKU                    01980016
019900*            MOVE WS-TUPCSKU-UPC-NBR      TO HOLD-UPC-NBR         01990016
020000*            DISPLAY HOLD-ITEM-NBR                                02000016
020100*            DISPLAY WS-UPCSKU                                    02010016
020200*            PERFORM R100-INSERT                                  02020016
020300*        WHEN DS009-PROCESS-TABLE = 'TUPCPLS'                     02030016
020400*            MOVE DS002-DATA-ITEM TO WS-UPCPLS                    02040016
020500*            MOVE WS-UPCPLS-UPC-ID       TO HOLD-UPC-ID           02050016
020600*            DISPLAY HOLD-UPC-ID                                  02060016
020700*            DISPLAY WS-UPCPLS                                    02070016
020800*            PERFORM R100-INSERT                                  02080016
020900*        WHEN DS009-PROCESS-TABLE = 'TSKXREF'                     02090016
021000*            MOVE DS002-DATA-ITEM TO WS-SKXREF                    02100016
021100*            MOVE WS-SKXREF-ITM-NBR      TO HOLD-ITM-NBR          02110016
021200*            DISPLAY HOLD-ITM-NBR                                 02120016
021300*            DISPLAY WS-SKXREF                                    02130016
021400*            PERFORM R100-INSERT                                  02140016
021500*        WHEN DS009-PROCESS-TABLE = 'TMDSEAR'                     02150016
021600*            MOVE DS002-DATA-ITEM TO WS-MDSEAR                    02160016
021700*            MOVE WS-MDSEAR-MDSEAR-DKEY  TO                       02170016
021800*                   HOLD-SUB-CL-MDSEAR-ID                         02180016
021900*            DISPLAY HOLD-SUB-CL-MDSEAR-ID                        02190016
022000*            DISPLAY WS-MDSEAR                                    02200016
022100*            PERFORM R100-INSERT                                  02210016
022200*        WHEN DS009-PROCESS-TABLE = 'TMDARVS'                     02220016
022300*            MOVE DS002-DATA-ITEM TO WS-MDARVS                    02230016
022400*            MOVE WS-MDARVS-SUB-CL-MDSEAR-ID  TO                  02240016
022500*                   HOLD-SUB-CL-MDSEAR-ID                         02250016
022600*            DISPLAY HOLD-SUB-CL-MDSEAR-ID                        02260016
022700*            DISPLAY WS-MDARVS                                    02270016
022800*            PERFORM R100-INSERT                                  02280016
022900*        WHEN DS009-PROCESS-TABLE = 'TVNDSTL'                     02290016
023000*            MOVE DS002-DATA-ITEM TO WS-VNDSTL                    02300016
023100*            MOVE WS-VNDSTL-VS-ID         TO HOLD-VS-ID           02310016
023200*            DISPLAY HOLD-VS-ID                                   02320016
023300*            DISPLAY WS-VNDSTL                                    02330016
023400*            PERFORM R100-INSERT                                  02340016
023500         WHEN DS009-PROCESS-TABLE = 'TINPKSU'                     02350016
023600             MOVE DS002-DATA-ITEM TO WS-INPKSU                    02360016
023700             MOVE WS-INPKSU-SHIPT-UNT-ID TO HOLD-SHIPT-UNIT-ID    02370016
023800*            DISPLAY HOLD-SHIPT-UNIT-ID                           02380016
023900*            DISPLAY WS-INPKSU                                    02390016
024000             PERFORM R100-INSERT                                  02400016
024400         WHEN DS009-PROCESS-TABLE = 'TSHUUPC'                     02440016
024500             MOVE DS002-DATA-ITEM TO WS-SHUUPC                    02450016
024600             MOVE WS-SHUUPC-SHIPT-UNT-ID TO HOLD-SHIPT-UNIT-ID    02460016
024700*            DISPLAY HOLD-SHIPT-UNIT-ID                           02470016
024800*            DISPLAY WS-SHUUPC                                    02480016
024900             PERFORM R100-INSERT                                  02490016
025000         WHEN DS009-PROCESS-TABLE = 'TSHPUNT'                     02500016
025100             MOVE DS002-DATA-ITEM TO WS-SHPUNT                    02510016
025200             MOVE WS-SHPUNT-SHIPT-UNT-ID TO HOLD-SHIPT-UNIT-ID    02520016
025300*            DISPLAY HOLD-SHIPT-UNIT-ID                           02530016
025400*            DISPLAY WS-SHPUNT                                    02540016
025500             PERFORM R100-INSERT                                  02550016
025600         WHEN DS009-PROCESS-TABLE = 'TSHUNLO'                     02560016
025700             MOVE DS002-DATA-ITEM TO WS-SHUNLO                    02570016
025800             MOVE WS-SHUNLO-SHIPT-UNT-ID TO HOLD-SHIPT-UNIT-ID    02580016
025900*            DISPLAY HOLD-SHIPT-UNIT-ID                           02590016
026000*            DISPLAY WS-SHUNLO                                    02600016
026100             PERFORM R100-INSERT                                  02610016
026200         WHEN DS009-PROCESS-TABLE = 'TMESTDS'                     02620016
026300             MOVE DS002-DATA-ITEM TO WS-MESTDS                    02630016
026400             MOVE WS-MESTDS-PO-NBR       TO HOLD-PO-NBR           02640016
026500*            DISPLAY HOLD-PO-NBR                                  02650016
026600*            DISPLAY WS-MESTDS                                    02660016
026700             PERFORM R100-INSERT                                  02670016
026800*        WHEN DS009-PROCESS-TABLE = 'TEXTENT'                     02680016
026900*            MOVE DS002-DATA-ITEM TO WS-EXTENT                    02690016
027000*            MOVE WS-EXTENT-ENT-ID    TO HOLD-ENT-ID              02700016
027100*            PERFORM R100-INSERT                                  02710016
027200*        WHEN DS009-PROCESS-TABLE = 'TENTNME'                     02720016
027300*            MOVE DS002-DATA-ITEM TO WS-ENTNME                    02730016
027400*            MOVE WS-ENTNME-ENT-ID        TO HOLD-ENT-ID          02740016
027500*            PERFORM R100-INSERT                                  02750016
027600*        WHEN DS009-PROCESS-TABLE = 'TVNDDPT'                     02760016
027700*            MOVE DS002-DATA-ITEM TO WS-VNDDPT                    02770016
027800*            MOVE WS-VNDDPT-ENT-ID        TO HOLD-ENT-ID          02780016
027900*            PERFORM R100-INSERT                                  02790016
028000         WHEN DS009-PROCESS-TABLE = 'TINSTCD'                     02800016
028100             MOVE DS002-DATA-ITEM TO WS-INSTCD                    02810016
028200             MOVE WS-INSTCD-INSTR-NBR     TO HOLD-INSTR-NBR       02820016
028300*            DISPLAY HOLD-INSTR-NBR                               02830016
028400*            DISPLAY WS-INSTCD                                    02840016
028500             PERFORM R100-INSERT                                  02850016
028600*        WHEN DS009-PROCESS-TABLE = 'TSPSTDS'                     02860016
028700*            MOVE DS002-DATA-ITEM TO WS-SPSTDS                    02870016
028800*            MOVE WS-SPSTDS-PO-NBR        TO HOLD-PO-NBR          02880016
028900*            DISPLAY HOLD-PO-NBR                                  02890016
029000*            DISPLAY WS-SPSTDS                                    02900016
029100*            PERFORM R100-INSERT                                  02910016
029200         WHEN DS009-PROCESS-TABLE = 'TTRBNTF'                     02920016
029300             MOVE DS002-DATA-ITEM TO WS-TRBNTF                    02930016
029400             MOVE WS-TRBNTF-PO-NBR        TO HOLD-PO-NBR          02940016
029500*            DISPLAY HOLD-PO-NBR                                  02950016
029600*            DISPLAY WS-TRBNTF                                    02960016
029700             PERFORM R100-INSERT                                  02970016
029800         WHEN DS009-PROCESS-TABLE = 'TTRBDTL'                     02980016
029900             MOVE DS002-DATA-ITEM TO WS-TRBDTL                    02990016
030000             MOVE WS-TRBDTL-NOTIF-NBR     TO HOLD-NOTIF-NBR       03000016
030100*            DISPLAY HOLD-NOTIF-NBR                               03010016
030200*            DISPLAY WS-TRBDTL                                    03020016
030300             PERFORM R100-INSERT                                  03030016
030400*        WHEN DS009-PROCESS-TABLE = 'TPOUPC'                      03040016
030500*            MOVE DS002-DATA-ITEM         TO WS-POUPC             03050016
030600*            MOVE WS-POUPC-PO-NBR         TO HOLD-PO-NBR          03060016
030700*            DISPLAY HOLD-PO-NBR                                  03070016
030800*            DISPLAY WS-POUPC                                     03080016
030900*            PERFORM R100-INSERT                                  03090016
031000         WHEN DS009-PROCESS-TABLE = 'TALLTMP'                     03100016
031100             MOVE DS002-DATA-ITEM         TO WS-ALLTMP            03110016
031200             MOVE WS-ALLTMP-PO-NBR        TO HOLD-PO-NBR          03120016
031300*            DISPLAY HOLD-PO-NBR                                  03130016
031400*            DISPLAY WS-ALLTMP                                    03140016
031500             PERFORM R100-INSERT                                  03150016
031600*        WHEN DS009-PROCESS-TABLE = 'TPAYREQ'                     03160016
031700*            MOVE DS002-DATA-ITEM         TO WS-PAYREQ            03170016
031800*            MOVE WS-PAYREQ-PO-NBR        TO HOLD-PO-NBR          03180016
031900*            DISPLAY HOLD-PO-NBR                                  03190016
032000*            DISPLAY WS-PAYREQ                                    03200016
032100*            PERFORM R100-INSERT                                  03210016
032200         WHEN DS009-PROCESS-TABLE = 'TASNORD'                     03220016
032300             MOVE DS002-DATA-ITEM         TO WS-ASNORD            03230016
032400             MOVE WS-ASNORD-ASNHDR-ID     TO HOLD-ASNHDR-ID       03240016
032500             MOVE WS-ASNORD-PO-NBR        TO HOLD-SPO-NBR         03250016
032600*            DISPLAY HOLD-ASNHDR-ID                               03260016
032700*            DISPLAY HOLD-SPO-NBR                                 03270016
032800*            DISPLAY WS-ASNORD                                    03280016
032900             PERFORM R100-INSERT                                  03290016
033000         WHEN DS009-PROCESS-TABLE = 'TINVOIC'                     03300016
033100             MOVE DS002-DATA-ITEM         TO WS-INVOIC            03310016
033200             MOVE WS-INVOIC-PAYT-REQ-SEQ-NBR                      03320016
033300                              TO HOLD-PAYT-REQ-SEQ-NBR            03330016
033400*            DISPLAY HOLD-PAYT-REQ-SEQ-NBR                        03340016
033500*            DISPLAY WS-INVOIC                                    03350016
033600             PERFORM R100-INSERT                                  03360016
033700* 8/15   WHEN DS009-PROCESS-TABLE = 'TALCHRG'                     03370016
033800*            MOVE DS002-DATA-ITEM         TO WS-ALCHRG            03380016
033900*            MOVE WS-ALCHRG-PAYT-REQ-SEQ-NBR                      03390016
034000*                             TO HOLD-PAYT-REQ-SEQ-NBR            03400016
034100*            DISPLAY HOLD-PAYT-REQ-SEQ-NBR                        03410016
034200*            DISPLAY WS-ALCHRG                                    03420016
034300*            PERFORM R100-INSERT                                  03430016
034400         WHEN DS009-PROCESS-TABLE = 'TPREQIT'                     03440016
034500             MOVE DS002-DATA-ITEM         TO WS-PREQIT            03450016
034600             MOVE WS-PREQIT-PAYT-REQ-SEQ-NBR                      03460016
034700                              TO HOLD-PAYT-REQ-SEQ-NBR            03470016
034800*            DISPLAY HOLD-PAYT-REQ-SEQ-NBR                        03480016
034900*            DISPLAY WS-PREQIT                                    03490016
035000             PERFORM R100-INSERT                                  03500016
035100         WHEN DS009-PROCESS-TABLE = 'TVNDAGR'                     03510016
035200             MOVE DS002-DATA-ITEM         TO WS-VNDAGR            03520016
035300             MOVE WS-VNDAGR-ENT-ID        TO HOLD-ENT-ID          03530016
035400*            DISPLAY HOLD-ENT-ID                                  03540016
035500*            DISPLAY WS-VNDAGR                                    03550016
035600             PERFORM R100-INSERT                                  03560016
035700         WHEN DS009-PROCESS-TABLE = 'TASNDTL'                     03570016
035800             MOVE DS002-DATA-ITEM         TO WS-ASNDTL            03580016
035900             MOVE WS-ASNDTL-ASNHDR-ID     TO HOLD-ASNHDR-ID       03590016
036000*            DISPLAY HOLD-ASNHDR-ID                               03600016
036100*            DISPLAY WS-ASNDTL                                    03610016
036200             PERFORM R100-INSERT                                  03620016
036300         WHEN DS009-PROCESS-TABLE = 'TASNHDR'                     03630016
036400             MOVE DS002-DATA-ITEM         TO WS-ASNHDR            03640016
036500             MOVE WS-ASNHDR-ASNHDR-ID     TO HOLD-ASNHDR-ID       03650016
036600*            DISPLAY HOLD-ASNHDR-ID                               03660016
036700*            DISPLAY WS-ASNHDR                                    03670016
036800             PERFORM R100-INSERT                                  03680016
036900         WHEN DS009-PROCESS-TABLE = 'TASCRIT'                     03690016
037000             MOVE DS002-DATA-ITEM         TO WS-ASCRIT            03700016
037100             MOVE WS-ASCRIT-ASNHDR-ID     TO HOLD-ASNHDR-ID       03710016
037200*            DISPLAY HOLD-ASNHDR-ID                               03720016
037300*            DISPLAY WS-ASCRIT                                    03730016
037400             PERFORM R100-INSERT                                  03740016
037500         WHEN DS009-PROCESS-TABLE = 'TASNCAR'                     03750016
037600             MOVE DS002-DATA-ITEM         TO WS-ASNCAR            03760016
037700             MOVE WS-ASNCAR-ASNHDR-ID     TO HOLD-ASNHDR-ID       03770016
037800*            DISPLAY HOLD-ASNHDR-ID                               03780016
037900*            DISPLAY WS-ASNCAR                                    03790016
038000             PERFORM R100-INSERT                                  03800016
038100         WHEN DS009-PROCESS-TABLE = 'TASDTPL'                     03810016
038200             MOVE DS002-DATA-ITEM         TO WS-ASDTPL            03820016
038300             MOVE WS-ASDTPL-ASNHDR-ID     TO HOLD-ASNHDR-ID       03830016
038400*            DISPLAY HOLD-ASNHDR-ID                               03840019
038500*            DISPLAY WS-ASDTPL                                    03850019
038600             PERFORM R100-INSERT                                  03860016
038700         WHEN DS009-PROCESS-TABLE = 'TSEASET'                     03870016
038800             MOVE DS002-DATA-ITEM          TO WS-SEASET           03880016
038900             MOVE WS-SEASET-SEASET-YR      TO HOLD-SEASET-YR      03890016
039000             MOVE WS-SEASET-SEASET-SHRT-NM TO HOLD-SEASET-SHRT-NM 03900016
039100*            DISPLAY HOLD-SEASET-YR                               03910016
039200*            DISPLAY HOLD-SEASET-SHRT-NM                          03920016
039300*            DISPLAY WS-SEASET                                    03930016
039400             PERFORM R100-INSERT                                  03940016
039500         WHEN DS009-PROCESS-TABLE = 'TSUNAUD'                     03950016
039600             MOVE DS002-DATA-ITEM         TO WS-SUNAUD            03960016
039700             MOVE WS-SUNAUD-AUD-CNTL-NBR  TO HOLD-AUD-CNTL-NBR    03970016
039800*            DISPLAY HOLD-AUD-CNTL-NBR                            03980016
039900*            DISPLAY WS-SUNAUD                                    03990016
040000             PERFORM R100-INSERT                                  04000016
040100         WHEN DS009-PROCESS-TABLE = 'TSUATRN'                     04010016
040200             MOVE DS002-DATA-ITEM         TO WS-SUATRN            04020016
040300             MOVE WS-SUATRN-SHIPT-UNT-ID  TO HOLD-SHIPT-UNIT-ID   04030016
040400*            DISPLAY HOLD-SHIPT-UNIT-ID                           04040016
040500*            DISPLAY WS-SUATRN                                    04050016
040600             PERFORM R100-INSERT                                  04060016
040700         WHEN DS009-PROCESS-TABLE = 'TSUAUPC'                     04070016
040800             MOVE DS002-DATA-ITEM         TO WS-SUAUPC            04080016
040900             MOVE WS-SUAUPC-SHIPT-UNT-ID  TO HOLD-SHIPT-UNIT-ID   04090016
041000*            DISPLAY HOLD-SHIPT-UNIT-ID                           04100016
041100*            DISPLAY WS-SUAUPC                                    04110016
041200             PERFORM R100-INSERT                                  04120016
041300         WHEN DS009-PROCESS-TABLE = 'TSUEXCP'                     04130016
041400             MOVE DS002-DATA-ITEM         TO WS-SUEXCP            04140016
041500             MOVE WS-SUEXCP-SHIPT-UNT-ID  TO HOLD-SHIPT-UNIT-ID   04150016
041600*            DISPLAY HOLD-SHIPT-UNIT-ID                           04160016
041700*            DISPLAY WS-SUEXCP                                    04170016
041800             PERFORM R100-INSERT                                  04180016
041900         WHEN DS009-PROCESS-TABLE = 'TCTEXCP'                     04190016
042000             MOVE DS002-DATA-ITEM         TO WS-CTEXCP            04200016
042100             MOVE WS-CTEXCP-SHIPT-UNT-ID  TO HOLD-SHIPT-UNIT-ID   04210016
042200*            DISPLAY HOLD-SHIPT-UNIT-ID                           04220016
042300*            DISPLAY WS-CTEXCP                                    04230016
042400             PERFORM R100-INSERT                                  04240016
042500         WHEN DS009-PROCESS-TABLE = 'TIMTBKY'                     04250016
042600             MOVE DS002-DATA-ITEM         TO WS-IMTBKY            04260016
042700             MOVE WS-IMTBKY-NOTIF-NBR     TO HOLD-NOTIF-NBR       04270016
042800*            DISPLAY HOLD-NOTIF-NBR                               04280016
042900*            DISPLAY WS-IMTBKY                                    04290016
043000             PERFORM R100-INSERT                                  04300016
043100         WHEN DS009-PROCESS-TABLE = 'TPOPRPK'                     04310016
043200             MOVE DS002-DATA-ITEM         TO WS-POPRPK            04320016
043300             MOVE WS-POPRPK-PO-NBR        TO HOLD-PO-NBR          04330016
043400*            DISPLAY HOLD-PO-NBR                                  04340016
043500*            DISPLAY WS-POPRPK                                    04350016
043600             PERFORM R100-INSERT                                  04360016
043700         WHEN DS009-PROCESS-TABLE = 'TSULBXF'                     04370016
043800             MOVE DS002-DATA-ITEM         TO WS-SULBXF            04380016
043900             MOVE WS-SULBXF-SHIPT-UNT-ID  TO HOLD-SHIPT-UNT-ID    04390016
044000*            DISPLAY HOLD-SHIPT-UNT-ID                            04400016
044100*            DISPLAY WS-SULBXF                                    04410016
044200             PERFORM R100-INSERT                                  04420016
044300                                                                  04430016
044400         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_CART'              04440016
044500             MOVE DS002-DATA-ITEM         TO DCLSUT00024          04450016
044600             PERFORM R100-INSERT                                  04460016
044700                                                                  04470016
044800         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_VND'               04480016
044900             MOVE DS002-DATA-ITEM         TO DCLSUT00026          04490016
045000             PERFORM R100-INSERT                                  04500016
045100                                                                  04510016
045200         WHEN DS009-PROCESS-TABLE = 'TSUQADJ'                     04520016
045300             MOVE DS002-DATA-ITEM         TO DCLTSUQADJ           04530016
045400             PERFORM R100-INSERT                                  04540016
045500             IF SQLCODE NOT = ZERO                                04550016
045600             DISPLAY 'INSERT FAILED FOR TABLE = '                 04560016
045700                              DS009-PROCESS-TABLE                 04570016
045800             CALL 'DSNTIAR' USING SQLCA                           04580016
045900                              DP004-FORMATTED-MESSAGE             04590016
046000                              DP004-ERROR-LINE-LENGTH             04600016
046100             PERFORM                                              04610016
046200                 VARYING DP004-MSG-IDX                            04620016
046300                 FROM 1 BY 1                                      04630016
046400                 UNTIL DP004-MSG-IDX > 8                          04640016
046500                     DISPLAY DP004-MESSAGE-LINE (DP004-MSG-IDX)   04650016
046600             END-PERFORM                                          04660016
046700             END-IF                                               04670016
046800                                                                  04680016
046900         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_UPC'               04690016
047000             MOVE DS002-DATA-ITEM         TO DCLSUT00028          04700016
047100             PERFORM R100-INSERT                                  04710016
047200                                                                  04720016
047300         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_LOC'               04730016
047400             MOVE DS002-DATA-ITEM         TO DS008-SUT-OTBND-LOC  04740016
047500             PERFORM R100-INSERT                                  04750016
047600                                                                  04760016
047700         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_PKD_UPC'           04770016
047800             MOVE DS002-DATA-ITEM         TO DCLSUT00025          04780016
047900             PERFORM R100-INSERT                                  04790016
048000                                                                  04800016
048100         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_PK'                04810016
048200             MOVE DS002-DATA-ITEM         TO DCLSUT00041          04820016
048300             PERFORM R100-INSERT                                  04830016
048400                                                                  04840016
048500         WHEN DS009-PROCESS-TABLE = 'SUT_PO_AUD_REQ'              04850016
048600             MOVE DS002-DATA-ITEM         TO DS008-DCLSUT00015    04860016
048700             PERFORM R100-INSERT                                  04870016
048800                                                                  04880016
048900         WHEN DS009-PROCESS-TABLE = 'TSUOBTR'                     04890016
049000             MOVE DS002-DATA-ITEM         TO DCLTSUOBTR           04900016
049100             PERFORM R100-INSERT                                  04910016
049200                                                                  04920016
049300         WHEN DS009-PROCESS-TABLE = 'TSUOBTS'                     04930016
049400             MOVE DS002-DATA-ITEM         TO DCLTSUOBTS           04940016
049500             PERFORM R100-INSERT                                  04950016
049600                                                                  04960016
049700         WHEN DS009-PROCESS-TABLE = 'XLT_SKU'                     04970016
049800             MOVE DS002-DATA-ITEM         TO DCLXLT00003          04980016
049900             PERFORM R100-INSERT                                  04990016
050000                                                                  05000016
050100         WHEN DS009-PROCESS-TABLE = 'XLT_VND_STYL'                05010016
050200             MOVE DS002-DATA-ITEM         TO DCLXLT00004          05020016
050300             PERFORM R100-INSERT                                  05030016
050400                                                                  05040016
050500         WHEN DS009-PROCESS-TABLE = 'SUT_FINCL_ADJ'               05050016
050600             MOVE DS002-DATA-ITEM         TO DS008-DCLSUT00030    05060016
050700             PERFORM R100-INSERT                                  05070016
050800                                                                  05080016
050900         WHEN DS009-PROCESS-TABLE = 'XLT_UPC'                     05090016
051000             MOVE DS002-DATA-ITEM         TO DCLXLT00006          05100016
051100             PERFORM R100-INSERT                                  05110016
051200                                                                  05120016
051300         WHEN DS009-PROCESS-TABLE = 'XLT_PK'                      05130016
051400             MOVE DS002-DATA-ITEM         TO DCLXLT00007          05140016
051500             PERFORM R100-INSERT                                  05150016
051600         WHEN DS009-PROCESS-TABLE = 'XLT_PK_CPT_SKU'              05160016
051700             MOVE DS002-DATA-ITEM         TO DCLXLT00008          05170016
051800             PERFORM R100-INSERT                                  05180016
051900         WHEN DS009-PROCESS-TABLE = 'XLT_PK_UPC'                  05190016
052000             MOVE DS002-DATA-ITEM         TO DCLXLT00009          05200016
052100             PERFORM R100-INSERT                                  05210016
052200                                                                  05220016
052300         WHEN DS009-PROCESS-TABLE = 'WST_SHPMT_XREF_HDR'          05230016
052400             MOVE DS002-DATA-ITEM         TO DS008-DCLWST00001    05240016
052500             PERFORM R100-INSERT                                  05250016
052600                                                                  05260016
052700         WHEN DS009-PROCESS-TABLE = 'WST_SHPMT_XREF_DTL'          05270016
052800             MOVE DS002-DATA-ITEM         TO DCLWST00002          05280016
052900             PERFORM R100-INSERT                                  05290016
053000                                                                  05300016
053100         WHEN DS009-PROCESS-TABLE = 'RCT_PO_RCVR_TRKG'            05310016
053200             MOVE DS002-DATA-ITEM         TO DCLRCT00017          05320016
053300             PERFORM R100-INSERT                                  05330016
053500                                                                  05350016
041300         WHEN DS009-PROCESS-TABLE = 'TTRDPRT'                     05352018
041400             MOVE DS002-DATA-ITEM         TO WS-TRDPRT            05353018
041800             PERFORM R100-INSERT                                  05354018
053000                                                                  05355018
041300         WHEN DS009-PROCESS-TABLE = 'TFGTRST'                     05356018
041400             MOVE DS002-DATA-ITEM         TO WS-FGTRST            05357018
041400             IF WS-FGTRST-TRN-RLSE-TMST < SPACES                  05358018
041401                 MOVE -1 TO PV-NULL                               05359018
041401             ELSE                                                 05359118
041401                 MOVE +0 TO PV-NULL                               05359218
041401             END-IF                                               05359318
041800             PERFORM R100-INSERT                                  05359418
053000                                                                  05359518
041300         WHEN DS009-PROCESS-TABLE = 'TINTTRN'                     05359618
041400             MOVE DS002-DATA-ITEM         TO WS-INTTRN            05359718
041800             PERFORM R100-INSERT                                  05359818
053000                                                                  05359918
053400         END-EVALUATE                                             05360021
053000                                                                  05360121
053600         SET DS009-SRCH-IDX TO +1                                 05361016
053700         SEARCH DS009-CNTL-RECORDS                                05370016
053800                 VARYING DS009-SRCH-IDX                           05380016
053900             AT END                                               05390016
054000                 CONTINUE                                         05400016
054100             WHEN CNTL-TABLE (DS009-SRCH-IDX) = DS002-NAME        05410016
054200                 ADD SQLERRD(3)                                   05420016
054300                        TO DS009-READ-COUNT (DS009-SRCH-IDX)      05430016
054400         END-SEARCH                                               05440016
054500                                                                  05450016
054600*        DISPLAY 'NUMBER OF ROWS INSERTED:' SQLERRD (3)           05460016
054700*        DISPLAY 'TBL= ' DS009-PROCESS-TABLE                      05470016
054800*                ' INSERT SQLCODE: ' SQLCODE                      05480016
054900*                ' NBR OF ROWS INSERTED: ' SQLERRD (3)            05490016
055000                                                                  05500016
055100         IF DS009-UPDATE-COUNT > DS009-COMMIT-COUNT               05510016
055200            EXEC SQL                                              05520016
055300                COMMIT                                            05530016
055400            END-EXEC                                              05540016
055500            IF SQLCODE NOT = ZERO                                 05550016
055600               PERFORM DS002-SQL-ABEND-COMMIT                     05560016
055700            END-IF                                                05570016
055800            MOVE +0  TO DS009-UPDATE-COUNT                        05580016
055900*           DISPLAY 'COMMIT TAKEN AFTER RECORD: '                 05590016
056000*                                     DS009-TUPDATE-COUNT         05600016
056100         END-IF                                                   05610016
056200         ADD SQLERRD(3) TO DS009-UPDATE-COUNT                     05620016
056300         ADD SQLERRD(3) TO DS009-TUPDATE-COUNT                    05630016
056400        END-IF                                                    05640016
056500     END-IF.                                                      05650016
056600/                                                                 05660016
056700 R100-INSERT.                                                     05670016
056800     PERFORM WITH TEST AFTER                                      05680016
056900             VARYING DS009-RETRY-COUNTER FROM 1 BY 1              05690016
057000             UNTIL   DS009-RETRY-COUNTER > 3 OR                   05700016
057100                     SQLCODE = ZERO OR +100 OR -803               05710016
057200                               OR -181                            05720016
057300                               OR -310                            05730016
057400                               OR -530                            05740016
057500                                                                  05750016
057600          EVALUATE TRUE                                           05760016
057700            WHEN DS009-PROCESS-TABLE = 'TPURCHS'                  05770016
057800               EXEC SQL                                           05780016
057900                INSERT INTO TPURCHS                               05790016
058000                  (                                               05800016
058100                    PO_NBR                                        05810016
058200                   ,VER_NBR                                       05820016
058300                   ,VER_STATUS_CDE                                05830016
058400                   ,PO_TYP_CDE                                    05840016
058500                   ,PO_CATEG_CDE                                  05850016
058600                   ,EDI_IND                                       05860016
058700                   ,TOT_UNT_QTY                                   05870016
058800                   ,TOT_VAL_COST_AMT                              05880016
058900                   ,TOT_VAL_RTL_AMT                               05890016
059000                   ,TOT_MU_PCT                                    05900016
059100                   ,TOT_SKUS_QTY                                  05910016
059200                   ,IMPRT_AGNT_PO_NBR                             05920016
059300                   ,IMPRT_ORD_OFF_NAME                            05930016
059400                   ,IMPRT_VEND_NAME                               05940016
059500                   ,IMPRT_FCTRY_NAME                              05950016
059600                   ,IMPRT_CNTRY_NAME                              05960016
059700                   ,VEND_CNTRY_NAME                               05970016
059800                   ,NEW_STR_PO_IND                                05980016
059900                   ,IMPRT_PO_IND                                  05990016
060000                   ,IMPRT_AGNT_PO_IND                             06000016
060100                   ,STATUS_TMST                                   06010016
060200                   ,LAST_UPD_TMST                                 06020016
060300                   ,EDI_REXMIT_IND                                06030016
060400                   ,EDI_REXMIT_TMST                               06040016
060500                   ,DIR_STR_IND                                   06050016
060600                   ,LAST_UPD_BY_UID                               06060016
060700                   ,APP_BY_UID                                    06070016
060800                   ,OTB_PER_NBR                                   06080016
060900                   ,DEPT_NBR                                      06090016
061000                   ,ENT_ID                                        06100016
061100                   ,STATUS_CDE                                    06110016
061200                   ,CRE_BY_UID                                    06120016
061300                   ,REJ_CT                                        06130016
061400                   ,REJ_UID                                       06140016
061500                   ,ORD_DTE                                       06150016
061600                   ,REVISION_CT                                   06160016
061700                   ,ADR_SEQ_NBR                                   06170016
061800                   ,DEST_KNOWN_IND                                06180016
061900                   ,RLSE_IND                                      06190016
062000                   ,RLSE_DTE                                      06200016
062100                   ,ANLYS_HOLD_IND                                06210016
062200                   ,PLCMNT_CNTRY_CDE                              06220016
062300                   ,PROD_CNTRY_CDE                                06230016
062400                   ,UNT_PER_CBMT_QTY                              06240016
062500                   ,TKT_FMT_NBR                                   06250016
062600                   ,TKT_FMT_DESC                                  06260016
062700                   ,CRE_TMST                                      06270016
062800                   ,PRG_LAST_ACTVY_DTE                            06280016
062900                   ,PKGNG_CDE                                     06290016
063000                   ,SEASET_YR                                     06300016
063100                   ,SEASET_SHRT_NM                                06310016
063200                   ,QTA_CTG_CDE                                   06320016
063300                   ,PO_IN_RMS_IND                                 06330016
063400                   ,RMS_PO_UPD_TMST                               06340016
063500                   ,DUP_SKU_IND                                   06350016
063600                   ,ORIG_PKGNG_CDE                                06360016
063700                   ,IMPRT_VND_ID                                  06370016
063800                   ,IMPRT_FCTRY_ID                                06380016
063900                   ,DERVD_LBL_TYP_CDE                             06390016
064000                   ,DELY_ID                                       06400016
064100                   ,PO_SHRT_CYC_IND                               06410016
064200                   ,WHSE_RPLNT_IND                                06420016
064300                  )                                               06430016
064400                VALUES (                                          06440016
064500                  :WS-PURCHS-PO-NBR                               06450016
064600                 ,:WS-PURCHS-VER-NBR                              06460016
064700                 ,:WS-PURCHS-VER-STATUS-CDE                       06470016
064800                 ,:WS-PURCHS-PO-TYP-CDE                           06480016
064900                 ,:WS-PURCHS-PO-CATEG-CDE                         06490016
065000                 ,:WS-PURCHS-EDI-IND                              06500016
065100                 ,:WS-PURCHS-TOT-UNT-QTY                          06510016
065200                 ,:WS-PURCHS-TOT-VAL-COST-AMT                     06520016
065300                 ,:WS-PURCHS-TOT-VAL-RTL-AMT                      06530016
065400                 ,:WS-PURCHS-TOT-MU-PCT                           06540016
065500                 ,:WS-PURCHS-TOT-SKUS-QTY                         06550016
065600                 ,:WS-PURCHS-IMPRT-AGNT-PO-NBR                    06560016
065700                 ,:WS-PURCHS-IMPRT-ORD-OFF-NAME                   06570016
065800                 ,:WS-PURCHS-IMPRT-VEND-NAME                      06580016
065900                 ,:WS-PURCHS-IMPRT-FCTRY-NAME                     06590016
066000                 ,:WS-PURCHS-IMPRT-CNTRY-NAME                     06600016
066100                 ,:WS-PURCHS-VEND-CNTRY-NAME                      06610016
066200                 ,:WS-PURCHS-NEW-STR-PO-IND                       06620016
066300                 ,:WS-PURCHS-IMPRT-PO-IND                         06630016
066400                 ,:WS-PURCHS-IMPRT-AGNT-PO-IND                    06640016
066500                 ,:WS-PURCHS-STATUS-TMST                          06650016
066600                 ,:WS-PURCHS-LAST-UPD-TMST                        06660016
066700                 ,:WS-PURCHS-EDI-REXMIT-IND                       06670016
066800                 ,:WS-PURCHS-EDI-REXMIT-TMST                      06680016
066900                 ,:WS-PURCHS-DIR-STR-IND                          06690016
067000                 ,:WS-PURCHS-LAST-UPD-BY-UID                      06700016
067100                 ,:WS-PURCHS-APP-BY-UID                           06710016
067200                 ,:WS-PURCHS-OTB-PER-NBR                          06720016
067300                 ,:WS-PURCHS-DEPT-NBR                             06730016
067400                 ,:WS-PURCHS-ENT-ID                               06740016
067500                 ,:WS-PURCHS-STATUS-CDE                           06750016
067600                 ,:WS-PURCHS-CRE-BY-UID                           06760016
067700                 ,:WS-PURCHS-REJ-CT                               06770016
067800                 ,:WS-PURCHS-REJ-UID                              06780016
067900                 ,:WS-PURCHS-ORD-DTE                              06790016
068000                 ,:WS-PURCHS-REVISION-CT                          06800016
068100                 ,:WS-PURCHS-ADR-SEQ-NBR                          06810016
068200                 ,:WS-PURCHS-DEST-KNOWN-IND                       06820016
068300                 ,:WS-PURCHS-RLSE-IND                             06830016
068400                 ,:WS-PURCHS-RLSE-DTE                             06840016
068500                 ,:WS-PURCHS-ANLYS-HOLD-IND                       06850016
068600                 ,:WS-PURCHS-PLCMNT-CNTRY-CDE                     06860016
068700                 ,:WS-PURCHS-PROD-CNTRY-CDE                       06870016
068800                 ,:WS-PURCHS-UNT-PER-CBMT-QTY                     06880016
068900                 ,:WS-PURCHS-TKT-FMT-NBR                          06890016
069000                 ,:WS-PURCHS-TKT-FMT-DESC                         06900016
069100                 ,:WS-PURCHS-CRE-TMST                             06910016
069200                 ,:WS-PURCHS-PRG-LAST-ACTVY-DTE                   06920016
069300                 ,:WS-PURCHS-PKGNG-CDE                            06930016
069400                 ,:WS-PURCHS-SEASET-YR                            06940016
069500                 ,:WS-PURCHS-SEASET-SHRT-NM                       06950016
069600                 ,:WS-PURCHS-QTA-CTG-CDE                          06960016
069700                 , :WS-PURCHS-PO-IN-RMS-IND                       06970016
069800                 , :WS-PURCHS-RMS-PO-UPD-TMST                     06980016
069900                 , :WS-PURCHS-DUP-SKU-IND                         06990016
070000                 , :WS-PURCHS-ORIG-PKGNG-CDE                      07000016
070100                 , :WS-PURCHS-IMPRT-VND-ID                        07010016
070200                 , :WS-PURCHS-IMPRT-FCTRY-ID                      07020016
070300                 , :WS-PURCHS-DERVD-LBL-TYP-CDE                   07030016
070400                 , :WS-PURCHS-DELY-ID                             07040016
070500                   :WS-PURCHS-DELY-ID-NULL                        07050016
070600                 , :WS-PURCHS-PO-SHRT-CYC-IND                     07060016
070700                 , :WS-PURCHS-WHSE-RPLNT-IND                      07070016
070800                   )                                              07080016
070900               END-EXEC                                           07090016
071000            WHEN DS009-PROCESS-TABLE = 'TPURITM'                  07100016
071100               EXEC SQL                                           07110016
071200                INSERT INTO TPURITM                               07120016
071300                  (                                               07130016
071400                    PO_NBR                                        07140016
071500                   ,VER_NBR                                       07150016
071600                   ,PO_LNE_NBR                                    07160016
071700                   ,VER_STATUS_CDE                                07170016
071800                   ,SKU_SEQ_NBR                                   07180016
071900                   ,CL_NBR                                        07190016
072000                   ,VEND_STYL_NAME                                07200016
072100                   ,COLOR_DESC                                    07210016
072200                   ,SIZE_DESC                                     07220016
072300                   ,UM_IND                                        07230016
072400                   ,UNT_QTY                                       07240016
072500                   ,UNT_RTL_PR_AMT                                07250016
072600                   ,UNT_COST_AMT                                  07260016
072700                   ,TOT_VAL_COST_AMT                              07270016
072800                   ,TOT_VAL_RTL_AMT                               07280016
072900                   ,MU_PCT                                        07290016
073000                   ,CRE_TMST                                      07300016
073100                   ,LAST_UPD_TMST                                 07310016
073200                   ,ITM_NBR                                       07320016
073300                   ,SKU_DESC                                      07330016
073400                   ,COLOR_CDE                                     07340016
073500                   ,SIZE_CDE                                      07350016
073600                   ,AD_EVNT_DTE                                   07360016
073700                   ,STATUS_CDE                                    07370016
073800                   ,CRE_BY_UID                                    07380016
073900                   ,LAST_UPD_BY_UID                               07390016
074000                   ,GP_RTL_AMT                                    07400016
074100                   ,GP_QTY                                        07410016
074200                   ,APP_PO_LNE_NBR                                07420016
074300                   ,PIC_ITM_IND                                   07430016
074400                   ,PIC_PG_NBR                                    07440016
074500                   ,PRD_1ST_COST_AMT                              07450016
074600                   ,STAT_TMST                                     07460016
074700                   ,PO_PREPK_ID                                   07470016
074800                   ,PREPK_RATO_QTY                                07480016
074900                   ,SHIP_TO_TMP_DC_IND                            07490016
075000                   ,RMS_PO_SKU_NBR                                07500016
075100                   ,CNCLD_UNT_QTY                                 07510016
075200                   ,INNR_PK_QTY                                   07520016
075300                   ,OUTR_PK_QTY                                   07530016
075400                  )                                               07540016
075500                VALUES (                                          07550016
075600                   :WS-PURITM-PO-NBR                              07560016
075700                  ,:WS-PURITM-VER-NBR                             07570016
075800                  ,:WS-PURITM-PO-LNE-NBR                          07580016
075900                  ,:WS-PURITM-VER-STATUS-CDE                      07590016
076000                  ,:WS-PURITM-SKU-SEQ-NBR                         07600016
076100                  ,:WS-PURITM-CL-NBR                              07610016
076200                  ,:WS-PURITM-VEND-STYL-NAME                      07620016
076300                  ,:WS-PURITM-COLOR-DESC                          07630016
076400                  ,:WS-PURITM-SIZE-DESC                           07640016
076500                  ,:WS-PURITM-UM-IND                              07650016
076600                  ,:WS-PURITM-UNT-QTY                             07660016
076700                  ,:WS-PURITM-UNT-RTL-PR-AMT                      07670016
076800                  ,:WS-PURITM-UNT-COST-AMT                        07680016
076900                  ,:WS-PURITM-TOT-VAL-COST-AMT                    07690016
077000                  ,:WS-PURITM-TOT-VAL-RTL-AMT                     07700016
077100                  ,:WS-PURITM-MU-PCT                              07710016
077200                  ,:WS-PURITM-CRE-TMST                            07720016
077300                  ,:WS-PURITM-LAST-UPD-TMST                       07730016
077400                  ,:WS-PURITM-ITM-NBR                             07740016
077500                  ,:WS-PURITM-SKU-DESC                            07750016
077600                  ,:WS-PURITM-COLOR-CDE                           07760016
077700                  ,:WS-PURITM-SIZE-CDE                            07770016
077800                  ,:WS-PURITM-AD-EVNT-DTE                         07780016
077900                  ,:WS-PURITM-STATUS-CDE                          07790016
078000                  ,:WS-PURITM-CRE-BY-UID                          07800016
078100                  ,:WS-PURITM-LAST-UPD-BY-UID                     07810016
078200                  ,:WS-PURITM-GP-RTL-AMT                          07820016
078300                  ,:WS-PURITM-GP-QTY                              07830016
078400                  ,:WS-PURITM-APP-PO-LNE-NBR                      07840016
078500                  ,:WS-PURITM-PIC-ITM-IND                         07850016
078600                  ,:WS-PURITM-PIC-PG-NBR                          07860016
078700                  ,:WS-PURITM-PRD-1ST-COST-AMT                    07870016
078800                  ,:WS-PURITM-STAT-TMST                           07880016
078900                  ,:WS-02-PURITM-PO-PREPK-ID                      07890016
079000                  ,:WS-02-PURITM-PREPK-RATO-QTY                   07900016
079100                  ,:WS-PURITM-SHIP-TO-TMP-DC-IND                  07910016
079200                  ,:WS-PURITM-RMS-PO-SKU-NBR                      07920016
079300                  ,:WS-PURITM-CNCLD-UNT-QTY                       07930016
079400                  ,:WS-PURITM-INNR-PK-QTY                         07940016
079500                  ,:WS-PURITM-OUTR-PK-QTY                         07950016
079600                   )                                              07960016
079700               END-EXEC                                           07970016
079800            WHEN DS009-PROCESS-TABLE = 'TPOAGMT'                  07980016
079900               EXEC SQL                                           07990016
080000                INSERT INTO TPOAGMT                               08000016
080100                  (                                               08010016
080200                    PO_NBR                                        08020016
080300                   ,VER_NBR                                       08030016
080400                   ,AGRMT_TYP_ID                                  08040016
080500                   ,SEQ_NBR                                       08050016
080600                   ,VER_STATUS_CDE                                08060016
080700                   ,TYP_CDE                                       08070016
080800                   ,TKT_MKR_IND                                   08080016
080900                   ,BULK_STK_TKT_IND                              08090016
081000                   ,EDI_PROMO_TXT                                 08100016
081100                   ,PO_CAN_DAY_QTY                                08110016
081200                   ,AUTO_PO_CAN_IND                               08120016
081300                   ,DISC_DOL_AMT                                  08130016
081400                   ,DISC_PCT                                      08140016
081500                   ,DISC_PAY_DAY_QTY                              08150016
081600                   ,LAST_UPD_TMST                                 08160016
081700                   ,PAYT_TERM_ID                                  08170016
081800                   ,LAST_UPD_BY_UID                               08180016
081900                   ,LEADTIME_DAYS_QTY                             08190016
082000                  )                                               08200016
082100                VALUES (                                          08210016
082200                   :WS-POAGMT-PO-NBR                              08220016
082300                  ,:WS-POAGMT-VER-NBR                             08230016
082400                  ,:WS-POAGMT-AGRMT-TYP-ID                        08240016
082500                  ,:WS-POAGMT-SEQ-NBR                             08250016
082600                  ,:WS-POAGMT-VER-STATUS-CDE                      08260016
082700                  ,:WS-POAGMT-TYP-CDE                             08270016
082800                  ,:WS-POAGMT-TKT-MKR-IND                         08280016
082900                  ,:WS-POAGMT-BULK-STK-TKT-IND                    08290016
083000                  ,:WS-POAGMT-EDI-PROMO-TXT                       08300016
083100                  ,:WS-POAGMT-PO-CAN-DAY-QTY                      08310016
083200                  ,:WS-POAGMT-AUTO-PO-CAN-IND                     08320016
083300                  ,:WS-POAGMT-DISC-DOL-AMT                        08330016
083400                  ,:WS-POAGMT-DISC-PCT                            08340016
083500                  ,:WS-POAGMT-DISC-PAY-DAY-QTY                    08350016
083600                  ,:WS-POAGMT-LAST-UPD-TMST                       08360016
083700                  ,:WS-POAGMT-PAYT-TERM-ID                        08370016
083800                  ,:WS-POAGMT-LAST-UPD-BY-UID                     08380016
083900                  ,:WS-POAGMT-LEADTIME-DAYS-QTY                   08390016
084000                   )                                              08400016
084100               END-EXEC                                           08410016
084200            WHEN DS009-PROCESS-TABLE = 'TPOINST'                  08420016
084300               EXEC SQL                                           08430016
084400                INSERT INTO TPOINST                               08440016
084500                  (                                               08450016
084600                    PO_NBR                                        08460016
084700                   ,RECIP_CDE                                     08470016
084800                   ,INSTR_NBR                                     08480016
084900                   ,CRE_BY_UID                                    08490016
085000                   ,CRE_TMST                                      08500016
085100                  )                                               08510016
085200                VALUES (                                          08520016
085300                   :WS-POINST-PO-NBR                              08530016
085400                  ,:WS-POINST-RECIP-CDE                           08540016
085500                  ,:WS-POINST-INSTR-NBR                           08550016
085600                  ,:WS-POINST-CRE-BY-UID                          08560016
085700                  ,:WS-POINST-CRE-TMST                            08570016
085800                   )                                              08580016
085900               END-EXEC                                           08590016
086000            WHEN DS009-PROCESS-TABLE = 'TIMPORL'                  08600016
086100               EXEC SQL                                           08610016
086200                INSERT INTO TIMPORL                               08620016
086300                  (                                               08630016
086400                    PO_NBR                                        08640016
086500                   ,VER_NBR                                       08650016
086600                   ,VER_STATUS_CDE                                08660016
086700                   ,CONSLR_RLSE_CDE                               08670016
086800                   ,CONSLR_REQR_DTE                               08680016
086900                   ,CONSLR_ACTL_DTE                               08690016
087000                   ,CONSLR_ACTL_TM                                08700016
087100                   ,CSTM_BKR_RLSE_CDE                             08710016
087200                   ,CSTM_BKR_REQR_DTE                             08720016
087300                   ,CSTM_BKR_ACTL_DTE                             08730016
087400                   ,CSTM_BKR_ACTL_TM                              08740016
087500                   ,TKT_PRTR_RLSE_CDE                             08750016
087600                   ,TKT_PRTR_REQR_DTE                             08760016
087700                   ,TKT_PRTR_ACTL_DTE                             08770016
087800                   ,TKT_PRTR_ACTL_TM                              08780016
087900                   ,DCONSLR_RLSE_CDE                              08790016
088000                   ,DCONSLR_REQR_DTE                              08800016
088100                   ,DCONSLR_ACTL_DTE                              08810016
088200                   ,DCONSLR_ACTL_TM                               08820016
088300                   ,LAST_UPD_TMST                                 08830016
088400                   ,LAST_UPD_BY_UID                               08840016
088500                   ,DCONSLR_ENT_ID                                08850016
088600                  )                                               08860016
088700                VALUES (                                          08870016
088800                    :WS-IMPORL-PO-NBR                             08880016
088900                   ,:WS-IMPORL-VER-NBR                            08890016
089000                   ,:WS-IMPORL-VER-STATUS-CDE                     08900016
089100                   ,:WS-IMPORL-CONSLR-RLSE-CDE                    08910016
089200                   ,:WS-IMPORL-CONSLR-REQR-DTE                    08920016
089300                   ,:WS-IMPORL-CONSLR-ACTL-DTE                    08930016
089400                   ,:WS-IMPORL-CONSLR-ACTL-TM                     08940016
089500                   ,:WS-IMPORL-CSTM-BKR-RLSE-CDE                  08950016
089600                   ,:WS-IMPORL-CSTM-BKR-REQR-DTE                  08960016
089700                   ,:WS-IMPORL-CSTM-BKR-ACTL-DTE                  08970016
089800                   ,:WS-IMPORL-CSTM-BKR-ACTL-TM                   08980016
089900                   ,:WS-IMPORL-TKT-PRTR-RLSE-CDE                  08990016
090000                   ,:WS-IMPORL-TKT-PRTR-REQR-DTE                  09000016
090100                   ,:WS-IMPORL-TKT-PRTR-ACTL-DTE                  09010016
090200                   ,:WS-IMPORL-TKT-PRTR-ACTL-TM                   09020016
090300                   ,:WS-IMPORL-DCONSLR-RLSE-CDE                   09030016
090400                   ,:WS-IMPORL-DCONSLR-REQR-DTE                   09040016
090500                   ,:WS-IMPORL-DCONSLR-ACTL-DTE                   09050016
090600                   ,:WS-IMPORL-DCONSLR-ACTL-TM                    09060016
090700                   ,:WS-IMPORL-LAST-UPD-TMST                      09070016
090800                   ,:WS-IMPORL-LAST-UPD-BY-UID                    09080016
090900                   ,:WS-IMPORL-DCONSLR-ENT-ID                     09090016
091000                   )                                              09100016
091100               END-EXEC                                           09110016
091200            WHEN DS009-PROCESS-TABLE = 'TALLPLN'                  09120016
091300               EXEC SQL                                           09130016
091400                INSERT INTO TALLPLN                               09140016
091500                  (                                               09150016
091600                    PO_NBR                                        09160016
091700                   ,PO_LNE_NBR                                    09170016
091800                   ,PLAN_NBR                                      09180016
091900                   ,CURR_SPLIT_QTY                                09190016
092000                   ,DEST_NBR                                      09200016
092100                   ,STATUS_CDE                                    09210016
092200                   ,DC_SPLIT_QTY                                  09220016
092300                   ,SPLIT_REQ_ID                                  09230016
092400                   ,SPLIT_CRE_DATE                                09240016
092500                   ,SPLIT_CRE_ID                                  09250016
092600                   ,SPLIT_UPD_DATE                                09260016
092700                   ,SPLIT_UPD_ID                                  09270016
092800                   ,DISTRO_REQ_ID                                 09280016
092900                   ,DISTRO_CRE_DATE                               09290016
093000                   ,DISTRO_CRE_ID                                 09300016
093100                   ,DISTRO_KEY_SEQ_NBR                            09310016
093200                   ,SPLIT_KEY_SEQ_NBR                             09320016
093300                   ,ALOC_PACK_QTY                                 09330016
093400                   ,PK_SIZE_RND_CDE                               09340016
093500                   ,ALLOC_OUTR_PK_QTY                             09350016
093600*                  ,SHTG_PRRT_OPT_CDE                             09360016
093700*                  ,OVRG_PRRT_OPT_CDE                             09370016
093800*                  ,EXST_SHTG_THRS_IND                            09380016
093900                  )                                               09390016
094000                VALUES (                                          09400016
094100                    :WS-ALLPLN-PO-NBR                             09410016
094200                   ,:WS-ALLPLN-PO-LNE-NBR                         09420016
094300                   ,:WS-ALLPLN-PLAN-NBR                           09430016
094400                   ,:WS-ALLPLN-CURR-SPLIT-QTY                     09440016
094500                   ,:WS-ALLPLN-DEST-NBR                           09450016
094600                   ,:WS-ALLPLN-STATUS-CDE                         09460016
094700                   ,:WS-ALLPLN-DC-SPLIT-QTY                       09470016
094800                   ,:WS-ALLPLN-SPLIT-REQ-ID                       09480016
094900                   ,:WS-ALLPLN-SPLIT-CRE-DATE                     09490016
095000                   ,:WS-ALLPLN-SPLIT-CRE-ID                       09500016
095100                   ,:WS-ALLPLN-SPLIT-UPD-DATE                     09510016
095200                   ,:WS-ALLPLN-SPLIT-UPD-ID                       09520016
095300                   ,:WS-ALLPLN-DISTRO-REQ-ID                      09530016
095400                   ,:WS-ALLPLN-DISTRO-CRE-DATE                    09540016
095500                   ,:WS-ALLPLN-DISTRO-CRE-ID                      09550016
095600                   ,:WS-ALLPLN-DISTRO-KEY-SEQ-NBR                 09560016
095700                   ,:WS-ALLPLN-SPLIT-KEY-SEQ-NBR                  09570016
095800                   ,:WS-ALLPLN-ALOC-PACK-QTY                      09580016
095900                   ,:WS-ALLPLN-PK-SIZE-RND-CDE                    09590016
096000                   ,:WS-ALLPLN-ALLOC-OUTR-PK-QTY                  09600016
096100*                  ,:WS-ALLPLN-SHTG-PRRT-OPT-CDE                  09610016
096200*                  ,:WS-ALLPLN-OVRG-PRRT-OPT-CDE                  09620016
096300*                  ,:WS-ALLPLN-EXST-SHTG-THRS-IND                 09630016
096400                   )                                              09640016
096500               END-EXEC                                           09650016
096600            WHEN DS009-PROCESS-TABLE = 'TPLNSHP'                  09660016
096700               EXEC SQL                                           09670016
096800                INSERT INTO TPLNSHP                               09680016
096900                  (                                               09690016
097000                    SHIPT_NBR                                     09700016
097100                   ,VER_NBR                                       09710016
097200                   ,VER_STATUS_CDE                                09720016
097300                   ,SHIPT_TYP_CDE                                 09730016
097400                   ,SHIPT_DEST_NBR                                09740016
097500                   ,SHIPT_POINT_TXT                               09750016
097600                   ,FOB_POINT_TXT                                 09760016
097700                   ,FRGT_PAYT_CDE                                 09770016
097800                   ,VEND_FRGT_PCT                                 09780016
097900                   ,KOHLS_FRGT_PCT                                09790016
098000                   ,LATE_SHIPT_IND                                09800016
098100                   ,EARLY_SHIPT_IND                               09810016
098200                   ,PARTIAL_SHIPT_IND                             09820016
098300                   ,BCKORDS_PERMTD_IND                            09830016
098400                   ,PORT_ENTR_DESC                                09840016
098500                   ,STRT_FCTRY_DTE                                09850016
098600                   ,LAST_FCTRY_DTE                                09860016
098700                   ,DONT_SHIP_BEF_DTE                             09870016
098800                   ,CAN_IFNOT_SHIP_DTE                            09880016
098900                   ,EXT_CAN_DTE                                   09890016
099000                   ,LAST_UPD_TMST                                 09900016
099100                   ,STATUS_CDE                                    09910016
099200                   ,ENT_ID                                        09920016
099300                   ,PO_NBR                                        09930016
099400                   ,LAST_UPD_BY_UID                               09940016
099500                   ,FOB_CDE                                       09950016
099600                   ,POE_CDE                                       09960016
099700                  )                                               09970016
099800                VALUES (                                          09980016
099900                    :WS-PLNSHP-SHIPT-NBR                          09990016
100000                   ,:WS-PLNSHP-VER-NBR                            10000016
100100                   ,:WS-PLNSHP-VER-STATUS-CDE                     10010016
100200                   ,:WS-PLNSHP-SHIPT-TYP-CDE                      10020016
100300                   ,:WS-PLNSHP-SHIPT-DEST-NBR                     10030016
100400                   ,:WS-PLNSHP-SHIPT-POINT-TXT                    10040016
100500                   ,:WS-PLNSHP-FOB-POINT-TXT                      10050016
100600                   ,:WS-PLNSHP-FRGT-PAYT-CDE                      10060016
100700                   ,:WS-PLNSHP-VEND-FRGT-PCT                      10070016
100800                   ,:WS-PLNSHP-KOHLS-FRGT-PCT                     10080016
100900                   ,:WS-PLNSHP-LATE-SHIPT-IND                     10090016
101000                   ,:WS-PLNSHP-EARLY-SHIPT-IND                    10100016
101100                   ,:WS-PLNSHP-PARTIAL-SHIPT-IND                  10110016
101200                   ,:WS-PLNSHP-BCKORDS-PERMTD-IND                 10120016
101300                   ,:WS-PLNSHP-PORT-ENTR-DESC                     10130016
101400                   ,:WS-PLNSHP-STRT-FCTRY-DTE                     10140016
101500                   ,:WS-PLNSHP-LAST-FCTRY-DTE                     10150016
101600                   ,:WS-PLNSHP-DONT-SHIP-BEF-DTE                  10160016
101700                   ,:WS-PLNSHP-CAN-IFNOT-SHIP-DTE                 10170016
101800                   ,:WS-PLNSHP-EXT-CAN-DTE                        10180016
101900                   ,:WS-PLNSHP-LAST-UPD-TMST                      10190016
102000                   ,:WS-PLNSHP-STATUS-CDE                         10200016
102100                   ,:WS-PLNSHP-ENT-ID                             10210016
102200                   ,:WS-PLNSHP-PO-NBR                             10220016
102300                   ,:WS-PLNSHP-LAST-UPD-BY-UID                    10230016
102400                   ,:WS-PLNSHP-FOB-CDE                            10240016
102500                   ,:WS-PLNSHP-POE-CDE                            10250016
102600                   )                                              10260016
102700               END-EXEC                                           10270016
102800*           WHEN DS009-PROCESS-TABLE = 'TSK'                      10280016
102900*              EXEC SQL                                           10290016
103000*               INSERT INTO TSK                                   10300016
103100*                 (                                               10310016
103200*              MERCH_DEPT_NMBR                                    10320016
103300*             ,MERCH_CLASS_NMBR                                   10330016
103400*             ,SEQ_NMBR                                           10340016
103500*             ,CUM_SALES_UNIT_QTY                                 10350016
103600*             ,RTL_UNIT_RCVD_QTY                                  10360016
103700*             ,COST_UNIT_MSRMNT                                   10370016
103800*             ,RTL_UNIT_MSRMNT                                    10380016
103900*             ,UNIT_COST_AMT                                      10390016
104000*             ,CUR_UNIT_RTL_AMT                                   10400016
104100*             ,ORIG_UNIT_RTL_AMT                                  10410016
104200*             ,VNDR_INNR_PACK_QTY                                 10420016
104300*             ,SHPMT_COUNT_QTY                                    10430016
104400*             ,VENDOR_STYLE_CODE                                  10440016
104500*             ,STAT_CHNGD_DATE                                    10450016
104600*             ,STATUS_CODE                                        10460016
104700*             ,AUTO_RORD_MTH_CODE                                 10470016
104800*             ,RTL_CST_CVRSN_FCTR                                 10480016
104900*             ,SETUP_DATE                                         10490016
105000*             ,PRICE_CHNG_DATE                                    10500016
105100*             ,GROUP_CODE                                         10510016
105200*             ,SKU_DESC                                           10520016
105300*             ,SIZE_DESC                                          10530016
105400*             ,COLOR_DESC                                         10540016
105500*             ,REORDER_FRMT_CODE                                  10550016
105600*             ,MERCH_DIV_CODE                                     10560016
105700*             ,DMM_NMBR                                           10570016
105800*             ,BUYER_NMBR                                         10580016
105900*             ,VENDOR_NMBR                                        10590016
106000*             ,VNDR_IN_HSE_NMBR                                   10600016
106100*             ,MKDN_PGM_CODE                                      10610016
106200*             ,LOWST_UNIT_RTL_AMT                                 10620016
106300*             ,LOW_RTL_PRICE_DATE                                 10630016
106400*             ,ITEM_NMBR                                          10640016
106500*             ,GP_RTL_AMT                                         10650016
106600*             ,ORIG_GP_QTY                                        10660016
106700*             ,ORIG_GP_RTL_AMT                                    10670016
106800*             ,FS_RPT_IND                                         10680016
106900*             ,GP_QTY                                             10690016
107000*             ,MULT_PR_PT_IND                                     10700016
107100*             ,PLU_DWNLD_EXCL_IND                                 10710016
107200*             ,LAST_PO_REV_DTE                                    10720016
107300*             ,PO_REV_DAY_NBR                                     10730016
107400*             ,PO_REV_SUN_WK_NBR                                  10740016
107500*             ,PO_REV_MON_WK_NBR                                  10750016
107600*             ,PO_REV_TUE_WK_NBR                                  10760016
107700*             ,PO_REV_WED_WK_NBR                                  10770016
107800*             ,PO_REV_THU_WK_NBR                                  10780016
107900*             ,PO_REV_FRI_WK_NBR                                  10790016
108000*             ,PO_REV_SAT_WK_NBR                                  10800016
108100*             ,CENT_STK_CDE                                       10810016
108200*             ,MEITGP_NBR                                         10820016
108300*             ,SKU_TYP_CDE                                        10830016
108400*             ,VEND_OUTR_PACK_QTY                                 10840016
108500*             ,LONG_VENDOR_STYLE                                  10850016
108600*             ,SIZE_CDE                                           10860016
108700*             ,LONG_SIZE_DESC                                     10870016
108800*             ,COLOR_CDE                                          10880016
108900*             ,LONG_COLOR_DESC                                    10890016
109000*             ,STICKER_NBR                                        10900016
109100*             ,ENT_ID                                             10910016
109200*             ,TKT_FMT_ID                                         10920016
109300*             ,KY_ITM_IND                                         10930016
109400*             ,VS_CHARTC_CDE                                      10940016
109500*             ,VS_CHARTC_SEQ_NBR                                  10950016
109600*             ,UNT_COST_1ST_AMT                                   10960016
109700*             ,REGN_PRIC_IND                                      10970016
109800*                 )                                               10980016
109900*               VALUES (                                          10990016
110000*                   :WS-TSK-MERCH-DEPT-NMBR                       11000016
110100*                  ,:WS-TSK-MERCH-CLASS-NMBR                      11010016
110200*                  ,:WS-TSK-SEQ-NMBR                              11020016
110300*                  ,:WS-TSK-CUM-SALES-UNIT-QTY                    11030016
110400*                  ,:WS-TSK-RTL-UNIT-RCVD-QTY                     11040016
110500*                  ,:WS-TSK-COST-UNIT-MSRMNT                      11050016
110600*                  ,:WS-TSK-RTL-UNIT-MSRMNT                       11060016
110700*                  ,:WS-TSK-UNIT-COST-AMT                         11070016
110800*                  ,:WS-TSK-CUR-UNIT-RTL-AMT                      11080016
110900*                  ,:WS-TSK-ORIG-UNIT-RTL-AMT                     11090016
111000*                  ,:WS-TSK-VNDR-INNR-PACK-QTY                    11100016
111100*                  ,:WS-TSK-SHPMT-COUNT-QTY                       11110016
111200*                  ,:WS-TSK-VENDOR-STYLE-CODE                     11120016
111300*                  ,:WS-TSK-STAT-CHNGD-DATE                       11130016
111400*                  ,:WS-TSK-STATUS-CODE                           11140016
111500*                  ,:WS-TSK-AUTO-RORD-MTH-CODE                    11150016
111600*                  ,:WS-TSK-RTL-CST-CVRSN-FCTR                    11160016
111700*                  ,:WS-TSK-SETUP-DATE                            11170016
111800*                  ,:WS-TSK-PRICE-CHNG-DATE                       11180016
111900*                  ,:WS-TSK-GROUP-CODE                            11190016
112000*                  ,:WS-TSK-SKU-DESC                              11200016
112100*                  ,:WS-TSK-SIZE-DESC                             11210016
112200*                  ,:WS-TSK-COLOR-DESC                            11220016
112300*                  ,:WS-TSK-REORDER-FRMT-CODE                     11230016
112400*                  ,:WS-TSK-MERCH-DIV-CODE                        11240016
112500*                  ,:WS-TSK-DMM-NMBR                              11250016
112600*                  ,:WS-TSK-BUYER-NMBR                            11260016
112700*                  ,:WS-TSK-VENDOR-NMBR                           11270016
112800*                  ,:WS-TSK-VNDR-IN-HSE-NMBR                      11280016
112900*                  ,:WS-TSK-MKDN-PGM-CODE                         11290016
113000*                  ,:WS-TSK-LOWST-UNIT-RTL-AMT                    11300016
113100*                  ,:WS-TSK-LOW-RTL-PRICE-DATE                    11310016
113200*                  ,:WS-TSK-ITEM-NMBR                             11320016
113300*                  ,:WS-TSK-GP-RTL-AMT                            11330016
113400*                  ,:WS-TSK-ORIG-GP-QTY                           11340016
113500*                  ,:WS-TSK-ORIG-GP-RTL-AMT                       11350016
113600*                  ,:WS-TSK-FS-RPT-IND                            11360016
113700*                  ,:WS-TSK-GP-QTY                                11370016
113800*                  ,:WS-TSK-MULT-PR-PT-IND                        11380016
113900*                  ,:WS-TSK-PLU-DWNLD-EXCL-IND                    11390016
114000*                  ,:WS-TSK-LAST-PO-REV-DTE                       11400016
114100*                  ,:WS-TSK-PO-REV-DAY-NBR                        11410016
114200*                  ,:WS-TSK-PO-REV-SUN-WK-NBR                     11420016
114300*                  ,:WS-TSK-PO-REV-MON-WK-NBR                     11430016
114400*                  ,:WS-TSK-PO-REV-TUE-WK-NBR                     11440016
114500*                  ,:WS-TSK-PO-REV-WED-WK-NBR                     11450016
114600*                  ,:WS-TSK-PO-REV-THU-WK-NBR                     11460016
114700*                  ,:WS-TSK-PO-REV-FRI-WK-NBR                     11470016
114800*                  ,:WS-TSK-PO-REV-SAT-WK-NBR                     11480016
114900*                  ,:WS-TSK-CENT-STK-CDE                          11490016
115000*                  ,:WS-TSK-MEITGP-NBR                            11500016
115100*                  ,:WS-TSK-SKU-TYP-CDE                           11510016
115200*                  ,:WS-TSK-VEND-OUTR-PACK-QTY                    11520016
115300*                  ,:WS-TSK-LONG-VENDOR-STYLE                     11530016
115400*                  ,:WS-TSK-SIZE-CDE                              11540016
115500*                  ,:WS-TSK-LONG-SIZE-DESC                        11550016
115600*                  ,:WS-TSK-COLOR-CDE                             11560016
115700*                  ,:WS-TSK-LONG-COLOR-DESC                       11570016
115800*                  ,:WS-TSK-STICKER-NBR                           11580016
115900*                  ,:WS-TSK-ENT-ID                                11590016
116000*                  ,:WS-TSK-TKT-FMT-ID                            11600016
116100*                  ,:WS-TSK-KY-ITM-IND                            11610016
116200**                 ,:WS-TSK-VS-CHARTC-CDE                         11620016
116300*                  ,:WS-TSK-VS-CHARTC-SEQ-NBR                     11630016
116400*                  ,:WS-TSK-UNT-COST-1ST-AMT                      11640016
116500*                  ,:WS-TSK-REGN-PRIC-IND                         11650016
116600*                 )                                               11660016
116700*              END-EXEC                                           11670016
116800*           WHEN DS009-PROCESS-TABLE = 'TUPC'                     11680016
116900*              EXEC SQL                                           11690016
117000*               INSERT INTO TUPC                                  11700016
117100*                 (                                               11710016
117200*                   UPC_ID                                        11720016
117300*                  ,UPC_NBR                                       11730016
117400*                  ,SUB_CL_MDSEAR_ID                              11740016
117500*                  ,VS_ID                                         11750016
117600*                  ,INTR_UPC_ID                                   11760016
117700*                  ,EFF_BEG_DTE                                   11770016
117800*                  ,EFF_END_DTE                                   11780016
117900*                  ,UPC_TYP_CDE                                   11790016
118000*                  ,KOHLS_SIZE_CDE                                11800016
118100*                  ,NRF_SIZE_IND                                  11810016
118200*                  ,NRF_CLOR_CDE                                  11820016
118300*                  ,NRF_CLOR_IND                                  11830016
118400*                  ,CSTM_CLOR_DESC                                11840016
118500*                  ,EDI_ORD_IND                                   11850016
118600*                  ,PREPK_IND                                     11860016
118700*                  ,GP_CDE                                        11870016
118800*                  ,CERTD_IND                                     11880016
118900*                  ,CERTD_DTE                                     11890016
119000*                  ,RPLNMT_IND                                    11900016
119100*                  ,KY_ITM_IND                                    11910016
119200*                  ,UNT_COST_1ST_AMT                              11920016
119300*                  ,UPC_SRC_CDE                                   11930016
119400*                  ,INNR_PK_QTY                                   11940016
119500*                  ,OUTR_PK_QTY                                   11950016
119600*                  ,SEA_SEQ_NBR                                   11960016
119700****               ,MDSE_TYP_SEQ_NBR                              11970016
119800****               ,PATRN_SEQ_NBR                                 11980016
119900****               ,TRND_SEQ_NBR                                  11990016
120000****               ,FBRCN_SEQ_NBR                                 12000016
120100****               ,FNSH_SEQ_NBR                                  12010016
120200*                  ,CRE_BY_USR_ID                                 12020016
120300*                  ,LAST_UPD_BY_USR_ID                            12030016
120400*                  ,LAST_UPD_TMST                                 12040016
120500*                  ,WD_UM_QTY                                     12050016
120600*                  ,DPTH_UM_QTY                                   12060016
120700*                  ,HT_UM_QTY                                     12070016
120800*                  ,SIZE_UM_CDE                                   12080016
120900*                  ,WT_UM_QTY                                     12090016
121000*                  ,WT_UM_CDE                                     12100016
121100*                  ,POG_IND                                       12110016
121200*                  ,REGN_PRIC_IND                                 12120016
121300*                  ,TX_PRD_CDE_SEQ_NBR                            12130016
121400*                  ,CUSTFACG_CLOR_DESC                            12140016
121500*                  ,INTR_UPC_DESC                                 12150016
121600*                 )                                               12160016
121700*               VALUES (                                          12170016
121800*                   :WS-UPC-UPC-ID                                12180016
121900*                  ,:WS-UPC-UPC-NBR                               12190016
122000*                  ,:WS-UPC-SUB-CL-MDSEAR-ID                      12200016
122100*                  ,:WS-UPC-VS-ID                                 12210016
122200*                  ,:WS-UPC-INTR-UPC-ID                           12220016
122300*                  ,:WS-UPC-EFF-BEG-DTE                           12230016
122400*                  ,:WS-UPC-EFF-END-DTE:WS-UPC-EFF-END-DTE-NN     12240016
122500*                  ,:WS-UPC-UPC-TYP-CDE                           12250016
122600*                  ,:WS-UPC-KOHLS-SIZE-CDE                        12260016
122700*                  ,:WS-UPC-NRF-SIZE-IND                          12270016
122800*                  ,:WS-UPC-NRF-CLOR-CDE                          12280016
122900*                  ,:WS-UPC-NRF-CLOR-IND                          12290016
123000*                  ,:WS-UPC-CSTM-CLOR-DESC                        12300016
123100*                  ,:WS-UPC-EDI-ORD-IND                           12310016
123200*                  ,:WS-UPC-PREPK-IND                             12320016
123300*                  ,:WS-UPC-GP-CDE                                12330016
123400*                  ,:WS-UPC-CERTD-IND                             12340016
123500*                  ,:WS-UPC-CERTD-DTE                             12350016
123600*                  ,:WS-UPC-RPLNMT-IND                            12360016
123700*                  ,:WS-UPC-KY-ITM-IND                            12370016
123800*                  ,:WS-UPC-UNT-COST-1ST-AMT                      12380016
123900*                  ,:WS-UPC-UPC-SRC-CDE                           12390016
124000*                  ,:WS-UPC-INNR-PK-QTY                           12400016
124100*                  ,:WS-UPC-OUTR-PK-QTY                           12410016
124200*                  ,:WS-UPC-SEA-SEQ-NBR                           12420016
124300*****              ,:WS-UPC-MDSE-TYP-SEQ-NBR                      12430016
124400*****              ,:WS-UPC-PATRN-SEQ-NBR                         12440016
124500*****              ,:WS-UPC-TRND-SEQ-NBR                          12450016
124600*****              ,:WS-UPC-FBRCN-SEQ-NBR                         12460016
124700*****              ,:WS-UPC-FNSH-SEQ-NBR                          12470016
124800*****              ,:WS-UPC-CRE-BY-USR-ID                         12480016
124900*                  ,'DSKUT404'                                    12490016
125000*                  ,:WS-UPC-LAST-UPD-BY-USR-ID                    12500016
125100*                  ,:WS-UPC-LAST-UPD-TMST                         12510016
125200*                  ,:WS-UPC-WD-UM-QTY                             12520016
125300*                  ,:WS-UPC-DPTH-UM-QTY                           12530016
125400*                  ,:WS-UPC-HT-UM-QTY                             12540016
125500*                  ,:WS-UPC-SIZE-UM-CDE                           12550016
125600*                  ,:WS-UPC-WT-UM-QTY                             12560016
125700*                  ,:WS-UPC-WT-UM-CDE                             12570016
125800*                  ,:WS-UPC-POG-IND                               12580016
125900*                  ,:WS-UPC-REGN-PRIC-IND                         12590016
126000*                  ,:WS-UPC-TX-PRD-CDE-SEQ-NBR                    12600016
126100*                  ,:WS-UPC-CUSTFACG-CLOR-DESC                    12610016
126200*                  ,:WS-UPC-INTR-UPC-DESC                         12620016
126300*                  )                                              12630016
126400*              END-EXEC                                           12640016
126500*           WHEN DS009-PROCESS-TABLE = 'TUPCSKU'                  12650016
126600*              EXEC SQL                                           12660016
126700*               INSERT INTO TUPCSKU                               12670016
126800*                 (                                               12680016
126900*                   UPC_NBR                                       12690016
127000*                  ,ITEM_NBR                                      12700016
127100*                  ,EDI_ORD_IND                                   12710016
127200*                  ,PLU_DWNLD_IND                                 12720016
127300*                  ,XREF_CRE_DTE                                  12730016
127400*                  ,UPC_DESC                                      12740016
127500*                  ,CERT_IND                                      12750016
127600*                  ,CERT_DTE                                      12760016
127700*                  ,UPC_SRC_IND                                   12770016
127800*                  ,UMDCLN_IND                                    12780016
127900*                 )                                               12790016
128000*               VALUES (                                          12800016
128100*                   :WS-TUPCSKU-UPC-NBR                           12810016
128200*                  ,:WS-TUPCSKU-ITEM-NBR                          12820016
128300*                  ,:WS-TUPCSKU-EDI-ORD-IND                       12830016
128400*                  ,:WS-TUPCSKU-PLU-DWNLD-IND                     12840016
128500*                  ,:WS-TUPCSKU-XREF-CRE-DTE                      12850016
128600*                  ,:WS-TUPCSKU-UPC-DESC                          12860016
128700*                  ,:WS-TUPCSKU-CERT-IND                          12870016
128800*                  ,:WS-TUPCSKU-CERT-DTE                          12880016
128900*                  ,:WS-TUPCSKU-UPC-SRC-IND                       12890016
129000*                  ,:WS-TUPCSKU-UMDCLN-IND                        12900016
129100*                 )                                               12910016
129200*              END-EXEC                                           12920016
129300*MAM                                                              12930016
129400*           WHEN DS009-PROCESS-TABLE = 'TUPCPLS'                  12940016
129500*              EXEC SQL                                           12950016
129600*               INSERT INTO TUPCPLS                               12960016
129700*                 (                                               12970016
129800*                   UPC_ID                                        12980016
129900*                  ,OPERCO_NBR                                    12990016
130000*                  ,STR_NBR                                       13000016
130100*                  ,EFF_BEG_TMST                                  13010016
130200*                  ,EFF_END_TMST                                  13020016
130300*                  ,UPC_STAT_CDE                                  13030016
130400*                  ,UNT_COST_AMT                                  13040016
130500*                  ,UNT_RTL_AMT                                   13050016
130600*                  ,MEITGP_NBR                                    13060016
130700*                  ,CRE_BY_USR_ID                                 13070016
130800*                  ,CRE_TMST                                      13080016
130900*                  ,ITM_NBR                                       13090016
131000*                  ,PLU_IND                                       13100016
131100*                  ,UPC_STAT_CHG_DTE                              13110016
131200*                  ,UNT_RTL_CHG_DTE                               13120016
131300*                 )                                               13130016
131400*               VALUES (                                          13140016
131500*                   :WS-UPCPLS-UPC-ID                             13150016
131600*                  ,:WS-UPCPLS-OPERCO-NBR                         13160016
131700*                  ,:WS-UPCPLS-STR-NBR                            13170016
131800*      ,:WS-UPCPLS-EFF-BEG-TMST:WS-UPCPLS-EFF-BEG-TMST-NN         13180016
131900*      ,:WS-UPCPLS-EFF-END-TMST:WS-UPCPLS-EFF-END-TMST-NN         13190016
132000*                  ,:WS-UPCPLS-UPC-STAT-CDE                       13200016
132100*                  ,:WS-UPCPLS-UNT-COST-AMT                       13210016
132200*                  ,:WS-UPCPLS-UNT-RTL-AMT                        13220016
132300*                  ,:WS-UPCPLS-MEITGP-NBR                         13230016
132400*                  ,:WS-UPCPLS-CRE-BY-USR-ID                      13240016
132500*                  ,:WS-UPCPLS-CRE-TMST                           13250016
132600*                  ,:WS-UPCPLS-ITM-NBR                            13260016
132700*                  ,:WS-UPCPLS-PLU-IND                            13270016
132800*      ,:WS-UPCPLS-UPC-STAT-CHG-DTE:WS-UPCPLS-UPC-STAT-CHG-DTE-NN 13280016
132900*      ,:WS-UPCPLS-UNT-RTL-CHG-DTE:WS-UPCPLS-UNT-RTL-CHG-DTE-NN   13290016
133000*                 )                                               13300016
133100*              END-EXEC                                           13310016
133200*           WHEN DS009-PROCESS-TABLE = 'TMDSEAR'                  13320016
133300*              EXEC SQL                                           13330016
133400*               INSERT INTO TMDSEAR                               13340016
133500*                 (                                               13350016
133600*                   OPERCO_NBR                                    13360016
133700*                  ,GMA_NBR                                       13370016
133800*                  ,DMA_NBR                                       13380016
133900*                  ,DEPT_NBR                                      13390016
134000*                  ,MAJ_CL_NBR                                    13400016
134100*                  ,SUB_CL_NBR                                    13410016
134200*                  ,MDSELV_CDE                                    13420016
134300*                  ,MDSEAR_DKEY                                   13430016
134400*                  ,CHG_DTE                                       13440016
134500*                  ,CRE_DTE                                       13450016
134600*                  ,STRT_DTE                                      13460016
134700*                  ,END_DTE                                       13470016
134800*                  ,GEN_MDSE_TYP_CDE                              13480016
134900*                  ,MDSEAR_DESC                                   13490016
135000*                  ,BYR_NBR                                       13500016
135100*                  ,LIST_SEQ_NBR                                  13510016
135200*                  ,PHY_INV_OH_VAR_PCT                            13520016
135300*                  ,PHY_INV_OH_VAR_QTY                            13530016
135400*                 )                                               13540016
135500*               VALUES (                                          13550016
135600*                   :WS-MDSEAR-OPERCO-NBR                         13560016
135700*                  ,:WS-MDSEAR-GMA-NBR                            13570016
135800*                  ,:WS-MDSEAR-DMA-NBR                            13580016
135900*                  ,:WS-MDSEAR-DEPT-NBR                           13590016
136000*                  ,:WS-MDSEAR-MAJ-CL-NBR                         13600016
136100*                  ,:WS-MDSEAR-SUB-CL-NBR                         13610016
136200*                  ,:WS-MDSEAR-MDSELV-CDE                         13620016
136300*                  ,:WS-MDSEAR-MDSEAR-DKEY                        13630016
136400*                  ,:WS-MDSEAR-CHG-DTE                            13640016
136500*                  ,:WS-MDSEAR-CRE-DTE                            13650016
136600*                  ,:WS-MDSEAR-STRT-DTE                           13660016
136700*                  ,:WS-MDSEAR-END-DTE                            13670016
136800*                  ,:WS-MDSEAR-GEN-MDSE-TYP-CDE                   13680016
136900*                  ,:WS-MDSEAR-DESC                               13690016
137000*                  ,:WS-MDSEAR-BYR-NBR                            13700016
137100*                  ,:WS-MDSEAR-LIST-SEQ-NBR                       13710016
137200*                  ,:WS-MDSEAR-PHY-INV-OH-VAR-PCT                 13720016
137300*                     :WS-MDSEAR-PHY-INV-OH-VAR-PCT-N             13730016
137400*                  ,:WS-MDSEAR-PHY-INV-OH-VAR-QTY                 13740016
137500*                     :WS-MDSEAR-PHY-INV-OH-VAR-QTY-N             13750016
137600*                 )                                               13760016
137700*              END-EXEC                                           13770016
137800*           WHEN DS009-PROCESS-TABLE = 'TMDARVS'                  13780016
137900*              EXEC SQL                                           13790016
138000*               INSERT INTO TMDARVS                               13800016
138100*                 (                                               13810016
138200*                   SUB_CL_MDSEAR_ID                              13820016
138300*                  ,VS_ID                                         13830016
138400*                  ,ACTV_IND                                      13840016
138500*                  ,VS_DESC                                       13850016
138600*                  ,STKR_NBR                                      13860016
138700*                  ,TKT_TYP_SEQ_NBR                               13870016
138800*                  ,LBL_SEQ_NBR                                   13880016
138900*                  ,HNG_FOLD_SEQ_NBR                              13890016
139000*                  ,SLHTT_SEQ_NBR                                 13900016
139100*                  ,TRND_SEQ_NBR                                  13910016
139200*                  ,FBRCN_SEQ_NBR                                 13920016
139300*                  ,FNSH_SEQ_NBR                                  13930016
139400*                  ,RMS_STYL_ID                                   13940016
139500*                 )                                               13950016
139600*               VALUES (                                          13960016
139700*                   :WS-MDARVS-SUB-CL-MDSEAR-ID                   13970016
139800*                  ,:WS-MDARVS-VS-ID                              13980016
139900*                  ,:WS-MDARVS-ACTV-IND                           13990016
140000*                  ,:WS-MDARVS-VS-DESC                            14000016
140100*                  ,:WS-MDARVS-STKR-NBR                           14010016
140200*                  ,:WS-MDARVS-TKT-TYP-SEQ-NBR                    14020016
140300*                  ,:WS-MDARVS-LBL-SEQ-NBR                        14030016
140400*                  ,:WS-MDARVS-HNG-FOLD-SEQ-NBR                   14040016
140500*                  ,:WS-MDARVS-SLHTT-SEQ-NBR                      14050016
140600*                  ,:WS-MDARVS-TRND-SEQ-NBR                       14060016
140700*                  ,:WS-MDARVS-FBRCN-SEQ-NBR                      14070016
140800*                  ,:WS-MDARVS-FNSH-SEQ-NBR                       14080016
140900*                  ,:WS-MDARVS-RMS-STYL-ID                        14090016
141000*                 )                                               14100016
141100*              END-EXEC                                           14110016
141200*           WHEN DS009-PROCESS-TABLE = 'TSKXREF'                  14120016
141300*              EXEC SQL                                           14130016
141400*               INSERT INTO TSKXREF                               14140016
141500*                 (                                               14150016
141600*                   DEPT_NBR                                      14160016
141700*                  ,CL_NBR                                        14170016
141800*                  ,SKU_SEQ_NBR                                   14180016
141900*                  ,SKU_STAT_CDE                                  14190016
142000*                  ,ITM_NBR                                       14200016
142100*                  ,INTR_UPC_ID                                   14210016
142200*                  ,DEPT                                          14220016
142300*                  ,CLASS                                         14230016
142400*                  ,SUBCLASS                                      14240016
142500*                  ,SKU                                           14250016
142600*                 )                                               14260016
142700*               VALUES (                                          14270016
142800*                   :WS-SKXREF-DEPT-NBR                           14280016
142900*                  ,:WS-SKXREF-CL-NBR                             14290016
143000*                  ,:WS-SKXREF-SKU-SEQ-NBR                        14300016
143100*                  ,:WS-SKXREF-SKU-STAT-CDE                       14310016
143200*                  ,:WS-SKXREF-ITM-NBR                            14320016
143300*                  ,:WS-SKXREF-INTR-UPC-ID                        14330016
143400*                  ,:WS-SKXREF-DEPT                               14340016
143500*                  ,:WS-SKXREF-CLASS                              14350016
143600*                  ,:WS-SKXREF-SUBCLASS                           14360016
143700*                  ,:WS-SKXREF-SKU                                14370016
143800*                 )                                               14380016
143900*              END-EXEC                                           14390016
144000*           WHEN DS009-PROCESS-TABLE = 'TVNDSTL'                  14400016
144100*              EXEC SQL                                           14410016
144200*               INSERT INTO TVNDSTL                               14420016
144300*                 (                                               14430016
144400*                   VS_ID                                         14440016
144500*                  ,ENT_ID                                        14450016
144600*                  ,VS_NBR                                        14460016
144700*                  ,EFF_BEG_DTE                                   14470016
144800*                  ,EFF_END_DTE                                   14480016
144900*                  ,COST_UM_CDE                                   14490016
145000*                  ,RTL_UM_CDE                                    14500016
145100*                  ,MLT_PRIC_PT_IND                               14510016
145200*                  ,BYP_CAT_IND                                   14520016
145300*                  ,SLHTT_SEQ_NBR                                 14530016
145400*                  ,CRE_BY_USR_ID                                 14540016
145500*                  ,LAST_UPD_BY_USR_ID                            14550016
145600*                  ,LAST_UPD_TMST                                 14560016
145700*                 )                                               14570016
145800*               VALUES (                                          14580016
145900*               :WS-VNDSTL-VS-ID                                  14590016
146000*              ,:WS-VNDSTL-ENT-ID                                 14600016
146100*              ,:WS-VNDSTL-VS-NBR                                 14610016
146200*              ,:WS-VNDSTL-EFF-BEG-DTE                            14620016
146300*               :WS-VNDSTL-EFF-BEG-DTE-NN                         14630016
146400*              ,:WS-VNDSTL-EFF-END-DTE                            14640016
146500*               :WS-VNDSTL-EFF-END-DTE-NN                         14650016
146600*              ,:WS-VNDSTL-COST-UM-CDE                            14660016
146700*              ,:WS-VNDSTL-RTL-UM-CDE                             14670016
146800*              ,:WS-VNDSTL-MLT-PRIC-PT-IND                        14680016
146900*              ,:WS-VNDSTL-BYP-CAT-IND                            14690016
147000*              ,:WS-VNDSTL-SLHTT-SEQ-NBR                          14700016
147100*              ,:WS-VNDSTL-CRE-BY-USR-ID                          14710016
147200*              ,:WS-VNDSTL-LAST-UPD-BY-USR-ID                     14720016
147300*              ,:WS-VNDSTL-LAST-UPD-TMST                          14730016
147400*                  )                                              14740016
147500*              END-EXEC                                           14750016
147600            WHEN DS009-PROCESS-TABLE = 'TINPKSU'                  14760016
147700               EXEC SQL                                           14770016
147800                  INSERT INTO TINPKSU                             14780016
147900                     (                                            14790016
148000                        SHIPT_UNT_ID                              14800016
148100                       ,PO_NBR                                    14810016
148200                       ,SEQ_NBR                                   14820016
148300                    )                                             14830016
148400                VALUES (                                          14840016
148500                    :WS-INPKSU-SHIPT-UNT-ID                       14850016
148600                   ,:WS-INPKSU-PO-NBR                             14860016
148700                   ,:WS-INPKSU-SEQ-NBR                            14870016
148800                       )                                          14880016
148900               END-EXEC                                           14890016
151000            WHEN DS009-PROCESS-TABLE = 'TSHUUPC'                  15100016
151100               EXEC SQL                                           15110016
151200                  INSERT INTO TSHUUPC                             15120016
151300                    (                                             15130016
151400                       SHIPT_UNT_ID                               15140016
151500                      ,TRN_NBR                                    15150016
151600                      ,TRN_LNE_NBR                                15160016
151700                      ,TRN_TYP_CDE                                15170016
151800                      ,UPC_NBR                                    15180016
151900                      ,SHPD_QTY                                   15190016
152000                      ,RCVR_SEQ_NBR                               15200016
152100                    )                                             15210016
152200                VALUES (                                          15220016
152300                      :WS-SHUUPC-SHIPT-UNT-ID                     15230016
152400                     ,:WS-SHUUPC-TRN-NBR                          15240016
152500                     ,:WS-SHUUPC-TRN-LNE-NBR                      15250016
152600                     ,:WS-SHUUPC-TRN-TYP-CDE                      15260016
152700                     ,:WS-SHUUPC-UPC-NBR                          15270016
152800                     ,:WS-SHUUPC-SHPD-QTY                         15280016
152900                     ,:WS-SHUUPC-RCVR-SEQ-NBR                     15290016
153000                       )                                          15300016
153100               END-EXEC                                           15310016
153200            WHEN DS009-PROCESS-TABLE = 'TSHPUNT'                  15320016
153300               EXEC SQL                                           15330016
153400                  INSERT INTO TSHPUNT                             15340016
153500                    (                                             15350016
153600                        SHIPT_UNT_ID                              15360016
153700                       ,ORGN_OPER_UNT_ID                          15370016
153800                       ,ORGN_FCLTY_ID                             15380016
153900                       ,DEST_OPER_UNT_ID                          15390016
154000                       ,DEST_FCLTY_ID                             15400016
154100                       ,SHIPT_UNT_SRC_ID                          15410016
154200                       ,HIER_LVL_CDE                              15420016
154300                       ,NEXT_SHIPT_UNT_ID                         15430016
154400                       ,ORIG_SHIPT_UNT_ID                         15440016
154500                       ,ACTV_IND                                  15450016
154600                       ,CRE_DTE                                   15460016
154700                       ,CRE_TM                                    15470016
154800                       ,CRE_USR_ID                                15480016
154900                       ,CRE_PGM_NM                                15490016
155000                    )                                             15500016
155100                VALUES (                                          15510016
155200                       :WS-SHPUNT-SHIPT-UNT-ID                    15520016
155300                      ,:WS-SHPUNT-ORGN-OPER-UNT-ID                15530016
155400                      ,:WS-SHPUNT-ORGN-FCLTY-ID                   15540016
155500                      ,:WS-SHPUNT-DEST-OPER-UNT-ID                15550016
155600                      ,:WS-SHPUNT-DEST-FCLTY-ID                   15560016
155700                      ,:WS-SHPUNT-SHIPT-UNT-SRC-ID                15570016
155800                      ,:WS-SHPUNT-HIER-LVL-CDE                    15580016
155900                      ,:WS-SHPUNT-NEXT-SHIPT-UNT-ID               15590016
156000                      ,:WS-SHPUNT-ORIG-SHIPT-UNT-ID               15600016
156100                      ,:WS-SHPUNT-ACTV-IND                        15610016
156200                      ,:WS-SHPUNT-CRE-DTE                         15620016
156300                      ,:WS-SHPUNT-CRE-TM                          15630016
156400                      ,:WS-SHPUNT-CRE-USR-ID                      15640016
156500                      ,:WS-SHPUNT-CRE-PGM-NM                      15650016
156600                       )                                          15660016
156700               END-EXEC                                           15670016
156800          WHEN DS009-PROCESS-TABLE = 'TSHUNLO'                    15680016
156900             EXEC SQL                                             15690016
157000                INSERT INTO TSHUNLO                               15700016
157100                  (                                               15710016
157200                   SHIPT_UNT_ID                                   15720016
157300                  ,OPER_UNT_ID                                    15730016
157400                  ,FCLTY_ID                                       15740016
157500                  ,SCN_LOC_ID                                     15750016
157600                  ,CRE_USR_ID                                     15760016
157700                  ,CRE_TMST                                       15770016
157800                  ,TRIP_ID                                        15780016
157900                  ,PRTR_TYP_CDE                                   15790016
158000                  ,LBL_PRT_BTCH_ID                                15800016
158100                  ,ACTV_CDE                                       15810016
158200                  )                                               15820016
158300              VALUES (                                            15830016
158400                :WS-SHUNLO                                        15840016
158500                     )                                            15850016
158600             END-EXEC                                             15860016
158700            WHEN DS009-PROCESS-TABLE = 'TMESTDS'                  15870016
158800               EXEC SQL                                           15880016
158900                  INSERT INTO TMESTDS                             15890016
159000                    (                                             15900016
159100                    PO_NBR                                        15910016
159200                   ,PO_LNE_NBR                                    15920016
159300                   ,PLAN_NBR                                      15930016
159400                   ,STR_NBR                                       15940016
159500                   ,STR_DISTRO_QTY                                15950016
159600                   ,ALLOC_SEQ_CDE                                 15960016
159700                   ,RNK_SEQ_NBR                                   15970016
159800                    )                                             15980016
159900                VALUES (                                          15990016
160000                   :WS-MESTDS-PO-NBR                              16000016
160100                  ,:WS-MESTDS-PO-LNE-NBR                          16010016
160200                  ,:WS-MESTDS-PLAN-NBR                            16020016
160300                  ,:WS-MESTDS-STR-NBR                             16030016
160400                  ,:WS-MESTDS-STR-DISTRO-QTY                      16040016
160500                  ,:WS-MESTDS-ALLOC-SEQ-CDE                       16050016
160600                  ,:WS-MESTDS-RNK-SEQ-NBR                         16060016
160700                       )                                          16070016
160800               END-EXEC                                           16080016
160900*           WHEN DS009-PROCESS-TABLE = 'TEXTENT'                  16090016
161000*              EXEC SQL                                           16100016
161100*                 INSERT INTO TEXTENT                             16110016
161200*                   (                                             16120016
161300*                    ENT_ID                                       16130016
161400*                   ,SCAC_CDE                                     16140016
161500*                   ,DUN_NBR                                      16150016
161600*                   ,ASN_TRSCP_IND                                16160016
161700*JS                 ,CONSDT_PKSL_IND                              16170016
161800*JS                 ,ASN_PO_RU_IND                                16180016
161900*                   ,FED_EXPRESS_NBR                              16190016
162000*                   ,MDSE_VENDOR_IND                              16200016
162100*                   ,CARRIER_IND                                  16210016
162200*                   ,STATUS_CDE                                   16220016
162300*                   ,CARR_MAN_PRO_IND                             16230016
162400*                   ,EDI214_TEST_IND                              16240016
162500*                   ,IMPRT_IND                                    16250016
162600*                   ,SHIP_INSTR_LT_QTY                            16260016
162700*                   ,SHIP_INSTR_REQD                              16270016
162800*                   ,EXP_VEND_IND                                 16280016
162900*                   ,NEED_1099_IND                                16290016
163000*                   ,CRE_BY_UID                                   16300016
163100*                   ,CRE_TMST                                     16310016
163200*                   ,LAST_UPD_BY_UID                              16320016
163300*                   ,LAST_UPD_TMST                                16330016
163400*MAM                ,CFY_SLSRNK_NBR                               16340016
163500*MAM                ,PFY_SLSRNK_NBR                               16350016
163600*                   ,CRE_ASN_FCST_IND                             16360016
163700*                   ,CRE_SHIPT_FCST_IND                           16370016
163800*                   ,STR_DISTRO_LT_QTY                            16380016
163900*                   ,VLD_CART_LBL_IND                             16390016
164000*                   ,PRNT_CO_ENT_ID                               16400016
164100*                   ,VND_CLSN_CDE                                 16410016
164200*                   ,VND_PRSST_CDE                                16420016
164300*                   ,FED_TX_ID_TYP_CDE                            16430016
164400*                   ,FED_TX_ID_NBR                                16440016
164500*                   ,FCTR_IND                                     16450016
164600*                   ,PRNT_CO_IND                                  16460016
164700*                   ,CAP_EXP_CDE                                  16470016
164800*                   ,HLD_PAYT_IND                                 16480016
164900*                   ,PAY_FCTR_VND_IND                             16490016
165000*                   ,SEPR_INVC_PAYT_IND                           16500016
165100*                   ,WHLDG_PAYT_TYP_CDE                           16510016
165200*                   ,PAYT_HNDLG_CDE                               16520016
165300*                   )                                             16530016
165400*               VALUES (                                          16540016
165500*                  :WS-EXTENT-ENT-ID                              16550016
165600*                 ,:WS-EXTENT-SCAC-CDE                            16560016
165700*                 ,:WS-EXTENT-DUN-NBR                             16570016
165800*                 ,:WS-EXTENT-ASN-TRSCP-IND                       16580016
165900*JS               ,:WS-EXTENT-CONSDT-PKSL-IND                     16590016
166000*JS               ,:WS-EXTENT-ASN-PO-RU-IND                       16600016
166100*                 ,:WS-EXTENT-FED-EXPRESS-NBR                     16610016
166200*                 ,:WS-EXTENT-MDSE-VENDOR-IND                     16620016
166300*                 ,:WS-EXTENT-CARRIER-IND                         16630016
166400*                 ,:WS-EXTENT-STATUS-CDE                          16640016
166500*                 ,:WS-EXTENT-CARR-MAN-PRO-IND                    16650016
166600*                 ,:WS-EXTENT-EDI214-TEST-IND                     16660016
166700*                 ,:WS-EXTENT-IMPRT-IND                           16670016
166800*                 ,:WS-EXTENT-SHIP-INSTR-LT-QTY                   16680016
166900*                 ,:WS-EXTENT-SHIP-INSTR-REQD                     16690016
167000*                 ,:WS-EXTENT-EXP-VEND-IND                        16700016
167100*                 ,:WS-EXTENT-NEED-1099-IND                       16710016
167200*                 ,:WS-EXTENT-CRE-BY-UID                          16720016
167300*                 ,:WS-EXTENT-CRE-TMST                            16730016
167400*                 ,:WS-EXTENT-LAST-UPD-BY-UID                     16740016
167500*                 ,:WS-EXTENT-LAST-UPD-TMST                       16750016
167600*MAM              ,:WS-EXTENT-CFY-SLSRNK-NBR                      16760016
167700*MAM              ,:WS-EXTENT-PFY-SLSRNK-NBR                      16770016
167800*                 ,:WS-EXTENT-CRE-ASN-FCST-IND                    16780016
167900*                 ,:WS-EXTENT-CRE-SHIPT-FCST-IND                  16790016
168000*                 ,:WS-EXTENT-STR-DISTRO-LT-QTY                   16800016
168100*                 ,:WS-EXTENT-VLD-CART-LBL-IND                    16810016
168200*                 ,:WS-EXTENT-PRNT-CO-ENT-ID                      16820016
168300*                 ,:WS-EXTENT-VND-CLSN-CDE                        16830016
168400*                 ,:WS-EXTENT-VND-PRSST-CDE                       16840016
168500*                 ,:WS-EXTENT-FED-TX-ID-TYP-CDE                   16850016
168600*                 ,:WS-EXTENT-FED-TX-ID-NBR                       16860016
168700*                 ,:WS-EXTENT-FCTR-IND                            16870016
168800*                 ,:WS-EXTENT-PRNT-CO-IND                         16880016
168900*                 ,:WS-EXTENT-CAP-EXP-CDE                         16890016
169000*                 ,:WS-EXTENT-HLD-PAYT-IND                        16900016
169100*                 ,:WS-EXTENT-PAY-FCTR-VND-IND                    16910016
169200*                 ,:WS-EXTENT-SEPR-INVC-PAYT-IND                  16920016
169300*                 ,:WS-EXTENT-WHLDG-PAYT-TYP-CDE                  16930016
169400*                 ,:WS-EXTENT-PAYT-HNDLG-CDE                      16940016
169500*                      )                                          16950016
169600*              END-EXEC                                           16960016
169700*           WHEN DS009-PROCESS-TABLE = 'TENTNME'                  16970016
169800*              EXEC SQL                                           16980016
169900*                 INSERT INTO TENTNME                             16990016
170000*                   (                                             17000016
170100*                    ENT_ID                                       17010016
170200*                   ,SEQ_NBR                                      17020016
170300*                   ,ENT_NAME_DESC                                17030016
170400*                   ,TYPE_CDE                                     17040016
170500*                   )                                             17050016
170600*               VALUES (                                          17060016
170700*                    :WS-ENTNME-ENT-ID                            17070016
170800*                   ,:WS-ENTNME-SEQ-NBR                           17080016
170900*                   ,:WS-ENTNME-ENT-NAME-DESC                     17090016
171000*                   ,:WS-ENTNME-TYPE-CDE                          17100016
171100*                      )                                          17110016
171200*              END-EXEC                                           17120016
171300*           WHEN DS009-PROCESS-TABLE = 'TVNDDPT'                  17130016
171400*              EXEC SQL                                           17140016
171500*                 INSERT INTO TVNDDPT                             17150016
171600*                   (                                             17160016
171700*                    ENT_ID                                       17170016
171800*                   ,DEPT_NBR                                     17180016
171900*                   ,INHOUSE_NBR                                  17190016
172000*                   ,VEND_TYP_IND                                 17200016
172100*                   ,INVC_REQ_PO_IND                              17210016
172200*                   ,VND_DEPT_STAT_CD                             17220016
172300*                   )                                             17230016
172400*               VALUES (                                          17240016
172500*                    :WS-VNDDPT-ENT-ID                            17250016
172600*                   ,:WS-VNDDPT-DEPT-NBR                          17260016
172700*                   ,:WS-VNDDPT-INHOUSE-NBR                       17270016
172800*                   ,:WS-VNDDPT-VEND-TYP-IND                      17280016
172900*                   ,:WS-VNDDPT-INVC-REQ-PO-IND                   17290016
173000*                   ,:WS-VNDDPT-VND-DEPT-STAT-CD                  17300016
173100*                      )                                          17310016
173200*              END-EXEC                                           17320016
173300            WHEN DS009-PROCESS-TABLE = 'TINSTCD'                  17330016
173400               EXEC SQL                                           17340016
173500                  INSERT INTO TINSTCD                             17350016
173600                    (                                             17360016
173700                     INSTR_NBR                                    17370016
173800                    ,INSTR_DESC                                   17380016
173900                    ,CRE_BY_UID                                   17390016
174000                    ,CRE_DTE                                      17400016
174100                    )                                             17410016
174200                VALUES (                                          17420016
174300                     :WS-INSTCD-INSTR-NBR                         17430016
174400                    ,:WS-INSTCD-INSTR-DESC                        17440016
174500                    ,:WS-INSTCD-CRE-BY-UID                        17450016
174600                    ,:WS-INSTCD-CRE-DTE                           17460016
174700                       )                                          17470016
174800               END-EXEC                                           17480016
174900*           WHEN DS009-PROCESS-TABLE = 'TSPSTDS'                  17490016
175000*              EXEC SQL                                           17500016
175100*                 INSERT INTO TSPSTDS                             17510016
175200*                   (                                             17520016
175300*                    PO_NBR                                       17530016
175400*                   ,PO_LNE_NBR                                   17540016
175500*                   ,PLAN_NBR                                     17550016
175600*                   ,STR_NBR                                      17560016
175700*                   ,STR_DISTRO_QTY                               17570016
175800*                   )                                             17580016
175900*               VALUES (                                          17590016
176000*                    :WS-SPSTDS-PO-NBR                            17600016
176100*                   ,:WS-SPSTDS-PO-LNE-NBR                        17610016
176200*                   ,:WS-SPSTDS-PLAN-NBR                          17620016
176300*                   ,:WS-SPSTDS-STR-NBR                           17630016
176400*                   ,:WS-SPSTDS-STR-DISTRO-QTY                    17640016
176500*                      )                                          17650016
176600*              END-EXEC                                           17660016
176700            WHEN DS009-PROCESS-TABLE = 'TTRBNTF'                  17670016
176800               EXEC SQL                                           17680016
176900                  INSERT INTO TTRBNTF                             17690016
177000                    (                                             17700016
177100                     NOTIF_NBR                                    17710016
177200                    ,OPER_UNT_ID                                  17720016
177300                    ,FCLTY_ID                                     17730016
177400                    ,DEPT_NBR                                     17740016
177500                    ,ENT_ID                                       17750016
177600                    ,PO_NBR                                       17760016
177700                    ,PO_LNE_NBR                                   17770016
177800                    ,REC_SEQ_NBR                                  17780016
177900                    ,TRBL_RSN_CDE                                 17790016
178000                    ,NOTIF_TMST                                   17800016
178100                    ,NOTIF_UID                                    17810016
178200                    ,RESOLVED_IND                                 17820016
178300                    ,RESOLVED_TMST                                17830016
178400                    ,RESOLVED_UID                                 17840016
178500                    ,ACKNOWLG_TMST                                17850016
178600                    ,ACKNOWLG_UID                                 17860016
178700                    ,CNTCT_EXT                                    17870016
178800                    ,FCLTY_AREA_ID                                17880016
178900                    ,SHIPT_ID                                     17890016
179000                    ,PKSL_SEQ_NBR                                 17900016
179100                    ,PKSL_LNE_NBR                                 17910016
179200                    ,WORK_ORD_SEQ_NBR                             17920016
179300                    ,WO_INSTR_SEQ_NBR                             17930016
179400                    ,OVER_SHT_PCT                                 17940016
179500                    ,LAST_DTL_CRE_TMST                            17950016
179600                    ,CRE_IND                                      17960016
179700                    ,PRORATE_IND                                  17970016
179800                    ,RTV_IND                                      17980016
179900                    ,RTV_RESPONSE_TMST                            17990016
180000                    ,PO_VER_NBR                                   18000016
180100                    ,PO_LNE_VER_NBR                               18010016
180200                    ,PLN_SHIP_VER_NBR                             18020016
180300                    ,ERLY_LTE_DAY_QTY                             18030016
180400                    ,INITR_ID                                     18040016
180500                    ,RSPNB_RSLU_ID                                18050016
180600                    ,PFMC_TRKG_ID                                 18060016
180700                    ,ACTVY_RSLU_CDE                               18070016
180800                    ,INITR_ENT_ID                                 18080016
180900                    )                                             18090016
181000                VALUES (                                          18100016
181100                   :WS-TRBNTF-NOTIF-NBR                           18110016
181200                  ,:WS-TRBNTF-OPER-UNT-ID                         18120016
181300                  ,:WS-TRBNTF-FCLTY-ID                            18130016
181400                  ,:WS-TRBNTF-DEPT-NBR                            18140016
181500                  ,:WS-TRBNTF-ENT-ID                              18150016
181600                  ,:WS-TRBNTF-PO-NBR                              18160016
181700                  ,:WS-TRBNTF-PO-LNE-NBR                          18170016
181800                  ,:WS-TRBNTF-REC-SEQ-NBR                         18180016
181900                  ,:WS-TRBNTF-TRBL-RSN-CDE                        18190016
182000                  ,:WS-TRBNTF-NOTIF-TMST                          18200016
182100                  ,:WS-TRBNTF-NOTIF-UID                           18210016
182200                  ,:WS-TRBNTF-RESOLVED-IND                        18220016
182300                  ,:WS-TRBNTF-RESOLVED-TMST                       18230016
182400                  ,:WS-TRBNTF-RESOLVED-UID                        18240016
182500                  ,:WS-TRBNTF-ACKNOWLG-TMST                       18250016
182600                  ,:WS-TRBNTF-ACKNOWLG-UID                        18260016
182700                  ,:WS-TRBNTF-CNTCT-EXT                           18270016
182800                  ,:WS-TRBNTF-FCLTY-AREA-ID                       18280016
182900                  ,0                                              18290016
183000                  ,0                                              18300016
183100                  ,0                                              18310016
183200                  ,0                                              18320016
183300                  ,0                                              18330016
183400                  ,:WS-TRBNTF-OVER-SHT-PCT                        18340016
183500                  ,:WS-TRBNTF-LAST-DTL-CRE-TMST                   18350016
183600                  ,:WS-TRBNTF-CRE-IND                             18360016
183700                  ,:WS-TRBNTF-PRORATE-IND                         18370016
183800                  ,:WS-TRBNTF-RTV-IND                             18380016
183900                  ,:WS-TRBNTF-RTV-RESPONSE-TMST                   18390016
184000                  ,:WS-TRBNTF-PO-VER-NBR                          18400016
184100                  ,:WS-TRBNTF-PO-LNE-VER-NBR                      18410016
184200                  ,:WS-TRBNTF-PLN-SHIP-VER-NBR                    18420016
184300                  ,:WS-TRBNTF-ERLY-LTE-DAY-QTY                    18430016
184400                  ,:WS-TRBNTF-INITR-ID                            18440016
184500                  ,:WS-TRBNTF-RSPNB-RSLU-ID                       18450016
184600                  ,:WS-TRBNTF-PFMC-TRKG-ID                        18460016
184700                  ,:WS-TRBNTF-ACTVY-RSLU-CDE                      18470016
184800                  ,:WS-TRBNTF-INITR-ENT-ID                        18480016
184900                       )                                          18490016
185000               END-EXEC                                           18500016
185100            WHEN DS009-PROCESS-TABLE = 'TTRBDTL'                  18510016
185200               EXEC SQL                                           18520016
185300                  INSERT INTO TTRBDTL                             18530016
185400                    (                                             18540016
185500                     NOTIF_NBR                                    18550016
185600                    ,CRE_TMST                                     18560016
185700                    ,CRE_UID                                      18570016
185800                    ,FREEFORM_TEXT                                18580016
185900                    )                                             18590016
186000                VALUES (                                          18600016
186100                  :WS-TRBDTL-NOTIF-NBR                            18610016
186200                 ,:WS-TRBDTL-CRE-TMST                             18620016
186300                 ,:WS-TRBDTL-CRE-UID                              18630016
186400                 ,:WS-TRBDTL-FREEFORM-TEXT                        18640016
186500                       )                                          18650016
186600               END-EXEC                                           18660016
186700*         WHEN DS009-PROCESS-TABLE = 'TPOUPC'                     18670016
186800*            EXEC SQL                                             18680016
186900*               INSERT INTO TPOUPC                                18690016
187000*                 (                                               18700016
187100*                  PO_NBR                                         18710016
187200*                 ,PO_LNE_NBR                                     18720016
187300*                 ,UPC_ID                                         18730016
187400*                 ,UPC_QTY                                        18740016
187500*                 ,UPC_RATO_QTY_NBR                               18750016
187600*                 ,LAST_UPD_TMST                                  18760016
187700*                 ,LAST_UPD_USR_ID                                18770016
187800*                 )                                               18780016
187900*             VALUES (                                            18790016
188000*               :WS-POUPC                                         18800016
188100*                    )                                            18810016
188200*            END-EXEC                                             18820016
188300          WHEN DS009-PROCESS-TABLE = 'TALLTMP'                    18830016
188400             EXEC SQL                                             18840016
188500                INSERT INTO TALLTMP                               18850016
188600                  (                                               18860016
188700                   PO_NBR                                         18870016
188800                  ,DEST_NBR                                       18880016
188900                  ,DEST_PCT                                       18890016
189000                  )                                               18900016
189100              VALUES (                                            18910016
189200                :WS-ALLTMP                                        18920016
189300                     )                                            18930016
189400             END-EXEC                                             18940016
189500          WHEN DS009-PROCESS-TABLE = 'TVNDAGR'                    18950016
189600             EXEC SQL                                             18960016
189700                INSERT INTO TVNDAGR                               18970016
189800                  (                                               18980016
189900                   ENT_ID                                         18990016
190000                  ,DEPT_NBR                                       19000016
190100                  ,AGRMT_TYP_ID                                   19010016
190200                  ,SEQ_NBR                                        19020016
190300                  ,TYP_CDE                                        19030016
190400                  ,EFFECTIVE_DATE                                 19040016
190500                  ,EXPIRATION_DATE                                19050016
190600                  ,PROD_STATUS_IND                                19060016
190700                  ,LEADTIME_DAYS_QTY                              19070016
190800                  ,BULK_STK_TKT_IND                               19080016
190900                  ,TKT_MKR_IND                                    19090016
191000                  ,RTV_RA_REQD_IND                                19100016
191100                  ,RTV_NO_RA_REQD_IND                             19110016
191200                  ,DEBIT_DESTROY_IND                              19120016
191300                  ,MARKOUT_IND                                    19130016
191400                  ,EARLY_SHIPT_IND                                19140016
191500                  ,LATE_SHIPT_IND                                 19150016
191600                  ,PARTIAL_SHIPT_IND                              19160016
191700                  ,FOB_POINT_TXT                                  19170016
191800                  ,SHIPT_POINT_TXT                                19180016
191900                  ,DISCOUNT_PCT                                   19190016
192000                  ,EXT_PAY_DAYS_QTY                               19200016
192100                  ,PAYT_TERM_ID                                   19210016
192200                  ,LAST_UPD_TMST                                  19220016
192300                  ,LAST_UPD_ID                                    19230016
192400                  ,PARTIAL_IND                                    19240016
192500                  ,FRGT_TERM_ID                                   19250016
192600                  ,AP_TRN_CDE                                     19260016
192700                  ,VND_AUTH_ID                                    19270016
192800                  ,PSTG_FRQ_CDE                                   19280016
192900                  ,DED_DISC_IND                                   19290016
193000                  ,DED_RTV_IND                                    19300016
193100                                                                  19310016
193200                  )                                               19320016
193300              VALUES (                                            19330016
193400                :WS-VNDAGR-DATA                                   19340016
193500                :WS-VNDAGR-NULLS                                  19350016
193600                     )                                            19360016
193700             END-EXEC                                             19370016
193800*         WHEN DS009-PROCESS-TABLE = 'TPAYREQ'                    19380016
193900*            EXEC SQL                                             19390016
194000*               INSERT INTO TPAYREQ                               19400016
194100*                 (                                               19410016
194200*                  PAYT_REQ_SEQ_NBR                               19420016
194300*                 ,PAYT_REQ_TYP_CDE                               19430016
194400*                 ,REMIT_TO_DUN_NBR                               19440016
194500*                 ,ENTR_UID                                       19450016
194600*                 ,ENTR_DTE                                       19460016
194700*                 ,ENTR_TRMNL_ID                                  19470016
194800*                 ,PO_NBR                                         19480016
194900*                 ,VER_NBR                                        19490016
195000*                 )                                               19500016
195100*             VALUES (                                            19510016
195200*               :WS-PAYREQ-DATA                                   19520016
195300*               :WS-PAYREQ-NULLS                                  19530016
195400*                    )                                            19540016
195500*            END-EXEC                                             19550016
195600          WHEN DS009-PROCESS-TABLE = 'TINVOIC'                    19560016
195700             CONTINUE                                             19570016
195800*            EXEC SQL                                             19580016
195900*               INSERT INTO TINVOIC                               19590016
196000*                 (                                               19600016
196100*                  PAYT_REQ_SEQ_NBR                               19610016
196200*                 ,INVC_ID                                        19620016
196300*                 ,STR_NBR                                        19630016
196400*                 ,INVC_TYP_CDE                                   19640016
196500*                 ,STATUS_CDE                                     19650016
196600*                 ,INVC_DTE                                       19660016
196700*                 ,HOLD_IND                                       19670016
196800*                 ,ENTR_MTHD_CDE                                  19680016
196900*                 ,PAYT_RLSE_TMST                                 19690016
197000*                 ,PAYT_DTE                                       19700016
197100*                 ,GRO_COST_AMT                                   19710016
197200*                 ,INIT_INVC_ID                                   19720016
197300*                 ,BAR_CDE                                        19730016
197400*                 ,SPLIT_TERMS_IND                                19740016
197500*                 ,DTL_ENTR_IND                                   19750016
197600*                 ,STATUS_CHG_TMST                                19760016
197700*                 ,INVC_CART_CT                                   19770016
197800*                 ,CALC_DUE_DTE                                   19780016
197900*                 ,DUE_DTE_SRC_CDE                                19790016
198000*                 ,PPD_RVRSL_IND                                  19800016
198100*                 ,INVC_NET_COST_AMT                              19810016
198200*                 ,AP_PRC_CDE                                     19820016
198300*                 ,AP_PRC_DTE                                     19830016
198400*                 )                                               19840016
198500*             VALUES (                                            19850016
198600*               :WS-INVOIC-DATA                                   19860016
198700*               :WS-INVOIC-NULLS                                  19870016
198800*                    )                                            19880016
198900*            END-EXEC                                             19890016
199000          WHEN DS009-PROCESS-TABLE = 'TALCHRG'                    19900016
199100             CONTINUE                                             19910016
199200*            EXEC SQL                                             19920016
199300*               INSERT INTO TALCHRG                               19930016
199400*                 (                                               19940016
199500*                  PAYT_REQ_SEQ_NBR                               19950016
199600*                 ,ALW_CHRG_SEQ_NBR                               19960016
199700*                 ,ALW_CHRG_TYP_CDE                               19970016
199800*                 ,ALW_CHRG_CDE                                   19980016
199900*                 ,ALW_CHRG_SER_CDE                               19990016
200000*                 ,ALW_CHRG_PCT                                   20000016
200100*                 ,ALW_CHRG_AMT                                   20010016
200200*                 )                                               20020016
200300*             VALUES (                                            20030016
200400*               :WS-ALCHRG                                        20040016
200500*                    )                                            20050016
200600*            END-EXEC                                             20060016
200700          WHEN DS009-PROCESS-TABLE = 'TPREQIT'                    20070016
200800             EXEC SQL                                             20080016
200900                INSERT INTO TPREQIT                               20090016
201000                  (                                               20100016
201100                   PAYT_REQ_SEQ_NBR                               20110016
201200                  ,PAYT_REQ_LNE_NBR                               20120016
201300                  ,PAY_REQ_LNE_QTY                                20130016
201400                  ,QTY_UNT_OF_MSMT                                20140016
201500                  ,UNT_COST_AMT                                   20150016
201600                  )                                               20160016
201700              VALUES (                                            20170016
201800                :WS-PREQIT                                        20180016
201900                     )                                            20190016
202000             END-EXEC                                             20200016
202100          WHEN DS009-PROCESS-TABLE = 'TASNDTL'                    20210016
202200             EXEC SQL                                             20220016
202300                INSERT INTO TASNDTL                               20230016
202400                  (                                               20240016
202500                   ASNHDR_ID                                      20250016
202600                  ,ASNDTL_NBR                                     20260016
202700                  ,PO_NBR                                         20270016
202800                  ,SELR_INV_NBR                                   20280016
202900                  ,SEQ_NBR                                        20290016
203000                  ,UPC_NBR                                        20300016
203100                  ,ALT_PROD1_CDE                                  20310016
203200                  ,ALT_PROD1_ID                                   20320016
203300                  ,ALT_PROD2_CDE                                  20330016
203400                  ,ALT_PROD2_ID                                   20340016
203500                  ,SHIPT_QTY                                      20350016
203600                  ,SHIPT_DTE_QTY                                  20360016
203700                  ,SHIPT_UM_CDE                                   20370016
203800                  ,ITM_STATUS_CDE                                 20380016
203900                  ,ITM_ERR_CDE                                    20390016
204000                  ,ITM_ERR_QTY                                    20400016
204100                  ,ITM_ERR_QTY_UM_CDE                             20410016
204200                  ,PKG_QTY                                        20420016
204300                  ,PKG_QTY_UM_CDE                                 20430016
204400                  ,VEND_ORD_QTY                                   20440016
204500                  ,ORD_QTY_UM_CDE                                 20450016
204600                  ,WGT_MSMT                                       20460016
204700                  ,VOL_MSMT                                       20470016
204800                  ,VOL_UM_CDE                                     20480016
204900                  ,LEN_MSMT                                       20490016
205000                  ,HT_MSMT                                        20500016
205100                  ,WDTH_MSMT                                      20510016
205200                  ,SIZE_UM_CDE                                    20520016
205300                  ,ITM_SUBST_UPC_NBR                              20530016
205400                  ,TKT_ERR_CDE                                    20540016
205500                  ,WGT_UM_CDE                                     20550016
205600                  ,INPK_EA_QTY                                    20560016
205610                  ,LOC_NBR                                        20561016
205620                  )                                               20562016
205630              VALUES (                                            20563016
205640                :WS-ASNDTL-DATA                                   20564016
205650                :WS-ASNDTL-NULLS                                  20565016
205660                     )                                            20566016
205670             END-EXEC                                             20567016
205680          WHEN DS009-PROCESS-TABLE = 'TASNORD'                    20568016
205690             EXEC SQL                                             20569016
205700                INSERT INTO TASNORD                               20570016
205800                  (                                               20580016
205900                   ASNHDR_ID                                      20590016
206000                  ,PO_NBR                                         20600016
206100                  ,SEQ_NBR                                        20610016
206200                  ,SELR_INV_NBR                                   20620016
206300                  ,VEND_ORD_NBR                                   20630016
206400                  ,CUST_NBR                                       20640016
206500                  ,PROMO_NBR                                      20650016
206600                  ,VEND_NBR                                       20660016
206700                  ,MDSEDP_NBR                                     20670016
206800                  ,ORD_STATUS_CDE                                 20680016
206900                  ,CHG_ORD_SEQ_NBR                                20690016
207000                  ,PO_DTE                                         20700016
207100                  ,LTE_CHG_AMT                                    20710016
207200                  ,EXCH_FCTR                                      20720016
207300                  ,SELR_CUR_CDE                                   20730016
207400                  ,MTCH_PO_CDE                                    20740016
207500                  ,EARLY_LTE_CDE                                  20750016
207600                  ,SEQ_NBR_IND                                    20760016
207700                  ,CART_SHIP_QTY                                  20770016
207700                  ,LOC_NBR                                        20771018
207800                  )                                               20780016
207900              VALUES (                                            20790016
208000                :WS-ASNORD-DATA                                   20800016
208100                :WS-ASNORD-NULLS                                  20810016
208200                     )                                            20820016
208300             END-EXEC                                             20830016
208400          WHEN DS009-PROCESS-TABLE = 'TASNHDR'                    20840016
208500             EXEC SQL                                             20850016
208600                INSERT INTO TASNHDR                               20860016
208700                  (                                               20870016
208800                   OPERCO_NBR                                     20880016
208900                  ,EDI_VEND_ID                                    20890016
209000                  ,ASNHDR_NBR                                     20900016
209100                  ,ASNHDR_ID                                      20910016
209200                  ,ASNHDR_TMST                                    20920016
209300                  ,CRE_DTE                                        20930016
209400                  ,SHIP_DTE                                       20940016
209500                  ,BOL_NBR                                        20950016
209600                  ,PRO_NBR                                        20960016
209700                  ,CART_SHIP_QTY                                  20970016
209800                  ,GRO_WGHT_MSMT                                  20980016
209900                  ,ANTC_DELY_DTE                                  20990016
210000                  ,REC_MTHD_IND                                   21000016
210100                  ,SHIPT_STATUS_CDE                               21010016
210200                  ,CARR_NAME                                      21020016
210300                  ,TRANS_MTHD_CDE                                 21030016
210400                  ,CARR_ID_CDE                                    21040016
210500                  ,CARR_ID_QUAL_CDE                               21050016
210600                  ,RTE_SEQ_CDE                                    21060016
210700                  ,SHPT_VOL_MSMT                                  21070016
210800                  ,EQUIP_INIT_CDE                                 21080016
210900                  ,EQUIP_NBR                                      21090016
211000                  ,SCHD_SHIP_DTE                                  21100016
211100                  ,CRE_TM                                         21110016
211200                  ,REJ_SHIPT_CDE                                  21120016
211300                  ,SHPT_VOL_UM_CDE                                21130016
211400                  ,GRO_WGHT_UM_CDE                                21140016
211500                  ,PRINT_IND                                      21150016
211600                  ,SHIP_PAYT_TERM_CDE                             21160016
211700                  ,RESPBL_LOC_CDE                                 21170016
211800                  ,RESPBL_LOC_DESC                                21180016
211900                  ,DC_PRT_IND                                     21190016
212000                  ,SHIP_TM                                        21200016
212100                  )                                               21210016
212200              VALUES (                                            21220016
212300                :WS-ASNHDR-DATA                                   21230016
212400                :WS-ASNHDR-NULLS                                  21240016
212500                     )                                            21250016
212600             END-EXEC                                             21260016
212700          WHEN DS009-PROCESS-TABLE = 'TASCRIT'                    21270016
212800             EXEC SQL                                             21280016
212900                INSERT INTO TASCRIT                               21290016
213000                  (                                               21300016
213100                   ASNHDR_ID                                      21310016
213200                  ,ASNCAR_NBR                                     21320016
213300                  ,ASNDTL_NBR                                     21330016
213400                  )                                               21340016
213500              VALUES (                                            21350016
213600                :WS-ASCRIT                                        21360016
213700                     )                                            21370016
213800             END-EXEC                                             21380016
213900          WHEN DS009-PROCESS-TABLE = 'TASNCAR'                    21390016
214000             EXEC SQL                                             21400016
214100                INSERT INTO TASNCAR                               21410016
214200                  (                                               21420016
214300                   ASNHDR_ID                                      21430016
214400                  ,ASNCAR_NBR                                     21440016
214500                  ,PO_NBR                                         21450016
214600                  ,SEQ_NBR                                        21460016
214700                  ,SELR_INV_NBR                                   21470016
214800                  ,VOL_MSMT                                       21480016
214900                  ,WGHT_MSMT                                      21490016
215000                  ,NBR_QUAL_CDE                                   21500016
215100                  ,PKG_QTY                                        21510016
215200                  ,PKG_QTY_UM_CDE                                 21520016
215300                  ,WGHT_UM_CDE                                    21530016
215400                  ,VOL_UM_CDE                                     21540016
215500                  ,PKG_CDE                                        21550016
215600                  ,LEN_MSMT                                       21560016
215700                  ,HT_MSMT                                        21570016
215800                  ,WDTH_MSMT                                      21580016
215900                  ,SIZE_UM_CDE                                    21590016
216000                  ,PKG_SIZE_QTY                                   21600016
216100                  ,INPK_EA_QTY                                    21610016
216200                  )                                               21620016
216300              VALUES (                                            21630016
216400                :WS-ASNCAR-DATA                                   21640016
216500                :WS-ASNCAR-NULLS                                  21650016
216600                     )                                            21660016
216700             END-EXEC                                             21670016
216800          WHEN DS009-PROCESS-TABLE = 'TASDTPL'                    21680016
216900             EXEC SQL                                             21690016
217000                INSERT INTO TASDTPL                               21700016
217100                  (                                               21710016
217200                   ASNHDR_ID                                      21720016
217300                  ,ASNDTL_NBR                                     21730016
217400                  ,PO_LN_NBR                                      21740016
217500                  ,ASSOC_QTY                                      21750016
217510                  ,ASDTPL_ALLOC_IND                               21751016
217520                  ,SHIPT_VAR_QTY                                  21752016
217530                  ,PR_CHG_EFF_DAY_NBR                             21753016
217540                  ,PR_VAR_IND                                     21754016
217550                  ,PR_DISC_IND                                    21755016
217560                  ,PO_NBR                                         21756016
217570                  )                                               21757016
217580              VALUES (                                            21758016
217590                :WS-ASDTPL-DATA                                   21759016
217600                :WS-ASDTPL-NULLS                                  21760016
217601                     )                                            21760116
217602             END-EXEC                                             21760216
217603          WHEN DS009-PROCESS-TABLE = 'TSEASET'                    21760316
217604             EXEC SQL                                             21760416
217605                INSERT INTO TSEASET                               21760516
217606                  (                                               21760616
217607                   SEASET_YR                                      21760716
217608                  ,SEASET_SHRT_NM                                 21760816
217609                  ,SEASET_TYP_CDE                                 21760916
217610                  ,SEASET_NM                                      21761016
217620                  ,SEASET_STAT_CDE                                21762016
217630                  ,STR_STUP_BEG_DTE                               21763016
217640                  ,STR_STUP_END_DTE                               21764016
217650                  ,STR_RLSE_BEG_DTE                               21765016
217660                  ,STR_RLSE_END_DTE                               21766016
217670                  ,LAST_UPD_BY_USR_ID                             21767016
217680                  ,LAST_UPD_TMST                                  21768016
217690                  ,DIVERT_PFX_NBR                                 21769016
217700                  )                                               21770016
217800              VALUES (                                            21780016
217900                :WS-SEASET                                        21790016
218000                     )                                            21800016
218100             END-EXEC                                             21810016
218200          WHEN DS009-PROCESS-TABLE = 'TSUNAUD'                    21820016
218300             EXEC SQL                                             21830016
218400                INSERT INTO TSUNAUD                               21840016
218500                  (                                               21850016
218600                   AUD_CNTL_NBR                                   21860016
218700                  ,AUD_STRT_TMST                                  21870016
218800                  ,AUD_STP_TMST                                   21880016
218900                  ,AUD_PSPND_MNIT_QTY                             21890016
219000                  ,AUD_CLO_MNIT_QTY                               21900016
219100                  ,AUD_USR_ID                                     21910016
219200                  ,OPER_UNT_ID                                    21920016
219300                  ,FCLTY_ID                                       21930016
219400                  ,PRC_FCLTY_AREA_ID                              21940016
219500                  ,AUD_STAT_CDE                                   21950016
219600                  ,AUD_TYP_CDE                                    21960016
219700                  )                                               21970016
219800              VALUES (                                            21980016
219900                :WS-SUNAUD                                        21990016
220000                     )                                            22000016
220100             END-EXEC                                             22010016
220200          WHEN DS009-PROCESS-TABLE = 'TSUATRN'                    22020016
220300             EXEC SQL                                             22030016
220400                INSERT INTO TSUATRN                               22040016
220500                  (                                               22050016
220600                   AUD_CNTL_NBR                                   22060016
220700                  ,SHIPT_UNT_ID                                   22070016
220800                  ,UNT_AUD_STRT_TMST                              22080016
220900                  ,UNT_AUD_STP_TMST                               22090016
221000                  ,UNT_PSPND_MNIT_QTY                             22100016
221100                  ,UNT_CLO_MNIT_QTY                               22110016
221200                  ,UNT_AUD_USR_ID                                 22120016
221300                  ,UNT_AUD_STAT_CDE                               22130016
221400                  ,TRN_NBR                                        22140016
221500                  ,REC_SEQ_NBR                                    22150016
221600                  ,DEST_OPER_UNT_ID                               22160016
221700                  ,DEST_FCLTY_ID                                  22170016
221800                  ,UNT_AUD_ERR_IND                                22180016
221900                  ,UNT_RSTRT_MNIT_QTY                             22190016
222000                  )                                               22200016
222100              VALUES (                                            22210016
222200                :WS-SUATRN                                        22220016
222300                     )                                            22230016
222400             END-EXEC                                             22240016
222500          WHEN DS009-PROCESS-TABLE = 'TSUAUPC'                    22250016
222600             EXEC SQL                                             22260016
222700                INSERT INTO TSUAUPC                               22270016
222800                  (                                               22280016
222900                    AUD_CNTL_NBR                                  22290016
223000                   ,SHIPT_UNT_ID                                  22300016
223100                   ,UPC_NBR                                       22310016
223200                   ,SCN_TMST                                      22320016
223300                   ,AUD_USR_ID                                    22330016
223400                   ,ITM_DESC                                      22340016
223500                   ,VND_STYL_DESC                                 22350016
223600                   ,UPC_CLOR_DESC                                 22360016
223700                   ,UPC_SIZE_DESC                                 22370016
223800                   ,UPC_RTL_AMT                                   22380016
223900                   ,UPC_CERTD_IND                                 22390016
224000                   ,SCND_UNT_QTY                                  22400016
224100                   ,SCN_TYP_CDE                                   22410016
224200                   ,SKU_NBR                                       22420016
224300                   ,DEPT_NBR                                      22430016
224400                   ,MAJ_CL_NBR                                    22440016
224500                   ,SUB_CL_NBR                                    22450016
224600                  )                                               22460016
224700              VALUES (                                            22470016
224800                :WS-SUAUPC                                        22480016
224900                     )                                            22490016
225000             END-EXEC                                             22500016
225100          WHEN DS009-PROCESS-TABLE = 'TSUEXCP'                    22510016
225200             EXEC SQL                                             22520016
225300                INSERT INTO TSUEXCP                               22530016
225400                  (                                               22540016
225500                   AUD_CNTL_NBR                                   22550016
225600                  ,SHIPT_UNT_ID                                   22560016
225700                  ,UPC_NBR                                        22570016
225800                  ,SCN_TMST                                       22580016
225900                  ,VILN_GP_CDE                                    22590016
226000                  ,VILN_GP_SEQ_NBR                                22600016
226100                  ,OVRRID_SYS_DAT_TXT                             22610016
226200                  )                                               22620016
226300              VALUES (                                            22630016
226400                :WS-SUEXCP                                        22640016
226500                     )                                            22650016
226600             END-EXEC                                             22660016
226700          WHEN DS009-PROCESS-TABLE = 'TCTEXCP'                    22670016
226800             EXEC SQL                                             22680016
226900                INSERT INTO TCTEXCP                               22690016
227000                  (                                               22700016
227100                   AUD_CNTL_NBR                                   22710016
227200                  ,SHIPT_UNT_ID                                   22720016
227300                  ,VILN_GP_CDE                                    22730016
227400                  ,VILN_GP_SEQ_NBR                                22740016
227500                  ,OVRRID_SYS_DAT_TXT                             22750016
227600                  )                                               22760016
227700              VALUES (                                            22770016
227800                :WS-CTEXCP                                        22780016
227900                     )                                            22790016
228000             END-EXEC                                             22800016
228100          WHEN DS009-PROCESS-TABLE = 'TIMTBKY'                    22810016
228200             EXEC SQL                                             22820016
228300                INSERT INTO TIMTBKY                               22830016
228400                  (                                               22840016
228500                   NOTIF_NBR                                      22850016
228600                  ,IMPRT_ID                                       22860016
228700                  ,IMPRT_SEQ_NBR                                  22870016
228800                  ,PRCS_TYP_CDE                                   22880016
228900                  ,CRE_TMST                                       22890016
229000                  )                                               22900016
229100              VALUES (                                            22910016
229200                :WS-IMTBKY                                        22920016
229300                     )                                            22930016
229400             END-EXEC                                             22940016
229500          WHEN DS009-PROCESS-TABLE = 'TPOPRPK'                    22950016
229600             EXEC SQL                                             22960016
229700                INSERT INTO TPOPRPK                               22970016
229800                  (                                               22980016
229900                   PO_NBR                                         22990016
230000                  ,VER_NBR                                        23000016
230100                  ,PO_PREPK_ID                                    23010016
230200                  ,PREPK_TYP_CDE                                  23020016
230300                  ,PREPK_DESC                                     23030016
230400                  ,PREPK_STAT_CDE                                 23040016
230500                  ,PREPK_UPC_NBR                                  23050016
230600                  ,INPK_UNT_QTY                                   23060016
230700                  ,INPK_CNVYB_IND                                 23070016
230800                  ,OTPK_UNT_QTY                                   23080016
230900                  ,OTPK_ORD_QTY                                   23090016
231000                  ,PK_DTL_CHG_TMST                                23100016
231100                  ,PK_SKU_NBR                                     23110016
231200                  )                                               23120016
231300              VALUES (                                            23130016
231400                :WS-POPRPK                                        23140016
231500                     )                                            23150016
231600             END-EXEC                                             23160016
231700                                                                  23170016
231800          WHEN DS009-PROCESS-TABLE = 'WST_SHPMT_XREF_HDR'         23180016
231900             EXEC SQL                                             23190016
232000                INSERT INTO WST_SHPMT_XREF_HDR                    23200016
232100                  (                                               23210016
232200                     EXT_SHP_ID                                   23220016
232300                    ,INTR_TRIP_ID                                 23230016
232400                    ,SOR_CDE                                      23240016
232500                    ,DMY_SEQ_NBR                                  23250016
232600                    ,DEST_LOC_NBR                                 23260016
232700                    ,DWNLD_CDE                                    23270016
232800                    ,RCPT_TMST                                    23280016
232900                    ,CRE_USR_ID                                   23290016
233000                    ,CRE_TMST                                     23300016
233100                    ,DWNLD_TMST                                   23310016
233200                    ,LAST_PRCG_TMST                               23320016
233300                    ,PRC_CDE                                      23330016
233400                    ,VER_NBR                                      23340016
233500                    ,CRE_PGM_CDE                                  23350016
233600                  )                                               23360016
233700              VALUES                                              23370016
233800                (                                                 23380016
233900                :DS008-DCLWST00001-DATA                           23390016
234000                :DS008-DST00001-NULLS                             23400016
234100                )                                                 23410016
234200             END-EXEC                                             23420016
234300                                                                  23430016
234400          WHEN DS009-PROCESS-TABLE = 'WST_SHPMT_XREF_DTL'         23440016
234500             EXEC SQL                                             23450016
234600                INSERT INTO WST_SHPMT_XREF_DTL                    23460016
234700                  (                                               23470016
234800                     EXT_SHP_ID                                   23480016
234900                    ,PO_NBR                                       23490016
235000                    ,PO_LNE_NBR                                   23500016
235100                    ,RCVR_SEQ_NBR                                 23510016
235200                    ,PREPK_ID                                     23520016
235300                    ,ASN_LVL_CDE                                  23530016
235400                    ,CRE_USR_ID                                   23540016
235500                    ,CRE_TMST                                     23550016
235600                    ,DWNLD_CDE                                    23560016
235700                    ,ACTV_CDE                                     23570016
235800                    ,CRE_PGM_CDE                                  23580016
235900                  )                                               23590016
236000              VALUES                                              23600016
236100                (                                                 23610016
236200                :DCLWST00002                                      23620016
236300                )                                                 23630016
236400             END-EXEC                                             23640016
236500          WHEN DS009-PROCESS-TABLE = 'TSULBXF'                    23650016
236600             EXEC SQL                                             23660016
236700                INSERT INTO TSULBXF                               23670016
236800                  (                                               23680016
236900                        SHIPT_UNT_ID                              23690016
237000                       ,BRCDE_NBR                                 23700016
237100                       ,CART_LBL_TYP_CDE                          23710016
237200                       ,DEST_OPER_UNT_ID                          23720016
237300                       ,STAT_CDE                                  23730016
237400                       ,LAST_STAT_CHG_TMST                        23740016
237500                       ,CRE_TMST                                  23750016
237600                  )                                               23760016
237700              VALUES (                                            23770016
237800                :WS-SULBXF                                        23780016
237900                     )                                            23790016
238000             END-EXEC                                             23800016
238100*         WHEN DS009-PROCESS-TABLE = 'TWEBITM'                    23810016
238200*            EXEC SQL                                             23820016
238300*               INSERT INTO TWEBITM                               23830016
238400*                 (                                               23840016
238500*                    INTR_UPC_ID                                  23850016
238600*                   ,EFF_BEG_TMST                                 23860016
238700*                   ,EFF_END_TMST                                 23870016
238800*                   ,ASRT_BEG_DTE                                 23880016
238900*                   ,ASRT_END_DTE                                 23890016
239000*                   ,STRG_AREA_SEQ_NBR                            23900016
239100*                   ,SHIP_WD_QTY                                  23910016
239200*                   ,SHIP_DPTH_QTY                                23920016
239300*                   ,SHIP_HT_QTY                                  23930016
239400*                   ,SHIP_WT_QTY                                  23940016
239500*                   ,SHIP_DIM_SRC_CDE                             23950016
239600*                   ,PKG_SEQ_NBR                                  23960016
239700*                   ,SHIP_RSTRC_SEQ_NBR                           23970016
239800*                   ,GFT_WRAP_AVL_IND                             23980016
239900*                   ,PRD_GP_NBR                                   23990016
240000*                   ,PRD_GP_IND                                   24000016
240100*                   ,SHIP_SRCHG_FEE_AMT                           24010016
240200*                   ,SHIP_SRVC_SEQ_NBR                            24020016
240300*                   ,SHIP_GP_SEQ_NBR                              24030016
240400*                   ,CRE_BY_USR_ID                                24040016
240500*                 )                                               24050016
240600*             VALUES (                                            24060016
240700*                    :WS-WEBITM-INTR-UPC-ID                       24070016
240800*                   ,:WS-WEBITM-EFF-BEG-TMST                      24080016
240900*                   ,:WS-WEBITM-EFF-END-TMST                      24090016
241000*                   :WS-WEBITM-EFF-END-TMST-NN                    24100016
241100*                   ,:WS-WEBITM-ASRT-BEG-DTE                      24110016
241200*                   ,:WS-WEBITM-ASRT-END-DTE                      24120016
241300*                   ,:WS-WEBITM-STRG-AREA-SEQ-NBR                 24130016
241400*                   ,:WS-WEBITM-SHIP-WD-QTY                       24140016
241500*                   ,:WS-WEBITM-SHIP-DPTH-QTY                     24150016
241600*                   ,:WS-WEBITM-SHIP-HT-QTY                       24160016
241700*                   ,:WS-WEBITM-SHIP-WT-QTY                       24170016
241800*                   ,:WS-WEBITM-SHIP-DIM-SRC-CDE                  24180016
241900*                   ,:WS-WEBITM-PKG-SEQ-NBR                       24190016
242000*                   ,:WS-WEBITM-SHIP-RSTRC-SEQ-NBR                24200016
242100*                   ,:WS-WEBITM-GFT-WRAP-AVL-IND                  24210016
242200*                   ,:WS-WEBITM-PRD-GP-NBR                        24220016
242300*                   ,:WS-WEBITM-PRD-GP-IND                        24230016
242400*                   ,:WS-WEBITM-SHIP-SRCHG-FEE-AMT                24240016
242500*                   ,:WS-WEBITM-SHIP-SRVC-SEQ-NBR                 24250016
242600*                   ,:WS-WEBITM-SHIP-GP-SEQ-NBR                   24260016
242700*                   ,:WS-WEBITM-CRE-BY-USR-ID                     24270016
242800*                    )                                            24280016
242900*            END-EXEC                                             24290016
243000*                                                                 24300016
243100          WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_CART'             24310016
243200*        MOVE SUT00024-SHIPT-UNT-ID TO PV-DISPLAY-NBR             24320016
243300*        DISPLAY 'OTBND_CART SUT00024-SHIPT-UNT-ID = '            24330016
243400*                 PV-DISPLAY-NBR                                  24340016
243500                                                                  24350016
243600             IF SUT00024-OTBND-TRIP-ID > ZERO                     24360016
243700                 EXEC SQL                                         24370016
243800                 INSERT INTO SUT_OTBND_CART                       24380016
243900               ( SHIPT_UNT_ID                                     24390016
244000                ,ORGN_LOC_NBR                                     24400016
244100                ,DEST_LOC_NBR                                     24410016
244200                ,CART_SRC_CDE                                     24420016
244300                ,CRE_DTE                                          24430016
244400                ,CRE_TM                                           24440016
244500                ,CRE_USR_ID                                       24450016
244600                ,CRE_PGM_NM                                       24460016
244700                ,MSTR_CART_IND                                    24470016
244800                ,PRNT_CART_ID                                     24480016
244900                ,ORIG_CART_ID                                     24490016
245000                ,CART_TYP_CDE                                     24500016
245100                ,LBL_PRT_SEQ_NBR                                  24510016
245200                ,CART_RVSN_NBR                                    24520016
245300                ,OTBND_TRIP_ID                                    24530016
245400                ,ACTV_IND                                         24540016
245500                ,ODD_UNT_IND                                      24550016
245600               )                                                  24560016
245700                 VALUES                                           24570016
245800               (                                                  24580016
245900                 :SUT00024-SHIPT-UNT-ID                           24590016
246000             , :SUT00024-ORGN-LOC-NBR                             24600016
246100             , :SUT00024-DEST-LOC-NBR                             24610016
246200             , :SUT00024-CART-SRC-CDE                             24620016
246300             , :SUT00024-CRE-DTE                                  24630016
246400             , :SUT00024-CRE-TM                                   24640016
246500             , :SUT00024-CRE-USR-ID                               24650016
246600             , :SUT00024-CRE-PGM-NM                               24660016
246700             , :SUT00024-MSTR-CART-IND                            24670016
246800             , :SUT00024-PRNT-CART-ID                             24680016
246900             , :SUT00024-ORIG-CART-ID                             24690016
247000             , :SUT00024-CART-TYP-CDE                             24700016
247100             , :SUT00024-LBL-PRT-SEQ-NBR                          24710016
247200             , :SUT00024-CART-RVSN-NBR                            24720016
247300             , :SUT00024-OTBND-TRIP-ID                            24730016
247400             , :SUT00024-ACTV-IND                                 24740016
247500             , :SUT00024-ODD-UNT-IND                              24750016
247600             )                                                    24760016
247700         END-EXEC                                                 24770016
247800                                                                  24780016
247900         ELSE                                                     24790016
248000                 EXEC SQL                                         24800016
248100                 INSERT INTO SUT_OTBND_CART                       24810016
248200               ( SHIPT_UNT_ID                                     24820016
248300                ,ORGN_LOC_NBR                                     24830016
248400                ,DEST_LOC_NBR                                     24840016
248500                ,CART_SRC_CDE                                     24850016
248600                ,CRE_DTE                                          24860016
248700                ,CRE_TM                                           24870016
248800                ,CRE_USR_ID                                       24880016
248900                ,CRE_PGM_NM                                       24890016
249000                ,MSTR_CART_IND                                    24900016
249100                ,PRNT_CART_ID                                     24910016
249200                ,ORIG_CART_ID                                     24920016
249300                ,CART_TYP_CDE                                     24930016
249400                ,LBL_PRT_SEQ_NBR                                  24940016
249500                ,CART_RVSN_NBR                                    24950016
249600                ,OTBND_TRIP_ID                                    24960016
249700                ,ACTV_IND                                         24970016
249800                ,ODD_UNT_IND                                      24980016
249900               )                                                  24990016
250000                 VALUES                                           25000016
250100               (                                                  25010016
250200                 :SUT00024-SHIPT-UNT-ID                           25020016
250300             , :SUT00024-ORGN-LOC-NBR                             25030016
250400             , :SUT00024-DEST-LOC-NBR                             25040016
250500             , :SUT00024-CART-SRC-CDE                             25050016
250600             , :SUT00024-CRE-DTE                                  25060016
250700             , :SUT00024-CRE-TM                                   25070016
250800             , :SUT00024-CRE-USR-ID                               25080016
250900             , :SUT00024-CRE-PGM-NM                               25090016
251000             , :SUT00024-MSTR-CART-IND                            25100016
251100             , :SUT00024-PRNT-CART-ID                             25110016
251200             , :SUT00024-ORIG-CART-ID                             25120016
251300             , :SUT00024-CART-TYP-CDE                             25130016
251400             , :SUT00024-LBL-PRT-SEQ-NBR                          25140016
251500             , :SUT00024-CART-RVSN-NBR                            25150016
251600             , NULL                                               25160016
251700             , :SUT00024-ACTV-IND                                 25170016
251800             , :SUT00024-ODD-UNT-IND                              25180016
251900             )                                                    25190016
252000         END-EXEC                                                 25200016
252100                                                                  25210016
252200         END-IF                                                   25220016
252300                                                                  25230016
252400          WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_LOC'              25240016
252500*        MOVE DS008-OTBLOC-SHIPT-UNT-ID TO PV-DISPLAY-NBR         25250016
252600*        DISPLAY 'OTBND_LOC SHIPT-UNT-ID = '                      25260016
252700*                 PV-DISPLAY-NBR                                  25270016
252800                                                                  25280016
252900                 EXEC SQL                                         25290016
253000                 INSERT INTO SUT_OTBND_LOC                        25300016
253100              (                                                   25310016
253200                SHIPT_UNT_ID                                      25320016
253300             ,  CRE_TMST                                          25330016
253400             ,  OTBND_TRIP_ID                                     25340016
253500             ,  LOC_NBR                                           25350016
253600             ,  SCN_CDE                                           25360016
253700             ,  CRE_USR_ID                                        25370016
253800             ,  ACTV_CDE                                          25380016
253900             ,  INBD_TRIP_ID                                      25390016
254000             )                                                    25400016
254100             VALUES                                               25410016
254200             (                                                    25420016
254300              :DS008-OTBLOC-SHIPT-UNT-ID                          25430016
254400           ,  :DS008-OTBLOC-CRE-TMST                              25440016
254500           ,  :DS008-OTBLOC-OTBND-TRIP-ID                         25450016
254600                  :DS008-OTBLOC-OTBND-TRIP-ID-N                   25460016
254700           ,  :DS008-OTBLOC-LOC-NBR                               25470016
254800           ,  :DS008-OTBLOC-SCN-CDE                               25480016
254900           ,  :DS008-OTBLOC-CRE-USR-ID                            25490016
255000           ,  :DS008-OTBLOC-ACTV-CDE                              25500016
255100           ,  :DS008-OTBLOC-INBD-TRIP-ID                          25510016
255200             )                                                    25520016
255300         END-EXEC                                                 25530016
255400                                                                  25540016
255500          WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_PKD_UPC'          25550016
255600                                                                  25560016
255700                 EXEC SQL                                         25570016
255800                 INSERT INTO SUT_OTBND_PKD_UPC                    25580016
255900              (                                                   25590016
256000                SHIPT_UNT_ID                                      25600016
256100             ,  TRN_NBR                                           25610016
256200             ,  RCVR_SEQ_NBR                                      25620016
256300             ,  TRN_LNE_NBR                                       25630016
256400             ,  TRN_TYP_CDE                                       25640016
256500             ,  UPC_NBR                                           25650016
256600             ,  PKD_BY_USR_ID                                     25660016
256700             ,  PKD_TMST                                          25670016
256800             ,  PKD_QTY                                           25680016
256900             ,  MODU_NBR                                          25690016
257000             )                                                    25700016
257100             VALUES                                               25710016
257200             (                                                    25720016
257300                :SUT00025-SHIPT-UNT-ID                            25730016
257400             ,  :SUT00025-TRN-NBR                                 25740016
257500             ,  :SUT00025-RCVR-SEQ-NBR                            25750016
257600             ,  :SUT00025-TRN-LNE-NBR                             25760016
257700             ,  :SUT00025-TRN-TYP-CDE                             25770016
257800             ,  :SUT00025-UPC-NBR                                 25780016
257900             ,  :SUT00025-PKD-BY-USR-ID                           25790016
258000             ,  :SUT00025-PKD-TMST                                25800016
258100             ,  :SUT00025-PKD-QTY                                 25810016
258200             ,  :SUT00025-MODU-NBR                                25820016
258300             )                                                    25830016
258400         END-EXEC                                                 25840016
258500                                                                  25850016
258600          WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_PK'               25860016
258700                                                                  25870016
258800                 EXEC SQL                                         25880016
258900                 INSERT INTO SUT_OTBND_PK                         25890016
259000              (                                                   25900016
259100                SHIPT_UNT_ID                                      25910016
259200             ,  TRN_NBR                                           25920016
259300             ,  RCVR_SEQ_NBR                                      25930016
259400             ,  TRN_TYP_CDE                                       25940016
259500             ,  PK_SKU_NBR                                        25950016
259600             ,  SHPD_PK_QTY                                       25960016
259700             )                                                    25970016
259800             VALUES                                               25980016
259900             (                                                    25990016
260000                :SUT00041-SHIPT-UNT-ID                            26000016
260100             ,  :SUT00041-TRN-NBR                                 26010016
260200             ,  :SUT00041-RCVR-SEQ-NBR                            26020016
260300             ,  :SUT00041-TRN-TYP-CDE                             26030016
260400             ,  :SUT00041-PK-SKU-NBR                              26040016
260500             ,  :SUT00041-SHPD-PK-QTY                             26050016
260600             )                                                    26060016
260700         END-EXEC                                                 26070016
260800                                                                  26080016
260900                                                                  26090016
261000         WHEN DS009-PROCESS-TABLE = 'SUT_FINCL_ADJ'               26100016
261100                                                                  26110016
261200                 EXEC SQL                                         26120016
261300                 INSERT INTO SUT_FINCL_ADJ                        26130016
261400                    ( FINCL_ADJ_ID                                26140016
261500                     ,ADJ_ERR_CDE                                 26150016
261600                     ,PO_NBR                                      26160016
261700                     ,RCVR_LNE_NBR                                26170016
261800                     ,RCVR_SEQ_NBR                                26180016
261900                     ,DEST_LOC_NBR                                26190016
262000                     ,CRE_TMST                                    26200016
262100                     ,UPC_NBR                                     26210016
262200                     ,SHIPT_UNT_ID                                26220016
262300                     ,PRC_RSN_CDE                                 26230016
262400                     ,AUD_CNTL_NBR                                26240016
262500                     ,ORGN_LOC_NBR                                26250016
262600                     ,AUD_ADJ_STAT_CDE                            26260016
262700                     ,AUTO_APL_IND                                26270016
262800                     ,CRE_BY_USR_ID                               26280016
262900                     ,CRE_PGM_NM                                  26290016
263000                     ,FINCL_BEF_QTY                               26300016
263100                     ,FINCL_AFT_QTY                               26310016
263200                     ,RSLV_BY_USR_ID                              26320016
263300                     ,RSLV_TMST                                   26330016
263400                     ,PROB_RSN_CDE                                26340016
263500                     ,ADJ_QTY                                     26350016
263600                     ,RSLV_CMNT_TXT                               26360016
263700                    )                                             26370016
263800             VALUES                                               26380016
263900             (                                                    26390016
264000                :DS008-SUT00030-DATA                              26400016
264100                :DS008-SUT00030-NULLS                             26410016
264200             )                                                    26420016
264300         END-EXEC                                                 26430016
264400                                                                  26440016
264500         WHEN DS009-PROCESS-TABLE = 'SUT_PO_AUD_REQ'              26450016
264600                                                                  26460016
264700             EXEC SQL                                             26470016
264800             INSERT INTO SUT_PO_AUD_REQ                           26480016
264900           (                                                      26490016
265000             PO_NBR                                               26500016
265100            ,PO_LNE_NBR                                           26510016
265200            ,PO_PREPK_ID                                          26520016
265300            ,OPER_UNT_ID                                          26530016
265400            ,INBND_TRIP_ID                                        26540016
265500            ,RCVR_SEQ_NBR                                         26550016
265600            ,AUD_CNTL_NBR                                         26560016
265700            ,CART_QTY                                             26570016
265800            ,UNT_QTY                                              26580016
265900            ,AUD_CART_QTY                                         26590016
266000            ,AUD_UNT_QTY                                          26600016
266100            ,AUD_STAT_CDE                                         26610016
266200            ,DFRD_AUD_IND                                         26620016
266300            ,AUD_ERR_PCT                                          26630016
266400            ,CRE_TMST                                             26640016
266500            ,CART_PRMPT_CDE                                       26650016
266600            ,VND_RNKG_CDE                                         26660016
266700            ,PKGNG_TYP_CDE                                        26670016
266800            ,EFF_BEG_TMST                                         26680016
266900            ,ENT_ID                                               26690016
267000            ,DEPT_NBR                                             26700016
267100            ,AUD_STAT_RSN_CDE                                     26710016
267200            ,MOD_QTY_IND                                          26720016
267300            ,RWRK_AUD_CNTL_NBR                                    26730016
267400                    )                                             26740016
267500             VALUES                                               26750016
267600             (                                                    26760016
267700                :DS008-SUT00015-DATA                              26770016
267800                :DS008-SUT00015-NULLS                             26780016
267900             )                                                    26790016
268000         END-EXEC                                                 26800016
268100                                                                  26810016
268200          WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_VND'              26820016
268300                                                                  26830016
268400                 EXEC SQL                                         26840016
268500                 INSERT INTO SUT_OTBND_VND                        26850016
268600              (                                                   26860016
268700                SHIPT_UNT_ID                                      26870016
268800             ,  PO_NBR                                            26880016
268900             ,  PKSL_SEQ_NBR                                      26890016
269000             )                                                    26900016
269100             VALUES                                               26910016
269200             (                                                    26920016
269300              :SUT00026-SHIPT-UNT-ID                              26930016
269400           ,  :SUT00026-PO-NBR                                    26940016
269500           ,  :SUT00026-PKSL-SEQ-NBR                              26950016
269600             )                                                    26960016
269700         END-EXEC                                                 26970016
269800                                                                  26980016
269900          WHEN DS009-PROCESS-TABLE = 'TSUQADJ'                    26990016
270000                                                                  27000016
270100             EXEC SQL                                             27010016
270200                 INSERT INTO TSUQADJ                              27020016
270300              (                                                   27030016
270400               SHIPT_UNT_ID                                       27040016
270500             , UPC_NBR                                            27050016
270600             , ADJ_TMST                                           27060016
270700             , OPER_UNT_ID                                        27070016
270800             , ADJ_FUNC_CDE                                       27080016
270900             , ADJ_BEF_QTY                                        27090016
271000             , ADJ_AFT_QTY                                        27100016
271100             , PRC_RSN_CDE                                        27110016
271200             , ADJ_USR_ID                                         27120016
271300             , AUD_CNTL_NBR                                       27130016
271400*            , FINCL_ADJ_ID                                       27140016
271500             )                                                    27150016
271600             VALUES                                               27160016
271700             (                                                    27170016
271800               :SUQADJ-SHIPT-UNT-ID                               27180016
271900             , :SUQADJ-UPC-NBR                                    27190016
272000             , :SUQADJ-ADJ-TMST                                   27200016
272100             , :SUQADJ-OPER-UNT-ID                                27210016
272200             , :SUQADJ-ADJ-FUNC-CDE                               27220016
272300             , :SUQADJ-ADJ-BEF-QTY                                27230016
272400             , :SUQADJ-ADJ-AFT-QTY                                27240016
272500             , :SUQADJ-PRC-RSN-CDE                                27250016
272600             , :SUQADJ-ADJ-USR-ID                                 27260016
272700             , :SUQADJ-AUD-CNTL-NBR                               27270016
272800*            , :SUQADJ-FINCL-ADJ-ID                               27280016
272900             )                                                    27290016
273000         END-EXEC                                                 27300016
273100                                                                  27310016
273200          WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_UPC'              27320016
273300             EXEC SQL                                             27330016
273400             INSERT INTO SUT_OTBND_UPC                            27340016
273500         (                                                        27350016
273600             SHIPT_UNT_ID                                         27360016
273700            ,TRN_NBR                                              27370016
273800            ,RCVR_SEQ_NBR                                         27380016
273900            ,TRN_LNE_NBR                                          27390016
274000            ,TRN_TYP_CDE                                          27400016
274100            ,UPC_NBR                                              27410016
274200            ,SHPD_UNT_QTY                                         27420016
274300           )                                                      27430016
274400         VALUES                                                   27440016
274500           (                                                      27450016
274600             :SUT00028-SHIPT-UNT-ID                               27460016
274700           , :SUT00028-TRN-NBR                                    27470016
274800           , :SUT00028-RCVR-SEQ-NBR                               27480016
274900           , :SUT00028-TRN-LNE-NBR                                27490016
275000           , :SUT00028-TRN-TYP-CDE                                27500016
275100           , :SUT00028-UPC-NBR                                    27510016
275200           , :SUT00028-SHPD-UNT-QTY                               27520016
275300           )                                                      27530016
275400             END-EXEC                                             27540016
275500                                                                  27550016
275600                                                                  27560016
275700          WHEN DS009-PROCESS-TABLE = 'TSUOBTR'                    27570016
275800*            MOVE SUOBTR-OTBND-TRIP-ID TO PV-DISPLAY-NBR          27580016
275900*            DISPLAY 'TSUOBTR SHIPT-UNT-ID = '                    27590016
276000*                 PV-DISPLAY-NBR                                  27600016
276100             EXEC SQL                                             27610016
276200             INSERT INTO TSUOBTR                                  27620016
276300                  (                                               27630016
276400                   OTBND_TRIP_ID                                  27640016
276500                  ,ORGN_OPER_UNT_ID                               27650016
276600                  ,DEST_OPER_UNT_ID                               27660016
276700                  ,TRLR_SRL_NBR                                   27670016
276800                  ,BOL_ID                                         27680016
276900                  ,EST_ARRVL_TMST                                 27690016
277000                  ,TRIP_ACTV_CDE                                  27700016
277100                  ,DOOR_TYP_CDE                                   27710016
277200                 )                                                27720016
277300             VALUES                                               27730016
277400                 (                                                27740016
277500                   :SUOBTR-OTBND-TRIP-ID                          27750016
277600                 , :SUOBTR-ORGN-OPER-UNT-ID                       27760016
277700                 , :SUOBTR-DEST-OPER-UNT-ID                       27770016
277800                 , :SUOBTR-TRLR-SRL-NBR                           27780016
277900                 , :SUOBTR-BOL-ID                                 27790016
278000                 , :SUOBTR-EST-ARRVL-TMST                         27800016
278100                 , :SUOBTR-TRIP-ACTV-CDE                          27810016
278200                 , :SUOBTR-DOOR-TYP-CDE                           27820016
278300                 )                                                27830016
278400         END-EXEC                                                 27840016
278500         IF SQLCODE = -803                                        27850016
278600*            MOVE ZERO                TO SQLCODE                  27860016
278700             PERFORM 7000-UPDATE-TSUOBTR                          27870016
278800         END-IF                                                   27880016
278900                                                                  27890016
279000          WHEN DS009-PROCESS-TABLE = 'XLT_SKU'                    27900016
279100             EXEC SQL                                             27910016
279200             INSERT INTO XLT_SKU                                  27920016
279300                  (                                               27930016
279400                 INTR_UPC_ID                                      27940016
279500                ,STYL_ID                                          27950016
279600                ,ITM_NBR                                          27960016
279700                ,SKU_NBR                                          27970016
279800                ,SKU_STAT_CDE                                     27980016
279900                ,SKU_STAT_DESC                                    27990016
280000                ,INNR_PK_QTY                                      28000016
280100                ,OUTR_PK_QTY                                      28010016
280200                ,SKU_DESC                                         28020016
280300                ,KOHLS_SIZE_CDE                                   28030016
280400                ,SIZE_DESC                                        28040016
280500                ,NRF_CLOR_CDE                                     28050016
280600                ,SHRT_CLOR_DESC                                   28060016
280700                ,CSTM_CLOR_DESC                                   28070016
280800                ,REGN_PRIC_IND                                    28080016
280900                ,KY_ITM_IND                                       28090016
281000                ,GP_CDE                                           28100016
281100                ,WHSE_RPLNT_IND                                   28110016
281200             )                                                    28120016
281300         VALUES                                                   28130016
281400             (                                                    28140016
281500             :XLT00003-INTR-UPC-ID                                28150016
281600         ,   :XLT00003-STYL-ID                                    28160016
281700         ,   :XLT00003-ITM-NBR                                    28170016
281800         ,   :XLT00003-SKU-NBR                                    28180016
281900         ,   :XLT00003-SKU-STAT-CDE                               28190016
282000         ,   :XLT00003-SKU-STAT-DESC                              28200016
282100         ,   :XLT00003-INNR-PK-QTY                                28210016
282200         ,   :XLT00003-OUTR-PK-QTY                                28220016
282300         ,   :XLT00003-SKU-DESC                                   28230016
282400         ,   :XLT00003-KOHLS-SIZE-CDE                             28240016
282500         ,   :XLT00003-SIZE-DESC                                  28250016
282600         ,   :XLT00003-NRF-CLOR-CDE                               28260016
282700         ,   :XLT00003-SHRT-CLOR-DESC                             28270016
282800         ,   :XLT00003-CSTM-CLOR-DESC                             28280016
282900         ,   :XLT00003-REGN-PRIC-IND                              28290016
283000         ,   :XLT00003-KY-ITM-IND                                 28300016
283100         ,   :XLT00003-GP-CDE                                     28310016
283200         ,   :XLT00003-WHSE-RPLNT-IND                             28320016
283300         )                                                        28330016
283400         END-EXEC                                                 28340016
283500                                                                  28350016
283600          WHEN DS009-PROCESS-TABLE = 'XLT_VND_STYL'               28360016
283700*CLP 08/04/2105                                                   28370016
283800****CLP FIRST CHECK IF BRND-ID IS ON THE XLT-BRND TABLE           28380016
283900             PERFORM 7100-CHECK-BRAND-FIRST                       28390016
284000             EXEC SQL                                             28400016
284100             INSERT INTO XLT_VND_STYL                             28410016
284200             (                                                    28420016
284300                STYL_ID                                           28430016
284400               ,DEPT_NBR                                          28440016
284500               ,MAJ_CL_NBR                                        28450016
284600               ,SUB_CL_NBR                                        28460016
284700               ,VS_ID                                             28470016
284800               ,VS_NBR                                            28480016
284900               ,ENT_ID                                            28490016
285000               ,STKR_NBR                                          28500016
285100               ,TKT_TYP_DESC                                      28510016
285200               ,HNG_FOLD_DESC                                     28520016
285300***CLP 08/04/2015 ADD BRND_ID WHEN COLUMN ADDED IN PROD           28530016
285400***CLP 08/04/2015 BUT BEFORE MAKE SURE BRAND IS ON XLT_BRND       28540016
285500               ,BRND_ID                                           28550016
285600                  )                                               28560016
285700         VALUES                                                   28570016
285800             (                                                    28580016
285900               :XLT00004-STYL-ID                                  28590016
286000           ,   :XLT00004-DEPT-NBR                                 28600016
286100           ,   :XLT00004-MAJ-CL-NBR                               28610016
286200           ,   :XLT00004-SUB-CL-NBR                               28620016
286300           ,   :XLT00004-VS-ID                                    28630016
286400           ,   :XLT00004-VS-NBR                                   28640016
286500           ,   :XLT00004-ENT-ID                                   28650016
286600           ,   :XLT00004-STKR-NBR                                 28660016
286700           ,   :XLT00004-TKT-TYP-DESC                             28670016
286800           ,   :XLT00004-HNG-FOLD-DESC                            28680016
286900***CLP 08/04/2015 ADD BRND_ID WHEN COLUMN ADDED IN PROD           28690016
287000           ,   :XLT00004-BRND-ID                                  28700016
287100         )                                                        28710016
287200         END-EXEC                                                 28720016
287300                                                                  28730016
287400          WHEN DS009-PROCESS-TABLE = 'XLT_UPC'                    28740016
287500             EXEC SQL                                             28750016
287600             INSERT INTO XLT_UPC                                  28760016
287700             (                                                    28770016
287800               UPC_ID                                             28780016
287900              ,INTR_UPC_ID                                        28790016
288000              ,UPC_TYP_CDE                                        28800016
288100              ,EDI_ORD_IND                                        28810016
288200              ,CERTD_IND                                          28820016
288300              ,CERTD_DTE                                          28830016
288400              ,UPC_NBR                                            28840016
288500             )                                                    28850016
288600         VALUES                                                   28860016
288700             (                                                    28870016
288800               :XLT00006-UPC-ID                                   28880016
288900           ,   :XLT00006-INTR-UPC-ID                              28890016
289000           ,   :XLT00006-UPC-TYP-CDE                              28900016
289100           ,   :XLT00006-EDI-ORD-IND                              28910016
289200           ,   :XLT00006-CERTD-IND                                28920016
289300           ,   :XLT00006-CERTD-DTE                                28930016
289400           ,   :XLT00006-UPC-NBR                                  28940016
289500         )                                                        28950016
289600         END-EXEC                                                 28960016
289700                                                                  28970016
289800          WHEN DS009-PROCESS-TABLE = 'XLT_PK'                     28980016
289900             EXEC SQL                                             28990016
290000             INSERT INTO XLT_PK                                   29000016
290100             (                                                    29010016
290200                   PK_SKU_NBR                                     29020016
290300                  ,PK_DESC                                        29030016
290400                  ,DEPT_NBR                                       29040016
290500                  ,MAJ_CL_NBR                                     29050016
290600                  ,SUB_CL_NBR                                     29060016
290700                  ,DC_ORD_MULT_QTY                                29070016
290800                  ,LAST_UPD_TMST                                  29080016
290900             )                                                    29090016
291000         VALUES                                                   29100016
291100             (                                                    29110016
291200           :XLT00007-PK-SKU-NBR                                   29120016
291300         , :XLT00007-PK-DESC                                      29130016
291400         , :XLT00007-DEPT-NBR                                     29140016
291500         , :XLT00007-MAJ-CL-NBR                                   29150016
291600         , :XLT00007-SUB-CL-NBR                                   29160016
291700         , :XLT00007-DC-ORD-MULT-QTY                              29170016
291800         , :XLT00007-LAST-UPD-TMST                                29180016
291900         )                                                        29190016
292000         END-EXEC                                                 29200016
292100*        DISPLAY 'XLT_PK SQLCODE= ' SQLCODE                       29210019
292200                                                                  29220016
292300          WHEN DS009-PROCESS-TABLE = 'XLT_PK_UPC'                 29230016
292400             EXEC SQL                                             29240016
292500             INSERT INTO XLT_PK_UPC                               29250016
292600             (                                                    29260016
292700                   PK_SKU_NBR                                     29270016
292800                  ,UPC_NBR                                        29280016
292900                  ,EDI_ORD_IND                                    29290016
293000                  ,LAST_UPD_TMST                                  29300016
293100             )                                                    29310016
293200         VALUES                                                   29320016
293300             (                                                    29330016
293400           :XLT00009-PK-SKU-NBR                                   29340016
293500         , :XLT00009-UPC-NBR                                      29350016
293600         , :XLT00009-EDI-ORD-IND                                  29360016
293700         , :XLT00009-LAST-UPD-TMST                                29370016
293800         )                                                        29380016
293900         END-EXEC                                                 29390016
294000                                                                  29400016
294100*        DISPLAY 'XLT_PK_UPC SQLCODE= ' SQLCODE                   29410019
294200          WHEN DS009-PROCESS-TABLE = 'XLT_PK_CPT_SKU'             29420016
294300             EXEC SQL                                             29430016
294400             INSERT INTO XLT_PK_CPT_SKU                           29440016
294500             (                                                    29450016
294600                   PK_SKU_NBR                                     29460016
294700                  ,CPT_SKU_NBR                                    29470016
294800                  ,PK_RATIO_UNT_QTY                               29480016
294900                  ,LAST_UPD_TMST                                  29490016
295000             )                                                    29500016
295100         VALUES                                                   29510016
295200             (                                                    29520016
295300           :XLT00008-PK-SKU-NBR                                   29530016
295400         , :XLT00008-CPT-SKU-NBR                                  29540016
295500         , :XLT00008-PK-RATIO-UNT-QTY                             29550016
295600         , :XLT00008-LAST-UPD-TMST                                29560016
295700         )                                                        29570016
295800         END-EXEC                                                 29580016
295900                                                                  29590016
296000*        DISPLAY 'XLT_PK_CPT_SKU SQLCODE= ' SQLCODE               29600019
296100                                                                  29610016
296200          WHEN DS009-PROCESS-TABLE = 'RCT_PO_RCVR_TRKG'           29620016
296300             EXEC SQL                                             29630016
296400             INSERT INTO RCT_PO_RCVR_TRKG                         29640016
296500             (                                                    29650016
296600             PO_NBR                                               29660016
296700            ,RCVR_SEQ_NBR                                         29670016
296800            ,CRE_BY_USR_ID                                        29680016
296900            ,CRE_TMST                                             29690016
297000            ,DC_FUNC_CDE                                          29700016
297100            ,LOC_NBR                                              29710016
297200            ,PO_LNE_NBR                                           29720016
297300            ,PREPK_ID                                             29730016
297400            ,CRE_BY_PGM_NM                                        29740016
297500            ,QTY_TRKD_NBR                                         29750016
297600            ,LAST_UPD_TMST                                        29760016
297700            ,PKSL_SEQ_NBR                                         29770016
297800            ,DEST_LOC_NBR                                         29780016
297900             )                                                    29790016
298000         VALUES                                                   29800016
298100             (                                                    29810016
298200               :RCT00017-PO-NBR                                   29820016
298300            ,  :RCT00017-RCVR-SEQ-NBR                             29830016
298400            ,  :RCT00017-CRE-BY-USR-ID                            29840016
298500            ,  :RCT00017-CRE-TMST                                 29850016
298600            ,  :RCT00017-DC-FUNC-CDE                              29860016
298700            ,  :RCT00017-LOC-NBR                                  29870016
298800            ,  :RCT00017-PO-LNE-NBR                               29880016
298900            ,  :RCT00017-PREPK-ID                                 29890016
299000            ,  :RCT00017-CRE-BY-PGM-NM                            29900016
299100            ,  :RCT00017-QTY-TRKD-NBR                             29910016
299200            ,  :RCT00017-LAST-UPD-TMST                            29920016
299300            ,  :RCT00017-PKSL-SEQ-NBR                             29930016
299400            ,  :RCT00017-DEST-LOC-NBR                             29940016
299500         )                                                        29950016
299600         END-EXEC                                                 29960016
299700                                                                  29970016
299800*        DISPLAY 'RCT_PO_RCVR_TRKG  SQLCODE= ' SQLCODE            29980016
299700                                                                  29981018
188300          WHEN DS009-PROCESS-TABLE = 'TTRDPRT'                    29982018
188400             EXEC SQL                                             29983018
188500                INSERT INTO TTRDPRT                               29984018
188600                  (                                               29985018
                         TP_DKEY                                        29986018
                        ,ENT_ID                                         29987018
                        ,VEND_INCHG_ID                                  29988018
                        ,VEND_INCHG_ID_DESC                             29989018
                        ,NETWK_ID                                       29989118
                        ,KOHL_INCHG_ID                                  29989218
                        ,KOHL_INCHG_ID_DESC                             29989318
                        ,SEND_FMT_VER_CDE                               29989418
                        ,SEND_FMT_NME                                   29989518
                        ,LAST_SEND_CNTL_NBR                             29989618
                        ,SEND_CNTL_NBR_CDE                              29989718
                        ,OVRRD_SND_CNTL_NBR                             29989818
                        ,OVRRD_SND_CNTL_ID                              29989918
                        ,RECV_FMT_VER_CDE                               29990018
                        ,RECV_FMT_NME                                   29990118
                        ,LAST_RECV_CNTL_NBR                             29990218
                        ,RECV_CNTL_NBR_CDE                              29990318
                        ,OVRRD_RCV_CNTL_NBR                             29990418
                        ,OVRRD_RCV_CNTL_ID                              29990518
                        ,SETUP_DTE                                      29990618
                        ,LAST_CHG_DTE                                   29990718
                        ,LAST_CHG_UID                                   29990818
                        ,ACTV_DTE                                       29990918
                        ,INACTV_DTE                                     29991018
                        ,SER_LVL_CDE                                    29991118
                        ,NOTES_TXT                                      29991218
                        ,LAST_CALL_DTE                                  29991318
                        ,NEXT_CALL_DTE                                  29991418
                        ,SEND_AUTH_INFO_ID                              29991518
                        ,SEND_AUTH_INF_DESC                             29991618
                        ,SEND_SEC_INFO_ID                               29991718
                        ,SEND_SEC_INFO_DESC                             29991818
                        ,SEND_DATA_ELEM_IND                             29991918
                        ,SEND_SEG_TERM_IND                              29992018
                        ,SEND_SUB_ELEM_IND                              29992118
                        ,SEND_ACK_REQD_IND                              29992218
                        ,INTRCONN_NETWK_IND                             29992318
                        ,FA_COM_MTHD_CDE                                29992418
189000                  )                                               29992518
189100              VALUES (                                            29992618
                         :WS-TRDPRT-TP-DKEY                             29992718
                        ,:WS-TRDPRT-ENT-ID                              29992818
                        ,:WS-TRDPRT-VEND-INCHG-ID                       29992918
                        ,:WS-TRDPRT-VEND-INCHG-ID-DESC                  29993018
                        ,:WS-TRDPRT-NETWK-ID                            29993118
                        ,:WS-TRDPRT-KOHL-INCHG-ID                       29993218
                        ,:WS-TRDPRT-KOHL-INCHG-ID-DESC                  29993318
                        ,:WS-TRDPRT-SEND-FMT-VER-CDE                    29993418
                        ,:WS-TRDPRT-SEND-FMT-NME                        29993518
                        ,:WS-TRDPRT-LAST-SEND-CNTL-NBR                  29993618
                        ,:WS-TRDPRT-SEND-CNTL-NBR-CDE                   29993718
                        ,:WS-TRDPRT-OVRRD-SND-CNTL-NBR                  29993818
                        ,:WS-TRDPRT-OVRRD-SND-CNTL-ID                   29993918
                        ,:WS-TRDPRT-RECV-FMT-VER-CDE                    29994018
                        ,:WS-TRDPRT-RECV-FMT-NME                        29994118
                        ,:WS-TRDPRT-LAST-RECV-CNTL-NBR                  29994218
                        ,:WS-TRDPRT-RECV-CNTL-NBR-CDE                   29994318
                        ,:WS-TRDPRT-OVRRD-RCV-CNTL-NBR                  29994418
                        ,:WS-TRDPRT-OVRRD-RCV-CNTL-ID                   29994518
                        ,:WS-TRDPRT-SETUP-DTE                           29994618
                        ,:WS-TRDPRT-LAST-CHG-DTE                        29994718
                        ,:WS-TRDPRT-LAST-CHG-UID                        29994818
                        ,:WS-TRDPRT-ACTV-DTE                            29994918
                        ,:WS-TRDPRT-INACTV-DTE                          29995018
                        ,:WS-TRDPRT-SER-LVL-CDE                         29995118
                        ,:WS-TRDPRT-NOTES-TXT                           29995218
                        ,:WS-TRDPRT-LAST-CALL-DTE                       29995318
                        ,:WS-TRDPRT-NEXT-CALL-DTE                       29995418
                        ,:WS-TRDPRT-SEND-AUTH-INFO-ID                   29995518
                        ,:WS-TRDPRT-SEND-AUTH-INF-DESC                  29995618
                        ,:WS-TRDPRT-SEND-SEC-INFO-ID                    29995718
                        ,:WS-TRDPRT-SEND-SEC-INFO-DESC                  29995818
                        ,:WS-TRDPRT-SEND-DATA-ELEM-IND                  29995918
                        ,:WS-TRDPRT-SEND-SEG-TERM-IND                   29996018
                        ,:WS-TRDPRT-SEND-SUB-ELEM-IND                   29996118
                        ,:WS-TRDPRT-SEND-ACK-REQD-IND                   29996218
                        ,:WS-TRDPRT-INTRCONN-NETWK-IND                  29996318
                        ,:WS-TRDPRT-FA-COM-MTHD-CDE                     29996418
189300                     )                                            29996518
189400             END-EXEC                                             29996618
188300          WHEN DS009-PROCESS-TABLE = 'TFGTRST'                    29996718
188400             EXEC SQL                                             29996818
188500                INSERT INTO TFGTRST                               29996918
188600                  (                                               29997018
                         TP_DKEY                                        29997118
                        ,TP_DKEY_TMST                                   29997218
                        ,FUNC_CDE_SEQ_NBR                               29997318
                        ,TRN_SET_SEQ_NBR                                29997418
                        ,TRN_SET_CDE                                    29997518
                        ,FUNC_CDE_CNTL_NBR                              29997618
                        ,VEND_ACK_IND                                   29997718
                        ,TRN_SET_CNTL_NBR                               29997818
                        ,TRN_DTL_TXT                                    29997918
                        ,CHARS_XMIT_NBR                                 29998018
                        ,RTE_IND                                        29998118
                        ,TRANSL_ERR_IND                                 29998218
                        ,TRN_RLSE_TMST                                  29998318
                        ,PO_ACKNL_STAT_CDE                              29998418
189000                  )                                               29998518
189100              VALUES (                                            29998618
                         :WS-FGTRST-TP-DKEY                             29998718
                        ,:WS-FGTRST-TP-DKEY-TMST                        29998818
                        ,:WS-FGTRST-FUNC-CDE-SEQ-NBR                    29998918
                        ,:WS-FGTRST-TRN-SET-SEQ-NBR                     29999018
                        ,:WS-FGTRST-TRN-SET-CDE                         29999118
                        ,:WS-FGTRST-FUNC-CDE-CNTL-NBR                   29999218
                        ,:WS-FGTRST-VEND-ACK-IND                        29999318
                        ,:WS-FGTRST-TRN-SET-CNTL-NBR                    29999418
                        ,:WS-FGTRST-TRN-DTL-TXT                         29999518
                        ,:WS-FGTRST-CHARS-XMIT-NBR                      29999618
                        ,:WS-FGTRST-RTE-IND                             29999718
                        ,:WS-FGTRST-TRANSL-ERR-IND                      29999818
                        ,:WS-FGTRST-TRN-RLSE-TMST:PV-NULL               29999918
                        ,:WS-FGTRST-PO-ACKNL-STAT-CDE                   30000018
189300                     )                                            30000118
189400             END-EXEC                                             30000218
188300          WHEN DS009-PROCESS-TABLE = 'TINTTRN'                    30000318
188400             EXEC SQL                                             30000418
188500                INSERT INTO TINTTRN                               30000518
188600                  (                                               30000618
                         TP_DKEY                                        30000718
                        ,TP_DKEY_TMST                                   30000818
                        ,DIR_IND                                        30000918
                        ,INCHG_CNTL_NBR                                 30001018
                        ,CRE_DTE                                        30001118
                        ,CRE_TME                                        30001218
                        ,MAILBOX_REC_DTE                                30001318
                        ,MAILBOX_REC_TME                                30001418
                        ,MAILBOX_PU_DTE                                 30001518
                        ,MAILBOX_PU_TME                                 30001618
                        ,ERR_IND                                        30001718
                        ,PROD_TEST_IND                                  30001818
                        ,TRANSL_SESS_ID                                 30001918
                        ,TRN_MANL_FRCD_IND                              30002018
189000                  )                                               30002118
189100              VALUES (                                            30002218
                         :WS-INTTRN-TP-DKEY                             30002318
                        ,:WS-INTTRN-TP-DKEY-TMST                        30002418
                        ,:WS-INTTRN-DIR-IND                             30002518
                        ,:WS-INTTRN-INCHG-CNTL-NBR                      30002618
                        ,:WS-INTTRN-CRE-DTE                             30002718
                        ,:WS-INTTRN-CRE-TME                             30002818
                        ,:WS-INTTRN-MAILBOX-REC-DTE                     30002918
                        ,:WS-INTTRN-MAILBOX-REC-TME                     30003018
                        ,:WS-INTTRN-MAILBOX-PU-DTE                      30003118
                        ,:WS-INTTRN-MAILBOX-PU-TME                      30003218
                        ,:WS-INTTRN-ERR-IND                             30003318
                        ,:WS-INTTRN-PROD-TEST-IND                       30003418
                        ,:WS-INTTRN-TRANSL-SESS-ID                      30003518
                        ,:WS-INTTRN-TRN-MANL-FRCD-IND                   30003618
189300                     )                                            30003718
189400             END-EXEC                                             30003818
299900     END-EVALUATE                                                 30003916
300000     END-PERFORM.                                                 30004016
300100                                                                  30010016
300200                                                                  30020016
300300     IF DS009-PROCESS-TABLE = 'XLT_SKU' OR                        30030016
300400                              'XLT_VND_STYL' OR                   30040016
300500                              'XLT_UPC' OR                        30051018
300500                              'TTRDPRT' OR                        30052018
300500                              'TFGTRST' OR                        30053018
300500                              'TINTTRN'                           30054018
300600         IF SQLCODE = -803                                        30060016
300700             CONTINUE                                             30070016
300800         ELSE                                                     30080016
300900             PERFORM DS002-SQL-ABEND-INSERT                       30090016
301000         END-IF                                                   30100016
301100     ELSE                                                         30110016
301200         PERFORM DS002-SQL-ABEND-INSERT                           30120016
301300     END-IF.                                                      30130016
301400                                                                  30140016
301500 1100-GET-DB2-INSTANCE.                                           30150016
301600                                                                  30160016
301700     MOVE '1100-GET-DB2-INSTANCE'                                 30170016
301800          TO DS009-PARAGRAPH.                                     30180016
301900     MOVE 'GET DB2 INSTANCE'                                      30190016
302000          TO DS009-OPERATION.                                     30200016
302100                                                                  30210016
302200     EXEC SQL                                                     30220016
302300         SELECT CURRENT SERVER INTO :WS-LOCAL-SERVER              30230016
302400             FROM SYSIBM.SYSDUMMY1 WITH UR                        30240016
302500     END-EXEC.                                                    30250016
302600                                                                  30260016
302700     EVALUATE TRUE                                                30270016
302800         WHEN SQLCODE = +0                                        30280016
302810             CONTINUE                                             30281016
302820         WHEN SQLWARN0 NOT = SPACES                               30282016
302830         WHEN SQLCODE < +0                                        30283016
302840         WHEN SQLCODE > +0                                        30284016
302850             PERFORM DS002-SQL-ERROR                              30285016
302860     END-EVALUATE.                                                30286016
302870*                                                                 30287016
302880 1200-CHECK-IF-PRODUCTION.                                        30288016
302890                                                                  30289016
302900     MOVE '1200-CHECK-IF-PRODUCTION'                              30290016
302901          TO DS009-PARAGRAPH.                                     30290116
302902     MOVE 'SELECT PRDCHK TKRPRPM '                                30290216
302903          TO DS009-OPERATION.                                     30290316
302904                                                                  30290416
302905     EXEC SQL                                                     30290516
302906       SELECT FUNC_TXT                                            30290616
302907         INTO :KRPRPM-FUNC-TXT                                    30290716
302908       FROM   TKRPRPM                                             30290816
302909       WHERE  SYS_PRC_FUNC_CDE  = :PC-PRDCHK                      30290916
302910         AND  INTFC_SYS_CDE     = :PC-KHL                         30291016
302911         AND  LOC_ID            = :PC-90                          30291116
302912         AND  FUNC_TXT          = :PC-PARM-TEXT                   30291216
302913     END-EXEC                                                     30291316
302914                                                                  30291416
302915     EVALUATE TRUE                                                30291516
302916         WHEN SQLCODE = +0                                        30291616
302917             CONTINUE                                             30291716
302918         WHEN SQLCODE = +100                                      30291816
302919             DISPLAY '*******************************************'30291916
302920             DISPLAY '** ABEND - DO NOT RUN THIS DSKUT404 PROGRAM'30292016
302921             DISPLAY '** ABEND - AGAINST PRODUCTION'              30292116
302922             DISPLAY '** ABEND - THIS SHOULD ONLY EVER BE'        30292216
302923             DISPLAY '** ABEND - RUN AGAINST TEST DATA'           30292316
302924             DISPLAY '*******************************************'30292416
302925             DISPLAY '** ABEND - THIS RUN IS GOING AGAINST'       30292516
302926             DISPLAY '** ABEND - DB2 INSTANCE:  '                 30292616
302927                     WS-LOCAL-SERVER                              30292716
302928             DISPLAY '*******************************************'30292816
302929             PERFORM DS002-SQL-ERROR                              30292916
302930                                                                  30293016
302931         WHEN SQLWARN0 NOT = SPACES                               30293116
302932         WHEN SQLCODE < +0                                        30293216
302933         WHEN SQLCODE > +0                                        30293316
302934             PERFORM DS002-SQL-ERROR                              30293416
302935     END-EVALUATE.                                                30293516
302936                                                                  30293616
302937 7000-UPDATE-TSUOBTR.                                             30293716
302938     EXEC SQL                                                     30293816
302939         UPDATE TSUOBTR                                           30293916
302940             SET                                                  30294016
302950             ORGN_OPER_UNT_ID = :SUOBTR-ORGN-OPER-UNT-ID          30295016
302960            ,DEST_OPER_UNT_ID = :SUOBTR-DEST-OPER-UNT-ID          30296016
302970            ,TRLR_SRL_NBR = :SUOBTR-TRLR-SRL-NBR                  30297016
302980            ,BOL_ID = :SUOBTR-BOL-ID                              30298016
302990            ,EST_ARRVL_TMST = :SUOBTR-EST-ARRVL-TMST              30299016
303000            ,TRIP_ACTV_CDE = :SUOBTR-TRIP-ACTV-CDE                30300016
303100            ,DOOR_TYP_CDE = :SUOBTR-DOOR-TYP-CDE                  30310016
303200         WHERE                                                    30320016
303300             OTBND_TRIP_ID = :SUOBTR-OTBND-TRIP-ID                30330016
303400     END-EXEC.                                                    30340016
303500                                                                  30350016
303600     EVALUATE TRUE                                                30360016
303700         WHEN SQLCODE = ZERO                                      30370016
303800*            DISPLAY ' TSUOBTR UPDATED = '                        30380016
303900*                                 SUOBTR-OTBND-TRIP-ID            30390016
304000             CONTINUE                                             30400016
304100         WHEN SQLCODE = +100                                      30410016
304200             DISPLAY ' TSUOBTR NOT FOUND = '                      30420016
304300                                  SUOBTR-OTBND-TRIP-ID            30430016
304400         WHEN OTHER                                               30440016
304500             PERFORM DS002-SQL-ABEND-UPDATE                       30450016
304600     END-EVALUATE.                                                30460016
304700/                                                                 30470016
304800*CLP 08/04/2015 START                                             30480016
304900                                                                  30490016
305000 7100-CHECK-BRAND-FIRST.                                          30500016
305100                                                                  30510016
305200     EXEC SQL                                                     30520016
305300         SELECT BRND_ID                                           30530016
305400            INTO :XLT00043-BRND-ID                                30540016
305500          FROM  XLT_BRND                                          30550016
305600          WHERE BRND_ID            = :XLT00004-BRND-ID            30560016
305700     END-EXEC.                                                    30570016
305800                                                                  30580016
305900     EVALUATE TRUE                                                30590016
306000         WHEN SQLCODE = ZERO                                      30600016
306100             CONTINUE                                             30610016
306200         WHEN SQLCODE = +100                                      30620016
306300             PERFORM 7200-GET-BRAND-INFO                          30630016
306400         WHEN OTHER                                               30640016
306500             PERFORM DS002-SQL-ABEND-UPDATE                       30650016
306600     END-EVALUATE.                                                30660016
306700                                                                  30670016
306800 7200-GET-BRAND-INFO.                                             30680016
306900*    FIRST NEED TO GET THE DESCRIPTION AND THE TYPE CODE          30690016
307000                                                                  30700016
307100     EXEC SQL                                                     30710016
307200         SELECT DISTINCT(A.LBL_SEQ_NBR)                           30720016
307300              , B.CHARTC_VAL_DESC                                 30730016
307400              , C.LBL_TYP_CDE                                     30740016
307500            INTO :MDARVS-LBL-SEQ-NBR                              30750016
307600                ,:VSCHVL-CHARTC-VAL-DESC                          30760016
307700                ,:IMT00000-LBL-TYP-CDE                            30770016
307800          FROM  TMDARVS A                                         30780016
307900               ,TVSCHVL B                                         30790016
308000               ,IMT_LBL C                                         30800016
308100          WHERE A.LBL_SEQ_NBR      = C.LBL_SEQ_NBR                30810016
308200            AND A.LBL_SEQ_NBR      = B.CHARTC_SEQ_NBR             30820016
308300            AND A.LBL_SEQ_NBR      = :XLT00004-BRND-ID            30830016
308400            AND A.ACTV_IND         = 'Y'                          30840016
308500            AND B.STAT_CDE         = 'A'                          30850016
308600            AND B.CHARTC_CDE       = '3'                          30860016
308700     END-EXEC.                                                    30870016
308800                                                                  30880016
308900     EVALUATE TRUE                                                30890016
309000         WHEN SQLCODE = ZERO                                      30900016
309100             PERFORM 7300-INSERT-BRAND                            30910016
309200         WHEN SQLCODE = +100                                      30920016
309300             CONTINUE                                             30930016
309400         WHEN OTHER                                               30940016
309500             PERFORM DS002-SQL-ABEND-UPDATE                       30950016
309600     END-EVALUATE.                                                30960016
309700                                                                  30970016
309800 7300-INSERT-BRAND.                                               30980016
309900                                                                  30990016
310000     EXEC SQL                                                     31000016
310100           INSERT INTO XLT_BRND                                   31010016
310200           ( BRND_ID                                              31020016
310300            ,BRND_DESC                                            31030016
310400            ,BRND_TYP_CDE                                         31040016
310500            ,LAST_UPD_TMST )                                      31050016
310600            VALUES                                                31060016
310700           ( :XLT00043-BRND-ID                                    31070016
310800            ,:VSCHVL-CHARTC-VAL-DESC                              31080016
310900            ,:IMT00000-LBL-TYP-CDE                                31090016
311000            ,CURRENT TIMESTAMP )                                  31100016
311100     END-EXEC.                                                    31110016
311200                                                                  31120016
311300     EVALUATE TRUE                                                31130016
311400         WHEN SQLCODE = ZERO                                      31140016
311500             DISPLAY ' XLT_BRND INSERT = '                        31150016
311600                                  XLT00043-BRND-ID                31160016
311700             CONTINUE                                             31170016
311800         WHEN SQLCODE = +100                                      31180016
311900             DISPLAY ' XLT_BRND NOT FOUND = '                     31190016
312000                                  XLT00043-BRND-ID                31200016
312100         WHEN OTHER                                               31210016
312200             PERFORM DS002-SQL-ABEND-UPDATE                       31220016
312300     END-EVALUATE.                                                31230016
312400*CLP 08/04/2015 END                                               31240016
312500                                                                  31250016
312600                                                                  31260016
312700 9000-DUMP-COUNT-TABLE.                                           31270016
312800                                                                  31280016
312900     DISPLAY '  ****  INSERT TOTALS  ****'                        31290016
313000                                                                  31300016
313100     PERFORM VARYING CNTL-I FROM 1 BY 1 UNTIL                     31310016
313200           CNTL-I > CNTL-SUB-MAX OR CNTL-I > 200                  31320016
313300         IF CNTL-TABLE(CNTL-I) NOT = SPACES                       31330016
313400             IF DS009-GROUP-NBR(CNTL-I) = '1'                     31340016
313500                 MOVE DS009-READ-COUNT (CNTL-I) TO DS009-DISP-NBR 31350016
313600                 DISPLAY 'TABLE = ' CNTL-TABLE(CNTL-I)            31360016
313700                            DS009-DISP-NBR                        31370016
313800                 ADD DS009-READ-COUNT (CNTL-I) TO PV-TOTAL-COUNT  31380016
313900             END-IF                                               31390016
314000         END-IF                                                   31400016
314100     END-PERFORM.                                                 31410016
314200                                                                  31420016
314300     MOVE PV-TOTAL-COUNT            TO DS009-DISP-NBR             31430016
314400     DISPLAY SPACES.                                              31440016
314500     DISPLAY '**  TOTAL INSERTS = ' DS009-DISP-NBR.               31450016
314600***************************************************************** 31460016
314700*     PRODUCTION - TO - TEST STANDARD PARAGRAPHS                * 31470016
314800***************************************************************** 31480016
314900     COPY DSPD02Q.                                                31490016
