000100 IDENTIFICATION DIVISION.                                         00010011
000200 PROGRAM-ID.     DSKUT403.                                        00020011
000300 AUTHOR.         RICHARD MOORE/DENNIS STEFFEN.                    00030011
000400 DATE-WRITTEN.   12/01/98.                                        00040011
000500 DATE-COMPILED.                                                   00050011
000600                                                                  00060011
000700******************************************************************00070011
000800*                                                                 00080011
000900*PURPOSE:   DELETE GROUP 1 DATA --  QA                            00090012
001000*                                                                 00100011
001100******************************************************************00110011
001200*CHANGE HISTORY:                                                  00120011
001300* WR/PROJ  DATE        DESCRIPTION OF CHANGES                     00130011
001400* -------  ----------  ----------------------------------------   00140011
001500* RWJ      05-02-2003  VSM REQUESTED CHANGES TO PROD TO TEST PER  00150011
001600*                      PAUL KEBER. - ROD JANSSEN                  00160011
001700*                      LOGIC REMOVAL FOR TABLES:                  00170011
001800*                       TSK       TUPC        TUPCSKU             00180011
001900*                       TSKXREF   TMDARVS     TUPCPLS             00190011
002000*                       TVNDSTL   TEXTENT     TENTNME             00200011
002100*                       TMDSEAR   TWEBITM                         00210011
002200* PJK      05-24-2007  TVNDDPT REMOVED TO BE ADDED TO VSM UPDATES 00220011
002201******************************************************************00220111
002202* GB       05-24-2020  ADDED NEW TABLE TO DELETE TASDTPL          00220211
002203******************************************************************00220311
002204* J KURK   03/2021     REMOVE TABLE TPOUPC AND TSPSTDS            00220411
002205* J KURK   08/2022     RECOMPILE FOR COPYBOOK DSPD002             00220511
004510* J KURK   04/2023     ADD TABLES TTRDPRT, TFGTRST, TINTTRN       00220613
002206******************************************************************00220711
002207                                                                  00220811
002208 ENVIRONMENT DIVISION.                                            00220911
002209 INPUT-OUTPUT SECTION.                                            00221011
002210 FILE-CONTROL.                                                    00221111
002220                                                                  00222011
002230     SELECT PO-NBR-FILE                                           00223011
002240         ASSIGN         TO UT-S-PO01.                             00224011
002250     SELECT TBLE-FILE                                             00225011
002260         ASSIGN         TO UT-S-TBL01.                            00226011
002270     SELECT CONTROL-FILE                                          00227011
002280         ASSIGN         TO UT-S-CTL01.                            00228011
002290                                                                  00229011
002300 DATA DIVISION.                                                   00230011
002400 FILE SECTION.                                                    00240011
002500                                                                  00250011
002600     COPY DSFD001.                                                00260011
002700                                                                  00270011
002800******************************************************************00280011
002900 WORKING-STORAGE SECTION.                                         00290011
003000******************************************************************00300011
003100     COPY DSRD002.                                                00310011
003200     COPY DSWS08Q.                                                00320011
003300     COPY DSWS009.                                                00330011
003400     COPY DSWS10Q.                                                00340011
003500     COPY DPWS004.                                                00350011
003600 01  OTHER-CRAPOLA.                                               00360011
003700     05  PV-READ-COUNT                PIC S9(09) COMP-3 VALUE     00370011
003800                                                        ZERO.     00380011
003900     05  PV-TOTAL-COUNT               PIC S9(09) COMP-3 VALUE     00390011
004000                                                        ZERO.     00400011
004100     05  PV-DISP-NBR                  PIC Z(17)9.                 00410011
004200     05  PV-WHEN-COMPILED.                                        00420011
004300         10  PV-COMPILE-DATE          PIC X(08).                  00430011
004400         10  PV-COMPILE-TIME          PIC X(08).                  00440011
004500                                                                  00450011
004600 01  PC-CONSTANTS.                                                00460011
004700     05  PC-90                       PIC S9(04)    COMP           00470011
004800                                                   VALUE 90.      00480011
004900     05  PC-A                        PIC  X(01)    VALUE 'A'.     00490011
005000     05  PC-Y                        PIC  X(01)    VALUE 'Y'.     00500011
005100     05  PC-RCV                      PIC  X(03)    VALUE 'RCV'.   00510011
005200     05  PC-KHL                      PIC  X(03)    VALUE 'KHL'.   00520011
005300     05  PC-PRDCHK                   PIC  X(06)    VALUE 'PRDCHK'.00530011
005400     05  PC-PARM-TEXT                PIC  X(25)    VALUE          00540011
005500         'LOWER LEVEL ONLY         '.                             00550011
005600     05  PC-CURRENT-PROGRAM-NAME     PIC  X(08)    VALUE          00560011
005700         'DSKUT403'.                                              00570011
005710                                                                  00571011
005720 01  WS-LOCAL-SERVER.                                             00572011
005730     05  WS-SUBSYS                   PIC X(04)  VALUE SPACES.     00573011
005740     05  FILLER                      PIC X(12)  VALUE SPACES.     00574011
005750*                                                                 00575011
005760                                                                  00576011
005770                                                                  00577011
005780*  COMMUNICATIONS AREA FOR PROD TO TEST UTILITIES                 00578011
005790******************************************************************00579011
005791     COPY DSWS11Q.                                                00579111
005792*                                                                 00579211
005793 PROCEDURE DIVISION.                                              00579311
005794                                                                  00579411
005795 A100-MAINLINE.                                                   00579511
005796                                                                  00579611
005797     DISPLAY SPACES                                               00579711
005798     MOVE WHEN-COMPILED TO PV-WHEN-COMPILED                       00579811
005799     DISPLAY ' *** DSKUT403 VERSION 3 ***'                        00579911
005800     DISPLAY 'COMPILE DATE: ' PV-COMPILE-DATE                     00580011
005900             ' ' PV-COMPILE-TIME                                  00590011
006000                                                                  00600011
006100     PERFORM 1100-GET-DB2-INSTANCE.                               00610011
006200     PERFORM 1200-CHECK-IF-PRODUCTION.                            00620011
006300                                                                  00630011
006400     SET DS009-D-PGM TO TRUE.                                     00640011
006500     PERFORM DS002-INITIAL-PROCESSING.                            00650011
006600                                                                  00660011
006700     PERFORM 0100-DELETE-BY-PO-KEY                                00670011
006800         VARYING DS009-PO-IDX FROM 1 BY 1                         00680011
006900         UNTIL DS009-PO-NBR (DS009-PO-IDX) = ZERO                 00690011
007000                                                                  00700011
007100     PERFORM B100-PROCESSING                                      00710011
007200         UNTIL TABLE-EOF.                                         00720011
007300                                                                  00730011
007400                                                                  00740011
007500     DISPLAY '  ****  DELETE TOTALS  ****'                        00750011
007600                                                                  00760011
007700     PERFORM VARYING CNTL-I FROM 1 BY 1 UNTIL                     00770011
007800           CNTL-I > CNTL-SUB-MAX OR CNTL-I > 200                  00780011
007900         IF CNTL-TABLE(CNTL-I) NOT = SPACES                       00790011
008000             IF DS009-GROUP-NBR(CNTL-I) = '1'                     00800011
008100                 MOVE DS009-READ-COUNT (CNTL-I) TO DS009-DISP-NBR 00810011
008200                 ADD DS009-READ-COUNT (CNTL-I)  TO PV-TOTAL-COUNT 00820011
008300                 DISPLAY 'TABLE = ' CNTL-TABLE(CNTL-I)            00830011
008400                            DS009-DISP-NBR                        00840011
008500             END-IF                                               00850011
008600         END-IF                                                   00860011
008700     END-PERFORM                                                  00870011
008800     MOVE PV-TOTAL-COUNT              TO DS009-DISP-NBR           00880011
008900     DISPLAY 'TOTAL DELETES  =          '  DS009-DISP-NBR         00890011
009000                                                                  00900011
009100     PERFORM DS002-END-OF-JOB.                                    00910011
009200                                                                  00920011
009300     GOBACK.                                                      00930011
009400                                                                  00940011
009500 0100-DELETE-BY-PO-KEY.                                           00950011
009600                                                                  00960011
009700     MOVE DS009-PO-NBR (DS009-PO-IDX) TO HOLD-PO-NBR              00970011
009800                                                                  00980011
009900     MOVE 'TPURCHS'                   TO DS009-PROCESS-TABLE      00990011
010000                                         DS002-NAME               01000011
010100     PERFORM DS002-DO-PROCESS                                     01010011
010200     IF DS009-DO-PROCESS                                          01020011
010300         PERFORM R100-DELETE                                      01030011
010400         PERFORM B101-ADD-TO-DELETE-COUNTS                        01040011
010500     END-IF                                                       01050011
010600                                                                  01060011
010700     MOVE 'TPURITM'                   TO DS009-PROCESS-TABLE      01070011
010800                                         DS002-NAME               01080011
010900     PERFORM DS002-DO-PROCESS                                     01090011
011000     IF DS009-DO-PROCESS                                          01100011
011100         PERFORM R100-DELETE                                      01110011
011200         PERFORM B101-ADD-TO-DELETE-COUNTS                        01120011
011300     END-IF                                                       01130011
011400                                                                  01140011
011500     MOVE 'TPOAGMT'                   TO DS009-PROCESS-TABLE      01150011
011600                                         DS002-NAME               01160011
011700     PERFORM DS002-DO-PROCESS                                     01170011
011800     IF DS009-DO-PROCESS                                          01180011
011900         PERFORM R100-DELETE                                      01190011
012000         PERFORM B101-ADD-TO-DELETE-COUNTS                        01200011
012100     END-IF                                                       01210011
012200                                                                  01220011
012300     MOVE 'TPOINST'                   TO DS009-PROCESS-TABLE      01230011
012400                                         DS002-NAME               01240011
012500     PERFORM DS002-DO-PROCESS                                     01250011
012600     IF DS009-DO-PROCESS                                          01260011
012700         PERFORM R100-DELETE                                      01270011
012800         PERFORM B101-ADD-TO-DELETE-COUNTS                        01280011
012900     END-IF                                                       01290011
013000                                                                  01300011
013100     MOVE 'TIMPORL'                   TO DS009-PROCESS-TABLE      01310011
013200                                         DS002-NAME               01320011
013300     PERFORM DS002-DO-PROCESS                                     01330011
013400     IF DS009-DO-PROCESS                                          01340011
013500         PERFORM R100-DELETE                                      01350011
013600         PERFORM B101-ADD-TO-DELETE-COUNTS                        01360011
013700     END-IF                                                       01370011
013800                                                                  01380011
013900     MOVE 'TALLPLN'                   TO DS009-PROCESS-TABLE      01390011
014000                                         DS002-NAME               01400011
014100     PERFORM DS002-DO-PROCESS                                     01410011
014200     IF DS009-DO-PROCESS                                          01420011
014300         PERFORM R100-DELETE                                      01430011
014400         PERFORM B101-ADD-TO-DELETE-COUNTS                        01440011
014500     END-IF                                                       01450011
014600                                                                  01460011
014700     MOVE 'TPLNSHP'                   TO DS009-PROCESS-TABLE      01470011
014800                                         DS002-NAME               01480011
014900     PERFORM DS002-DO-PROCESS                                     01490011
015000     IF DS009-DO-PROCESS                                          01500011
015100         PERFORM R100-DELETE                                      01510011
015200         PERFORM B101-ADD-TO-DELETE-COUNTS                        01520011
015300     END-IF                                                       01530011
015400                                                                  01540011
015500     MOVE 'TMESTDS'                   TO DS009-PROCESS-TABLE      01550011
015600                                         DS002-NAME               01560011
015700     PERFORM DS002-DO-PROCESS                                     01570011
015800     IF DS009-DO-PROCESS                                          01580011
015900         PERFORM R100-DELETE                                      01590011
016000         PERFORM B101-ADD-TO-DELETE-COUNTS                        01600011
016100     END-IF                                                       01610011
016200                                                                  01620011
016300     MOVE 'TTRBNTF'                   TO DS009-PROCESS-TABLE      01630011
016400                                         DS002-NAME               01640011
016500     PERFORM DS002-DO-PROCESS                                     01650011
016600     IF DS009-DO-PROCESS                                          01660011
016700         PERFORM R100-DELETE                                      01670011
016800         PERFORM B101-ADD-TO-DELETE-COUNTS                        01680011
016900     END-IF                                                       01690011
017000                                                                  01700011
017100     MOVE 'TPOPRPK'                   TO DS009-PROCESS-TABLE      01710011
017200                                         DS002-NAME               01720011
017300     PERFORM DS002-DO-PROCESS                                     01730011
017400     IF DS009-DO-PROCESS                                          01740011
017500         PERFORM R100-DELETE                                      01750011
017600         PERFORM B101-ADD-TO-DELETE-COUNTS                        01760011
017700     END-IF                                                       01770011
017800                                                                  01780011
017900     MOVE 'TINPKSU'                   TO DS009-PROCESS-TABLE      01790011
018000                                         DS002-NAME               01800011
018100     PERFORM DS002-DO-PROCESS                                     01810011
018200     IF DS009-DO-PROCESS                                          01820011
018300         PERFORM R100-DELETE                                      01830011
018400         PERFORM B101-ADD-TO-DELETE-COUNTS                        01840011
018500     END-IF.                                                      01850011
018600                                                                  01860011
018700/                                                                 01870011
018800 B100-PROCESSING.                                                 01880011
018900*                                                                 01890011
019000***************************************************************** 01900011
019100*     FOR EACH TABLE, DELETE ANY EXISTING DATA AND THEN INSERT    01910011
019200*     THE DATA FROM THE FILE.                                     01920011
019300***************************************************************** 01930011
019400*                                                                 01940011
019500     READ TBLE-FILE INTO DS002-RECORD                             01950011
019600         AT END                                                   01960011
019700             SET TABLE-EOF TO TRUE                                01970011
019800         NOT AT END                                               01980011
019900             ADD 1 TO PV-READ-COUNT                               01990011
020000     END-READ.                                                    02000011
020100                                                                  02010011
020200     IF NOT-TABLE-EOF                                             02020011
020300        MOVE DS002-DATA-SIZE TO DS009-TBLE-DATA-SIZE              02030011
020400        MOVE DS002-NAME TO DS009-PROCESS-TABLE                    02040011
020500        MOVE DS002-KEYS TO DS009-PKYS                             02050011
020600        PERFORM DS002-DO-PROCESS                                  02060011
020700                                                                  02070011
020800        IF DS009-DO-PROCESS                                       02080011
020900        EVALUATE TRUE                                             02090011
021000*        WHEN DS009-PROCESS-TABLE = 'TSK'                         02100011
021100*            MOVE DS002-DATA-ITEM TO WS-SK                        02110011
021200*            MOVE WS-TSK-ITEM-NMBR       TO HOLD-ITEM-NBR         02120011
021300*            MOVE WS-TSK-MERCH-DEPT-NMBR                          02130011
021400*                                TO HOLD-MERCH-DEPT-NMBR          02140011
021500*            MOVE WS-TSK-MERCH-CLASS-NMBR                         02150011
021600*                                TO HOLD-MERCH-CLASS-NMBR         02160011
021700*            MOVE WS-TSK-SEQ-NMBR                                 02170011
021800*                                TO HOLD-SEQ-NMBR                 02180011
021900*            PERFORM R100-DELETE                                  02190011
022000*        WHEN DS009-PROCESS-TABLE = 'TUPC'                        02200011
022100*            MOVE DS002-DATA-ITEM TO WS-UPC                       02210011
022200*            MOVE WS-UPC-UPC-ID           TO HOLD-UPC-ID          02220011
022300*            PERFORM R100-DELETE                                  02230011
022400*        WHEN DS009-PROCESS-TABLE = 'TUPCSKU'                     02240011
022500*            MOVE DS002-DATA-ITEM TO WS-UPCSKU                    02250011
022600*            MOVE WS-TUPCSKU-UPC-NBR      TO HOLD-UPC-NBR         02260011
022700*            PERFORM R100-DELETE                                  02270011
022800*        WHEN DS009-PROCESS-TABLE = 'TUPCPLS'                     02280011
022900*            MOVE DS002-DATA-ITEM TO WS-UPCPLS                    02290011
023000*            MOVE WS-UPCPLS-UPC-ID        TO HOLD-UPC-ID          02300011
023100*            PERFORM R100-DELETE                                  02310011
023200*        WHEN DS009-PROCESS-TABLE = 'TSKXREF'                     02320011
023300*            MOVE DS002-DATA-ITEM TO WS-SKXREF                    02330011
023400*            MOVE WS-SKXREF-ITM-NBR       TO HOLD-ITM-NBR         02340011
023500*            PERFORM R100-DELETE                                  02350011
023600*        WHEN DS009-PROCESS-TABLE = 'TMDSEAR'                     02360011
023700*            MOVE DS002-DATA-ITEM TO WS-MDSEAR                    02370011
023800*            MOVE WS-MDSEAR-MDSEAR-DKEY TO                        02380011
023900*                 HOLD-SUB-CL-MDSEAR-ID                           02390011
024000*            PERFORM R100-DELETE                                  02400011
024100*        WHEN DS009-PROCESS-TABLE = 'TMDARVS'                     02410011
024200*            MOVE DS002-DATA-ITEM TO WS-MDARVS                    02420011
024300*            MOVE WS-MDARVS-SUB-CL-MDSEAR-ID TO                   02430011
024400*                 HOLD-SUB-CL-MDSEAR-ID                           02440011
024500*            PERFORM R100-DELETE                                  02450011
024600*        WHEN DS009-PROCESS-TABLE = 'TVNDSTL'                     02460011
024700*            MOVE DS002-DATA-ITEM TO WS-VNDSTL                    02470011
024800*            MOVE WS-VNDSTL-VS-ID         TO HOLD-VS-ID           02480011
024900*            PERFORM R100-DELETE                                  02490011
025000*        WHEN DS009-PROCESS-TABLE = 'TEXTENT'                     02500011
025100*            MOVE DS002-DATA-ITEM TO WS-EXTENT                    02510011
025200*            MOVE WS-EXTENT-ENT-ID        TO HOLD-ENT-ID          02520011
025300*            PERFORM R100-DELETE                                  02530011
025400*        WHEN DS009-PROCESS-TABLE = 'TENTNME'                     02540011
025500*            MOVE DS002-DATA-ITEM TO WS-ENTNME                    02550011
025600*            MOVE WS-ENTNME-ENT-ID        TO HOLD-ENT-ID          02560011
025700*            PERFORM R100-DELETE                                  02570011
025800*        WHEN DS009-PROCESS-TABLE = 'TVNDDPT'                     02580011
025900*            MOVE DS002-DATA-ITEM TO WS-VNDDPT                    02590011
026000*            MOVE WS-VNDDPT-ENT-ID        TO HOLD-ENT-ID          02600011
026100*            PERFORM R100-DELETE                                  02610011
026200         WHEN DS009-PROCESS-TABLE = 'TINSTCD'                     02620011
026300             MOVE DS002-DATA-ITEM TO WS-INSTCD                    02630011
026400             MOVE WS-INSTCD-INSTR-NBR  TO HOLD-INSTR-NBR          02640011
026500             PERFORM R100-DELETE                                  02650011
026600*        WHEN DS009-PROCESS-TABLE = 'TSPSTDS'                     02660011
026700*            MOVE DS002-DATA-ITEM TO WS-SPSTDS                    02670011
026800*            MOVE WS-SPSTDS-PO-NBR        TO HOLD-PO-NBR          02680011
026900*            PERFORM R100-DELETE                                  02690011
027000*        WHEN DS009-PROCESS-TABLE = 'TTRBDTL'                     02700011
027100*        (IS CASCADE DELETED BY TTRBNTF)                          02710011
027200*            MOVE DS002-DATA-ITEM TO WS-TRBDTL                    02720011
027300*            MOVE WS-TRBDTL-NOTIF-NBR     TO HOLD-NOTIF-NBR       02730011
027400*            DISPLAY HOLD-NOTIF-NBR                               02740011
027500*            DISPLAY WS-TRBDTL                                    02750011
027600*            PERFORM R100-DELETE                                  02760011
027700*        WHEN DS009-PROCESS-TABLE = 'TPOUPC'                      02770011
027800*            MOVE DS002-DATA-ITEM         TO WS-POUPC             02780011
027900*            MOVE WS-POUPC-PO-NBR         TO HOLD-PO-NBR          02790011
028000*            PERFORM R100-DELETE                                  02800011
028100         WHEN DS009-PROCESS-TABLE = 'TALLTMP'                     02810011
028200             MOVE DS002-DATA-ITEM         TO WS-ALLTMP            02820011
028300             MOVE WS-ALLTMP-PO-NBR        TO HOLD-PO-NBR          02830011
028400             PERFORM R100-DELETE                                  02840011
028500*        WHEN DS009-PROCESS-TABLE = 'TPAYREQ'                     02850011
028600*            MOVE DS002-DATA-ITEM         TO WS-PAYREQ            02860011
028700*            MOVE WS-PAYREQ-PO-NBR        TO HOLD-PO-NBR          02870011
028800*            PERFORM R100-DELETE                                  02880011
028900         WHEN DS009-PROCESS-TABLE = 'TASNORD'                     02890011
029000             MOVE DS002-DATA-ITEM         TO WS-ASNORD            02900011
029100             MOVE WS-ASNORD-ASNHDR-ID     TO HOLD-ASNHDR-ID       02910011
029200             MOVE WS-ASNORD-PO-NBR        TO HOLD-SPO-NBR         02920011
029300             PERFORM R100-DELETE                                  02930011
029400         WHEN DS009-PROCESS-TABLE = 'TINVOIC'                     02940011
029500             MOVE DS002-DATA-ITEM         TO WS-INVOIC            02950011
029600             MOVE WS-INVOIC-PAYT-REQ-SEQ-NBR                      02960011
029700                             TO HOLD-PAYT-REQ-SEQ-NBR             02970011
029800             PERFORM R100-DELETE                                  02980011
029900         WHEN DS009-PROCESS-TABLE = 'TALCHRG'                     02990011
030000             MOVE DS002-DATA-ITEM         TO WS-ALCHRG            03000011
030100*            MOVE WS-ALCHRG-PAYT-REQ-SEQ-NBR                      03010011
030200*                            TO HOLD-PAYT-REQ-SEQ-NBR             03020011
030300             PERFORM R100-DELETE                                  03030011
030400         WHEN DS009-PROCESS-TABLE = 'TPREQIT'                     03040011
030500             MOVE DS002-DATA-ITEM         TO WS-PREQIT            03050011
030600             MOVE WS-PREQIT-PAYT-REQ-SEQ-NBR                      03060011
030700                             TO HOLD-PAYT-REQ-SEQ-NBR             03070011
030800             PERFORM R100-DELETE                                  03080011
030900         WHEN DS009-PROCESS-TABLE = 'TVNDAGR'                     03090011
031000             MOVE DS002-DATA-ITEM         TO WS-VNDAGR            03100011
031100             MOVE WS-VNDAGR-ENT-ID        TO HOLD-ENT-ID          03110011
031200             PERFORM R100-DELETE                                  03120011
031300         WHEN DS009-PROCESS-TABLE = 'TTRDPRT'                     03121013
031400             MOVE DS002-DATA-ITEM         TO WS-TRDPRT            03122013
031500             MOVE WS-TRDPRT-ENT-ID        TO HOLD-ENT-ID          03123013
031600             PERFORM R100-DELETE                                  03124013
031300         WHEN DS009-PROCESS-TABLE = 'TFGTRST'                     03125013
031400             MOVE DS002-DATA-ITEM         TO WS-FGTRST            03126013
031500             MOVE WS-FGTRST-TP-DKEY       TO HOLD-TP-DKEY         03127013
031600             PERFORM R100-DELETE                                  03128013
031300         WHEN DS009-PROCESS-TABLE = 'TINTTRN'                     03129013
031400             MOVE DS002-DATA-ITEM         TO WS-INTTRN            03129113
031500             MOVE WS-INTTRN-TP-DKEY       TO HOLD-TP-DKEY         03129213
031600             PERFORM R100-DELETE                                  03129313
031300         WHEN DS009-PROCESS-TABLE = 'TASNDTL'                     03130011
031400             MOVE DS002-DATA-ITEM         TO WS-ASNDTL            03140011
031500             MOVE WS-ASNDTL-ASNHDR-ID     TO HOLD-ASNHDR-ID       03150011
031600             PERFORM R100-DELETE                                  03160011
031700         WHEN DS009-PROCESS-TABLE = 'TASNHDR'                     03170011
031800             MOVE DS002-DATA-ITEM         TO WS-ASNHDR            03180011
031900             MOVE WS-ASNHDR-ASNHDR-ID     TO HOLD-ASNHDR-ID       03190011
032000             PERFORM R100-DELETE                                  03200011
032100         WHEN DS009-PROCESS-TABLE = 'TASCRIT'                     03210011
032200             MOVE DS002-DATA-ITEM         TO WS-ASCRIT            03220011
032300             MOVE WS-ASCRIT-ASNHDR-ID     TO HOLD-ASNHDR-ID       03230011
032400             PERFORM R100-DELETE                                  03240011
032500         WHEN DS009-PROCESS-TABLE = 'TASNCAR'                     03250011
032600             MOVE DS002-DATA-ITEM         TO WS-ASNCAR            03260011
032700             MOVE WS-ASNCAR-ASNHDR-ID     TO HOLD-ASNHDR-ID       03270011
032800             PERFORM R100-DELETE                                  03280011
032900         WHEN DS009-PROCESS-TABLE = 'TASDTPL'                     03290011
033000             MOVE DS002-DATA-ITEM         TO WS-ASDTPL            03300011
033100             MOVE WS-ASDTPL-ASNHDR-ID     TO HOLD-ASNHDR-ID       03310011
033200             PERFORM R100-DELETE                                  03320011
033210         WHEN DS009-PROCESS-TABLE = 'TSEASET'                     03321011
033220             MOVE DS002-DATA-ITEM          TO WS-SEASET           03322011
033230             MOVE WS-SEASET-SEASET-YR      TO HOLD-SEASET-YR      03323011
033240             MOVE WS-SEASET-SEASET-SHRT-NM TO HOLD-SEASET-SHRT-NM 03324011
033250             PERFORM R100-DELETE                                  03325011
033260         WHEN DS009-PROCESS-TABLE = 'TSUNAUD'                     03326011
033270             MOVE DS002-DATA-ITEM         TO WS-SUNAUD            03327011
033280             MOVE WS-SUNAUD-AUD-CNTL-NBR  TO HOLD-AUD-CNTL-NBR    03328011
033290             PERFORM R100-DELETE                                  03329011
033300         WHEN DS009-PROCESS-TABLE = 'TSUATRN'                     03330011
033400             MOVE DS002-DATA-ITEM         TO WS-SUATRN            03340011
033500             MOVE WS-SUATRN-SHIPT-UNT-ID  TO HOLD-SHIPT-UNIT-ID   03350011
033600             PERFORM R100-DELETE                                  03360011
033700         WHEN DS009-PROCESS-TABLE = 'TSUAUPC'                     03370011
033800             MOVE DS002-DATA-ITEM         TO WS-SUAUPC            03380011
033900             MOVE WS-SUAUPC-SHIPT-UNT-ID  TO HOLD-SHIPT-UNIT-ID   03390011
034000             PERFORM R100-DELETE                                  03400011
034100         WHEN DS009-PROCESS-TABLE = 'TSUEXCP'                     03410011
034200             MOVE DS002-DATA-ITEM         TO WS-SUEXCP            03420011
034300             MOVE WS-SUEXCP-SHIPT-UNT-ID  TO HOLD-SHIPT-UNIT-ID   03430011
034400             PERFORM R100-DELETE                                  03440011
034500         WHEN DS009-PROCESS-TABLE = 'TCTEXCP'                     03450011
034600             MOVE DS002-DATA-ITEM         TO WS-CTEXCP            03460011
034700             MOVE WS-CTEXCP-SHIPT-UNT-ID  TO HOLD-SHIPT-UNIT-ID   03470011
034800             PERFORM R100-DELETE                                  03480011
034900         WHEN DS009-PROCESS-TABLE = 'TIMTBKY'                     03490011
035000             MOVE DS002-DATA-ITEM         TO WS-IMTBKY            03500011
035100             MOVE WS-IMTBKY-NOTIF-NBR     TO HOLD-NOTIF-NBR       03510011
035200             PERFORM R100-DELETE                                  03520011
035300         WHEN DS009-PROCESS-TABLE = 'TSHUUPC'                     03530011
035400             MOVE DS002-DATA-ITEM TO WS-SHUUPC                    03540011
035500             MOVE WS-SHUUPC-SHIPT-UNT-ID TO HOLD-SHIPT-UNIT-ID    03550011
035600             PERFORM R100-DELETE                                  03560011
035700         WHEN DS009-PROCESS-TABLE = 'TSHPUNT'                     03570011
035800             MOVE DS002-DATA-ITEM TO WS-SHPUNT                    03580011
035900             MOVE WS-SHPUNT-SHIPT-UNT-ID TO HOLD-SHIPT-UNIT-ID    03590011
036000             PERFORM R100-DELETE                                  03600011
036100         WHEN DS009-PROCESS-TABLE = 'TSHUNLO'                     03610011
036200             MOVE DS002-DATA-ITEM TO WS-SHUNLO                    03620011
036300             MOVE WS-SHUNLO-SHIPT-UNT-ID TO HOLD-SHIPT-UNIT-ID    03630011
036400             PERFORM R100-DELETE                                  03640011
036500         WHEN DS009-PROCESS-TABLE = 'TSULBXF'                     03650011
036600             MOVE DS002-DATA-ITEM        TO WS-SULBXF             03660011
036700             MOVE WS-SULBXF-SHIPT-UNT-ID TO HOLD-SHIPT-UNT-ID     03670011
036800             PERFORM R100-DELETE                                  03680011
036900*        WHEN DS009-PROCESS-TABLE = 'TWEBITM'                     03690011
037000*            MOVE DS002-DATA-ITEM         TO WS-WEBITM            03700011
037100*            MOVE WS-WEBITM-INTR-UPC-ID   TO HOLD-INTR-UPC-ID     03710011
037200*            PERFORM R100-DELETE                                  03720011
037300         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_CART'              03730011
037400             MOVE DS002-DATA-ITEM     TO DCLSUT00024              03740011
037500             PERFORM R100-DELETE                                  03750011
037600         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_PK'                03760011
037700             CONTINUE                                             03770011
037800*            CASCADE DELETED BY SUT_OTBND_CART                    03780011
037900                                                                  03790011
038000         WHEN DS009-PROCESS-TABLE = 'TSUOBTR'                     03800011
038100             MOVE DS002-DATA-ITEM     TO DCLTSUOBTR               03810011
038200             MOVE 'TSUOBTR'           TO DS009-PROCESS-TABLE      03820011
038300             PERFORM R100-DELETE                                  03830011
038400         WHEN DS009-PROCESS-TABLE = 'TSUOBTS'                     03840011
038500             MOVE DS002-DATA-ITEM     TO DCLTSUOBTS               03850011
038600             PERFORM R100-DELETE                                  03860011
038700         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_UPC'               03870011
038800             MOVE DS002-DATA-ITEM     TO DCLSUT00028              03880011
038900             PERFORM R100-DELETE                                  03890011
039000         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_PKD_UPC'           03900011
039100             MOVE DS002-DATA-ITEM     TO DCLSUT00025              03910011
039200             PERFORM R100-DELETE                                  03920011
039300         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_LOC'               03930011
039400             MOVE DS009-PKYS          TO DS008-OTBLOC-KEYS        03940011
039500             PERFORM R100-DELETE                                  03950011
039600         WHEN DS009-PROCESS-TABLE = 'SUT_PO_AUD_REQ'              03960011
039700             MOVE DS009-PKYS          TO DS008-SUT00015-KEYS      03970011
039800             PERFORM R100-DELETE                                  03980011
039900         WHEN DS009-PROCESS-TABLE = 'XLT_SKU'                     03990011
040000             MOVE DS009-PKYS          TO DS008-XLTSKU-KEYS        04000011
040100             PERFORM R100-DELETE                                  04010011
040200         WHEN DS009-PROCESS-TABLE = 'XLT_UPC'                     04020011
040300             MOVE DS009-PKYS          TO DS008-XLTUPC-KEYS        04030011
040400             PERFORM R100-DELETE                                  04040011
040500         WHEN DS009-PROCESS-TABLE = 'XLT_VND_STYL'                04050011
040600             MOVE DS009-PKYS          TO DS008-XLTVNDSTYL-KEYS    04060011
040700             PERFORM R100-DELETE                                  04070011
040800                                                                  04080011
040900         WHEN DS009-PROCESS-TABLE = 'SUT_FINCL_ADJ'               04090011
041000             MOVE DS009-PKYS          TO DS008-FINCL-ADJ-KEYS     04100011
041100             PERFORM R100-DELETE                                  04110011
041200                                                                  04120011
041300         WHEN DS009-PROCESS-TABLE = 'XLT_PK'                      04130011
041400             MOVE DS009-PKYS          TO DS008-XLT00007-KEYS      04140011
041500             PERFORM R100-DELETE                                  04150011
041600                                                                  04160011
041700         WHEN DS009-PROCESS-TABLE = 'RCT_PO_RCVR_TRKG'            04170011
041800             PERFORM R100-DELETE                                  04180011
041900                                                                  04190011
042000*        ONLY THE HEADERS NEED TO BE DELETED BECAUSE THE          04200011
042100*        DETAILS ARE DONE BY CASCADE DELETE                       04210011
042200         WHEN DS009-PROCESS-TABLE = 'WST_SHPMT_XREF_HDR'          04220011
042300             MOVE DS009-PKYS          TO DS008-WST00001-KEYS      04230011
042400             PERFORM R100-DELETE                                  04240011
042500                                                                  04250011
042600         END-EVALUATE                                             04260011
042700                                                                  04270011
042800*        DISPLAY 'DELETE RETURN SQLCODE:' SQLCODE                 04280011
042900*        DISPLAY 'NUMBER OF ROWS DELETED:' SQLERRD (3)            04290011
043000*        IF DS009-UPDATE-COUNT > DS009-COMMIT-COUNT               04300011
043100*           EXEC SQL                                              04310011
043200*               COMMIT                                            04320011
043300*           END-EXEC                                              04330011
043400*           IF SQLCODE NOT = ZERO                                 04340011
043500*              PERFORM DS002-SQL-ABEND-COMMIT                     04350011
043600*           END-IF                                                04360011
043700*           MOVE +0  TO DS009-UPDATE-COUNT                        04370011
043800*           DISPLAY 'COMMIT TAKEN AFTER RECORD: '                 04380011
043900*                                     DS009-TUPDATE-COUNT         04390011
044000*        END-IF                                                   04400011
044100                                                                  04410011
044200         PERFORM DS002-COMMIT                                     04420011
044300                                                                  04430011
044400         ADD SQLERRD(3) TO DS009-UPDATE-COUNT                     04440011
044500         ADD SQLERRD(3) TO DS009-TUPDATE-COUNT                    04450011
044600                                                                  04460011
044700                                                                  04470011
044800        END-IF                                                    04480011
044900     END-IF.                                                      04490011
045000                                                                  04500011
045100 B101-ADD-TO-DELETE-COUNTS.                                       04510011
045200     IF NOT-TABLE-EOF AND DS009-DO-PROCESS                        04520011
045300         SET DS009-SRCH-IDX TO +1                                 04530011
045400         SEARCH DS009-CNTL-RECORDS                                04540011
045500                 VARYING DS009-SRCH-IDX                           04550011
045600             AT END                                               04560011
045700                 CONTINUE                                         04570011
045800             WHEN CNTL-TABLE (DS009-SRCH-IDX) = DS002-NAME        04580011
045900                 ADD SQLERRD(3)                                   04590011
046000                        TO DS009-READ-COUNT (DS009-SRCH-IDX)      04600011
046100         END-SEARCH                                               04610011
046200     END-IF.                                                      04620011
046300 EJECT                                                            04630011
046400*                                                                 04640011
046500***************************************************************** 04650011
046600*     DELETE RECORD                                               04660011
046700***************************************************************** 04670011
046800*                                                                 04680011
046900 R100-DELETE.                                                     04690011
047000     PERFORM WITH TEST AFTER                                      04700011
047100             VARYING DS009-RETRY-COUNTER FROM 1 BY 1              04710011
047200             UNTIL   DS009-RETRY-COUNTER > 3 OR                   04720011
047300                     SQLCODE = ZERO OR +100 OR -310 OR -532       04730011
047400                                                                  04740011
047500        EVALUATE TRUE                                             04750011
047600          WHEN DS009-PROCESS-TABLE = 'TPURCHS'                    04760011
047700             EXEC SQL                                             04770011
047800                DELETE FROM TPURCHS                               04780011
047900                WHERE PO_NBR = :HOLD-PO-NBR                       04790011
048000             END-EXEC                                             04800011
048100          WHEN DS009-PROCESS-TABLE = 'TPURITM'                    04810011
048200             EXEC SQL                                             04820011
048300                DELETE FROM TPURITM                               04830011
048400                WHERE PO_NBR = :HOLD-PO-NBR                       04840011
048500             END-EXEC                                             04850011
048600          WHEN DS009-PROCESS-TABLE = 'TPOAGMT'                    04860011
048700             EXEC SQL                                             04870011
048800                DELETE FROM TPOAGMT                               04880011
048900                WHERE PO_NBR = :HOLD-PO-NBR                       04890011
049000             END-EXEC                                             04900011
049100          WHEN DS009-PROCESS-TABLE = 'TPOINST'                    04910011
049200             EXEC SQL                                             04920011
049300                DELETE FROM TPOINST                               04930011
049400                WHERE PO_NBR = :HOLD-PO-NBR                       04940011
049500             END-EXEC                                             04950011
049600          WHEN DS009-PROCESS-TABLE = 'TIMPORL'                    04960011
049700             EXEC SQL                                             04970011
049800                DELETE FROM TIMPORL                               04980011
049900                WHERE PO_NBR = :HOLD-PO-NBR                       04990011
050000             END-EXEC                                             05000011
050100          WHEN DS009-PROCESS-TABLE = 'TALLPLN'                    05010011
050200             EXEC SQL                                             05020011
050300                DELETE FROM TALLPLN                               05030011
050400                WHERE PO_NBR = :HOLD-PO-NBR                       05040011
050500             END-EXEC                                             05050011
050600          WHEN DS009-PROCESS-TABLE = 'TPLNSHP'                    05060011
050700             EXEC SQL                                             05070011
050800                DELETE FROM TPLNSHP                               05080011
050900                WHERE PO_NBR = :HOLD-PO-NBR                       05090011
051000             END-EXEC                                             05100011
051100*         WHEN DS009-PROCESS-TABLE = 'TUPC'                       05110011
051200*            EXEC SQL                                             05120011
051300*               DELETE FROM TUPC                                  05130011
051400*               WHERE UPC_ID = :HOLD-UPC-ID                       05140011
051500*            END-EXEC                                             05150011
051600*         WHEN DS009-PROCESS-TABLE = 'TUPCSKU'                    05160011
051700*            EXEC SQL                                             05170011
051800*               DELETE FROM TUPCSKU                               05180011
051900*               WHERE UPC_NBR = :HOLD-UPC-NBR                     05190011
052000*            END-EXEC                                             05200011
052100*         WHEN DS009-PROCESS-TABLE = 'TUPCPLS'                    05210011
052200*            EXEC SQL                                             05220011
052300*               DELETE FROM TUPCPLS                               05230011
052400*               WHERE UPC_ID  = :HOLD-UPC-ID                      05240011
052500*            END-EXEC                                             05250011
052600*         WHEN DS009-PROCESS-TABLE = 'TSKXREF'                    05260011
052700*            EXEC SQL                                             05270011
052800*               DELETE FROM TSKXREF                               05280011
052900*               WHERE ITM_NBR = :HOLD-ITM-NBR                     05290011
053000*            END-EXEC                                             05300011
053100*            EXEC SQL                                             05310011
053200*               DELETE FROM TSKXREF                               05320011
053300*               WHERE SKU     = :WS-SKXREF-SKU                    05330011
053400*            END-EXEC                                             05340011
053500*         WHEN DS009-PROCESS-TABLE = 'TMDSEAR'                    05350011
053600*            EXEC SQL                                             05360011
053700*               DELETE FROM TMDSEAR                               05370011
053800*               WHERE MDSEAR_DKEY =                               05380011
053900*                    :HOLD-SUB-CL-MDSEAR-ID                       05390011
054000*            END-EXEC                                             05400011
054100*         WHEN DS009-PROCESS-TABLE = 'TMDARVS'                    05410011
054200*            EXEC SQL                                             05420011
054300*               DELETE FROM TMDARVS                               05430011
054400*               WHERE SUB_CL_MDSEAR_ID =                          05440011
054500*                    :HOLD-SUB-CL-MDSEAR-ID                       05450011
054600*            END-EXEC                                             05460011
054700*         WHEN DS009-PROCESS-TABLE = 'TVNDSTL'                    05470011
054800*            EXEC SQL                                             05480011
054900*               DELETE FROM TVNDSTL                               05490011
055000*               WHERE VS_ID = :HOLD-VS-ID                         05500011
055100*            END-EXEC                                             05510011
055200*         WHEN DS009-PROCESS-TABLE = 'TSK'                        05520011
055300*            EXEC SQL                                             05530011
055400*               DELETE FROM TSK                                   05540011
055500*               WHERE (MERCH_DEPT_NMBR                            05550011
055600*                                = :HOLD-MERCH-DEPT-NMBR          05560011
055700*               AND MERCH_CLASS_NMBR                              05570011
055800*                                = :HOLD-MERCH-CLASS-NMBR         05580011
055900*               AND SEQ_NMBR     = :HOLD-SEQ-NMBR)                05590011
056000*               OR  (ITEM_NMBR   = :HOLD-ITEM-NBR)                05600011
056100*            END-EXEC                                             05610011
056200          WHEN DS009-PROCESS-TABLE = 'TINPKSU'                    05620011
056300             EXEC SQL                                             05630011
056400                DELETE FROM TINPKSU                               05640011
056500                WHERE PO_NBR = :HOLD-PO-NBR                       05650011
056600             END-EXEC                                             05660011
056700          WHEN DS009-PROCESS-TABLE = 'TSHUUPC'                    05670011
056800             EXEC SQL                                             05680011
056900                DELETE FROM TSHUUPC                               05690011
057000                WHERE SHIPT_UNT_ID = :HOLD-SHIPT-UNIT-ID          05700011
057100             END-EXEC                                             05710011
057200          WHEN DS009-PROCESS-TABLE = 'TSHPUNT'                    05720011
057300             EXEC SQL                                             05730011
057400                DELETE FROM TSHPUNT                               05740011
057500                WHERE SHIPT_UNT_ID = :HOLD-SHIPT-UNIT-ID          05750011
057600             END-EXEC                                             05760011
057700          WHEN DS009-PROCESS-TABLE = 'TSHUNLO'                    05770011
057800             EXEC SQL                                             05780011
057900                DELETE FROM TSHUNLO                               05790011
058000                WHERE SHIPT_UNT_ID = :HOLD-SHIPT-UNIT-ID          05800011
058100             END-EXEC                                             05810011
058200           WHEN DS009-PROCESS-TABLE = 'TMESTDS'                   05820011
058300             EXEC SQL                                             05830011
058400                DELETE FROM TMESTDS                               05840011
058500                WHERE PO_NBR = :HOLD-PO-NBR                       05850011
058600             END-EXEC                                             05860011
058700*          WHEN DS009-PROCESS-TABLE = 'TEXTENT'                   05870011
058800*            EXEC SQL                                             05880011
058900*               DELETE FROM TEXTENT                               05890011
059000*               WHERE ENT_ID = :HOLD-ENT-ID                       05900011
059100*            END-EXEC                                             05910011
059200*          WHEN DS009-PROCESS-TABLE = 'TENTNME'                   05920011
059300*            EXEC SQL                                             05930011
059400*               DELETE FROM TENTNME                               05940011
059500*               WHERE ENT_ID = :HOLD-ENT-ID                       05950011
059600*            END-EXEC                                             05960011
059700*          WHEN DS009-PROCESS-TABLE = 'TVNDDPT'                   05970011
059800*            EXEC SQL                                             05980011
059900*               DELETE FROM TVNDDPT                               05990011
060000*               WHERE ENT_ID = :HOLD-ENT-ID                       06000011
060100*            END-EXEC                                             06010011
060200           WHEN DS009-PROCESS-TABLE = 'TINSTCD'                   06020011
060300             EXEC SQL                                             06030011
060400                DELETE FROM TINSTCD                               06040011
060500                WHERE INSTR_NBR = :HOLD-INSTR-NBR                 06050011
060600             END-EXEC                                             06060011
060700*          WHEN DS009-PROCESS-TABLE = 'TSPSTDS'                   06070011
060800*            EXEC SQL                                             06080011
060900*               DELETE FROM TSPSTDS                               06090011
061000*               WHERE PO_NBR = :HOLD-PO-NBR                       06100011
061100*            END-EXEC                                             06110011
061200           WHEN DS009-PROCESS-TABLE = 'TTRBNTF'                   06120011
061300             EXEC SQL                                             06130011
061400                DELETE FROM TTRBNTF                               06140011
061500                WHERE PO_NBR = :HOLD-PO-NBR                       06150011
061600             END-EXEC                                             06160011
061700           WHEN DS009-PROCESS-TABLE = 'TTRBDTL'                   06170011
061800             EXEC SQL                                             06180011
061900                DELETE FROM TTRBDTL                               06190011
062000                WHERE NOTIF_NBR = :HOLD-NOTIF-NBR                 06200011
062100             END-EXEC                                             06210011
062200*          WHEN DS009-PROCESS-TABLE = 'TPOUPC'                    06220011
062300*            EXEC SQL                                             06230011
062400*               DELETE FROM TPOUPC                                06240011
062500*               WHERE PO_NBR       = :HOLD-PO-NBR                 06250011
062600*            END-EXEC                                             06260011
062700           WHEN DS009-PROCESS-TABLE = 'TALLTMP'                   06270011
062800             EXEC SQL                                             06280011
062900                DELETE FROM TALLTMP                               06290011
063000                WHERE PO_NBR       = :HOLD-PO-NBR                 06300011
063100             END-EXEC                                             06310011
063200*          WHEN DS009-PROCESS-TABLE = 'TPAYREQ'                   06320011
063300*            EXEC SQL                                             06330011
063400*               DELETE FROM TPAYREQ                               06340011
063500*               WHERE PO_NBR       = :HOLD-PO-NBR                 06350011
063600*            END-EXEC                                             06360011
063700           WHEN DS009-PROCESS-TABLE = 'TASNORD'                   06370011
063800             EXEC SQL                                             06380011
063900                DELETE FROM TASNORD                               06390011
064000                WHERE ASNHDR_ID    = :HOLD-ASNHDR-ID              06400011
064100             END-EXEC                                             06410011
064200           WHEN DS009-PROCESS-TABLE = 'TINVOIC'                   06420011
064300             EXEC SQL                                             06430011
064400              DELETE FROM TINVOIC                                 06440011
064500              WHERE PAYT_REQ_SEQ_NBR = :HOLD-PAYT-REQ-SEQ-NBR     06450011
064600             END-EXEC                                             06460011
064700           WHEN DS009-PROCESS-TABLE = 'TALCHRG'                   06470011
064800             CONTINUE                                             06480011
064900*            EXEC SQL                                             06490011
065000*             DELETE FROM TALCHRG                                 06500011
065100*             WHERE PAYT_REQ_SEQ_NBR = :HOLD-PAYT-REQ-SEQ-NBR     06510011
065200*            END-EXEC                                             06520011
065300           WHEN DS009-PROCESS-TABLE = 'TPREQIT'                   06530011
065400             EXEC SQL                                             06540011
065500              DELETE FROM TPREQIT                                 06550011
065600              WHERE PAYT_REQ_SEQ_NBR = :HOLD-PAYT-REQ-SEQ-NBR     06560011
065700             END-EXEC                                             06570011
065800           WHEN DS009-PROCESS-TABLE = 'TVNDAGR'                   06580011
065900             EXEC SQL                                             06590011
066000                DELETE FROM TVNDAGR                               06600011
066100                WHERE ENT_ID       = :HOLD-ENT-ID                 06610011
066200             END-EXEC                                             06620011
066300           WHEN DS009-PROCESS-TABLE = 'TASNDTL'                   06630011
066400             EXEC SQL                                             06640011
066500                DELETE FROM TASNDTL                               06650011
066600                WHERE ASNHDR_ID    = :HOLD-ASNHDR-ID              06660011
066700             END-EXEC                                             06670011
066800           WHEN DS009-PROCESS-TABLE = 'TASNHDR'                   06680011
066900             EXEC SQL                                             06690011
067000                DELETE FROM TASNHDR                               06700011
067100                WHERE ASNHDR_ID    = :HOLD-ASNHDR-ID              06710011
067200             END-EXEC                                             06720011
067300           WHEN DS009-PROCESS-TABLE = 'TASCRIT'                   06730011
067400             EXEC SQL                                             06740011
067500                DELETE FROM TASCRIT                               06750011
067600                WHERE ASNHDR_ID    = :HOLD-ASNHDR-ID              06760011
067700             END-EXEC                                             06770011
067800           WHEN DS009-PROCESS-TABLE = 'TASNCAR'                   06780011
067900             EXEC SQL                                             06790011
068000                DELETE FROM TASNCAR                               06800011
068100                WHERE ASNHDR_ID    = :HOLD-ASNHDR-ID              06810011
068200             END-EXEC                                             06820011
068300           WHEN DS009-PROCESS-TABLE = 'TASDTPL'                   06830011
068400             EXEC SQL                                             06840011
068500                DELETE FROM TASDTPL                               06850011
068600                WHERE ASNHDR_ID    = :HOLD-ASNHDR-ID              06860011
068700             END-EXEC                                             06870011
068800           WHEN DS009-PROCESS-TABLE = 'TSEASET'                   06880011
068900             EXEC SQL                                             06890011
069000                DELETE FROM TSEASET                               06900011
069100                WHERE SEASET_YR      = :HOLD-SEASET-YR            06910011
069200                  AND SEASET_SHRT_NM = :HOLD-SEASET-SHRT-NM       06920011
069300             END-EXEC                                             06930011
069400                                                                  06940011
069500           WHEN DS009-PROCESS-TABLE = 'TSUNAUD'                   06950011
069600                                                                  06960011
069700*            DELETE DEPENDENT ROWS                                06970011
069800             MOVE 'SUT_AUD_TRLR_TRIP'   TO DS009-PROCESS-TABLE    06980011
069900             EXEC SQL                                             06990011
070000                 DELETE FROM SUT_AUD_TRLR_TRIP                    07000011
070100                 WHERE                                            07010011
070200                      AUD_CNTL_NBR       = :HOLD-AUD-CNTL-NBR     07020011
070300             END-EXEC                                             07030011
070400             PERFORM DS002-SQL-ABEND-DELETE                       07040011
070500                                                                  07050011
070600             MOVE 'SUT_FINCL_ADJ'       TO DS009-PROCESS-TABLE    07060011
070700             EXEC SQL                                             07070011
070800                 DELETE FROM SUT_FINCL_ADJ                        07080011
070900                 WHERE                                            07090011
071000                      AUD_CNTL_NBR       = :HOLD-AUD-CNTL-NBR     07100011
071100             END-EXEC                                             07110011
071200             PERFORM DS002-SQL-ABEND-DELETE                       07120011
071300                                                                  07130011
071400             MOVE 'SUT_PO_AUD_REQ'      TO DS009-PROCESS-TABLE    07140011
071500             EXEC SQL                                             07150011
071600                 DELETE FROM SUT_PO_AUD_REQ                       07160011
071700                 WHERE                                            07170011
071800                      AUD_CNTL_NBR    = :HOLD-AUD-CNTL-NBR        07180011
071900             END-EXEC                                             07190011
072000             PERFORM DS002-SQL-ABEND-DELETE                       07200011
072100                                                                  07210011
072200             MOVE 'TSUQADJ'             TO DS009-PROCESS-TABLE    07220011
072300             EXEC SQL                                             07230011
072400                 DELETE FROM TSUQADJ                              07240011
072500                 WHERE                                            07250011
072600                      AUD_CNTL_NBR    = :HOLD-AUD-CNTL-NBR        07260011
072700             END-EXEC                                             07270011
072800             PERFORM DS002-SQL-ABEND-DELETE                       07280011
072900                                                                  07290011
073000*            DELETE THE PARENT ROW                                07300011
073100             MOVE 'TSUNAUD'             TO DS009-PROCESS-TABLE    07310011
073200             EXEC SQL                                             07320011
073300                DELETE FROM TSUNAUD                               07330011
073400                WHERE AUD_CNTL_NBR   = :HOLD-AUD-CNTL-NBR         07340011
073500             END-EXEC                                             07350011
073600                                                                  07360011
073700           WHEN DS009-PROCESS-TABLE = 'SUT_PO_AUD_REQ'            07370011
073800             EXEC SQL                                             07380011
073900                DELETE FROM SUT_PO_AUD_REQ                        07390011
074000                WHERE PO_NBR   = :HOLD-PO-NBR                     07400011
074100             END-EXEC                                             07410011
074200           WHEN DS009-PROCESS-TABLE = 'TSUATRN'                   07420011
074300             EXEC SQL                                             07430011
074400                DELETE FROM TSUATRN                               07440011
074500                WHERE SHIPT_UNT_ID   = :HOLD-SHIPT-UNIT-ID        07450011
074600             END-EXEC                                             07460011
074700           WHEN DS009-PROCESS-TABLE = 'TSUAUPC'                   07470011
074800             EXEC SQL                                             07480011
074900                DELETE FROM TSUAUPC                               07490011
075000                WHERE                                             07500011
075100                     AUD_CNTL_NBR    = :WS-SUAUPC-AUD-CNTL-NBR    07510011
075200                 AND SHIPT_UNT_ID    = :HOLD-SHIPT-UNIT-ID        07520011
075300                 AND UPC_NBR         = :WS-SUAUPC-UPC-NBR         07530011
075400                 AND SCN_TMST        = :WS-SUAUPC-SCN-TMST        07540011
075500             END-EXEC                                             07550011
075600           WHEN DS009-PROCESS-TABLE = 'TSUEXCP'                   07560011
075700             EXEC SQL                                             07570011
075800                DELETE FROM TSUEXCP                               07580011
075900                 WHERE                                            07590011
076000                     AUD_CNTL_NBR    = :WS-SUEXCP-AUD-CNTL-NBR    07600011
076100                 AND SHIPT_UNT_ID    = :WS-SUEXCP-SHIPT-UNT-ID    07610011
076200                 AND UPC_NBR         = :WS-SUEXCP-UPC-NBR         07620011
076300                 AND SCN_TMST        = :WS-SUEXCP-SCN-TMST        07630011
076400                 AND VILN_GP_CDE     = :WS-SUEXCP-VILN-GP-CDE     07640011
076500                 AND VILN_GP_SEQ_NBR = :WS-SUEXCP-VILN-GP-SEQ-NBR 07650011
076600             END-EXEC                                             07660011
076700           WHEN DS009-PROCESS-TABLE = 'TCTEXCP'                   07670011
076800             EXEC SQL                                             07680011
076900                DELETE FROM TCTEXCP                               07690011
077000                WHERE SHIPT_UNT_ID   = :HOLD-SHIPT-UNIT-ID        07700011
077100             END-EXEC                                             07710011
077200           WHEN DS009-PROCESS-TABLE = 'TIMTBKY'                   07720011
077300             EXEC SQL                                             07730011
077400                DELETE FROM TIMTBKY                               07740011
077500                WHERE NOTIF_NBR      = :HOLD-NOTIF-NBR            07750011
077600             END-EXEC                                             07760011
077700           WHEN DS009-PROCESS-TABLE = 'TPOPRPK'                   07770011
077800             EXEC SQL                                             07780011
077900                DELETE FROM TPOPRPK                               07790011
078000                WHERE PO_NBR       = :HOLD-PO-NBR                 07800011
078100             END-EXEC                                             07810011
078200           WHEN DS009-PROCESS-TABLE = 'TSULBXF'                   07820011
078300             EXEC SQL                                             07830011
078400                DELETE FROM TSULBXF                               07840011
078500                WHERE SHIPT_UNT_ID = :HOLD-SHIPT-UNT-ID           07850011
078600             END-EXEC                                             07860011
078700*          WHEN DS009-PROCESS-TABLE = 'TWEBITM'                   07870011
078800*            EXEC SQL                                             07880011
078900*               DELETE FROM TWEBITM                               07890011
079000*               WHERE INTR_UPC_ID  = :HOLD-INTR-UPC-ID            07900011
079100*            END-EXEC                                             07910011
079200*                                                                 07920011
079300           WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_CART'            07930011
079400*            DELETE DEPENDENT TABLES THAT HAVE RESTRICT RI        07940011
079500             EXEC SQL                                             07950011
079600                DELETE FROM SUT_FINCL_ADJ                         07960011
079700                WHERE SHIPT_UNT_ID = :SUT00024-SHIPT-UNT-ID       07970011
079800             END-EXEC                                             07980011
079900                                                                  07990011
080000             EXEC SQL                                             08000011
080100                DELETE FROM SUT_OTBND_CART                        08010011
080200                WHERE SHIPT_UNT_ID = :SUT00024-SHIPT-UNT-ID       08020011
080300* 9/20/04 DRS   WHERE OTBND_TRIP_ID = :SUT00024-OTBND-TRIP-ID     08030011
080400             END-EXEC                                             08040011
080500                                                                  08050011
080600           WHEN DS009-PROCESS-TABLE = 'TSUOBTR'                   08060011
080700*               DISPLAY 'OTBND_TRIP_ID = ' SUOBTR-OTBND-TRIP-ID   08070011
080800             EXEC SQL                                             08080011
080900                DELETE FROM TSUOBTR                               08090011
081000                WHERE OTBND_TRIP_ID = :SUOBTR-OTBND-TRIP-ID       08100011
081100             END-EXEC                                             08110011
081200             IF SQLCODE = -532                                    08120011
081300                 MOVE SUOBTR-OTBND-TRIP-ID TO PV-DISP-NBR         08130011
081400                 DISPLAY ' SQLCODE = -532 / SUOBTR-TRIP-ID = '    08140011
081500                       PV-DISP-NBR                                08150011
081600             END-IF                                               08160011
081700                                                                  08170011
081800           WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_UPC'             08180011
081900             EXEC SQL                                             08190011
082000                DELETE FROM SUT_OTBND_UPC                         08200011
082100                WHERE                                             08210011
082200                     SHIPT_UNT_ID = :SUT00028-SHIPT-UNT-ID        08220011
082300                 AND TRN_NBR      = :SUT00028-TRN-NBR             08230011
082400                 AND RCVR_SEQ_NBR = :SUT00028-RCVR-SEQ-NBR        08240011
082500                 AND TRN_LNE_NBR  = :SUT00028-TRN-LNE-NBR         08250011
082600                 AND TRN_TYP_CDE  = :SUT00028-TRN-TYP-CDE         08260011
082700                 AND UPC_NBR      = :SUT00028-UPC-NBR             08270011
082800             END-EXEC                                             08280011
082900                                                                  08290011
083000           WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_PKD_UPC'         08300011
083100             EXEC SQL                                             08310011
083200                DELETE FROM SUT_OTBND_PKD_UPC                     08320011
083300                WHERE                                             08330011
083400                     SHIPT_UNT_ID = :SUT00025-SHIPT-UNT-ID        08340011
083500                 AND TRN_NBR      = :SUT00025-TRN-NBR             08350011
083600                 AND RCVR_SEQ_NBR = :SUT00025-RCVR-SEQ-NBR        08360011
083700                 AND TRN_LNE_NBR  = :SUT00025-TRN-LNE-NBR         08370011
083800                 AND TRN_TYP_CDE  = :SUT00025-TRN-TYP-CDE         08380011
083900                 AND UPC_NBR      = :SUT00025-UPC-NBR             08390011
084000                 AND PKD_BY_USR_ID = :SUT00025-PKD-BY-USR-ID      08400011
084100                 AND PKD_TMST     = :SUT00025-PKD-TMST            08410011
084200             END-EXEC                                             08420011
084300                                                                  08430011
084400           WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_LOC'             08440011
084500             EXEC SQL                                             08450011
084600                DELETE FROM SUT_OTBND_LOC                         08460011
084700                WHERE                                             08470011
084800                     SHIPT_UNT_ID = :DS008K-OTBLOC-SHIPT-UNT-ID   08480011
084900                 AND CRE_TMST     = :DS008K-OTBLOC-CRE-TMST       08490011
085000             END-EXEC                                             08500011
085100                                                                  08510011
085200           WHEN DS009-PROCESS-TABLE = 'TSUOBTS'                   08520011
085300             EXEC SQL                                             08530011
085400                 DELETE FROM TSUOBTS                              08540011
085500                 WHERE OTBND_TRIP_ID = :SUOBTS-OTBND-TRIP-ID      08550011
085600             END-EXEC                                             08560011
085700                                                                  08570011
085800           WHEN DS009-PROCESS-TABLE = 'XLT_SKU'                   08580011
085900             MOVE DS008K-XLTSKU-INTR-UPC-ID                       08590011
086000                                   TO XLT00003-INTR-UPC-ID        08600011
086100             MOVE XLT00003-INTR-UPC-ID TO PV-DISP-NBR             08610011
086200*            DISPLAY 'XLT00003-INTR-UPC-ID = ' PV-DISP-NBR        08620011
086300             EXEC SQL                                             08630011
086400                DELETE FROM XLT_SKU                               08640011
086500                WHERE INTR_UPC_ID = :XLT00003-INTR-UPC-ID         08650011
086600             END-EXEC                                             08660011
086700                                                                  08670011
086800           WHEN DS009-PROCESS-TABLE = 'XLT_VND_STYL'              08680011
086900             MOVE DS008K-XLTVNDSTYL-STYL-ID                       08690011
087000                                   TO XLT00004-STYL-ID            08700011
087100*            MOVE XLT00003-INTR-UPC-ID TO PV-DISP-NBR             08710011
087200*            DISPLAY 'XLT_SKU KEY = ' PV-DISP-NBR                 08720011
087300             EXEC SQL                                             08730011
087400                DELETE FROM XLT_VND_STYL                          08740011
087500                WHERE STYL_ID = :XLT00004-STYL-ID                 08750011
087600             END-EXEC                                             08760011
087700                                                                  08770011
087800           WHEN DS009-PROCESS-TABLE = 'XLT_UPC'                   08780011
087900             MOVE DS008K-XLTUPC-UPC-ID                            08790011
088000                                   TO XLT00006-UPC-ID             08800011
088100             MOVE DS008K-XLTUPC-INTR-UPC-ID                       08810011
088200                                   TO XLT00006-INTR-UPC-ID        08820011
088300                                                                  08830011
088400             MOVE XLT00006-UPC-ID TO PV-DISP-NBR                  08840011
088500*            DISPLAY 'XLT00006-UPC-ID      = ' PV-DISP-NBR        08850011
088600*            MOVE XLT00006-INTR-UPC-ID TO PV-DISP-NBR             08860011
088700*            DISPLAY 'XLT00006-INTR-UPC-ID = ' PV-DISP-NBR        08870011
088800                                                                  08880011
088900             EXEC SQL                                             08890011
089000                DELETE FROM XLT_UPC                               08900011
089100                 WHERE INTR_UPC_ID = :XLT00006-INTR-UPC-ID        08910011
089200             END-EXEC                                             08920011
089300                                                                  08930011
089400           WHEN DS009-PROCESS-TABLE = 'SUT_FINCL_ADJ'             08940011
089500             MOVE DS008K-FINCL-ADJ-ID                             08950011
089600                                   TO SUT00030-FINCL-ADJ-ID       08960011
089700*            MOVE SUT00030-FINCL-ADJ-ID TO PV-DISP-NBR            08970011
089800*            DISPLAY 'SUT00030 KEY = ' PV-DISP-NBR                08980011
089900             EXEC SQL                                             08990011
090000                DELETE FROM SUT_FINCL_ADJ                         09000011
090100                WHERE FINCL_ADJ_ID = :SUT00030-FINCL-ADJ-ID       09010011
090200             END-EXEC                                             09020011
090300                                                                  09030011
090400*          DELETE CASCADES ON XLT_PK_UPC AND XLT_PK_CPT_SKU       09040011
090500           WHEN DS009-PROCESS-TABLE = 'XLT_PK'                    09050011
090600             MOVE DS008K-XLT00007-PK-SKU-NBR                      09060011
090700                                   TO XLT00007-PK-SKU-NBR         09070011
090800*            MOVE XLT00007-PK-SKU-NBR TO PV-DISP-NBR              09080011
090900*            DISPLAY 'XLT00007 KEY = ' PV-DISP-NBR                09090011
091000             EXEC SQL                                             09100011
091100                DELETE FROM XLT_PK                                09110011
091200                WHERE PK_SKU_NBR   = :XLT00007-PK-SKU-NBR         09120011
091300             END-EXEC                                             09130011
091400                                                                  09140011
091500           WHEN DS009-PROCESS-TABLE = 'RCT_PO_RCVR_TRKG'          09150011
091600             EXEC SQL                                             09160011
091700                DELETE FROM RCT_PO_RCVR_TRKG                      09170011
091800                WHERE PO_NBR   = :HOLD-PO-NBR                     09180011
091900             END-EXEC                                             09190011
092000                                                                  09200011
092100           WHEN DS009-PROCESS-TABLE = 'WST_SHPMT_XREF_HDR'        09210011
092200             EXEC SQL                                             09220011
092300                DELETE FROM WST_SHPMT_XREF_HDR                    09230011
092400                WHERE EXT_SHP_ID                                  09240011
092500                             = :DS008K-WST00001-EXT-SHP-ID        09250011
092600             END-EXEC                                             09260011
093100                                                                  09261013
066200           WHEN DS009-PROCESS-TABLE = 'TTRDPRT'                   09262013
066300             EXEC SQL                                             09263013
066400                DELETE FROM TTRDPRT                               09264013
066500                WHERE ENT_ID       = :HOLD-ENT-ID                 09265013
066600             END-EXEC                                             09266013
093100                                                                  09267013
066200           WHEN DS009-PROCESS-TABLE = 'TFGTRST'                   09268013
066300             EXEC SQL                                             09269013
066400                DELETE FROM TFGTRST                               09269113
066500                WHERE TP_DKEY      = :HOLD-TP-DKEY                09269213
066600             END-EXEC                                             09269313
093100                                                                  09269413
066200           WHEN DS009-PROCESS-TABLE = 'TINTTRN'                   09269513
066300             EXEC SQL                                             09269613
066400                DELETE FROM TINTTRN                               09269713
066500                WHERE TP_DKEY      = :HOLD-TP-DKEY                09269813
066600             END-EXEC                                             09269913
092700                                                                  09270011
092800        END-EVALUATE                                              09280011
092900     END-PERFORM.                                                 09290011
093000                                                                  09300011
093100     PERFORM DS002-SQL-ABEND-DELETE.                              09310011
093200     PERFORM B101-ADD-TO-DELETE-COUNTS                            09320011
093300                                                                  09330011
093400     PERFORM DS002-COMMIT.                                        09340011
093500                                                                  09350011
093600 R200-DELETE-DEPENDENT-TBLS.                                      09360011
093700                                                                  09370011
093800     MOVE 'TSUOBTS'                   TO DS009-PROCESS-TABLE      09380011
093900     EXEC SQL                                                     09390011
094000         DELETE FROM TSUOBTS                                      09400011
094100         WHERE OTBND_TRIP_ID = :SUOBTR-OTBND-TRIP-ID              09410011
094200     END-EXEC                                                     09420011
094300     PERFORM DS002-SQL-ABEND-DELETE.                              09430011
094400                                                                  09440011
094500     MOVE 'SUT_AUD_TRLR_TRIP'         TO DS009-PROCESS-TABLE      09450011
094600     EXEC SQL                                                     09460011
094700         DELETE FROM SUT_AUD_TRLR_TRIP                            09470011
094800         WHERE                                                    09480011
094900               ORIG_OTBND_TRIP_ID = :SUOBTR-OTBND-TRIP-ID         09490011
095000         OR    DEST_OTBND_TRIP_ID = :SUOBTR-OTBND-TRIP-ID         09500011
095100     END-EXEC                                                     09510011
095200     PERFORM DS002-SQL-ABEND-DELETE.                              09520011
095300                                                                  09530011
095400     MOVE 'TSUCDOT'                   TO DS009-PROCESS-TABLE      09540011
095500     EXEC SQL                                                     09550011
095600         DELETE FROM TSUCDOT                                      09560011
095700         WHERE OTBND_TRIP_ID = :SUOBTR-OTBND-TRIP-ID              09570011
095800     END-EXEC                                                     09580011
095900     PERFORM DS002-SQL-ABEND-DELETE.                              09590011
096000                                                                  09600011
096100*    MOVE 'SUT_OTBND_CART'            TO DS009-PROCESS-TABLE      09610011
096200*    EXEC SQL                                                     09620011
096300*        DELETE FROM SUT_OTBND_CART                               09630011
096400*        WHERE OTBND_TRIP_ID = :SUOBTR-OTBND-TRIP-ID              09640011
096500*    END-EXEC                                                     09650011
096600*    PERFORM DS002-SQL-ABEND-DELETE.                              09660011
096700                                                                  09670011
096800                                                                  09680011
096900*    THERE'S NO INDEX ON OTBND_TRIP_ID                            09690011
097000*    MOVE 'PCT_IN_TRNST_TRN'          TO DS009-PROCESS-TABLE      09700011
097100*    EXEC SQL                                                     09710011
097200*        DELETE FROM PCT_IN_TRNST_TRN                             09720011
097300*        WHERE OTBND_TRIP_ID = :SUOBTR-OTBND-TRIP-ID              09730011
097400*    END-EXEC                                                     09740011
097500     PERFORM DS002-SQL-ABEND-DELETE.                              09750011
097600                                                                  09760011
097700*                                                                 09770011
097800 1100-GET-DB2-INSTANCE.                                           09780011
097900                                                                  09790011
098000     MOVE '1100-GET-DB2-INSTANCE'                                 09800011
098100          TO DS009-PARAGRAPH.                                     09810011
098200     MOVE 'GET DB2 INSTANCE'                                      09820011
098300          TO DS009-OPERATION.                                     09830011
098400                                                                  09840011
098410     EXEC SQL                                                     09841011
098420         SELECT CURRENT SERVER INTO :WS-LOCAL-SERVER              09842011
098430             FROM SYSIBM.SYSDUMMY1 WITH UR                        09843011
098440     END-EXEC.                                                    09844011
098450                                                                  09845011
098460     EVALUATE TRUE                                                09846011
098470         WHEN SQLCODE = +0                                        09847011
098480             CONTINUE                                             09848011
098490         WHEN SQLWARN0 NOT = SPACES                               09849011
098491         WHEN SQLCODE < +0                                        09849111
098492         WHEN SQLCODE > +0                                        09849211
098493             PERFORM DS002-SQL-ERROR                              09849311
098494     END-EVALUATE.                                                09849411
098495*                                                                 09849511
098496 1200-CHECK-IF-PRODUCTION.                                        09849611
098497                                                                  09849711
098498     MOVE '1200-CHECK-IF-PRODUCTION'                              09849811
098499          TO DS009-PARAGRAPH.                                     09849911
098500     MOVE 'SELECT PRDCHK TKRPRPM '                                09850011
098501          TO DS009-OPERATION.                                     09850111
098502                                                                  09850211
098503     EXEC SQL                                                     09850311
098504       SELECT FUNC_TXT                                            09850411
098505         INTO :KRPRPM-FUNC-TXT                                    09850511
098506       FROM   TKRPRPM                                             09850611
098507       WHERE  SYS_PRC_FUNC_CDE  = :PC-PRDCHK                      09850711
098508         AND  INTFC_SYS_CDE     = :PC-KHL                         09850811
098509         AND  LOC_ID            = :PC-90                          09850911
098510         AND  FUNC_TXT          = :PC-PARM-TEXT                   09851011
098511     END-EXEC                                                     09851111
098512                                                                  09851211
098513     EVALUATE TRUE                                                09851311
098514         WHEN SQLCODE = +0                                        09851411
098515             CONTINUE                                             09851511
098516         WHEN SQLCODE = +100                                      09851611
098517             DISPLAY '*******************************************'09851711
098518             DISPLAY '** ABEND - DO NOT RUN THIS DSKUT403 PROGRAM'09851811
098519             DISPLAY '** ABEND - AGAINST PRODUCTION'              09851911
098520             DISPLAY '** ABEND - THIS SHOULD ONLY EVER BE'        09852011
098521             DISPLAY '** ABEND - RUN AGAINST TEST DATA'           09852111
098522             DISPLAY '*******************************************'09852211
098523             DISPLAY '** ABEND - THIS RUN IS GOING AGAINST'       09852311
098524             DISPLAY '** ABEND - DB2 INSTANCE:  '                 09852411
098525                     WS-LOCAL-SERVER                              09852511
098526             DISPLAY '*******************************************'09852611
098527             PERFORM DS002-SQL-ERROR                              09852711
098528                                                                  09852811
098529         WHEN SQLWARN0 NOT = SPACES                               09852911
098530         WHEN SQLCODE < +0                                        09853011
098531         WHEN SQLCODE > +0                                        09853111
098532             PERFORM DS002-SQL-ERROR                              09853211
098533     END-EVALUATE.                                                09853311
098534                                                                  09853411
098535*                                                                 09853511
098536 9000-DUMP-COUNT-TABLE.                                           09853611
098537     CONTINUE.                                                    09853711
098538***************************************************************** 09853811
098539*     PRODUCTION - TO - TEST STANDARD PARAGRAPHS                * 09853911
098540***************************************************************** 09854011
098550     COPY DSPD02Q.                                                09855011
