000100 IDENTIFICATION DIVISION.                                         00010045
000200 PROGRAM-ID.     DSKUT410.                                        00020045
000300 AUTHOR.         RICHARD MOORE.                                   00030045
000400 DATE-WRITTEN.   12/01/98.                                        00040045
000500 DATE-COMPILED.                                                   00050045
000600*************************************************************     00060045
000700*    COBOL 2 WITH SQL          TO QA                        *     00070045
000800*                                                           *     00080045
000900*    INSERT GROUP 3 DATA                                    *     00090045
001000*                                                           *     00100045
001100*************************************************************     00110045
001200* CHANGE LOG:                                               *     00120045
001300*                                                           *     00130045
001400* 08/10/2022  JEAN KURK                  CHG0272895         *     00131045
001400*             REMOVE TABLES TIMBKVS, TIMKBUP, TAUBKVS,      *     00132045
001400*             TAUBKUP, TIMRCVS, TIMRCUP, TAURCUP, TAURCVS   *     00133045
004510* 04/10/2022  JEAN KURK                  CHG0286696         *     00133146
001400*             RECOMPILE FOR UPDATED COPYBOOKS               *     00133246
001400*                                                           *     00134045
001500*************************************************************     00135045
001600                                                                  00136045
001700 ENVIRONMENT DIVISION.                                            00137045
001800                                                                  00138045
001900 INPUT-OUTPUT SECTION.                                            00139045
002000                                                                  00140045
002100 FILE-CONTROL.                                                    00150045
002200                                                                  00160045
002300     SELECT PO-NBR-FILE                                           00170045
002400         ASSIGN         TO UT-S-PO01.                             00180045
002500     SELECT TBLE-FILE                                             00190045
002600         ASSIGN         TO UT-S-TBL01.                            00200045
002700     SELECT CONTROL-FILE                                          00210045
002800         ASSIGN         TO UT-S-CTL01.                            00220045
002900                                                                  00230045
003000 DATA DIVISION.                                                   00240045
003100                                                                  00250045
003200 FILE SECTION.                                                    00260045
003300******************************************************************00270045
003310     COPY DSFD001.                                                00280045
003320******************************************************************00290045
003321                                                                  00300045
003322 WORKING-STORAGE SECTION.                                         00310045
003323                                                                  00320045
003324 01  PC-CONSTANTS.                                                00330045
003325     05  PC-90                       PIC S9(04)    COMP           00331045
003326                                                   VALUE 90.      00332045
003327     05  PC-A                        PIC  X(01)    VALUE 'A'.     00332145
003328     05  PC-Y                        PIC  X(01)    VALUE 'Y'.     00332245
003329     05  PC-RCV                      PIC  X(03)    VALUE 'RCV'.   00332345
003330     05  PC-KHL                      PIC  X(03)    VALUE 'KHL'.   00332445
003331     05  PC-PRDCHK                   PIC  X(06)    VALUE 'PRDCHK'.00332545
003333     05  PC-PARM-TEXT                PIC  X(25)    VALUE          00332645
003334         'LOWER LEVEL ONLY         '.                             00332745
003335     05  PC-CURRENT-PROGRAM-NAME     PIC  X(08)    VALUE          00332845
003336         'DSKUT410'.                                              00332945
003337                                                                  00333045
003338 01  WS-LOCAL-SERVER.                                             00333145
003339     05  WS-SUBSYS                   PIC X(04)  VALUE SPACES.     00333245
003340     05  FILLER                      PIC X(12)  VALUE SPACES.     00333345
003341******************************************************************00333445
003342     COPY DPWS004.                                                00333545
003343******************************************************************00333645
003344     COPY DSWS08Q.                                                00333745
003345******************************************************************00333845
003346     COPY DSWS009.                                                00333945
003347******************************************************************00334045
003348     COPY DSWS10Q.                                                00334145
003349******************************************************************00334245
003350*                                                                 00334345
003352*    USED IS DSPD002                                              00334445
003353     COPY DSRD002.                                                00334545
003354*                                                                 00334645
003360******************************************************************00334745
003361*  COMMUNICATIONS AREA FOR PROD TO TEST UTILITIES                 00334845
003362******************************************************************00334945
003363     COPY DSWS11Q.                                                00335045
003364*                                                                 00336045
003365******************************************************************00336145
003366*LINKAGE SECTION.                                                 00336245
003367******************************************************************00336345
003368*                                                                 00336445
003369 PROCEDURE DIVISION.                                              00336545
003370                                                                  00336645
003380 A100-MAINLINE.                                                   00336745
003382                                                                  00336845
003384     DISPLAY SPACES                                               00336945
003385     DISPLAY ' *** DSKUT410 ***'                                  00337045
003386     DISPLAY SPACES                                               00338045
003388                                                                  00338145
003389     PERFORM 1100-GET-DB2-INSTANCE.                               00338245
003390     PERFORM 1200-CHECK-IF-PRODUCTION.                            00338345
003391                                                                  00338445
003400     SET DS009-I-PGM TO TRUE.                                     00338545
003410     PERFORM DS002-INITIAL-PROCESSING.                            00338645
003420     PERFORM B100-PROCESSING                                      00338745
003430         UNTIL TABLE-EOF.                                         00338845
003440     PERFORM DS002-END-OF-JOB.                                    00338945
003450                                                                  00339045
003460     GOBACK.                                                      00340045
003461 EJECT                                                            00341045
003462                                                                  00342045
003463 B100-PROCESSING.                                                 00343045
003464*                                                                 00344045
003465***************************************************************** 00345045
003466*     FOR EACH TABLE, INSERT DATA INTO THE TABLES                 00346045
003467***************************************************************** 00346145
003468*                                                                 00346245
003469     READ TBLE-FILE                                               00346345
003470         AT END SET TABLE-EOF TO TRUE.                            00346445
003471     IF NOT-TABLE-EOF                                             00346545
003472        MOVE TBLE-DATA-SIZE TO DS009-TBLE-DATA-SIZE               00346645
003473        MOVE TBLE-NAME  TO DS009-PROCESS-TABLE                    00346745
003474        MOVE TBLE-KEYS  TO DS009-PKYS                             00346845
003475        PERFORM DS002-DO-PROCESS                                  00346945
003476        IF DS009-DO-PROCESS                                       00347045
003477        DISPLAY '**********************************'              00347145
003478        DISPLAY DS009-PROCESS-TABLE                               00347245
003479        EVALUATE TRUE                                             00347345
003480         WHEN DS009-PROCESS-TABLE = 'TIMCNPO'                     00347445
003490             MOVE TBLE-DATA-ITEM TO WS-IMCNPO                     00347545
003500             MOVE WS-IMCNPO-PO-NBR  TO HOLD-PO-NBR                00347645
003600             DISPLAY HOLD-PO-NBR                                  00347745
003700             DISPLAY WS-IMCNPO                                    00347845
003800             PERFORM R100-INSERT                                  00347945
003900         WHEN DS009-PROCESS-TABLE = 'TIMBKPO'                     00348045
004000             MOVE TBLE-DATA-ITEM TO WS-IMBKPO                     00349045
004100             MOVE WS-IMBKPO-PO-NBR  TO HOLD-PO-NBR                00350045
004200             DISPLAY HOLD-PO-NBR                                  00360045
004300             DISPLAY WS-IMBKPO                                    00370045
004400             PERFORM R100-INSERT                                  00380045
004500*        WHEN DS009-PROCESS-TABLE = 'TIMBKVS'                     00390045
004600*            MOVE TBLE-DATA-ITEM TO WS-IMBKVS                     00400045
004700*            MOVE WS-IMBKVS-PO-NBR  TO HOLD-PO-NBR                00410045
004800*            DISPLAY HOLD-PO-NBR                                  00420045
004900*            DISPLAY WS-IMBKVS                                    00430045
005000*            PERFORM R100-INSERT                                  00440045
005100*        WHEN DS009-PROCESS-TABLE = 'TIMBKUP'                     00450045
005200*            MOVE TBLE-DATA-ITEM TO WS-IMBKUP                     00460045
005300*            MOVE WS-IMBKUP-PO-NBR  TO HOLD-PO-NBR                00470045
005400*            DISPLAY HOLD-PO-NBR                                  00480045
005500*            DISPLAY WS-IMBKUP                                    00490045
005600*            PERFORM R100-INSERT                                  00500045
005700         WHEN DS009-PROCESS-TABLE = 'TIMRCPO'                     00510045
005800             MOVE TBLE-DATA-ITEM TO WS-IMRCPO                     00520045
005900             MOVE WS-IMRCPO-PO-NBR  TO HOLD-PO-NBR                00530045
006000             DISPLAY HOLD-PO-NBR                                  00540045
006100             DISPLAY WS-IMRCPO                                    00550045
006200             PERFORM R100-INSERT                                  00560045
006300*        WHEN DS009-PROCESS-TABLE = 'TIMRCUP'                     00570045
006400*            MOVE TBLE-DATA-ITEM TO WS-IMRCUP                     00580045
006500*            MOVE WS-IMRCUP-PO-NBR  TO HOLD-PO-NBR                00590045
006600*            DISPLAY HOLD-PO-NBR                                  00600045
006700*            DISPLAY WS-IMRCUP                                    00610045
006800*            PERFORM R100-INSERT                                  00620045
006900*        WHEN DS009-PROCESS-TABLE = 'TIMRCVS'                     00630045
007000*            MOVE TBLE-DATA-ITEM TO WS-IMRCVS                     00640045
007100*            MOVE WS-IMRCVS-PO-NBR  TO HOLD-PO-NBR                00650045
007200*            DISPLAY HOLD-PO-NBR                                  00660045
007300*            DISPLAY WS-IMRCVS                                    00670045
007400*            PERFORM R100-INSERT                                  00680045
007500         WHEN DS009-PROCESS-TABLE = 'TIMCNTK'                     00690045
007600             MOVE TBLE-DATA-ITEM TO WS-IMCNTK                     00700045
007700             MOVE WS-IMCNTK-CONTNR-ID  TO HOLD-CONTNR-ID          00710045
007800             DISPLAY HOLD-CONTNR-ID                               00720045
007900             DISPLAY WS-IMCNTK                                    00730045
008000             PERFORM R100-INSERT                                  00740045
008100         WHEN DS009-PROCESS-TABLE = 'TIMCNUP'                     00750045
008110             DISPLAY 'PROCESSING TIMCNUP'                         00760045
008120             MOVE TBLE-DATA-ITEM TO WS-IMCNUP                     00770045
008130             MOVE WS-IMCNUP-CONTNR-ID  TO HOLD-CONTNR-ID          00780045
008140             DISPLAY HOLD-CONTNR-ID                               00790045
008150             DISPLAY WS-IMCNUP                                    00800045
008160             PERFORM R100-INSERT                                  00810045
008170         WHEN DS009-PROCESS-TABLE = 'TIMCSEN'                     00811045
008180             MOVE TBLE-DATA-ITEM         TO WS-IMCSEN             00812045
008190             MOVE WS-IMCSEN-CSTM-ENTR-ID TO HOLD-CSTM-ENTR-ID     00813045
008200             DISPLAY HOLD-CSTM-ENTR-ID                            00814045
008300             DISPLAY WS-IMCSEN                                    00815045
008400             PERFORM R100-INSERT                                  00816045
008500         WHEN DS009-PROCESS-TABLE = 'TIMCSBL'                     00817045
008600             MOVE TBLE-DATA-ITEM         TO WS-IMCSBL             00818045
008700             MOVE WS-IMCSBL-CSTM-ENTR-ID TO HOLD-CSTM-ENTR-ID     00819045
008800             DISPLAY HOLD-CSTM-ENTR-ID                            00820045
008900             DISPLAY WS-IMCSBL                                    00830045
009000             PERFORM R100-INSERT                                  00840045
009100         WHEN DS009-PROCESS-TABLE = 'TIMCSCN'                     00850045
009200             MOVE TBLE-DATA-ITEM         TO WS-IMCSCN             00860045
009300             MOVE WS-IMCSCN-CSTM-ENTR-ID TO HOLD-CSTM-ENTR-ID     00870045
009400             DISPLAY HOLD-CSTM-ENTR-ID                            00880045
009500             DISPLAY WS-IMCSCN                                    00890045
009600             PERFORM R100-INSERT                                  00900045
009700         WHEN DS009-PROCESS-TABLE = 'TIMCSPO'                     00910045
009800             MOVE TBLE-DATA-ITEM         TO WS-IMCSPO             00920045
009900             MOVE WS-IMCSPO-CSTM-ENTR-ID TO HOLD-CSTM-ENTR-ID     00930045
010000             DISPLAY HOLD-CSTM-ENTR-ID                            00940045
010100             DISPLAY WS-IMCSPO                                    00950045
010200             PERFORM R100-INSERT                                  00960045
010300         WHEN DS009-PROCESS-TABLE = 'TAUCSEN'                     00970045
010400             MOVE TBLE-DATA-ITEM          TO WS-AUCSEN            00980045
010500             MOVE WS-AUCSEN-CSTM-ENTR-ID  TO HOLD-CSTM-ENTR-ID    00990045
010600             DISPLAY HOLD-CSTM-ENTR-ID                            01000045
010700             DISPLAY WS-AUCSEN                                    01010045
010800             PERFORM R100-INSERT                                  01020045
010900         WHEN DS009-PROCESS-TABLE = 'TAUCSBL'                     01030045
011000             MOVE TBLE-DATA-ITEM          TO WS-AUCSBL            01040045
011100             MOVE WS-AUCSBL-CSTM-ENTR-ID  TO HOLD-CSTM-ENTR-ID    01050045
011200             DISPLAY HOLD-CSTM-ENTR-ID                            01060045
011300             DISPLAY WS-AUCSBL                                    01070045
011400             PERFORM R100-INSERT                                  01080045
011500         WHEN DS009-PROCESS-TABLE = 'TAUCSCN'                     01090045
011600             MOVE TBLE-DATA-ITEM          TO WS-AUCSCN            01100045
011700             MOVE WS-AUCSCN-CSTM-ENTR-ID  TO HOLD-CSTM-ENTR-ID    01110045
011800             DISPLAY HOLD-CSTM-ENTR-ID                            01120045
011900             DISPLAY WS-AUCSCN                                    01130045
012000             PERFORM R100-INSERT                                  01140045
012100         WHEN DS009-PROCESS-TABLE = 'TAUCSPO'                     01150045
012200             MOVE TBLE-DATA-ITEM          TO WS-AUCSPO            01160045
012300             MOVE WS-AUCSPO-CSTM-ENTR-ID  TO HOLD-CSTM-ENTR-ID    01170045
012400             DISPLAY HOLD-CSTM-ENTR-ID                            01180045
012500             DISPLAY WS-AUCSPO                                    01190045
012600             PERFORM R100-INSERT                                  01200045
012700         WHEN DS009-PROCESS-TABLE = 'TAURCPO'                     01210045
012800             MOVE TBLE-DATA-ITEM          TO WS-AURCPO            01220045
012900             MOVE WS-AURCPO-PO-NBR        TO HOLD-PO-NBR          01230045
013000             DISPLAY HOLD-PO-NBR                                  01240045
013100             DISPLAY WS-AURCPO                                    01250045
013200             PERFORM R100-INSERT                                  01260045
013300*        WHEN DS009-PROCESS-TABLE = 'TAURCVS'                     01270045
013400*            MOVE TBLE-DATA-ITEM          TO WS-AURCVS            01280045
013500*            MOVE WS-AURCVS-PO-NBR        TO HOLD-PO-NBR          01290045
013600*            DISPLAY HOLD-PO-NBR                                  01300045
013700*            DISPLAY WS-AURCVS                                    01310045
013800*            PERFORM R100-INSERT                                  01320045
013900*        WHEN DS009-PROCESS-TABLE = 'TAURCUP'                     01330045
014000*            MOVE TBLE-DATA-ITEM          TO WS-AURCUP            01340045
014100*            MOVE WS-AURCUP-PO-NBR        TO HOLD-PO-NBR          01350045
014200*            DISPLAY HOLD-PO-NBR                                  01360045
014300*            DISPLAY WS-AURCUP                                    01370045
014400*            PERFORM R100-INSERT                                  01380045
014500         WHEN DS009-PROCESS-TABLE = 'TAUBKPO'                     01390045
014600             MOVE TBLE-DATA-ITEM          TO WS-AUBKPO            01400045
014700             MOVE WS-AUBKPO-PO-NBR        TO HOLD-PO-NBR          01410045
014800             DISPLAY HOLD-PO-NBR                                  01420045
014900             DISPLAY WS-AUBKPO                                    01430045
015000             PERFORM R100-INSERT                                  01440045
015100*        WHEN DS009-PROCESS-TABLE = 'TAUBKVS'                     01450045
015200*            MOVE TBLE-DATA-ITEM          TO WS-AUBKVS            01460045
015300*            MOVE WS-AUBKVS-PO-NBR        TO HOLD-PO-NBR          01470045
015400*            DISPLAY HOLD-PO-NBR                                  01480045
015500*            DISPLAY WS-AUBKVS                                    01490045
015600*            PERFORM R100-INSERT                                  01500045
015700*        WHEN DS009-PROCESS-TABLE = 'TAUBKUP'                     01510045
015800*            MOVE TBLE-DATA-ITEM          TO WS-AUBKUP            01520045
015900*            MOVE WS-AUBKUP-PO-NBR        TO HOLD-PO-NBR          01530045
016000*            DISPLAY HOLD-PO-NBR                                  01540045
016100*            DISPLAY WS-AUBKUP                                    01550045
016200*            PERFORM R100-INSERT                                  01560045
016300         WHEN DS009-PROCESS-TABLE = 'TAUCNPO'                     01570045
016400             MOVE TBLE-DATA-ITEM          TO WS-AUCNPO            01580045
016500             MOVE WS-AUCNPO-PO-NBR        TO HOLD-PO-NBR          01590045
016600             DISPLAY HOLD-PO-NBR                                  01600045
016700             DISPLAY WS-AUCNPO                                    01610045
016800             PERFORM R100-INSERT                                  01620045
016900         WHEN DS009-PROCESS-TABLE = 'TAUCNUP'                     01630045
017000             MOVE TBLE-DATA-ITEM          TO WS-AUCNUP            01640045
017100             MOVE WS-AUCNUP-PO-NBR        TO HOLD-PO-NBR          01650045
017200             DISPLAY HOLD-PO-NBR                                  01660045
017300             DISPLAY WS-AUCNUP                                    01670045
017400             PERFORM R100-INSERT                                  01680045
017500         WHEN DS009-PROCESS-TABLE = 'TAUCNTK'                     01690045
017600             MOVE TBLE-DATA-ITEM           TO WS-AUCNTK           01700045
017700             MOVE WS-AUCNTK-CONTNR-ID      TO HOLD-CONTNR-ID      01710045
017800             MOVE WS-AUCNTK-CONTNR-SEQ-NBR TO HOLD-CONTNR-SEQ-NBR 01720045
017900             DISPLAY HOLD-CONTNR-ID                               01730045
018000             DISPLAY HOLD-CONTNR-SEQ-NBR                          01740045
018100             DISPLAY WS-AUCNTK                                    01750045
018200             PERFORM R100-INSERT                                  01760045
018300         WHEN DS009-PROCESS-TABLE = 'TELCPO'                      01770045
018400             MOVE TBLE-DATA-ITEM          TO WS-ELCPO             01780045
018500             MOVE WS-ELCPO-PO-NBR         TO HOLD-PO-NBR          01790045
018600             DISPLAY HOLD-PO-NBR                                  01800045
018700             DISPLAY WS-ELCPO                                     01810045
018800             PERFORM R100-INSERT                                  01820045
018900         WHEN DS009-PROCESS-TABLE = 'TELCVS'                      01830045
019000             MOVE TBLE-DATA-ITEM          TO WS-ELCVS             01840045
019100             MOVE WS-ELCVS-PO-NBR         TO HOLD-PO-NBR          01850045
019200             DISPLAY HOLD-PO-NBR                                  01860045
019300             DISPLAY WS-ELCVS                                     01870045
019400             PERFORM R100-INSERT                                  01880045
019500         WHEN DS009-PROCESS-TABLE = 'TVSCPT'                      01890045
019600             MOVE TBLE-DATA-ITEM          TO WS-VSCPT             01900045
019700             MOVE WS-VSCPT-PO-NBR         TO HOLD-PO-NBR          01910045
019800             DISPLAY HOLD-PO-NBR                                  01920045
019900             DISPLAY WS-VSCPT                                     01930045
020000             PERFORM R100-INSERT                                  01940045
020100         WHEN DS009-PROCESS-TABLE = 'TIMCNRL'                     01950045
020200             MOVE TBLE-DATA-ITEM TO WS-IMCNRL                     01960045
020300             MOVE WS-IMCNRL-PO-NBR     TO HOLD-PO-NBR             01970045
020400             DISPLAY HOLD-PO-NBR                                  01980045
020500             MOVE WS-IMCNRL-CONTNR-ID  TO HOLD-CONTNR-ID          01990045
020600             DISPLAY HOLD-CONTNR-ID                               02000045
020700             DISPLAY WS-IMCNRL                                    02010045
020800             PERFORM R100-INSERT                                  02020045
020900         WHEN DS009-PROCESS-TABLE = 'TAUCNRL'                     02030045
021000             MOVE TBLE-DATA-ITEM TO WS-AUCNRL                     02040045
021100             MOVE WS-AUCNRL-PO-NBR     TO HOLD-PO-NBR             02050045
021200             DISPLAY HOLD-PO-NBR                                  02060045
021300             MOVE WS-AUCNRL-CONTNR-ID  TO HOLD-CONTNR-ID          02070045
021400             DISPLAY HOLD-CONTNR-ID                               02080045
021500             DISPLAY WS-AUCNRL                                    02090045
021600             PERFORM R100-INSERT                                  02100045
021700         END-EVALUATE                                             02110045
021800         DISPLAY 'RETURN SQLCODE ON INSERT:' SQLCODE              02120045
021900         DISPLAY 'NUMBER OF ROWS INSERTED:' SQLERRD (3)           02130045
022000         IF DS009-UPDATE-COUNT > DS009-COMMIT-COUNT               02140045
022100            EXEC SQL                                              02150045
022200                COMMIT                                            02160045
022300            END-EXEC                                              02170045
022400            IF SQLCODE NOT = ZERO                                 02180045
022500               PERFORM DS002-SQL-ABEND-COMMIT                     02190045
022600            END-IF                                                02200045
022700            MOVE +0  TO DS009-UPDATE-COUNT                        02210045
022800            DISPLAY 'COMMIT TAKEN AFTER RECORD: '                 02220045
022900                                      DS009-TUPDATE-COUNT         02230045
023000         END-IF                                                   02240045
023100         ADD SQLERRD(3) TO DS009-UPDATE-COUNT                     02250045
023200         ADD SQLERRD(3) TO DS009-TUPDATE-COUNT                    02260045
023300        END-IF                                                    02270045
023400     END-IF.                                                      02280045
023500 EJECT                                                            02290045
023600***************************************************************** 02300045
023700*     INSERT SHPTPO DATA                                          02310045
023800***************************************************************** 02320045
023900*                                                                 02330045
024000 R100-INSERT.                                                     02340045
024100*                                                                 02350045
024200     PERFORM WITH TEST AFTER                                      02360045
024300        VARYING DS009-RETRY-COUNTER FROM 1 BY 1                   02370045
024400        UNTIL   DS009-RETRY-COUNTER > 3 OR                        02380045
024500                SQLCODE = ZERO OR -803                            02390045
024600        IF TBLE-VERSION = 01                                      02400045
024700          EVALUATE TRUE                                           02410045
024800          WHEN DS009-PROCESS-TABLE = 'TIMCNPO'                    02420045
024900              EXEC SQL                                            02430045
025000                  INSERT INTO TIMCNPO                             02440045
025100                    (                                             02450045
025200                      CONTNR_ID                                   02460045
025300                     ,CONTNR_SEQ_NBR                              02470045
025400                     ,PO_NBR                                      02480045
025500                     ,CSTM_ENTR_ID                                02490045
025600                     ,MSTR_BOL_NBR                                02500045
025700                     ,HSE_BOL_NBR                                 02510045
025800                     ,LTR_OF_CR_NBR                               02520045
025900                     ,PO_RCVD_DELY_TMST                           02530045
026000                     ,PO_C_O_PROD_CDE                             02540045
026100                     ,PO_CART_CNT                                 02550045
026200                     ,PO_CBMT_QTY                                 02560045
026300                     ,PO_WT_KGRM_QTY                              02570045
026400                     ,PO_UNT_QTY                                  02580045
026700                     ,CRE_BY_USR_ID                               02590045
026800                     ,CRE_TMST                                    02600045
026900                     ,LAST_UPD_BY_USR_ID                          02610045
027000                     ,LAST_UPD_TMST                               02620045
027100                     ,EXTL_REF_NBR                                02630045
027200                     ,BKR_FRGT_RLSE_CDE                           02640045
027300                     ,DO_RCVD_CDE                                 02650045
027400                     ,CONTNR_PU_CDE                               02660045
027500                     ,ACTL_POE_DELY_CDE                           02670045
027600                     ,DVN_CDE                                     02680045
027700                     ,DCONSLR_RET_CDE                             02690045
027800                     ,SPLT_XMIT_CDE                               02700045
027900                    )                                             02710045
028000                  VALUES (                                        02720045
028100                     :WS-IMCNPO-CONTNR-ID                         02730045
028200                    ,:WS-IMCNPO-CONTNR-SEQ-NBR                    02740045
028300                    ,:WS-IMCNPO-PO-NBR                            02750045
028400                    ,:WS-IMCNPO-CSTM-ENTR-ID                      02760045
028500                    ,:WS-IMCNPO-MSTR-BOL-NBR                      02770045
028600                    ,:WS-IMCNPO-HSE-BOL-NBR                       02780045
028700                    ,:WS-IMCNPO-LTR-OF-CR-NBR                     02790045
028800                    ,:WS-IMCNPO-PO-RCVD-DELY-TMST                 02800045
028900                    ,:WS-IMCNPO-PO-C-O-PROD-CDE                   02810045
029000                    ,:WS-IMCNPO-PO-CART-CNT                       02820045
029100                    ,:WS-IMCNPO-PO-CBMT-QTY                       02830045
029200                    ,:WS-IMCNPO-PO-WT-KGRM-QTY                    02840045
029300                    ,:WS-IMCNPO-PO-UNT-QTY                        02850045
029600                    ,:WS-IMCNPO-CRE-BY-USR-ID                     02860045
029700                    ,:WS-IMCNPO-CRE-TMST                          02870045
029800                    ,:WS-IMCNPO-LAST-UPD-BY-USR-ID                02880045
029900                    ,:WS-IMCNPO-LAST-UPD-TMST                     02890045
030000                    ,:WS-IMCNPO-EXTL-REF-NBR                      02900045
030100                    ,:WS-IMCNPO-BKR-FRGT-RLSE-CDE                 02910045
030200                    ,:WS-IMCNPO-DO-RCVD-CDE                       02920045
030300                    ,:WS-IMCNPO-CONTNR-PU-CDE                     02930045
030400                    ,:WS-IMCNPO-ACTL-POE-DELY-CDE                 02940045
030500                    ,:WS-IMCNPO-DVN-CDE                           02950045
030600                    ,:WS-IMCNPO-DCONSLR-RET-CDE                   02960045
030700                    ,:WS-IMCNPO-SPLT-XMIT-CDE                     02970045
030800                     )                                            02980045
030900              END-EXEC                                            02990045
031000          WHEN DS009-PROCESS-TABLE = 'TIMBKPO'                    03000045
031100              EXEC SQL                                            03010045
031200                  INSERT INTO TIMBKPO                             03020045
031300                    (                                             03030045
031400                      PO_NBR                                      03040045
031500                     ,PO_BKG_SEQ_NBR                              03050045
031600                     ,PO_BKG_DELY_TMST                            03060045
031700                     ,EXTL_REF_NBR                                03070045
031800                     ,ORGN_SHPD_FR_CDE                            03080045
031900                     ,CONSLR_SCAC_ID                              03090045
032000                     ,IMPRT_TRIP_ID                               03100045
032100                     ,DPRTR_TMST                                  03110045
032200                     ,POE_DELY_TMST                               03120045
032300                     ,CARR_SCAC_ID                                03130045
032400                     ,FOB_CDE                                     03140045
032500                     ,IMPRT_VEH_NM                                03150045
032600                     ,TRIP_TYP_CDE                                03160045
032700                     ,DEST_POE_CDE                                03170045
032800                     ,C_O_PROD_CDE                                03180045
032900                     ,PROD_FCTRY_NM                               03190045
033000                     ,PO_CART_CNT                                 03200045
033100                     ,PO_CBMT_QTY                                 03210045
033200                     ,PO_WT_KGRM_QTY                              03220045
033300                     ,PO_UNT_QTY                                  03230045
033400                     ,PO_EXC_APVL_CDE                             03240045
033500                     ,PO_EXC_APVL_USR_ID                          03250045
033600                     ,PO_EXC_APVL_TMST                            03260045
033700                     ,PO_EXC_RSN_DESC                             03270045
033800                     ,EST_LBD_NM                                  03280045
033900                     ,EST_LBD_TMST                                03290045
034000                     ,SHIPT_BKG_TMST                              03300045
034100                     ,VOY_CHG_RSN_DESC                            03310045
034200                     ,DAT_SRC_ENT_ID                              03320045
034201                     ,CRE_BY_USR_ID                               03330045
034202                     ,CRE_TMST                                    03340045
034203                     ,LAST_UPD_BY_USR_ID                          03350045
034204                     ,LAST_UPD_TMST                               03360045
034205                    )                                             03370045
034206                  VALUES (                                        03380045
034207                      :WS-IMBKPO-PO-NBR                           03390045
034208                     ,:WS-IMBKPO-PO-BKG-SEQ-NBR                   03400045
034209                     ,:WS-IMBKPO-PO-BKG-DELY-TMST                 03410045
034210                     ,:WS-IMBKPO-EXTL-REF-NBR                     03420045
034211                     ,:WS-IMBKPO-ORGN-SHPD-FR-CDE                 03421045
034212                     ,:WS-IMBKPO-CONSLR-SCAC-ID                   03421145
034213                     ,:WS-IMBKPO-IMPRT-TRIP-ID                    03421245
034214                     ,:WS-IMBKPO-DPRTR-TMST                       03421345
034215                     ,:WS-IMBKPO-POE-DELY-TMST                    03421445
034216                     ,:WS-IMBKPO-CARR-SCAC-ID                     03421545
034217                     ,:WS-IMBKPO-FOB-CDE                          03421645
034218                     ,:WS-IMBKPO-IMPRT-VEH-NM                     03421745
034219                     ,:WS-IMBKPO-TRIP-TYP-CDE                     03421845
034220                     ,:WS-IMBKPO-DEST-POE-CDE                     03421945
034221                     ,:WS-IMBKPO-C-O-PROD-CDE                     03422045
034222                     ,:WS-IMBKPO-PROD-FCTRY-NM                    03422145
034223                     ,:WS-IMBKPO-PO-CART-CNT                      03422245
034224                     ,:WS-IMBKPO-PO-CBMT-QTY                      03422345
034225                     ,:WS-IMBKPO-PO-WT-KGRM-QTY                   03422445
034226                     ,:WS-IMBKPO-PO-UNT-QTY                       03422545
034227                     ,:WS-IMBKPO-PO-EXC-APVL-CDE                  03422645
034228                     ,:WS-IMBKPO-PO-EXC-APVL-USR-ID               03422745
034229                     ,:WS-IMBKPO-PO-EXC-APVL-TMST                 03422845
034230                     ,:WS-IMBKPO-PO-EXC-RSN-DESC                  03422945
034231                     ,:WS-IMBKPO-EST-LBD-NM                       03423045
034232                     ,:WS-IMBKPO-EST-LBD-TMST                     03423145
034233                     ,:WS-IMBKPO-SHIPT-BKG-TMST                   03423245
034234                     ,:WS-IMBKPO-VOY-CHG-RSN-DESC                 03423345
034235                     ,:WS-IMBKPO-DAT-SRC-ENT-ID                   03423445
034236                     ,:WS-IMBKPO-CRE-BY-USR-ID                    03423545
034237                     ,:WS-IMBKPO-CRE-TMST                         03423645
034238                     ,:WS-IMBKPO-LAST-UPD-BY-USR-ID               03423745
034239                     ,:WS-IMBKPO-LAST-UPD-TMST                    03423845
034240                     )                                            03423945
034241              END-EXEC                                            03424045
034242*         WHEN DS009-PROCESS-TABLE = 'TIMBKVS'                    03424145
034243*             EXEC SQL                                            03424245
034244*                 INSERT INTO TIMBKVS                             03424345
034245*                   (                                             03424445
034246*                     PO_NBR                                      03424545
034247*                    ,PO_BKG_SEQ_NBR                              03424645
034248*                    ,VS_NBR                                      03424745
034249*                    ,HTS_ID                                      03424845
034250*                    ,VS_CART_CNT                                 03424945
034251*                    ,VS_CBMT_QTY                                 03425045
034252*                    ,VS_WT_KGRM_QTY                              03425145
034253*                    ,VS_UNT_QTY                                  03425245
034254*                    ,QTA_CTG_IND                                 03425345
034255*                    ,CRE_BY_USR_ID                               03425445
034256*                    ,CRE_TMST                                    03425545
034257*                    ,LAST_UPD_BY_USR_ID                          03425645
034258*                    ,LAST_UPD_TMST                               03425745
034259*                   )                                             03425845
034260*                 VALUES (                                        03425945
034261*                     :WS-IMBKVS-PO-NBR                           03426045
034262*                    ,:WS-IMBKVS-PO-BKG-SEQ-NBR                   03426145
034263*                    ,:WS-IMBKVS-VS-NBR                           03426245
034264*                    ,:WS-IMBKVS-HTS-ID                           03426345
034265*                    ,:WS-IMBKVS-VS-CART-CNT                      03426445
034266*                    ,:WS-IMBKVS-VS-CBMT-QTY                      03426545
034267*                    ,:WS-IMBKVS-VS-WT-KGRM-QTY                   03426645
034268*                    ,:WS-IMBKVS-VS-UNT-QTY                       03426745
034269*                    ,:WS-IMBKVS-QTA-CTG-IND                      03426845
034270*                    ,:WS-IMBKVS-CRE-BY-USR-ID                    03426945
034271*                    ,:WS-IMBKVS-CRE-TMST                         03427045
034272*                    ,:WS-IMBKVS-LAST-UPD-BY-USR-ID               03427145
034273*                    ,:WS-IMBKVS-LAST-UPD-TMST                    03427245
034274*                    )                                            03427345
034275*             END-EXEC                                            03427445
034276*         WHEN DS009-PROCESS-TABLE = 'TIMBKUP'                    03427545
034277*             EXEC SQL                                            03427645
034278*                 INSERT INTO TIMBKUP                             03427745
034279*                   (                                             03427845
034280*                     PO_NBR                                      03427945
034281*                    ,PO_BKG_SEQ_NBR                              03428045
034282*                    ,VS_NBR                                      03428145
034283*                    ,UPC_NBR                                     03428245
034284*                    ,UPC_CART_CNT                                03428345
034285*                    ,UPC_CBMT_QTY                                03428445
034286*                    ,UPC_WT_KGRM_QTY                             03428545
034287*                    ,UPC_UNT_QTY                                 03428645
034288*                    ,CRE_BY_USR_ID                               03428745
034289*                    ,CRE_TMST                                    03428845
034290*                    ,LAST_UPD_BY_USR_ID                          03428945
034291*                    ,LAST_UPD_TMST                               03429045
034292*                   )                                             03429145
034293*                 VALUES (                                        03429245
034294*                     :WS-IMBKUP-PO-NBR                           03429345
034295*                    ,:WS-IMBKUP-PO-BKG-SEQ-NBR                   03429445
034296*                    ,:WS-IMBKUP-VS-NBR                           03429545
034297*                    ,:WS-IMBKUP-UPC-NBR                          03429645
034298*                    ,:WS-IMBKUP-UPC-CART-CNT                     03429745
034299*                    ,:WS-IMBKUP-UPC-CBMT-QTY                     03429845
034300*                    ,:WS-IMBKUP-UPC-WT-KGRM-QTY                  03429945
034301*                    ,:WS-IMBKUP-UPC-UNT-QTY                      03430045
034302*                    ,:WS-IMBKUP-CRE-BY-USR-ID                    03430145
034303*                    ,:WS-IMBKUP-CRE-TMST                         03430245
034304*                    ,:WS-IMBKUP-LAST-UPD-BY-USR-ID               03430345
034305*                    ,:WS-IMBKUP-LAST-UPD-TMST                    03430445
034306*                    )                                            03430545
034307*             END-EXEC                                            03430645
034308          WHEN DS009-PROCESS-TABLE = 'TIMRCPO'                    03430745
034309              EXEC SQL                                            03430845
034310                  INSERT INTO TIMRCPO                             03430945
034311                    (                                             03431045
034312                      PO_NBR                                      03431145
034313                     ,PO_RCVD_SEQ_NBR                             03431245
034314                     ,PO_RCVD_DELY_TMST                           03431345
034315                     ,EXTL_REF_NBR                                03431445
034316                     ,ORGN_SHPD_FR_CDE                            03431545
034317                     ,CONSLR_SCAC_ID                              03431645
034318                     ,IMPRT_TRIP_ID                               03431745
034319                     ,DPRTR_TMST                                  03431845
034320                     ,POE_DELY_TMST                               03431945
034321                     ,CARR_SCAC_ID                                03432045
034322                     ,FOB_CDE                                     03432145
034323                     ,IMPRT_VEH_NM                                03432245
034324                     ,TRIP_TYP_CDE                                03432345
034325                     ,DEST_POE_CDE                                03432445
034326                     ,C_O_PROD_CDE                                03432545
034327                     ,PROD_FCTRY_NM                               03432645
034328                     ,PO_CART_CNT                                 03432745
034329                     ,PO_CBMT_QTY                                 03432845
034330                     ,PO_WT_KGRM_QTY                              03432945
034331                     ,PO_UNT_QTY                                  03433045
034332                     ,PO_EXC_APVL_CDE                             03433145
034333                     ,PO_EXC_APVL_USR_ID                          03433245
034334                     ,PO_EXC_APVL_TMST                            03433345
034335                     ,PO_EXC_RSN_DESC                             03433445
034336                     ,EST_LBD_NM                                  03433545
034337                     ,EST_LBD_TMST                                03433645
034338                     ,VOY_CHG_RSN_DESC                            03433745
034339                     ,DAT_SRC_ENT_ID                              03433845
034340                     ,CRE_BY_USR_ID                               03433945
034341                     ,CRE_TMST                                    03434045
034342                     ,LAST_UPD_BY_USR_ID                          03434145
034343                     ,LAST_UPD_TMST                               03434245
034344                    )                                             03434345
034345                  VALUES (                                        03434445
034346                      :WS-IMRCPO-PO-NBR                           03434545
034347                     ,:WS-IMRCPO-PO-RCVD-SEQ-NBR                  03434645
034348                     ,:WS-IMRCPO-PO-RCVD-DELY-TMST                03434745
034349                     ,:WS-IMRCPO-EXTL-REF-NBR                     03434845
034350                     ,:WS-IMRCPO-ORGN-SHPD-FR-CDE                 03434945
034351                     ,:WS-IMRCPO-CONSLR-SCAC-ID                   03435045
034352                     ,:WS-IMRCPO-IMPRT-TRIP-ID                    03435145
034353                     ,:WS-IMRCPO-DPRTR-TMST                       03435245
034354                     ,:WS-IMRCPO-POE-DELY-TMST                    03435345
034355                     ,:WS-IMRCPO-CARR-SCAC-ID                     03435445
034356                     ,:WS-IMRCPO-FOB-CDE                          03435545
034357                     ,:WS-IMRCPO-IMPRT-VEH-NM                     03435645
034358                     ,:WS-IMRCPO-TRIP-TYP-CDE                     03435745
034359                     ,:WS-IMRCPO-DEST-POE-CDE                     03435845
034360                     ,:WS-IMRCPO-C-O-PROD-CDE                     03435945
034361                     ,:WS-IMRCPO-PROD-FCTRY-NM                    03436045
034362                     ,:WS-IMRCPO-PO-CART-CNT                      03436145
034363                     ,:WS-IMRCPO-PO-CBMT-QTY                      03436245
034364                     ,:WS-IMRCPO-PO-WT-KGRM-QTY                   03436345
034365                     ,:WS-IMRCPO-PO-UNT-QTY                       03436445
034366                     ,:WS-IMRCPO-PO-EXC-APVL-CDE                  03436545
034367                     ,:WS-IMRCPO-PO-EXC-APVL-USR-ID               03436645
034368                     ,:WS-IMRCPO-PO-EXC-APVL-TMST                 03436745
034369                     ,:WS-IMRCPO-PO-EXC-RSN-DESC                  03436845
034370                     ,:WS-IMRCPO-EST-LBD-NM                       03436945
034371                     ,:WS-IMRCPO-EST-LBD-TMST                     03437045
034372                     ,:WS-IMRCPO-VOY-CHG-RSN-DESC                 03437145
034373                     ,:WS-IMRCPO-DAT-SRC-ENT-ID                   03437245
034374                     ,:WS-IMRCPO-CRE-BY-USR-ID                    03437345
034375                     ,:WS-IMRCPO-CRE-TMST                         03437445
034376                     ,:WS-IMRCPO-LAST-UPD-BY-USR-ID               03437545
034377                     ,:WS-IMRCPO-LAST-UPD-TMST                    03437645
034378                     )                                            03437745
034379              END-EXEC                                            03437845
034380*         WHEN DS009-PROCESS-TABLE = 'TIMRCUP'                    03437945
034381*             EXEC SQL                                            03438045
034382*                 INSERT INTO TIMRCUP                             03438145
034383*                   (                                             03438245
034384*                     PO_NBR                                      03438345
034385*                    ,PO_RCVD_SEQ_NBR                             03438445
034386*                    ,VS_NBR                                      03438545
034387*                    ,UPC_NBR                                     03438645
034388*                    ,UPC_CART_CNT                                03438745
034389*                    ,UPC_CBMT_QTY                                03438845
034390*                    ,UPC_WT_KGRM_QTY                             03438945
034391*                    ,UPC_UNT_QTY                                 03439045
034392*                    ,CRE_BY_USR_ID                               03439145
034393*                    ,CRE_TMST                                    03439245
034394*                    ,LAST_UPD_BY_USR_ID                          03439345
034395*                    ,LAST_UPD_TMST                               03439445
034396*                   )                                             03439545
034397*                 VALUES (                                        03439645
034398*                     :WS-IMRCUP-PO-NBR                           03439745
034399*                    ,:WS-IMRCUP-PO-RCVD-SEQ-NBR                  03439845
034400*                    ,:WS-IMRCUP-VS-NBR                           03439945
034401*                    ,:WS-IMRCUP-UPC-NBR                          03440045
034402*                    ,:WS-IMRCUP-UPC-CART-CNT                     03440145
034403*                    ,:WS-IMRCUP-UPC-CBMT-QTY                     03440245
034404*                    ,:WS-IMRCUP-UPC-WT-KGRM-QTY                  03440345
034405*                    ,:WS-IMRCUP-UPC-UNT-QTY                      03440445
034406*                    ,:WS-IMRCUP-CRE-BY-USR-ID                    03440545
034407*                    ,:WS-IMRCUP-CRE-TMST                         03440645
034408*                    ,:WS-IMRCUP-LAST-UPD-BY-USR-ID               03440745
034409*                    ,:WS-IMRCUP-LAST-UPD-TMST                    03440845
034410*                    )                                            03440945
034411*             END-EXEC                                            03441045
034412*         WHEN DS009-PROCESS-TABLE = 'TIMRCVS'                    03441145
034413*             EXEC SQL                                            03441245
034414*                 INSERT INTO TIMRCVS                             03441345
034415*                   (                                             03441445
034416*                     PO_NBR                                      03441545
034417*                    ,PO_RCVD_SEQ_NBR                             03441645
034418*                    ,VS_NBR                                      03441745
034419*                    ,HTS_ID                                      03441845
034420*                    ,VS_CART_CNT                                 03441945
034421*                    ,VS_CBMT_QTY                                 03442045
034422*                    ,VS_WT_KGRM_QTY                              03442145
034423*                    ,VS_UNT_QTY                                  03442245
034424*                    ,QTA_CTG_IND                                 03442345
034425*                    ,CRE_BY_USR_ID                               03442445
034426*                    ,CRE_TMST                                    03442545
034427*                    ,LAST_UPD_BY_USR_ID                          03442645
034428*                    ,LAST_UPD_TMST                               03442745
034429*                   )                                             03442845
034430*                 VALUES (                                        03442945
034431*                     :WS-IMRCVS-PO-NBR                           03443045
034432*                    ,:WS-IMRCVS-PO-RCVD-SEQ-NBR                  03443145
034433*                    ,:WS-IMRCVS-VS-NBR                           03443245
034434*                    ,:WS-IMRCVS-HTS-ID                           03443345
034435*                    ,:WS-IMRCVS-VS-CART-CNT                      03443445
034436*                    ,:WS-IMRCVS-VS-CBMT-QTY                      03443545
034437*                    ,:WS-IMRCVS-VS-WT-KGRM-QTY                   03443645
034438*                    ,:WS-IMRCVS-VS-UNT-QTY                       03443745
034439*                    ,:WS-IMRCVS-QTA-CTG-IND                      03443845
034440*                    ,:WS-IMRCVS-CRE-BY-USR-ID                    03443945
034441*                    ,:WS-IMRCVS-CRE-TMST                         03444045
034442*                    ,:WS-IMRCVS-LAST-UPD-BY-USR-ID               03444145
034443*                    ,:WS-IMRCVS-LAST-UPD-TMST                    03444245
034444*                    )                                            03444345
034445*             END-EXEC                                            03444445
034446          WHEN DS009-PROCESS-TABLE = 'TIMCNUP'                    03444545
034447              EXEC SQL                                            03444645
034448                  INSERT INTO TIMCNUP                             03444745
034449                    (                                             03444845
034450                      CONTNR_ID                                   03444945
034451                     ,CONTNR_SEQ_NBR                              03445045
034452                     ,PO_NBR                                      03445145
034453                     ,VS_NBR                                      03445245
034454                     ,UPC_NBR                                     03445345
034455                     ,PO_LNE_NBR                                  03445445
034456                     ,UPC_CART_CNT                                03445545
034457                     ,UPC_CBMT_QTY                                03445645
034458                     ,UPC_WT_KGRM_QTY                             03445745
034459                     ,UPC_UNT_QTY                                 03445845
034463                     ,CRE_BY_USR_ID                               03445945
034464                     ,CRE_TMST                                    03446045
034465                     ,LAST_UPD_BY_USR_ID                          03446145
034466                     ,LAST_UPD_TMST                               03446245
034467                     ,SKU_NBR                                     03446345
034468                     ,ASN_PKGNG_CDE                               03446445
034470                    )                                             03446545
034471                  VALUES (                                        03446645
034472                      :WS-IMCNUP-CONTNR-ID                        03446745
034473                     ,:WS-IMCNUP-CONTNR-SEQ-NBR                   03446845
034474                     ,:WS-IMCNUP-PO-NBR                           03446945
034475                     ,:WS-IMCNUP-VS-NBR                           03447045
034476                     ,:WS-IMCNUP-UPC-NBR                          03447145
034477                     ,:WS-IMCNUP-PO-LNE-NBR                       03447245
034478                     ,:WS-IMCNUP-UPC-CART-CNT                     03447345
034479                     ,:WS-IMCNUP-UPC-CBMT-QTY                     03447445
034480                     ,:WS-IMCNUP-UPC-WT-KGRM-QTY                  03447545
034481                     ,:WS-IMCNUP-UPC-UNT-QTY                      03447645
034485                     ,:WS-IMCNUP-CRE-BY-USR-ID                    03447745
034486                     ,:WS-IMCNUP-CRE-TMST                         03447845
034487                     ,:WS-IMCNUP-LAST-UPD-BY-USR-ID               03447945
034488                     ,:WS-IMCNUP-LAST-UPD-TMST                    03448045
034489                     ,:WS-IMCNUP-SKU-NBR                          03448145
034490                     ,:WS-IMCNUP-ASN-PKGNG-CDE                    03448245
034492                     )                                            03448345
034493              END-EXEC                                            03448445
034494          WHEN DS009-PROCESS-TABLE = 'TIMCNTK'                    03448545
034495              EXEC SQL                                            03448645
034496                  INSERT INTO TIMCNTK                             03448745
034497                    (                                             03448845
034498                      CONTNR_ID                                   03448945
034499                     ,CONTNR_SEQ_NBR                              03449045
034510                     ,CONSLR_SCAC_ID                              03450045
034520                     ,MOM_IMPRT_TRIP_ID                           03451045
034530                     ,MOM_DPRTR_TMST                              03452045
034531                     ,MOM_POE_DELY_TMST                           03453045
034532                     ,MOM_CARR_SCAC_ID                            03453145
034533                     ,MOM_POL_CDE                                 03453245
034534                     ,MOM_IMPRT_VEH_NM                            03453345
034535                     ,MOM_TRIP_TYP_CDE                            03453445
034536                     ,MOM_DEST_POE_CDE                            03453545
034537                     ,FDR_IMPRT_TRIP_ID                           03453645
034538                     ,FDR_DPRTR_TMST                              03453745
034539                     ,FDR_POE_DELY_TMST                           03453845
034540                     ,FDR_CARR_SCAC_ID                            03453945
034541                     ,FDR_POL_CDE                                 03454045
034542                     ,FDR_IMPRT_VEH_NM                            03454145
034543                     ,FDR_TRIP_TYP_CDE                            03454245
034544                     ,FDR_DEST_POE_CDE                            03454345
034545                     ,SIZE_CDE                                    03454445
034546                     ,CART_CNT                                    03454545
034547                     ,CBMT_QTY                                    03454645
034548                     ,WT_KGRM_QTY                                 03454745
034549                     ,UNT_QTY                                     03454845
034552                     ,ORGN_SHPD_FR_CDE                            03454945
034553                     ,ORGN_SHPD_TO_CDE                            03455045
034554                     ,EST_LBD_NM                                  03455145
034555                     ,EST_LBD_TMST                                03455245
034556                     ,RISU_DO_RSN_CDE                             03455345
034557                     ,BKR_FRGT_RLSE_TMST                          03455445
034558                     ,DO_TO_DCONSLR_TMST                          03455545
034559                     ,DO_RCVD_TMST                                03455645
034560                     ,CONTNR_PU_TMST                              03455745
034561                     ,DAT_SRC_ENT_ID                              03455845
034562                     ,CRE_BY_USR_ID                               03455945
034563                     ,CRE_TMST                                    03456045
034564                     ,LAST_UPD_BY_USR_ID                          03456145
034565                     ,LAST_UPD_TMST                               03456245
034566                     ,ACTL_POE_DELY_TMST                          03456345
034567                     ,ACTL_DEST_POE_CDE                           03456445
034568                     ,ACTL_LBD_NM                                 03456545
034569                     ,ACTL_LBD_TMST                               03456645
034570                     ,DVN_TMST                                    03456745
034571                     ,DCONSLR_SCAC_ID                             03456845
034572                     ,DCONSLR_RET_TMST                            03456945
034573                    )                                             03457045
034574                  VALUES (                                        03457145
034575                      :WS-IMCNTK-CONTNR-ID                        03457245
034576                     ,:WS-IMCNTK-CONTNR-SEQ-NBR                   03457345
034578                     ,:WS-IMCNTK-CONSLR-SCAC-ID                   03457445
034579                     ,:WS-IMCNTK-MOM-IMPRT-TRIP-ID                03457545
034580                     ,:WS-IMCNTK-MOM-DPRTR-TMST                   03457645
034581                     ,:WS-IMCNTK-MOM-POE-DELY-TMST                03457745
034582                     ,:WS-IMCNTK-MOM-CARR-SCAC-ID                 03457845
034583                     ,:WS-IMCNTK-MOM-POL-CDE                      03457945
034584                     ,:WS-IMCNTK-MOM-IMPRT-VEH-NM                 03458045
034585                     ,:WS-IMCNTK-MOM-TRIP-TYP-CDE                 03458145
034586                     ,:WS-IMCNTK-MOM-DEST-POE-CDE                 03458245
034587                     ,:WS-IMCNTK-FDR-IMPRT-TRIP-ID                03458345
034588                     ,:WS-IMCNTK-FDR-DPRTR-TMST                   03458445
034589                     ,:WS-IMCNTK-FDR-POE-DELY-TMST                03458545
034590                     ,:WS-IMCNTK-FDR-CARR-SCAC-ID                 03458645
034591                     ,:WS-IMCNTK-FDR-POL-CDE                      03458745
034592                     ,:WS-IMCNTK-FDR-IMPRT-VEH-NM                 03458845
034593                     ,:WS-IMCNTK-FDR-TRIP-TYP-CDE                 03458945
034594                     ,:WS-IMCNTK-FDR-DEST-POE-CDE                 03459045
034595                     ,:WS-IMCNTK-SIZE-CDE                         03459145
034596                     ,:WS-IMCNTK-CART-CNT                         03459245
034597                     ,:WS-IMCNTK-CBMT-QTY                         03459345
034598                     ,:WS-IMCNTK-WT-KGRM-QTY                      03459445
034599                     ,:WS-IMCNTK-UNT-QTY                          03459545
034602                     ,:WS-IMCNTK-ORGN-SHPD-FR-CDE                 03459645
034603                     ,:WS-IMCNTK-ORGN-SHPD-TO-CDE                 03459745
034604                     ,:WS-IMCNTK-EST-LBD-NM                       03459845
034605                     ,:WS-IMCNTK-EST-LBD-TMST                     03459945
034606                     ,:WS-IMCNTK-RISU-DO-RSN-CDE                  03460045
034607                     ,:WS-IMCNTK-BKR-FRGT-RLSE-TMST               03460145
034608                     ,:WS-IMCNTK-DO-TO-DCONSLR-TMST               03460245
034609                     ,:WS-IMCNTK-DO-RCVD-TMST                     03460345
034610                     ,:WS-IMCNTK-CONTNR-PU-TMST                   03460445
034611                     ,:WS-IMCNTK-DAT-SRC-ENT-ID                   03460545
034612                     ,:WS-IMCNTK-CRE-BY-USR-ID                    03460645
034613                     ,:WS-IMCNTK-CRE-TMST                         03460745
034614                     ,:WS-IMCNTK-LAST-UPD-BY-USR-ID               03460845
034615                     ,:WS-IMCNTK-LAST-UPD-TMST                    03460945
034616                     ,:WS-IMCNTK-ACTL-POE-DELY-TMST               03461045
034617                     ,:WS-IMCNTK-ACTL-DEST-POE-CDE                03461145
034618                     ,:WS-IMCNTK-ACTL-LBD-NM                      03461245
034619                     ,:WS-IMCNTK-ACTL-LBD-TMST                    03461345
034620                     ,:WS-02-IMCNTK-DVN-TMST                      03461445
034621                     ,:WS-02-IMCNTK-DCONSLR-SCAC-ID               03461545
034622                     ,:WS-IMCNTK-DCONSLR-RET-TMST                 03461645
034623                    )                                             03461745
034624              END-EXEC                                            03461845
034625          WHEN DS009-PROCESS-TABLE = 'TIMCSEN'                    03461945
034626             EXEC SQL                                             03462045
034627                INSERT INTO TIMCSEN                               03462145
034628                  (                                               03462245
034629                   CSTM_ENTR_ID                                   03462345
034630                  ,ENT_ID                                         03462445
034631                  ,BKR_REF_NBR                                    03462545
034632                  ,FILD_TMST                                      03462645
034633                  ,EST_CLR_TMST                                   03462745
034634                  ,ACTL_CLR_TMST                                  03462845
034635                  ,EXM_TMST                                       03462945
034636                  ,REJ_TMST                                       03463045
034637                  ,REJ_DESC                                       03463145
034638                  ,LQDN_TMST                                      03463245
034639                  ,LQDN_SSPNN_TMST                                03463345
034640                  ,LQDN_SSPNN_DESC                                03463445
034641                  ,DAT_SRC_ENT_ID                                 03463545
034642                  ,CRE_BY_USR_ID                                  03463645
034643                  ,CRE_TMST                                       03463745
034644                  ,LAST_UPD_BY_USR_ID                             03463845
034645                  ,LAST_UPD_TMST                                  03463945
034646                  ,MOM_DEST_POE_CDE                               03464045
034647                  )                                               03464145
034648              VALUES (                                            03464245
034649                  :WS-IMCSEN                                      03464345
034650                     )                                            03464445
034651             END-EXEC                                             03464545
034652          WHEN DS009-PROCESS-TABLE = 'TIMCSBL'                    03464645
034653             EXEC SQL                                             03464745
034654                INSERT INTO TIMCSBL                               03464845
034655                  (                                               03464945
034656                  CSTM_ENTR_ID                                    03465045
034657                 ,MSTR_BOL_NBR                                    03465145
034658                 ,HSE_BOL_NBR                                     03465245
034659                 ,CRE_BY_USR_ID                                   03465345
034660                 ,CRE_TMST                                        03465445
034661                 ,LAST_UPD_BY_USR_ID                              03465545
034662                 ,LAST_UPD_TMST                                   03465645
034663                  )                                               03465745
034664              VALUES (                                            03465845
034665                  :WS-IMCSBL                                      03465945
034666                     )                                            03466045
034667             END-EXEC                                             03466145
034668          WHEN DS009-PROCESS-TABLE = 'TIMCSCN'                    03466245
034669             EXEC SQL                                             03466345
034670                INSERT INTO TIMCSCN                               03466445
034671                  (                                               03466545
034672                   CSTM_ENTR_ID                                   03466645
034673                  ,CONTNR_ID                                      03466745
034674                  ,CRE_BY_USR_ID                                  03466845
034675                  ,CRE_TMST                                       03466945
034676                  ,LAST_UPD_BY_USR_ID                             03467045
034677                  ,LAST_UPD_TMST                                  03467145
034678                  )                                               03467245
034679              VALUES (                                            03467345
034680                  :WS-IMCSCN                                      03467445
034681                     )                                            03467545
034682             END-EXEC                                             03467645
034683          WHEN DS009-PROCESS-TABLE = 'TIMCSPO'                    03467745
034684             EXEC SQL                                             03467845
034685                INSERT INTO TIMCSPO                               03467945
034686                  (                                               03468045
034687                   CSTM_ENTR_ID                                   03468145
034688                  ,PO_NBR                                         03468245
034689                  ,CRE_BY_USR_ID                                  03468345
034690                  ,CRE_TMST                                       03468445
034691                  ,LAST_UPD_BY_USR_ID                             03468545
034692                  ,LAST_UPD_TMST                                  03468645
034693                  )                                               03468745
034694              VALUES (                                            03468845
034695                  :WS-IMCSPO                                      03468945
034696                     )                                            03469045
034697             END-EXEC                                             03469145
034698          WHEN DS009-PROCESS-TABLE = 'TAUCSEN'                    03469245
034699             EXEC SQL                                             03469345
034700                INSERT INTO TAUCSEN                               03469445
034701                  (                                               03469545
034702                    CSTM_ENTR_ID                                  03469645
034703                   ,ENT_ID                                        03469745
034704                   ,BKR_REF_NBR                                   03469845
034705                   ,FILD_TMST                                     03469945
034706                   ,EST_CLR_TMST                                  03470045
034707                   ,ACTL_CLR_TMST                                 03470145
034708                   ,EXM_TMST                                      03470245
034709                   ,REJ_TMST                                      03470345
034710                   ,REJ_DESC                                      03470445
034711                   ,LQDN_TMST                                     03470545
034712                   ,LQDN_SSPNN_TMST                               03470645
034713                   ,LQDN_SSPNN_DESC                               03470745
034714                   ,DAT_SRC_ENT_ID                                03470845
034715                   ,LAST_UPD_BY_USR_ID                            03470945
034716                   ,LAST_UPD_TMST                                 03471045
034717                   ,AUD_FUNC_CDE                                  03471145
034718                   ,AUD_TMST                                      03471245
034719                   ,MOM_DEST_POE_CDE                              03471345
034720                  )                                               03471445
034721              VALUES (                                            03471545
034722                :WS-AUCSEN                                        03471645
034723                     )                                            03471745
034724             END-EXEC                                             03471845
034725          WHEN DS009-PROCESS-TABLE = 'TAUCSBL'                    03471945
034726             EXEC SQL                                             03472045
034727                INSERT INTO TAUCSBL                               03472145
034728                  (                                               03472245
034729                    CSTM_ENTR_ID                                  03472345
034730                   ,MSTR_BOL_NBR                                  03472445
034731                   ,HSE_BOL_NBR                                   03472545
034732                   ,LAST_UPD_BY_USR_ID                            03472645
034733                   ,LAST_UPD_TMST                                 03472745
034734                   ,AUD_FUNC_CDE                                  03472845
034735                   ,AUD_TMST                                      03472945
034736                  )                                               03473045
034737              VALUES (                                            03473145
034738                :WS-AUCSBL                                        03473245
034739                     )                                            03473345
034740             END-EXEC                                             03473445
034741          WHEN DS009-PROCESS-TABLE = 'TAUCSCN'                    03473545
034742             EXEC SQL                                             03473645
034743                INSERT INTO TAUCSCN                               03473745
034744                  (                                               03473845
034745                    CSTM_ENTR_ID                                  03473945
034746                   ,CONTNR_ID                                     03474045
034747                   ,LAST_UPD_BY_USR_ID                            03474145
034748                   ,LAST_UPD_TMST                                 03474245
034749                   ,AUD_FUNC_CDE                                  03474345
034750                   ,AUD_TMST                                      03474445
034751                  )                                               03474545
034752              VALUES (                                            03474645
034753                :WS-AUCSCN                                        03474745
034754                     )                                            03474845
034755             END-EXEC                                             03474945
034756          WHEN DS009-PROCESS-TABLE = 'TAUCSPO'                    03475045
034757             EXEC SQL                                             03475145
034758                INSERT INTO TAUCSPO                               03475245
034759                  (                                               03475345
034760                    CSTM_ENTR_ID                                  03475445
034761                   ,PO_NBR                                        03475545
034762                   ,LAST_UPD_BY_USR_ID                            03475645
034763                   ,LAST_UPD_TMST                                 03475745
034764                   ,AUD_FUNC_CDE                                  03475845
034765                   ,AUD_TMST                                      03475945
034766                  )                                               03476045
034767              VALUES (                                            03476145
034768                :WS-AUCSPO                                        03476245
034769                     )                                            03476345
034770             END-EXEC                                             03476445
034771          WHEN DS009-PROCESS-TABLE = 'TAURCPO'                    03476545
034772             EXEC SQL                                             03476645
034773                INSERT INTO TAURCPO                               03476745
034774                  (                                               03476845
034775                    PO_NBR                                        03476945
034776                   ,PO_RCVD_SEQ_NBR                               03477045
034777                   ,PO_RCVD_DELY_TMST                             03477145
034778                   ,EXTL_REF_NBR                                  03477245
034779                   ,ORGN_SHPD_FR_CDE                              03477345
034780                   ,CONSLR_SCAC_ID                                03477445
034781                   ,IMPRT_TRIP_ID                                 03477545
034782                   ,DPRTR_TMST                                    03477645
034783                   ,POE_DELY_TMST                                 03477745
034784                   ,CARR_SCAC_ID                                  03477845
034785                   ,FOB_CDE                                       03477945
034786                   ,IMPRT_VEH_NM                                  03478045
034787                   ,TRIP_TYP_CDE                                  03478145
034788                   ,DEST_POE_CDE                                  03478245
034789                   ,C_O_PROD_CDE                                  03478345
034790                   ,PROD_FCTRY_NM                                 03478445
034791                   ,PO_CART_CNT                                   03478545
034792                   ,PO_CBMT_QTY                                   03478645
034793                   ,PO_WT_KGRM_QTY                                03478745
034794                   ,PO_UNT_QTY                                    03478845
034795                   ,PO_EXC_APVL_CDE                               03478945
034796                   ,PO_EXC_APVL_USR_ID                            03479045
034797                   ,PO_EXC_APVL_TMST                              03479145
034798                   ,PO_EXC_RSN_DESC                               03479245
034799                   ,EST_LBD_NM                                    03479345
034800                   ,EST_LBD_TMST                                  03479445
034801                   ,VOY_CHG_RSN_DESC                              03479545
034802                   ,DAT_SRC_ENT_ID                                03479645
034803                   ,LAST_UPD_BY_USR_ID                            03479745
034804                   ,LAST_UPD_TMST                                 03479845
034805                   ,AUD_FUNC_CDE                                  03479945
034806                   ,AUD_TMST                                      03480045
034807                  )                                               03480145
034808              VALUES (                                            03480245
034809                :WS-AURCPO                                        03480345
034810                     )                                            03480445
034811             END-EXEC                                             03480545
034812*         WHEN DS009-PROCESS-TABLE = 'TAURCVS'                    03480645
034813*            EXEC SQL                                             03480745
034814*               INSERT INTO TAURCVS                               03480845
034815*                 (                                               03480945
034816*                   PO_NBR                                        03481045
034817*                  ,PO_RCVD_SEQ_NBR                               03481145
034818*                  ,VS_NBR                                        03481245
034819*                  ,HTS_ID                                        03481345
034820*                  ,VS_CART_CNT                                   03481445
034821*                  ,VS_CBMT_QTY                                   03481545
034822*                  ,VS_WT_KGRM_QTY                                03481645
034823*                  ,VS_UNT_QTY                                    03481745
034824*                  ,QTA_CTG_IND                                   03481845
034825*                  ,LAST_UPD_BY_USR_ID                            03481945
034826*                  ,LAST_UPD_TMST                                 03482045
034827*                  ,AUD_FUNC_CDE                                  03482145
034828*                  ,AUD_TMST                                      03482245
034829*                 )                                               03482345
034830*             VALUES (                                            03482445
034831*               :WS-AURCVS                                        03482545
034832*                    )                                            03482645
034833*            END-EXEC                                             03482745
034834*         WHEN DS009-PROCESS-TABLE = 'TAURCUP'                    03482845
034835*            EXEC SQL                                             03482945
034836*               INSERT INTO TAURCUP                               03483045
034837*                 (                                               03483145
034838*                   PO_NBR                                        03483245
034839*                  ,PO_RCVD_SEQ_NBR                               03483345
034840*                  ,VS_NBR                                        03483445
034841*                  ,UPC_NBR                                       03483545
034842*                  ,UPC_CART_CNT                                  03483645
034843*                  ,UPC_CBMT_QTY                                  03483745
034844*                  ,UPC_WT_KGRM_QTY                               03483845
034845*                  ,UPC_UNT_QTY                                   03483945
034846*                  ,LAST_UPD_BY_USR_ID                            03484045
034847*                  ,LAST_UPD_TMST                                 03484145
034848*                  ,AUD_FUNC_CDE                                  03484245
034849*                  ,AUD_TMST                                      03484345
034850*                 )                                               03484445
034851*             VALUES (                                            03484545
034852*               :WS-AURCUP                                        03484645
034853*                    )                                            03484745
034854*            END-EXEC                                             03484845
034855          WHEN DS009-PROCESS-TABLE = 'TAUBKPO'                    03484945
034856             EXEC SQL                                             03485045
034857                INSERT INTO TAUBKPO                               03485145
034858                  (                                               03485245
034859                    PO_NBR                                        03485345
034860                   ,PO_BKG_SEQ_NBR                                03485445
034861                   ,PO_BKG_DELY_TMST                              03485545
034862                   ,EXTL_REF_NBR                                  03485645
034863                   ,ORGN_SHPD_FR_CDE                              03485745
034864                   ,CONSLR_SCAC_ID                                03485845
034865                   ,IMPRT_TRIP_ID                                 03485945
034866                   ,DPRTR_TMST                                    03486045
034867                   ,POE_DELY_TMST                                 03486145
034868                   ,CARR_SCAC_ID                                  03486245
034869                   ,FOB_CDE                                       03486345
034870                   ,IMPRT_VEH_NM                                  03486445
034871                   ,TRIP_TYP_CDE                                  03486545
034872                   ,DEST_POE_CDE                                  03486645
034873                   ,C_O_PROD_CDE                                  03486745
034874                   ,PROD_FCTRY_NM                                 03486845
034875                   ,PO_CART_CNT                                   03486945
034876                   ,PO_CBMT_QTY                                   03487045
034877                   ,PO_WT_KGRM_QTY                                03487145
034878                   ,PO_UNT_QTY                                    03487245
034879                   ,PO_EXC_APVL_CDE                               03487345
034880                   ,PO_EXC_APVL_USR_ID                            03487445
034881                   ,PO_EXC_APVL_TMST                              03487545
034882                   ,PO_EXC_RSN_DESC                               03487645
034883                   ,EST_LBD_NM                                    03487745
034884                   ,EST_LBD_TMST                                  03487845
034885                   ,SHIPT_BKG_TMST                                03487945
034886                   ,VOY_CHG_RSN_DESC                              03488045
034887                   ,DAT_SRC_ENT_ID                                03488145
034888                   ,LAST_UPD_BY_USR_ID                            03488245
034889                   ,LAST_UPD_TMST                                 03488345
034890                   ,AUD_FUNC_CDE                                  03488445
034891                   ,AUD_TMST                                      03488545
034892                  )                                               03488645
034893              VALUES (                                            03488745
034894                :WS-AUBKPO                                        03488845
034895                     )                                            03488945
034896             END-EXEC                                             03489045
034897*         WHEN DS009-PROCESS-TABLE = 'TAUBKVS'                    03489145
034898*            EXEC SQL                                             03489245
034899*               INSERT INTO TAUBKVS                               03489345
034900*                 (                                               03489445
034901*                   PO_NBR                                        03489545
034902*                  ,PO_BKG_SEQ_NBR                                03489645
034903*                  ,VS_NBR                                        03489745
034904*                  ,HTS_ID                                        03489845
034905*                  ,VS_CART_CNT                                   03489945
034906*                  ,VS_CBMT_QTY                                   03490045
034907*                  ,VS_WT_KGRM_QTY                                03490145
034908*                  ,VS_UNT_QTY                                    03490245
034909*                  ,QTA_CTG_IND                                   03490345
034910*                  ,LAST_UPD_BY_USR_ID                            03490445
034911*                  ,LAST_UPD_TMST                                 03490545
034912*                  ,AUD_FUNC_CDE                                  03490645
034913*                  ,AUD_TMST                                      03490745
034914*                 )                                               03490845
034915*             VALUES (                                            03490945
034916*               :WS-AUBKVS                                        03491045
034917*                    )                                            03491145
034918*            END-EXEC                                             03491245
034919*         WHEN DS009-PROCESS-TABLE = 'TAUBKUP'                    03491345
034920*            EXEC SQL                                             03491445
034921*               INSERT INTO TAUBKUP                               03491545
034922*                 (                                               03491645
034923*                   PO_NBR                                        03491745
034924*                  ,PO_BKG_SEQ_NBR                                03491845
034925*                  ,VS_NBR                                        03491945
034926*                  ,UPC_NBR                                       03492045
034927*                  ,UPC_CART_CNT                                  03492145
034928*                  ,UPC_CBMT_QTY                                  03492245
034929*                  ,UPC_WT_KGRM_QTY                               03492345
034930*                  ,UPC_UNT_QTY                                   03492445
034931*                  ,LAST_UPD_BY_USR_ID                            03492545
034932*                  ,LAST_UPD_TMST                                 03492645
034933*                  ,AUD_FUNC_CDE                                  03492745
034934*                  ,AUD_TMST                                      03492845
034935*                 )                                               03492945
034936*             VALUES (                                            03493045
034937*               :WS-AUBKUP                                        03493145
034938*                    )                                            03493245
034939*            END-EXEC                                             03493345
034940          WHEN DS009-PROCESS-TABLE = 'TAUCNPO'                    03493445
034941             EXEC SQL                                             03493545
034942                INSERT INTO TAUCNPO                               03493645
034943                  (                                               03493745
034944                    CONTNR_ID                                     03493845
034945                   ,CONTNR_SEQ_NBR                                03493945
034946                   ,PO_NBR                                        03494045
034947                   ,CSTM_ENTR_ID                                  03494145
034948                   ,MSTR_BOL_NBR                                  03494245
034949                   ,HSE_BOL_NBR                                   03494345
034950                   ,LTR_OF_CR_NBR                                 03494445
034951                   ,PO_RCVD_DELY_TMST                             03494545
034952                   ,PO_C_O_PROD_CDE                               03494645
034953                   ,PO_CART_CNT                                   03494745
034954                   ,PO_CBMT_QTY                                   03494845
034955                   ,PO_WT_KGRM_QTY                                03494945
034956                   ,PO_UNT_QTY                                    03495045
034959                   ,LAST_UPD_BY_USR_ID                            03495145
034960                   ,LAST_UPD_TMST                                 03495245
034961                   ,AUD_FUNC_CDE                                  03495345
034962                   ,AUD_TMST                                      03495445
034963                   ,EXTL_REF_NBR                                  03495545
034964                   ,BKR_FRGT_RLSE_CDE                             03495645
034965                   ,DO_RCVD_CDE                                   03495745
034966                   ,CONTNR_PU_CDE                                 03495845
034967                   ,ACTL_POE_DELY_CDE                             03495945
034968                   ,DVN_CDE                                       03496045
034969                   ,DCONSLR_RET_CDE                               03496145
034970                   ,SPLT_XMIT_CDE                                 03496245
034971                   ,DOC_RCVD_ORGN_TMST                            03496345
034972                   ,DCONSLR_DELY_CDE                              03496445
034973                  )                                               03496545
034974              VALUES (                                            03496645
034975                :WS-AUCNPO                                        03496745
034976                     )                                            03496845
034977             END-EXEC                                             03496945
034978          WHEN DS009-PROCESS-TABLE = 'TAUCNUP'                    03497045
034979             EXEC SQL                                             03497145
034980                INSERT INTO TAUCNUP                               03497245
034981                  (                                               03497345
034982                    CONTNR_ID                                     03497445
034983                   ,CONTNR_SEQ_NBR                                03497545
034984                   ,PO_NBR                                        03497645
034985                   ,VS_NBR                                        03497745
034986                   ,UPC_NBR                                       03497845
034987                   ,PO_LNE_NBR                                    03497945
034988                   ,UPC_CART_CNT                                  03498045
034989                   ,UPC_CBMT_QTY                                  03498145
034990                   ,UPC_WT_KGRM_QTY                               03498245
035000                   ,UPC_UNT_QTY                                   03498345
035020                   ,LAST_UPD_BY_USR_ID                            03498445
035021                   ,LAST_UPD_TMST                                 03498545
035022                   ,AUD_FUNC_CDE                                  03498645
035023                   ,AUD_TMST                                      03498745
035025                   ,SKU_NBR                                       03498845
035026                   ,ASN_PKGNG_CDE                                 03498945
035028                  )                                               03499045
035029              VALUES (                                            03500045
035030                :WS-AUCNUP                                        03501045
035031                     )                                            03502045
035032             END-EXEC                                             03503045
035033          WHEN DS009-PROCESS-TABLE = 'TAUCNTK'                    03503145
035034             EXEC SQL                                             03503245
035035                INSERT INTO TAUCNTK                               03503345
035036                  (                                               03503445
035037                    CONTNR_ID                                     03503545
035038                   ,CONTNR_SEQ_NBR                                03503645
035040                   ,CONSLR_SCAC_ID                                03503745
035041                   ,MOM_IMPRT_TRIP_ID                             03503845
035042                   ,MOM_DPRTR_TMST                                03503945
035043                   ,MOM_POE_DELY_TMST                             03504045
035044                   ,MOM_CARR_SCAC_ID                              03504145
035045                   ,MOM_POL_CDE                                   03504245
035046                   ,MOM_IMPRT_VEH_NM                              03504345
035047                   ,MOM_TRIP_TYP_CDE                              03504445
035048                   ,MOM_DEST_POE_CDE                              03504545
035049                   ,FDR_IMPRT_TRIP_ID                             03504645
035050                   ,FDR_DPRTR_TMST                                03504745
035051                   ,FDR_POE_DELY_TMST                             03504845
035052                   ,FDR_CARR_SCAC_ID                              03504945
035053                   ,FDR_POL_CDE                                   03505045
035054                   ,FDR_IMPRT_VEH_NM                              03505145
035055                   ,FDR_TRIP_TYP_CDE                              03505245
035056                   ,FDR_DEST_POE_CDE                              03505345
035057                   ,SIZE_CDE                                      03505445
035058                   ,CART_CNT                                      03505545
035059                   ,CBMT_QTY                                      03505645
035060                   ,WT_KGRM_QTY                                   03505745
035061                   ,UNT_QTY                                       03505845
035064                   ,ORGN_SHPD_FR_CDE                              03505945
035065                   ,ORGN_SHPD_TO_CDE                              03506045
035066                   ,EST_LBD_NM                                    03506145
035067                   ,EST_LBD_TMST                                  03506245
035068                   ,RISU_DO_RSN_CDE                               03506345
035069                   ,BKR_FRGT_RLSE_TMST                            03506445
035070                   ,DO_TO_DCONSLR_TMST                            03506545
035071                   ,DO_RCVD_TMST                                  03506645
035072                   ,CONTNR_PU_TMST                                03506745
035073                   ,DAT_SRC_ENT_ID                                03506845
035074                   ,LAST_UPD_BY_USR_ID                            03506945
035075                   ,LAST_UPD_TMST                                 03507045
035076                   ,AUD_FUNC_CDE                                  03507145
035077                   ,AUD_TMST                                      03507245
035078                   ,ACTL_POE_DELY_TMST                            03507345
035079                   ,ACTL_DEST_POE_CDE                             03507445
035080                   ,ACTL_LBD_NM                                   03507545
035081                   ,ACTL_LBD_TMST                                 03507645
035082                  )                                               03507745
035083              VALUES (                                            03507845
035084                     :WS-AUCNTK-CONTNR-ID                         03507945
035085                    ,:WS-AUCNTK-CONTNR-SEQ-NBR                    03508045
035087                    ,:WS-AUCNTK-CONSLR-SCAC-ID                    03508145
035088                    ,:WS-AUCNTK-MOM-IMPRT-TRIP-ID                 03508245
035089                    ,:WS-AUCNTK-MOM-DPRTR-TMST                    03508345
035090                    ,:WS-AUCNTK-MOM-POE-DELY-TMST                 03508445
035091                    ,:WS-AUCNTK-MOM-CARR-SCAC-ID                  03508545
035092                    ,:WS-AUCNTK-MOM-POL-CDE                       03508645
035093                    ,:WS-AUCNTK-MOM-IMPRT-VEH-NM                  03508745
035094                    ,:WS-AUCNTK-MOM-TRIP-TYP-CDE                  03508845
035095                    ,:WS-AUCNTK-MOM-DEST-POE-CDE                  03508945
035096                    ,:WS-AUCNTK-FDR-IMPRT-TRIP-ID                 03509045
035097                    ,:WS-AUCNTK-FDR-DPRTR-TMST                    03509145
035098                    ,:WS-AUCNTK-FDR-POE-DELY-TMST                 03509245
035099                    ,:WS-AUCNTK-FDR-CARR-SCAC-ID                  03509345
035100                    ,:WS-AUCNTK-FDR-POL-CDE                       03509445
035101                    ,:WS-AUCNTK-FDR-IMPRT-VEH-NM                  03509545
035102                    ,:WS-AUCNTK-FDR-TRIP-TYP-CDE                  03509645
035103                    ,:WS-AUCNTK-FDR-DEST-POE-CDE                  03509745
035104                    ,:WS-AUCNTK-SIZE-CDE                          03509845
035105                    ,:WS-AUCNTK-CART-CNT                          03509945
035106                    ,:WS-AUCNTK-CBMT-QTY                          03510045
035107                    ,:WS-AUCNTK-WT-KGRM-QTY                       03510145
035108                    ,:WS-AUCNTK-UNT-QTY                           03510245
035111                    ,:WS-AUCNTK-ORGN-SHPD-FR-CDE                  03510345
035112                    ,:WS-AUCNTK-ORGN-SHPD-TO-CDE                  03510445
035113                    ,:WS-AUCNTK-EST-LBD-NM                        03510545
035114                    ,:WS-AUCNTK-EST-LBD-TMST                      03510645
035115                    ,:WS-AUCNTK-RISU-DO-RSN-CDE                   03510745
035116                    ,:WS-AUCNTK-BKR-FRGT-RLSE-TMST                03510845
035117                    ,:WS-AUCNTK-DO-TO-DCONSLR-TMST                03510945
035118                    ,:WS-AUCNTK-DO-RCVD-TMST                      03511045
035119                    ,:WS-AUCNTK-CONTNR-PU-TMST                    03511145
035120                    ,:WS-AUCNTK-DAT-SRC-ENT-ID                    03511245
035121                    ,:WS-AUCNTK-LAST-UPD-BY-USR-ID                03511345
035122                    ,:WS-AUCNTK-LAST-UPD-TMST                     03511445
035123                    ,:WS-AUCNTK-AUD-FUNC-CDE                      03511545
035124                    ,:WS-AUCNTK-AUD-TMST                          03511645
035125                    ,:WS-AUCNTK-ACTL-POE-DELY-TMST                03511745
035126                    ,:WS-AUCNTK-ACTL-DEST-POE-CDE                 03511845
035127                    ,:WS-AUCNTK-ACTL-LBD-NM                       03511945
035128                    ,:WS-AUCNTK-ACTL-LBD-TMST                     03512045
035129                     )                                            03512145
035130             END-EXEC                                             03512245
035131          WHEN DS009-PROCESS-TABLE = 'TELCPO'                     03512345
035132             EXEC SQL                                             03512445
035133                INSERT INTO TELCPO                                03512545
035134                  (                                               03512645
035135                 PO_NBR                                           03512745
035136                ,DEPT_NBR                                         03512845
035137                ,FOB_CDE                                          03512945
035138                ,OTB_PER_NBR                                      03513045
035139                ,IMPRT_TYP_CDE                                    03513145
035140                ,STRT_FCTRY_DTE                                   03513245
035141                ,LAST_FCTRY_DTE                                   03513345
035142                ,TRIP_STRT_DTE                                    03513445
035143                ,CRE_TMST                                         03513545
035144                ,LAST_UPD_TMST                                    03513645
035145                  )                                               03513745
035146              VALUES (                                            03513845
035147                :WS-ELCPO                                         03513945
035148                     )                                            03514045
035149             END-EXEC                                             03514145
035150          WHEN DS009-PROCESS-TABLE = 'TELCVS'                     03514245
035151             EXEC SQL                                             03514345
035152                INSERT INTO TELCVS                                03514445
035153                  (                                               03514545
035154                 PO_NBR                                           03514645
035155                ,VND_STYL_NM                                      03514745
035156                ,VND_OUTR_PK_QTY                                  03514845
035157                ,UNT_PER_CBMT_QTY                                 03514945
035158                ,UNT_QTY                                          03515045
035159                ,LAST_UPD_TMST                                    03515145
035160                  )                                               03515245
035161              VALUES (                                            03515345
035162                :WS-ELCVS                                         03515445
035163                     )                                            03515545
035164             END-EXEC                                             03515645
035165          WHEN DS009-PROCESS-TABLE = 'TVSCPT'                     03515745
035166             EXEC SQL                                             03515845
035167                INSERT INTO TVSCPT                                03515945
035168                  (                                               03516045
035169                 PO_NBR                                           03516145
035170                ,VND_STYL_NM                                      03516245
035171                ,CST_CPT_CDE                                      03516345
035172                ,ALW_CHRG_CDE                                     03516445
035173                ,CPT_CHRG_AMT                                     03516545
035174                ,INCL_IN_ELC_IND                                  03516645
035175                ,LAST_UPD_TMST                                    03516745
035176                  )                                               03516845
035177              VALUES (                                            03516945
035178                :WS-VSCPT                                         03517045
035179                     )                                            03517145
035180             END-EXEC                                             03517245
035181          WHEN DS009-PROCESS-TABLE = 'TIMCNRL'                    03517345
035182             EXEC SQL                                             03517445
035183                INSERT INTO TIMCNRL                               03517545
035184                  (                                               03517645
035185                    CONTNR_ID                                     03517745
035186                   ,CONTNR_SEQ_NBR                                03517845
035187                   ,PO_NBR                                        03517945
035188                   ,DCONSLR_RLSE_CDE                              03518045
035189                   ,DCONSLR_REQR_DTE                              03518145
035190                   ,DCONSLR_ACTL_DTE                              03518245
035191                   ,DCONSLR_ACTL_TM                               03518345
035192                   ,CRE_TMST                                      03518445
035193                   ,CRE_BY_UID                                    03518545
035194                   ,LAST_UPD_TMST                                 03518645
035195                   ,LAST_UPD_BY_UID                               03518745
035196                   ,DCONSLR_ENT_ID                                03518845
035197                  )                                               03518945
035198              VALUES (                                            03519045
035199                :WS-IMCNRL                                        03519145
035200                     )                                            03519245
035201             END-EXEC                                             03519345
035202          WHEN DS009-PROCESS-TABLE = 'TAUCNRL'                    03519445
035203             EXEC SQL                                             03519545
035204                INSERT INTO TAUCNRL                               03519645
035205                  (                                               03519745
035206                    CONTNR_ID                                     03519845
035207                   ,CONTNR_SEQ_NBR                                03519945
035208                   ,PO_NBR                                        03520045
035209                   ,DCONSLR_RLSE_CDE                              03520145
035210                   ,DCONSLR_REQR_DTE                              03520245
035211                   ,DCONSLR_ACTL_DTE                              03520345
035212                   ,DCONSLR_ACTL_TM                               03520445
035213                   ,CRE_TMST                                      03520545
035214                   ,CRE_BY_UID                                    03520645
035215                   ,AUD_FUNC_CDE                                  03520745
035216                   ,AUD_TMST                                      03520845
035217                   ,LAST_UPD_TMST                                 03520945
035218                   ,LAST_UPD_BY_UID                               03521045
035219                   ,DCONSLR_ENT_ID                                03521145
035220                  )                                               03521245
035221              VALUES (                                            03521345
035222                :WS-AUCNRL                                        03521445
035223                     )                                            03521545
035224             END-EXEC                                             03521645
035225          END-EVALUATE                                            03521745
035226        END-IF                                                    03521845
035227        IF TBLE-VERSION = 02                                      03521945
035228          EVALUATE TRUE                                           03522045
035229          WHEN DS009-PROCESS-TABLE = 'TAUCNTK'                    03522145
035230             EXEC SQL                                             03522245
035231                INSERT INTO TAUCNTK                               03522345
035232                  (                                               03522445
035233                    CONTNR_ID                                     03522545
035234                   ,CONTNR_SEQ_NBR                                03522645
035236                   ,CONSLR_SCAC_ID                                03522745
035237                   ,MOM_IMPRT_TRIP_ID                             03522845
035238                   ,MOM_DPRTR_TMST                                03522945
035239                   ,MOM_POE_DELY_TMST                             03523045
035240                   ,MOM_CARR_SCAC_ID                              03524045
035241                   ,MOM_POL_CDE                                   03524145
035242                   ,MOM_IMPRT_VEH_NM                              03524245
035243                   ,MOM_TRIP_TYP_CDE                              03524345
035244                   ,MOM_DEST_POE_CDE                              03524445
035245                   ,FDR_IMPRT_TRIP_ID                             03524545
035246                   ,FDR_DPRTR_TMST                                03524645
035247                   ,FDR_POE_DELY_TMST                             03524745
035248                   ,FDR_CARR_SCAC_ID                              03524845
035249                   ,FDR_POL_CDE                                   03524945
035250                   ,FDR_IMPRT_VEH_NM                              03525045
035251                   ,FDR_TRIP_TYP_CDE                              03525145
035252                   ,FDR_DEST_POE_CDE                              03525245
035253                   ,SIZE_CDE                                      03525345
035254                   ,CART_CNT                                      03525445
035255                   ,CBMT_QTY                                      03525545
035256                   ,WT_KGRM_QTY                                   03525645
035257                   ,UNT_QTY                                       03525745
035260                   ,ORGN_SHPD_FR_CDE                              03525845
035261                   ,ORGN_SHPD_TO_CDE                              03525945
035262                   ,EST_LBD_NM                                    03526045
035263                   ,EST_LBD_TMST                                  03526145
035264                   ,RISU_DO_RSN_CDE                               03526245
035265                   ,BKR_FRGT_RLSE_TMST                            03526345
035266                   ,DO_TO_DCONSLR_TMST                            03526445
035267                   ,DO_RCVD_TMST                                  03526545
035268                   ,CONTNR_PU_TMST                                03526645
035269                   ,DAT_SRC_ENT_ID                                03526745
035270                   ,LAST_UPD_BY_USR_ID                            03526845
035271                   ,LAST_UPD_TMST                                 03526945
035272                   ,AUD_FUNC_CDE                                  03527045
035273                   ,AUD_TMST                                      03527145
035274                   ,ACTL_POE_DELY_TMST                            03527245
035275                   ,ACTL_DEST_POE_CDE                             03527345
035276                   ,ACTL_LBD_NM                                   03527445
035277                   ,ACTL_LBD_TMST                                 03527545
035278                   ,DVN_TMST                                      03527645
035279                   ,DCONSLR_SCAC_ID                               03527745
035280                  )                                               03527845
035281              VALUES (                                            03527945
035282                :WS-AUCNTK-CONTNR-ID                              03528045
035283               ,:WS-AUCNTK-CONTNR-SEQ-NBR                         03528145
035285               ,:WS-AUCNTK-CONSLR-SCAC-ID                         03528245
035286               ,:WS-AUCNTK-MOM-IMPRT-TRIP-ID                      03528345
035287               ,:WS-AUCNTK-MOM-DPRTR-TMST                         03528445
035288               ,:WS-AUCNTK-MOM-POE-DELY-TMST                      03528545
035289               ,:WS-AUCNTK-MOM-CARR-SCAC-ID                       03528645
035290               ,:WS-AUCNTK-MOM-POL-CDE                            03528745
035291               ,:WS-AUCNTK-MOM-IMPRT-VEH-NM                       03528845
035292               ,:WS-AUCNTK-MOM-TRIP-TYP-CDE                       03528945
035293               ,:WS-AUCNTK-MOM-DEST-POE-CDE                       03529045
035294               ,:WS-AUCNTK-FDR-IMPRT-TRIP-ID                      03529145
035295               ,:WS-AUCNTK-FDR-DPRTR-TMST                         03529245
035296               ,:WS-AUCNTK-FDR-POE-DELY-TMST                      03529345
035297               ,:WS-AUCNTK-FDR-CARR-SCAC-ID                       03529445
035298               ,:WS-AUCNTK-FDR-POL-CDE                            03529545
035299               ,:WS-AUCNTK-FDR-IMPRT-VEH-NM                       03529645
035300               ,:WS-AUCNTK-FDR-TRIP-TYP-CDE                       03529745
035301               ,:WS-AUCNTK-FDR-DEST-POE-CDE                       03529845
035302               ,:WS-02-AUCNTK-SIZE-CDE                            03529945
035303               ,:WS-AUCNTK-CART-CNT                               03530045
035304               ,:WS-AUCNTK-CBMT-QTY                               03530145
035305               ,:WS-AUCNTK-WT-KGRM-QTY                            03530245
035306               ,:WS-AUCNTK-UNT-QTY                                03530345
035309               ,:WS-AUCNTK-ORGN-SHPD-FR-CDE                       03530445
035310               ,:WS-AUCNTK-ORGN-SHPD-TO-CDE                       03530545
035311               ,:WS-AUCNTK-EST-LBD-NM                             03530645
035312               ,:WS-AUCNTK-EST-LBD-TMST                           03530745
035313               ,:WS-AUCNTK-RISU-DO-RSN-CDE                        03530845
035314               ,:WS-AUCNTK-BKR-FRGT-RLSE-TMST                     03530945
035315               ,:WS-AUCNTK-DO-TO-DCONSLR-TMST                     03531045
035316               ,:WS-AUCNTK-DO-RCVD-TMST                           03531145
035317               ,:WS-AUCNTK-CONTNR-PU-TMST                         03531245
035318               ,:WS-AUCNTK-DAT-SRC-ENT-ID                         03531345
035319               ,:WS-AUCNTK-LAST-UPD-BY-USR-ID                     03531445
035320               ,:WS-AUCNTK-LAST-UPD-TMST                          03531545
035321               ,:WS-AUCNTK-AUD-FUNC-CDE                           03531645
035322               ,:WS-AUCNTK-AUD-TMST                               03531745
035323               ,:WS-AUCNTK-ACTL-POE-DELY-TMST                     03531845
035324               ,:WS-AUCNTK-ACTL-DEST-POE-CDE                      03531945
035325               ,:WS-AUCNTK-ACTL-LBD-NM                            03532045
035326               ,:WS-AUCNTK-ACTL-LBD-TMST                          03532145
035327               ,:WS-02-AUCNTK-DVN-TMST                            03532245
035328               ,:WS-02-AUCNTK-DCONSLR-SCAC-ID                     03532345
035329                     )                                            03532445
035330             END-EXEC                                             03532545
035331          WHEN DS009-PROCESS-TABLE = 'TIMCNTK'                    03532645
035332              EXEC SQL                                            03532745
035333                  INSERT INTO TIMCNTK                             03532845
035334                    (                                             03532945
035335                      CONTNR_ID                                   03533045
035336                     ,CONTNR_SEQ_NBR                              03533145
035338                     ,CONSLR_SCAC_ID                              03533245
035339                     ,MOM_IMPRT_TRIP_ID                           03533345
035340                     ,MOM_DPRTR_TMST                              03533445
035341                     ,MOM_POE_DELY_TMST                           03533545
035342                     ,MOM_CARR_SCAC_ID                            03533645
035343                     ,MOM_POL_CDE                                 03533745
035344                     ,MOM_IMPRT_VEH_NM                            03533845
035345                     ,MOM_TRIP_TYP_CDE                            03533945
035346                     ,MOM_DEST_POE_CDE                            03534045
035347                     ,FDR_IMPRT_TRIP_ID                           03534145
035348                     ,FDR_DPRTR_TMST                              03534245
035349                     ,FDR_POE_DELY_TMST                           03534345
035350                     ,FDR_CARR_SCAC_ID                            03534445
035351                     ,FDR_POL_CDE                                 03534545
035352                     ,FDR_IMPRT_VEH_NM                            03534645
035353                     ,FDR_TRIP_TYP_CDE                            03534745
035354                     ,FDR_DEST_POE_CDE                            03534845
035355                     ,SIZE_CDE                                    03534945
035356                     ,CART_CNT                                    03535045
035357                     ,CBMT_QTY                                    03535145
035358                     ,WT_KGRM_QTY                                 03535245
035359                     ,UNT_QTY                                     03535345
035362                     ,ORGN_SHPD_FR_CDE                            03535445
035363                     ,ORGN_SHPD_TO_CDE                            03535545
035364                     ,EST_LBD_NM                                  03535645
035365                     ,EST_LBD_TMST                                03535745
035366                     ,RISU_DO_RSN_CDE                             03535845
035367                     ,BKR_FRGT_RLSE_TMST                          03535945
035368                     ,DO_TO_DCONSLR_TMST                          03536045
035369                     ,DO_RCVD_TMST                                03536145
035370                     ,CONTNR_PU_TMST                              03536245
035371                     ,DAT_SRC_ENT_ID                              03536345
035372                     ,CRE_BY_USR_ID                               03536445
035373                     ,CRE_TMST                                    03536545
035374                     ,LAST_UPD_BY_USR_ID                          03536645
035375                     ,LAST_UPD_TMST                               03536745
035376                     ,ACTL_POE_DELY_TMST                          03536845
035377                     ,ACTL_DEST_POE_CDE                           03536945
035378                     ,ACTL_LBD_NM                                 03537045
035379                     ,ACTL_LBD_TMST                               03537145
035380                     ,DVN_TMST                                    03537245
035381                     ,DCONSLR_SCAC_ID                             03537345
035382                     ,DCONSLR_RET_TMST                            03537445
035383                    )                                             03537545
035384                  VALUES (                                        03537645
035385                      :WS-IMCNTK-CONTNR-ID                        03537745
035386                     ,:WS-IMCNTK-CONTNR-SEQ-NBR                   03537845
035388                     ,:WS-IMCNTK-CONSLR-SCAC-ID                   03537945
035389                     ,:WS-IMCNTK-MOM-IMPRT-TRIP-ID                03538045
035390                     ,:WS-IMCNTK-MOM-DPRTR-TMST                   03539045
035391                     ,:WS-IMCNTK-MOM-POE-DELY-TMST                03539145
035392                     ,:WS-IMCNTK-MOM-CARR-SCAC-ID                 03539245
035393                     ,:WS-IMCNTK-MOM-POL-CDE                      03539345
035394                     ,:WS-IMCNTK-MOM-IMPRT-VEH-NM                 03539445
035395                     ,:WS-IMCNTK-MOM-TRIP-TYP-CDE                 03539545
035396                     ,:WS-IMCNTK-MOM-DEST-POE-CDE                 03539645
035397                     ,:WS-IMCNTK-FDR-IMPRT-TRIP-ID                03539745
035398                     ,:WS-IMCNTK-FDR-DPRTR-TMST                   03539845
035399                     ,:WS-IMCNTK-FDR-POE-DELY-TMST                03539945
035400                     ,:WS-IMCNTK-FDR-CARR-SCAC-ID                 03540045
035401                     ,:WS-IMCNTK-FDR-POL-CDE                      03540145
035402                     ,:WS-IMCNTK-FDR-IMPRT-VEH-NM                 03540245
035403                     ,:WS-IMCNTK-FDR-TRIP-TYP-CDE                 03540345
035404                     ,:WS-IMCNTK-FDR-DEST-POE-CDE                 03540445
035405                     ,:WS-IMCNTK-SIZE-CDE                         03540545
035406                     ,:WS-IMCNTK-CART-CNT                         03540645
035407                     ,:WS-IMCNTK-CBMT-QTY                         03540745
035408                     ,:WS-IMCNTK-WT-KGRM-QTY                      03540845
035409                     ,:WS-IMCNTK-UNT-QTY                          03540945
035412                     ,:WS-IMCNTK-ORGN-SHPD-FR-CDE                 03541045
035413                     ,:WS-IMCNTK-ORGN-SHPD-TO-CDE                 03541145
035414                     ,:WS-IMCNTK-EST-LBD-NM                       03541245
035415                     ,:WS-IMCNTK-EST-LBD-TMST                     03541345
035416                     ,:WS-IMCNTK-RISU-DO-RSN-CDE                  03541445
035417                     ,:WS-IMCNTK-BKR-FRGT-RLSE-TMST               03541545
035418                     ,:WS-IMCNTK-DO-TO-DCONSLR-TMST               03541645
035419                     ,:WS-IMCNTK-DO-RCVD-TMST                     03541745
035420                     ,:WS-IMCNTK-CONTNR-PU-TMST                   03541845
035421                     ,:WS-IMCNTK-DAT-SRC-ENT-ID                   03541945
035422                     ,:WS-IMCNTK-CRE-BY-USR-ID                    03542045
035423                     ,:WS-IMCNTK-CRE-TMST                         03542145
035424                     ,:WS-IMCNTK-LAST-UPD-BY-USR-ID               03542245
035425                     ,:WS-IMCNTK-LAST-UPD-TMST                    03542345
035426                     ,:WS-IMCNTK-ACTL-POE-DELY-TMST               03542445
035427                     ,:WS-IMCNTK-ACTL-DEST-POE-CDE                03542545
035428                     ,:WS-IMCNTK-ACTL-LBD-NM                      03542645
035429                     ,:WS-IMCNTK-ACTL-LBD-TMST                    03542745
035430                     ,:WS-02-IMCNTK-DVN-TMST                      03542845
035431                     ,:WS-02-IMCNTK-DCONSLR-SCAC-ID               03542945
035432                     ,:WS-IMCNTK-DCONSLR-RET-TMST                 03543045
035433                    )                                             03543145
035434              END-EXEC                                            03543245
035435* CHERI                                                           03543345
035436              IF DS009-PROCESS-TABLE = 'TIMCNUP'                  03543445
035437                DISPLAY   ' TIMCNUP '                             03543545
035438                DISPLAY   ' CONT ID ' WS-IMCNUP-CONTNR-ID         03543645
035439                DISPLAY   ' CONT SEQ ' WS-IMCNUP-CONTNR-SEQ-NBR   03543745
035440                DISPLAY   ' PO     ' WS-IMCNUP-PO-NBR             03543845
035441                DISPLAY   ' UPC ' WS-IMCNUP-UPC-NBR               03543945
035442              END-IF                                              03544045
035443***************************************************************** 03544145
035444*     COLUMN MAINTENANCE SHOULD BE ADDED HERE                   * 03544245
035445***************************************************************** 03544345
035446          END-EVALUATE                                            03544445
035447        END-IF                                                    03544545
035448     END-PERFORM.                                                 03544645
035449     PERFORM DS002-SQL-ABEND-INSERT.                              03544745
035450 EJECT                                                            03544845
035451                                                                  03544945
035452 1100-GET-DB2-INSTANCE.                                           03545045
035453                                                                  03545145
035454     MOVE '1100-GET-DB2-INSTANCE'                                 03545245
035455          TO DS009-PARAGRAPH.                                     03545345
035456     MOVE 'GET DB2 INSTANCE'                                      03545445
035457          TO DS009-OPERATION.                                     03545545
035458                                                                  03545645
035459     EXEC SQL                                                     03545745
035460         SELECT CURRENT SERVER INTO :WS-LOCAL-SERVER              03545845
035461             FROM SYSIBM.SYSDUMMY1 WITH UR                        03545945
035462     END-EXEC.                                                    03546045
035463                                                                  03546145
035464     EVALUATE TRUE                                                03546245
035465         WHEN SQLCODE = +0                                        03546345
035466             CONTINUE                                             03546445
035467         WHEN SQLWARN0 NOT = SPACES                               03546545
035468         WHEN SQLCODE < +0                                        03546645
035469         WHEN SQLCODE > +0                                        03546745
035470             PERFORM DS002-SQL-ERROR                              03546845
035471     END-EVALUATE.                                                03546945
035472*                                                                 03547045
035473 1200-CHECK-IF-PRODUCTION.                                        03547145
035474                                                                  03547245
035475     MOVE '1200-CHECK-IF-PRODUCTION'                              03547345
035476          TO DS009-PARAGRAPH.                                     03547445
035477     MOVE 'SELECT PRDCHK TKRPRPM '                                03547545
035478          TO DS009-OPERATION.                                     03547645
035479                                                                  03547745
035480     EXEC SQL                                                     03547845
035481       SELECT FUNC_TXT                                            03547945
035482         INTO :KRPRPM-FUNC-TXT                                    03548045
035483       FROM   TKRPRPM                                             03548145
035484       WHERE  SYS_PRC_FUNC_CDE  = :PC-PRDCHK                      03548245
035485         AND  INTFC_SYS_CDE     = :PC-KHL                         03548345
035486         AND  LOC_ID            = :PC-90                          03548445
035487         AND  FUNC_TXT          = :PC-PARM-TEXT                   03548545
035488     END-EXEC                                                     03548645
035489                                                                  03548745
035490     EVALUATE TRUE                                                03548845
035491         WHEN SQLCODE = +0                                        03548945
035492             CONTINUE                                             03549045
035493         WHEN SQLCODE = +100                                      03549145
035494             DISPLAY '*******************************************'03549245
035495             DISPLAY '** ABEND - DO NOT RUN THIS DSKUT410 PROGRAM'03549345
035496             DISPLAY '** ABEND - AGAINST PRODUCTION'              03549445
035497             DISPLAY '** ABEND - THIS SHOULD ONLY EVER BE'        03549545
035498             DISPLAY '** ABEND - RUN AGAINST TEST DATA'           03549645
035499             DISPLAY '*******************************************'03549745
035500             DISPLAY '** ABEND - THIS RUN IS GOING AGAINST'       03549845
035501             DISPLAY '** ABEND - DB2 INSTANCE:  '                 03549945
035502                     WS-LOCAL-SERVER                              03550045
035503             DISPLAY '*******************************************'03550145
035504             PERFORM DS002-SQL-ERROR                              03550245
035505                                                                  03550345
035506         WHEN SQLWARN0 NOT = SPACES                               03550445
035507         WHEN SQLCODE < +0                                        03550545
035508         WHEN SQLCODE > +0                                        03550645
035509             PERFORM DS002-SQL-ERROR                              03550745
035510     END-EVALUATE.                                                03550845
035511                                                                  03550945
035512***************************************************************** 03551045
035513*     PRODUCTION - TO - TEST STANDARD PARAGRAPHS                * 03551145
035514***************************************************************** 03551245
035520     COPY DSPD02Q.                                                03551345
035600 EJECT                                                            03551445
