000100 IDENTIFICATION DIVISION.                                         00010005
000200 PROGRAM-ID.     DSKUT007.                                        00020005
000300 AUTHOR.         RICHARD MOORE.                                   00030005
000400*DATE-WRITTEN.   12/01/98.                                        00040005
000500*DATE-COMPILED.                                                   00050005
000600*************************************************************     00060005
000700*    INSERT GROUP 2 DATA INTO TEST                                00070005
000700*                                                                 00070106
000700* CHANGES:                                                        00070206
000700*                                                                 00070306
004510* 08/10/2022  J KURK   - RECOMPILE FOR COPYBOOK DSPD002           00071006
004510* 04/10/2022  J KURK   - RECOMPILE FOR UPDATED COPYBOOKS          00072007
000800*************************************************************     00080005
000900                                                                  00090005
001000 ENVIRONMENT DIVISION.                                            00100005
001100                                                                  00110005
001200 INPUT-OUTPUT SECTION.                                            00120005
001300                                                                  00130005
001400 FILE-CONTROL.                                                    00140005
001500                                                                  00150005
001600     SELECT PO-NBR-FILE                                           00160005
001700         ASSIGN         TO UT-S-PO01.                             00170005
001800     SELECT TBLE-FILE                                             00180005
001900         ASSIGN         TO UT-S-TBL01.                            00190005
002000     SELECT CONTROL-FILE                                          00200005
002100         ASSIGN         TO UT-S-CTL01.                            00210005
002200                                                                  00220005
002300 DATA DIVISION.                                                   00230005
002400                                                                  00240005
002500 FILE SECTION.                                                    00250005
002600******************************************************************00260005
002700     COPY DSFD001.                                                00270005
002800                                                                  00280005
002900 WORKING-STORAGE SECTION.                                         00290005
003000 01  PV-OTHER-CRAPOLA.                                            00300005
003100     05  PV-TOTAL-COUNT               PIC S9(9) COMP-3 VALUE      00310005
003200                                                   ZERO.          00320005
003300     05  PV-DISP-SQLCODE              PIC -999.                   00330005
003400     05  PV-DISP-NBR                  PIC Z(8)9.                  00340005
003500     05  PV-WHEN-COMPILED.                                        00350005
003600         10  PV-COMPILE-DATE          PIC X(08).                  00360005
003700         10  PV-COMPILE-TIME          PIC X(08).                  00370005
003710                                                                  00371005
003720 01  PC-CONSTANTS.                                                00372005
003730     05  PC-90                       PIC S9(04)    COMP           00373005
003740                                                   VALUE 90.      00374005
003750     05  PC-A                        PIC  X(01)    VALUE 'A'.     00375005
003760     05  PC-Y                        PIC  X(01)    VALUE 'Y'.     00376005
003770     05  PC-RCV                      PIC  X(03)    VALUE 'RCV'.   00377005
003780     05  PC-KHL                      PIC  X(03)    VALUE 'KHL'.   00378005
003790     05  PC-PRDCHK                   PIC  X(06)    VALUE 'PRDCHK'.00379005
003791     05  PC-PARM-TEXT                PIC  X(25)    VALUE          00379105
003792         'LOWER LEVEL ONLY         '.                             00379205
003793     05  PC-CURRENT-PROGRAM-NAME     PIC  X(08)    VALUE          00379305
003794         'DSKUT007'.                                              00379405
003795                                                                  00379505
003796 01  WS-LOCAL-SERVER.                                             00379605
003797     05  WS-SUBSYS                   PIC X(04)  VALUE SPACES.     00379705
003798     05  FILLER                      PIC X(12)  VALUE SPACES.     00379805
003799/                                                                 00379905
003800     COPY DPWS004.                                                00380005
003900     COPY DSWS008.                                                00390005
004000     COPY DSWS009.                                                00400005
004100     COPY DSWS010.                                                00410005
004200     COPY DSRD002.                                                00420005
004300                                                                  00430005
004400*  COMMUNICATIONS AREA FOR PROD TO TEST UTILITIES                 00440005
004500     COPY DSWS011.                                                00450005
004600******************************************************************00460005
004700*                                                                 00470005
004800******************************************************************00480005
004900*LINKAGE SECTION.                                                 00490005
005000******************************************************************00500005
005100*                                                                 00510005
005200 PROCEDURE DIVISION.                                              00520005
005300                                                                  00530005
005400 A100-MAINLINE.                                                   00540005
005500                                                                  00550005
005600     MOVE WHEN-COMPILED TO PV-WHEN-COMPILED                       00560005
005700     DISPLAY SPACES                                               00570005
005800     DISPLAY ' *** DSKUT007 VERSION 2 ***'                        00580005
005900     DISPLAY 'COMPILE DATE: ' PV-COMPILE-DATE                     00590005
006000             ' ' PV-COMPILE-TIME                                  00600005
006100                                                                  00610005
006200     PERFORM 1100-GET-DB2-INSTANCE.                               00620005
006210     PERFORM 1200-CHECK-IF-PRODUCTION.                            00621005
006220                                                                  00622005
006230     SET DS009-I-PGM TO TRUE.                                     00623005
006240     PERFORM DS002-INITIAL-PROCESSING.                            00624005
006250     PERFORM B100-PROCESSING                                      00625005
006260         UNTIL TABLE-EOF.                                         00626005
006270                                                                  00627005
006280     PERFORM 9000-DUMP-COUNT-TABLE                                00628005
006290                                                                  00629005
006300     PERFORM DS002-END-OF-JOB.                                    00630005
006400                                                                  00640005
006500     GOBACK.                                                      00650005
006600 EJECT                                                            00660005
006700                                                                  00670005
006800 B100-PROCESSING.                                                 00680005
006900*                                                                 00690005
007000***************************************************************** 00700005
007100*     FOR EACH TABLE, INSERT DATA INTO THE TABLES                 00710005
007200***************************************************************** 00720005
007300*                                                                 00730005
007400     READ TBLE-FILE                                               00740005
007500         AT END SET TABLE-EOF TO TRUE.                            00750005
007600     IF NOT-TABLE-EOF                                             00760005
007700        MOVE TBLE-DATA-SIZE TO DS009-TBLE-DATA-SIZE               00770005
007800        MOVE TBLE-NAME  TO DS009-PROCESS-TABLE                    00780005
007900        MOVE TBLE-KEYS  TO DS009-PKYS                             00790005
008000        PERFORM DS002-DO-PROCESS                                  00800005
008100        IF DS009-DO-PROCESS                                       00810005
008200*       DISPLAY '**********************************'              00820005
008300*       DISPLAY DS009-PROCESS-TABLE                               00830005
008400        EVALUATE TRUE                                             00840005
008500         WHEN DS009-PROCESS-TABLE = 'TSHPTPO'                     00850005
008600             MOVE TBLE-DATA-ITEM TO WS-SHPTPO                     00860005
008700             MOVE WS-SHPTPO-PO-NBR TO HOLD-PO-NBR                 00870005
008800*            DISPLAY HOLD-PO-NBR                                  00880005
008900*            DISPLAY WS-SHPTPO                                    00890005
009000             PERFORM R100-INSERT                                  00900005
009100         WHEN DS009-PROCESS-TABLE = 'TPKSLIP'                     00910005
009200             MOVE TBLE-DATA-ITEM TO WS-PKSLIP                     00920005
009300             MOVE WS-PKSLIP-PO-NBR TO HOLD-PO-NBR                 00930005
009400*            DISPLAY HOLD-PO-NBR                                  00940005
009500*            DISPLAY WS-PKSLIP                                    00950005
009600             PERFORM R100-INSERT                                  00960005
009700         WHEN DS009-PROCESS-TABLE = 'TPKITEM'                     00970005
009800             MOVE TBLE-DATA-ITEM TO WS-PKITEM                     00980005
009900*            MOVE WS-PKITEM-PO-NBR TO HOLD-PO-NBR                 00990005
010000*            DISPLAY HOLD-PO-NBR                                  01000005
010100*            DISPLAY WS-PKITEM                                    01010005
010200             PERFORM R100-INSERT                                  01020005
010300         WHEN DS009-PROCESS-TABLE = 'TRECEIV'                     01030005
010400             MOVE TBLE-DATA-ITEM TO WS-RECEIV                     01040005
010500*            DISPLAY 'TBLE DATA ITEM' TBLE-DATA-ITEM              01050005
010600             MOVE WS-RECEIV-ORD-NBR TO HOLD-PO-NBR                01060005
010700*            DISPLAY HOLD-PO-NBR                                  01070005
010800*            DISPLAY WS-RECEIV                                    01080005
010900             PERFORM R100-INSERT                                  01090005
011000         WHEN DS009-PROCESS-TABLE = 'TRECITM'                     01100005
011100             MOVE TBLE-DATA-ITEM TO WS-RECITM                     01110005
011200             MOVE WS-RECITM-ORD-NBR TO HOLD-PO-NBR                01120005
011300*            DISPLAY HOLD-PO-NBR                                  01130005
011400*            DISPLAY WS-RECITM                                    01140005
011500             PERFORM R100-INSERT                                  01150005
011600         WHEN DS009-PROCESS-TABLE = 'TRECDIS'                     01160005
011700             MOVE TBLE-DATA-ITEM TO WS-RECDIS                     01170005
011800             MOVE WS-RECDIS-ORD-NBR TO HOLD-PO-NBR                01180005
011900*            DISPLAY HOLD-PO-NBR                                  01190005
012000*            DISPLAY WS-RECDIS                                    01200005
012100             PERFORM R100-INSERT                                  01210005
012200         WHEN DS009-PROCESS-TABLE = 'TVHTRIP'                     01220005
012300             MOVE TBLE-DATA-ITEM TO WS-VHTRIP                     01230005
012400             MOVE WS-VHTRIP-TRIP-ID  TO HOLD-TRIP-ID              01240005
012500             DISPLAY ' TVHTRIP-ID = ' HOLD-TRIP-ID                01250005
012600*            DISPLAY WS-VHTRIP                                    01260005
012700             PERFORM R100-INSERT                                  01270005
012800         WHEN DS009-PROCESS-TABLE = 'TSHIPMT'                     01280005
012900             MOVE TBLE-DATA-ITEM TO WS-SHIPMT                     01290005
013000             MOVE WS-SHIPMT-SHIPT-ID TO HOLD-SHIPT-ID             01300005
013100             DISPLAY 'SHIPMT-SHIPT-ID = ' HOLD-SHIPT-ID           01310005
013200             DISPLAY 'SHIPMT-TRIP-ID = ' HOLD-TRIP-ID             01320005
013300*            DISPLAY WS-SHIPMT                                    01330005
013400             PERFORM R100-INSERT                                  01340005
013500         WHEN DS009-PROCESS-TABLE = 'TSHIPST'                     01350005
013600             MOVE TBLE-DATA-ITEM TO WS-SHIPST                     01360005
013700             MOVE WS-SHIPST-SHIPT-ID TO HOLD-SHIPT-ID             01370005
013800*            DISPLAY HOLD-SHIPT-ID                                01380005
013900*            DISPLAY WS-SHIPST                                    01390005
014000             PERFORM R100-INSERT                                  01400005
014100         WHEN DS009-PROCESS-TABLE = 'TTRIPST'                     01410005
014200             MOVE TBLE-DATA-ITEM TO WS-TRIPST                     01420005
014300             MOVE WS-TRIPST-TRIP-ID  TO HOLD-TRIP-ID              01430005
014400*            DISPLAY HOLD-TRIP-ID                                 01440005
014500*            DISPLAY WS-TRIPST                                    01450005
014600             PERFORM R100-INSERT                                  01460005
014700         WHEN DS009-PROCESS-TABLE = 'TVEHICL'                     01470005
014800             MOVE TBLE-DATA-ITEM TO WS-VEHICL                     01480005
014900             MOVE WS-VEHICL-OWNER-SCAC-ID TO HOLD-SCAC-ID         01490005
015000             MOVE WS-VEHICL-VEH-NBR       TO HOLD-VEH-NBR         01500005
015100*            DISPLAY HOLD-VEH-NBR                                 01510005
015200*            DISPLAY HOLD-SCAC-ID                                 01520005
015300*            DISPLAY WS-VEHICL                                    01530005
015400             PERFORM R100-INSERT                                  01540005
015500         WHEN DS009-PROCESS-TABLE = 'TRECDVS'                     01550005
015600             MOVE TBLE-DATA-ITEM TO WS-RECDVS                     01560005
015700             MOVE WS-RECDVS-ORD-NBR       TO HOLD-PO-NBR          01570005
015800*            DISPLAY HOLD-PO-NBR                                  01580005
015900*            DISPLAY WS-RECDVS                                    01590005
016000             PERFORM R100-INSERT                                  01600005
016100         WHEN DS009-PROCESS-TABLE = 'TAUTRIP'                     01610005
016200             MOVE TBLE-DATA-ITEM TO WS-AUTRIP                     01620005
016300             MOVE WS-AUTRIP-TRIP-ID       TO HOLD-TRIP-ID         01630005
016400*            DISPLAY HOLD-TRIP-ID                                 01640005
016500*            DISPLAY WS-AUTRIP                                    01650005
016600             PERFORM R100-INSERT                                  01660005
016700         WHEN DS009-PROCESS-TABLE = 'TAUSHIP'                     01670005
016800             MOVE TBLE-DATA-ITEM          TO WS-AUSHIP            01680005
016900             MOVE WS-AUSHIP-SHIPT-ID      TO HOLD-SHIPT-ID        01690005
017000*            DISPLAY HOLD-SHIPT-ID                                01700005
017100*            DISPLAY WS-AUSHIP                                    01710005
017200             PERFORM R100-INSERT                                  01720005
017300         WHEN DS009-PROCESS-TABLE = 'TAUSHPO'                     01730005
017400             MOVE TBLE-DATA-ITEM          TO WS-AUSHPO            01740005
017500             MOVE WS-AUSHPO-PO-NBR        TO HOLD-PO-NBR          01750005
017600*            DISPLAY HOLD-PO-NBR                                  01760005
017700*            DISPLAY WS-AUSHPO                                    01770005
017800             PERFORM R100-INSERT                                  01780005
017900         WHEN DS009-PROCESS-TABLE = 'TAUVHCL'                     01790005
018000             MOVE TBLE-DATA-ITEM          TO WS-AUVHCL            01800005
018100             MOVE WS-AUVHCL-OWNER-SCAC-ID TO HOLD-OWNER-SCAC-ID   01810005
018200             MOVE WS-AUVHCL-VEH-NBR       TO HOLD-VEH-NBR         01820005
018300*            DISPLAY HOLD-OWNER-SCAC-ID                           01830005
018400*            DISPLAY HOLD-VEH-NBR                                 01840005
018500*            DISPLAY WS-AUVHCL                                    01850005
018600             PERFORM R100-INSERT                                  01860005
018700         WHEN DS009-PROCESS-TABLE = 'TDISTHD'                     01870005
018800             MOVE TBLE-DATA-ITEM          TO WS-DISTHD            01880005
018900             MOVE WS-DISTHD-ORD-NBR       TO HOLD-ORD-NBR         01890005
019000*            DISPLAY HOLD-ORD-NBR                                 01900005
019100*            DISPLAY WS-DISTHD                                    01910005
019200             PERFORM R100-INSERT                                  01920005
019300         WHEN DS009-PROCESS-TABLE = 'TDISTDT'                     01930005
019400             MOVE TBLE-DATA-ITEM          TO WS-DISTDT            01940005
019500             MOVE WS-DISTDT-ORD-NBR       TO HOLD-ORD-NBR         01950005
019600*            DISPLAY HOLD-ORD-NBR                                 01960005
019700*            DISPLAY WS-DISTDT                                    01970005
019800             PERFORM R100-INSERT                                  01980005
019900         WHEN DS009-PROCESS-TABLE = 'TWRKORD'                     01990005
020000             MOVE TBLE-DATA-ITEM          TO WS-WRKORD            02000005
020100             MOVE WS-WRKORD-ORD-NBR       TO HOLD-ORD-NBR         02010005
020200*            DISPLAY HOLD-ORD-NBR                                 02020005
020300*            DISPLAY WS-WRKORD                                    02030005
020400             PERFORM R100-INSERT                                  02040005
020500         WHEN DS009-PROCESS-TABLE = 'TWKORIN'                     02050005
020600             MOVE TBLE-DATA-ITEM          TO WS-WKORIN            02060005
020700             MOVE WS-WKORIN-ORD-NBR       TO HOLD-ORD-NBR         02070005
020800*            DISPLAY HOLD-ORD-NBR                                 02080005
020900*            DISPLAY WS-WKORIN                                    02090005
021000             PERFORM R100-INSERT                                  02100005
021100         WHEN DS009-PROCESS-TABLE = 'TSHPSUM'                     02110005
021200             MOVE TBLE-DATA-ITEM          TO WS-SHPSUM            02120005
021300             MOVE WS-SHPSUM-PO-NBR        TO HOLD-PO-NBR          02130005
021400*            DISPLAY HOLD-PO-NBR                                  02140005
021500*            DISPLAY WS-SHPSUM                                    02150005
021600             PERFORM R100-INSERT                                  02160005
021700         WHEN DS009-PROCESS-TABLE = 'TLBVRDA'                     02170005
021800             MOVE TBLE-DATA-ITEM          TO WS-LBVRDA            02180005
021900             MOVE WS-LBVRDA-PO-NBR        TO HOLD-PO-NBR          02190005
022000*            DISPLAY HOLD-PO-NBR                                  02200005
022100*            DISPLAY WS-LBVRDA                                    02210005
022200             PERFORM R100-INSERT                                  02220005
022300         WHEN DS009-PROCESS-TABLE = 'TLBPTDA'                     02230005
022400             MOVE TBLE-DATA-ITEM          TO WS-LBPTDA            02240005
022500             MOVE WS-LBPTDA-TRIP-ID       TO HOLD-TRIP-ID         02250005
022600*            DISPLAY HOLD-TRIP-ID                                 02260005
022700*            DISPLAY WS-LBPTDA                                    02270005
022800             PERFORM R100-INSERT                                  02280005
022900         END-EVALUATE                                             02290005
023000                                                                  02300005
023100         IF SQLCODE = ZERO                                        02310005
023200             SET DS009-SRCH-IDX TO +1                             02320005
023300             SEARCH DS009-CNTL-RECORDS                            02330005
023400                 VARYING DS009-SRCH-IDX                           02340005
023500                 AT END                                           02350005
023600                     CONTINUE                                     02360005
023700                 WHEN CNTL-TABLE (DS009-SRCH-IDX) =               02370005
023800                          DS009-PROCESS-TABLE                     02380005
023900*                    ADD SQLERRD(3)                               02390005
024000                     ADD +1                                       02400005
024100                        TO DS009-READ-COUNT (DS009-SRCH-IDX)      02410005
024200             END-SEARCH                                           02420005
024300         END-IF                                                   02430005
024400                                                                  02440005
024500                                                                  02450005
024600*        DISPLAY 'RETURN SQLCODE ON INSERT:' SQLCODE              02460005
024700*        DISPLAY 'NUMBER OF ROWS INSERTED:' SQLERRD (3)           02470005
024800         IF DS009-UPDATE-COUNT > DS009-COMMIT-COUNT               02480005
024900            EXEC SQL                                              02490005
025000                COMMIT                                            02500005
025100            END-EXEC                                              02510005
025200            IF SQLCODE NOT = ZERO                                 02520005
025300               PERFORM DS002-SQL-ABEND-COMMIT                     02530005
025400            END-IF                                                02540005
025500            MOVE +0  TO DS009-UPDATE-COUNT                        02550005
025600*           DISPLAY 'COMMIT TAKEN AFTER RECORD: '                 02560005
025700*                                     DS009-TUPDATE-COUNT         02570005
025800         END-IF                                                   02580005
025900         ADD SQLERRD(3) TO DS009-UPDATE-COUNT                     02590005
026000         ADD SQLERRD(3) TO DS009-TUPDATE-COUNT                    02600005
026100        END-IF                                                    02610005
026200     END-IF.                                                      02620005
026300                                                                  02630005
026400 EJECT                                                            02640005
026500***************************************************************** 02650005
026600*     INSERT SHPTPO DATA                                          02660005
026700***************************************************************** 02670005
026800*                                                                 02680005
026900 R100-INSERT.                                                     02690005
027000*                                                                 02700005
027100     PERFORM WITH TEST AFTER                                      02710005
027200        VARYING DS009-RETRY-COUNTER FROM 1 BY 1                   02720005
027300        UNTIL   DS009-RETRY-COUNTER > 3 OR                        02730005
027400                SQLCODE = ZERO OR -803 OR -530                    02740005
027500          EVALUATE TRUE                                           02750005
027600          WHEN DS009-PROCESS-TABLE = 'TSHPTPO'                    02760005
027700          EXEC SQL                                                02770005
027800              INSERT INTO TSHPTPO                                 02780005
027900                 (                                                02790005
028000                  SHIPT_ID                                        02800005
028100                 ,PO_NBR                                          02810005
028200*                ,DEPT_NBR                                        02820005
028300                 ,REC_SEQ_NBR                                     02830005
028400                 ,EXPTED_CART_CNT                                 02840005
028500                 ,ACTL_CART_CNT                                   02850005
028600                 ,DMG_CART_CNT                                    02860005
028700                 ,PKSL_IND                                        02870005
028800                 ,VEND_NAME                                       02880005
028900                 ,FRGT_CHG_AMT                                    02890005
029000                 ,LAST_UPD_PGM_ID                                 02900005
029100                 ,CRE_USER_ID                                     02910005
029200                 ,CARR_CART_CT                                    02920005
029300                 ,CARR_LAST_UPD_DTE                               02930005
029400                 ,CARR_LAST_UPD_TIME                              02940005
029500                 ,VEND_CART_CT                                    02950005
029600                 ,VEND_LAST_UPD_DTE                               02960005
029700                 ,VEND_LAST_UPD_TIME                              02970005
029800                 ,CRE_TMST                                        02980005
029900                 ,LAST_UPD_DTE                                    02990005
030000                 ,LAST_UPD_TIME                                   03000005
030100                 ,LAST_UPD_USER_ID                                03010005
030200                 ,PRIM_SHIPT_IND                                  03020005
030300                 ,SPLT_XMIT_IND                                   03030005
030400                 ,SPLT_XMIT_DTE                                   03040005
030500                 ,SPLT_XMIT_TM                                    03050005
030600                )                                                 03060005
030700            VALUES (                                              03070005
030800                 :WS-SHPTPO-SHIPT-ID                              03080005
030900                ,:WS-SHPTPO-PO-NBR                                03090005
031000*               ,:WS-SHPTPO-DEPT-NBR                              03100005
031100                ,:WS-SHPTPO-REC-SEQ-NBR                           03110005
031200                ,:WS-SHPTPO-EXPTED-CART-CNT                       03120005
031300                ,:WS-SHPTPO-ACTL-CART-CNT                         03130005
031400                ,:WS-SHPTPO-DMG-CART-CNT                          03140005
031500                ,:WS-SHPTPO-PKSL-IND                              03150005
031600                ,:WS-SHPTPO-VEND-NAME                             03160005
031700                ,:WS-SHPTPO-FRGT-CHG-AMT                          03170005
031800                ,:WS-SHPTPO-LAST-UPD-PGM-ID                       03180005
031900                ,:WS-SHPTPO-CRE-USER-ID                           03190005
032000                ,:WS-SHPTPO-CARR-CART-CT                          03200005
032100                ,:WS-SHPTPO-CARR-LAST-UPD-DTE                     03210005
032200                ,:WS-SHPTPO-CARR-LAST-UPD-TIME                    03220005
032300                ,:WS-SHPTPO-VEND-CART-CT                          03230005
032400                ,:WS-SHPTPO-VEND-LAST-UPD-DTE                     03240005
032500                ,:WS-SHPTPO-VEND-LAST-UPD-TIME                    03250005
032600                ,:WS-SHPTPO-CRE-TMST                              03260005
032700                ,:WS-SHPTPO-LAST-UPD-DTE                          03270005
032800                ,:WS-SHPTPO-LAST-UPD-TIME                         03280005
032900                ,:WS-SHPTPO-LAST-UPD-USER-ID                      03290005
033000                ,:WS-SHPTPO-PRIM-SHIPT-IND                        03300005
033100                ,:WS-SHPTPO-SPLT-XMIT-IND                         03310005
033200                ,:WS-SHPTPO-SPLT-XMIT-DTE                         03320005
033300                ,:WS-SHPTPO-SPLT-XMIT-TM                          03330005
033400                   )                                              03340005
033500          END-EXEC                                                03350005
033600          WHEN DS009-PROCESS-TABLE = 'TPKSLIP'                    03360005
033700          EXEC SQL                                                03370005
033800              INSERT INTO TPKSLIP                                 03380005
033900                (                                                 03390005
034000                  PO_NBR                                          03400005
034100                 ,SEQ_NBR                                         03410005
034200                 ,CRE_TMST                                        03420005
034300                 ,VER_STAT_CDE                                    03430005
034400                 ,OPER_UNT_ID                                     03440005
034500                 ,FCLTY_ID                                        03450005
034600                 ,PKSL_NBR                                        03460005
034700                 ,STR_DEST_NBR                                    03470005
034800                 ,REC_SEQ_NBR                                     03480005
034900                 ,SHIPT_ID                                        03490005
035000                 ,BOL_NBR                                         03500005
035100                 ,PRO_NBR                                         03510005
035200                 ,PKSL_STAT_CDE                                   03520005
035300                 ,CRE_UID                                         03530005
035400                 ,PO_VER_NBR                                      03540005
035500                 ,CRE_SRC_CDE                                     03550005
035600                 ,EXPTED_PKG_QTY                                  03560005
035700                 ,OWNER_SCAC_ID                                   03570005
035800                 ,ASN_NBR                                         03580005
035900                 ,VEND_SHIP_DTE                                   03590005
036000                 ,PKSL_PG_CNT                                     03600005
036100                 ,CONTNR_ID                                       03610005
036110                 ,ORIG_PKSL_SEQ_NBR                               03611005
036120                )                                                 03612005
036130            VALUES (                                              03613005
036140                 :WS-PKSLIP-PO-NBR                                03614005
036150                ,:WS-PKSLIP-SEQ-NBR                               03615005
036160                ,:WS-PKSLIP-CRE-TMST                              03616005
036170                ,:WS-PKSLIP-VER-STAT-CDE                          03617005
036180                ,:WS-PKSLIP-OPER-UNT-ID                           03618005
036190                ,:WS-PKSLIP-FCLTY-ID                              03619005
036200                ,:WS-PKSLIP-PKSL-NBR                              03620005
036300                ,:WS-PKSLIP-STR-DEST-NBR                          03630005
036400                ,:WS-PKSLIP-REC-SEQ-NBR                           03640005
036500                ,:WS-PKSLIP-SHIPT-ID                              03650005
036600                ,:WS-PKSLIP-BOL-NBR                               03660005
036700                ,:WS-PKSLIP-PRO-NBR                               03670005
036800                ,:WS-PKSLIP-PKSL-STAT-CDE                         03680005
036900                ,:WS-PKSLIP-CRE-UID                               03690005
037000                ,:WS-PKSLIP-PO-VER-NBR                            03700005
037100                ,:WS-PKSLIP-CRE-SRC-CDE                           03710005
037200                ,:WS-PKSLIP-EXPTED-PKG-QTY                        03720005
037300                ,:WS-PKSLIP-OWNER-SCAC-ID                         03730005
037400                ,:WS-PKSLIP-ASN-NBR                               03740005
037500                ,:WS-PKSLIP-VEND-SHIP-DTE                         03750005
037600                ,:WS-PKSLIP-PKSL-PG-CNT                           03760005
037700                ,:WS-PKSLIP-CONTNR-ID                             03770005
037800                ,:WS-PKSLIP-ORIG-PKSL-SEQ-NBR                     03780005
037900                   )                                              03790005
038000          END-EXEC                                                03800005
038100          WHEN DS009-PROCESS-TABLE = 'TPKITEM'                    03810005
038200          EXEC SQL                                                03820005
038300              INSERT INTO TPKITEM                                 03830005
038400                (                                                 03840005
038500                  PO_NBR                                          03850005
038600                 ,SEQ_NBR                                         03860005
038700                 ,PKSL_LNE_NBR                                    03870005
038800                 ,CRE_TMST                                        03880005
038900                 ,VER_STAT_CDE                                    03890005
039000                 ,PKSL_ITM_QTY                                    03900005
039100                 ,CRE_UID                                         03910005
039200                 ,PURITM_VER_NBR                                  03920005
039300                 ,ORIG_PKSL_ITM_QTY                               03930005
039400                )                                                 03940005
039500            VALUES (                                              03950005
039600                 :WS-PKITEM-PO-NBR                                03960005
039700                ,:WS-PKITEM-SEQ-NBR                               03970005
039800                ,:WS-PKITEM-PKSL-LNE-NBR                          03980005
039900                ,:WS-PKITEM-CRE-TMST                              03990005
040000                ,:WS-PKITEM-VER-STAT-CDE                          04000005
040100                ,:WS-PKITEM-PKSL-ITM-QTY                          04010005
040200                ,:WS-PKITEM-CRE-UID                               04020005
040300                ,:WS-PKITEM-PURITM-VER-NBR                        04030005
040400                ,:WS-PKITEM-ORIG-PKSL-ITM-QTY                     04040005
040500                   )                                              04050005
040600          END-EXEC                                                04060005
040700          WHEN DS009-PROCESS-TABLE = 'TRECEIV'                    04070005
040800*         DISPLAY 'WE-RECEIV' WS-RECEIV                           04080005
040900*         DISPLAY 'STAT CDE ' WS-RECEIV-STATUS-CDE                04090005
041000          EXEC SQL                                                04100005
041100              INSERT INTO TRECEIV                                 04110005
041200                (                                                 04120005
041300                  ORD_NBR                                         04130005
041400                 ,REC_SEQ_NBR                                     04140005
041500                 ,CRE_TMST                                        04150005
041600                 ,CRE_UID                                         04160005
041700                 ,PO_VER_NBR                                      04170005
041800                 ,OPER_UNT_ID                                     04180005
041900                 ,FCLTY_ID                                        04190005
042000                 ,STATUS_CDE                                      04200005
042100                 ,SYST_CRE_CDE                                    04210005
042200                 ,REC_TYP_CDE                                     04220005
042300                 ,VER_STATUS_CDE                                  04230005
042400                 ,PACK_BY_ST_IND                                  04240005
042500                 ,REC_TMST                                        04250005
042600                 ,EXPTED_CART_CNT                                 04260005
042700                 ,ACTL_CART_CNT                                   04270005
042800                 ,EXPTED_ITM_QTY                                  04280005
042900                 ,ACTL_ITM_QTY                                    04290005
043000                 ,RCVR_NBR                                        04300005
043100                 ,ML_POST_TMST                                    04310005
043200                 ,FS_POST_TMST                                    04320005
043300                 ,PRE_TKT_IND                                     04330005
043400                 ,AD_INFO_DESC                                    04340005
043500                 ,IN_TRBL_TMST                                    04350005
043600                 ,IN_TRBL_MIN_CNT                                 04360005
043700                 ,IN_TRBL_HOUR_CNT                                04370005
043800                 ,VERFYD_TMST                                     04380005
043900                 ,RCVG_CLERK_INIT_ID                              04390005
044000                 ,REFER_BACK_SEQ_NBR                              04400005
044100                 ,AP_PRC_CDE                                      04410005
044200                 ,AP_PRC_DTE                                      04420005
044300                 ,MIS_DIRECT_IND                                  04430005
044400                 ,IMPRT_IND                                       04440005
044500                 ,CRE_OPER_UNT_ID                                 04450005
044600                 ,CRE_FCLTY_ID                                    04460005
044700                 ,CURR_OPER_UNT_ID                                04470005
044800                 ,CURR_FCLTY_ID                                   04480005
044900                 ,UPD_TMST                                        04490005
045000                 ,UPD_UID                                         04500005
045100                 ,UPD_PGM_ID                                      04510005
045200                 ,APRON_LOC_DESC                                  04520005
045300                 ,MKNG_APRN_PRT_TMST                              04530005
045400                 ,GOH_IND                                         04540005
045500                 ,VRFD_USR_ID                                     04550005
045600                 ,AP_RVRSL_IND                                    04560005
045700                 ,AP_RVRSL_DTE                                    04570005
045800                 ,PKGNG_CDE                                       04580005
045900                )                                                 04590005
046000            VALUES (                                              04600005
046100                 :WS-RECEIV-ORD-NBR                               04610005
046200                ,:WS-RECEIV-REC-SEQ-NBR                           04620005
046300                ,:WS-RECEIV-CRE-TMST                              04630005
046400                ,:WS-RECEIV-CRE-UID                               04640005
046500                ,:WS-RECEIV-PO-VER-NBR                            04650005
046600                ,:WS-RECEIV-OPER-UNT-ID                           04660005
046700                ,:WS-RECEIV-FCLTY-ID                              04670005
046800                ,:WS-RECEIV-STATUS-CDE                            04680005
046900                ,:WS-RECEIV-SYST-CRE-CDE                          04690005
047000                ,:WS-RECEIV-REC-TYP-CDE                           04700005
047100                ,:WS-RECEIV-VER-STATUS-CDE                        04710005
047200                ,:WS-RECEIV-PACK-BY-ST-IND                        04720005
047300                ,:WS-RECEIV-REC-TMST                              04730005
047400                ,:WS-RECEIV-EXPTED-CART-CNT                       04740005
047500                ,:WS-RECEIV-ACTL-CART-CNT                         04750005
047600                ,:WS-RECEIV-EXPTED-ITM-QTY                        04760005
047700                ,:WS-RECEIV-ACTL-ITM-QTY                          04770005
047800                ,:WS-RECEIV-RCVR-NBR                              04780005
047900                ,:WS-RECEIV-ML-POST-TMST                          04790005
048000                ,:WS-RECEIV-FS-POST-TMST                          04800005
048100                ,:WS-RECEIV-PRE-TKT-IND                           04810005
048200                ,:WS-RECEIV-AD-INFO-DESC                          04820005
048300                ,:WS-RECEIV-IN-TRBL-TMST                          04830005
048400                ,:WS-RECEIV-IN-TRBL-MIN-CNT                       04840005
048500                ,:WS-RECEIV-IN-TRBL-HOUR-CNT                      04850005
048600                ,:WS-RECEIV-VERFYD-TMST                           04860005
048700                ,:WS-RECEIV-RCVG-CLERK-INIT-ID                    04870005
048800                ,:WS-RECEIV-REFER-BACK-SEQ-NBR                    04880005
048900                ,:WS-RECEIV-AP-PRC-CDE                            04890005
049000                ,:WS-RECEIV-AP-PRC-DTE                            04900005
049100                ,:WS-RECEIV-MIS-DIRECT-IND                        04910005
049200                ,:WS-RECEIV-IMPRT-IND                             04920005
049300                ,:WS-RECEIV-CRE-OPER-UNT-ID                       04930005
049400                ,:WS-RECEIV-CRE-FCLTY-ID                          04940005
049500                ,:WS-RECEIV-CURR-OPER-UNT-ID                      04950005
049600                ,:WS-RECEIV-CURR-FCLTY-ID                         04960005
049700                ,:WS-RECEIV-UPD-TMST                              04970005
049800                ,:WS-RECEIV-UPD-UID                               04980005
049900                ,:WS-RECEIV-UPD-PGM-ID                            04990005
050000                ,:WS-RECEIV-APRON-LOC-DESC                        05000005
050100                ,:WS-RECEIV-MKNG-APRN-PRT-TMST                    05010005
050200                ,:WS-RECEIV-GOH-IND                               05020005
050300                ,:WS-RECEIV-VRFD-USR-ID                           05030005
050400                ,:WS-RECEIV-AP-RVRSL-IND                          05040005
050500                ,:WS-RECEIV-AP-RVRSL-DTE                          05050005
050600                ,:WS-RECEIV-PKGNG-CDE                             05060005
050700                   )                                              05070005
050800          END-EXEC                                                05080005
050900          WHEN DS009-PROCESS-TABLE = 'TRECITM'                    05090005
051000          EXEC SQL                                                05100005
051100              INSERT INTO TRECITM                                 05110005
051200                (                                                 05120005
051300                  ORD_NBR                                         05130005
051400                 ,ORD_LNE_NBR                                     05140005
051500                 ,REC_SEQ_NBR                                     05150005
051600                 ,OPER_UNT_ID                                     05160005
051700                 ,FCLTY_ID                                        05170005
051800                 ,CRE_TMST                                        05180005
051900                 ,CRE_UID                                         05190005
052000                 ,PO_VER_NBR                                      05200005
052100                 ,ITM_NBR                                         05210005
052200                 ,PRE_TKT_IND                                     05220005
052300                 ,TKT_FMT_ID                                      05230005
052400                 ,RTV_IND                                         05240005
052500                 ,STATUS_CDE                                      05250005
052600                 ,VER_STATUS_CDE                                  05260005
052700                 ,PKSL_ITM_QTY                                    05270005
052800                 ,DTL_CK_ITM_QTY                                  05280005
052900                 ,INNR_PACK_QTY                                   05290005
053000                 ,CASE_PACK_QTY                                   05300005
053100                 ,RTV_QTY                                         05310005
053200                 ,EXPTED_CART_CNT                                 05320005
053300                 ,ACTL_CART_CNT                                   05330005
053400                 ,MKING_APRON_TMST                                05340005
053500                 ,UNT_COST_AMT                                    05350005
053600                 ,COLOR_DESC                                      05360005
053700                 ,SIZE_DESC                                       05370005
053800                 ,VEND_STYL_NAME                                  05380005
053900                 ,VEND_DESC                                       05390005
054000                 ,VERFYD_TMST                                     05400005
054100                 ,PKSL_NBR                                        05410005
054200                 ,REC_INV_LNE_NBR                                 05420005
054300                 ,DMG_ITM_QTY                                     05430005
054400                 ,UPD_TMST                                        05440005
054500                 ,UPD_UID                                         05450005
054600                 ,UPD_PGM_ID                                      05460005
054700                 ,RCPT_DISTR_UPD_CDE                              05470005
054800                 ,VRFD_USR_ID                                     05480005
054900                 ,LAST_TRSCP_TMST                                 05490005
055000                 ,LAST_TRSCP_USR_ID                               05500005
055100                 ,PREPK_ID                                        05510005
055200                 ,PREPK_RATO_QTY                                  05520005
055300                 ,PREPK_ODD_UNT_QTY                               05530005
055400                 ,PREPK_DRV_LNE_CDE                               05540005
055500                 ,UNT_RTL_AMT                                     05550005
055600                 ,GP_RTL_AMT                                      05560005
055700                 ,GP_QTY                                          05570005
055800                 ,ORIG_PKSL_ITM_QTY                               05580005
055900                )                                                 05590005
056000            VALUES (                                              05600005
056100                 :WS-RECITM-ORD-NBR                               05610005
056200                ,:WS-RECITM-ORD-LNE-NBR                           05620005
056300                ,:WS-RECITM-REC-SEQ-NBR                           05630005
056400                ,:WS-RECITM-OPER-UNT-ID                           05640005
056500                ,:WS-RECITM-FCLTY-ID                              05650005
056600                ,:WS-RECITM-CRE-TMST                              05660005
056700                ,:WS-RECITM-CRE-UID                               05670005
056800                ,:WS-RECITM-PO-VER-NBR                            05680005
056900                ,:WS-RECITM-ITM-NBR                               05690005
057000                ,:WS-RECITM-PRE-TKT-IND                           05700005
057100                ,:WS-RECITM-TKT-FMT-ID                            05710005
057200                ,:WS-RECITM-RTV-IND                               05720005
057300                ,:WS-RECITM-STATUS-CDE                            05730005
057400                ,:WS-RECITM-VER-STATUS-CDE                        05740005
057500                ,:WS-RECITM-PKSL-ITM-QTY                          05750005
057600                ,:WS-RECITM-DTL-CK-ITM-QTY                        05760005
057700                ,:WS-RECITM-INNR-PACK-QTY                         05770005
057800                ,:WS-RECITM-CASE-PACK-QTY                         05780005
057900                ,:WS-RECITM-RTV-QTY                               05790005
058000                ,:WS-RECITM-EXPTED-CART-CNT                       05800005
058100                ,:WS-RECITM-ACTL-CART-CNT                         05810005
058200                ,:WS-RECITM-MKING-APRON-TMST                      05820005
058300                ,:WS-RECITM-UNT-COST-AMT                          05830005
058400                ,:WS-RECITM-COLOR-DESC                            05840005
058500                ,:WS-RECITM-SIZE-DESC                             05850005
058600                ,:WS-RECITM-VEND-STYL-NAME                        05860005
058700                ,:WS-RECITM-VEND-DESC                             05870005
058800                ,:WS-RECITM-VERFYD-TMST                           05880005
058900                ,:WS-RECITM-PKSL-NBR                              05890005
059000                ,:WS-RECITM-REC-INV-LNE-NBR                       05900005
059100                ,:WS-RECITM-DMG-ITM-QTY                           05910005
059200                ,:WS-RECITM-UPD-TMST                              05920005
059300                ,:WS-RECITM-UPD-UID                               05930005
059400                ,:WS-RECITM-UPD-PGM-ID                            05940005
059500                ,:WS-RECITM-RCPT-DISTR-UPD-CDE                    05950005
059600                ,:WS-RECITM-VRFD-USR-ID                           05960005
059700                ,:WS-RECITM-LAST-TRSCP-TMST                       05970005
059800                ,:WS-RECITM-LAST-TRSCP-USR-ID                     05980005
059900                ,:WS-RECITM-PREPK-ID                              05990005
060000                ,:WS-RECITM-PREPK-RATO-QTY                        06000005
060100                ,:WS-RECITM-PREPK-ODD-UNT-QTY                     06010005
060200                ,:WS-RECITM-PREPK-DRV-LNE-CDE                     06020005
060300               , :WS-RECITM-UNT-RTL-AMT                           06030005
060400               , :WS-RECITM-GP-RTL-AMT                            06040005
060500               , :WS-RECITM-GP-QTY                                06050005
060600               , :WS-RECITM-ORIG-PKSL-ITM-QTY                     06060005
060700                   )                                              06070005
060800          END-EXEC                                                06080005
060900          WHEN DS009-PROCESS-TABLE = 'TRECDIS'                    06090005
061000          EXEC SQL                                                06100005
061100              INSERT INTO TRECDIS                                 06110005
061200                (                                                 06120005
061300                  ORD_NBR                                         06130005
061400                 ,ORD_LNE_NBR                                     06140005
061500                 ,REC_SEQ_NBR                                     06150005
061600                 ,OPER_UNT_ID                                     06160005
061700                 ,FCLTY_ID                                        06170005
061800                 ,CRE_TMST                                        06180005
061900                 ,CRE_UID                                         06190005
062000                 ,VER_STATUS_CDE                                  06200005
062100                 ,EXPTED_ITM_QTY                                  06210005
062200                 ,VERIFY_ITM_QTY                                  06220005
062300                 ,AP_VERIFY_ITM_QTY                               06230005
062400                 ,STR_NBR                                         06240005
062500                 ,STR_FCLTY_ID                                    06250005
062600                 ,PLAN_ITM_QTY                                    06260005
062700                 ,AP_PRC_CDE                                      06270005
062800                 ,AP_PRC_DTE                                      06280005
062900                )                                                 06290005
063000            VALUES (                                              06300005
063100                 :WS-RECDIS-ORD-NBR                               06310005
063200                ,:WS-RECDIS-ORD-LNE-NBR                           06320005
063300                ,:WS-RECDIS-REC-SEQ-NBR                           06330005
063400                ,:WS-RECDIS-OPER-UNT-ID                           06340005
063500                ,:WS-RECDIS-FCLTY-ID                              06350005
063600                ,:WS-RECDIS-CRE-TMST                              06360005
063700                ,:WS-RECDIS-CRE-UID                               06370005
063800                ,:WS-RECDIS-VER-STATUS-CDE                        06380005
063900                ,:WS-RECDIS-EXPTED-ITM-QTY                        06390005
064000                ,:WS-RECDIS-VERIFY-ITM-QTY                        06400005
064100                ,:WS-RECDIS-AP-VERIFY-ITM-QTY                     06410005
064200                ,:WS-RECDIS-STR-NBR                               06420005
064300                ,:WS-RECDIS-STR-FCLTY-ID                          06430005
064400                ,:WS-RECDIS-PLAN-ITM-QTY                          06440005
064500                ,:WS-RECDIS-AP-PRC-CDE                            06450005
064600                ,:WS-RECDIS-AP-PRC-DTE                            06460005
064700                   )                                              06470005
064800          END-EXEC                                                06480005
064900          WHEN DS009-PROCESS-TABLE = 'TSHIPMT'                    06490005
065000          EXEC SQL                                                06500005
065100              INSERT INTO TSHIPMT                                 06510005
065200                (                                                 06520005
065300                  TRIP_ID                                         06530005
065400                 ,SHIPT_ID                                        06540005
065500                 ,CRT_SRC_CDE                                     06550005
065600                 ,LAST_UPD_DTE                                    06560005
065700                 ,LAST_UPD_TME                                    06570005
065800                 ,LAST_UPD_UID                                    06580005
065900                 ,PRO_SCAC_ID                                     06590005
066000                 ,PRO_NBR                                         06600005
066100                 ,BOL_NBR                                         06610005
066200                 ,SHIPPER_NME                                     06620005
066300                 ,SHIPT_TYP_CDE                                   06630005
066400                 ,EXPTED_GRO_WGHT                                 06640005
066500                 ,PKG_TYP_CDE                                     06650005
066600                 ,EXPTED_PKG_QTY                                  06660005
066700                 ,FRGT_CHG_AMT                                    06670005
066800                 ,FRGT_TERMS_CDE                                  06680005
066900                 ,EXPTED_PLT_QTY                                  06690005
067000                 ,VEND_SHIP_DTE                                   06700005
067100                 ,EST_AR_TMST                                     06710005
067200                 ,ORIG_SCAC_ID                                    06720005
067300                 ,LAST_UPD_PGM_ID                                 06730005
067400                 ,CRE_USER_ID                                     06740005
067500                 ,CARR_CART_CT                                    06750005
067600                 ,CARR_LAST_UPD_DTE                               06760005
067700                 ,CARR_LAST_UPD_TIME                              06770005
067800                 ,VEND_CART_CT                                    06780005
067900                 ,VEND_LAST_UPD_DTE                               06790005
068000                 ,VEND_LAST_UPD_TIME                              06800005
068100                 ,VEH_NBR                                         06810005
068200                 ,AUTH_NBR                                        06820005
068300                 ,AUTH_DTE                                        06830005
068400                 ,CONFIRM_DTE                                     06840005
068500                 ,CONFIRM_TIME                                    06850005
068600                 ,COMPLETE_PRO_NBR                                06860005
068700                 ,COMPLETE_BOL_NBR                                06870005
068800                 ,PROCESSED_DTE                                   06880005
068900                 ,INVC_NBR                                        06890005
069000                 ,CARR_AUTH_ID                                    06900005
069100                )                                                 06910005
069200            VALUES (                                              06920005
069300                 :WS-SHIPMT-TRIP-ID                               06930005
069400                 :WS-SHIPMT-TRIP-ID-NN                            06940005
069500                ,:WS-SHIPMT-SHIPT-ID                              06950005
069600                ,:WS-SHIPMT-CRT-SRC-CDE                           06960005
069700                ,:WS-SHIPMT-LAST-UPD-DTE                          06970005
069800                ,:WS-SHIPMT-LAST-UPD-TME                          06980005
069900                ,:WS-SHIPMT-LAST-UPD-UID                          06990005
070000                ,:WS-SHIPMT-PRO-SCAC-ID                           07000005
070100                ,:WS-SHIPMT-PRO-NBR                               07010005
070200                ,:WS-SHIPMT-BOL-NBR                               07020005
070300                ,:WS-SHIPMT-SHIPPER-NME                           07030005
070400                ,:WS-SHIPMT-SHIPT-TYP-CDE                         07040005
070500                ,:WS-SHIPMT-EXPTED-GRO-WGHT                       07050005
070600                ,:WS-SHIPMT-PKG-TYP-CDE                           07060005
070700                ,:WS-SHIPMT-EXPTED-PKG-QTY                        07070005
070800                ,:WS-SHIPMT-FRGT-CHG-AMT                          07080005
070900                ,:WS-SHIPMT-FRGT-TERMS-CDE                        07090005
071000                ,:WS-SHIPMT-EXPTED-PLT-QTY                        07100005
071100                ,:WS-SHIPMT-VEND-SHIP-DTE                         07110005
071200                ,:WS-SHIPMT-EST-AR-TMST                           07120005
071300                 :WS-SHIPMT-EST-AR-TMST-NN                        07130005
071400                ,:WS-SHIPMT-ORIG-SCAC-ID                          07140005
071500                ,:WS-SHIPMT-LAST-UPD-PGM-ID                       07150005
071600                ,:WS-SHIPMT-CRE-USER-ID                           07160005
071700                ,:WS-SHIPMT-CARR-CART-CT                          07170005
071800                ,:WS-SHIPMT-CARR-LAST-UPD-DTE                     07180005
071900                ,:WS-SHIPMT-CARR-LAST-UPD-TIME                    07190005
072000                ,:WS-SHIPMT-VEND-CART-CT                          07200005
072100                ,:WS-SHIPMT-VEND-LAST-UPD-DTE                     07210005
072200                ,:WS-SHIPMT-VEND-LAST-UPD-TIME                    07220005
072300                ,:WS-SHIPMT-VEH-NBR                               07230005
072400                ,:WS-SHIPMT-AUTH-NBR                              07240005
072500                ,:WS-SHIPMT-AUTH-DTE                              07250005
072600                ,:WS-SHIPMT-CONFIRM-DTE                           07260005
072700                ,:WS-SHIPMT-CONFIRM-TIME                          07270005
072800                ,:WS-SHIPMT-COMPLETE-PRO-NBR                      07280005
072900                ,:WS-SHIPMT-COMPLETE-BOL-NBR                      07290005
073000                ,:WS-SHIPMT-PROCESSED-DTE                         07300005
073100                ,:WS-SHIPMT-INVC-NBR                              07310005
073200                ,:WS-SHIPMT-CARR-AUTH-ID                          07320005
073300                   )                                              07330005
073400          END-EXEC                                                07340005
073500             IF SQLCODE NOT = ZERO                                07350005
073600                 MOVE SQLCODE         TO PV-DISP-SQLCODE          07360005
073700                 DISPLAY 'TSHIPMT SQLCODE = ' PV-DISP-SQLCODE     07370005
073800                         ' TSHIPMT TRIP-ID = ' WS-SHIPMT-TRIP-ID  07380005
073900                         ' TSHIPMT SHIP-ID = ' WS-SHIPMT-SHIPT-ID 07390005
074000*                PERFORM DS002-SQL-ERROR                          07400005
074100             END-IF                                               07410005
074200          WHEN DS009-PROCESS-TABLE = 'TSHIPST'                    07420005
074300          EXEC SQL                                                07430005
074400              INSERT INTO TSHIPST                                 07440005
074500                (                                                 07450005
074600                  SHIPT_ID                                        07460005
074700                 ,SHIPT_STATUS_CDE                                07470005
074800                 ,STATUS_DTE                                      07480005
074900                 ,STATUS_TME                                      07490005
075000                 ,STATUS_UID                                      07500005
075100                 ,DELAY_RSN_CDE                                   07510005
075200                 ,CARR_STATUS_CDE                                 07520005
075300                 ,TIME_ZONE_CDE                                   07530005
075301                 ,CITY_NAME                                       07530105
075302                 ,STATE_CDE                                       07530205
075303                )                                                 07530305
075304            VALUES (                                              07530405
075305                 :WS-SHIPST-SHIPT-ID                              07530505
075306                ,:WS-SHIPST-SHIPT-STATUS-CDE                      07530605
075307                ,:WS-SHIPST-STATUS-DTE                            07530705
075308                ,:WS-SHIPST-STATUS-TME                            07530805
075309                ,:WS-SHIPST-STATUS-UID                            07530905
075310                ,:WS-SHIPST-DELAY-RSN-CDE                         07531005
075320                ,:WS-SHIPST-CARR-STATUS-CDE                       07532005
075330                ,:WS-SHIPST-TIME-ZONE-CDE                         07533005
075340                ,:WS-SHIPST-CITY-NAME                             07534005
075350                ,:WS-SHIPST-STATE-CDE                             07535005
075360                   )                                              07536005
075370          END-EXEC                                                07537005
075380          WHEN DS009-PROCESS-TABLE = 'TTRIPST'                    07538005
075390          EXEC SQL                                                07539005
075400              INSERT INTO TTRIPST                                 07540005
075500                (                                                 07550005
075600                  TRIP_ID                                         07560005
075700                 ,TRIP_STATUS_CDE                                 07570005
075800                 ,STATUS_DTE                                      07580005
075900                 ,STATUS_TME                                      07590005
076000                 ,STATUS_UID                                      07600005
076100                 ,OPER_UNT_ID                                     07610005
076200                 ,FCLTY_ID                                        07620005
076300                 ,FCLTY_AREA_ID                                   07630005
076400                )                                                 07640005
076500            VALUES (                                              07650005
076600                 :WS-TRIPST-TRIP-ID                               07660005
076700                ,:WS-TRIPST-TRIP-STATUS-CDE                       07670005
076800                ,:WS-TRIPST-STATUS-DTE                            07680005
076900                ,:WS-TRIPST-STATUS-TME                            07690005
077000                ,:WS-TRIPST-STATUS-UID                            07700005
077100                ,:WS-TRIPST-OPER-UNT-ID                           07710005
077200                ,:WS-TRIPST-FCLTY-ID                              07720005
077300                ,:WS-TRIPST-FCLTY-AREA-ID                         07730005
077400                   )                                              07740005
077500          END-EXEC                                                07750005
077600          WHEN DS009-PROCESS-TABLE = 'TVHTRIP'                    07760005
077700          EXEC SQL                                                07770005
077800              INSERT INTO TVHTRIP                                 07780005
077900                (                                                 07790005
078000                  OWNER_SCAC_ID                                   07800005
078100                 ,VEH_NBR                                         07810005
078200                 ,TRIP_ID                                         07820005
078300                 ,TRIP_BEG_DTE                                    07830005
078400                 ,TRIP_BEG_TME                                    07840005
078500                 ,CRT_SRC_CDE                                     07850005
078600                 ,LAST_UPD_DTE                                    07860005
078700                 ,LAST_UPD_TME                                    07870005
078800                 ,LAST_UPD_UID                                    07880005
078900                 ,MANIFEST_NBR                                    07890005
079000                 ,PLND_TRIP_SEQ                                   07900005
079100                 ,PLND_ACTVY_CDE                                  07910005
079200                 ,OWNR_SCAC_SHIP_DTE                              07920005
079300                 ,REF_TRIP_ID                                     07930005
079400                 ,EST_AR_TMST                                     07940005
079500                 ,SPLT_XMIT_IND                                   07950005
079600                 ,SPLT_XMIT_DTE                                   07960005
079700                 ,SPLT_XMIT_TM                                    07970005
079800                )                                                 07980005
079900            VALUES (                                              07990005
080000                 :WS-VHTRIP-OWNER-SCAC-ID                         08000005
080100                ,:WS-VHTRIP-VEH-NBR                               08010005
080200                 :WS-VHTRIP-VEH-NBR-NN                            08020005
080300                ,:WS-VHTRIP-TRIP-ID                               08030005
080400                ,:WS-VHTRIP-TRIP-BEG-DTE                          08040005
080500                ,:WS-VHTRIP-TRIP-BEG-TME                          08050005
080600                ,:WS-VHTRIP-CRT-SRC-CDE                           08060005
080700                ,:WS-VHTRIP-LAST-UPD-DTE                          08070005
080800                ,:WS-VHTRIP-LAST-UPD-TME                          08080005
080900                ,:WS-VHTRIP-LAST-UPD-UID                          08090005
081000                ,:WS-VHTRIP-MANIFEST-NBR                          08100005
081100                ,:WS-VHTRIP-PLND-TRIP-SEQ                         08110005
081200                ,:WS-VHTRIP-PLND-ACTVY-CDE                        08120005
081300                ,:WS-VHTRIP-OWNR-SCAC-SHIP-DTE                    08130005
081400                ,:WS-VHTRIP-REF-TRIP-ID                           08140005
081500                ,:WS-VHTRIP-EST-AR-TMST                           08150005
081600                 :WS-VHTRIP-EST-AR-TMST-NN                        08160005
081700                ,:WS-VHTRIP-SPLT-XMIT-IND                         08170005
081800                ,:WS-VHTRIP-SPLT-XMIT-DTE                         08180005
081900                ,:WS-VHTRIP-SPLT-XMIT-TM                          08190005
082000                )                                                 08200005
082100          END-EXEC                                                08210005
082200                                                                  08220005
082300          IF SQLCODE NOT = ZERO                                   08230005
082400             MOVE SQLCODE TO PV-DISP-SQLCODE                      08240005
082500             DISPLAY 'TVHTRIP SQLCODE= ' PV-DISP-SQLCODE          08250005
082600             MOVE WS-VHTRIP-TRIP-ID TO PV-DISP-NBR                08260005
082700             DISPLAY ' SCAC= ' WS-VHTRIP-OWNER-SCAC-ID            08270005
082800                     ' VEH= '  WS-VHTRIP-VEH-NBR                  08280005
082900                     'TRIP= '  PV-DISP-NBR                        08290005
083000         END-IF                                                   08300005
083100                                                                  08310005
083200          WHEN DS009-PROCESS-TABLE = 'TVEHICL'                    08320005
083300          EXEC SQL                                                08330005
083400              INSERT INTO TVEHICL                                 08340005
083500                (                                                 08350005
083600                  OWNER_SCAC_ID                                   08360005
083700                 ,VEH_NBR                                         08370005
083800                 ,CRT_SRC_CDE                                     08380005
083900                 ,LAST_UPD_DTE                                    08390005
084000                 ,LAST_UPD_TME                                    08400005
084100                 ,LAST_UPD_UID                                    08410005
084200                 ,USAGE_CDE                                       08420005
084300                 ,VEH_TYP_CDE                                     08430005
084400                 ,CURR_STATUS_CDE                                 08440005
084500                 ,CURR_STATUS_DTE                                 08450005
084600                 ,CURR_STATUS_TME                                 08460005
084700                 ,CURR_OPER_UNT_ID                                08470005
084800                 ,CURR_FCLTY_ID                                   08480005
084900                 ,CURR_FAC_AREA_ID                                08490005
085000                 ,CURR_LOC_DTE                                    08500005
085100                 ,CURR_LOC_TME                                    08510005
085200                 ,CURR_TRIP_ID                                    08520005
085300                 ,VEH_SIZE_CDE                                    08530005
085400                )                                                 08540005
085500             VALUES (                                             08550005
085600                 :WS-VEHICL-OWNER-SCAC-ID                         08560005
085700                ,:WS-VEHICL-VEH-NBR                               08570005
085800                ,:WS-VEHICL-CRT-SRC-CDE                           08580005
085900                ,:WS-VEHICL-LAST-UPD-DTE                          08590005
086000                ,:WS-VEHICL-LAST-UPD-TME                          08600005
086100                ,:WS-VEHICL-LAST-UPD-UID                          08610005
086200                ,:WS-VEHICL-USAGE-CDE                             08620005
086300                ,:WS-VEHICL-VEH-TYP-CDE                           08630005
086400                ,:WS-VEHICL-CURR-STATUS-CDE                       08640005
086500                ,:WS-VEHICL-CURR-STATUS-DTE                       08650005
086600                ,:WS-VEHICL-CURR-STATUS-TME                       08660005
086700                ,:WS-VEHICL-CURR-OPER-UNT-ID                      08670005
086800                ,:WS-VEHICL-CURR-FCLTY-ID                         08680005
086900                ,:WS-VEHICL-CURR-FAC-AREA-ID                      08690005
087000                ,:WS-VEHICL-CURR-LOC-DTE                          08700005
087100                ,:WS-VEHICL-CURR-LOC-TME                          08710005
087200                ,:WS-VEHICL-CURR-TRIP-ID                          08720005
087300                 :WS-VEHICL-CURR-TRIP-ID-NN                       08730005
087400                ,:WS-VEHICL-VEH-SIZE-CDE                          08740005
087500                   )                                              08750005
087600          END-EXEC                                                08760005
087700            WHEN DS009-PROCESS-TABLE = 'TRECDVS'                  08770005
087800               EXEC SQL                                           08780005
087900                  INSERT INTO TRECDVS                             08790005
088000                    (                                             08800005
088100                    ORD_NBR                                       08810005
088200                   ,ORD_LNE_NBR                                   08820005
088300                   ,REC_SEQ_NBR                                   08830005
088400                   ,STR_NBR                                       08840005
088500                   ,VRFY_SRC_CDE                                  08850005
088600                   ,EXPTED_ITM_QTY                                08860005
088700                   ,VRFY_ITM_QTY                                  08870005
088800                   ,VER_STAT_CDE                                  08880005
088900                    )                                             08890005
089000                VALUES (                                          08900005
089100                    :WS-RECDVS-ORD-NBR                            08910005
089200                   ,:WS-RECDVS-ORD-LNE-NBR                        08920005
089300                   ,:WS-RECDVS-REC-SEQ-NBR                        08930005
089400                   ,:WS-RECDVS-STR-NBR                            08940005
089500                   ,:WS-RECDVS-VRFY-SRC-CDE                       08950005
089600                   ,:WS-RECDVS-EXPTED-ITM-QTY                     08960005
089700                   ,:WS-RECDVS-VRFY-ITM-QTY                       08970005
089800                   ,:WS-RECDVS-VER-STAT-CDE                       08980005
089900                       )                                          08990005
090000               END-EXEC                                           09000005
090100            WHEN DS009-PROCESS-TABLE = 'TAUTRIP'                  09010005
090200               EXEC SQL                                           09020005
090300                  INSERT INTO TAUTRIP                             09030005
090400                    (                                             09040005
090500                     OWNER_SCAC_ID                                09050005
090600                    ,VEH_NBR                                      09060005
090700                    ,TRIP_ID                                      09070005
090800                    ,TRIP_BEG_DTE                                 09080005
090900                    ,TRIP_BEG_TME                                 09090005
091000                    ,CRT_SRC_CDE                                  09100005
091100                    ,LAST_UPD_DTE                                 09110005
091200                    ,LAST_UPD_TME                                 09120005
091300                    ,LAST_UPD_UID                                 09130005
091400                    ,MANIFEST_NBR                                 09140005
091500                    ,PLND_TRIP_SEQ                                09150005
091600                    ,PLND_ACTVY_CDE                               09160005
091700                    ,REF_TRIP_ID                                  09170005
091800                    ,EST_AR_TMST                                  09180005
091900                    ,OWNR_SCAC_SHIP_DTE                           09190005
092000                    ,AUD_STATUS_CDE                               09200005
092100                    ,SPLT_XMIT_IND                                09210005
092200                    ,SPLT_XMIT_DTE                                09220005
092300                    ,SPLT_XMIT_TM                                 09230005
092400                    )                                             09240005
092500                VALUES (                                          09250005
092600                      :WS-AUTRIP-OWNER-SCAC-ID                    09260005
092700                     ,:WS-AUTRIP-VEH-NBR                          09270005
092800                      :WS-AUTRIP-VEH-NBR-NN                       09280005
092900                     ,:WS-AUTRIP-TRIP-ID                          09290005
093000                     ,:WS-AUTRIP-TRIP-BEG-DTE                     09300005
093100                     ,:WS-AUTRIP-TRIP-BEG-TME                     09310005
093200                     ,:WS-AUTRIP-CRT-SRC-CDE                      09320005
093300                     ,:WS-AUTRIP-LAST-UPD-DTE                     09330005
093400                     ,:WS-AUTRIP-LAST-UPD-TME                     09340005
093500                     ,:WS-AUTRIP-LAST-UPD-UID                     09350005
093600                     ,:WS-AUTRIP-MANIFEST-NBR                     09360005
093700                     ,:WS-AUTRIP-PLND-TRIP-SEQ                    09370005
093800                     ,:WS-AUTRIP-PLND-ACTVY-CDE                   09380005
093900                     ,:WS-AUTRIP-REF-TRIP-ID                      09390005
094000                     ,:WS-AUTRIP-EST-AR-TMST                      09400005
094100                      :WS-AUTRIP-EST-AR-TMST-NN                   09410005
094200                     ,:WS-AUTRIP-OWNR-SCAC-SHIP-DTE               09420005
094300                     ,:WS-AUTRIP-AUD-STATUS-CDE                   09430005
094400                     ,:WS-AUTRIP-SPLT-XMIT-IND                    09440005
094500                     ,:WS-AUTRIP-SPLT-XMIT-DTE                    09450005
094600                     ,:WS-AUTRIP-SPLT-XMIT-TM                     09460005
094700                       )                                          09470005
094800               END-EXEC                                           09480005
094900          WHEN DS009-PROCESS-TABLE = 'TAUSHIP'                    09490005
095000             EXEC SQL                                             09500005
095100                INSERT INTO TAUSHIP                               09510005
095200                  (                                               09520005
095300                    TRIP_ID                                       09530005
095400                   ,SHIPT_ID                                      09540005
095500                   ,CRT_SRC_CDE                                   09550005
095600                   ,LAST_UPD_DTE                                  09560005
095700                   ,LAST_UPD_TME                                  09570005
095800                   ,LAST_UPD_UID                                  09580005
095900                   ,PRO_SCAC_ID                                   09590005
096000                   ,PRO_NBR                                       09600005
096100                   ,BOL_NBR                                       09610005
096200                   ,SHIPPER_NME                                   09620005
096300                   ,SHIPT_TYP_CDE                                 09630005
096400                   ,EXPTED_GRO_WGHT                               09640005
096500                   ,PKG_TYP_CDE                                   09650005
096600                   ,EXPTED_PKG_QTY                                09660005
096700                   ,FRGT_CHG_AMT                                  09670005
096800                   ,FRGT_TERMS_CDE                                09680005
096900                   ,EST_AR_TMST                                   09690005
097000                   ,VEND_SHIP_DTE                                 09700005
097100                   ,EXPTED_PLT_QTY                                09710005
097200                   ,ORIG_SCAC_ID                                  09720005
097300                   ,LAST_UPD_PGM_ID                               09730005
097400                   ,CRE_USER_ID                                   09740005
097500                   ,CARR_CART_CT                                  09750005
097600                   ,CARR_LAST_UPD_DTE                             09760005
097700                   ,CARR_LAST_UPD_TIME                            09770005
097800                   ,VEND_CART_CT                                  09780005
097900                   ,VEND_LAST_UPD_DTE                             09790005
098000                   ,VEND_LAST_UPD_TIME                            09800005
098100                   ,VEH_NBR                                       09810005
098200                   ,AUTH_NBR                                      09820005
098300                   ,AUTH_DTE                                      09830005
098400                   ,CONFIRM_DTE                                   09840005
098500                   ,CONFIRM_TIME                                  09850005
098600                   ,AUD_STATUS_CDE                                09860005
098700                   ,PROCESSED_DTE                                 09870005
098800                   ,INVC_NBR                                      09880005
098900                  )                                               09890005
099000              VALUES (                                            09900005
099100                   :WS-AUSHIP-TRIP-ID                             09910005
099200                   :WS-AUSHIP-TRIP-ID-NN                          09920005
099300                  ,:WS-AUSHIP-SHIPT-ID                            09930005
099400                  ,:WS-AUSHIP-CRT-SRC-CDE                         09940005
099500                  ,:WS-AUSHIP-LAST-UPD-DTE                        09950005
099600                  ,:WS-AUSHIP-LAST-UPD-TME                        09960005
099700                  ,:WS-AUSHIP-LAST-UPD-UID                        09970005
099800                  ,:WS-AUSHIP-PRO-SCAC-ID                         09980005
099900                  ,:WS-AUSHIP-PRO-NBR                             09990005
100000                  ,:WS-AUSHIP-BOL-NBR                             10000005
100100                  ,:WS-AUSHIP-SHIPPER-NME                         10010005
100200                  ,:WS-AUSHIP-SHIPT-TYP-CDE                       10020005
100300                  ,:WS-AUSHIP-EXPTED-GRO-WGHT                     10030005
100400                  ,:WS-AUSHIP-PKG-TYP-CDE                         10040005
100500                  ,:WS-AUSHIP-EXPTED-PKG-QTY                      10050005
100600                  ,:WS-AUSHIP-FRGT-CHG-AMT                        10060005
100700                  ,:WS-AUSHIP-FRGT-TERMS-CDE                      10070005
100800                  ,:WS-AUSHIP-EST-AR-TMST                         10080005
100900                   :WS-AUSHIP-EST-AR-TMST-NN                      10090005
101000                  ,:WS-AUSHIP-VEND-SHIP-DTE                       10100005
101100                  ,:WS-AUSHIP-EXPTED-PLT-QTY                      10110005
101200                  ,:WS-AUSHIP-ORIG-SCAC-ID                        10120005
101300                  ,:WS-AUSHIP-LAST-UPD-PGM-ID                     10130005
101400                  ,:WS-AUSHIP-CRE-USER-ID                         10140005
101500                  ,:WS-AUSHIP-CARR-CART-CT                        10150005
101600                  ,:WS-AUSHIP-CARR-LAST-UPD-DTE                   10160005
101700                  ,:WS-AUSHIP-CARR-LAST-UPD-TIME                  10170005
101800                  ,:WS-AUSHIP-VEND-CART-CT                        10180005
101900                  ,:WS-AUSHIP-VEND-LAST-UPD-DTE                   10190005
102000                  ,:WS-AUSHIP-VEND-LAST-UPD-TIME                  10200005
102100                  ,:WS-AUSHIP-VEH-NBR                             10210005
102200                  ,:WS-AUSHIP-AUTH-NBR                            10220005
102300                  ,:WS-AUSHIP-AUTH-DTE                            10230005
102400                  ,:WS-AUSHIP-CONFIRM-DTE                         10240005
102500                  ,:WS-AUSHIP-CONFIRM-TIME                        10250005
102600                  ,:WS-AUSHIP-AUD-STATUS-CDE                      10260005
102700                  ,:WS-AUSHIP-PROCESSED-DTE                       10270005
102800                  ,:WS-AUSHIP-INVC-NBR                            10280005
102900                     )                                            10290005
103000             END-EXEC                                             10300005
103100          WHEN DS009-PROCESS-TABLE = 'TAUSHPO'                    10310005
103200             EXEC SQL                                             10320005
103300                INSERT INTO TAUSHPO                               10330005
103400                  (                                               10340005
103500                    SHIPT_ID                                      10350005
103600                   ,PO_NBR                                        10360005
103700*                  ,DEPT_NBR                                      10370005
103800                   ,REC_SEQ_NBR                                   10380005
103900                   ,EXPTED_CART_CNT                               10390005
104000                   ,ACTL_CART_CNT                                 10400005
104100                   ,DMG_CART_CNT                                  10410005
104200                   ,PKSL_IND                                      10420005
104300                   ,VEND_NAME                                     10430005
104400                   ,FRGT_CHG_AMT                                  10440005
104500                   ,LAST_UPD_PGM_ID                               10450005
104600                   ,CRE_USER_ID                                   10460005
104700                   ,CARR_CART_CT                                  10470005
104800                   ,CARR_LAST_UPD_DTE                             10480005
104900                   ,CARR_LAST_UPD_TIME                            10490005
105000                   ,VEND_CART_CT                                  10500005
105100                   ,VEND_LAST_UPD_DTE                             10510005
105200                   ,VEND_LAST_UPD_TIME                            10520005
105300                   ,CRE_TMST                                      10530005
105400                   ,LAST_UPD_DTE                                  10540005
105500                   ,LAST_UPD_TIME                                 10550005
105600                   ,LAST_UPD_USER_ID                              10560005
105700                   ,PRIM_SHIPT_IND                                10570005
105800                   ,SPLT_XMIT_IND                                 10580005
105900                   ,SPLT_XMIT_DTE                                 10590005
106000                   ,SPLT_XMIT_TM                                  10600005
106100                   ,TRN_CDE                                       10610005
106200                  )                                               10620005
106300              VALUES (                                            10630005
106400                :WS-AUSHPO                                        10640005
106500                     )                                            10650005
106600             END-EXEC                                             10660005
106700          WHEN DS009-PROCESS-TABLE = 'TAUVHCL'                    10670005
106800             EXEC SQL                                             10680005
106900                INSERT INTO TAUVHCL                               10690005
107000                  (                                               10700005
107100                    OWNER_SCAC_ID                                 10710005
107200                   ,VEH_NBR                                       10720005
107300                   ,CRT_SRC_CDE                                   10730005
107400                   ,LAST_UPD_DTE                                  10740005
107500                   ,LAST_UPD_TME                                  10750005
107600                   ,LAST_UPD_UID                                  10760005
107700                   ,USAGE_CDE                                     10770005
107800                   ,VEH_TYP_CDE                                   10780005
107900                   ,CURR_STATUS_CDE                               10790005
108000                   ,CURR_STATUS_DTE                               10800005
108100                   ,CURR_STATUS_TME                               10810005
108200                   ,CURR_OPER_UNT_ID                              10820005
108300                   ,CURR_FCLTY_ID                                 10830005
108400                   ,CURR_FAC_AREA_ID                              10840005
108500                   ,CURR_LOC_DTE                                  10850005
108600                   ,CURR_LOC_TME                                  10860005
108700                   ,CURR_TRIP_ID                                  10870005
108800                   ,VEH_SIZE_CDE                                  10880005
108900                  )                                               10890005
109000              VALUES (                                            10900005
109100                   :WS-AUVHCL-OWNER-SCAC-ID                       10910005
109200                  ,:WS-AUVHCL-VEH-NBR                             10920005
109300                  ,:WS-AUVHCL-CRT-SRC-CDE                         10930005
109400                  ,:WS-AUVHCL-LAST-UPD-DTE                        10940005
109500                  ,:WS-AUVHCL-LAST-UPD-TME                        10950005
109600                  ,:WS-AUVHCL-LAST-UPD-UID                        10960005
109700                  ,:WS-AUVHCL-USAGE-CDE                           10970005
109800                  ,:WS-AUVHCL-VEH-TYP-CDE                         10980005
109900                  ,:WS-AUVHCL-CURR-STATUS-CDE                     10990005
110000                  ,:WS-AUVHCL-CURR-STATUS-DTE                     11000005
110100                  ,:WS-AUVHCL-CURR-STATUS-TME                     11010005
110200                  ,:WS-AUVHCL-CURR-OPER-UNT-ID                    11020005
110300                  ,:WS-AUVHCL-CURR-FCLTY-ID                       11030005
110400                  ,:WS-AUVHCL-CURR-FAC-AREA-ID                    11040005
110500                  ,:WS-AUVHCL-CURR-LOC-DTE                        11050005
110600                  ,:WS-AUVHCL-CURR-LOC-TME                        11060005
110700                  ,:WS-AUVHCL-CURR-TRIP-ID                        11070005
110800                   :WS-AUVHCL-CURR-TRIP-ID-NN                     11080005
110900                  ,:WS-AUVHCL-VEH-SIZE-CDE                        11090005
111000                     )                                            11100005
111100             END-EXEC                                             11110005
111200          WHEN DS009-PROCESS-TABLE = 'TDISTHD'                    11120005
111300             EXEC SQL                                             11130005
111400                INSERT INTO TDISTHD                               11140005
111500                  (                                               11150005
111600                   ORD_NBR                                        11160005
111700                  ,RCVR_SEQ_NBR                                   11170005
111800                  ,ORD_LNE_NBR                                    11180005
111900                  ,WRK_ORD_SEQ_NBR                                11190005
112000                  ,OPER_UNT_ID                                    11200005
112100                  ,DISTRB_PRC_AREA_ID                             11210005
112200                  ,PRCG_STAT_CDE                                  11220005
112300                  ,CRE_TMST                                       11230005
112400                  ,RSLTS_RCVD_TMST                                11240005
112500                  ,VRFD_TMST                                      11250005
112600                  ,PRC_AREA_MODU_ID                               11260005
112700                  ,CRE_USR_ID                                     11270005
112800                  ,TOT_CART_CNT                                   11280005
112900                  ,CART_DWNLD_DTE                                 11290005
113000                  ,CART_DWNLD_TM                                  11300005
113100                  ,CART_DWNLD_USR_ID                              11310005
113200                  ,FCSE_CART_CNT                                  11320005
113300                  ,FCSE_LBL_TYP_CDE                               11330005
113400                  ,P2L_CART_CNT                                   11340005
113500                  ,INPK_CART_CNT                                  11350005
113600                  ,INPK_UNT_QTY                                   11360005
113700                  ,INPK_CNVYB_IND                                 11370005
113800                  ,OTPK_UNT_QTY                                   11380005
113900                  ,SYS_CRE_CDE                                    11390005
114000                  ,SPC_INSTR_DESC                                 11400005
114100                  ,FCSE_CNFRMN_TMST                               11410005
114200                  ,FCSE_CNFRMN_USR_ID                             11420005
114300                  ,FCSE_CNFRMN_PGM_ID                             11430005
114400                  ,ACTV_IND                                       11440005
114500                  ,DLT_REQ_SRC_ID                                 11450005
114600                  ,DLT_REQ_TMST                                   11460005
114700                  ,DLT_RSLT_CDE                                   11470005
114800                  ,P2L_SCN_CART_CNT                               11480005
114900                  ,CRE_LBL_OPT_CDE                                11490005
115000                  ,FCSE_FCLTY_AREA_ID                             11500005
115100                  ,ODD_CART_UNT_QTY                               11510005
115200                  ,PREPK_LNE_PRC_CDE                              11520005
115300                  ,UCC128_DAT_USG_CDE                             11530005
115400                  ,CAL_UNT_PRCD_QTY                               11540005
115500                  )                                               11550005
115600              VALUES (                                            11560005
115700                :WS-DISTHD                                        11570005
115800                     )                                            11580005
115900             END-EXEC                                             11590005
116000          WHEN DS009-PROCESS-TABLE = 'TDISTDT'                    11600005
116100             EXEC SQL                                             11610005
116200                INSERT INTO TDISTDT                               11620005
116300                  (                                               11630005
116400                   ORD_NBR                                        11640005
116500                  ,RCVR_SEQ_NBR                                   11650005
116600                  ,ORD_LNE_NBR                                    11660005
116700                  ,WRK_ORD_SEQ_NBR                                11670005
116800                  ,STR_NBR                                        11680005
116900                  ,EXPTED_ALLOC_QTY                               11690005
117000                  ,ACTL_ALLOC_QTY                                 11700005
117100                  ,RCVG_PSTD_STAT_CDE                             11710005
117200                  ,P2L_SPLT_UNT_QTY                               11720005
117300                  ,FCSE_SPLT_UNT_QTY                              11730005
117400                  ,INPK_SPLT_UNT_QTY                              11740005
117500                  ,FCSE_ACTL_UNT_QTY                              11750005
117600                  ,ODD_CART_IND                                   11760005
117700                  ,PREPK_ODD_UNT_QTY                              11770005
117800                  )                                               11780005
117900              VALUES (                                            11790005
118000                :WS-DISTDT                                        11800005
118100                     )                                            11810005
118200             END-EXEC                                             11820005
118300          WHEN DS009-PROCESS-TABLE = 'TWRKORD'                    11830005
118400             EXEC SQL                                             11840005
118500                INSERT INTO TWRKORD                               11850005
118600                  (                                               11860005
118700                   ORD_NBR                                        11870005
118800                  ,RCVR_SEQ_NBR                                   11880005
118900                  ,ORD_LNE_NBR                                    11890005
119000                  ,WORK_ORD_SEQ_NBR                               11900005
119100                  ,OPER_UNT_ID                                    11910005
119200                  ,FCLTY_ID                                       11920005
119300                  ,CRE_TMST                                       11930005
119400                  ,VER_STATUS_CDE                                 11940005
119500                  ,CRE_UID_ID                                     11950005
119600                  ,EXPTED_CART_CNT                                11960005
119700                  ,ACTL_CART_CNT                                  11970005
119800                  ,EXPTED_ITM_CNT                                 11980005
119900                  ,ACTL_ITM_CNT                                   11990005
120000                  ,STAT_CDE                                       12000005
120100                  ,WORK_ORD_DISTR_IND                             12010005
120200                  ,OPER_SET_ID                                    12020005
120300                  ,INST_CART_CNT                                  12030005
120400                  ,INST_LNE_LOC_CDE                               12040005
120500                  ,INST_PRC_AREA_ID                               12050005
120600                  ,WO_INSTR_SEL_IND                               12060005
120700                  ,INST_ITM_CNT                                   12070005
120800                  )                                               12080005
120900              VALUES (                                            12090005
121000                :WS-WRKORD                                        12100005
121100                     )                                            12110005
121200             END-EXEC                                             12120005
121300          WHEN DS009-PROCESS-TABLE = 'TWKORIN'                    12130005
121400             EXEC SQL                                             12140005
121500                INSERT INTO TWKORIN                               12150005
121600                  (                                               12160005
121700                   ORD_NBR                                        12170005
121800                  ,RCVR_SEQ_NBR                                   12180005
121900                  ,ORD_LNE_NBR                                    12190005
122000                  ,WORK_ORD_SEQ_NBR                               12200005
122100                  ,OPER_UNT_ID                                    12210005
122200                  ,FCLTY_ID                                       12220005
122300                  ,WO_INSTR_SEQ_NBR                               12230005
122400                  ,CRE_TMST                                       12240005
122500                  ,VER_STATUS_CDE                                 12250005
122600                  ,CRE_UID_ID                                     12260005
122700                  ,OPER_ID                                        12270005
122800                  ,FCLTY_AREA_ID                                  12280005
122900                  ,PRC_FCLTY_AREA_ID                              12290005
123000                  ,EXPTED_CART_CNT                                12300005
123100                  ,ACTL_CART_CNT                                  12310005
123200                  ,ALLOC_IND                                      12320005
123300                  ,REPACK_IND                                     12330005
123400                  ,STRT_TMST                                      12340005
123500                  ,STOP_TMST                                      12350005
123600                  ,SCREEN_SEQ_NBR                                 12360005
123700                  ,LNE_LOC_CDE                                    12370005
123800                  ,REC_SEL_IND                                    12380005
123900                  )                                               12390005
124000              VALUES (                                            12400005
124100                :WS-WKORIN                                        12410005
124200                     )                                            12420005
124300             END-EXEC                                             12430005
124400          WHEN DS009-PROCESS-TABLE = 'TSHPSUM'                    12440005
124500             EXEC SQL                                             12450005
124600                INSERT INTO TSHPSUM                               12460005
124700                  (                                               12470005
124800                     PO_NBR                                       12480005
124900                    ,PKSL_SEQ_NBR                                 12490005
125000                    ,CART_COMB_NBR                                12500005
125100                    ,PO_LNE_NBR                                   12510005
125200                    ,TOT_CART_CNT                                 12520005
125300                    ,OTPK_UNT_QTY                                 12530005
125400                    ,CRE_TMST                                     12540005
125500                  )                                               12550005
125600              VALUES (                                            12560005
125700                :WS-SHPSUM                                        12570005
125800                     )                                            12580005
125900             END-EXEC                                             12590005
126000          WHEN DS009-PROCESS-TABLE = 'TLBVRDA'                    12600005
126100             EXEC SQL                                             12610005
126200                INSERT INTO TLBVRDA                               12620005
126300                  (                                               12630005
126400                      PO_NBR                                      12640005
126500                     ,RCVR_SEQ_NBR                                12650005
126600                     ,PO_LNE_NBR                                  12660005
126700                     ,PREPK_ID                                    12670005
126800                     ,OTPK_UNT_QTY                                12680005
126900                     ,LBL_ASG_IND                                 12690005
127000                     ,LBL_TYP_CDE                                 12700005
127100                     ,LBL_ASG_SEQ_NBR                             12710005
127200                     ,PRNT_CART_SEQ_ID                            12720005
127300                     ,CART_LBL_TYP_CDE                            12730005
127400                     ,PREPK_PRCG_LNE_NBR                          12740005
127500                     ,INPK_UNT_QTY                                12750005
127600                     ,PREPK_RATO_QTY                              12760005
127700                     ,PREPK_UNT_QTY                               12770005
127800                     ,DEST_OPER_UNT_ID                            12780005
127900                     ,CSE_PK_QTY                                  12790005
128000                     ,ODD_CART_IND                                12800005
128100                     ,INPK_CNVYB_IND                              12810005
128200                     ,LBL_TYP_LBL_SEQ_ID                          12820005
128300                     ,LBL_TYP_TOT_QTY                             12830005
128400                     ,BRCDE_NBR                                   12840005
128500                     ,STR_ZN_ID                                   12850005
128600                     ,MODU_DESC                                   12860005
128700                     ,ITM_NBR                                     12870005
128800                     ,DEPT_DESC                                   12880005
128900                     ,MAJ_CL_DESC                                 12890005
129000                     ,SEASET_NM                                   12900005
129100                     ,FIXT_ID                                     12910005
129200                     ,STRG_AREA_CDE                               12920005
129300                     ,RCLM_IND                                    12930005
129400*CLP 03/21/2016                                                   12940005
129500                     ,LBL_MSG_TXT                                 12950005
129600                  )                                               12960005
129700              VALUES (                                            12970005
129800                :WS-LBVRDA-PO-NBR                                 12980005
129900               ,:WS-LBVRDA-RCVR-SEQ-NBR                           12990005
130000               ,:WS-LBVRDA-PO-LNE-NBR                             13000005
130100               ,:WS-LBVRDA-PREPK-ID                               13010005
130200               ,:WS-LBVRDA-OTPK-UNT-QTY                           13020005
130300               ,:WS-LBVRDA-LBL-ASG-IND                            13030005
130400               ,:WS-LBVRDA-LBL-TYP-CDE                            13040005
130500               ,:WS-LBVRDA-LBL-ASG-SEQ-NBR                        13050005
130600               ,:WS-LBVRDA-PRNT-CART-SEQ-ID                       13060005
130700               ,:WS-LBVRDA-CART-LBL-TYP-CDE                       13070005
130800               ,:WS-LBVRDA-PREPK-PRCG-LNE-NBR                     13080005
130900               ,:WS-LBVRDA-INPK-UNT-QTY                           13090005
131000               ,:WS-LBVRDA-PREPK-RATO-QTY                         13100005
131100               ,:WS-LBVRDA-PREPK-UNT-QTY                          13110005
131200               ,:WS-LBVRDA-DEST-OPER-UNT-ID                       13120005
131300               ,:WS-LBVRDA-CSE-PK-QTY                             13130005
131400               ,:WS-LBVRDA-ODD-CART-IND                           13140005
131500               ,:WS-LBVRDA-INPK-CNVYB-IND                         13150005
131600               ,:WS-LBVRDA-LBL-TYP-LBL-SEQ-ID                     13160005
131700               ,:WS-LBVRDA-LBL-TYP-TOT-QTY                        13170005
131800               ,:WS-LBVRDA-BRCDE-NBR                              13180005
131900               ,:WS-LBVRDA-STR-ZN-ID                              13190005
132000               ,:WS-LBVRDA-MODU-DESC                              13200005
132100               ,:WS-LBVRDA-ITM-NBR                                13210005
132200               ,:WS-LBVRDA-DEPT-DESC                              13220005
132300               ,:WS-LBVRDA-MAJ-CL-DESC                            13230005
132400               ,:WS-LBVRDA-SEASET-NM                              13240005
132500               ,:WS-LBVRDA-FIXT-ID                                13250005
132600               ,:WS-LBVRDA-STRG-AREA-CDE                          13260005
132700               ,:WS-LBVRDA-RCLM-IND                               13270005
132800*CLP 03/21/2016                                                   13280005
132900               ,:WS-LBVRDA-LBL-MSG-TXT                            13290005
133000                     )                                            13300005
133100             END-EXEC                                             13310005
133200          WHEN DS009-PROCESS-TABLE = 'TLBPTDA'                    13320005
133300             EXEC SQL                                             13330005
133400                INSERT INTO TLBPTDA                               13340005
133500                  (                                               13350005
133600                         TRIP_ID                                  13360005
133700                        ,CRE_USR_ID                               13370005
133800                        ,LBL_PRT_BTCH_ID                          13380005
133900                        ,SHIPT_UNT_ID                             13390005
134000                        ,OPER_UNT_ID                              13400005
134100                        ,FCLTY_ID                                 13410005
134200                        ,CRE_TMST                                 13420005
134300                        ,OWNR_SCAC_ID                             13430005
134400                        ,VEH_NBR                                  13440005
134500                        ,RPRT_IND                                 13450005
134600                        ,SU_DUP_LBL_IND                           13460005
134700                        ,SU_FRE_ASTRA_IND                         13470005
134800                        ,SU_MSSG_DAT_IND                          13480005
134900                        ,SU_MISDIR_IND                            13490005
135000                        ,MISDIR_OPER_UNT_ID                       13500005
135100                        ,PO_NBR                                   13510005
135200                        ,RCVR_SEQ_NBR                             13520005
135300                        ,PO_LNE_NBR                               13530005
135400                        ,DEST_OPER_UNT_ID                         13540005
135500                        ,STR_NM                                   13550005
135600                        ,STR_ZN_ID                                13560005
135700                        ,SKU_DEPT_NBR                             13570005
135800                        ,SKU_CL_NBR                               13580005
135900                        ,VS_NBR                                   13590005
136000                        ,OTPK_UNT_QTY                             13600005
136100                        ,INPK_UNT_QTY                             13610005
136200                        ,PRTR_ID                                  13620005
136300                        ,BRCDE_NBR                                13630005
136400                        ,DC_PRTD_AT_CDE                           13640005
136500                        ,INVLD_DAT_ERR_CDE                        13650005
136600                        ,PREPK_ID                                 13660005
136700                        ,PREPK_RATO_QTY                           13670005
136800                        ,PREPK_UNT_QTY                            13680005
136900                        ,CSE_PK_QTY                               13690005
137000                        ,ODD_CART_IND                             13700005
137100                        ,INPK_CNVYB_IND                           13710005
137200                        ,LBL_TYP_LBL_SEQ_ID                       13720005
137300                        ,LBL_TYP_TOT_QTY                          13730005
137400                        ,MODU_DESC                                13740005
137500                        ,ITM_NBR                                  13750005
137600                        ,DEPT_DESC                                13760005
137700                        ,MAJ_CL_DESC                              13770005
137800                        ,SEASET_NM                                13780005
137900                        ,FIXT_ID                                  13790005
138000                        ,CART_LBL_TYP_CDE                         13800005
138100                        ,STRG_AREA_CDE                            13810005
138200                        ,CART_ACTN_CDE                            13820005
138300                        ,HNG_FOLD_SEQ_NBR                         13830005
138400                        ,BUS_AREA_ID                              13840005
138500                        ,SKU_NBR                                  13850005
138600***CLP 03/21/2016                                                 13860005
138700                        ,LBL_MSG_TXT                              13870005
138800                  )                                               13880005
138900              VALUES (                                            13890005
139000                :WS-LBPTDA                                        13900005
139100                     )                                            13910005
139200             END-EXEC                                             13920005
139300          END-EVALUATE                                            13930005
139400                                                                  13940005
139500     END-PERFORM.                                                 13950005
139600                                                                  13960005
139700     PERFORM DS002-SQL-ABEND-INSERT.                              13970005
139800 EJECT                                                            13980005
139900                                                                  13990005
140000 1100-GET-DB2-INSTANCE.                                           14000005
140100                                                                  14010005
140200     MOVE '1100-GET-DB2-INSTANCE'                                 14020005
140300          TO DS009-PARAGRAPH.                                     14030005
140400     MOVE 'GET DB2 INSTANCE'                                      14040005
140500          TO DS009-OPERATION.                                     14050005
140600                                                                  14060005
140700     EXEC SQL                                                     14070005
140800         SELECT CURRENT SERVER INTO :WS-LOCAL-SERVER              14080005
140900             FROM SYSIBM.SYSDUMMY1 WITH UR                        14090005
141000     END-EXEC.                                                    14100005
141100                                                                  14110005
141200     EVALUATE TRUE                                                14120005
141300         WHEN SQLCODE = +0                                        14130005
141310             CONTINUE                                             14131005
141320         WHEN SQLWARN0 NOT = SPACES                               14132005
141330         WHEN SQLCODE < +0                                        14133005
141340         WHEN SQLCODE > +0                                        14134005
141350             PERFORM DS002-SQL-ERROR                              14135005
141360     END-EVALUATE.                                                14136005
141370*                                                                 14137005
141380 1200-CHECK-IF-PRODUCTION.                                        14138005
141390                                                                  14139005
141391     MOVE '1200-CHECK-IF-PRODUCTION'                              14139105
141392          TO DS009-PARAGRAPH.                                     14139205
141393     MOVE 'SELECT PRDCHK TKRPRPM '                                14139305
141394          TO DS009-OPERATION.                                     14139405
141395                                                                  14139505
141396     EXEC SQL                                                     14139605
141397       SELECT FUNC_TXT                                            14139705
141398         INTO :KRPRPM-FUNC-TXT                                    14139805
141399       FROM   TKRPRPM                                             14139905
141400       WHERE  SYS_PRC_FUNC_CDE  = :PC-PRDCHK                      14140005
141401         AND  INTFC_SYS_CDE     = :PC-KHL                         14140105
141402         AND  LOC_ID            = :PC-90                          14140205
141403         AND  FUNC_TXT          = :PC-PARM-TEXT                   14140305
141404     END-EXEC                                                     14140405
141405                                                                  14140505
141406     EVALUATE TRUE                                                14140605
141407         WHEN SQLCODE = +0                                        14140705
141408             CONTINUE                                             14140805
141409         WHEN SQLCODE = +100                                      14140905
141410             DISPLAY '*******************************************'14141005
141411             DISPLAY '** ABEND - DO NOT RUN THIS DSKUT007 PROGRAM'14141105
141412             DISPLAY '** ABEND - AGAINST PRODUCTION'              14141205
141413             DISPLAY '** ABEND - THIS SHOULD ONLY EVER BE'        14141305
141414             DISPLAY '** ABEND - RUN AGAINST TEST DATA'           14141405
141415             DISPLAY '*******************************************'14141505
141416             DISPLAY '** ABEND - THIS RUN IS GOING AGAINST'       14141605
141417             DISPLAY '** ABEND - DB2 INSTANCE:  '                 14141705
141418                     WS-LOCAL-SERVER                              14141805
141419             DISPLAY '*******************************************'14141905
141420             PERFORM DS002-SQL-ERROR                              14142005
141421                                                                  14142105
141422         WHEN SQLWARN0 NOT = SPACES                               14142205
141423         WHEN SQLCODE < +0                                        14142305
141424         WHEN SQLCODE > +0                                        14142405
141425             PERFORM DS002-SQL-ERROR                              14142505
141426     END-EVALUATE.                                                14142605
141427                                                                  14142705
141428 9000-DUMP-COUNT-TABLE.                                           14142805
141429                                                                  14142905
141430     DISPLAY '  ****  INSERT TOTALS  ****'                        14143005
141431                                                                  14143105
141432     PERFORM VARYING CNTL-I FROM 1 BY 1 UNTIL                     14143205
141433           CNTL-I > CNTL-SUB-MAX OR CNTL-I > 200                  14143305
141434         IF CNTL-TABLE(CNTL-I) NOT = SPACES                       14143405
141435             IF DS009-GROUP-NBR(CNTL-I) = '2'                     14143505
141436                 MOVE DS009-READ-COUNT (CNTL-I) TO DS009-DISP-NBR 14143605
141437                 DISPLAY 'TABLE = ' CNTL-TABLE(CNTL-I)            14143705
141438                              DS009-DISP-NBR                      14143805
141439                 ADD DS009-READ-COUNT (CNTL-I) TO PV-TOTAL-COUNT  14143905
141440             END-IF                                               14144005
141450         END-IF                                                   14145005
141460     END-PERFORM.                                                 14146005
141470                                                                  14147005
141480     MOVE PV-TOTAL-COUNT            TO DS009-DISP-NBR             14148005
141490     DISPLAY SPACES.                                              14149005
141500     DISPLAY '**  TOTAL INSERTS = ' DS009-DISP-NBR.               14150005
141600/                                                                 14160005
141700***************************************************************** 14170005
141800*     PRODUCTION - TO - TEST STANDARD PARAGRAPHS                * 14180005
141900***************************************************************** 14190005
142000     COPY DSPD002.                                                14200005
