000100 IDENTIFICATION DIVISION.                                         00010013
000200 PROGRAM-ID.     DSKUT004.                                        00020013
000300 AUTHOR.         RICHARD MOORE.                                   00030013
000400 DATE-WRITTEN.   12/01/98.                                        00040013
000500 DATE-COMPILED.                                                   00050013
000600                                                                  00060013
000700******************************************************************00070013
000800*                                                                 00080013
000900*PURPOSE:   INSERT GROUP1 DATA                                    00090013
001000*                                                                 00100013
001100******************************************************************00110013
001200*CHANGE HISTORY:                                                  00120013
001300* WR/PROJ  DATE        DESCRIPTION OF CHANGES                     00130013
001400* -------  ----------  ----------------------------------------   00140013
001500* RWJ      05-02-2003  VSM REQUESTED CHANGES TO PROD TO TEST PER  00150013
001600*                      PAUL KEBER. - ROD JANSSEN                  00160013
001700*                      LOGIC REMOVAL FOR TABLES:                  00170013
001800*                       TSK       TUPC        TUPCSKU             00180013
001900*                       TSKXREF   TMDARVS     TUPCPLS             00190013
002000*                       TVNDSTL   TEXTENT     TENTNME             00200013
002100*                       TMDSEAR                                   00210013
002200* PJK      05-24-2007  TVNDDPT REMOVED TO BE ADDED TO VSM UPDATES 00220013
002200* J KURK   03-2021     REMOVE TPOUPC AND TSPSTDS                  00221014
004510* J KURK   08-2022     RECOMPILE FOR COPYBOOK DSPD002             00222022
004510* J KURK   04-2023     ADD LOC_NBR TO TASNORD                     00223023
004510*                      ADD TABLES TTRDPRT, TFGTRST, TINTTRN       00224024
002300******************************************************************00230013
002400                                                                  00240013
002500 ENVIRONMENT DIVISION.                                            00250013
002600 INPUT-OUTPUT SECTION.                                            00260013
002700 FILE-CONTROL.                                                    00270013
002800                                                                  00280013
002900     SELECT PO-NBR-FILE                                           00290013
003000         ASSIGN         TO UT-S-PO01.                             00300013
003100     SELECT TBLE-FILE                                             00310013
003200         ASSIGN         TO UT-S-TBL01.                            00320013
003300     SELECT CONTROL-FILE                                          00330013
003400         ASSIGN         TO UT-S-CTL01.                            00340013
003500                                                                  00350013
003600 DATA DIVISION.                                                   00360013
003700 FILE SECTION.                                                    00370013
003800     COPY DSFD001.                                                00380013
003900                                                                  00390013
004000******************************************************************00400013
004100 WORKING-STORAGE SECTION.                                         00410013
004200******************************************************************00420013
004300     COPY DSWS008.                                                00430013
004400     COPY DSWS009.                                                00440013
004500     COPY DSWS010.                                                00450013
004600     COPY DSRD002.                                                00460013
004700     COPY DPWS004.                                                00470013
004800                                                                  00480013
004900***CLP 08/04/2015 TABLES NEEDED FOR BRAND                         00490013
005000******************************************************************00500013
005100*  DCLGEN FOR XLT_BRND TABLE *                                    00510013
005200******************************************************************00520013
005300* CLP TAKE OUT IN DSWS011                                         00530013
005400*    EXEC SQL                                                     00540013
005500*         INCLUDE XLT00043                                        00550013
005600*    END-EXEC.                                                    00560013
005700******************************************************************00570013
005800*  DCLGEN FOR TMDARVS TABLE *                                     00580013
005900******************************************************************00590013
006000*    EXEC SQL                                                     00600013
006100*         INCLUDE TMDARVS                                         00610013
006200*    END-EXEC.                                                    00620013
006300******************************************************************00630013
006400*  DCLGEN FOR TVSCHVL TABLE *                                     00640013
006500******************************************************************00650013
006600*    EXEC SQL                                                     00660013
006700*         INCLUDE TVSCHVL                                         00670013
006800*    END-EXEC.                                                    00680013
006900******************************************************************00690013
007000*  DCLGEN FOR IMT_LBL TABLE *                                     00700013
007100******************************************************************00710013
007200* CLP IN DSWS011                                                  00720013
007300*    EXEC SQL                                                     00730013
007400*         INCLUDE IMT00000                                        00740013
007500*    END-EXEC.                                                    00750013
007600***CLP 08/04/2015 END                                             00760013
007700                                                                  00770013
007800******************************************************************00780013
007900 01  OTHER-CRAPOLA.                                               00790013
008000     05  PV-READ-COUNT                PIC S9(9) COMP-3 VALUE      00800013
008100                                                   ZERO.          00810013
008200     05  PV-TOTAL-COUNT               PIC S9(9) COMP-3 VALUE      00820013
008300                                                   ZERO.          00830013
008400     05  PV-DISPLAY-NBR               PIC Z(17)9.                 00840013
008400     05  PV-NULL                      PIC S9(04) COMP VALUE +0.   00841037
008500     05  PV-WHEN-COMPILED.                                        00850013
008600         10  PV-COMPILE-DATE          PIC X(08).                  00860013
008700         10  PV-COMPILE-TIME          PIC X(08).                  00870013
008701                                                                  00870113
008702 01  PC-CONSTANTS.                                                00870213
008703     05  PC-90                       PIC S9(04)    COMP           00870313
008704                                                   VALUE 90.      00870413
008705     05  PC-A                        PIC  X(01)    VALUE 'A'.     00870513
008706     05  PC-Y                        PIC  X(01)    VALUE 'Y'.     00870613
008707     05  PC-RCV                      PIC  X(03)    VALUE 'RCV'.   00870713
008708     05  PC-KHL                      PIC  X(03)    VALUE 'KHL'.   00870813
008709     05  PC-PRDCHK                   PIC  X(06)    VALUE 'PRDCHK'.00870913
008710     05  PC-PARM-TEXT                PIC  X(25)    VALUE          00871013
008720         'LOWER LEVEL ONLY         '.                             00872013
008730     05  PC-CURRENT-PROGRAM-NAME     PIC  X(08)    VALUE          00873013
008740         'DSKUT004'.                                              00874013
008750                                                                  00875013
008760 01  WS-LOCAL-SERVER.                                             00876013
008770     05  WS-SUBSYS                   PIC X(04)  VALUE SPACES.     00877013
008780     05  FILLER                      PIC X(12)  VALUE SPACES.     00878013
008790*                                                                 00879013
008800                                                                  00880013
008900*  COMMUNICATIONS AREA FOR PROD TO TEST UTILITIES                 00890013
009000     COPY DSWS011.                                                00900013
009100*                                                                 00910013
009200 PROCEDURE DIVISION.                                              00920013
009300                                                                  00930013
009400 A100-MAINLINE.                                                   00940013
009500                                                                  00950013
009600     DISPLAY SPACES                                               00960013
009700     MOVE WHEN-COMPILED TO PV-WHEN-COMPILED                       00970013
009800     DISPLAY ' *** DSKUT004 VERSION 3 ***'                        00980013
009900     DISPLAY 'COMPILE DATE: ' PV-COMPILE-DATE                     00990013
010000             ' ' PV-COMPILE-TIME                                  01000013
010100                                                                  01010013
010110     PERFORM 1100-GET-DB2-INSTANCE.                               01011013
010120     PERFORM 1200-CHECK-IF-PRODUCTION.                            01012013
010130                                                                  01013013
010140     SET DS009-I-PGM TO TRUE.                                     01014013
010150     PERFORM DS002-INITIAL-PROCESSING.                            01015013
010160     PERFORM B100-PROCESSING                                      01016013
010170         UNTIL TABLE-EOF.                                         01017013
010180                                                                  01018013
010190                                                                  01019013
010200     PERFORM 9000-DUMP-COUNT-TABLE                                01020013
010300                                                                  01030013
010400     PERFORM DS002-END-OF-JOB.                                    01040013
010500                                                                  01050013
010600     GOBACK.                                                      01060013
010700/                                                                 01070013
010800 B100-PROCESSING.                                                 01080013
010900*                                                                 01090013
011000***************************************************************** 01100013
011100*     FOR EACH TABLE, INSERT DATA INTO TEST TABLES                01110013
011200***************************************************************** 01120013
011300*                                                                 01130013
011400     READ TBLE-FILE INTO DS002-RECORD                             01140013
011500         AT END                                                   01150013
011600             SET TABLE-EOF TO TRUE                                01160013
011700         NOT AT END                                               01170013
011800             ADD 1 TO PV-READ-COUNT                               01180013
011900     END-READ.                                                    01190013
012000     IF NOT-TABLE-EOF                                             01200013
012100        MOVE DS002-DATA-SIZE TO DS009-TBLE-DATA-SIZE              01210013
012200        MOVE DS002-NAME TO DS009-PROCESS-TABLE                    01220013
012300        MOVE DS002-KEYS TO DS009-PKYS                             01230013
012400        PERFORM DS002-DO-PROCESS                                  01240013
012500                                                                  01250013
012600        IF DS009-DO-PROCESS                                       01260013
012700*       DISPLAY '**********************************'              01270013
012800*       DISPLAY DS009-PROCESS-TABLE                               01280013
012900        EVALUATE TRUE                                             01290013
013000         WHEN DS009-PROCESS-TABLE = 'TPURCHS'                     01300013
013100             MOVE DS002-DATA-ITEM TO WS-PURCHS                    01310013
013200             MOVE WS-PURCHS-PO-NBR        TO HOLD-PO-NBR          01320013
013300*            DISPLAY HOLD-PO-NBR                                  01330013
013400*            DISPLAY WS-PURCHS                                    01340013
013500             PERFORM R100-INSERT                                  01350013
013600*        WHEN DS009-PROCESS-TABLE = 'TWEBITM'                     01360013
013700*            MOVE DS002-DATA-ITEM        TO WS-WEBITM             01370013
013800*            MOVE WS-WEBITM-INTR-UPC-ID  TO HOLD-INTR-UPC-ID      01380013
013900*            DISPLAY HOLD-INTR-UPC-ID                             01390013
014000*            DISPLAY WS-WEBITM                                    01400013
014100*            PERFORM R100-INSERT                                  01410013
014200         WHEN DS009-PROCESS-TABLE = 'TPURITM'                     01420013
014300             MOVE DS002-DATA-ITEM TO WS-PURITM                    01430013
014400             MOVE WS-PURITM-PO-NBR        TO HOLD-PO-NBR          01440013
014500*            DISPLAY HOLD-PO-NBR                                  01450013
014600*            DISPLAY WS-PURITM                                    01460013
014700             PERFORM R100-INSERT                                  01470013
014800         WHEN DS009-PROCESS-TABLE = 'TPOAGMT'                     01480013
014900             MOVE DS002-DATA-ITEM TO WS-POAGMT                    01490013
015000             MOVE WS-POAGMT-PO-NBR        TO HOLD-PO-NBR          01500013
015100*            DISPLAY HOLD-PO-NBR                                  01510013
015200*            DISPLAY WS-POAGMT                                    01520013
015300             PERFORM R100-INSERT                                  01530013
015400         WHEN DS009-PROCESS-TABLE = 'TPOINST'                     01540013
015500             MOVE DS002-DATA-ITEM TO WS-POINST                    01550013
015600             MOVE WS-POINST-PO-NBR        TO HOLD-PO-NBR          01560013
015700*            DISPLAY HOLD-PO-NBR                                  01570013
015800*            DISPLAY WS-POINST                                    01580013
015900             PERFORM R100-INSERT                                  01590013
016000         WHEN DS009-PROCESS-TABLE = 'TIMPORL'                     01600013
016100             MOVE DS002-DATA-ITEM TO WS-IMPORL                    01610013
016200             MOVE WS-IMPORL-PO-NBR        TO HOLD-PO-NBR          01620013
016300*            DISPLAY HOLD-PO-NBR                                  01630013
016400*            DISPLAY WS-IMPORL                                    01640013
016500             PERFORM R100-INSERT                                  01650013
016600         WHEN DS009-PROCESS-TABLE = 'TALLPLN'                     01660013
016700             MOVE DS002-DATA-ITEM TO WS-ALLPLN                    01670013
016800             MOVE WS-ALLPLN-PO-NBR        TO HOLD-PO-NBR          01680013
016900*            DISPLAY HOLD-PO-NBR                                  01690013
017000*            DISPLAY WS-ALLPLN                                    01700013
017100             PERFORM R100-INSERT                                  01710013
017200         WHEN DS009-PROCESS-TABLE = 'TPLNSHP'                     01720013
017300             MOVE DS002-DATA-ITEM TO WS-PLNSHP                    01730013
017400             MOVE WS-PLNSHP-PO-NBR        TO HOLD-PO-NBR          01740013
017500*            DISPLAY HOLD-PO-NBR                                  01750013
017600*            DISPLAY WS-PLNSHP                                    01760013
017700             PERFORM R100-INSERT                                  01770013
017800*        WHEN DS009-PROCESS-TABLE = 'TSK'                         01780013
017900*            MOVE DS002-DATA-ITEM TO WS-SK                        01790013
018000*            MOVE WS-TSK-ITEM-NMBR        TO HOLD-ITEM-NBR        01800013
018100*            DISPLAY HOLD-ITEM-NBR                                01810013
018200*            DISPLAY WS-SK                                        01820013
018300*            PERFORM R100-INSERT                                  01830013
018400*        WHEN DS009-PROCESS-TABLE = 'TUPC' AND DS002-VERSION = 01 01840013
018500*            MOVE DS002-DATA-ITEM TO WS-UPC                       01850013
018600*            MOVE WS-UPC-UPC-ID           TO HOLD-UPC-NBR         01860013
018700**           DISPLAY HOLD-UPC-NBR                                 01870013
018800**           DISPLAY WS-UPC                                       01880013
018900*            PERFORM R100-INSERT                                  01890013
019000*        WHEN DS009-PROCESS-TABLE = 'TUPC'                        01900013
019100*        WHEN DS009-PROCESS-TABLE = 'TUPC' AND DS002-VERSION = 02 01910013
019200*            MOVE DS002-DATA-ITEM TO WS-UPC                       01920013
019300*            MOVE WS-UPC-UPC-ID           TO HOLD-UPC-NBR         01930013
019400*            DISPLAY HOLD-UPC-NBR                                 01940013
019500*            DISPLAY WS-UPC                                       01950013
019600*            PERFORM R100-INSERT                                  01960013
019700*        WHEN DS009-PROCESS-TABLE = 'TUPCSKU'                     01970013
019800*            MOVE DS002-DATA-ITEM TO WS-UPCSKU                    01980013
019900*            MOVE WS-TUPCSKU-UPC-NBR      TO HOLD-UPC-NBR         01990013
020000*            DISPLAY HOLD-ITEM-NBR                                02000013
020100*            DISPLAY WS-UPCSKU                                    02010013
020200*            PERFORM R100-INSERT                                  02020013
020300*        WHEN DS009-PROCESS-TABLE = 'TUPCPLS'                     02030013
020400*            MOVE DS002-DATA-ITEM TO WS-UPCPLS                    02040013
020500*            MOVE WS-UPCPLS-UPC-ID       TO HOLD-UPC-ID           02050013
020600*            DISPLAY HOLD-UPC-ID                                  02060013
020700*            DISPLAY WS-UPCPLS                                    02070013
020800*            PERFORM R100-INSERT                                  02080013
020900*        WHEN DS009-PROCESS-TABLE = 'TSKXREF'                     02090013
021000*            MOVE DS002-DATA-ITEM TO WS-SKXREF                    02100013
021100*            MOVE WS-SKXREF-ITM-NBR      TO HOLD-ITM-NBR          02110013
021200*            DISPLAY HOLD-ITM-NBR                                 02120013
021300*            DISPLAY WS-SKXREF                                    02130013
021400*            PERFORM R100-INSERT                                  02140013
021500*        WHEN DS009-PROCESS-TABLE = 'TMDSEAR'                     02150013
021600*            MOVE DS002-DATA-ITEM TO WS-MDSEAR                    02160013
021700*            MOVE WS-MDSEAR-MDSEAR-DKEY  TO                       02170013
021800*                   HOLD-SUB-CL-MDSEAR-ID                         02180013
021900*            DISPLAY HOLD-SUB-CL-MDSEAR-ID                        02190013
022000*            DISPLAY WS-MDSEAR                                    02200013
022100*            PERFORM R100-INSERT                                  02210013
022200*        WHEN DS009-PROCESS-TABLE = 'TMDARVS'                     02220013
022300*            MOVE DS002-DATA-ITEM TO WS-MDARVS                    02230013
022400*            MOVE WS-MDARVS-SUB-CL-MDSEAR-ID  TO                  02240013
022500*                   HOLD-SUB-CL-MDSEAR-ID                         02250013
022600*            DISPLAY HOLD-SUB-CL-MDSEAR-ID                        02260013
022700*            DISPLAY WS-MDARVS                                    02270013
022800*            PERFORM R100-INSERT                                  02280013
022900*        WHEN DS009-PROCESS-TABLE = 'TVNDSTL'                     02290013
023000*            MOVE DS002-DATA-ITEM TO WS-VNDSTL                    02300013
023100*            MOVE WS-VNDSTL-VS-ID         TO HOLD-VS-ID           02310013
023200*            DISPLAY HOLD-VS-ID                                   02320013
023300*            DISPLAY WS-VNDSTL                                    02330013
023400*            PERFORM R100-INSERT                                  02340013
023500         WHEN DS009-PROCESS-TABLE = 'TINPKSU'                     02350013
023600             MOVE DS002-DATA-ITEM TO WS-INPKSU                    02360013
023700             MOVE WS-INPKSU-SHIPT-UNT-ID TO HOLD-SHIPT-UNIT-ID    02370013
023800*            DISPLAY HOLD-SHIPT-UNIT-ID                           02380013
023900*            DISPLAY WS-INPKSU                                    02390013
024000             PERFORM R100-INSERT                                  02400013
024400         WHEN DS009-PROCESS-TABLE = 'TSHUUPC'                     02440013
024500             MOVE DS002-DATA-ITEM TO WS-SHUUPC                    02450013
024600             MOVE WS-SHUUPC-SHIPT-UNT-ID TO HOLD-SHIPT-UNIT-ID    02460013
024700*            DISPLAY HOLD-SHIPT-UNIT-ID                           02470013
024800*            DISPLAY WS-SHUUPC                                    02480013
024900             PERFORM R100-INSERT                                  02490013
025000         WHEN DS009-PROCESS-TABLE = 'TSHPUNT'                     02500013
025100             MOVE DS002-DATA-ITEM TO WS-SHPUNT                    02510013
025200             MOVE WS-SHPUNT-SHIPT-UNT-ID TO HOLD-SHIPT-UNIT-ID    02520013
025300*            DISPLAY HOLD-SHIPT-UNIT-ID                           02530013
025400*            DISPLAY WS-SHPUNT                                    02540013
025500             PERFORM R100-INSERT                                  02550013
025600         WHEN DS009-PROCESS-TABLE = 'TSHUNLO'                     02560013
025700             MOVE DS002-DATA-ITEM TO WS-SHUNLO                    02570013
025800             MOVE WS-SHUNLO-SHIPT-UNT-ID TO HOLD-SHIPT-UNIT-ID    02580013
025900*            DISPLAY HOLD-SHIPT-UNIT-ID                           02590013
026000*            DISPLAY WS-SHUNLO                                    02600013
026100             PERFORM R100-INSERT                                  02610013
026200         WHEN DS009-PROCESS-TABLE = 'TMESTDS'                     02620013
026300             MOVE DS002-DATA-ITEM TO WS-MESTDS                    02630013
026400             MOVE WS-MESTDS-PO-NBR       TO HOLD-PO-NBR           02640013
026500*            DISPLAY HOLD-PO-NBR                                  02650013
026600*            DISPLAY WS-MESTDS                                    02660013
026700             PERFORM R100-INSERT                                  02670013
026800*        WHEN DS009-PROCESS-TABLE = 'TEXTENT'                     02680013
026900*            MOVE DS002-DATA-ITEM TO WS-EXTENT                    02690013
027000*            MOVE WS-EXTENT-ENT-ID    TO HOLD-ENT-ID              02700013
027100*            PERFORM R100-INSERT                                  02710013
027200*        WHEN DS009-PROCESS-TABLE = 'TENTNME'                     02720013
027300*            MOVE DS002-DATA-ITEM TO WS-ENTNME                    02730013
027400*            MOVE WS-ENTNME-ENT-ID        TO HOLD-ENT-ID          02740013
027500*            PERFORM R100-INSERT                                  02750013
027600*        WHEN DS009-PROCESS-TABLE = 'TVNDDPT'                     02760013
027700*            MOVE DS002-DATA-ITEM TO WS-VNDDPT                    02770013
027800*            MOVE WS-VNDDPT-ENT-ID        TO HOLD-ENT-ID          02780013
027900*            PERFORM R100-INSERT                                  02790013
028000         WHEN DS009-PROCESS-TABLE = 'TINSTCD'                     02800013
028100             MOVE DS002-DATA-ITEM TO WS-INSTCD                    02810013
028200             MOVE WS-INSTCD-INSTR-NBR     TO HOLD-INSTR-NBR       02820013
028300*            DISPLAY HOLD-INSTR-NBR                               02830013
028400*            DISPLAY WS-INSTCD                                    02840013
028500             PERFORM R100-INSERT                                  02850013
028600*        WHEN DS009-PROCESS-TABLE = 'TSPSTDS'                     02860014
028700*            MOVE DS002-DATA-ITEM TO WS-SPSTDS                    02870014
028800*            MOVE WS-SPSTDS-PO-NBR        TO HOLD-PO-NBR          02880014
028900*            DISPLAY HOLD-PO-NBR                                  02890013
029000*            DISPLAY WS-SPSTDS                                    02900013
029100*            PERFORM R100-INSERT                                  02910014
029200         WHEN DS009-PROCESS-TABLE = 'TTRBNTF'                     02920013
029300             MOVE DS002-DATA-ITEM TO WS-TRBNTF                    02930013
029400             MOVE WS-TRBNTF-PO-NBR        TO HOLD-PO-NBR          02940013
029500*            DISPLAY HOLD-PO-NBR                                  02950013
029600*            DISPLAY WS-TRBNTF                                    02960013
029700             PERFORM R100-INSERT                                  02970013
029800         WHEN DS009-PROCESS-TABLE = 'TTRBDTL'                     02980013
029900             MOVE DS002-DATA-ITEM TO WS-TRBDTL                    02990013
030000             MOVE WS-TRBDTL-NOTIF-NBR     TO HOLD-NOTIF-NBR       03000013
030100*            DISPLAY HOLD-NOTIF-NBR                               03010013
030200*            DISPLAY WS-TRBDTL                                    03020013
030300             PERFORM R100-INSERT                                  03030013
030400*        WHEN DS009-PROCESS-TABLE = 'TPOUPC'                      03040014
030500*            MOVE DS002-DATA-ITEM         TO WS-POUPC             03050014
030600*            MOVE WS-POUPC-PO-NBR         TO HOLD-PO-NBR          03060014
030700*            DISPLAY HOLD-PO-NBR                                  03070013
030800*            DISPLAY WS-POUPC                                     03080013
030900*            PERFORM R100-INSERT                                  03090019
031000         WHEN DS009-PROCESS-TABLE = 'TALLTMP'                     03100013
031100             MOVE DS002-DATA-ITEM         TO WS-ALLTMP            03110013
031200             MOVE WS-ALLTMP-PO-NBR        TO HOLD-PO-NBR          03120013
031300*            DISPLAY HOLD-PO-NBR                                  03130013
031400*            DISPLAY WS-ALLTMP                                    03140013
031500             PERFORM R100-INSERT                                  03150013
031600*        WHEN DS009-PROCESS-TABLE = 'TPAYREQ'                     03160013
031700*            MOVE DS002-DATA-ITEM         TO WS-PAYREQ            03170013
031800*            MOVE WS-PAYREQ-PO-NBR        TO HOLD-PO-NBR          03180013
031900*            DISPLAY HOLD-PO-NBR                                  03190013
032000*            DISPLAY WS-PAYREQ                                    03200013
032100*            PERFORM R100-INSERT                                  03210013
032200         WHEN DS009-PROCESS-TABLE = 'TASNORD'                     03220013
032300             MOVE DS002-DATA-ITEM         TO WS-ASNORD            03230013
032400             MOVE WS-ASNORD-ASNHDR-ID     TO HOLD-ASNHDR-ID       03240013
032500             MOVE WS-ASNORD-PO-NBR        TO HOLD-SPO-NBR         03250013
032600*            DISPLAY HOLD-ASNHDR-ID                               03260013
032700*            DISPLAY HOLD-SPO-NBR                                 03270013
032800*            DISPLAY WS-ASNORD                                    03280013
032900             PERFORM R100-INSERT                                  03290013
033000         WHEN DS009-PROCESS-TABLE = 'TINVOIC'                     03300013
033100             MOVE DS002-DATA-ITEM         TO WS-INVOIC            03310013
033200             MOVE WS-INVOIC-PAYT-REQ-SEQ-NBR                      03320013
033300                              TO HOLD-PAYT-REQ-SEQ-NBR            03330013
033400*            DISPLAY HOLD-PAYT-REQ-SEQ-NBR                        03340013
033500*            DISPLAY WS-INVOIC                                    03350013
033600             PERFORM R100-INSERT                                  03360013
033700* 8/15   WHEN DS009-PROCESS-TABLE = 'TALCHRG'                     03370013
033800*            MOVE DS002-DATA-ITEM         TO WS-ALCHRG            03380013
033900*            MOVE WS-ALCHRG-PAYT-REQ-SEQ-NBR                      03390013
034000*                             TO HOLD-PAYT-REQ-SEQ-NBR            03400013
034100*            DISPLAY HOLD-PAYT-REQ-SEQ-NBR                        03410013
034200*            DISPLAY WS-ALCHRG                                    03420013
034300*            PERFORM R100-INSERT                                  03430013
034400         WHEN DS009-PROCESS-TABLE = 'TPREQIT'                     03440013
034500             MOVE DS002-DATA-ITEM         TO WS-PREQIT            03450013
034600             MOVE WS-PREQIT-PAYT-REQ-SEQ-NBR                      03460013
034700                              TO HOLD-PAYT-REQ-SEQ-NBR            03470013
034800*            DISPLAY HOLD-PAYT-REQ-SEQ-NBR                        03480013
034900*            DISPLAY WS-PREQIT                                    03490013
035000             PERFORM R100-INSERT                                  03500013
035100         WHEN DS009-PROCESS-TABLE = 'TVNDAGR'                     03510013
035200             MOVE DS002-DATA-ITEM         TO WS-VNDAGR            03520013
035300             MOVE WS-VNDAGR-ENT-ID        TO HOLD-ENT-ID          03530013
035400*            DISPLAY HOLD-ENT-ID                                  03540013
035500*            DISPLAY WS-VNDAGR                                    03550013
035600             PERFORM R100-INSERT                                  03560013
035700         WHEN DS009-PROCESS-TABLE = 'TASNDTL'                     03570013
035800             MOVE DS002-DATA-ITEM         TO WS-ASNDTL            03580013
035900             MOVE WS-ASNDTL-ASNHDR-ID     TO HOLD-ASNHDR-ID       03590013
036000*            DISPLAY HOLD-ASNHDR-ID                               03600013
036100*            DISPLAY WS-ASNDTL                                    03610013
036200             PERFORM R100-INSERT                                  03620013
036300         WHEN DS009-PROCESS-TABLE = 'TASNHDR'                     03630013
036400             MOVE DS002-DATA-ITEM         TO WS-ASNHDR            03640013
036500             MOVE WS-ASNHDR-ASNHDR-ID     TO HOLD-ASNHDR-ID       03650013
036600*            DISPLAY HOLD-ASNHDR-ID                               03660013
036700*            DISPLAY WS-ASNHDR                                    03670013
036800             PERFORM R100-INSERT                                  03680013
036900         WHEN DS009-PROCESS-TABLE = 'TASCRIT'                     03690013
037000             MOVE DS002-DATA-ITEM         TO WS-ASCRIT            03700013
037100             MOVE WS-ASCRIT-ASNHDR-ID     TO HOLD-ASNHDR-ID       03710013
037200*            DISPLAY HOLD-ASNHDR-ID                               03720013
037300*            DISPLAY WS-ASCRIT                                    03730013
037400             PERFORM R100-INSERT                                  03740013
037500         WHEN DS009-PROCESS-TABLE = 'TASNCAR'                     03750013
037600             MOVE DS002-DATA-ITEM         TO WS-ASNCAR            03760013
037700             MOVE WS-ASNCAR-ASNHDR-ID     TO HOLD-ASNHDR-ID       03770013
037800*            DISPLAY HOLD-ASNHDR-ID                               03780013
037900*            DISPLAY WS-ASNCAR                                    03790013
038000             PERFORM R100-INSERT                                  03800013
038100         WHEN DS009-PROCESS-TABLE = 'TASDTPL'                     03810013
038200             MOVE DS002-DATA-ITEM         TO WS-ASDTPL            03820013
038300             MOVE WS-ASDTPL-ASNHDR-ID     TO HOLD-ASNHDR-ID       03830013
038400*            DISPLAY HOLD-ASNHDR-ID                               03840041
038500*            DISPLAY WS-ASDTPL                                    03850041
038600             PERFORM R100-INSERT                                  03860013
038700         WHEN DS009-PROCESS-TABLE = 'TSEASET'                     03870013
038800             MOVE DS002-DATA-ITEM          TO WS-SEASET           03880013
038900             MOVE WS-SEASET-SEASET-YR      TO HOLD-SEASET-YR      03890013
039000             MOVE WS-SEASET-SEASET-SHRT-NM TO HOLD-SEASET-SHRT-NM 03900013
039100*            DISPLAY HOLD-SEASET-YR                               03910013
039200*            DISPLAY HOLD-SEASET-SHRT-NM                          03920013
039300*            DISPLAY WS-SEASET                                    03930013
039400             PERFORM R100-INSERT                                  03940013
039500         WHEN DS009-PROCESS-TABLE = 'TSUNAUD'                     03950013
039600             MOVE DS002-DATA-ITEM         TO WS-SUNAUD            03960013
039700             MOVE WS-SUNAUD-AUD-CNTL-NBR  TO HOLD-AUD-CNTL-NBR    03970013
039800*            DISPLAY HOLD-AUD-CNTL-NBR                            03980013
039900*            DISPLAY WS-SUNAUD                                    03990013
040000             PERFORM R100-INSERT                                  04000013
040100         WHEN DS009-PROCESS-TABLE = 'TSUATRN'                     04010013
040200             MOVE DS002-DATA-ITEM         TO WS-SUATRN            04020013
040300             MOVE WS-SUATRN-SHIPT-UNT-ID  TO HOLD-SHIPT-UNIT-ID   04030013
040400*            DISPLAY HOLD-SHIPT-UNIT-ID                           04040013
040500*            DISPLAY WS-SUATRN                                    04050013
040600             PERFORM R100-INSERT                                  04060013
040700         WHEN DS009-PROCESS-TABLE = 'TSUAUPC'                     04070013
040800             MOVE DS002-DATA-ITEM         TO WS-SUAUPC            04080013
040900             MOVE WS-SUAUPC-SHIPT-UNT-ID  TO HOLD-SHIPT-UNIT-ID   04090013
041000*            DISPLAY HOLD-SHIPT-UNIT-ID                           04100013
041100*            DISPLAY WS-SUAUPC                                    04110013
041200             PERFORM R100-INSERT                                  04120013
041300         WHEN DS009-PROCESS-TABLE = 'TSUEXCP'                     04130013
041400             MOVE DS002-DATA-ITEM         TO WS-SUEXCP            04140013
041500             MOVE WS-SUEXCP-SHIPT-UNT-ID  TO HOLD-SHIPT-UNIT-ID   04150013
041600*            DISPLAY HOLD-SHIPT-UNIT-ID                           04160013
041700*            DISPLAY WS-SUEXCP                                    04170013
041800             PERFORM R100-INSERT                                  04180013
041900         WHEN DS009-PROCESS-TABLE = 'TCTEXCP'                     04190013
042000             MOVE DS002-DATA-ITEM         TO WS-CTEXCP            04200013
042100             MOVE WS-CTEXCP-SHIPT-UNT-ID  TO HOLD-SHIPT-UNIT-ID   04210013
042200*            DISPLAY HOLD-SHIPT-UNIT-ID                           04220013
042300*            DISPLAY WS-CTEXCP                                    04230013
042400             PERFORM R100-INSERT                                  04240013
042500         WHEN DS009-PROCESS-TABLE = 'TIMTBKY'                     04250013
042600             MOVE DS002-DATA-ITEM         TO WS-IMTBKY            04260013
042700             MOVE WS-IMTBKY-NOTIF-NBR     TO HOLD-NOTIF-NBR       04270013
042800*            DISPLAY HOLD-NOTIF-NBR                               04280013
042900*            DISPLAY WS-IMTBKY                                    04290013
043000             PERFORM R100-INSERT                                  04300013
043100         WHEN DS009-PROCESS-TABLE = 'TPOPRPK'                     04310013
043200             MOVE DS002-DATA-ITEM         TO WS-POPRPK            04320013
043300             MOVE WS-POPRPK-PO-NBR        TO HOLD-PO-NBR          04330013
043400*            DISPLAY HOLD-PO-NBR                                  04340013
043500*            DISPLAY WS-POPRPK                                    04350013
043600             PERFORM R100-INSERT                                  04360013
043700         WHEN DS009-PROCESS-TABLE = 'TSULBXF'                     04370013
043800             MOVE DS002-DATA-ITEM         TO WS-SULBXF            04380013
043900             MOVE WS-SULBXF-SHIPT-UNT-ID  TO HOLD-SHIPT-UNT-ID    04390013
044000*            DISPLAY HOLD-SHIPT-UNT-ID                            04400013
044100*            DISPLAY WS-SULBXF                                    04410013
044200             PERFORM R100-INSERT                                  04420013
044300                                                                  04430013
044400         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_CART'              04440013
044500             MOVE DS002-DATA-ITEM         TO DCLSUT00024          04450013
044600             PERFORM R100-INSERT                                  04460013
044700                                                                  04470013
044800         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_VND'               04480013
044900             MOVE DS002-DATA-ITEM         TO DCLSUT00026          04490013
045000             PERFORM R100-INSERT                                  04500013
045100                                                                  04510013
045200         WHEN DS009-PROCESS-TABLE = 'TSUQADJ'                     04520013
045300             MOVE DS002-DATA-ITEM         TO DCLTSUQADJ           04530013
045400             PERFORM R100-INSERT                                  04540013
045500             IF SQLCODE NOT = ZERO                                04550013
045600             DISPLAY 'INSERT FAILED FOR TABLE = '                 04560013
045700                              DS009-PROCESS-TABLE                 04570013
045800             CALL 'DSNTIAR' USING SQLCA                           04580013
045900                              DP004-FORMATTED-MESSAGE             04590013
046000                              DP004-ERROR-LINE-LENGTH             04600013
046100             PERFORM                                              04610013
046200                 VARYING DP004-MSG-IDX                            04620013
046300                 FROM 1 BY 1                                      04630013
046400                 UNTIL DP004-MSG-IDX > 8                          04640013
046500                     DISPLAY DP004-MESSAGE-LINE (DP004-MSG-IDX)   04650013
046600             END-PERFORM                                          04660013
046700             END-IF                                               04670013
046800                                                                  04680013
046900         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_UPC'               04690013
047000             MOVE DS002-DATA-ITEM         TO DCLSUT00028          04700013
047100             PERFORM R100-INSERT                                  04710013
047200                                                                  04720013
047300         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_LOC'               04730013
047400             MOVE DS002-DATA-ITEM         TO DS008-SUT-OTBND-LOC  04740013
047500             PERFORM R100-INSERT                                  04750013
047600                                                                  04760013
047700         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_PKD_UPC'           04770013
047800             MOVE DS002-DATA-ITEM         TO DCLSUT00025          04780013
047900             PERFORM R100-INSERT                                  04790013
048000                                                                  04800013
048100         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_PK'                04810013
048200             MOVE DS002-DATA-ITEM         TO DCLSUT00041          04820013
048300             PERFORM R100-INSERT                                  04830013
048400                                                                  04840013
048500         WHEN DS009-PROCESS-TABLE = 'SUT_PO_AUD_REQ'              04850013
048600             MOVE DS002-DATA-ITEM         TO DS008-DCLSUT00015    04860013
048700             PERFORM R100-INSERT                                  04870013
048800                                                                  04880013
048900         WHEN DS009-PROCESS-TABLE = 'TSUOBTR'                     04890013
049000             MOVE DS002-DATA-ITEM         TO DCLTSUOBTR           04900013
049100             PERFORM R100-INSERT                                  04910013
049200                                                                  04920013
049300         WHEN DS009-PROCESS-TABLE = 'TSUOBTS'                     04930013
049400             MOVE DS002-DATA-ITEM         TO DCLTSUOBTS           04940013
049500             PERFORM R100-INSERT                                  04950013
049600                                                                  04960013
049700         WHEN DS009-PROCESS-TABLE = 'XLT_SKU'                     04970013
049800             MOVE DS002-DATA-ITEM         TO DCLXLT00003          04980013
049900             PERFORM R100-INSERT                                  04990013
050000                                                                  05000013
050100         WHEN DS009-PROCESS-TABLE = 'XLT_VND_STYL'                05010013
050200             MOVE DS002-DATA-ITEM         TO DCLXLT00004          05020013
050300             PERFORM R100-INSERT                                  05030013
050400                                                                  05040013
050500         WHEN DS009-PROCESS-TABLE = 'SUT_FINCL_ADJ'               05050013
050600             MOVE DS002-DATA-ITEM         TO DS008-DCLSUT00030    05060013
050700             PERFORM R100-INSERT                                  05070013
050800                                                                  05080013
050900         WHEN DS009-PROCESS-TABLE = 'XLT_UPC'                     05090013
051000             MOVE DS002-DATA-ITEM         TO DCLXLT00006          05100013
051100             PERFORM R100-INSERT                                  05110013
051200                                                                  05120013
051300         WHEN DS009-PROCESS-TABLE = 'XLT_PK'                      05130013
051400             MOVE DS002-DATA-ITEM         TO DCLXLT00007          05140013
051500             PERFORM R100-INSERT                                  05150013
051600         WHEN DS009-PROCESS-TABLE = 'XLT_PK_CPT_SKU'              05160013
051700             MOVE DS002-DATA-ITEM         TO DCLXLT00008          05170013
051800             PERFORM R100-INSERT                                  05180013
051900         WHEN DS009-PROCESS-TABLE = 'XLT_PK_UPC'                  05190013
052000             MOVE DS002-DATA-ITEM         TO DCLXLT00009          05200013
052100             PERFORM R100-INSERT                                  05210013
052200                                                                  05220013
052300         WHEN DS009-PROCESS-TABLE = 'WST_SHPMT_XREF_HDR'          05230013
052400             MOVE DS002-DATA-ITEM         TO DS008-DCLWST00001    05240013
052500             PERFORM R100-INSERT                                  05250013
052600                                                                  05260013
052700         WHEN DS009-PROCESS-TABLE = 'WST_SHPMT_XREF_DTL'          05270013
052800             MOVE DS002-DATA-ITEM         TO DCLWST00002          05280013
052900             PERFORM R100-INSERT                                  05290013
053000                                                                  05300013
053100         WHEN DS009-PROCESS-TABLE = 'RCT_PO_RCVR_TRKG'            05310013
053200             MOVE DS002-DATA-ITEM         TO DCLRCT00017          05320013
053300             PERFORM R100-INSERT                                  05330013
053000                                                                  05330126
041300         WHEN DS009-PROCESS-TABLE = 'TTRDPRT'                     05331026
041400             MOVE DS002-DATA-ITEM         TO WS-TRDPRT            05332026
041800             PERFORM R100-INSERT                                  05336026
053000                                                                  05337026
041300         WHEN DS009-PROCESS-TABLE = 'TFGTRST'                     05338026
041400             MOVE DS002-DATA-ITEM         TO WS-FGTRST            05339026
041400             IF WS-FGTRST-TRN-RLSE-TMST < SPACES                  05339138
041401                 MOVE -1 TO PV-NULL                               05339236
041401             ELSE                                                 05339336
041401                 MOVE +0 TO PV-NULL                               05339436
041401             END-IF                                               05339536
041800             PERFORM R100-INSERT                                  05339736
053000                                                                  05339836
041300         WHEN DS009-PROCESS-TABLE = 'TINTTRN'                     05339936
041400             MOVE DS002-DATA-ITEM         TO WS-INTTRN            05340036
041800             PERFORM R100-INSERT                                  05340136
053000                                                                  05340236
053400         END-EVALUATE                                             05341036
053500                                                                  05350013
053600         SET DS009-SRCH-IDX TO +1                                 05360013
053700         SEARCH DS009-CNTL-RECORDS                                05370013
053800                 VARYING DS009-SRCH-IDX                           05380013
053900             AT END                                               05390013
054000                 CONTINUE                                         05400013
054100             WHEN CNTL-TABLE (DS009-SRCH-IDX) = DS002-NAME        05410013
054200                 ADD SQLERRD(3)                                   05420013
054300                        TO DS009-READ-COUNT (DS009-SRCH-IDX)      05430013
054400         END-SEARCH                                               05440013
054500                                                                  05450013
054600*        DISPLAY 'NUMBER OF ROWS INSERTED:' SQLERRD (3)           05460013
054700*        DISPLAY 'TBL= ' DS009-PROCESS-TABLE                      05470013
054800*                ' INSERT SQLCODE: ' SQLCODE                      05480013
054900*                ' NBR OF ROWS INSERTED: ' SQLERRD (3)            05490013
055000                                                                  05500013
055100         IF DS009-UPDATE-COUNT > DS009-COMMIT-COUNT               05510013
055200            EXEC SQL                                              05520013
055300                COMMIT                                            05530013
055400            END-EXEC                                              05540013
055500            IF SQLCODE NOT = ZERO                                 05550013
055600               PERFORM DS002-SQL-ABEND-COMMIT                     05560013
055700            END-IF                                                05570013
055800            MOVE +0  TO DS009-UPDATE-COUNT                        05580013
055900*           DISPLAY 'COMMIT TAKEN AFTER RECORD: '                 05590013
056000*                                     DS009-TUPDATE-COUNT         05600013
056100         END-IF                                                   05610013
056200         ADD SQLERRD(3) TO DS009-UPDATE-COUNT                     05620013
056300         ADD SQLERRD(3) TO DS009-TUPDATE-COUNT                    05630013
056400        END-IF                                                    05640013
056500     END-IF.                                                      05650013
056600/                                                                 05660013
056700 R100-INSERT.                                                     05670013
056800     PERFORM WITH TEST AFTER                                      05680013
056900             VARYING DS009-RETRY-COUNTER FROM 1 BY 1              05690013
057000             UNTIL   DS009-RETRY-COUNTER > 3 OR                   05700013
057100                     SQLCODE = ZERO OR +100 OR -803               05710013
057200                               OR -181                            05720013
057300                               OR -310                            05730013
057400                               OR -530                            05740013
057500                                                                  05750013
057600          EVALUATE TRUE                                           05760013
057700            WHEN DS009-PROCESS-TABLE = 'TPURCHS'                  05770013
057800               EXEC SQL                                           05780013
057900                INSERT INTO TPURCHS                               05790013
058000                  (                                               05800013
058100                    PO_NBR                                        05810013
058200                   ,VER_NBR                                       05820013
058300                   ,VER_STATUS_CDE                                05830013
058400                   ,PO_TYP_CDE                                    05840013
058500                   ,PO_CATEG_CDE                                  05850013
058600                   ,EDI_IND                                       05860013
058700                   ,TOT_UNT_QTY                                   05870013
058800                   ,TOT_VAL_COST_AMT                              05880013
058900                   ,TOT_VAL_RTL_AMT                               05890013
059000                   ,TOT_MU_PCT                                    05900013
059100                   ,TOT_SKUS_QTY                                  05910013
059200                   ,IMPRT_AGNT_PO_NBR                             05920013
059300                   ,IMPRT_ORD_OFF_NAME                            05930013
059400                   ,IMPRT_VEND_NAME                               05940013
059500                   ,IMPRT_FCTRY_NAME                              05950013
059600                   ,IMPRT_CNTRY_NAME                              05960013
059700                   ,VEND_CNTRY_NAME                               05970013
059800                   ,NEW_STR_PO_IND                                05980013
059900                   ,IMPRT_PO_IND                                  05990013
060000                   ,IMPRT_AGNT_PO_IND                             06000013
060100                   ,STATUS_TMST                                   06010013
060200                   ,LAST_UPD_TMST                                 06020013
060300                   ,EDI_REXMIT_IND                                06030013
060400                   ,EDI_REXMIT_TMST                               06040013
060500                   ,DIR_STR_IND                                   06050013
060600                   ,LAST_UPD_BY_UID                               06060013
060700                   ,APP_BY_UID                                    06070013
060800                   ,OTB_PER_NBR                                   06080013
060900                   ,DEPT_NBR                                      06090013
061000                   ,ENT_ID                                        06100013
061100                   ,STATUS_CDE                                    06110013
061200                   ,CRE_BY_UID                                    06120013
061300                   ,REJ_CT                                        06130013
061400                   ,REJ_UID                                       06140013
061500                   ,ORD_DTE                                       06150013
061600                   ,REVISION_CT                                   06160013
061700                   ,ADR_SEQ_NBR                                   06170013
061800                   ,DEST_KNOWN_IND                                06180013
061900                   ,RLSE_IND                                      06190013
062000                   ,RLSE_DTE                                      06200013
062100                   ,ANLYS_HOLD_IND                                06210013
062200                   ,PLCMNT_CNTRY_CDE                              06220013
062300                   ,PROD_CNTRY_CDE                                06230013
062400                   ,UNT_PER_CBMT_QTY                              06240013
062500                   ,TKT_FMT_NBR                                   06250013
062600                   ,TKT_FMT_DESC                                  06260013
062700                   ,CRE_TMST                                      06270013
062800                   ,PRG_LAST_ACTVY_DTE                            06280013
062900                   ,PKGNG_CDE                                     06290013
063000                   ,SEASET_YR                                     06300013
063100                   ,SEASET_SHRT_NM                                06310013
063200                   ,QTA_CTG_CDE                                   06320013
063300                   ,PO_IN_RMS_IND                                 06330013
063400                   ,RMS_PO_UPD_TMST                               06340013
063500                   ,DUP_SKU_IND                                   06350013
063600                   ,ORIG_PKGNG_CDE                                06360013
063700                   ,IMPRT_VND_ID                                  06370013
063800                   ,IMPRT_FCTRY_ID                                06380013
063900                   ,DERVD_LBL_TYP_CDE                             06390013
064000                   ,DELY_ID                                       06400013
064100                   ,PO_SHRT_CYC_IND                               06410013
064200                   ,WHSE_RPLNT_IND                                06420013
064300                  )                                               06430013
064400                VALUES (                                          06440013
064500                  :WS-PURCHS-PO-NBR                               06450013
064600                 ,:WS-PURCHS-VER-NBR                              06460013
064700                 ,:WS-PURCHS-VER-STATUS-CDE                       06470013
064800                 ,:WS-PURCHS-PO-TYP-CDE                           06480013
064900                 ,:WS-PURCHS-PO-CATEG-CDE                         06490013
065000                 ,:WS-PURCHS-EDI-IND                              06500013
065100                 ,:WS-PURCHS-TOT-UNT-QTY                          06510013
065200                 ,:WS-PURCHS-TOT-VAL-COST-AMT                     06520013
065300                 ,:WS-PURCHS-TOT-VAL-RTL-AMT                      06530013
065400                 ,:WS-PURCHS-TOT-MU-PCT                           06540013
065500                 ,:WS-PURCHS-TOT-SKUS-QTY                         06550013
065600                 ,:WS-PURCHS-IMPRT-AGNT-PO-NBR                    06560013
065700                 ,:WS-PURCHS-IMPRT-ORD-OFF-NAME                   06570013
065800                 ,:WS-PURCHS-IMPRT-VEND-NAME                      06580013
065900                 ,:WS-PURCHS-IMPRT-FCTRY-NAME                     06590013
066000                 ,:WS-PURCHS-IMPRT-CNTRY-NAME                     06600013
066100                 ,:WS-PURCHS-VEND-CNTRY-NAME                      06610013
066200                 ,:WS-PURCHS-NEW-STR-PO-IND                       06620013
066300                 ,:WS-PURCHS-IMPRT-PO-IND                         06630013
066400                 ,:WS-PURCHS-IMPRT-AGNT-PO-IND                    06640013
066500                 ,:WS-PURCHS-STATUS-TMST                          06650013
066600                 ,:WS-PURCHS-LAST-UPD-TMST                        06660013
066700                 ,:WS-PURCHS-EDI-REXMIT-IND                       06670013
066800                 ,:WS-PURCHS-EDI-REXMIT-TMST                      06680013
066900                 ,:WS-PURCHS-DIR-STR-IND                          06690013
067000                 ,:WS-PURCHS-LAST-UPD-BY-UID                      06700013
067100                 ,:WS-PURCHS-APP-BY-UID                           06710013
067200                 ,:WS-PURCHS-OTB-PER-NBR                          06720013
067300                 ,:WS-PURCHS-DEPT-NBR                             06730013
067400                 ,:WS-PURCHS-ENT-ID                               06740013
067500                 ,:WS-PURCHS-STATUS-CDE                           06750013
067600                 ,:WS-PURCHS-CRE-BY-UID                           06760013
067700                 ,:WS-PURCHS-REJ-CT                               06770013
067800                 ,:WS-PURCHS-REJ-UID                              06780013
067900                 ,:WS-PURCHS-ORD-DTE                              06790013
068000                 ,:WS-PURCHS-REVISION-CT                          06800013
068100                 ,:WS-PURCHS-ADR-SEQ-NBR                          06810013
068200                 ,:WS-PURCHS-DEST-KNOWN-IND                       06820013
068300                 ,:WS-PURCHS-RLSE-IND                             06830013
068400                 ,:WS-PURCHS-RLSE-DTE                             06840013
068500                 ,:WS-PURCHS-ANLYS-HOLD-IND                       06850013
068600                 ,:WS-PURCHS-PLCMNT-CNTRY-CDE                     06860013
068700                 ,:WS-PURCHS-PROD-CNTRY-CDE                       06870013
068800                 ,:WS-PURCHS-UNT-PER-CBMT-QTY                     06880013
068900                 ,:WS-PURCHS-TKT-FMT-NBR                          06890013
069000                 ,:WS-PURCHS-TKT-FMT-DESC                         06900013
069100                 ,:WS-PURCHS-CRE-TMST                             06910013
069200                 ,:WS-PURCHS-PRG-LAST-ACTVY-DTE                   06920013
069300                 ,:WS-PURCHS-PKGNG-CDE                            06930013
069400                 ,:WS-PURCHS-SEASET-YR                            06940013
069500                 ,:WS-PURCHS-SEASET-SHRT-NM                       06950013
069600                 ,:WS-PURCHS-QTA-CTG-CDE                          06960013
069700                 , :WS-PURCHS-PO-IN-RMS-IND                       06970013
069800                 , :WS-PURCHS-RMS-PO-UPD-TMST                     06980013
069900                 , :WS-PURCHS-DUP-SKU-IND                         06990013
070000                 , :WS-PURCHS-ORIG-PKGNG-CDE                      07000013
070100                 , :WS-PURCHS-IMPRT-VND-ID                        07010013
070200                 , :WS-PURCHS-IMPRT-FCTRY-ID                      07020013
070300                 , :WS-PURCHS-DERVD-LBL-TYP-CDE                   07030013
070400                 , :WS-PURCHS-DELY-ID                             07040013
070500                   :WS-PURCHS-DELY-ID-NULL                        07050013
070600                 , :WS-PURCHS-PO-SHRT-CYC-IND                     07060013
070700                 , :WS-PURCHS-WHSE-RPLNT-IND                      07070013
070800                   )                                              07080013
070900               END-EXEC                                           07090013
071000            WHEN DS009-PROCESS-TABLE = 'TPURITM'                  07100013
071100               EXEC SQL                                           07110013
071200                INSERT INTO TPURITM                               07120013
071300                  (                                               07130013
071400                    PO_NBR                                        07140013
071500                   ,VER_NBR                                       07150013
071600                   ,PO_LNE_NBR                                    07160013
071700                   ,VER_STATUS_CDE                                07170013
071800                   ,SKU_SEQ_NBR                                   07180013
071900                   ,CL_NBR                                        07190013
072000                   ,VEND_STYL_NAME                                07200013
072100                   ,COLOR_DESC                                    07210013
072200                   ,SIZE_DESC                                     07220013
072300                   ,UM_IND                                        07230013
072400                   ,UNT_QTY                                       07240013
072500                   ,UNT_RTL_PR_AMT                                07250013
072600                   ,UNT_COST_AMT                                  07260013
072700                   ,TOT_VAL_COST_AMT                              07270013
072800                   ,TOT_VAL_RTL_AMT                               07280013
072900                   ,MU_PCT                                        07290013
073000                   ,CRE_TMST                                      07300013
073100                   ,LAST_UPD_TMST                                 07310013
073200                   ,ITM_NBR                                       07320013
073300                   ,SKU_DESC                                      07330013
073400                   ,COLOR_CDE                                     07340013
073500                   ,SIZE_CDE                                      07350013
073600                   ,AD_EVNT_DTE                                   07360013
073700                   ,STATUS_CDE                                    07370013
073800                   ,CRE_BY_UID                                    07380013
073900                   ,LAST_UPD_BY_UID                               07390013
074000                   ,GP_RTL_AMT                                    07400013
074100                   ,GP_QTY                                        07410013
074200                   ,APP_PO_LNE_NBR                                07420013
074300                   ,PIC_ITM_IND                                   07430013
074400                   ,PIC_PG_NBR                                    07440013
074500                   ,PRD_1ST_COST_AMT                              07450013
074600                   ,STAT_TMST                                     07460013
074700                   ,PO_PREPK_ID                                   07470013
074800                   ,PREPK_RATO_QTY                                07480013
074900                   ,SHIP_TO_TMP_DC_IND                            07490013
075000                   ,RMS_PO_SKU_NBR                                07500013
075100                   ,CNCLD_UNT_QTY                                 07510013
075200                   ,INNR_PK_QTY                                   07520013
075300                   ,OUTR_PK_QTY                                   07530013
075400                  )                                               07540013
075500                VALUES (                                          07550013
075600                   :WS-PURITM-PO-NBR                              07560013
075700                  ,:WS-PURITM-VER-NBR                             07570013
075800                  ,:WS-PURITM-PO-LNE-NBR                          07580013
075900                  ,:WS-PURITM-VER-STATUS-CDE                      07590013
076000                  ,:WS-PURITM-SKU-SEQ-NBR                         07600013
076100                  ,:WS-PURITM-CL-NBR                              07610013
076200                  ,:WS-PURITM-VEND-STYL-NAME                      07620013
076300                  ,:WS-PURITM-COLOR-DESC                          07630013
076400                  ,:WS-PURITM-SIZE-DESC                           07640013
076500                  ,:WS-PURITM-UM-IND                              07650013
076600                  ,:WS-PURITM-UNT-QTY                             07660013
076700                  ,:WS-PURITM-UNT-RTL-PR-AMT                      07670013
076800                  ,:WS-PURITM-UNT-COST-AMT                        07680013
076900                  ,:WS-PURITM-TOT-VAL-COST-AMT                    07690013
077000                  ,:WS-PURITM-TOT-VAL-RTL-AMT                     07700013
077100                  ,:WS-PURITM-MU-PCT                              07710013
077200                  ,:WS-PURITM-CRE-TMST                            07720013
077300                  ,:WS-PURITM-LAST-UPD-TMST                       07730013
077400                  ,:WS-PURITM-ITM-NBR                             07740013
077500                  ,:WS-PURITM-SKU-DESC                            07750013
077600                  ,:WS-PURITM-COLOR-CDE                           07760013
077700                  ,:WS-PURITM-SIZE-CDE                            07770013
077800                  ,:WS-PURITM-AD-EVNT-DTE                         07780013
077900                  ,:WS-PURITM-STATUS-CDE                          07790013
078000                  ,:WS-PURITM-CRE-BY-UID                          07800013
078100                  ,:WS-PURITM-LAST-UPD-BY-UID                     07810013
078200                  ,:WS-PURITM-GP-RTL-AMT                          07820013
078300                  ,:WS-PURITM-GP-QTY                              07830013
078400                  ,:WS-PURITM-APP-PO-LNE-NBR                      07840013
078500                  ,:WS-PURITM-PIC-ITM-IND                         07850013
078600                  ,:WS-PURITM-PIC-PG-NBR                          07860013
078700                  ,:WS-PURITM-PRD-1ST-COST-AMT                    07870013
078800                  ,:WS-PURITM-STAT-TMST                           07880013
078900                  ,:WS-02-PURITM-PO-PREPK-ID                      07890013
079000                  ,:WS-02-PURITM-PREPK-RATO-QTY                   07900013
079100                  ,:WS-PURITM-SHIP-TO-TMP-DC-IND                  07910013
079200                  ,:WS-PURITM-RMS-PO-SKU-NBR                      07920013
079300                  ,:WS-PURITM-CNCLD-UNT-QTY                       07930013
079400                  ,:WS-PURITM-INNR-PK-QTY                         07940013
079500                  ,:WS-PURITM-OUTR-PK-QTY                         07950013
079600                   )                                              07960013
079700               END-EXEC                                           07970013
079800            WHEN DS009-PROCESS-TABLE = 'TPOAGMT'                  07980013
079900               EXEC SQL                                           07990013
080000                INSERT INTO TPOAGMT                               08000013
080100                  (                                               08010013
080200                    PO_NBR                                        08020013
080300                   ,VER_NBR                                       08030013
080400                   ,AGRMT_TYP_ID                                  08040013
080500                   ,SEQ_NBR                                       08050013
080600                   ,VER_STATUS_CDE                                08060013
080700                   ,TYP_CDE                                       08070013
080800                   ,TKT_MKR_IND                                   08080013
080900                   ,BULK_STK_TKT_IND                              08090013
081000                   ,EDI_PROMO_TXT                                 08100013
081100                   ,PO_CAN_DAY_QTY                                08110013
081200                   ,AUTO_PO_CAN_IND                               08120013
081300                   ,DISC_DOL_AMT                                  08130013
081400                   ,DISC_PCT                                      08140013
081500                   ,DISC_PAY_DAY_QTY                              08150013
081600                   ,LAST_UPD_TMST                                 08160013
081700                   ,PAYT_TERM_ID                                  08170013
081800                   ,LAST_UPD_BY_UID                               08180013
081900                   ,LEADTIME_DAYS_QTY                             08190013
082000                  )                                               08200013
082100                VALUES (                                          08210013
082200                   :WS-POAGMT-PO-NBR                              08220013
082300                  ,:WS-POAGMT-VER-NBR                             08230013
082400                  ,:WS-POAGMT-AGRMT-TYP-ID                        08240013
082500                  ,:WS-POAGMT-SEQ-NBR                             08250013
082600                  ,:WS-POAGMT-VER-STATUS-CDE                      08260013
082700                  ,:WS-POAGMT-TYP-CDE                             08270013
082800                  ,:WS-POAGMT-TKT-MKR-IND                         08280013
082900                  ,:WS-POAGMT-BULK-STK-TKT-IND                    08290013
083000                  ,:WS-POAGMT-EDI-PROMO-TXT                       08300013
083100                  ,:WS-POAGMT-PO-CAN-DAY-QTY                      08310013
083200                  ,:WS-POAGMT-AUTO-PO-CAN-IND                     08320013
083300                  ,:WS-POAGMT-DISC-DOL-AMT                        08330013
083400                  ,:WS-POAGMT-DISC-PCT                            08340013
083500                  ,:WS-POAGMT-DISC-PAY-DAY-QTY                    08350013
083600                  ,:WS-POAGMT-LAST-UPD-TMST                       08360013
083700                  ,:WS-POAGMT-PAYT-TERM-ID                        08370013
083800                  ,:WS-POAGMT-LAST-UPD-BY-UID                     08380013
083900                  ,:WS-POAGMT-LEADTIME-DAYS-QTY                   08390013
084000                   )                                              08400013
084100               END-EXEC                                           08410013
084200            WHEN DS009-PROCESS-TABLE = 'TPOINST'                  08420013
084300               EXEC SQL                                           08430013
084400                INSERT INTO TPOINST                               08440013
084500                  (                                               08450013
084600                    PO_NBR                                        08460013
084700                   ,RECIP_CDE                                     08470013
084800                   ,INSTR_NBR                                     08480013
084900                   ,CRE_BY_UID                                    08490013
085000                   ,CRE_TMST                                      08500013
085100                  )                                               08510013
085200                VALUES (                                          08520013
085300                   :WS-POINST-PO-NBR                              08530013
085400                  ,:WS-POINST-RECIP-CDE                           08540013
085500                  ,:WS-POINST-INSTR-NBR                           08550013
085600                  ,:WS-POINST-CRE-BY-UID                          08560013
085700                  ,:WS-POINST-CRE-TMST                            08570013
085800                   )                                              08580013
085900               END-EXEC                                           08590013
086000            WHEN DS009-PROCESS-TABLE = 'TIMPORL'                  08600013
086100               EXEC SQL                                           08610013
086200                INSERT INTO TIMPORL                               08620013
086300                  (                                               08630013
086400                    PO_NBR                                        08640013
086500                   ,VER_NBR                                       08650013
086600                   ,VER_STATUS_CDE                                08660013
086700                   ,CONSLR_RLSE_CDE                               08670013
086800                   ,CONSLR_REQR_DTE                               08680013
086900                   ,CONSLR_ACTL_DTE                               08690013
087000                   ,CONSLR_ACTL_TM                                08700013
087100                   ,CSTM_BKR_RLSE_CDE                             08710013
087200                   ,CSTM_BKR_REQR_DTE                             08720013
087300                   ,CSTM_BKR_ACTL_DTE                             08730013
087400                   ,CSTM_BKR_ACTL_TM                              08740013
087500                   ,TKT_PRTR_RLSE_CDE                             08750013
087600                   ,TKT_PRTR_REQR_DTE                             08760013
087700                   ,TKT_PRTR_ACTL_DTE                             08770013
087800                   ,TKT_PRTR_ACTL_TM                              08780013
087900                   ,DCONSLR_RLSE_CDE                              08790013
088000                   ,DCONSLR_REQR_DTE                              08800013
088100                   ,DCONSLR_ACTL_DTE                              08810013
088200                   ,DCONSLR_ACTL_TM                               08820013
088300                   ,LAST_UPD_TMST                                 08830013
088400                   ,LAST_UPD_BY_UID                               08840013
088500                   ,DCONSLR_ENT_ID                                08850013
088600                  )                                               08860013
088700                VALUES (                                          08870013
088800                    :WS-IMPORL-PO-NBR                             08880013
088900                   ,:WS-IMPORL-VER-NBR                            08890013
089000                   ,:WS-IMPORL-VER-STATUS-CDE                     08900013
089100                   ,:WS-IMPORL-CONSLR-RLSE-CDE                    08910013
089200                   ,:WS-IMPORL-CONSLR-REQR-DTE                    08920013
089300                   ,:WS-IMPORL-CONSLR-ACTL-DTE                    08930013
089400                   ,:WS-IMPORL-CONSLR-ACTL-TM                     08940013
089500                   ,:WS-IMPORL-CSTM-BKR-RLSE-CDE                  08950013
089600                   ,:WS-IMPORL-CSTM-BKR-REQR-DTE                  08960013
089700                   ,:WS-IMPORL-CSTM-BKR-ACTL-DTE                  08970013
089800                   ,:WS-IMPORL-CSTM-BKR-ACTL-TM                   08980013
089900                   ,:WS-IMPORL-TKT-PRTR-RLSE-CDE                  08990013
090000                   ,:WS-IMPORL-TKT-PRTR-REQR-DTE                  09000013
090100                   ,:WS-IMPORL-TKT-PRTR-ACTL-DTE                  09010013
090200                   ,:WS-IMPORL-TKT-PRTR-ACTL-TM                   09020013
090300                   ,:WS-IMPORL-DCONSLR-RLSE-CDE                   09030013
090400                   ,:WS-IMPORL-DCONSLR-REQR-DTE                   09040013
090500                   ,:WS-IMPORL-DCONSLR-ACTL-DTE                   09050013
090600                   ,:WS-IMPORL-DCONSLR-ACTL-TM                    09060013
090700                   ,:WS-IMPORL-LAST-UPD-TMST                      09070013
090800                   ,:WS-IMPORL-LAST-UPD-BY-UID                    09080013
090900                   ,:WS-IMPORL-DCONSLR-ENT-ID                     09090013
091000                   )                                              09100013
091100               END-EXEC                                           09110013
091200            WHEN DS009-PROCESS-TABLE = 'TALLPLN'                  09120013
091300               EXEC SQL                                           09130013
091400                INSERT INTO TALLPLN                               09140013
091500                  (                                               09150013
091600                    PO_NBR                                        09160013
091700                   ,PO_LNE_NBR                                    09170013
091800                   ,PLAN_NBR                                      09180013
091900                   ,CURR_SPLIT_QTY                                09190013
092000                   ,DEST_NBR                                      09200013
092100                   ,STATUS_CDE                                    09210013
092200                   ,DC_SPLIT_QTY                                  09220013
092300                   ,SPLIT_REQ_ID                                  09230013
092400                   ,SPLIT_CRE_DATE                                09240013
092500                   ,SPLIT_CRE_ID                                  09250013
092600                   ,SPLIT_UPD_DATE                                09260013
092700                   ,SPLIT_UPD_ID                                  09270013
092800                   ,DISTRO_REQ_ID                                 09280013
092900                   ,DISTRO_CRE_DATE                               09290013
093000                   ,DISTRO_CRE_ID                                 09300013
093100                   ,DISTRO_KEY_SEQ_NBR                            09310013
093200                   ,SPLIT_KEY_SEQ_NBR                             09320013
093300                   ,ALOC_PACK_QTY                                 09330013
093400                   ,PK_SIZE_RND_CDE                               09340013
093500                   ,ALLOC_OUTR_PK_QTY                             09350013
093600*                  ,SHTG_PRRT_OPT_CDE                             09360013
093700*                  ,OVRG_PRRT_OPT_CDE                             09370013
093800*                  ,EXST_SHTG_THRS_IND                            09380013
093900                  )                                               09390013
094000                VALUES (                                          09400013
094100                    :WS-ALLPLN-PO-NBR                             09410013
094200                   ,:WS-ALLPLN-PO-LNE-NBR                         09420013
094300                   ,:WS-ALLPLN-PLAN-NBR                           09430013
094400                   ,:WS-ALLPLN-CURR-SPLIT-QTY                     09440013
094500                   ,:WS-ALLPLN-DEST-NBR                           09450013
094600                   ,:WS-ALLPLN-STATUS-CDE                         09460013
094700                   ,:WS-ALLPLN-DC-SPLIT-QTY                       09470013
094800                   ,:WS-ALLPLN-SPLIT-REQ-ID                       09480013
094900                   ,:WS-ALLPLN-SPLIT-CRE-DATE                     09490013
095000                   ,:WS-ALLPLN-SPLIT-CRE-ID                       09500013
095100                   ,:WS-ALLPLN-SPLIT-UPD-DATE                     09510013
095200                   ,:WS-ALLPLN-SPLIT-UPD-ID                       09520013
095300                   ,:WS-ALLPLN-DISTRO-REQ-ID                      09530013
095400                   ,:WS-ALLPLN-DISTRO-CRE-DATE                    09540013
095500                   ,:WS-ALLPLN-DISTRO-CRE-ID                      09550013
095600                   ,:WS-ALLPLN-DISTRO-KEY-SEQ-NBR                 09560013
095700                   ,:WS-ALLPLN-SPLIT-KEY-SEQ-NBR                  09570013
095800                   ,:WS-ALLPLN-ALOC-PACK-QTY                      09580013
095900                   ,:WS-ALLPLN-PK-SIZE-RND-CDE                    09590013
096000                   ,:WS-ALLPLN-ALLOC-OUTR-PK-QTY                  09600013
096100*                  ,:WS-ALLPLN-SHTG-PRRT-OPT-CDE                  09610013
096200*                  ,:WS-ALLPLN-OVRG-PRRT-OPT-CDE                  09620013
096300*                  ,:WS-ALLPLN-EXST-SHTG-THRS-IND                 09630013
096400                   )                                              09640013
096500               END-EXEC                                           09650013
096600            WHEN DS009-PROCESS-TABLE = 'TPLNSHP'                  09660013
096700               EXEC SQL                                           09670013
096800                INSERT INTO TPLNSHP                               09680013
096900                  (                                               09690013
097000                    SHIPT_NBR                                     09700013
097100                   ,VER_NBR                                       09710013
097200                   ,VER_STATUS_CDE                                09720013
097300                   ,SHIPT_TYP_CDE                                 09730013
097400                   ,SHIPT_DEST_NBR                                09740013
097500                   ,SHIPT_POINT_TXT                               09750013
097600                   ,FOB_POINT_TXT                                 09760013
097700                   ,FRGT_PAYT_CDE                                 09770013
097800                   ,VEND_FRGT_PCT                                 09780013
097900                   ,KOHLS_FRGT_PCT                                09790013
098000                   ,LATE_SHIPT_IND                                09800013
098100                   ,EARLY_SHIPT_IND                               09810013
098200                   ,PARTIAL_SHIPT_IND                             09820013
098300                   ,BCKORDS_PERMTD_IND                            09830013
098400                   ,PORT_ENTR_DESC                                09840013
098500                   ,STRT_FCTRY_DTE                                09850013
098600                   ,LAST_FCTRY_DTE                                09860013
098700                   ,DONT_SHIP_BEF_DTE                             09870013
098800                   ,CAN_IFNOT_SHIP_DTE                            09880013
098900                   ,EXT_CAN_DTE                                   09890013
099000                   ,LAST_UPD_TMST                                 09900013
099100                   ,STATUS_CDE                                    09910013
099200                   ,ENT_ID                                        09920013
099300                   ,PO_NBR                                        09930013
099400                   ,LAST_UPD_BY_UID                               09940013
099500                   ,FOB_CDE                                       09950013
099600                   ,POE_CDE                                       09960013
099700                  )                                               09970013
099800                VALUES (                                          09980013
099900                    :WS-PLNSHP-SHIPT-NBR                          09990013
100000                   ,:WS-PLNSHP-VER-NBR                            10000013
100100                   ,:WS-PLNSHP-VER-STATUS-CDE                     10010013
100200                   ,:WS-PLNSHP-SHIPT-TYP-CDE                      10020013
100300                   ,:WS-PLNSHP-SHIPT-DEST-NBR                     10030013
100400                   ,:WS-PLNSHP-SHIPT-POINT-TXT                    10040013
100500                   ,:WS-PLNSHP-FOB-POINT-TXT                      10050013
100600                   ,:WS-PLNSHP-FRGT-PAYT-CDE                      10060013
100700                   ,:WS-PLNSHP-VEND-FRGT-PCT                      10070013
100800                   ,:WS-PLNSHP-KOHLS-FRGT-PCT                     10080013
100900                   ,:WS-PLNSHP-LATE-SHIPT-IND                     10090013
101000                   ,:WS-PLNSHP-EARLY-SHIPT-IND                    10100013
101100                   ,:WS-PLNSHP-PARTIAL-SHIPT-IND                  10110013
101200                   ,:WS-PLNSHP-BCKORDS-PERMTD-IND                 10120013
101300                   ,:WS-PLNSHP-PORT-ENTR-DESC                     10130013
101400                   ,:WS-PLNSHP-STRT-FCTRY-DTE                     10140013
101500                   ,:WS-PLNSHP-LAST-FCTRY-DTE                     10150013
101600                   ,:WS-PLNSHP-DONT-SHIP-BEF-DTE                  10160013
101700                   ,:WS-PLNSHP-CAN-IFNOT-SHIP-DTE                 10170013
101800                   ,:WS-PLNSHP-EXT-CAN-DTE                        10180013
101900                   ,:WS-PLNSHP-LAST-UPD-TMST                      10190013
102000                   ,:WS-PLNSHP-STATUS-CDE                         10200013
102100                   ,:WS-PLNSHP-ENT-ID                             10210013
102200                   ,:WS-PLNSHP-PO-NBR                             10220013
102300                   ,:WS-PLNSHP-LAST-UPD-BY-UID                    10230013
102400                   ,:WS-PLNSHP-FOB-CDE                            10240013
102500                   ,:WS-PLNSHP-POE-CDE                            10250013
102600                   )                                              10260013
102700               END-EXEC                                           10270013
102800*           WHEN DS009-PROCESS-TABLE = 'TSK'                      10280013
102900*              EXEC SQL                                           10290013
103000*               INSERT INTO TSK                                   10300013
103100*                 (                                               10310013
103200*              MERCH_DEPT_NMBR                                    10320013
103300*             ,MERCH_CLASS_NMBR                                   10330013
103400*             ,SEQ_NMBR                                           10340013
103500*             ,CUM_SALES_UNIT_QTY                                 10350013
103600*             ,RTL_UNIT_RCVD_QTY                                  10360013
103700*             ,COST_UNIT_MSRMNT                                   10370013
103800*             ,RTL_UNIT_MSRMNT                                    10380013
103900*             ,UNIT_COST_AMT                                      10390013
104000*             ,CUR_UNIT_RTL_AMT                                   10400013
104100*             ,ORIG_UNIT_RTL_AMT                                  10410013
104200*             ,VNDR_INNR_PACK_QTY                                 10420013
104300*             ,SHPMT_COUNT_QTY                                    10430013
104400*             ,VENDOR_STYLE_CODE                                  10440013
104500*             ,STAT_CHNGD_DATE                                    10450013
104600*             ,STATUS_CODE                                        10460013
104700*             ,AUTO_RORD_MTH_CODE                                 10470013
104800*             ,RTL_CST_CVRSN_FCTR                                 10480013
104900*             ,SETUP_DATE                                         10490013
105000*             ,PRICE_CHNG_DATE                                    10500013
105100*             ,GROUP_CODE                                         10510013
105200*             ,SKU_DESC                                           10520013
105300*             ,SIZE_DESC                                          10530013
105400*             ,COLOR_DESC                                         10540013
105500*             ,REORDER_FRMT_CODE                                  10550013
105600*             ,MERCH_DIV_CODE                                     10560013
105700*             ,DMM_NMBR                                           10570013
105800*             ,BUYER_NMBR                                         10580013
105900*             ,VENDOR_NMBR                                        10590013
106000*             ,VNDR_IN_HSE_NMBR                                   10600013
106100*             ,MKDN_PGM_CODE                                      10610013
106200*             ,LOWST_UNIT_RTL_AMT                                 10620013
106300*             ,LOW_RTL_PRICE_DATE                                 10630013
106400*             ,ITEM_NMBR                                          10640013
106500*             ,GP_RTL_AMT                                         10650013
106600*             ,ORIG_GP_QTY                                        10660013
106700*             ,ORIG_GP_RTL_AMT                                    10670013
106800*             ,FS_RPT_IND                                         10680013
106900*             ,GP_QTY                                             10690013
107000*             ,MULT_PR_PT_IND                                     10700013
107100*             ,PLU_DWNLD_EXCL_IND                                 10710013
107200*             ,LAST_PO_REV_DTE                                    10720013
107300*             ,PO_REV_DAY_NBR                                     10730013
107400*             ,PO_REV_SUN_WK_NBR                                  10740013
107500*             ,PO_REV_MON_WK_NBR                                  10750013
107600*             ,PO_REV_TUE_WK_NBR                                  10760013
107700*             ,PO_REV_WED_WK_NBR                                  10770013
107800*             ,PO_REV_THU_WK_NBR                                  10780013
107900*             ,PO_REV_FRI_WK_NBR                                  10790013
108000*             ,PO_REV_SAT_WK_NBR                                  10800013
108100*             ,CENT_STK_CDE                                       10810013
108200*             ,MEITGP_NBR                                         10820013
108300*             ,SKU_TYP_CDE                                        10830013
108400*             ,VEND_OUTR_PACK_QTY                                 10840013
108500*             ,LONG_VENDOR_STYLE                                  10850013
108600*             ,SIZE_CDE                                           10860013
108700*             ,LONG_SIZE_DESC                                     10870013
108800*             ,COLOR_CDE                                          10880013
108900*             ,LONG_COLOR_DESC                                    10890013
109000*             ,STICKER_NBR                                        10900013
109100*             ,ENT_ID                                             10910013
109200*             ,TKT_FMT_ID                                         10920013
109300*             ,KY_ITM_IND                                         10930013
109400*             ,VS_CHARTC_CDE                                      10940013
109500*             ,VS_CHARTC_SEQ_NBR                                  10950013
109600*             ,UNT_COST_1ST_AMT                                   10960013
109700*             ,REGN_PRIC_IND                                      10970013
109800*                 )                                               10980013
109900*               VALUES (                                          10990013
110000*                   :WS-TSK-MERCH-DEPT-NMBR                       11000013
110100*                  ,:WS-TSK-MERCH-CLASS-NMBR                      11010013
110200*                  ,:WS-TSK-SEQ-NMBR                              11020013
110300*                  ,:WS-TSK-CUM-SALES-UNIT-QTY                    11030013
110400*                  ,:WS-TSK-RTL-UNIT-RCVD-QTY                     11040013
110500*                  ,:WS-TSK-COST-UNIT-MSRMNT                      11050013
110600*                  ,:WS-TSK-RTL-UNIT-MSRMNT                       11060013
110700*                  ,:WS-TSK-UNIT-COST-AMT                         11070013
110800*                  ,:WS-TSK-CUR-UNIT-RTL-AMT                      11080013
110900*                  ,:WS-TSK-ORIG-UNIT-RTL-AMT                     11090013
111000*                  ,:WS-TSK-VNDR-INNR-PACK-QTY                    11100013
111100*                  ,:WS-TSK-SHPMT-COUNT-QTY                       11110013
111200*                  ,:WS-TSK-VENDOR-STYLE-CODE                     11120013
111300*                  ,:WS-TSK-STAT-CHNGD-DATE                       11130013
111400*                  ,:WS-TSK-STATUS-CODE                           11140013
111500*                  ,:WS-TSK-AUTO-RORD-MTH-CODE                    11150013
111600*                  ,:WS-TSK-RTL-CST-CVRSN-FCTR                    11160013
111700*                  ,:WS-TSK-SETUP-DATE                            11170013
111800*                  ,:WS-TSK-PRICE-CHNG-DATE                       11180013
111900*                  ,:WS-TSK-GROUP-CODE                            11190013
112000*                  ,:WS-TSK-SKU-DESC                              11200013
112100*                  ,:WS-TSK-SIZE-DESC                             11210013
112200*                  ,:WS-TSK-COLOR-DESC                            11220013
112300*                  ,:WS-TSK-REORDER-FRMT-CODE                     11230013
112400*                  ,:WS-TSK-MERCH-DIV-CODE                        11240013
112500*                  ,:WS-TSK-DMM-NMBR                              11250013
112600*                  ,:WS-TSK-BUYER-NMBR                            11260013
112700*                  ,:WS-TSK-VENDOR-NMBR                           11270013
112800*                  ,:WS-TSK-VNDR-IN-HSE-NMBR                      11280013
112900*                  ,:WS-TSK-MKDN-PGM-CODE                         11290013
113000*                  ,:WS-TSK-LOWST-UNIT-RTL-AMT                    11300013
113100*                  ,:WS-TSK-LOW-RTL-PRICE-DATE                    11310013
113200*                  ,:WS-TSK-ITEM-NMBR                             11320013
113300*                  ,:WS-TSK-GP-RTL-AMT                            11330013
113400*                  ,:WS-TSK-ORIG-GP-QTY                           11340013
113500*                  ,:WS-TSK-ORIG-GP-RTL-AMT                       11350013
113600*                  ,:WS-TSK-FS-RPT-IND                            11360013
113700*                  ,:WS-TSK-GP-QTY                                11370013
113800*                  ,:WS-TSK-MULT-PR-PT-IND                        11380013
113900*                  ,:WS-TSK-PLU-DWNLD-EXCL-IND                    11390013
114000*                  ,:WS-TSK-LAST-PO-REV-DTE                       11400013
114100*                  ,:WS-TSK-PO-REV-DAY-NBR                        11410013
114200*                  ,:WS-TSK-PO-REV-SUN-WK-NBR                     11420013
114300*                  ,:WS-TSK-PO-REV-MON-WK-NBR                     11430013
114400*                  ,:WS-TSK-PO-REV-TUE-WK-NBR                     11440013
114500*                  ,:WS-TSK-PO-REV-WED-WK-NBR                     11450013
114600*                  ,:WS-TSK-PO-REV-THU-WK-NBR                     11460013
114700*                  ,:WS-TSK-PO-REV-FRI-WK-NBR                     11470013
114800*                  ,:WS-TSK-PO-REV-SAT-WK-NBR                     11480013
114900*                  ,:WS-TSK-CENT-STK-CDE                          11490013
115000*                  ,:WS-TSK-MEITGP-NBR                            11500013
115100*                  ,:WS-TSK-SKU-TYP-CDE                           11510013
115200*                  ,:WS-TSK-VEND-OUTR-PACK-QTY                    11520013
115300*                  ,:WS-TSK-LONG-VENDOR-STYLE                     11530013
115400*                  ,:WS-TSK-SIZE-CDE                              11540013
115500*                  ,:WS-TSK-LONG-SIZE-DESC                        11550013
115600*                  ,:WS-TSK-COLOR-CDE                             11560013
115700*                  ,:WS-TSK-LONG-COLOR-DESC                       11570013
115800*                  ,:WS-TSK-STICKER-NBR                           11580013
115900*                  ,:WS-TSK-ENT-ID                                11590013
116000*                  ,:WS-TSK-TKT-FMT-ID                            11600013
116100*                  ,:WS-TSK-KY-ITM-IND                            11610013
116200**                 ,:WS-TSK-VS-CHARTC-CDE                         11620013
116300*                  ,:WS-TSK-VS-CHARTC-SEQ-NBR                     11630013
116400*                  ,:WS-TSK-UNT-COST-1ST-AMT                      11640013
116500*                  ,:WS-TSK-REGN-PRIC-IND                         11650013
116600*                 )                                               11660013
116700*              END-EXEC                                           11670013
116800*           WHEN DS009-PROCESS-TABLE = 'TUPC'                     11680013
116900*              EXEC SQL                                           11690013
117000*               INSERT INTO TUPC                                  11700013
117100*                 (                                               11710013
117200*                   UPC_ID                                        11720013
117300*                  ,UPC_NBR                                       11730013
117400*                  ,SUB_CL_MDSEAR_ID                              11740013
117500*                  ,VS_ID                                         11750013
117600*                  ,INTR_UPC_ID                                   11760013
117700*                  ,EFF_BEG_DTE                                   11770013
117800*                  ,EFF_END_DTE                                   11780013
117900*                  ,UPC_TYP_CDE                                   11790013
118000*                  ,KOHLS_SIZE_CDE                                11800013
118100*                  ,NRF_SIZE_IND                                  11810013
118200*                  ,NRF_CLOR_CDE                                  11820013
118300*                  ,NRF_CLOR_IND                                  11830013
118400*                  ,CSTM_CLOR_DESC                                11840013
118500*                  ,EDI_ORD_IND                                   11850013
118600*                  ,PREPK_IND                                     11860013
118700*                  ,GP_CDE                                        11870013
118800*                  ,CERTD_IND                                     11880013
118900*                  ,CERTD_DTE                                     11890013
119000*                  ,RPLNMT_IND                                    11900013
119100*                  ,KY_ITM_IND                                    11910013
119200*                  ,UNT_COST_1ST_AMT                              11920013
119300*                  ,UPC_SRC_CDE                                   11930013
119400*                  ,INNR_PK_QTY                                   11940013
119500*                  ,OUTR_PK_QTY                                   11950013
119600*                  ,SEA_SEQ_NBR                                   11960013
119700****               ,MDSE_TYP_SEQ_NBR                              11970013
119800****               ,PATRN_SEQ_NBR                                 11980013
119900****               ,TRND_SEQ_NBR                                  11990013
120000****               ,FBRCN_SEQ_NBR                                 12000013
120100****               ,FNSH_SEQ_NBR                                  12010013
120200*                  ,CRE_BY_USR_ID                                 12020013
120300*                  ,LAST_UPD_BY_USR_ID                            12030013
120400*                  ,LAST_UPD_TMST                                 12040013
120500*                  ,WD_UM_QTY                                     12050013
120600*                  ,DPTH_UM_QTY                                   12060013
120700*                  ,HT_UM_QTY                                     12070013
120800*                  ,SIZE_UM_CDE                                   12080013
120900*                  ,WT_UM_QTY                                     12090013
121000*                  ,WT_UM_CDE                                     12100013
121100*                  ,POG_IND                                       12110013
121200*                  ,REGN_PRIC_IND                                 12120013
121300*                  ,TX_PRD_CDE_SEQ_NBR                            12130013
121400*                  ,CUSTFACG_CLOR_DESC                            12140013
121500*                  ,INTR_UPC_DESC                                 12150013
121600*                 )                                               12160013
121700*               VALUES (                                          12170013
121800*                   :WS-UPC-UPC-ID                                12180013
121900*                  ,:WS-UPC-UPC-NBR                               12190013
122000*                  ,:WS-UPC-SUB-CL-MDSEAR-ID                      12200013
122100*                  ,:WS-UPC-VS-ID                                 12210013
122200*                  ,:WS-UPC-INTR-UPC-ID                           12220013
122300*                  ,:WS-UPC-EFF-BEG-DTE                           12230013
122400*                  ,:WS-UPC-EFF-END-DTE:WS-UPC-EFF-END-DTE-NN     12240013
122500*                  ,:WS-UPC-UPC-TYP-CDE                           12250013
122600*                  ,:WS-UPC-KOHLS-SIZE-CDE                        12260013
122700*                  ,:WS-UPC-NRF-SIZE-IND                          12270013
122800*                  ,:WS-UPC-NRF-CLOR-CDE                          12280013
122900*                  ,:WS-UPC-NRF-CLOR-IND                          12290013
123000*                  ,:WS-UPC-CSTM-CLOR-DESC                        12300013
123100*                  ,:WS-UPC-EDI-ORD-IND                           12310013
123200*                  ,:WS-UPC-PREPK-IND                             12320013
123300*                  ,:WS-UPC-GP-CDE                                12330013
123400*                  ,:WS-UPC-CERTD-IND                             12340013
123500*                  ,:WS-UPC-CERTD-DTE                             12350013
123600*                  ,:WS-UPC-RPLNMT-IND                            12360013
123700*                  ,:WS-UPC-KY-ITM-IND                            12370013
123800*                  ,:WS-UPC-UNT-COST-1ST-AMT                      12380013
123900*                  ,:WS-UPC-UPC-SRC-CDE                           12390013
124000*                  ,:WS-UPC-INNR-PK-QTY                           12400013
124100*                  ,:WS-UPC-OUTR-PK-QTY                           12410013
124200*                  ,:WS-UPC-SEA-SEQ-NBR                           12420013
124300*****              ,:WS-UPC-MDSE-TYP-SEQ-NBR                      12430013
124400*****              ,:WS-UPC-PATRN-SEQ-NBR                         12440013
124500*****              ,:WS-UPC-TRND-SEQ-NBR                          12450013
124600*****              ,:WS-UPC-FBRCN-SEQ-NBR                         12460013
124700*****              ,:WS-UPC-FNSH-SEQ-NBR                          12470013
124800*****              ,:WS-UPC-CRE-BY-USR-ID                         12480013
124900*                  ,'DSKUT004'                                    12490013
125000*                  ,:WS-UPC-LAST-UPD-BY-USR-ID                    12500013
125100*                  ,:WS-UPC-LAST-UPD-TMST                         12510013
125200*                  ,:WS-UPC-WD-UM-QTY                             12520013
125300*                  ,:WS-UPC-DPTH-UM-QTY                           12530013
125400*                  ,:WS-UPC-HT-UM-QTY                             12540013
125500*                  ,:WS-UPC-SIZE-UM-CDE                           12550013
125600*                  ,:WS-UPC-WT-UM-QTY                             12560013
125700*                  ,:WS-UPC-WT-UM-CDE                             12570013
125800*                  ,:WS-UPC-POG-IND                               12580013
125900*                  ,:WS-UPC-REGN-PRIC-IND                         12590013
126000*                  ,:WS-UPC-TX-PRD-CDE-SEQ-NBR                    12600013
126100*                  ,:WS-UPC-CUSTFACG-CLOR-DESC                    12610013
126200*                  ,:WS-UPC-INTR-UPC-DESC                         12620013
126300*                  )                                              12630013
126400*              END-EXEC                                           12640013
126500*           WHEN DS009-PROCESS-TABLE = 'TUPCSKU'                  12650013
126600*              EXEC SQL                                           12660013
126700*               INSERT INTO TUPCSKU                               12670013
126800*                 (                                               12680013
126900*                   UPC_NBR                                       12690013
127000*                  ,ITEM_NBR                                      12700013
127100*                  ,EDI_ORD_IND                                   12710013
127200*                  ,PLU_DWNLD_IND                                 12720013
127300*                  ,XREF_CRE_DTE                                  12730013
127400*                  ,UPC_DESC                                      12740013
127500*                  ,CERT_IND                                      12750013
127600*                  ,CERT_DTE                                      12760013
127700*                  ,UPC_SRC_IND                                   12770013
127800*                  ,UMDCLN_IND                                    12780013
127900*                 )                                               12790013
128000*               VALUES (                                          12800013
128100*                   :WS-TUPCSKU-UPC-NBR                           12810013
128200*                  ,:WS-TUPCSKU-ITEM-NBR                          12820013
128300*                  ,:WS-TUPCSKU-EDI-ORD-IND                       12830013
128400*                  ,:WS-TUPCSKU-PLU-DWNLD-IND                     12840013
128500*                  ,:WS-TUPCSKU-XREF-CRE-DTE                      12850013
128600*                  ,:WS-TUPCSKU-UPC-DESC                          12860013
128700*                  ,:WS-TUPCSKU-CERT-IND                          12870013
128800*                  ,:WS-TUPCSKU-CERT-DTE                          12880013
128900*                  ,:WS-TUPCSKU-UPC-SRC-IND                       12890013
129000*                  ,:WS-TUPCSKU-UMDCLN-IND                        12900013
129100*                 )                                               12910013
129200*              END-EXEC                                           12920013
129300*MAM                                                              12930013
129400*           WHEN DS009-PROCESS-TABLE = 'TUPCPLS'                  12940013
129500*              EXEC SQL                                           12950013
129600*               INSERT INTO TUPCPLS                               12960013
129700*                 (                                               12970013
129800*                   UPC_ID                                        12980013
129900*                  ,OPERCO_NBR                                    12990013
130000*                  ,STR_NBR                                       13000013
130100*                  ,EFF_BEG_TMST                                  13010013
130200*                  ,EFF_END_TMST                                  13020013
130300*                  ,UPC_STAT_CDE                                  13030013
130400*                  ,UNT_COST_AMT                                  13040013
130500*                  ,UNT_RTL_AMT                                   13050013
130600*                  ,MEITGP_NBR                                    13060013
130700*                  ,CRE_BY_USR_ID                                 13070013
130800*                  ,CRE_TMST                                      13080013
130900*                  ,ITM_NBR                                       13090013
131000*                  ,PLU_IND                                       13100013
131100*                  ,UPC_STAT_CHG_DTE                              13110013
131200*                  ,UNT_RTL_CHG_DTE                               13120013
131300*                 )                                               13130013
131400*               VALUES (                                          13140013
131500*                   :WS-UPCPLS-UPC-ID                             13150013
131600*                  ,:WS-UPCPLS-OPERCO-NBR                         13160013
131700*                  ,:WS-UPCPLS-STR-NBR                            13170013
131800*      ,:WS-UPCPLS-EFF-BEG-TMST:WS-UPCPLS-EFF-BEG-TMST-NN         13180013
131900*      ,:WS-UPCPLS-EFF-END-TMST:WS-UPCPLS-EFF-END-TMST-NN         13190013
132000*                  ,:WS-UPCPLS-UPC-STAT-CDE                       13200013
132100*                  ,:WS-UPCPLS-UNT-COST-AMT                       13210013
132200*                  ,:WS-UPCPLS-UNT-RTL-AMT                        13220013
132300*                  ,:WS-UPCPLS-MEITGP-NBR                         13230013
132400*                  ,:WS-UPCPLS-CRE-BY-USR-ID                      13240013
132500*                  ,:WS-UPCPLS-CRE-TMST                           13250013
132600*                  ,:WS-UPCPLS-ITM-NBR                            13260013
132700*                  ,:WS-UPCPLS-PLU-IND                            13270013
132800*      ,:WS-UPCPLS-UPC-STAT-CHG-DTE:WS-UPCPLS-UPC-STAT-CHG-DTE-NN 13280013
132900*      ,:WS-UPCPLS-UNT-RTL-CHG-DTE:WS-UPCPLS-UNT-RTL-CHG-DTE-NN   13290013
133000*                 )                                               13300013
133100*              END-EXEC                                           13310013
133200*           WHEN DS009-PROCESS-TABLE = 'TMDSEAR'                  13320013
133300*              EXEC SQL                                           13330013
133400*               INSERT INTO TMDSEAR                               13340013
133500*                 (                                               13350013
133600*                   OPERCO_NBR                                    13360013
133700*                  ,GMA_NBR                                       13370013
133800*                  ,DMA_NBR                                       13380013
133900*                  ,DEPT_NBR                                      13390013
134000*                  ,MAJ_CL_NBR                                    13400013
134100*                  ,SUB_CL_NBR                                    13410013
134200*                  ,MDSELV_CDE                                    13420013
134300*                  ,MDSEAR_DKEY                                   13430013
134400*                  ,CHG_DTE                                       13440013
134500*                  ,CRE_DTE                                       13450013
134600*                  ,STRT_DTE                                      13460013
134700*                  ,END_DTE                                       13470013
134800*                  ,GEN_MDSE_TYP_CDE                              13480013
134900*                  ,MDSEAR_DESC                                   13490013
135000*                  ,BYR_NBR                                       13500013
135100*                  ,LIST_SEQ_NBR                                  13510013
135200*                  ,PHY_INV_OH_VAR_PCT                            13520013
135300*                  ,PHY_INV_OH_VAR_QTY                            13530013
135400*                 )                                               13540013
135500*               VALUES (                                          13550013
135600*                   :WS-MDSEAR-OPERCO-NBR                         13560013
135700*                  ,:WS-MDSEAR-GMA-NBR                            13570013
135800*                  ,:WS-MDSEAR-DMA-NBR                            13580013
135900*                  ,:WS-MDSEAR-DEPT-NBR                           13590013
136000*                  ,:WS-MDSEAR-MAJ-CL-NBR                         13600013
136100*                  ,:WS-MDSEAR-SUB-CL-NBR                         13610013
136200*                  ,:WS-MDSEAR-MDSELV-CDE                         13620013
136300*                  ,:WS-MDSEAR-MDSEAR-DKEY                        13630013
136400*                  ,:WS-MDSEAR-CHG-DTE                            13640013
136500*                  ,:WS-MDSEAR-CRE-DTE                            13650013
136600*                  ,:WS-MDSEAR-STRT-DTE                           13660013
136700*                  ,:WS-MDSEAR-END-DTE                            13670013
136800*                  ,:WS-MDSEAR-GEN-MDSE-TYP-CDE                   13680013
136900*                  ,:WS-MDSEAR-DESC                               13690013
137000*                  ,:WS-MDSEAR-BYR-NBR                            13700013
137100*                  ,:WS-MDSEAR-LIST-SEQ-NBR                       13710013
137200*                  ,:WS-MDSEAR-PHY-INV-OH-VAR-PCT                 13720013
137300*                     :WS-MDSEAR-PHY-INV-OH-VAR-PCT-N             13730013
137400*                  ,:WS-MDSEAR-PHY-INV-OH-VAR-QTY                 13740013
137500*                     :WS-MDSEAR-PHY-INV-OH-VAR-QTY-N             13750013
137600*                 )                                               13760013
137700*              END-EXEC                                           13770013
137800*           WHEN DS009-PROCESS-TABLE = 'TMDARVS'                  13780013
137900*              EXEC SQL                                           13790013
138000*               INSERT INTO TMDARVS                               13800013
138100*                 (                                               13810013
138200*                   SUB_CL_MDSEAR_ID                              13820013
138300*                  ,VS_ID                                         13830013
138400*                  ,ACTV_IND                                      13840013
138500*                  ,VS_DESC                                       13850013
138600*                  ,STKR_NBR                                      13860013
138700*                  ,TKT_TYP_SEQ_NBR                               13870013
138800*                  ,LBL_SEQ_NBR                                   13880013
138900*                  ,HNG_FOLD_SEQ_NBR                              13890013
139000*                  ,SLHTT_SEQ_NBR                                 13900013
139100*                  ,TRND_SEQ_NBR                                  13910013
139200*                  ,FBRCN_SEQ_NBR                                 13920013
139300*                  ,FNSH_SEQ_NBR                                  13930013
139400*                  ,RMS_STYL_ID                                   13940013
139500*                 )                                               13950013
139600*               VALUES (                                          13960013
139700*                   :WS-MDARVS-SUB-CL-MDSEAR-ID                   13970013
139800*                  ,:WS-MDARVS-VS-ID                              13980013
139900*                  ,:WS-MDARVS-ACTV-IND                           13990013
140000*                  ,:WS-MDARVS-VS-DESC                            14000013
140100*                  ,:WS-MDARVS-STKR-NBR                           14010013
140200*                  ,:WS-MDARVS-TKT-TYP-SEQ-NBR                    14020013
140300*                  ,:WS-MDARVS-LBL-SEQ-NBR                        14030013
140400*                  ,:WS-MDARVS-HNG-FOLD-SEQ-NBR                   14040013
140500*                  ,:WS-MDARVS-SLHTT-SEQ-NBR                      14050013
140600*                  ,:WS-MDARVS-TRND-SEQ-NBR                       14060013
140700*                  ,:WS-MDARVS-FBRCN-SEQ-NBR                      14070013
140800*                  ,:WS-MDARVS-FNSH-SEQ-NBR                       14080013
140900*                  ,:WS-MDARVS-RMS-STYL-ID                        14090013
141000*                 )                                               14100013
141100*              END-EXEC                                           14110013
141200*           WHEN DS009-PROCESS-TABLE = 'TSKXREF'                  14120013
141300*              EXEC SQL                                           14130013
141400*               INSERT INTO TSKXREF                               14140013
141500*                 (                                               14150013
141600*                   DEPT_NBR                                      14160013
141700*                  ,CL_NBR                                        14170013
141800*                  ,SKU_SEQ_NBR                                   14180013
141900*                  ,SKU_STAT_CDE                                  14190013
142000*                  ,ITM_NBR                                       14200013
142100*                  ,INTR_UPC_ID                                   14210013
142200*                  ,DEPT                                          14220013
142300*                  ,CLASS                                         14230013
142400*                  ,SUBCLASS                                      14240013
142500*                  ,SKU                                           14250013
142600*                 )                                               14260013
142700*               VALUES (                                          14270013
142800*                   :WS-SKXREF-DEPT-NBR                           14280013
142900*                  ,:WS-SKXREF-CL-NBR                             14290013
143000*                  ,:WS-SKXREF-SKU-SEQ-NBR                        14300013
143100*                  ,:WS-SKXREF-SKU-STAT-CDE                       14310013
143200*                  ,:WS-SKXREF-ITM-NBR                            14320013
143300*                  ,:WS-SKXREF-INTR-UPC-ID                        14330013
143400*                  ,:WS-SKXREF-DEPT                               14340013
143500*                  ,:WS-SKXREF-CLASS                              14350013
143600*                  ,:WS-SKXREF-SUBCLASS                           14360013
143700*                  ,:WS-SKXREF-SKU                                14370013
143800*                 )                                               14380013
143900*              END-EXEC                                           14390013
144000*           WHEN DS009-PROCESS-TABLE = 'TVNDSTL'                  14400013
144100*              EXEC SQL                                           14410013
144200*               INSERT INTO TVNDSTL                               14420013
144300*                 (                                               14430013
144400*                   VS_ID                                         14440013
144500*                  ,ENT_ID                                        14450013
144600*                  ,VS_NBR                                        14460013
144700*                  ,EFF_BEG_DTE                                   14470013
144800*                  ,EFF_END_DTE                                   14480013
144900*                  ,COST_UM_CDE                                   14490013
145000*                  ,RTL_UM_CDE                                    14500013
145100*                  ,MLT_PRIC_PT_IND                               14510013
145200*                  ,BYP_CAT_IND                                   14520013
145300*                  ,SLHTT_SEQ_NBR                                 14530013
145400*                  ,CRE_BY_USR_ID                                 14540013
145500*                  ,LAST_UPD_BY_USR_ID                            14550013
145600*                  ,LAST_UPD_TMST                                 14560013
145700*                 )                                               14570013
145800*               VALUES (                                          14580013
145900*               :WS-VNDSTL-VS-ID                                  14590013
146000*              ,:WS-VNDSTL-ENT-ID                                 14600013
146100*              ,:WS-VNDSTL-VS-NBR                                 14610013
146200*              ,:WS-VNDSTL-EFF-BEG-DTE                            14620013
146300*               :WS-VNDSTL-EFF-BEG-DTE-NN                         14630013
146400*              ,:WS-VNDSTL-EFF-END-DTE                            14640013
146500*               :WS-VNDSTL-EFF-END-DTE-NN                         14650013
146600*              ,:WS-VNDSTL-COST-UM-CDE                            14660013
146700*              ,:WS-VNDSTL-RTL-UM-CDE                             14670013
146800*              ,:WS-VNDSTL-MLT-PRIC-PT-IND                        14680013
146900*              ,:WS-VNDSTL-BYP-CAT-IND                            14690013
147000*              ,:WS-VNDSTL-SLHTT-SEQ-NBR                          14700013
147100*              ,:WS-VNDSTL-CRE-BY-USR-ID                          14710013
147200*              ,:WS-VNDSTL-LAST-UPD-BY-USR-ID                     14720013
147300*              ,:WS-VNDSTL-LAST-UPD-TMST                          14730013
147400*                  )                                              14740013
147500*              END-EXEC                                           14750013
147600            WHEN DS009-PROCESS-TABLE = 'TINPKSU'                  14760013
147700               EXEC SQL                                           14770013
147800                  INSERT INTO TINPKSU                             14780013
147900                     (                                            14790013
148000                        SHIPT_UNT_ID                              14800013
148100                       ,PO_NBR                                    14810013
148200                       ,SEQ_NBR                                   14820013
148300                    )                                             14830013
148400                VALUES (                                          14840013
148500                    :WS-INPKSU-SHIPT-UNT-ID                       14850013
148600                   ,:WS-INPKSU-PO-NBR                             14860013
148700                   ,:WS-INPKSU-SEQ-NBR                            14870013
148800                       )                                          14880013
148900               END-EXEC                                           14890013
151000            WHEN DS009-PROCESS-TABLE = 'TSHUUPC'                  15100013
151100               EXEC SQL                                           15110013
151200                  INSERT INTO TSHUUPC                             15120013
151300                    (                                             15130013
151400                       SHIPT_UNT_ID                               15140013
151500                      ,TRN_NBR                                    15150013
151600                      ,TRN_LNE_NBR                                15160013
151700                      ,TRN_TYP_CDE                                15170013
151800                      ,UPC_NBR                                    15180013
151900                      ,SHPD_QTY                                   15190013
152000                      ,RCVR_SEQ_NBR                               15200013
152100                    )                                             15210013
152200                VALUES (                                          15220013
152300                      :WS-SHUUPC-SHIPT-UNT-ID                     15230013
152400                     ,:WS-SHUUPC-TRN-NBR                          15240013
152500                     ,:WS-SHUUPC-TRN-LNE-NBR                      15250013
152600                     ,:WS-SHUUPC-TRN-TYP-CDE                      15260013
152700                     ,:WS-SHUUPC-UPC-NBR                          15270013
152800                     ,:WS-SHUUPC-SHPD-QTY                         15280013
152900                     ,:WS-SHUUPC-RCVR-SEQ-NBR                     15290013
153000                       )                                          15300013
153100               END-EXEC                                           15310013
153200            WHEN DS009-PROCESS-TABLE = 'TSHPUNT'                  15320013
153300               EXEC SQL                                           15330013
153400                  INSERT INTO TSHPUNT                             15340013
153500                    (                                             15350013
153600                        SHIPT_UNT_ID                              15360013
153700                       ,ORGN_OPER_UNT_ID                          15370013
153800                       ,ORGN_FCLTY_ID                             15380013
153900                       ,DEST_OPER_UNT_ID                          15390013
154000                       ,DEST_FCLTY_ID                             15400013
154100                       ,SHIPT_UNT_SRC_ID                          15410013
154200                       ,HIER_LVL_CDE                              15420013
154300                       ,NEXT_SHIPT_UNT_ID                         15430013
154400                       ,ORIG_SHIPT_UNT_ID                         15440013
154500                       ,ACTV_IND                                  15450013
154600                       ,CRE_DTE                                   15460013
154700                       ,CRE_TM                                    15470013
154800                       ,CRE_USR_ID                                15480013
154900                       ,CRE_PGM_NM                                15490013
155000                    )                                             15500013
155100                VALUES (                                          15510013
155200                       :WS-SHPUNT-SHIPT-UNT-ID                    15520013
155300                      ,:WS-SHPUNT-ORGN-OPER-UNT-ID                15530013
155400                      ,:WS-SHPUNT-ORGN-FCLTY-ID                   15540013
155500                      ,:WS-SHPUNT-DEST-OPER-UNT-ID                15550013
155600                      ,:WS-SHPUNT-DEST-FCLTY-ID                   15560013
155700                      ,:WS-SHPUNT-SHIPT-UNT-SRC-ID                15570013
155800                      ,:WS-SHPUNT-HIER-LVL-CDE                    15580013
155900                      ,:WS-SHPUNT-NEXT-SHIPT-UNT-ID               15590013
156000                      ,:WS-SHPUNT-ORIG-SHIPT-UNT-ID               15600013
156100                      ,:WS-SHPUNT-ACTV-IND                        15610013
156200                      ,:WS-SHPUNT-CRE-DTE                         15620013
156300                      ,:WS-SHPUNT-CRE-TM                          15630013
156400                      ,:WS-SHPUNT-CRE-USR-ID                      15640013
156500                      ,:WS-SHPUNT-CRE-PGM-NM                      15650013
156600                       )                                          15660013
156700               END-EXEC                                           15670013
156800          WHEN DS009-PROCESS-TABLE = 'TSHUNLO'                    15680013
156900             EXEC SQL                                             15690013
157000                INSERT INTO TSHUNLO                               15700013
157100                  (                                               15710013
157200                   SHIPT_UNT_ID                                   15720013
157300                  ,OPER_UNT_ID                                    15730013
157400                  ,FCLTY_ID                                       15740013
157500                  ,SCN_LOC_ID                                     15750013
157600                  ,CRE_USR_ID                                     15760013
157700                  ,CRE_TMST                                       15770013
157800                  ,TRIP_ID                                        15780013
157900                  ,PRTR_TYP_CDE                                   15790013
158000                  ,LBL_PRT_BTCH_ID                                15800013
158100                  ,ACTV_CDE                                       15810013
158200                  )                                               15820013
158300              VALUES (                                            15830013
158400                :WS-SHUNLO                                        15840013
158500                     )                                            15850013
158600             END-EXEC                                             15860013
158700            WHEN DS009-PROCESS-TABLE = 'TMESTDS'                  15870013
158800               EXEC SQL                                           15880013
158900                  INSERT INTO TMESTDS                             15890013
159000                    (                                             15900013
159100                    PO_NBR                                        15910013
159200                   ,PO_LNE_NBR                                    15920013
159300                   ,PLAN_NBR                                      15930013
159400                   ,STR_NBR                                       15940013
159500                   ,STR_DISTRO_QTY                                15950013
159600                   ,ALLOC_SEQ_CDE                                 15960013
159700                   ,RNK_SEQ_NBR                                   15970013
159800                    )                                             15980013
159900                VALUES (                                          15990013
160000                   :WS-MESTDS-PO-NBR                              16000013
160100                  ,:WS-MESTDS-PO-LNE-NBR                          16010013
160200                  ,:WS-MESTDS-PLAN-NBR                            16020013
160300                  ,:WS-MESTDS-STR-NBR                             16030013
160400                  ,:WS-MESTDS-STR-DISTRO-QTY                      16040013
160500                  ,:WS-MESTDS-ALLOC-SEQ-CDE                       16050013
160600                  ,:WS-MESTDS-RNK-SEQ-NBR                         16060013
160700                       )                                          16070013
160800               END-EXEC                                           16080013
160900*           WHEN DS009-PROCESS-TABLE = 'TEXTENT'                  16090013
161000*              EXEC SQL                                           16100013
161100*                 INSERT INTO TEXTENT                             16110013
161200*                   (                                             16120013
161300*                    ENT_ID                                       16130013
161400*                   ,SCAC_CDE                                     16140013
161500*                   ,DUN_NBR                                      16150013
161600*                   ,ASN_TRSCP_IND                                16160013
161700*JS                 ,CONSDT_PKSL_IND                              16170013
161800*JS                 ,ASN_PO_RU_IND                                16180013
161900*                   ,FED_EXPRESS_NBR                              16190013
162000*                   ,MDSE_VENDOR_IND                              16200013
162100*                   ,CARRIER_IND                                  16210013
162200*                   ,STATUS_CDE                                   16220013
162300*                   ,CARR_MAN_PRO_IND                             16230013
162400*                   ,EDI214_TEST_IND                              16240013
162500*                   ,IMPRT_IND                                    16250013
162600*                   ,SHIP_INSTR_LT_QTY                            16260013
162700*                   ,SHIP_INSTR_REQD                              16270013
162800*                   ,EXP_VEND_IND                                 16280013
162900*                   ,NEED_1099_IND                                16290013
163000*                   ,CRE_BY_UID                                   16300013
163100*                   ,CRE_TMST                                     16310013
163200*                   ,LAST_UPD_BY_UID                              16320013
163300*                   ,LAST_UPD_TMST                                16330013
163400*MAM                ,CFY_SLSRNK_NBR                               16340013
163500*MAM                ,PFY_SLSRNK_NBR                               16350013
163600*                   ,CRE_ASN_FCST_IND                             16360013
163700*                   ,CRE_SHIPT_FCST_IND                           16370013
163800*                   ,STR_DISTRO_LT_QTY                            16380013
163900*                   ,VLD_CART_LBL_IND                             16390013
164000*                   ,PRNT_CO_ENT_ID                               16400013
164100*                   ,VND_CLSN_CDE                                 16410013
164200*                   ,VND_PRSST_CDE                                16420013
164300*                   ,FED_TX_ID_TYP_CDE                            16430013
164400*                   ,FED_TX_ID_NBR                                16440013
164500*                   ,FCTR_IND                                     16450013
164600*                   ,PRNT_CO_IND                                  16460013
164700*                   ,CAP_EXP_CDE                                  16470013
164800*                   ,HLD_PAYT_IND                                 16480013
164900*                   ,PAY_FCTR_VND_IND                             16490013
165000*                   ,SEPR_INVC_PAYT_IND                           16500013
165100*                   ,WHLDG_PAYT_TYP_CDE                           16510013
165200*                   ,PAYT_HNDLG_CDE                               16520013
165300*                   )                                             16530013
165400*               VALUES (                                          16540013
165500*                  :WS-EXTENT-ENT-ID                              16550013
165600*                 ,:WS-EXTENT-SCAC-CDE                            16560013
165700*                 ,:WS-EXTENT-DUN-NBR                             16570013
165800*                 ,:WS-EXTENT-ASN-TRSCP-IND                       16580013
165900*JS               ,:WS-EXTENT-CONSDT-PKSL-IND                     16590013
166000*JS               ,:WS-EXTENT-ASN-PO-RU-IND                       16600013
166100*                 ,:WS-EXTENT-FED-EXPRESS-NBR                     16610013
166200*                 ,:WS-EXTENT-MDSE-VENDOR-IND                     16620013
166300*                 ,:WS-EXTENT-CARRIER-IND                         16630013
166400*                 ,:WS-EXTENT-STATUS-CDE                          16640013
166500*                 ,:WS-EXTENT-CARR-MAN-PRO-IND                    16650013
166600*                 ,:WS-EXTENT-EDI214-TEST-IND                     16660013
166700*                 ,:WS-EXTENT-IMPRT-IND                           16670013
166800*                 ,:WS-EXTENT-SHIP-INSTR-LT-QTY                   16680013
166900*                 ,:WS-EXTENT-SHIP-INSTR-REQD                     16690013
167000*                 ,:WS-EXTENT-EXP-VEND-IND                        16700013
167100*                 ,:WS-EXTENT-NEED-1099-IND                       16710013
167200*                 ,:WS-EXTENT-CRE-BY-UID                          16720013
167300*                 ,:WS-EXTENT-CRE-TMST                            16730013
167400*                 ,:WS-EXTENT-LAST-UPD-BY-UID                     16740013
167500*                 ,:WS-EXTENT-LAST-UPD-TMST                       16750013
167600*MAM              ,:WS-EXTENT-CFY-SLSRNK-NBR                      16760013
167700*MAM              ,:WS-EXTENT-PFY-SLSRNK-NBR                      16770013
167800*                 ,:WS-EXTENT-CRE-ASN-FCST-IND                    16780013
167900*                 ,:WS-EXTENT-CRE-SHIPT-FCST-IND                  16790013
168000*                 ,:WS-EXTENT-STR-DISTRO-LT-QTY                   16800013
168100*                 ,:WS-EXTENT-VLD-CART-LBL-IND                    16810013
168200*                 ,:WS-EXTENT-PRNT-CO-ENT-ID                      16820013
168300*                 ,:WS-EXTENT-VND-CLSN-CDE                        16830013
168400*                 ,:WS-EXTENT-VND-PRSST-CDE                       16840013
168500*                 ,:WS-EXTENT-FED-TX-ID-TYP-CDE                   16850013
168600*                 ,:WS-EXTENT-FED-TX-ID-NBR                       16860013
168700*                 ,:WS-EXTENT-FCTR-IND                            16870013
168800*                 ,:WS-EXTENT-PRNT-CO-IND                         16880013
168900*                 ,:WS-EXTENT-CAP-EXP-CDE                         16890013
169000*                 ,:WS-EXTENT-HLD-PAYT-IND                        16900013
169100*                 ,:WS-EXTENT-PAY-FCTR-VND-IND                    16910013
169200*                 ,:WS-EXTENT-SEPR-INVC-PAYT-IND                  16920013
169300*                 ,:WS-EXTENT-WHLDG-PAYT-TYP-CDE                  16930013
169400*                 ,:WS-EXTENT-PAYT-HNDLG-CDE                      16940013
169500*                      )                                          16950013
169600*              END-EXEC                                           16960013
169700*           WHEN DS009-PROCESS-TABLE = 'TENTNME'                  16970013
169800*              EXEC SQL                                           16980013
169900*                 INSERT INTO TENTNME                             16990013
170000*                   (                                             17000013
170100*                    ENT_ID                                       17010013
170200*                   ,SEQ_NBR                                      17020013
170300*                   ,ENT_NAME_DESC                                17030013
170400*                   ,TYPE_CDE                                     17040013
170500*                   )                                             17050013
170600*               VALUES (                                          17060013
170700*                    :WS-ENTNME-ENT-ID                            17070013
170800*                   ,:WS-ENTNME-SEQ-NBR                           17080013
170900*                   ,:WS-ENTNME-ENT-NAME-DESC                     17090013
171000*                   ,:WS-ENTNME-TYPE-CDE                          17100013
171100*                      )                                          17110013
171200*              END-EXEC                                           17120013
171300*           WHEN DS009-PROCESS-TABLE = 'TVNDDPT'                  17130013
171400*              EXEC SQL                                           17140013
171500*                 INSERT INTO TVNDDPT                             17150013
171600*                   (                                             17160013
171700*                    ENT_ID                                       17170013
171800*                   ,DEPT_NBR                                     17180013
171900*                   ,INHOUSE_NBR                                  17190013
172000*                   ,VEND_TYP_IND                                 17200013
172100*                   ,INVC_REQ_PO_IND                              17210013
172200*                   ,VND_DEPT_STAT_CD                             17220013
172300*                   )                                             17230013
172400*               VALUES (                                          17240013
172500*                    :WS-VNDDPT-ENT-ID                            17250013
172600*                   ,:WS-VNDDPT-DEPT-NBR                          17260013
172700*                   ,:WS-VNDDPT-INHOUSE-NBR                       17270013
172800*                   ,:WS-VNDDPT-VEND-TYP-IND                      17280013
172900*                   ,:WS-VNDDPT-INVC-REQ-PO-IND                   17290013
173000*                   ,:WS-VNDDPT-VND-DEPT-STAT-CD                  17300013
173100*                      )                                          17310013
173200*              END-EXEC                                           17320013
173300            WHEN DS009-PROCESS-TABLE = 'TINSTCD'                  17330013
173400               EXEC SQL                                           17340013
173500                  INSERT INTO TINSTCD                             17350013
173600                    (                                             17360013
173700                     INSTR_NBR                                    17370013
173800                    ,INSTR_DESC                                   17380013
173900                    ,CRE_BY_UID                                   17390013
174000                    ,CRE_DTE                                      17400013
174100                    )                                             17410013
174200                VALUES (                                          17420013
174300                     :WS-INSTCD-INSTR-NBR                         17430013
174400                    ,:WS-INSTCD-INSTR-DESC                        17440013
174500                    ,:WS-INSTCD-CRE-BY-UID                        17450013
174600                    ,:WS-INSTCD-CRE-DTE                           17460013
174700                       )                                          17470013
174800               END-EXEC                                           17480013
174900*           WHEN DS009-PROCESS-TABLE = 'TSPSTDS'                  17490021
175000*              EXEC SQL                                           17500014
175100*                 INSERT INTO TSPSTDS                             17510014
175200*                   (                                             17520014
175300*                    PO_NBR                                       17530014
175400*                   ,PO_LNE_NBR                                   17540014
175500*                   ,PLAN_NBR                                     17550014
175600*                   ,STR_NBR                                      17560014
175700*                   ,STR_DISTRO_QTY                               17570014
175800*                   )                                             17580014
175900*               VALUES (                                          17590014
176000*                    :WS-SPSTDS-PO-NBR                            17600014
176100*                   ,:WS-SPSTDS-PO-LNE-NBR                        17610014
176200*                   ,:WS-SPSTDS-PLAN-NBR                          17620014
176300*                   ,:WS-SPSTDS-STR-NBR                           17630014
176400*                   ,:WS-SPSTDS-STR-DISTRO-QTY                    17640014
176500*                      )                                          17650014
176600*              END-EXEC                                           17660014
176700            WHEN DS009-PROCESS-TABLE = 'TTRBNTF'                  17670013
176800               EXEC SQL                                           17680013
176900                  INSERT INTO TTRBNTF                             17690013
177000                    (                                             17700013
177100                     NOTIF_NBR                                    17710013
177200                    ,OPER_UNT_ID                                  17720013
177300                    ,FCLTY_ID                                     17730013
177400                    ,DEPT_NBR                                     17740013
177500                    ,ENT_ID                                       17750013
177600                    ,PO_NBR                                       17760013
177700                    ,PO_LNE_NBR                                   17770013
177800                    ,REC_SEQ_NBR                                  17780013
177900                    ,TRBL_RSN_CDE                                 17790013
178000                    ,NOTIF_TMST                                   17800013
178100                    ,NOTIF_UID                                    17810013
178200                    ,RESOLVED_IND                                 17820013
178300                    ,RESOLVED_TMST                                17830013
178400                    ,RESOLVED_UID                                 17840013
178500                    ,ACKNOWLG_TMST                                17850013
178600                    ,ACKNOWLG_UID                                 17860013
178700                    ,CNTCT_EXT                                    17870013
178800                    ,FCLTY_AREA_ID                                17880013
178900                    ,SHIPT_ID                                     17890013
179000                    ,PKSL_SEQ_NBR                                 17900013
179100                    ,PKSL_LNE_NBR                                 17910013
179200                    ,WORK_ORD_SEQ_NBR                             17920013
179300                    ,WO_INSTR_SEQ_NBR                             17930013
179400                    ,OVER_SHT_PCT                                 17940013
179500                    ,LAST_DTL_CRE_TMST                            17950013
179600                    ,CRE_IND                                      17960013
179700                    ,PRORATE_IND                                  17970013
179800                    ,RTV_IND                                      17980013
179900                    ,RTV_RESPONSE_TMST                            17990013
180000                    ,PO_VER_NBR                                   18000013
180100                    ,PO_LNE_VER_NBR                               18010013
180200                    ,PLN_SHIP_VER_NBR                             18020013
180300                    ,ERLY_LTE_DAY_QTY                             18030013
180400                    ,INITR_ID                                     18040013
180500                    ,RSPNB_RSLU_ID                                18050013
180600                    ,PFMC_TRKG_ID                                 18060013
180700                    ,ACTVY_RSLU_CDE                               18070013
180800                    ,INITR_ENT_ID                                 18080013
180900                    )                                             18090013
181000                VALUES (                                          18100013
181100                   :WS-TRBNTF-NOTIF-NBR                           18110013
181200                  ,:WS-TRBNTF-OPER-UNT-ID                         18120013
181300                  ,:WS-TRBNTF-FCLTY-ID                            18130013
181400                  ,:WS-TRBNTF-DEPT-NBR                            18140013
181500                  ,:WS-TRBNTF-ENT-ID                              18150013
181600                  ,:WS-TRBNTF-PO-NBR                              18160013
181700                  ,:WS-TRBNTF-PO-LNE-NBR                          18170013
181800                  ,:WS-TRBNTF-REC-SEQ-NBR                         18180013
181900                  ,:WS-TRBNTF-TRBL-RSN-CDE                        18190013
182000                  ,:WS-TRBNTF-NOTIF-TMST                          18200013
182100                  ,:WS-TRBNTF-NOTIF-UID                           18210013
182200                  ,:WS-TRBNTF-RESOLVED-IND                        18220013
182300                  ,:WS-TRBNTF-RESOLVED-TMST                       18230013
182400                  ,:WS-TRBNTF-RESOLVED-UID                        18240013
182500                  ,:WS-TRBNTF-ACKNOWLG-TMST                       18250013
182600                  ,:WS-TRBNTF-ACKNOWLG-UID                        18260013
182700                  ,:WS-TRBNTF-CNTCT-EXT                           18270013
182800                  ,:WS-TRBNTF-FCLTY-AREA-ID                       18280013
182900                  ,0                                              18290013
183000                  ,0                                              18300013
183100                  ,0                                              18310013
183200                  ,0                                              18320013
183300                  ,0                                              18330013
183400                  ,:WS-TRBNTF-OVER-SHT-PCT                        18340013
183500                  ,:WS-TRBNTF-LAST-DTL-CRE-TMST                   18350013
183600                  ,:WS-TRBNTF-CRE-IND                             18360013
183700                  ,:WS-TRBNTF-PRORATE-IND                         18370013
183800                  ,:WS-TRBNTF-RTV-IND                             18380013
183900                  ,:WS-TRBNTF-RTV-RESPONSE-TMST                   18390013
184000                  ,:WS-TRBNTF-PO-VER-NBR                          18400013
184100                  ,:WS-TRBNTF-PO-LNE-VER-NBR                      18410013
184200                  ,:WS-TRBNTF-PLN-SHIP-VER-NBR                    18420013
184300                  ,:WS-TRBNTF-ERLY-LTE-DAY-QTY                    18430013
184400                  ,:WS-TRBNTF-INITR-ID                            18440013
184500                  ,:WS-TRBNTF-RSPNB-RSLU-ID                       18450013
184600                  ,:WS-TRBNTF-PFMC-TRKG-ID                        18460013
184700                  ,:WS-TRBNTF-ACTVY-RSLU-CDE                      18470013
184800                  ,:WS-TRBNTF-INITR-ENT-ID                        18480013
184900                       )                                          18490013
185000               END-EXEC                                           18500013
185100            WHEN DS009-PROCESS-TABLE = 'TTRBDTL'                  18510013
185200               EXEC SQL                                           18520013
185300                  INSERT INTO TTRBDTL                             18530013
185400                    (                                             18540013
185500                     NOTIF_NBR                                    18550013
185600                    ,CRE_TMST                                     18560013
185700                    ,CRE_UID                                      18570013
185800                    ,FREEFORM_TEXT                                18580013
185900                    )                                             18590013
186000                VALUES (                                          18600013
186100                  :WS-TRBDTL-NOTIF-NBR                            18610013
186200                 ,:WS-TRBDTL-CRE-TMST                             18620013
186300                 ,:WS-TRBDTL-CRE-UID                              18630013
186400                 ,:WS-TRBDTL-FREEFORM-TEXT                        18640013
186500                       )                                          18650013
186600               END-EXEC                                           18660013
186700*         WHEN DS009-PROCESS-TABLE = 'TPOUPC'                     18670021
186800*            EXEC SQL                                             18680014
186900*               INSERT INTO TPOUPC                                18690014
187000*                 (                                               18700014
187100*                  PO_NBR                                         18710014
187200*                 ,PO_LNE_NBR                                     18720014
187300*                 ,UPC_ID                                         18730014
187400*                 ,UPC_QTY                                        18740014
187500*                 ,UPC_RATO_QTY_NBR                               18750014
187600*                 ,LAST_UPD_TMST                                  18760014
187700*                 ,LAST_UPD_USR_ID                                18770014
187800*                 )                                               18780014
187900*             VALUES (                                            18790014
188000*               :WS-POUPC                                         18800014
188100*                    )                                            18810014
188200*            END-EXEC                                             18820014
188300          WHEN DS009-PROCESS-TABLE = 'TALLTMP'                    18830013
188400             EXEC SQL                                             18840013
188500                INSERT INTO TALLTMP                               18850013
188600                  (                                               18860013
188700                   PO_NBR                                         18870013
188800                  ,DEST_NBR                                       18880013
188900                  ,DEST_PCT                                       18890013
189000                  )                                               18900013
189100              VALUES (                                            18910013
189200                :WS-ALLTMP                                        18920013
189300                     )                                            18930013
189400             END-EXEC                                             18940013
189500          WHEN DS009-PROCESS-TABLE = 'TVNDAGR'                    18950013
189600             EXEC SQL                                             18960013
189700                INSERT INTO TVNDAGR                               18970013
189800                  (                                               18980013
189900                   ENT_ID                                         18990013
190000                  ,DEPT_NBR                                       19000013
190100                  ,AGRMT_TYP_ID                                   19010013
190200                  ,SEQ_NBR                                        19020013
190300                  ,TYP_CDE                                        19030013
190400                  ,EFFECTIVE_DATE                                 19040013
190500                  ,EXPIRATION_DATE                                19050013
190600                  ,PROD_STATUS_IND                                19060013
190700                  ,LEADTIME_DAYS_QTY                              19070013
190800                  ,BULK_STK_TKT_IND                               19080013
190900                  ,TKT_MKR_IND                                    19090013
191000                  ,RTV_RA_REQD_IND                                19100013
191100                  ,RTV_NO_RA_REQD_IND                             19110013
191200                  ,DEBIT_DESTROY_IND                              19120013
191300                  ,MARKOUT_IND                                    19130013
191400                  ,EARLY_SHIPT_IND                                19140013
191500                  ,LATE_SHIPT_IND                                 19150013
191600                  ,PARTIAL_SHIPT_IND                              19160013
191700                  ,FOB_POINT_TXT                                  19170013
191800                  ,SHIPT_POINT_TXT                                19180013
191900                  ,DISCOUNT_PCT                                   19190013
192000                  ,EXT_PAY_DAYS_QTY                               19200013
192100                  ,PAYT_TERM_ID                                   19210013
192200                  ,LAST_UPD_TMST                                  19220013
192300                  ,LAST_UPD_ID                                    19230013
192400                  ,PARTIAL_IND                                    19240013
192500                  ,FRGT_TERM_ID                                   19250013
192600                  ,AP_TRN_CDE                                     19260013
192700                  ,VND_AUTH_ID                                    19270013
192800                  ,PSTG_FRQ_CDE                                   19280013
192900                  ,DED_DISC_IND                                   19290013
193000                  ,DED_RTV_IND                                    19300013
193100                                                                  19310013
193200                  )                                               19320013
193300              VALUES (                                            19330013
193400                :WS-VNDAGR-DATA                                   19340013
193500                :WS-VNDAGR-NULLS                                  19350013
193600                     )                                            19360013
193700             END-EXEC                                             19370013
193800*         WHEN DS009-PROCESS-TABLE = 'TPAYREQ'                    19380013
193900*            EXEC SQL                                             19390013
194000*               INSERT INTO TPAYREQ                               19400013
194100*                 (                                               19410013
194200*                  PAYT_REQ_SEQ_NBR                               19420013
194300*                 ,PAYT_REQ_TYP_CDE                               19430013
194400*                 ,REMIT_TO_DUN_NBR                               19440013
194500*                 ,ENTR_UID                                       19450013
194600*                 ,ENTR_DTE                                       19460013
194700*                 ,ENTR_TRMNL_ID                                  19470013
194800*                 ,PO_NBR                                         19480013
194900*                 ,VER_NBR                                        19490013
195000*                 )                                               19500013
195100*             VALUES (                                            19510013
195200*               :WS-PAYREQ-DATA                                   19520013
195300*               :WS-PAYREQ-NULLS                                  19530013
195400*                    )                                            19540013
195500*            END-EXEC                                             19550013
195600          WHEN DS009-PROCESS-TABLE = 'TINVOIC'                    19560013
195700             CONTINUE                                             19570013
195800*            EXEC SQL                                             19580013
195900*               INSERT INTO TINVOIC                               19590013
196000*                 (                                               19600013
196100*                  PAYT_REQ_SEQ_NBR                               19610013
196200*                 ,INVC_ID                                        19620013
196300*                 ,STR_NBR                                        19630013
196400*                 ,INVC_TYP_CDE                                   19640013
196500*                 ,STATUS_CDE                                     19650013
196600*                 ,INVC_DTE                                       19660013
196700*                 ,HOLD_IND                                       19670013
196800*                 ,ENTR_MTHD_CDE                                  19680013
196900*                 ,PAYT_RLSE_TMST                                 19690013
197000*                 ,PAYT_DTE                                       19700013
197100*                 ,GRO_COST_AMT                                   19710013
197200*                 ,INIT_INVC_ID                                   19720013
197300*                 ,BAR_CDE                                        19730013
197400*                 ,SPLIT_TERMS_IND                                19740013
197500*                 ,DTL_ENTR_IND                                   19750013
197600*                 ,STATUS_CHG_TMST                                19760013
197700*                 ,INVC_CART_CT                                   19770013
197800*                 ,CALC_DUE_DTE                                   19780013
197900*                 ,DUE_DTE_SRC_CDE                                19790013
198000*                 ,PPD_RVRSL_IND                                  19800013
198100*                 ,INVC_NET_COST_AMT                              19810013
198200*                 ,AP_PRC_CDE                                     19820013
198300*                 ,AP_PRC_DTE                                     19830013
198400*                 )                                               19840013
198500*             VALUES (                                            19850013
198600*               :WS-INVOIC-DATA                                   19860013
198700*               :WS-INVOIC-NULLS                                  19870013
198800*                    )                                            19880013
198900*            END-EXEC                                             19890013
199000          WHEN DS009-PROCESS-TABLE = 'TALCHRG'                    19900013
199100             CONTINUE                                             19910013
199200*            EXEC SQL                                             19920013
199300*               INSERT INTO TALCHRG                               19930013
199400*                 (                                               19940013
199500*                  PAYT_REQ_SEQ_NBR                               19950013
199600*                 ,ALW_CHRG_SEQ_NBR                               19960013
199700*                 ,ALW_CHRG_TYP_CDE                               19970013
199800*                 ,ALW_CHRG_CDE                                   19980013
199900*                 ,ALW_CHRG_SER_CDE                               19990013
200000*                 ,ALW_CHRG_PCT                                   20000013
200100*                 ,ALW_CHRG_AMT                                   20010013
200200*                 )                                               20020013
200300*             VALUES (                                            20030013
200400*               :WS-ALCHRG                                        20040013
200500*                    )                                            20050013
200600*            END-EXEC                                             20060013
200700          WHEN DS009-PROCESS-TABLE = 'TPREQIT'                    20070013
200800             EXEC SQL                                             20080013
200900                INSERT INTO TPREQIT                               20090013
201000                  (                                               20100013
201100                   PAYT_REQ_SEQ_NBR                               20110013
201200                  ,PAYT_REQ_LNE_NBR                               20120013
201300                  ,PAY_REQ_LNE_QTY                                20130013
201400                  ,QTY_UNT_OF_MSMT                                20140013
201500                  ,UNT_COST_AMT                                   20150013
201600                  )                                               20160013
201700              VALUES (                                            20170013
201800                :WS-PREQIT                                        20180013
201900                     )                                            20190013
202000             END-EXEC                                             20200013
202100          WHEN DS009-PROCESS-TABLE = 'TASNDTL'                    20210013
202200             EXEC SQL                                             20220013
202300                INSERT INTO TASNDTL                               20230013
202400                  (                                               20240013
202500                   ASNHDR_ID                                      20250013
202600                  ,ASNDTL_NBR                                     20260013
202700                  ,PO_NBR                                         20270013
202800                  ,SELR_INV_NBR                                   20280013
202900                  ,SEQ_NBR                                        20290013
203000                  ,UPC_NBR                                        20300013
203100                  ,ALT_PROD1_CDE                                  20310013
203200                  ,ALT_PROD1_ID                                   20320013
203300                  ,ALT_PROD2_CDE                                  20330013
203400                  ,ALT_PROD2_ID                                   20340013
203500                  ,SHIPT_QTY                                      20350013
203600                  ,SHIPT_DTE_QTY                                  20360013
203700                  ,SHIPT_UM_CDE                                   20370013
203800                  ,ITM_STATUS_CDE                                 20380013
203900                  ,ITM_ERR_CDE                                    20390013
204000                  ,ITM_ERR_QTY                                    20400013
204100                  ,ITM_ERR_QTY_UM_CDE                             20410013
204200                  ,PKG_QTY                                        20420013
204300                  ,PKG_QTY_UM_CDE                                 20430013
204400                  ,VEND_ORD_QTY                                   20440013
204500                  ,ORD_QTY_UM_CDE                                 20450013
204600                  ,WGT_MSMT                                       20460013
204700                  ,VOL_MSMT                                       20470013
204800                  ,VOL_UM_CDE                                     20480013
204900                  ,LEN_MSMT                                       20490013
205000                  ,HT_MSMT                                        20500013
205100                  ,WDTH_MSMT                                      20510013
205200                  ,SIZE_UM_CDE                                    20520013
205300                  ,ITM_SUBST_UPC_NBR                              20530013
205400                  ,TKT_ERR_CDE                                    20540013
205500                  ,WGT_UM_CDE                                     20550013
205600                  ,INPK_EA_QTY                                    20560013
205610                  ,LOC_NBR                                        20561013
205620                  )                                               20562013
205630              VALUES (                                            20563013
205640                :WS-ASNDTL-DATA                                   20564013
205650                :WS-ASNDTL-NULLS                                  20565013
205660                     )                                            20566013
205670             END-EXEC                                             20567013
205680          WHEN DS009-PROCESS-TABLE = 'TASNORD'                    20568013
205690             EXEC SQL                                             20569013
205700                INSERT INTO TASNORD                               20570013
205800                  (                                               20580013
205900                   ASNHDR_ID                                      20590013
206000                  ,PO_NBR                                         20600013
206100                  ,SEQ_NBR                                        20610013
206200                  ,SELR_INV_NBR                                   20620013
206300                  ,VEND_ORD_NBR                                   20630013
206400                  ,CUST_NBR                                       20640013
206500                  ,PROMO_NBR                                      20650013
206600                  ,VEND_NBR                                       20660013
206700                  ,MDSEDP_NBR                                     20670013
206800                  ,ORD_STATUS_CDE                                 20680013
206900                  ,CHG_ORD_SEQ_NBR                                20690013
207000                  ,PO_DTE                                         20700013
207100                  ,LTE_CHG_AMT                                    20710013
207200                  ,EXCH_FCTR                                      20720013
207300                  ,SELR_CUR_CDE                                   20730013
207400                  ,MTCH_PO_CDE                                    20740013
207500                  ,EARLY_LTE_CDE                                  20750013
207600                  ,SEQ_NBR_IND                                    20760013
207700                  ,CART_SHIP_QTY                                  20770013
207700                  ,LOC_NBR                                        20771023
207800                  )                                               20780013
207900              VALUES (                                            20790013
208000                :WS-ASNORD-DATA                                   20800013
208100                :WS-ASNORD-NULLS                                  20810013
208200                     )                                            20820013
208300             END-EXEC                                             20830013
208400          WHEN DS009-PROCESS-TABLE = 'TASNHDR'                    20840013
208500             EXEC SQL                                             20850013
208600                INSERT INTO TASNHDR                               20860013
208700                  (                                               20870013
208800                   OPERCO_NBR                                     20880013
208900                  ,EDI_VEND_ID                                    20890013
209000                  ,ASNHDR_NBR                                     20900013
209100                  ,ASNHDR_ID                                      20910013
209200                  ,ASNHDR_TMST                                    20920013
209300                  ,CRE_DTE                                        20930013
209400                  ,SHIP_DTE                                       20940013
209500                  ,BOL_NBR                                        20950013
209600                  ,PRO_NBR                                        20960013
209700                  ,CART_SHIP_QTY                                  20970013
209800                  ,GRO_WGHT_MSMT                                  20980013
209900                  ,ANTC_DELY_DTE                                  20990013
210000                  ,REC_MTHD_IND                                   21000013
210100                  ,SHIPT_STATUS_CDE                               21010013
210200                  ,CARR_NAME                                      21020013
210300                  ,TRANS_MTHD_CDE                                 21030013
210400                  ,CARR_ID_CDE                                    21040013
210500                  ,CARR_ID_QUAL_CDE                               21050013
210600                  ,RTE_SEQ_CDE                                    21060013
210700                  ,SHPT_VOL_MSMT                                  21070013
210800                  ,EQUIP_INIT_CDE                                 21080013
210900                  ,EQUIP_NBR                                      21090013
211000                  ,SCHD_SHIP_DTE                                  21100013
211100                  ,CRE_TM                                         21110013
211200                  ,REJ_SHIPT_CDE                                  21120013
211300                  ,SHPT_VOL_UM_CDE                                21130013
211400                  ,GRO_WGHT_UM_CDE                                21140013
211500                  ,PRINT_IND                                      21150013
211600                  ,SHIP_PAYT_TERM_CDE                             21160013
211700                  ,RESPBL_LOC_CDE                                 21170013
211800                  ,RESPBL_LOC_DESC                                21180013
211900                  ,DC_PRT_IND                                     21190013
212000                  ,SHIP_TM                                        21200013
212100                  )                                               21210013
212200              VALUES (                                            21220013
212300                :WS-ASNHDR-DATA                                   21230013
212400                :WS-ASNHDR-NULLS                                  21240013
212500                     )                                            21250013
212600             END-EXEC                                             21260013
212700          WHEN DS009-PROCESS-TABLE = 'TASCRIT'                    21270013
212800             EXEC SQL                                             21280013
212900                INSERT INTO TASCRIT                               21290013
213000                  (                                               21300013
213100                   ASNHDR_ID                                      21310013
213200                  ,ASNCAR_NBR                                     21320013
213300                  ,ASNDTL_NBR                                     21330013
213400                  )                                               21340013
213500              VALUES (                                            21350013
213600                :WS-ASCRIT                                        21360013
213700                     )                                            21370013
213800             END-EXEC                                             21380013
213900          WHEN DS009-PROCESS-TABLE = 'TASNCAR'                    21390013
214000             EXEC SQL                                             21400013
214100                INSERT INTO TASNCAR                               21410013
214200                  (                                               21420013
214300                   ASNHDR_ID                                      21430013
214400                  ,ASNCAR_NBR                                     21440013
214500                  ,PO_NBR                                         21450013
214600                  ,SEQ_NBR                                        21460013
214700                  ,SELR_INV_NBR                                   21470013
214800                  ,VOL_MSMT                                       21480013
214900                  ,WGHT_MSMT                                      21490013
215000                  ,NBR_QUAL_CDE                                   21500013
215100                  ,PKG_QTY                                        21510013
215200                  ,PKG_QTY_UM_CDE                                 21520013
215300                  ,WGHT_UM_CDE                                    21530013
215400                  ,VOL_UM_CDE                                     21540013
215500                  ,PKG_CDE                                        21550013
215600                  ,LEN_MSMT                                       21560013
215700                  ,HT_MSMT                                        21570013
215800                  ,WDTH_MSMT                                      21580013
215900                  ,SIZE_UM_CDE                                    21590013
216000                  ,PKG_SIZE_QTY                                   21600013
216100                  ,INPK_EA_QTY                                    21610013
216200                  )                                               21620013
216300              VALUES (                                            21630013
216400                :WS-ASNCAR-DATA                                   21640013
216500                :WS-ASNCAR-NULLS                                  21650013
216600                     )                                            21660013
216700             END-EXEC                                             21670013
216800          WHEN DS009-PROCESS-TABLE = 'TASDTPL'                    21680013
216900             EXEC SQL                                             21690013
217000                INSERT INTO TASDTPL                               21700013
217100                  (                                               21710013
217200                   ASNHDR_ID                                      21720013
217300                  ,ASNDTL_NBR                                     21730013
217400                  ,PO_LN_NBR                                      21740013
217500                  ,ASSOC_QTY                                      21750013
217510                  ,ASDTPL_ALLOC_IND                               21751013
217520                  ,SHIPT_VAR_QTY                                  21752013
217530                  ,PR_CHG_EFF_DAY_NBR                             21753013
217540                  ,PR_VAR_IND                                     21754013
217550                  ,PR_DISC_IND                                    21755013
217560                  ,PO_NBR                                         21756013
217570                  )                                               21757013
217580              VALUES (                                            21758013
217590                :WS-ASDTPL-DATA                                   21759013
217600                :WS-ASDTPL-NULLS                                  21760013
217601                     )                                            21760113
217602             END-EXEC                                             21760213
217603          WHEN DS009-PROCESS-TABLE = 'TSEASET'                    21760313
217604             EXEC SQL                                             21760413
217605                INSERT INTO TSEASET                               21760513
217606                  (                                               21760613
217607                   SEASET_YR                                      21760713
217608                  ,SEASET_SHRT_NM                                 21760813
217609                  ,SEASET_TYP_CDE                                 21760913
217610                  ,SEASET_NM                                      21761013
217620                  ,SEASET_STAT_CDE                                21762013
217630                  ,STR_STUP_BEG_DTE                               21763013
217640                  ,STR_STUP_END_DTE                               21764013
217650                  ,STR_RLSE_BEG_DTE                               21765013
217660                  ,STR_RLSE_END_DTE                               21766013
217670                  ,LAST_UPD_BY_USR_ID                             21767013
217680                  ,LAST_UPD_TMST                                  21768013
217690                  ,DIVERT_PFX_NBR                                 21769013
217700                  )                                               21770013
217800              VALUES (                                            21780013
217900                :WS-SEASET                                        21790013
218000                     )                                            21800013
218100             END-EXEC                                             21810013
218200          WHEN DS009-PROCESS-TABLE = 'TSUNAUD'                    21820013
218300             EXEC SQL                                             21830013
218400                INSERT INTO TSUNAUD                               21840013
218500                  (                                               21850013
218600                   AUD_CNTL_NBR                                   21860013
218700                  ,AUD_STRT_TMST                                  21870013
218800                  ,AUD_STP_TMST                                   21880013
218900                  ,AUD_PSPND_MNIT_QTY                             21890013
219000                  ,AUD_CLO_MNIT_QTY                               21900013
219100                  ,AUD_USR_ID                                     21910013
219200                  ,OPER_UNT_ID                                    21920013
219300                  ,FCLTY_ID                                       21930013
219400                  ,PRC_FCLTY_AREA_ID                              21940013
219500                  ,AUD_STAT_CDE                                   21950013
219600                  ,AUD_TYP_CDE                                    21960013
219700                  )                                               21970013
219800              VALUES (                                            21980013
219900                :WS-SUNAUD                                        21990013
220000                     )                                            22000013
220100             END-EXEC                                             22010013
220200          WHEN DS009-PROCESS-TABLE = 'TSUATRN'                    22020013
220300             EXEC SQL                                             22030013
220400                INSERT INTO TSUATRN                               22040013
220500                  (                                               22050013
220600                   AUD_CNTL_NBR                                   22060013
220700                  ,SHIPT_UNT_ID                                   22070013
220800                  ,UNT_AUD_STRT_TMST                              22080013
220900                  ,UNT_AUD_STP_TMST                               22090013
221000                  ,UNT_PSPND_MNIT_QTY                             22100013
221100                  ,UNT_CLO_MNIT_QTY                               22110013
221200                  ,UNT_AUD_USR_ID                                 22120013
221300                  ,UNT_AUD_STAT_CDE                               22130013
221400                  ,TRN_NBR                                        22140013
221500                  ,REC_SEQ_NBR                                    22150013
221600                  ,DEST_OPER_UNT_ID                               22160013
221700                  ,DEST_FCLTY_ID                                  22170013
221800                  ,UNT_AUD_ERR_IND                                22180013
221900                  ,UNT_RSTRT_MNIT_QTY                             22190013
222000                  )                                               22200013
222100              VALUES (                                            22210013
222200                :WS-SUATRN                                        22220013
222300                     )                                            22230013
222400             END-EXEC                                             22240013
222500          WHEN DS009-PROCESS-TABLE = 'TSUAUPC'                    22250013
222600             EXEC SQL                                             22260013
222700                INSERT INTO TSUAUPC                               22270013
222800                  (                                               22280013
222900                    AUD_CNTL_NBR                                  22290013
223000                   ,SHIPT_UNT_ID                                  22300013
223100                   ,UPC_NBR                                       22310013
223200                   ,SCN_TMST                                      22320013
223300                   ,AUD_USR_ID                                    22330013
223400                   ,ITM_DESC                                      22340013
223500                   ,VND_STYL_DESC                                 22350013
223600                   ,UPC_CLOR_DESC                                 22360013
223700                   ,UPC_SIZE_DESC                                 22370013
223800                   ,UPC_RTL_AMT                                   22380013
223900                   ,UPC_CERTD_IND                                 22390013
224000                   ,SCND_UNT_QTY                                  22400013
224100                   ,SCN_TYP_CDE                                   22410013
224200                   ,SKU_NBR                                       22420013
224300                   ,DEPT_NBR                                      22430013
224400                   ,MAJ_CL_NBR                                    22440013
224500                   ,SUB_CL_NBR                                    22450013
224600                  )                                               22460013
224700              VALUES (                                            22470013
224800                :WS-SUAUPC                                        22480013
224900                     )                                            22490013
225000             END-EXEC                                             22500013
225100          WHEN DS009-PROCESS-TABLE = 'TSUEXCP'                    22510013
225200             EXEC SQL                                             22520013
225300                INSERT INTO TSUEXCP                               22530013
225400                  (                                               22540013
225500                   AUD_CNTL_NBR                                   22550013
225600                  ,SHIPT_UNT_ID                                   22560013
225700                  ,UPC_NBR                                        22570013
225800                  ,SCN_TMST                                       22580013
225900                  ,VILN_GP_CDE                                    22590013
226000                  ,VILN_GP_SEQ_NBR                                22600013
226100                  ,OVRRID_SYS_DAT_TXT                             22610013
226200                  )                                               22620013
226300              VALUES (                                            22630013
226400                :WS-SUEXCP                                        22640013
226500                     )                                            22650013
226600             END-EXEC                                             22660013
226700          WHEN DS009-PROCESS-TABLE = 'TCTEXCP'                    22670013
226800             EXEC SQL                                             22680013
226900                INSERT INTO TCTEXCP                               22690013
227000                  (                                               22700013
227100                   AUD_CNTL_NBR                                   22710013
227200                  ,SHIPT_UNT_ID                                   22720013
227300                  ,VILN_GP_CDE                                    22730013
227400                  ,VILN_GP_SEQ_NBR                                22740013
227500                  ,OVRRID_SYS_DAT_TXT                             22750013
227600                  )                                               22760013
227700              VALUES (                                            22770013
227800                :WS-CTEXCP                                        22780013
227900                     )                                            22790013
228000             END-EXEC                                             22800013
228100          WHEN DS009-PROCESS-TABLE = 'TIMTBKY'                    22810013
228200             EXEC SQL                                             22820013
228300                INSERT INTO TIMTBKY                               22830013
228400                  (                                               22840013
228500                   NOTIF_NBR                                      22850013
228600                  ,IMPRT_ID                                       22860013
228700                  ,IMPRT_SEQ_NBR                                  22870013
228800                  ,PRCS_TYP_CDE                                   22880013
228900                  ,CRE_TMST                                       22890013
229000                  )                                               22900013
229100              VALUES (                                            22910013
229200                :WS-IMTBKY                                        22920013
229300                     )                                            22930013
229400             END-EXEC                                             22940013
229500          WHEN DS009-PROCESS-TABLE = 'TPOPRPK'                    22950013
229600             EXEC SQL                                             22960013
229700                INSERT INTO TPOPRPK                               22970013
229800                  (                                               22980013
229900                   PO_NBR                                         22990013
230000                  ,VER_NBR                                        23000013
230100                  ,PO_PREPK_ID                                    23010013
230200                  ,PREPK_TYP_CDE                                  23020013
230300                  ,PREPK_DESC                                     23030013
230400                  ,PREPK_STAT_CDE                                 23040013
230500                  ,PREPK_UPC_NBR                                  23050013
230600                  ,INPK_UNT_QTY                                   23060013
230700                  ,INPK_CNVYB_IND                                 23070013
230800                  ,OTPK_UNT_QTY                                   23080013
230900                  ,OTPK_ORD_QTY                                   23090013
231000                  ,PK_DTL_CHG_TMST                                23100013
231100                  ,PK_SKU_NBR                                     23110013
231200                  )                                               23120013
231300              VALUES (                                            23130013
231400                :WS-POPRPK                                        23140013
231500                     )                                            23150013
231600             END-EXEC                                             23160013
231700                                                                  23170013
231800          WHEN DS009-PROCESS-TABLE = 'WST_SHPMT_XREF_HDR'         23180013
231900             EXEC SQL                                             23190013
232000                INSERT INTO WST_SHPMT_XREF_HDR                    23200013
232100                  (                                               23210013
232200                     EXT_SHP_ID                                   23220013
232300                    ,INTR_TRIP_ID                                 23230013
232400                    ,SOR_CDE                                      23240013
232500                    ,DMY_SEQ_NBR                                  23250013
232600                    ,DEST_LOC_NBR                                 23260013
232700                    ,DWNLD_CDE                                    23270013
232800                    ,RCPT_TMST                                    23280013
232900                    ,CRE_USR_ID                                   23290013
233000                    ,CRE_TMST                                     23300013
233100                    ,DWNLD_TMST                                   23310013
233200                    ,LAST_PRCG_TMST                               23320013
233300                    ,PRC_CDE                                      23330013
233400                    ,VER_NBR                                      23340013
233500                    ,CRE_PGM_CDE                                  23350013
233600                  )                                               23360013
233700              VALUES                                              23370013
233800                (                                                 23380013
233900                :DS008-DCLWST00001-DATA                           23390013
234000                :DS008-DST00001-NULLS                             23400013
234100                )                                                 23410013
234200             END-EXEC                                             23420013
234300                                                                  23430013
234400          WHEN DS009-PROCESS-TABLE = 'WST_SHPMT_XREF_DTL'         23440013
234500             EXEC SQL                                             23450013
234600                INSERT INTO WST_SHPMT_XREF_DTL                    23460013
234700                  (                                               23470013
234800                     EXT_SHP_ID                                   23480013
234900                    ,PO_NBR                                       23490013
235000                    ,PO_LNE_NBR                                   23500013
235100                    ,RCVR_SEQ_NBR                                 23510013
235200                    ,PREPK_ID                                     23520013
235300                    ,ASN_LVL_CDE                                  23530013
235400                    ,CRE_USR_ID                                   23540013
235500                    ,CRE_TMST                                     23550013
235600                    ,DWNLD_CDE                                    23560013
235700                    ,ACTV_CDE                                     23570013
235800                    ,CRE_PGM_CDE                                  23580013
235900                  )                                               23590013
236000              VALUES                                              23600013
236100                (                                                 23610013
236200                :DCLWST00002                                      23620013
236300                )                                                 23630013
236400             END-EXEC                                             23640013
236500          WHEN DS009-PROCESS-TABLE = 'TSULBXF'                    23650013
236600             EXEC SQL                                             23660013
236700                INSERT INTO TSULBXF                               23670013
236800                  (                                               23680013
236900                        SHIPT_UNT_ID                              23690013
237000                       ,BRCDE_NBR                                 23700013
237100                       ,CART_LBL_TYP_CDE                          23710013
237200                       ,DEST_OPER_UNT_ID                          23720013
237300                       ,STAT_CDE                                  23730013
237400                       ,LAST_STAT_CHG_TMST                        23740013
237500                       ,CRE_TMST                                  23750013
237600                  )                                               23760013
237700              VALUES (                                            23770013
237800                :WS-SULBXF                                        23780013
237900                     )                                            23790013
238000             END-EXEC                                             23800013
238100*         WHEN DS009-PROCESS-TABLE = 'TWEBITM'                    23810013
238200*            EXEC SQL                                             23820013
238300*               INSERT INTO TWEBITM                               23830013
238400*                 (                                               23840013
238500*                    INTR_UPC_ID                                  23850013
238600*                   ,EFF_BEG_TMST                                 23860013
238700*                   ,EFF_END_TMST                                 23870013
238800*                   ,ASRT_BEG_DTE                                 23880013
238900*                   ,ASRT_END_DTE                                 23890013
239000*                   ,STRG_AREA_SEQ_NBR                            23900013
239100*                   ,SHIP_WD_QTY                                  23910013
239200*                   ,SHIP_DPTH_QTY                                23920013
239300*                   ,SHIP_HT_QTY                                  23930013
239400*                   ,SHIP_WT_QTY                                  23940013
239500*                   ,SHIP_DIM_SRC_CDE                             23950013
239600*                   ,PKG_SEQ_NBR                                  23960013
239700*                   ,SHIP_RSTRC_SEQ_NBR                           23970013
239800*                   ,GFT_WRAP_AVL_IND                             23980013
239900*                   ,PRD_GP_NBR                                   23990013
240000*                   ,PRD_GP_IND                                   24000013
240100*                   ,SHIP_SRCHG_FEE_AMT                           24010013
240200*                   ,SHIP_SRVC_SEQ_NBR                            24020013
240300*                   ,SHIP_GP_SEQ_NBR                              24030013
240400*                   ,CRE_BY_USR_ID                                24040013
240500*                 )                                               24050013
240600*             VALUES (                                            24060013
240700*                    :WS-WEBITM-INTR-UPC-ID                       24070013
240800*                   ,:WS-WEBITM-EFF-BEG-TMST                      24080013
240900*                   ,:WS-WEBITM-EFF-END-TMST                      24090013
241000*                   :WS-WEBITM-EFF-END-TMST-NN                    24100013
241100*                   ,:WS-WEBITM-ASRT-BEG-DTE                      24110013
241200*                   ,:WS-WEBITM-ASRT-END-DTE                      24120013
241300*                   ,:WS-WEBITM-STRG-AREA-SEQ-NBR                 24130013
241400*                   ,:WS-WEBITM-SHIP-WD-QTY                       24140013
241500*                   ,:WS-WEBITM-SHIP-DPTH-QTY                     24150013
241600*                   ,:WS-WEBITM-SHIP-HT-QTY                       24160013
241700*                   ,:WS-WEBITM-SHIP-WT-QTY                       24170013
241800*                   ,:WS-WEBITM-SHIP-DIM-SRC-CDE                  24180013
241900*                   ,:WS-WEBITM-PKG-SEQ-NBR                       24190013
242000*                   ,:WS-WEBITM-SHIP-RSTRC-SEQ-NBR                24200013
242100*                   ,:WS-WEBITM-GFT-WRAP-AVL-IND                  24210013
242200*                   ,:WS-WEBITM-PRD-GP-NBR                        24220013
242300*                   ,:WS-WEBITM-PRD-GP-IND                        24230013
242400*                   ,:WS-WEBITM-SHIP-SRCHG-FEE-AMT                24240013
242500*                   ,:WS-WEBITM-SHIP-SRVC-SEQ-NBR                 24250013
242600*                   ,:WS-WEBITM-SHIP-GP-SEQ-NBR                   24260013
242700*                   ,:WS-WEBITM-CRE-BY-USR-ID                     24270013
242800*                    )                                            24280013
242900*            END-EXEC                                             24290013
243000*                                                                 24300013
243100          WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_CART'             24310013
243200*        MOVE SUT00024-SHIPT-UNT-ID TO PV-DISPLAY-NBR             24320013
243300*        DISPLAY 'OTBND_CART SUT00024-SHIPT-UNT-ID = '            24330013
243400*                 PV-DISPLAY-NBR                                  24340013
243500                                                                  24350013
243600             IF SUT00024-OTBND-TRIP-ID > ZERO                     24360013
243700                 EXEC SQL                                         24370013
243800                 INSERT INTO SUT_OTBND_CART                       24380013
243900               ( SHIPT_UNT_ID                                     24390013
244000                ,ORGN_LOC_NBR                                     24400013
244100                ,DEST_LOC_NBR                                     24410013
244200                ,CART_SRC_CDE                                     24420013
244300                ,CRE_DTE                                          24430013
244400                ,CRE_TM                                           24440013
244500                ,CRE_USR_ID                                       24450013
244600                ,CRE_PGM_NM                                       24460013
244700                ,MSTR_CART_IND                                    24470013
244800                ,PRNT_CART_ID                                     24480013
244900                ,ORIG_CART_ID                                     24490013
245000                ,CART_TYP_CDE                                     24500013
245100                ,LBL_PRT_SEQ_NBR                                  24510013
245200                ,CART_RVSN_NBR                                    24520013
245300                ,OTBND_TRIP_ID                                    24530013
245400                ,ACTV_IND                                         24540013
245500                ,ODD_UNT_IND                                      24550013
245600               )                                                  24560013
245700                 VALUES                                           24570013
245800               (                                                  24580013
245900                 :SUT00024-SHIPT-UNT-ID                           24590013
246000             , :SUT00024-ORGN-LOC-NBR                             24600013
246100             , :SUT00024-DEST-LOC-NBR                             24610013
246200             , :SUT00024-CART-SRC-CDE                             24620013
246300             , :SUT00024-CRE-DTE                                  24630013
246400             , :SUT00024-CRE-TM                                   24640013
246500             , :SUT00024-CRE-USR-ID                               24650013
246600             , :SUT00024-CRE-PGM-NM                               24660013
246700             , :SUT00024-MSTR-CART-IND                            24670013
246800             , :SUT00024-PRNT-CART-ID                             24680013
246900             , :SUT00024-ORIG-CART-ID                             24690013
247000             , :SUT00024-CART-TYP-CDE                             24700013
247100             , :SUT00024-LBL-PRT-SEQ-NBR                          24710013
247200             , :SUT00024-CART-RVSN-NBR                            24720013
247300             , :SUT00024-OTBND-TRIP-ID                            24730013
247400             , :SUT00024-ACTV-IND                                 24740013
247500             , :SUT00024-ODD-UNT-IND                              24750013
247600             )                                                    24760013
247700         END-EXEC                                                 24770013
247800                                                                  24780013
247900         ELSE                                                     24790013
248000                 EXEC SQL                                         24800013
248100                 INSERT INTO SUT_OTBND_CART                       24810013
248200               ( SHIPT_UNT_ID                                     24820013
248300                ,ORGN_LOC_NBR                                     24830013
248400                ,DEST_LOC_NBR                                     24840013
248500                ,CART_SRC_CDE                                     24850013
248600                ,CRE_DTE                                          24860013
248700                ,CRE_TM                                           24870013
248800                ,CRE_USR_ID                                       24880013
248900                ,CRE_PGM_NM                                       24890013
249000                ,MSTR_CART_IND                                    24900013
249100                ,PRNT_CART_ID                                     24910013
249200                ,ORIG_CART_ID                                     24920013
249300                ,CART_TYP_CDE                                     24930013
249400                ,LBL_PRT_SEQ_NBR                                  24940013
249500                ,CART_RVSN_NBR                                    24950013
249600                ,OTBND_TRIP_ID                                    24960013
249700                ,ACTV_IND                                         24970013
249800                ,ODD_UNT_IND                                      24980013
249900               )                                                  24990013
250000                 VALUES                                           25000013
250100               (                                                  25010013
250200                 :SUT00024-SHIPT-UNT-ID                           25020013
250300             , :SUT00024-ORGN-LOC-NBR                             25030013
250400             , :SUT00024-DEST-LOC-NBR                             25040013
250500             , :SUT00024-CART-SRC-CDE                             25050013
250600             , :SUT00024-CRE-DTE                                  25060013
250700             , :SUT00024-CRE-TM                                   25070013
250800             , :SUT00024-CRE-USR-ID                               25080013
250900             , :SUT00024-CRE-PGM-NM                               25090013
251000             , :SUT00024-MSTR-CART-IND                            25100013
251100             , :SUT00024-PRNT-CART-ID                             25110013
251200             , :SUT00024-ORIG-CART-ID                             25120013
251300             , :SUT00024-CART-TYP-CDE                             25130013
251400             , :SUT00024-LBL-PRT-SEQ-NBR                          25140013
251500             , :SUT00024-CART-RVSN-NBR                            25150013
251600             , NULL                                               25160013
251700             , :SUT00024-ACTV-IND                                 25170013
251800             , :SUT00024-ODD-UNT-IND                              25180013
251900             )                                                    25190013
252000         END-EXEC                                                 25200013
252100                                                                  25210013
252200         END-IF                                                   25220013
252300                                                                  25230013
252400          WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_LOC'              25240013
252500*        MOVE DS008-OTBLOC-SHIPT-UNT-ID TO PV-DISPLAY-NBR         25250013
252600*        DISPLAY 'OTBND_LOC SHIPT-UNT-ID = '                      25260013
252700*                 PV-DISPLAY-NBR                                  25270013
252800                                                                  25280013
252900                 EXEC SQL                                         25290013
253000                 INSERT INTO SUT_OTBND_LOC                        25300013
253100              (                                                   25310013
253200                SHIPT_UNT_ID                                      25320013
253300             ,  CRE_TMST                                          25330013
253400             ,  OTBND_TRIP_ID                                     25340013
253500             ,  LOC_NBR                                           25350013
253600             ,  SCN_CDE                                           25360013
253700             ,  CRE_USR_ID                                        25370013
253800             ,  ACTV_CDE                                          25380013
253900             ,  INBD_TRIP_ID                                      25390013
254000             )                                                    25400013
254100             VALUES                                               25410013
254200             (                                                    25420013
254300              :DS008-OTBLOC-SHIPT-UNT-ID                          25430013
254400           ,  :DS008-OTBLOC-CRE-TMST                              25440013
254500           ,  :DS008-OTBLOC-OTBND-TRIP-ID                         25450013
254600                  :DS008-OTBLOC-OTBND-TRIP-ID-N                   25460013
254700           ,  :DS008-OTBLOC-LOC-NBR                               25470013
254800           ,  :DS008-OTBLOC-SCN-CDE                               25480013
254900           ,  :DS008-OTBLOC-CRE-USR-ID                            25490013
255000           ,  :DS008-OTBLOC-ACTV-CDE                              25500013
255100           ,  :DS008-OTBLOC-INBD-TRIP-ID                          25510013
255200             )                                                    25520013
255300         END-EXEC                                                 25530013
255400                                                                  25540013
255500          WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_PKD_UPC'          25550013
255600                                                                  25560013
255700                 EXEC SQL                                         25570013
255800                 INSERT INTO SUT_OTBND_PKD_UPC                    25580013
255900              (                                                   25590013
256000                SHIPT_UNT_ID                                      25600013
256100             ,  TRN_NBR                                           25610013
256200             ,  RCVR_SEQ_NBR                                      25620013
256300             ,  TRN_LNE_NBR                                       25630013
256400             ,  TRN_TYP_CDE                                       25640013
256500             ,  UPC_NBR                                           25650013
256600             ,  PKD_BY_USR_ID                                     25660013
256700             ,  PKD_TMST                                          25670013
256800             ,  PKD_QTY                                           25680013
256900             ,  MODU_NBR                                          25690013
257000             )                                                    25700013
257100             VALUES                                               25710013
257200             (                                                    25720013
257300                :SUT00025-SHIPT-UNT-ID                            25730013
257400             ,  :SUT00025-TRN-NBR                                 25740013
257500             ,  :SUT00025-RCVR-SEQ-NBR                            25750013
257600             ,  :SUT00025-TRN-LNE-NBR                             25760013
257700             ,  :SUT00025-TRN-TYP-CDE                             25770013
257800             ,  :SUT00025-UPC-NBR                                 25780013
257900             ,  :SUT00025-PKD-BY-USR-ID                           25790013
258000             ,  :SUT00025-PKD-TMST                                25800013
258100             ,  :SUT00025-PKD-QTY                                 25810013
258200             ,  :SUT00025-MODU-NBR                                25820013
258300             )                                                    25830013
258400         END-EXEC                                                 25840013
258500                                                                  25850013
258600          WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_PK'               25860013
258700                                                                  25870013
258800                 EXEC SQL                                         25880013
258900                 INSERT INTO SUT_OTBND_PK                         25890013
259000              (                                                   25900013
259100                SHIPT_UNT_ID                                      25910013
259200             ,  TRN_NBR                                           25920013
259300             ,  RCVR_SEQ_NBR                                      25930013
259400             ,  TRN_TYP_CDE                                       25940013
259500             ,  PK_SKU_NBR                                        25950013
259600             ,  SHPD_PK_QTY                                       25960013
259700             )                                                    25970013
259800             VALUES                                               25980013
259900             (                                                    25990013
260000                :SUT00041-SHIPT-UNT-ID                            26000013
260100             ,  :SUT00041-TRN-NBR                                 26010013
260200             ,  :SUT00041-RCVR-SEQ-NBR                            26020013
260300             ,  :SUT00041-TRN-TYP-CDE                             26030013
260400             ,  :SUT00041-PK-SKU-NBR                              26040013
260500             ,  :SUT00041-SHPD-PK-QTY                             26050013
260600             )                                                    26060013
260700         END-EXEC                                                 26070013
260800                                                                  26080013
260900                                                                  26090013
261000         WHEN DS009-PROCESS-TABLE = 'SUT_FINCL_ADJ'               26100013
261100                                                                  26110013
261200                 EXEC SQL                                         26120013
261300                 INSERT INTO SUT_FINCL_ADJ                        26130013
261400                    ( FINCL_ADJ_ID                                26140013
261500                     ,ADJ_ERR_CDE                                 26150013
261600                     ,PO_NBR                                      26160013
261700                     ,RCVR_LNE_NBR                                26170013
261800                     ,RCVR_SEQ_NBR                                26180013
261900                     ,DEST_LOC_NBR                                26190013
262000                     ,CRE_TMST                                    26200013
262100                     ,UPC_NBR                                     26210013
262200                     ,SHIPT_UNT_ID                                26220013
262300                     ,PRC_RSN_CDE                                 26230013
262400                     ,AUD_CNTL_NBR                                26240013
262500                     ,ORGN_LOC_NBR                                26250013
262600                     ,AUD_ADJ_STAT_CDE                            26260013
262700                     ,AUTO_APL_IND                                26270013
262800                     ,CRE_BY_USR_ID                               26280013
262900                     ,CRE_PGM_NM                                  26290013
263000                     ,FINCL_BEF_QTY                               26300013
263100                     ,FINCL_AFT_QTY                               26310013
263200                     ,RSLV_BY_USR_ID                              26320013
263300                     ,RSLV_TMST                                   26330013
263400                     ,PROB_RSN_CDE                                26340013
263500                     ,ADJ_QTY                                     26350013
263600                     ,RSLV_CMNT_TXT                               26360013
263700                    )                                             26370013
263800             VALUES                                               26380013
263900             (                                                    26390013
264000                :DS008-SUT00030-DATA                              26400013
264100                :DS008-SUT00030-NULLS                             26410013
264200             )                                                    26420013
264300         END-EXEC                                                 26430013
264400                                                                  26440013
264500         WHEN DS009-PROCESS-TABLE = 'SUT_PO_AUD_REQ'              26450013
264600                                                                  26460013
264700             EXEC SQL                                             26470013
264800             INSERT INTO SUT_PO_AUD_REQ                           26480013
264900           (                                                      26490013
265000             PO_NBR                                               26500013
265100            ,PO_LNE_NBR                                           26510013
265200            ,PO_PREPK_ID                                          26520013
265300            ,OPER_UNT_ID                                          26530013
265400            ,INBND_TRIP_ID                                        26540013
265500            ,RCVR_SEQ_NBR                                         26550013
265600            ,AUD_CNTL_NBR                                         26560013
265700            ,CART_QTY                                             26570013
265800            ,UNT_QTY                                              26580013
265900            ,AUD_CART_QTY                                         26590013
266000            ,AUD_UNT_QTY                                          26600013
266100            ,AUD_STAT_CDE                                         26610013
266200            ,DFRD_AUD_IND                                         26620013
266300            ,AUD_ERR_PCT                                          26630013
266400            ,CRE_TMST                                             26640013
266500            ,CART_PRMPT_CDE                                       26650013
266600            ,VND_RNKG_CDE                                         26660013
266700            ,PKGNG_TYP_CDE                                        26670013
266800            ,EFF_BEG_TMST                                         26680013
266900            ,ENT_ID                                               26690013
267000            ,DEPT_NBR                                             26700013
267100            ,AUD_STAT_RSN_CDE                                     26710013
267200            ,MOD_QTY_IND                                          26720013
267300            ,RWRK_AUD_CNTL_NBR                                    26730013
267400                    )                                             26740013
267500             VALUES                                               26750013
267600             (                                                    26760013
267700                :DS008-SUT00015-DATA                              26770013
267800                :DS008-SUT00015-NULLS                             26780013
267900             )                                                    26790013
268000         END-EXEC                                                 26800013
268100                                                                  26810013
268200          WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_VND'              26820013
268300                                                                  26830013
268400                 EXEC SQL                                         26840013
268500                 INSERT INTO SUT_OTBND_VND                        26850013
268600              (                                                   26860013
268700                SHIPT_UNT_ID                                      26870013
268800             ,  PO_NBR                                            26880013
268900             ,  PKSL_SEQ_NBR                                      26890013
269000             )                                                    26900013
269100             VALUES                                               26910013
269200             (                                                    26920013
269300              :SUT00026-SHIPT-UNT-ID                              26930013
269400           ,  :SUT00026-PO-NBR                                    26940013
269500           ,  :SUT00026-PKSL-SEQ-NBR                              26950013
269600             )                                                    26960013
269700         END-EXEC                                                 26970013
269800                                                                  26980013
269900          WHEN DS009-PROCESS-TABLE = 'TSUQADJ'                    26990013
270000                                                                  27000013
270100             EXEC SQL                                             27010013
270200                 INSERT INTO TSUQADJ                              27020013
270300              (                                                   27030013
270400               SHIPT_UNT_ID                                       27040013
270500             , UPC_NBR                                            27050013
270600             , ADJ_TMST                                           27060013
270700             , OPER_UNT_ID                                        27070013
270800             , ADJ_FUNC_CDE                                       27080013
270900             , ADJ_BEF_QTY                                        27090013
271000             , ADJ_AFT_QTY                                        27100013
271100             , PRC_RSN_CDE                                        27110013
271200             , ADJ_USR_ID                                         27120013
271300             , AUD_CNTL_NBR                                       27130013
271400*            , FINCL_ADJ_ID                                       27140013
271500             )                                                    27150013
271600             VALUES                                               27160013
271700             (                                                    27170013
271800               :SUQADJ-SHIPT-UNT-ID                               27180013
271900             , :SUQADJ-UPC-NBR                                    27190013
272000             , :SUQADJ-ADJ-TMST                                   27200013
272100             , :SUQADJ-OPER-UNT-ID                                27210013
272200             , :SUQADJ-ADJ-FUNC-CDE                               27220013
272300             , :SUQADJ-ADJ-BEF-QTY                                27230013
272400             , :SUQADJ-ADJ-AFT-QTY                                27240013
272500             , :SUQADJ-PRC-RSN-CDE                                27250013
272600             , :SUQADJ-ADJ-USR-ID                                 27260013
272700             , :SUQADJ-AUD-CNTL-NBR                               27270013
272800*            , :SUQADJ-FINCL-ADJ-ID                               27280013
272900             )                                                    27290013
273000         END-EXEC                                                 27300013
273100                                                                  27310013
273200          WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_UPC'              27320013
273300             EXEC SQL                                             27330013
273400             INSERT INTO SUT_OTBND_UPC                            27340013
273500         (                                                        27350013
273600             SHIPT_UNT_ID                                         27360013
273700            ,TRN_NBR                                              27370013
273800            ,RCVR_SEQ_NBR                                         27380013
273900            ,TRN_LNE_NBR                                          27390013
274000            ,TRN_TYP_CDE                                          27400013
274100            ,UPC_NBR                                              27410013
274200            ,SHPD_UNT_QTY                                         27420013
274300           )                                                      27430013
274400         VALUES                                                   27440013
274500           (                                                      27450013
274600             :SUT00028-SHIPT-UNT-ID                               27460013
274700           , :SUT00028-TRN-NBR                                    27470013
274800           , :SUT00028-RCVR-SEQ-NBR                               27480013
274900           , :SUT00028-TRN-LNE-NBR                                27490013
275000           , :SUT00028-TRN-TYP-CDE                                27500013
275100           , :SUT00028-UPC-NBR                                    27510013
275200           , :SUT00028-SHPD-UNT-QTY                               27520013
275300           )                                                      27530013
275400             END-EXEC                                             27540013
275500                                                                  27550013
275600                                                                  27560013
275700          WHEN DS009-PROCESS-TABLE = 'TSUOBTR'                    27570013
275800*            MOVE SUOBTR-OTBND-TRIP-ID TO PV-DISPLAY-NBR          27580013
275900*            DISPLAY 'TSUOBTR SHIPT-UNT-ID = '                    27590013
276000*                 PV-DISPLAY-NBR                                  27600013
276100             EXEC SQL                                             27610013
276200             INSERT INTO TSUOBTR                                  27620013
276300                  (                                               27630013
276400                   OTBND_TRIP_ID                                  27640013
276500                  ,ORGN_OPER_UNT_ID                               27650013
276600                  ,DEST_OPER_UNT_ID                               27660013
276700                  ,TRLR_SRL_NBR                                   27670013
276800                  ,BOL_ID                                         27680013
276900                  ,EST_ARRVL_TMST                                 27690013
277000                  ,TRIP_ACTV_CDE                                  27700013
277100                  ,DOOR_TYP_CDE                                   27710013
277200                 )                                                27720013
277300             VALUES                                               27730013
277400                 (                                                27740013
277500                   :SUOBTR-OTBND-TRIP-ID                          27750013
277600                 , :SUOBTR-ORGN-OPER-UNT-ID                       27760013
277700                 , :SUOBTR-DEST-OPER-UNT-ID                       27770013
277800                 , :SUOBTR-TRLR-SRL-NBR                           27780013
277900                 , :SUOBTR-BOL-ID                                 27790013
278000                 , :SUOBTR-EST-ARRVL-TMST                         27800013
278100                 , :SUOBTR-TRIP-ACTV-CDE                          27810013
278200                 , :SUOBTR-DOOR-TYP-CDE                           27820013
278300                 )                                                27830013
278400         END-EXEC                                                 27840013
278500         IF SQLCODE = -803                                        27850013
278600*            MOVE ZERO                TO SQLCODE                  27860013
278700             PERFORM 7000-UPDATE-TSUOBTR                          27870013
278800         END-IF                                                   27880013
278900                                                                  27890013
279000          WHEN DS009-PROCESS-TABLE = 'XLT_SKU'                    27900013
279100             EXEC SQL                                             27910013
279200             INSERT INTO XLT_SKU                                  27920013
279300                  (                                               27930013
279400                 INTR_UPC_ID                                      27940013
279500                ,STYL_ID                                          27950013
279600                ,ITM_NBR                                          27960013
279700                ,SKU_NBR                                          27970013
279800                ,SKU_STAT_CDE                                     27980013
279900                ,SKU_STAT_DESC                                    27990013
280000                ,INNR_PK_QTY                                      28000013
280100                ,OUTR_PK_QTY                                      28010013
280200                ,SKU_DESC                                         28020013
280300                ,KOHLS_SIZE_CDE                                   28030013
280400                ,SIZE_DESC                                        28040013
280500                ,NRF_CLOR_CDE                                     28050013
280600                ,SHRT_CLOR_DESC                                   28060013
280700                ,CSTM_CLOR_DESC                                   28070013
280800                ,REGN_PRIC_IND                                    28080013
280900                ,KY_ITM_IND                                       28090013
281000                ,GP_CDE                                           28100013
281100                ,WHSE_RPLNT_IND                                   28110013
281200             )                                                    28120013
281300         VALUES                                                   28130013
281400             (                                                    28140013
281500             :XLT00003-INTR-UPC-ID                                28150013
281600         ,   :XLT00003-STYL-ID                                    28160013
281700         ,   :XLT00003-ITM-NBR                                    28170013
281800         ,   :XLT00003-SKU-NBR                                    28180013
281900         ,   :XLT00003-SKU-STAT-CDE                               28190013
282000         ,   :XLT00003-SKU-STAT-DESC                              28200013
282100         ,   :XLT00003-INNR-PK-QTY                                28210013
282200         ,   :XLT00003-OUTR-PK-QTY                                28220013
282300         ,   :XLT00003-SKU-DESC                                   28230013
282400         ,   :XLT00003-KOHLS-SIZE-CDE                             28240013
282500         ,   :XLT00003-SIZE-DESC                                  28250013
282600         ,   :XLT00003-NRF-CLOR-CDE                               28260013
282700         ,   :XLT00003-SHRT-CLOR-DESC                             28270013
282800         ,   :XLT00003-CSTM-CLOR-DESC                             28280013
282900         ,   :XLT00003-REGN-PRIC-IND                              28290013
283000         ,   :XLT00003-KY-ITM-IND                                 28300013
283100         ,   :XLT00003-GP-CDE                                     28310013
283200         ,   :XLT00003-WHSE-RPLNT-IND                             28320013
283300         )                                                        28330013
283400         END-EXEC                                                 28340013
283500                                                                  28350013
283600          WHEN DS009-PROCESS-TABLE = 'XLT_VND_STYL'               28360013
283700*CLP 08/04/2105                                                   28370013
283800****CLP FIRST CHECK IF BRND-ID IS ON THE XLT-BRND TABLE           28380013
283900             PERFORM 7100-CHECK-BRAND-FIRST                       28390013
284000             EXEC SQL                                             28400013
284100             INSERT INTO XLT_VND_STYL                             28410013
284200             (                                                    28420013
284300                STYL_ID                                           28430013
284400               ,DEPT_NBR                                          28440013
284500               ,MAJ_CL_NBR                                        28450013
284600               ,SUB_CL_NBR                                        28460013
284700               ,VS_ID                                             28470013
284800               ,VS_NBR                                            28480013
284900               ,ENT_ID                                            28490013
285000               ,STKR_NBR                                          28500013
285100               ,TKT_TYP_DESC                                      28510013
285200               ,HNG_FOLD_DESC                                     28520013
285300***CLP 08/04/2015 ADD BRND_ID WHEN COLUMN ADDED IN PROD           28530013
285400***CLP 08/04/2015 BUT BEFORE MAKE SURE BRAND IS ON XLT_BRND       28540013
285500               ,BRND_ID                                           28550013
285600                  )                                               28560013
285700         VALUES                                                   28570013
285800             (                                                    28580013
285900               :XLT00004-STYL-ID                                  28590013
286000           ,   :XLT00004-DEPT-NBR                                 28600013
286100           ,   :XLT00004-MAJ-CL-NBR                               28610013
286200           ,   :XLT00004-SUB-CL-NBR                               28620013
286300           ,   :XLT00004-VS-ID                                    28630013
286400           ,   :XLT00004-VS-NBR                                   28640013
286500           ,   :XLT00004-ENT-ID                                   28650013
286600           ,   :XLT00004-STKR-NBR                                 28660013
286700           ,   :XLT00004-TKT-TYP-DESC                             28670013
286800           ,   :XLT00004-HNG-FOLD-DESC                            28680013
286900***CLP 08/04/2015 ADD BRND_ID WHEN COLUMN ADDED IN PROD           28690013
287000           ,   :XLT00004-BRND-ID                                  28700013
287100         )                                                        28710013
287200         END-EXEC                                                 28720013
287300                                                                  28730013
287400          WHEN DS009-PROCESS-TABLE = 'XLT_UPC'                    28740013
287500             EXEC SQL                                             28750013
287600             INSERT INTO XLT_UPC                                  28760013
287700             (                                                    28770013
287800               UPC_ID                                             28780013
287900              ,INTR_UPC_ID                                        28790013
288000              ,UPC_TYP_CDE                                        28800013
288100              ,EDI_ORD_IND                                        28810013
288200              ,CERTD_IND                                          28820013
288300              ,CERTD_DTE                                          28830013
288400              ,UPC_NBR                                            28840013
288500             )                                                    28850013
288600         VALUES                                                   28860013
288700             (                                                    28870013
288800               :XLT00006-UPC-ID                                   28880013
288900           ,   :XLT00006-INTR-UPC-ID                              28890013
289000           ,   :XLT00006-UPC-TYP-CDE                              28900013
289100           ,   :XLT00006-EDI-ORD-IND                              28910013
289200           ,   :XLT00006-CERTD-IND                                28920013
289300           ,   :XLT00006-CERTD-DTE                                28930013
289400           ,   :XLT00006-UPC-NBR                                  28940013
289500         )                                                        28950013
289600         END-EXEC                                                 28960013
289700                                                                  28970013
289800          WHEN DS009-PROCESS-TABLE = 'XLT_PK'                     28980013
289900             EXEC SQL                                             28990013
290000             INSERT INTO XLT_PK                                   29000013
290100             (                                                    29010013
290200                   PK_SKU_NBR                                     29020013
290300                  ,PK_DESC                                        29030013
290400                  ,DEPT_NBR                                       29040013
290500                  ,MAJ_CL_NBR                                     29050013
290600                  ,SUB_CL_NBR                                     29060013
290700                  ,DC_ORD_MULT_QTY                                29070013
290800                  ,LAST_UPD_TMST                                  29080013
290900             )                                                    29090013
291000         VALUES                                                   29100013
291100             (                                                    29110013
291200           :XLT00007-PK-SKU-NBR                                   29120013
291300         , :XLT00007-PK-DESC                                      29130013
291400         , :XLT00007-DEPT-NBR                                     29140013
291500         , :XLT00007-MAJ-CL-NBR                                   29150013
291600         , :XLT00007-SUB-CL-NBR                                   29160013
291700         , :XLT00007-DC-ORD-MULT-QTY                              29170013
291800         , :XLT00007-LAST-UPD-TMST                                29180013
291900         )                                                        29190013
292000         END-EXEC                                                 29200013
292100*        DISPLAY 'XLT_PK SQLCODE= ' SQLCODE                       29210041
292200                                                                  29220013
292300          WHEN DS009-PROCESS-TABLE = 'XLT_PK_UPC'                 29230013
292400             EXEC SQL                                             29240013
292500             INSERT INTO XLT_PK_UPC                               29250013
292600             (                                                    29260013
292700                   PK_SKU_NBR                                     29270013
292800                  ,UPC_NBR                                        29280013
292900                  ,EDI_ORD_IND                                    29290013
293000                  ,LAST_UPD_TMST                                  29300013
293100             )                                                    29310013
293200         VALUES                                                   29320013
293300             (                                                    29330013
293400           :XLT00009-PK-SKU-NBR                                   29340013
293500         , :XLT00009-UPC-NBR                                      29350013
293600         , :XLT00009-EDI-ORD-IND                                  29360013
293700         , :XLT00009-LAST-UPD-TMST                                29370013
293800         )                                                        29380013
293900         END-EXEC                                                 29390013
294000                                                                  29400013
294100*        DISPLAY 'XLT_PK_UPC SQLCODE= ' SQLCODE                   29410041
294200          WHEN DS009-PROCESS-TABLE = 'XLT_PK_CPT_SKU'             29420013
294300             EXEC SQL                                             29430013
294400             INSERT INTO XLT_PK_CPT_SKU                           29440013
294500             (                                                    29450013
294600                   PK_SKU_NBR                                     29460013
294700                  ,CPT_SKU_NBR                                    29470013
294800                  ,PK_RATIO_UNT_QTY                               29480013
294900                  ,LAST_UPD_TMST                                  29490013
295000             )                                                    29500013
295100         VALUES                                                   29510013
295200             (                                                    29520013
295300           :XLT00008-PK-SKU-NBR                                   29530013
295400         , :XLT00008-CPT-SKU-NBR                                  29540013
295500         , :XLT00008-PK-RATIO-UNT-QTY                             29550013
295600         , :XLT00008-LAST-UPD-TMST                                29560013
295700         )                                                        29570013
295800         END-EXEC                                                 29580013
295900                                                                  29590013
296000*        DISPLAY 'XLT_PK_CPT_SKU SQLCODE= ' SQLCODE               29600041
296100                                                                  29610013
296200          WHEN DS009-PROCESS-TABLE = 'RCT_PO_RCVR_TRKG'           29620013
296300             EXEC SQL                                             29630013
296400             INSERT INTO RCT_PO_RCVR_TRKG                         29640013
296500             (                                                    29650013
296600             PO_NBR                                               29660013
296700            ,RCVR_SEQ_NBR                                         29670013
296800            ,CRE_BY_USR_ID                                        29680013
296900            ,CRE_TMST                                             29690013
297000            ,DC_FUNC_CDE                                          29700013
297100            ,LOC_NBR                                              29710013
297200            ,PO_LNE_NBR                                           29720013
297300            ,PREPK_ID                                             29730013
297400            ,CRE_BY_PGM_NM                                        29740013
297500            ,QTY_TRKD_NBR                                         29750013
297600            ,LAST_UPD_TMST                                        29760013
297700            ,PKSL_SEQ_NBR                                         29770013
297800            ,DEST_LOC_NBR                                         29780013
297900             )                                                    29790013
298000         VALUES                                                   29800013
298100             (                                                    29810013
298200               :RCT00017-PO-NBR                                   29820013
298300            ,  :RCT00017-RCVR-SEQ-NBR                             29830013
298400            ,  :RCT00017-CRE-BY-USR-ID                            29840013
298500            ,  :RCT00017-CRE-TMST                                 29850013
298600            ,  :RCT00017-DC-FUNC-CDE                              29860013
298700            ,  :RCT00017-LOC-NBR                                  29870013
298800            ,  :RCT00017-PO-LNE-NBR                               29880013
298900            ,  :RCT00017-PREPK-ID                                 29890013
299000            ,  :RCT00017-CRE-BY-PGM-NM                            29900013
299100            ,  :RCT00017-QTY-TRKD-NBR                             29910013
299200            ,  :RCT00017-LAST-UPD-TMST                            29920013
299300            ,  :RCT00017-PKSL-SEQ-NBR                             29930013
299400            ,  :RCT00017-DEST-LOC-NBR                             29940013
299500         )                                                        29950013
299600         END-EXEC                                                 29960013
299700                                                                  29970013
299800*        DISPLAY 'RCT_PO_RCVR_TRKG  SQLCODE= ' SQLCODE            29980013
299700                                                                  29980140
188300          WHEN DS009-PROCESS-TABLE = 'TTRDPRT'                    29981024
188400             EXEC SQL                                             29982024
188500                INSERT INTO TTRDPRT                               29983024
188600                  (                                               29984024
                         TP_DKEY                                        29985124
                        ,ENT_ID                                         29985224
                        ,VEND_INCHG_ID                                  29985324
                        ,VEND_INCHG_ID_DESC                             29985424
                        ,NETWK_ID                                       29985524
                        ,KOHL_INCHG_ID                                  29985624
                        ,KOHL_INCHG_ID_DESC                             29985724
                        ,SEND_FMT_VER_CDE                               29985824
                        ,SEND_FMT_NME                                   29985924
                        ,LAST_SEND_CNTL_NBR                             29986024
                        ,SEND_CNTL_NBR_CDE                              29986124
                        ,OVRRD_SND_CNTL_NBR                             29986224
                        ,OVRRD_SND_CNTL_ID                              29986324
                        ,RECV_FMT_VER_CDE                               29986424
                        ,RECV_FMT_NME                                   29986524
                        ,LAST_RECV_CNTL_NBR                             29986624
                        ,RECV_CNTL_NBR_CDE                              29986724
                        ,OVRRD_RCV_CNTL_NBR                             29986824
                        ,OVRRD_RCV_CNTL_ID                              29986924
                        ,SETUP_DTE                                      29987024
                        ,LAST_CHG_DTE                                   29987124
                        ,LAST_CHG_UID                                   29987224
                        ,ACTV_DTE                                       29987324
                        ,INACTV_DTE                                     29987424
                        ,SER_LVL_CDE                                    29987524
                        ,NOTES_TXT                                      29987624
                        ,LAST_CALL_DTE                                  29987724
                        ,NEXT_CALL_DTE                                  29987824
                        ,SEND_AUTH_INFO_ID                              29987924
                        ,SEND_AUTH_INF_DESC                             29988024
                        ,SEND_SEC_INFO_ID                               29988124
                        ,SEND_SEC_INFO_DESC                             29988224
                        ,SEND_DATA_ELEM_IND                             29988324
                        ,SEND_SEG_TERM_IND                              29988424
                        ,SEND_SUB_ELEM_IND                              29988524
                        ,SEND_ACK_REQD_IND                              29988624
                        ,INTRCONN_NETWK_IND                             29988724
                        ,FA_COM_MTHD_CDE                                29988824
189000                  )                                               29989124
189100              VALUES (                                            29989224
                         :WS-TRDPRT-TP-DKEY                             29989333
                        ,:WS-TRDPRT-ENT-ID                              29989433
                        ,:WS-TRDPRT-VEND-INCHG-ID                       29989533
                        ,:WS-TRDPRT-VEND-INCHG-ID-DESC                  29989633
                        ,:WS-TRDPRT-NETWK-ID                            29989733
                        ,:WS-TRDPRT-KOHL-INCHG-ID                       29989833
                        ,:WS-TRDPRT-KOHL-INCHG-ID-DESC                  29989933
                        ,:WS-TRDPRT-SEND-FMT-VER-CDE                    29990033
                        ,:WS-TRDPRT-SEND-FMT-NME                        29990133
                        ,:WS-TRDPRT-LAST-SEND-CNTL-NBR                  29990233
                        ,:WS-TRDPRT-SEND-CNTL-NBR-CDE                   29990333
                        ,:WS-TRDPRT-OVRRD-SND-CNTL-NBR                  29990433
                        ,:WS-TRDPRT-OVRRD-SND-CNTL-ID                   29990533
                        ,:WS-TRDPRT-RECV-FMT-VER-CDE                    29990633
                        ,:WS-TRDPRT-RECV-FMT-NME                        29990733
                        ,:WS-TRDPRT-LAST-RECV-CNTL-NBR                  29990833
                        ,:WS-TRDPRT-RECV-CNTL-NBR-CDE                   29990933
                        ,:WS-TRDPRT-OVRRD-RCV-CNTL-NBR                  29991033
                        ,:WS-TRDPRT-OVRRD-RCV-CNTL-ID                   29991133
                        ,:WS-TRDPRT-SETUP-DTE                           29991233
                        ,:WS-TRDPRT-LAST-CHG-DTE                        29991333
                        ,:WS-TRDPRT-LAST-CHG-UID                        29991433
                        ,:WS-TRDPRT-ACTV-DTE                            29991533
                        ,:WS-TRDPRT-INACTV-DTE                          29991633
                        ,:WS-TRDPRT-SER-LVL-CDE                         29991733
                        ,:WS-TRDPRT-NOTES-TXT                           29991833
                        ,:WS-TRDPRT-LAST-CALL-DTE                       29991933
                        ,:WS-TRDPRT-NEXT-CALL-DTE                       29992033
                        ,:WS-TRDPRT-SEND-AUTH-INFO-ID                   29992133
                        ,:WS-TRDPRT-SEND-AUTH-INF-DESC                  29992233
                        ,:WS-TRDPRT-SEND-SEC-INFO-ID                    29992333
                        ,:WS-TRDPRT-SEND-SEC-INFO-DESC                  29992433
                        ,:WS-TRDPRT-SEND-DATA-ELEM-IND                  29992533
                        ,:WS-TRDPRT-SEND-SEG-TERM-IND                   29992633
                        ,:WS-TRDPRT-SEND-SUB-ELEM-IND                   29992733
                        ,:WS-TRDPRT-SEND-ACK-REQD-IND                   29992833
                        ,:WS-TRDPRT-INTRCONN-NETWK-IND                  29992933
                        ,:WS-TRDPRT-FA-COM-MTHD-CDE                     29993033
189300                     )                                            29993224
189400             END-EXEC                                             29993324
188300          WHEN DS009-PROCESS-TABLE = 'TFGTRST'                    29993425
188400             EXEC SQL                                             29993625
188500                INSERT INTO TFGTRST                               29993725
188600                  (                                               29993825
                         TP_DKEY                                        29993925
                        ,TP_DKEY_TMST                                   29994032
                        ,FUNC_CDE_SEQ_NBR                               29994125
                        ,TRN_SET_SEQ_NBR                                29994225
                        ,TRN_SET_CDE                                    29994325
                        ,FUNC_CDE_CNTL_NBR                              29994425
                        ,VEND_ACK_IND                                   29994525
                        ,TRN_SET_CNTL_NBR                               29994625
                        ,TRN_DTL_TXT                                    29994725
                        ,CHARS_XMIT_NBR                                 29994825
                        ,RTE_IND                                        29994925
                        ,TRANSL_ERR_IND                                 29995025
                        ,TRN_RLSE_TMST                                  29995136
                        ,PO_ACKNL_STAT_CDE                              29995225
189000                  )                                               29997625
189100              VALUES (                                            29997725
                         :WS-FGTRST-TP-DKEY                             29997833
                        ,:WS-FGTRST-TP-DKEY-TMST                        29997933
                        ,:WS-FGTRST-FUNC-CDE-SEQ-NBR                    29998033
                        ,:WS-FGTRST-TRN-SET-SEQ-NBR                     29998133
                        ,:WS-FGTRST-TRN-SET-CDE                         29998233
                        ,:WS-FGTRST-FUNC-CDE-CNTL-NBR                   29998333
                        ,:WS-FGTRST-VEND-ACK-IND                        29998433
                        ,:WS-FGTRST-TRN-SET-CNTL-NBR                    29998533
                        ,:WS-FGTRST-TRN-DTL-TXT                         29998633
                        ,:WS-FGTRST-CHARS-XMIT-NBR                      29998733
                        ,:WS-FGTRST-RTE-IND                             29998833
                        ,:WS-FGTRST-TRANSL-ERR-IND                      29998933
                        ,:WS-FGTRST-TRN-RLSE-TMST:PV-NULL               29999036
                        ,:WS-FGTRST-PO-ACKNL-STAT-CDE                   29999133
189300                     )                                            30001625
189400             END-EXEC                                             30001725
188300          WHEN DS009-PROCESS-TABLE = 'TINTTRN'                    30001925
188400             EXEC SQL                                             30002025
188500                INSERT INTO TINTTRN                               30002125
188600                  (                                               30002225
                         TP_DKEY                                        30002325
                        ,TP_DKEY_TMST                                   30002425
                        ,DIR_IND                                        30002525
                        ,INCHG_CNTL_NBR                                 30002625
                        ,CRE_DTE                                        30002725
                        ,CRE_TME                                        30002825
                        ,MAILBOX_REC_DTE                                30002925
                        ,MAILBOX_REC_TME                                30003025
                        ,MAILBOX_PU_DTE                                 30003125
                        ,MAILBOX_PU_TME                                 30003225
                        ,ERR_IND                                        30003325
                        ,PROD_TEST_IND                                  30003425
                        ,TRANSL_SESS_ID                                 30003525
                        ,TRN_MANL_FRCD_IND                              30003625
189000                  )                                               30003725
189100              VALUES (                                            30003825
                         :WS-INTTRN-TP-DKEY                             30003933
                        ,:WS-INTTRN-TP-DKEY-TMST                        30004033
                        ,:WS-INTTRN-DIR-IND                             30004133
                        ,:WS-INTTRN-INCHG-CNTL-NBR                      30004233
                        ,:WS-INTTRN-CRE-DTE                             30004333
                        ,:WS-INTTRN-CRE-TME                             30004433
                        ,:WS-INTTRN-MAILBOX-REC-DTE                     30004533
                        ,:WS-INTTRN-MAILBOX-REC-TME                     30004633
                        ,:WS-INTTRN-MAILBOX-PU-DTE                      30004733
                        ,:WS-INTTRN-MAILBOX-PU-TME                      30004833
                        ,:WS-INTTRN-ERR-IND                             30004933
                        ,:WS-INTTRN-PROD-TEST-IND                       30005033
                        ,:WS-INTTRN-TRANSL-SESS-ID                      30005133
                        ,:WS-INTTRN-TRN-MANL-FRCD-IND                   30005233
189300                     )                                            30005325
189400             END-EXEC                                             30005425
299900     END-EVALUATE                                                 30005513
300000     END-PERFORM.                                                 30006013
300100                                                                  30010013
300200                                                                  30020013
300300     IF DS009-PROCESS-TABLE = 'XLT_SKU' OR                        30030013
300400                              'XLT_VND_STYL' OR                   30040013
300500                              'XLT_UPC' OR                        30050026
300500                              'TTRDPRT' OR                        30051035
300500                              'TFGTRST' OR                        30051135
300500                              'TINTTRN'                           30052026
300600         IF SQLCODE = -803                                        30060013
300700             CONTINUE                                             30070013
300800         ELSE                                                     30080013
300900             PERFORM DS002-SQL-ABEND-INSERT                       30090013
301000         END-IF                                                   30100013
301100     ELSE                                                         30110013
301200         PERFORM DS002-SQL-ABEND-INSERT                           30120013
301300     END-IF.                                                      30130013
301400                                                                  30140013
301500 1100-GET-DB2-INSTANCE.                                           30150013
301600                                                                  30160013
301700     MOVE '1100-GET-DB2-INSTANCE'                                 30170013
301800          TO DS009-PARAGRAPH.                                     30180013
301900     MOVE 'GET DB2 INSTANCE'                                      30190013
302000          TO DS009-OPERATION.                                     30200013
302100                                                                  30210013
302200     EXEC SQL                                                     30220013
302300         SELECT CURRENT SERVER INTO :WS-LOCAL-SERVER              30230013
302400             FROM SYSIBM.SYSDUMMY1 WITH UR                        30240013
302500     END-EXEC.                                                    30250013
302600                                                                  30260013
302700     EVALUATE TRUE                                                30270013
302800         WHEN SQLCODE = +0                                        30280013
302810             CONTINUE                                             30281013
302820         WHEN SQLWARN0 NOT = SPACES                               30282013
302830         WHEN SQLCODE < +0                                        30283013
302840         WHEN SQLCODE > +0                                        30284013
302850             PERFORM DS002-SQL-ERROR                              30285013
302860     END-EVALUATE.                                                30286013
302870*                                                                 30287013
302880 1200-CHECK-IF-PRODUCTION.                                        30288013
302890                                                                  30289013
302900     MOVE '1200-CHECK-IF-PRODUCTION'                              30290013
302901          TO DS009-PARAGRAPH.                                     30290113
302902     MOVE 'SELECT PRDCHK TKRPRPM '                                30290213
302903          TO DS009-OPERATION.                                     30290313
302904                                                                  30290413
302905     EXEC SQL                                                     30290513
302906       SELECT FUNC_TXT                                            30290613
302907         INTO :KRPRPM-FUNC-TXT                                    30290713
302908       FROM   TKRPRPM                                             30290813
302909       WHERE  SYS_PRC_FUNC_CDE  = :PC-PRDCHK                      30290913
302910         AND  INTFC_SYS_CDE     = :PC-KHL                         30291013
302911         AND  LOC_ID            = :PC-90                          30291113
302912         AND  FUNC_TXT          = :PC-PARM-TEXT                   30291213
302913     END-EXEC                                                     30291313
302914                                                                  30291413
302915     EVALUATE TRUE                                                30291513
302916         WHEN SQLCODE = +0                                        30291613
302917             CONTINUE                                             30291713
302918         WHEN SQLCODE = +100                                      30291813
302919             DISPLAY '*******************************************'30291913
302920             DISPLAY '** ABEND - DO NOT RUN THIS DSKUT004 PROGRAM'30292013
302921             DISPLAY '** ABEND - AGAINST PRODUCTION'              30292113
302922             DISPLAY '** ABEND - THIS SHOULD ONLY EVER BE'        30292213
302923             DISPLAY '** ABEND - RUN AGAINST TEST DATA'           30292313
302924             DISPLAY '*******************************************'30292413
302925             DISPLAY '** ABEND - THIS RUN IS GOING AGAINST'       30292513
302926             DISPLAY '** ABEND - DB2 INSTANCE:  '                 30292613
302927                     WS-LOCAL-SERVER                              30292713
302928             DISPLAY '*******************************************'30292813
302929             PERFORM DS002-SQL-ERROR                              30292913
302930                                                                  30293013
302931         WHEN SQLWARN0 NOT = SPACES                               30293113
302932         WHEN SQLCODE < +0                                        30293213
302933         WHEN SQLCODE > +0                                        30293313
302934             PERFORM DS002-SQL-ERROR                              30293413
302935     END-EVALUATE.                                                30293513
302936                                                                  30293613
302937 7000-UPDATE-TSUOBTR.                                             30293713
302938     EXEC SQL                                                     30293813
302939         UPDATE TSUOBTR                                           30293913
302940             SET                                                  30294013
302950             ORGN_OPER_UNT_ID = :SUOBTR-ORGN-OPER-UNT-ID          30295013
302960            ,DEST_OPER_UNT_ID = :SUOBTR-DEST-OPER-UNT-ID          30296013
302970            ,TRLR_SRL_NBR = :SUOBTR-TRLR-SRL-NBR                  30297013
302980            ,BOL_ID = :SUOBTR-BOL-ID                              30298013
302990            ,EST_ARRVL_TMST = :SUOBTR-EST-ARRVL-TMST              30299013
303000            ,TRIP_ACTV_CDE = :SUOBTR-TRIP-ACTV-CDE                30300013
303100            ,DOOR_TYP_CDE = :SUOBTR-DOOR-TYP-CDE                  30310013
303200         WHERE                                                    30320013
303300             OTBND_TRIP_ID = :SUOBTR-OTBND-TRIP-ID                30330013
303400     END-EXEC.                                                    30340013
303500                                                                  30350013
303600     EVALUATE TRUE                                                30360013
303700         WHEN SQLCODE = ZERO                                      30370013
303800*            DISPLAY ' TSUOBTR UPDATED = '                        30380013
303900*                                 SUOBTR-OTBND-TRIP-ID            30390013
304000             CONTINUE                                             30400013
304100         WHEN SQLCODE = +100                                      30410013
304200             DISPLAY ' TSUOBTR NOT FOUND = '                      30420013
304300                                  SUOBTR-OTBND-TRIP-ID            30430013
304400         WHEN OTHER                                               30440013
304500             PERFORM DS002-SQL-ABEND-UPDATE                       30450013
304600     END-EVALUATE.                                                30460013
304700/                                                                 30470013
304800*CLP 08/04/2015 START                                             30480013
304900                                                                  30490013
305000 7100-CHECK-BRAND-FIRST.                                          30500013
305100                                                                  30510013
305200     EXEC SQL                                                     30520013
305300         SELECT BRND_ID                                           30530013
305400            INTO :XLT00043-BRND-ID                                30540013
305500          FROM  XLT_BRND                                          30550013
305600          WHERE BRND_ID            = :XLT00004-BRND-ID            30560013
305700     END-EXEC.                                                    30570013
305800                                                                  30580013
305900     EVALUATE TRUE                                                30590013
306000         WHEN SQLCODE = ZERO                                      30600013
306100             CONTINUE                                             30610013
306200         WHEN SQLCODE = +100                                      30620013
306300             PERFORM 7200-GET-BRAND-INFO                          30630013
306400         WHEN OTHER                                               30640013
306500             PERFORM DS002-SQL-ABEND-UPDATE                       30650013
306600     END-EVALUATE.                                                30660013
306700                                                                  30670013
306800 7200-GET-BRAND-INFO.                                             30680013
306900*    FIRST NEED TO GET THE DESCRIPTION AND THE TYPE CODE          30690013
307000                                                                  30700013
307100     EXEC SQL                                                     30710013
307200         SELECT DISTINCT(A.LBL_SEQ_NBR)                           30720013
307300              , B.CHARTC_VAL_DESC                                 30730013
307400              , C.LBL_TYP_CDE                                     30740013
307500            INTO :MDARVS-LBL-SEQ-NBR                              30750013
307600                ,:VSCHVL-CHARTC-VAL-DESC                          30760013
307700                ,:IMT00000-LBL-TYP-CDE                            30770013
307800          FROM  TMDARVS A                                         30780013
307900               ,TVSCHVL B                                         30790013
308000               ,IMT_LBL C                                         30800013
308100          WHERE A.LBL_SEQ_NBR      = C.LBL_SEQ_NBR                30810013
308200            AND A.LBL_SEQ_NBR      = B.CHARTC_SEQ_NBR             30820013
308300            AND A.LBL_SEQ_NBR      = :XLT00004-BRND-ID            30830013
308400            AND A.ACTV_IND         = 'Y'                          30840013
308500            AND B.STAT_CDE         = 'A'                          30850013
308600            AND B.CHARTC_CDE       = '3'                          30860013
308700     END-EXEC.                                                    30870013
308800                                                                  30880013
308900     EVALUATE TRUE                                                30890013
309000         WHEN SQLCODE = ZERO                                      30900013
309100             PERFORM 7300-INSERT-BRAND                            30910013
309200         WHEN SQLCODE = +100                                      30920013
309300             CONTINUE                                             30930013
309400         WHEN OTHER                                               30940013
309500             PERFORM DS002-SQL-ABEND-UPDATE                       30950013
309600     END-EVALUATE.                                                30960013
309700                                                                  30970013
309800 7300-INSERT-BRAND.                                               30980013
309900                                                                  30990013
310000     EXEC SQL                                                     31000013
310100           INSERT INTO XLT_BRND                                   31010013
310200           ( BRND_ID                                              31020013
310300            ,BRND_DESC                                            31030013
310400            ,BRND_TYP_CDE                                         31040013
310500            ,LAST_UPD_TMST )                                      31050013
310600            VALUES                                                31060013
310700           ( :XLT00043-BRND-ID                                    31070013
310800            ,:VSCHVL-CHARTC-VAL-DESC                              31080013
310900            ,:IMT00000-LBL-TYP-CDE                                31090013
311000            ,CURRENT TIMESTAMP )                                  31100013
311100     END-EXEC.                                                    31110013
311200                                                                  31120013
311300     EVALUATE TRUE                                                31130013
311400         WHEN SQLCODE = ZERO                                      31140013
311500*            DISPLAY ' XLT_BRND INSERT = '                        31150041
311600*                                 XLT00043-BRND-ID                31160041
311700             CONTINUE                                             31170013
311800         WHEN SQLCODE = +100                                      31180013
311900             DISPLAY ' XLT_BRND NOT FOUND = '                     31190013
312000                                  XLT00043-BRND-ID                31200013
312100         WHEN OTHER                                               31210013
312200             PERFORM DS002-SQL-ABEND-UPDATE                       31220013
312300     END-EVALUATE.                                                31230013
312400*CLP 08/04/2015 END                                               31240013
312500                                                                  31250013
312600                                                                  31260013
312700 9000-DUMP-COUNT-TABLE.                                           31270013
312800                                                                  31280013
312900     DISPLAY '  ****  INSERT TOTALS  ****'                        31290013
313000                                                                  31300013
313100     PERFORM VARYING CNTL-I FROM 1 BY 1 UNTIL                     31310013
313200           CNTL-I > CNTL-SUB-MAX OR CNTL-I > 200                  31320013
313300         IF CNTL-TABLE(CNTL-I) NOT = SPACES                       31330013
313400             IF DS009-GROUP-NBR(CNTL-I) = '1'                     31340013
313500                 MOVE DS009-READ-COUNT (CNTL-I) TO DS009-DISP-NBR 31350013
313600                 DISPLAY 'TABLE = ' CNTL-TABLE(CNTL-I)            31360013
313700                            DS009-DISP-NBR                        31370013
313800                 ADD DS009-READ-COUNT (CNTL-I) TO PV-TOTAL-COUNT  31380013
313900             END-IF                                               31390013
314000         END-IF                                                   31400013
314100     END-PERFORM.                                                 31410013
314200                                                                  31420013
314300     MOVE PV-TOTAL-COUNT            TO DS009-DISP-NBR             31430013
314400     DISPLAY SPACES.                                              31440013
314500     DISPLAY '**  TOTAL INSERTS = ' DS009-DISP-NBR.               31450013
314600***************************************************************** 31460013
314700*     PRODUCTION - TO - TEST STANDARD PARAGRAPHS                * 31470013
314800***************************************************************** 31480013
314900     COPY DSPD002.                                                31490013
