000100*************************************************************             
000200*    DSPD02Q COMMON PARAGRAPHS FOR PROD-TO-QA   UTILITIES   *             
000300*************************************************************             
000400*                                                                         
000500*          GET DATE, TIME, OPEN FILES, SET UP CONTROLS, ETC *             
000600*                                                                         
000700 DS002-INITIAL-PROCESSING.                                                
000800     EXEC SQL                                                             
000900         SELECT                                                           
001000             CHAR ( CURRENT DATE,USA)                                     
001100         ,   CHAR ( CURRENT TIME,JIS)                                     
001200         INTO                                                             
001300            :DS009-DATE-IN                                                
001400         ,  :DS009-TIME-IN                                                
001500         FROM                                                             
001600             SYSIBM.SYSDUMMY1                                             
001700         END-EXEC                                                         
001800                                                                          
001900*     ACCEPT DS009-JULIAN-DATE FROM DAY.                                  
002000      IF DS009-S-PGM                                                      
002100          OPEN  INPUT  PO-NBR-FILE                                        
002200                OUTPUT TBLE-FILE                                          
002300                INPUT  CONTROL-FILE                                       
002400      END-IF.                                                             
002500      IF DS009-I-PGM OR DS009-D-PGM                                       
002600          OPEN  INPUT  PO-NBR-FILE                                        
002700                INPUT  TBLE-FILE                                          
002800                INPUT  CONTROL-FILE                                       
002900      END-IF.                                                             
003000                                                                          
003100     INITIALIZE DS009-PO-NBRS-TO-EXTRACT                                  
003200     READ PO-NBR-FILE INTO DS009-PO-NBR-REC                               
003300     AT END                                                               
003400          SET DS009-PO-NBR-EOF TO TRUE                                    
003500     END-READ.                                                            
003600                                                                          
003700     MOVE 1                   TO DS009-PO-SUB                             
003800      PERFORM WITH TEST AFTER                                             
003900*        VARYING DS009-PO-SUB FROM 1 BY 1                                 
004000         UNTIL  DS009-PO-SUB > DS009-PO-SUB-LIMIT                         
004100            OR  DS009-PO-NBR-EOF                                          
004200                 IF PO-NBR-IN NUMERIC                                     
004300                     MOVE PO-NBR-IN TO DS009-PO-NBR (DS009-PO-SUB)        
004400                                       DS009-DISP-PO                      
004500                     MOVE DS009-PO-SUB TO DS009-PO-SUB-MAX                
004600                     DISPLAY 'PO = ' DS009-DISP-PO                        
004700                     ADD 1    TO DS009-PO-SUB                             
004800                 END-IF                                                   
004900                 READ PO-NBR-FILE INTO DS009-PO-NBR-REC                   
005000                     AT END SET DS009-PO-NBR-EOF TO TRUE                  
005100                 END-READ                                                 
005200      END-PERFORM.                                                        
005300                                                                          
005400*     BUILD DS009 WORKING STORAGE TABLE                                   
005500      SET DS009-NOT-CNTL-EOF  TO TRUE.                                    
005600      MOVE +0                 TO CNTL-SUB-MAX.                            
005700      INITIALIZE DS009-CNTL-TABLE                                         
005800      READ CONTROL-FILE INTO DS009-CNTL-REC                               
005900          AT END SET DS009-CNTL-EOF TO TRUE.                              
006000      PERFORM WITH TEST AFTER                                             
006100         VARYING CNTL-I FROM 1 BY 1                                       
006200         UNTIL   CNTL-I > CNTL-SUB-LIMIT                                  
006300            OR   DS009-CNTL-EOF                                           
006400             IF DS009-CNTL-TABLE-IN NOT = SPACES AND                      
006500                     DS009-CNTL-TABLE-IN (1:1) NOT = '*'                  
006600                 ADD +1               TO CNTL-SUB-MAX                     
006700                 MOVE DS009-CNTL-TABLE-IN                                 
006800                                      TO CNTL-TABLE (CNTL-SUB-MAX)        
006900                 MOVE DS009-CNTL-INS-IN TO CNTL-INS (CNTL-SUB-MAX)        
007000                 MOVE DS009-CNTL-DEL-IN TO CNTL-DEL (CNTL-SUB-MAX)        
007100                 MOVE DS009-CNTL-SEL-IN TO CNTL-SEL (CNTL-SUB-MAX)        
007200                 MOVE DS009-CNTL-SEQ-IN                                   
007300                               TO DS009-CNTL-SEQ (CNTL-SUB-MAX)           
007400                 MOVE ZERO     TO DS009-READ-COUNT (CNTL-SUB-MAX)         
007500                                  DS009-WRITE-COUNT (CNTL-SUB-MAX)        
007600                 MOVE DS009-CNTL-GROUP-NBR TO                             
007700                                  DS009-GROUP-NBR (CNTL-SUB-MAX)          
007800             END-IF                                                       
007900                                                                          
008000             READ CONTROL-FILE INTO DS009-CNTL-REC                        
008100                  AT END SET DS009-CNTL-EOF TO TRUE                       
008200             END-READ                                                     
008300      END-PERFORM.                                                        
008400                                                                          
008500     EXEC SQL                                                             
008600         SET :DS009-LAST-COMMIT-TIME =  CURRENT TIME                      
008700     END-EXEC                                                             
008800                                                                          
008900      DISPLAY                                                             
009000      'RUNDATE = ' DS009-DATE-IN ' RUNTIME = ' DS009-TIME-IN              
009100      DISPLAY 'NUMBER OF POS READ=' DS009-PO-SUB-MAX.                     
009200/                                                                         
009300*****************************************************************         
009400*     SHOULD THIS TABLE BE PROCESSED AND HOW?                             
009500*****************************************************************         
009600 DS002-DO-PROCESS.                                                        
009700      SET DS009-DO-NOT-PROCESS TO TRUE.                                   
009800      SET CNTL-I         TO +1.                                           
009900      SEARCH  DS009-CNTL-RECORDS                                          
010000       VARYING CNTL-I                                                     
010100       AT END                                                             
010200         SET DS009-BYPASS-TABLE TO TRUE                                   
010300       WHEN CNTL-TABLE (CNTL-I) = DS009-PROCESS-TABLE                     
010400         AND ((DS009-I-PGM AND (CNTL-INS (CNTL-I) = 'Y'))                 
010500         OR (DS009-D-PGM AND (CNTL-DEL (CNTL-I) = 'Y'))                   
010600         OR (DS009-S-PGM AND (CNTL-SEL (CNTL-I) = 'Y')))                  
010700             SET DS009-DO-PROCESS     TO TRUE                             
010800      END-SEARCH.                                                         
010900 EJECT                                                                    
011000*****************************************************************         
011100*     FINISH THE ERROR PROCESS, REPORT ON NECESSARY TOTALS,               
011200*     AND CLOSE ALL FILES                                                 
011300*****************************************************************         
011400 DS002-END-OF-JOB.                                                        
011500      CLOSE PO-NBR-FILE                                                   
011600            TBLE-FILE                                                     
011700            CONTROL-FILE.                                                 
011800                                                                          
011900     EXEC SQL                                                             
012000         SELECT                                                           
012100             CHAR ( CURRENT DATE,USA)                                     
012200         ,   CHAR ( CURRENT TIME,JIS)                                     
012300         INTO                                                             
012400            :DS009-DATE-IN                                                
012500         ,  :DS009-TIME-IN                                                
012600         FROM                                                             
012700             SYSIBM.SYSDUMMY1                                             
012800         END-EXEC                                                         
012900                                                                          
013000                                                                          
013100     DISPLAY '************************************************'.          
013200     DISPLAY                                                              
013300      'RUNDATE = ' DS009-DATE-IN ' RUNTIME = ' DS009-TIME-IN              
013400     DISPLAY '************************************************'.          
013500 EJECT                                                                    
013600*****************************************************************         
013700*     CHECK FOR DB2 ABENDS ON FETCH                                       
013800*****************************************************************         
013900 DS002-SQL-ABEND-FETCH.                                                   
014000      IF (DS009-RETRY-COUNTER > 3                                         
014100        OR (SQLWARN0 NOT = SPACES                                         
014200          OR SQLCODE  NOT = ZERO))                                        
014300         AND SQLCODE NOT = +100                                           
014400           MOVE 'FETCH'  TO DS009-PARAGRAPH                               
014500           IF DS009-RETRY-COUNTER > 3                                     
014600              MOVE 'MAX RETRIES EXCEEDED ON FETCH'                        
014700                           TO DS009-OPERATION                             
014800           ELSE                                                           
014900              MOVE 'UNSUCCESSFUL FETCH'                                   
015000                           TO DS009-OPERATION                             
015100           END-IF                                                         
015200           MOVE DS009-PROCESS-TABLE                                       
015300                           TO DS009-STRUCTURE-1                           
015400           MOVE SPACES                                                    
015500                           TO DS009-STRUCTURE-2                           
015600                              DS009-STRUCTURE-3                           
015700           PERFORM DS002-SQL-ERROR                                        
015800      END-IF.                                                             
015900 EJECT                                                                    
016000*****************************************************************         
016100*     CHECK FOR DB2 ABENDS ON OPEN CURSOR                                 
016200*****************************************************************         
016300 DS002-SQL-ABEND-OPEN-CSR.                                                
016400      IF (DS009-RETRY-COUNTER > 3                                         
016500        OR SQLCODE  NOT = ZERO)                                           
016600          MOVE 'OPEN-CSR' TO DS009-PARAGRAPH                              
016700          IF DS009-RETRY-COUNTER > 3                                      
016800             MOVE 'MAX RETRIES EXCEEDED ON OPEN-CSR'                      
016900                          TO DS009-OPERATION                              
017000          ELSE                                                            
017100             MOVE 'UNSUCCESSFUL OPEN-CSR'                                 
017200                          TO DS009-OPERATION                              
017300          END-IF                                                          
017400          MOVE DS009-PROCESS-TABLE                                        
017500                          TO DS009-STRUCTURE-1                            
017600          MOVE SPACES                                                     
017700                          TO DS009-STRUCTURE-2                            
017800                             DS009-STRUCTURE-3                            
017900          PERFORM DS002-SQL-ERROR                                         
018000      END-IF.                                                             
018100 EJECT                                                                    
018200*****************************************************************         
018300*     CHECK FOR DB2 ABENDS ON CLOSE CURSOR                                
018400*****************************************************************         
018500 DS002-SQL-ABEND-CLOSE-CSR.                                               
018600      IF (DS009-RETRY-COUNTER > 3                                         
018700        OR (SQLWARN0 NOT = SPACES                                         
018800          OR SQLCODE  NOT = ZERO))                                        
018900         AND SQLCODE NOT = +100                                           
019000          MOVE 'CLOSE-CSR' TO DS009-PARAGRAPH                             
019100          IF DS009-RETRY-COUNTER > 3                                      
019200             MOVE 'MAX RETRIES EXCEEDED ON CLOSE-CSR'                     
019300                                 TO DS009-OPERATION                       
019400          ELSE                                                            
019500             MOVE 'UNSUCCESSFUL CLOSE-CSR'                                
019600                                 TO DS009-OPERATION                       
019700          END-IF                                                          
019800          MOVE DS009-PROCESS-TABLE TO DS009-STRUCTURE-1                   
019900          MOVE SPACES            TO DS009-STRUCTURE-2                     
020000                                    DS009-STRUCTURE-3                     
020100          PERFORM DS002-SQL-ERROR                                         
020200      END-IF.                                                             
020300 EJECT                                                                    
020400*****************************************************************         
020500*     CHECK FOR DB2 ABENDS ON INSERT                                      
020600*****************************************************************         
020700 DS002-SQL-ABEND-INSERT.                                                  
020800      IF (DS009-RETRY-COUNTER > 3                                         
020900        OR (SQLWARN0 NOT = SPACES                                         
021000          OR SQLCODE  NOT = ZERO))                                        
021100         AND (SQLCODE = -911 OR -913 OR -904 OR -803)                     
021200*          DISPLAY 'PV-READ-COUNT = ' PV-READ-COUNT                       
021300           MOVE 'INSERT' TO DS009-PARAGRAPH                               
021400           IF DS009-RETRY-COUNTER > 3                                     
021500              MOVE 'MAX RETRIES EXCEEDED ON INSERT'                       
021600                           TO DS009-OPERATION                             
021700           ELSE                                                           
021800*            PERFORM 9000-DUMP-COUNT-TABLE                                
021900              MOVE 'UNSUCCESSFUL INSERT'                                  
022000                           TO DS009-OPERATION                             
022100           END-IF                                                         
022200           IF SQLCODE NOT = -803                                          
022300               MOVE DS009-PROCESS-TABLE                                   
022400                               TO DS009-STRUCTURE-1                       
022500               MOVE SPACES                                                
022600                               TO DS009-STRUCTURE-2                       
022700                                  DS009-STRUCTURE-3                       
022800               PERFORM DS002-SQL-ERROR                                    
022900                                                                          
023000           ELSE                                                           
023100             DISPLAY SPACES                                               
023200             DISPLAY 'INSERT FAILED FOR TABLE = '                         
023300                              DS009-PROCESS-TABLE                         
023400             CALL 'DSNTIAR' USING SQLCA                                   
023500                              DP004-FORMATTED-MESSAGE                     
023600                              DP004-ERROR-LINE-LENGTH                     
023700                                                                          
023800             PERFORM                                                      
023900                 VARYING DP004-MSG-IDX                                    
024000                 FROM 1 BY 1                                              
024100                 UNTIL DP004-MSG-IDX > 8                                  
024200                     DISPLAY DP004-MESSAGE-LINE (DP004-MSG-IDX)           
024300             END-PERFORM                                                  
024400           END-IF                                                         
024500      END-IF.                                                             
024600/                                                                         
024700 DS002-SQL-ABEND-UPDATE.                                                  
024800     MOVE 'UPDATE' TO DS009-PARAGRAPH                                     
024900     MOVE 'UNSUCCESSFUL UPDATE'    TO DS009-OPERATION                     
025000                                                                          
025100     DISPLAY SPACES                                                       
025200     DISPLAY 'UPDATE FAILED FOR TABLE = '                                 
025300                              DS009-PROCESS-TABLE                         
025400     CALL 'DSNTIAR' USING SQLCA                                           
025500                              DP004-FORMATTED-MESSAGE                     
025600                              DP004-ERROR-LINE-LENGTH                     
025700                                                                          
025800     PERFORM VARYING DP004-MSG-IDX                                        
025900         FROM 1 BY 1                                                      
026000         UNTIL DP004-MSG-IDX > 8                                          
026100         DISPLAY DP004-MESSAGE-LINE (DP004-MSG-IDX)                       
026200     END-PERFORM.                                                         
026300/                                                                         
026400*****************************************************************         
026500*     CHECK FOR DB2 ABENDS ON DELETE                                      
026600*****************************************************************         
026700 DS002-SQL-ABEND-DELETE.                                                  
026800      IF (DS009-RETRY-COUNTER > 3                                         
026900        OR (SQLWARN0 NOT = SPACES                                         
027000          OR SQLCODE  NOT = ZERO))                                        
027100         AND SQLCODE NOT = +100                                           
027200         AND SQLCODE NOT = -532                                           
027300           MOVE 'DELETE' TO DS009-PARAGRAPH                               
027400           IF DS009-RETRY-COUNTER > 3                                     
027500              MOVE 'MAX RETRIES EXCEEDED ON DELETE'                       
027600                           TO DS009-OPERATION                             
027700           ELSE                                                           
027800              MOVE 'UNSUCCESSFUL DELETE'                                  
027900                           TO DS009-OPERATION                             
028000           END-IF                                                         
028100           MOVE DS009-PROCESS-TABLE                                       
028200                           TO DS009-STRUCTURE-1                           
028300           MOVE DS009-PKYS                                                
028400                           TO DS009-STRUCTURE-2                           
028500           MOVE SPACES     TO DS009-STRUCTURE-3                           
028600           PERFORM DS002-SQL-ERROR                                        
028700      END-IF.                                                             
028800                                                                          
028900*  DRS 1/19/2005 UNCOMMENTED TSUOBTR REFERENCE                            
029000      IF (SQLCODE = -532 OR -530)                                         
029100             AND (DS009-PROCESS-TABLE NOT = 'TSUOBTR')                    
029200         DISPLAY SPACES                                                   
029300         DISPLAY 'DELETE FAILED FOR TABLE = ' DS009-PROCESS-TABLE         
029400         CALL 'DSNTIAR' USING SQLCA                                       
029500                          DP004-FORMATTED-MESSAGE                         
029600                          DP004-ERROR-LINE-LENGTH                         
029700                                                                          
029800         PERFORM                                                          
029900             VARYING DP004-MSG-IDX                                        
030000             FROM 1 BY 1                                                  
030100*            UNTIL DP004-MSG-IDX > DP004-MAX-MESSAGE-LINES                
030200             UNTIL DP004-MSG-IDX > 8                                      
030300                 DISPLAY DP004-MESSAGE-LINE (DP004-MSG-IDX)               
030400         END-PERFORM                                                      
030500                                                                          
030600*        DISPLAY '*** CANNOT DELETE ROWS IN      ***'                     
030700*        DISPLAY '*** TABLE: ' DS009-PROCESS-TABLE '  ***'                
030800*        DISPLAY '*** DUE TO A TABLE             ***'                     
030900*        DISPLAY '*** RELATIONSHIP PROBLEM       ***'                     
031000*        DISPLAY '*** REFER TO SYSIBM.SYSRELS    ***'                     
031100*        DISPLAY '*** FOR MORE INFORMATION       ***'                     
031200      END-IF.                                                             
031300 EJECT                                                                    
031400*****************************************************************         
031500*     CHECK FOR DB2 COMMIT ABEND                                          
031600*****************************************************************         
031700 DS002-SQL-ABEND-COMMIT.                                                  
031800      IF SQLWARN0 NOT = SPACES                                            
031900        OR SQLCODE  NOT = ZERO                                            
032000          MOVE 'UNSUCCESSFUL COMMIT'                                      
032100                          TO DS009-OPERATION                              
032200          MOVE DS009-PROCESS-TABLE                                        
032300                          TO DS009-STRUCTURE-1                            
032400          MOVE SPACES                                                     
032500                          TO DS009-STRUCTURE-2                            
032600                             DS009-STRUCTURE-3                            
032700          PERFORM DS002-SQL-ERROR                                         
032800      END-IF.                                                             
032900 EJECT                                                                    
033000*****************************************************************         
033100*     PROCESS DB2 ABENDS                                                  
033200*****************************************************************         
033300 DS002-SQL-ERROR.                                                         
033400*                                                                         
033500      DISPLAY '*** DB2 ERROR '.                                           
033600      DISPLAY '*** PARAGRAPH = ' DS009-PARAGRAPH.                         
033700      DISPLAY '*** OPERATION = ' DS009-OPERATION.                         
033800      DISPLAY '*** TABLE 1   = ' DS009-STRUCTURE-1.                       
033900      IF DS009-STRUCTURE-2 > SPACES                                       
034000          DISPLAY '*** TABLE 2   = ' DS009-STRUCTURE-2.                   
034100      IF DS009-STRUCTURE-3 > SPACES                                       
034200          DISPLAY '*** TABLE 3   = ' DS009-STRUCTURE-3.                   
034300                                                                          
034400      MOVE +4013                    TO DS009-ABEND-CODE.                  
034500                                                                          
034600     COPY DPPD004.                                                        
034700      CALL 'ILBOABN0' USING DS009-ABEND-CODE.                             
034800*****************************************************************         
034900*     PROCESS OTHER ABENDS                                                
035000*****************************************************************         
035100 DS002-OTHER-ERRORS.                                                      
035200*                                                                         
035300      DISPLAY '*** PGM ERROR '.                                           
035400      DISPLAY '*** PROGRAM   = ' DS009-PROGRAM.                           
035500      DISPLAY '*** PARAGRAPH = ' DS009-PARAGRAPH.                         
035600      DISPLAY '*** OPERATION = ' DS009-OPERATION.                         
035700      DISPLAY '*** ERROR 1   = ' DS009-STRUCTURE-1.                       
035800                                                                          
035900      DISPLAY '*** CURRENT RECORD  = ' DS009-TUPDATE-COUNT.               
036000                                                                          
036100      IF DS009-STRUCTURE-2 > SPACES                                       
036200          DISPLAY '*** ERROR 2   = ' DS009-STRUCTURE-2.                   
036300      IF DS009-STRUCTURE-3 > SPACES                                       
036400          DISPLAY '*** ERROR 3   = ' DS009-STRUCTURE-3.                   
036500                                                                          
036600      MOVE +4013                    TO DS009-ABEND-CODE.                  
036700                                                                          
036800     COPY DPPD004.                                                        
036900      CALL 'ILBOABN0' USING DS009-ABEND-CODE.                             
037000/                                                                         
037100 DS002-COMMIT.                                                            
037200                                                                          
037300     EXEC SQL                                                             
037400         SELECT                                                           
037500             CURRENT TIME - :DS009-LAST-COMMIT-TIME                       
037600         INTO                                                             
037700             :DS009-ELAPSED-TIME                                          
037800         FROM SYSIBM.SYSDUMMY1                                            
037900     END-EXEC.                                                            
038000                                                                          
038100     IF DS009-ELAPSED-TIME > 5                                            
038200         EXEC SQL                                                         
038300             COMMIT                                                       
038400         END-EXEC                                                         
038500         EXEC SQL                                                         
038600             SET :DS009-LAST-COMMIT-TIME = CURRENT TIME                   
038700         END-EXEC                                                         
038800     END-IF.                                                              
038900*****************************************************************         
039000*     PROCESS KEYS                                                        
039100*****************************************************************         
039200 DS002-PROCESS-KEYS.                                                      
039300*                                                                         
039400      EVALUATE TRUE                                                       
039500         WHEN DS009-PROCESS-TABLE = 'TPURCHS'                             
039600         MOVE WS-PURCHS-PO-NBR           TO                               
039700              DS-PURCHS-PO-NBR                                            
039800         MOVE WS-PURCHS-VER-NBR          TO                               
039900              DS-PURCHS-VER-NBR                                           
040000                                                                          
040100         WHEN DS009-PROCESS-TABLE = 'TPURITM'                             
040200         MOVE WS-PURITM-PO-NBR           TO                               
040300              DS-PURITM-PO-NBR                                            
040400         MOVE WS-PURITM-VER-NBR          TO                               
040500              DS-PURITM-VER-NBR                                           
040600         MOVE WS-PURITM-PO-LNE-NBR       TO                               
040700              DS-PURITM-PO-LNE-NBR                                        
040800                                                                          
040900         WHEN DS009-PROCESS-TABLE = 'TPOAGMT'                             
041000         MOVE WS-POAGMT-PO-NBR           TO                               
041100              DS-POAGMT-PO-NBR                                            
041200         MOVE WS-POAGMT-VER-NBR          TO                               
041300              DS-POAGMT-VER-NBR                                           
041400         MOVE WS-POAGMT-AGRMT-TYP-ID     TO                               
041500              DS-POAGMT-AGRMT-TYP-ID                                      
041600         MOVE WS-POAGMT-SEQ-NBR          TO                               
041700              DS-POAGMT-SEQ-NBR                                           
041800                                                                          
041900         WHEN DS009-PROCESS-TABLE = 'TPOINST'                             
042000         MOVE WS-POINST-PO-NBR           TO                               
042100              DS-POINST-PO-NBR                                            
042200         MOVE WS-POINST-RECIP-CDE        TO                               
042300              DS-POINST-RECIP-CDE                                         
042400         MOVE WS-POINST-INSTR-NBR        TO                               
042500              DS-POINST-INSTR-NBR                                         
042600                                                                          
042700         WHEN DS009-PROCESS-TABLE = 'TIMPORL'                             
042800         MOVE WS-IMPORL-PO-NBR           TO                               
042900              DS-IMPORL-PO-NBR                                            
043000         MOVE WS-IMPORL-VER-NBR          TO                               
043100              DS-IMPORL-VER-NBR                                           
043200                                                                          
043300         WHEN DS009-PROCESS-TABLE = 'TALLPLN'                             
043400         MOVE WS-ALLPLN-PO-NBR           TO                               
043500              DS-ALLPLN-PO-NBR                                            
043600         MOVE WS-ALLPLN-PO-LNE-NBR       TO                               
043700              DS-ALLPLN-PO-LNE-NBR                                        
043800         MOVE WS-ALLPLN-PLAN-NBR         TO                               
043900              DS-ALLPLN-PLAN-NBR                                          
044000                                                                          
044100         WHEN DS009-PROCESS-TABLE = 'TPLNSHP'                             
044200         MOVE WS-PLNSHP-SHIPT-NBR        TO                               
044300              DS-PLNSHP-SHIPT-NBR                                         
044400         MOVE WS-PLNSHP-VER-NBR          TO                               
044500              DS-PLNSHP-VER-NBR                                           
044600                                                                          
044700         WHEN DS009-PROCESS-TABLE = 'TSK'                                 
044800         MOVE WS-TSK-ITEM-NMBR           TO                               
044900              DS-TSK-ITEM-NMBR                                            
045000                                                                          
045100         WHEN DS009-PROCESS-TABLE = 'TSKST'                               
045200         MOVE WS-SKST-ITEM-NMBR          TO                               
045300              DS-SKST-ITEM-NMBR                                           
045400         MOVE WS-SKST-LOC-NBR            TO                               
045500              DS-SKST-LOC-NBR                                             
045600                                                                          
045700         WHEN DS009-PROCESS-TABLE = 'TPPCPRC'                             
045800         MOVE WS-PPCPRC-TSK-ITM-NBR      TO                               
045900              DS-PPCPRC-TSK-ITM-NBR                                       
046000         MOVE WS-PPCPRC-STR-NBR          TO                               
046100              DS-PPCPRC-STR-NBR                                           
046200         MOVE WS-PPCPRC-STRT-TMST        TO                               
046300              DS-PPCPRC-STRT-TMST                                         
046400                                                                          
046500         WHEN DS009-PROCESS-TABLE = 'TUPC'                                
046600         MOVE WS-UPC-UPC-ID              TO                               
046700              DS-UPC-UPC-ID                                               
046800                                                                          
046900         WHEN DS009-PROCESS-TABLE = 'TUPCSKU'                             
047000         MOVE WS-TUPCSKU-UPC-NBR         TO                               
047100              DS-TUPCSKU-UPC-NBR                                          
047200                                                                          
047300         WHEN DS009-PROCESS-TABLE = 'TUPCPLS'                             
047400         MOVE WS-UPCPLS-UPC-ID          TO                                
047500              DS-UPCPLS-UPC-ID                                            
047600         MOVE WS-UPCPLS-OPERCO-NBR      TO                                
047700              DS-UPCPLS-OPERCO-NBR                                        
047800         MOVE WS-UPCPLS-STR-NBR         TO                                
047900              DS-UPCPLS-STR-NBR                                           
048000         MOVE WS-UPCPLS-EFF-BEG-TMST    TO                                
048100              DS-UPCPLS-EFF-BEG-TMST                                      
048200                                                                          
048300         WHEN DS009-PROCESS-TABLE = 'TMDSEAR'                             
048400         MOVE WS-MDSEAR-MDSEAR-DKEY      TO                               
048500              DS-MDSEAR-MDSEAR-DKEY                                       
048600                                                                          
048700         WHEN DS009-PROCESS-TABLE = 'TMDARVS'                             
048800         MOVE WS-MDARVS-SUB-CL-MDSEAR-ID TO                               
048900              DS-MDARVS-SUB-CL-MDSEAR-ID                                  
049000         MOVE WS-MDARVS-VS-ID            TO                               
049100              DS-MDARVS-VS-ID                                             
049200                                                                          
049300         WHEN DS009-PROCESS-TABLE = 'TSKXREF'                             
049400         MOVE WS-SKXREF-ITM-NBR          TO                               
049500              DS-SKXREF-ITM-NBR                                           
049600                                                                          
049700         WHEN DS009-PROCESS-TABLE = 'TVNDSTL'                             
049800         MOVE WS-VNDSTL-VS-ID            TO                               
049900              DS-VNDSTL-VS-ID                                             
050000                                                                          
050100         WHEN DS009-PROCESS-TABLE = 'TVEHICL'                             
050200         MOVE WS-VEHICL-OWNER-SCAC-ID    TO                               
050300              DS-VEHICL-OWNER-SCAC-ID                                     
050400         MOVE WS-VEHICL-VEH-NBR          TO                               
050500              DS-VEHICL-VEH-NBR                                           
050600                                                                          
050700         WHEN DS009-PROCESS-TABLE = 'TVHTRIP'                             
050800         MOVE WS-VHTRIP-TRIP-ID          TO                               
050900              DS-VHTRIP-TRIP-ID                                           
051000                                                                          
051100         WHEN DS009-PROCESS-TABLE = 'TSHIPMT'                             
051200         MOVE WS-SHIPMT-SHIPT-ID         TO                               
051300              DS-SHIPMT-SHIPT-ID                                          
051400                                                                          
051500         WHEN DS009-PROCESS-TABLE = 'TSHPTPO'                             
051600         MOVE WS-SHPTPO-SHIPT-ID         TO                               
051700              DS-SHPTPO-SHIPT-ID                                          
051800         MOVE WS-SHPTPO-PO-NBR           TO                               
051900              DS-SHPTPO-PO-NBR                                            
052000                                                                          
052100         WHEN DS009-PROCESS-TABLE = 'TPKSLIP'                             
052200         MOVE WS-PKSLIP-PO-NBR           TO                               
052300              DS-PKSLIP-PO-NBR                                            
052400         MOVE WS-PKSLIP-SEQ-NBR          TO                               
052500              DS-PKSLIP-SEQ-NBR                                           
052600         MOVE WS-PKSLIP-CRE-TMST         TO                               
052700              DS-PKSLIP-CRE-TMST                                          
052800                                                                          
052900         WHEN DS009-PROCESS-TABLE = 'TPKITEM'                             
053000         MOVE WS-PKITEM-PO-NBR           TO                               
053100              DS-PKITEM-PO-NBR                                            
053200         MOVE WS-PKITEM-SEQ-NBR          TO                               
053300              DS-PKITEM-SEQ-NBR                                           
053400         MOVE WS-PKITEM-PKSL-LNE-NBR     TO                               
053500              DS-PKITEM-PKSL-LNE-NBR                                      
053600         MOVE WS-PKITEM-CRE-TMST         TO                               
053700              DS-PKITEM-CRE-TMST                                          
053800                                                                          
053900         WHEN DS009-PROCESS-TABLE = 'TSHIPST'                             
054000         MOVE WS-SHIPST-SHIPT-ID         TO                               
054100              DS-SHIPST-SHIPT-ID                                          
054200         MOVE WS-SHIPST-SHIPT-STATUS-CDE TO                               
054300              DS-SHIPST-SHIPT-STATUS-CDE                                  
054400                                                                          
054500         WHEN DS009-PROCESS-TABLE = 'TTRIPST'                             
054600         MOVE WS-TRIPST-TRIP-ID          TO                               
054700              DS-TRIPST-TRIP-ID                                           
054800         MOVE WS-TRIPST-TRIP-STATUS-CDE  TO                               
054900              DS-TRIPST-TRIP-STATUS-CDE                                   
055000                                                                          
055100         WHEN DS009-PROCESS-TABLE = 'TRECEIV'                             
055200         MOVE WS-RECEIV-ORD-NBR          TO                               
055300              DS-RECEIV-ORD-NBR                                           
055400         MOVE WS-RECEIV-REC-SEQ-NBR      TO                               
055500              DS-RECEIV-REC-SEQ-NBR                                       
055600                                                                          
055700         WHEN DS009-PROCESS-TABLE = 'TRECITM'                             
055800         MOVE WS-RECITM-ORD-NBR          TO                               
055900              DS-RECITM-ORD-NBR                                           
056000         MOVE WS-RECITM-ORD-LNE-NBR      TO                               
056100              DS-RECITM-ORD-LNE-NBR                                       
056200         MOVE WS-RECITM-REC-SEQ-NBR      TO                               
056300              DS-RECITM-REC-SEQ-NBR                                       
056400         MOVE WS-RECITM-OPER-UNT-ID      TO                               
056500              DS-RECITM-OPER-UNT-ID                                       
056600         MOVE WS-RECITM-FCLTY-ID         TO                               
056700              DS-RECITM-FCLTY-ID                                          
056800                                                                          
056900         WHEN DS009-PROCESS-TABLE = 'TRECDIS'                             
057000         MOVE WS-RECDIS-ORD-NBR          TO                               
057100             DS-RECDIS-ORD-NBR                                            
057200         MOVE WS-RECDIS-ORD-LNE-NBR      TO                               
057300             DS-RECDIS-ORD-LNE-NBR                                        
057400         MOVE WS-RECDIS-REC-SEQ-NBR      TO                               
057500             DS-RECDIS-REC-SEQ-NBR                                        
057600         MOVE WS-RECDIS-OPER-UNT-ID      TO                               
057700             DS-RECDIS-OPER-UNT-ID                                        
057800         MOVE WS-RECDIS-FCLTY-ID         TO                               
057900             DS-RECDIS-FCLTY-ID                                           
058000         MOVE WS-RECDIS-STR-NBR          TO                               
058100             DS-RECDIS-STR-NBR                                            
058200         MOVE WS-RECDIS-STR-FCLTY-ID     TO                               
058300             DS-RECDIS-STR-FCLTY-ID                                       
058400                                                                          
058500         WHEN DS009-PROCESS-TABLE = 'TSHUNLO'                             
058600         MOVE WS-SHUNLO-SHIPT-UNT-ID     TO                               
058700              DS-SHUNLO-SHIPT-UNT-ID                                      
058800                                                                          
058900         WHEN DS009-PROCESS-TABLE = 'TSHUUPC'                             
059000         MOVE WS-SHUUPC-SHIPT-UNT-ID     TO                               
059100             DS-SHUUPC-SHIPT-UNT-ID                                       
059200         MOVE WS-SHUUPC-TRN-NBR          TO                               
059300             DS-SHUUPC-TRN-NBR                                            
059400         MOVE WS-SHUUPC-TRN-LNE-NBR      TO                               
059500             DS-SHUUPC-TRN-LNE-NBR                                        
059600         MOVE WS-SHUUPC-TRN-TYP-CDE      TO                               
059700             DS-SHUUPC-TRN-TYP-CDE                                        
059800         MOVE WS-SHUUPC-UPC-NBR          TO                               
059900             DS-SHUUPC-UPC-NBR                                            
060000                                                                          
060100         WHEN DS009-PROCESS-TABLE = 'TSHPUNT'                             
060200         MOVE WS-SHPUNT-SHIPT-UNT-ID     TO                               
060300              DS-SHPUNT-SHIPT-UNT-ID                                      
060400                                                                          
060500         WHEN DS009-PROCESS-TABLE = 'TINPKSU'                             
060600         MOVE WS-INPKSU-SHIPT-UNT-ID     TO                               
060700              DS-INPKSU-SHIPT-UNT-ID                                      
060800                                                                          
060900         WHEN DS009-PROCESS-TABLE = 'TSULBXF'                             
061000         MOVE WS-SULBXF-SHIPT-UNT-ID       TO                             
061100              DS-SULBXF-SHIPT-UNT-ID                                      
061200         MOVE WS-SULBXF-BRCDE-NBR          TO                             
061300              DS-SULBXF-BRCDE-NBR                                         
061400         MOVE WS-SULBXF-LAST-STAT-CHG-TMST TO                             
061500              DS-SULBXF-LAST-STAT-CHG-TMST                                
061600                                                                          
061700         WHEN DS009-PROCESS-TABLE = 'TIMCNTK'                             
061800         MOVE IMCNTK-CONTNR-ID        TO                                  
061900             DS-IMCNTK-CONTNR-ID                                          
062000         MOVE IMCNTK-CONTNR-SEQ-NBR   TO                                  
062100             DS-IMCNTK-CONTNR-SEQ-NBR                                     
062200                                                                          
062300         WHEN DS009-PROCESS-TABLE = 'TIMCNPO'                             
062400         MOVE IMCNPO-CONTNR-ID        TO                                  
062500             DS-IMCNPO-CONTNR-ID                                          
062600         MOVE IMCNPO-CONTNR-SEQ-NBR   TO                                  
062700             DS-IMCNPO-CONTNR-SEQ-NBR                                     
062800         MOVE IMCNPO-PO-NBR           TO                                  
062900             DS-IMCNPO-PO-NBR                                             
063000                                                                          
063100         WHEN DS009-PROCESS-TABLE = 'TIMCNUP'                             
063200         MOVE WS-IMCNUP-CONTNR-ID        TO                               
063300             DS-IMCNUP-CONTNR-ID                                          
063400         MOVE WS-IMCNUP-CONTNR-SEQ-NBR   TO                               
063500             DS-IMCNUP-CONTNR-SEQ-NBR                                     
063600         MOVE WS-IMCNUP-PO-NBR           TO                               
063700             DS-IMCNUP-PO-NBR                                             
063800*        MOVE WS-IMCNUP-VS-NBR           TO                               
063900*            DS-IMCNUP-VS-NBR                                             
064000         MOVE WS-IMCNUP-UPC-NBR          TO                               
064100             DS-IMCNUP-UPC-NBR                                            
064200         MOVE WS-IMCNUP-PO-LNE-NBR       TO                               
064300             DS-IMCNUP-PO-LNE-NBR                                         
064400                                                                          
064500         WHEN DS009-PROCESS-TABLE = 'TRT_IMPRT_CART'                      
064600         MOVE WS-TRT00008-CONTNR-ID        TO                             
064700             DS-TRT00008-CONTNR-ID                                        
064800         MOVE WS-TRT00008-CONTNR-SEQ-NBR   TO                             
064900             DS-TRT00008-CONTNR-SEQ-NBR                                   
065000         MOVE WS-TRT00008-PO-NBR           TO                             
065100             DS-TRT00008-PO-NBR                                           
065200         MOVE WS-TRT00008-UPC-NBR          TO                             
065300             DS-TRT00008-UPC-NBR                                          
065400         MOVE WS-TRT00008-SSCC-ID          TO                             
065500             DS-TRT00008-SSCC-ID                                          
065600                                                                          
065700         WHEN DS009-PROCESS-TABLE = 'TRT_IMPRT_SEAL'                      
065800         MOVE WS-TRT00006-CONTNR-ID        TO                             
065900             DS-TRT00006-CONTNR-ID                                        
066000         MOVE WS-TRT00006-CONTNR-SEQ-NBR   TO                             
066100             DS-TRT00006-CONTNR-SEQ-NBR                                   
066200         MOVE WS-TRT00006-SEAL-NBR         TO                             
066300             DS-TRT00006-SEAL-NBR                                         
066400                                                                          
066500         WHEN DS009-PROCESS-TABLE = 'TIMBKPO'                             
066600         MOVE WS-IMBKPO-PO-NBR           TO                               
066700             DS-IMBKPO-PO-NBR                                             
066800         MOVE WS-IMBKPO-PO-BKG-SEQ-NBR   TO                               
066900             DS-IMBKPO-PO-BKG-SEQ-NBR                                     
067000                                                                          
067100*        WHEN DS009-PROCESS-TABLE = 'TIMBKVS'                             
067200*        MOVE WS-IMBKVS-PO-NBR           TO                               
067300*            DS-IMBKVS-PO-NBR                                             
067400*        MOVE WS-IMBKVS-PO-BKG-SEQ-NBR   TO                               
067500*            DS-IMBKVS-PO-BKG-SEQ-NBR                                     
067600*        MOVE WS-IMBKVS-VS-NBR           TO                               
067700*            DS-IMBKVS-VS-NBR                                             
067800                                                                          
067900*        WHEN DS009-PROCESS-TABLE = 'TIMBKUP'                             
068000*        MOVE WS-IMBKUP-PO-NBR           TO                               
068100*            DS-IMBKUP-PO-NBR                                             
068200*        MOVE WS-IMBKUP-PO-BKG-SEQ-NBR   TO                               
068300*            DS-IMBKUP-PO-BKG-SEQ-NBR                                     
068400*        MOVE WS-IMBKUP-VS-NBR           TO                               
068500*            DS-IMBKUP-VS-NBR                                             
068600*        MOVE WS-IMBKUP-UPC-NBR          TO                               
068700*            DS-IMBKUP-UPC-NBR                                            
068800                                                                          
068900         WHEN DS009-PROCESS-TABLE = 'TIMRCPO'                             
069000         MOVE WS-IMRCPO-PO-NBR           TO                               
069100             DS-IMRCPO-PO-NBR                                             
069200         MOVE WS-IMRCPO-PO-RCVD-SEQ-NBR  TO                               
069300             DS-IMRCPO-PO-RCVD-SEQ-NBR                                    
069400                                                                          
069500*        WHEN DS009-PROCESS-TABLE = 'TIMRCVS'                             
069600*        MOVE WS-IMRCVS-PO-NBR           TO                               
069700*            DS-IMRCVS-PO-NBR                                             
069800*        MOVE WS-IMRCVS-PO-RCVD-SEQ-NBR  TO                               
069900*            DS-IMRCVS-PO-RCVD-SEQ-NBR                                    
070000*        MOVE WS-IMRCVS-VS-NBR           TO                               
070100*            DS-IMRCVS-VS-NBR                                             
070200                                                                          
070300*        WHEN DS009-PROCESS-TABLE = 'TIMRCUP'                             
070400*        MOVE WS-IMRCUP-PO-NBR           TO                               
070500*             DS-IMRCUP-PO-NBR                                            
070600*        MOVE WS-IMRCUP-PO-RCVD-SEQ-NBR  TO                               
070700*             DS-IMRCUP-PO-RCVD-SEQ-NBR                                   
070800*        MOVE WS-IMRCUP-VS-NBR           TO                               
070900*             DS-IMRCUP-VS-NBR                                            
071000*        MOVE WS-IMRCUP-UPC-NBR          TO                               
071100*             DS-IMRCUP-UPC-NBR                                           
071200                                                                          
071300         WHEN DS009-PROCESS-TABLE = 'TMESTDS'                             
071400         MOVE WS-MESTDS-PO-NBR        TO                                  
071500              DS-MESTDS-PO-NBR                                            
071600         MOVE WS-MESTDS-PO-LNE-NBR    TO                                  
071700              DS-MESTDS-PO-LNE-NBR                                        
071800         MOVE WS-MESTDS-PLAN-NBR      TO                                  
071900              DS-MESTDS-PLAN-NBR                                          
072000         MOVE WS-MESTDS-STR-NBR       TO                                  
072100              DS-MESTDS-STR-NBR                                           
072200                                                                          
072300         WHEN DS009-PROCESS-TABLE = 'TEXTENT'                             
072400         MOVE WS-EXTENT-ENT-ID        TO                                  
072500              DS-EXTENT-ENT-ID                                            
072600                                                                          
072700         WHEN DS009-PROCESS-TABLE = 'TENTNME'                             
072800         MOVE WS-ENTNME-ENT-ID        TO                                  
072900              DS-ENTNME-ENT-ID                                            
073000         MOVE WS-ENTNME-SEQ-NBR       TO                                  
073100              DS-ENTNME-SEQ-NBR                                           
073200                                                                          
073300         WHEN DS009-PROCESS-TABLE = 'TVNDDPT'                             
073400         MOVE WS-VNDDPT-ENT-ID           TO                               
073500              DS-VNDDPT-ENT-ID                                            
073600         MOVE WS-VNDDPT-DEPT-NBR         TO                               
073700              DS-VNDDPT-DEPT-NBR                                          
073800                                                                          
072300         WHEN DS009-PROCESS-TABLE = 'TTRDPRT'                             
072400         MOVE WS-TRDPRT-ENT-ID        TO                                  
072500              DS-TRDPRT-ENT-ID                                            
072400         MOVE WS-TRDPRT-TP-DKEY       TO                                  
072500              DS-TRDPRT-TP-DKEY                                           
072600                                                                          
072300         WHEN DS009-PROCESS-TABLE = 'TFGTRST'                             
072400         MOVE WS-FGTRST-TP-DKEY       TO                                  
072500              DS-FGTRST-TP-DKEY                                           
072400         MOVE WS-FGTRST-TP-DKEY-TMST  TO                                  
072500              DS-FGTRST-TP-DKEY-TMST                                      
072400         MOVE WS-FGTRST-FUNC-CDE-SEQ-NBR  TO                              
072500              DS-FGTRST-FUNC-CDE-SEQ-NBR                                  
072400         MOVE WS-FGTRST-TRN-SET-SEQ-NBR  TO                               
072500              DS-FGTRST-TRN-SET-SEQ-NBR                                   
072600                                                                          
072300         WHEN DS009-PROCESS-TABLE = 'TINTTRN'                             
072400         MOVE WS-INTTRN-TP-DKEY       TO                                  
072500              DS-INTTRN-TP-DKEY                                           
072400         MOVE WS-INTTRN-TP-DKEY-TMST  TO                                  
072500              DS-INTTRN-TP-DKEY-TMST                                      
072600                                                                          
073900         WHEN DS009-PROCESS-TABLE = 'TINSTCD'                             
074000         MOVE WS-INSTCD-INSTR-NBR        TO                               
074100              DS-INSTCD-INSTR-NBR                                         
074200                                                                          
074300         WHEN DS009-PROCESS-TABLE = 'TTRBNTF'                             
074400         MOVE WS-TRBNTF-NOTIF-NBR        TO                               
074500              DS-TRBNTF-NOTIF-NBR                                         
074600                                                                          
074700         WHEN DS009-PROCESS-TABLE = 'TTRBDTL'                             
074800         MOVE WS-TRBDTL-NOTIF-NBR        TO                               
074900              DS-TRBDTL-NOTIF-NBR                                         
075000         MOVE WS-TRBDTL-CRE-TMST         TO                               
075100              DS-TRBDTL-CRE-TMST                                          
075200                                                                          
075300         WHEN DS009-PROCESS-TABLE = 'TRECDVS'                             
075400         MOVE WS-RECDVS-ORD-NBR          TO                               
075500              DS-RECDVS-ORD-NBR                                           
075600         MOVE WS-RECDVS-ORD-LNE-NBR      TO                               
075700              DS-RECDVS-ORD-LNE-NBR                                       
075800         MOVE WS-RECDVS-REC-SEQ-NBR      TO                               
075900              DS-RECDVS-REC-SEQ-NBR                                       
076000         MOVE WS-RECDVS-STR-NBR          TO                               
076100              DS-RECDVS-STR-NBR                                           
076200         MOVE WS-RECDVS-VRFY-SRC-CDE     TO                               
076300              DS-RECDVS-VRFY-SRC-CDE                                      
076400                                                                          
076500         WHEN DS009-PROCESS-TABLE = 'TAUTRIP'                             
076600         MOVE WS-AUTRIP-TRIP-ID          TO                               
076700              DS-AUTRIP-TRIP-ID                                           
076800         MOVE WS-AUTRIP-LAST-UPD-DTE     TO                               
076900              DS-AUTRIP-LAST-UPD-DTE                                      
077000         MOVE WS-AUTRIP-LAST-UPD-TME     TO                               
077100              DS-AUTRIP-LAST-UPD-TME                                      
077200                                                                          
077300         WHEN DS009-PROCESS-TABLE = 'TIMCSEN'                             
077400         MOVE  WS-IMCSEN-CSTM-ENTR-ID    TO                               
077500               DS-IMCSEN-CSTM-ENTR-ID                                     
077600                                                                          
077700         WHEN DS009-PROCESS-TABLE = 'TIMCSBL'                             
077800         MOVE WS-IMCSBL-CSTM-ENTR-ID     TO                               
077900              DS-IMCSBL-CSTM-ENTR-ID                                      
078000         MOVE WS-IMCSBL-MSTR-BOL-NBR     TO                               
078100              DS-IMCSBL-MSTR-BOL-NBR                                      
078200         MOVE WS-IMCSBL-HSE-BOL-NBR      TO                               
078300              DS-IMCSBL-HSE-BOL-NBR                                       
078400                                                                          
078500         WHEN DS009-PROCESS-TABLE = 'TIMCSCN'                             
078600         MOVE WS-IMCSCN-CSTM-ENTR-ID     TO                               
078700              DS-IMCSCN-CSTM-ENTR-ID                                      
078800         MOVE WS-IMCSCN-CONTNR-ID        TO                               
078900              DS-IMCSCN-CONTNR-ID                                         
079000                                                                          
079100         WHEN DS009-PROCESS-TABLE = 'TIMCSPO'                             
079200         MOVE WS-IMCSPO-CSTM-ENTR-ID     TO                               
079300              DS-IMCSPO-CSTM-ENTR-ID                                      
079400         MOVE WS-IMCSPO-PO-NBR           TO                               
079500              DS-IMCSPO-PO-NBR                                            
079600                                                                          
079700         WHEN DS009-PROCESS-TABLE = 'TAUCSEN'                             
079800         MOVE WS-AUCSEN-CSTM-ENTR-ID    TO                                
079900              DS-AUCSEN-CSTM-ENTR-ID                                      
080000         MOVE WS-AUCSEN-LAST-UPD-TMST   TO                                
080100              DS-AUCSEN-LAST-UPD-TMST                                     
080200                                                                          
080300         WHEN DS009-PROCESS-TABLE = 'TAUCSBL'                             
080400         MOVE WS-AUCSBL-CSTM-ENTR-ID    TO                                
080500              DS-AUCSBL-CSTM-ENTR-ID                                      
080600         MOVE WS-AUCSBL-LAST-UPD-TMST   TO                                
080700              DS-AUCSBL-LAST-UPD-TMST                                     
080800                                                                          
080900         WHEN DS009-PROCESS-TABLE = 'TAUCSCN'                             
081000         MOVE WS-AUCSCN-CSTM-ENTR-ID    TO                                
081100              DS-AUCSCN-CSTM-ENTR-ID                                      
081200         MOVE WS-AUCSCN-LAST-UPD-TMST   TO                                
081300              DS-AUCSCN-LAST-UPD-TMST                                     
081400                                                                          
081500         WHEN DS009-PROCESS-TABLE = 'TAUCSPO'                             
081600         MOVE WS-AUCSPO-CSTM-ENTR-ID    TO                                
081700              DS-AUCSPO-CSTM-ENTR-ID                                      
081800         MOVE WS-AUCSPO-LAST-UPD-TMST   TO                                
081900              DS-AUCSPO-LAST-UPD-TMST                                     
082000                                                                          
082100         WHEN DS009-PROCESS-TABLE = 'TAURCPO'                             
082200         MOVE WS-AURCPO-PO-NBR          TO                                
082300              DS-AURCPO-PO-NBR                                            
082400         MOVE WS-AURCPO-PO-RCVD-SEQ-NBR TO                                
082500              DS-AURCPO-PO-RCVD-SEQ-NBR                                   
082600         MOVE WS-AURCPO-AUD-TMST        TO                                
082700              DS-AURCPO-AUD-TMST                                          
082800                                                                          
082900*        WHEN DS009-PROCESS-TABLE = 'TAURCVS'                             
083000*        MOVE WS-AURCVS-PO-NBR          TO                                
083100*             DS-AURCVS-PO-NBR                                            
083200*        MOVE WS-AURCVS-PO-RCVD-SEQ-NBR TO                                
083300*             DS-AURCVS-PO-RCVD-SEQ-NBR                                   
083400*        MOVE WS-AURCVS-VS-NBR          TO                                
083500*             DS-AURCVS-VS-NBR                                            
083600*        MOVE WS-AURCVS-AUD-TMST        TO                                
083700*             DS-AURCVS-AUD-TMST                                          
083800                                                                          
083900*        WHEN DS009-PROCESS-TABLE = 'TAURCUP'                             
084000*        MOVE WS-AURCUP-PO-NBR          TO                                
084100*             DS-AURCUP-PO-NBR                                            
084200*        MOVE WS-AURCUP-PO-RCVD-SEQ-NBR TO                                
084300*             DS-AURCUP-PO-RCVD-SEQ-NBR                                   
084400*        MOVE WS-AURCUP-VS-NBR          TO                                
084500*             DS-AURCUP-VS-NBR                                            
084600*        MOVE WS-AURCUP-UPC-NBR         TO                                
084700*             DS-AURCUP-UPC-NBR                                           
084800*        MOVE WS-AURCUP-AUD-TMST        TO                                
084900*             DS-AURCUP-AUD-TMST                                          
085000                                                                          
085100         WHEN DS009-PROCESS-TABLE = 'TAUBKPO'                             
085200         MOVE WS-AUBKPO-PO-NBR          TO                                
085300              DS-AUBKPO-PO-NBR                                            
085400         MOVE WS-AUBKPO-PO-BKG-SEQ-NBR  TO                                
085500              DS-AUBKPO-PO-BKG-SEQ-NBR                                    
085600         MOVE WS-AUBKPO-AUD-TMST        TO                                
085700              DS-AUBKPO-AUD-TMST                                          
085800                                                                          
085900*        WHEN DS009-PROCESS-TABLE = 'TAUBKVS'                             
086000*        MOVE WS-AUBKVS-PO-NBR          TO                                
086100*             DS-AUBKVS-PO-NBR                                            
086200*        MOVE WS-AUBKVS-PO-BKG-SEQ-NBR  TO                                
086300*             DS-AUBKVS-PO-BKG-SEQ-NBR                                    
086400*        MOVE WS-AUBKVS-VS-NBR          TO                                
086500*             DS-AUBKVS-VS-NBR                                            
086600*        MOVE WS-AUBKVS-AUD-TMST        TO                                
086700*             DS-AUBKVS-AUD-TMST                                          
086800                                                                          
086900*        WHEN DS009-PROCESS-TABLE = 'TAUBKUP'                             
087000*        MOVE WS-AUBKUP-PO-NBR          TO                                
087100*             DS-AUBKUP-PO-NBR                                            
087200*        MOVE WS-AUBKUP-PO-BKG-SEQ-NBR  TO                                
087300*             DS-AUBKUP-PO-BKG-SEQ-NBR                                    
087400*        MOVE WS-AUBKUP-VS-NBR          TO                                
087500*             DS-AUBKUP-VS-NBR                                            
087600*        MOVE WS-AUBKUP-UPC-NBR         TO                                
087700*             DS-AUBKUP-UPC-NBR                                           
087800*        MOVE WS-AUBKUP-AUD-TMST        TO                                
087900*             DS-AUBKUP-AUD-TMST                                          
088000                                                                          
088100         WHEN DS009-PROCESS-TABLE = 'TAUCNPO'                             
088200         MOVE WS-AUCNPO-CONTNR-ID       TO                                
088300              DS-AUCNPO-CONTNR-ID                                         
088400         MOVE WS-AUCNPO-CONTNR-SEQ-NBR  TO                                
088500              DS-AUCNPO-CONTNR-SEQ-NBR                                    
088600         MOVE WS-AUCNPO-PO-NBR          TO                                
088700              DS-AUCNPO-PO-NBR                                            
088800         MOVE WS-AUCNPO-AUD-TMST        TO                                
088900              DS-AUCNPO-AUD-TMST                                          
089000                                                                          
089100         WHEN DS009-PROCESS-TABLE = 'TAUCNUP'                             
089200         MOVE WS-AUCNUP-CONTNR-ID       TO                                
089300              DS-AUCNUP-CONTNR-ID                                         
089400         MOVE WS-AUCNUP-CONTNR-SEQ-NBR  TO                                
089500              DS-AUCNUP-CONTNR-SEQ-NBR                                    
089600         MOVE WS-AUCNUP-PO-NBR          TO                                
089700              DS-AUCNUP-PO-NBR                                            
089800         MOVE WS-AUCNUP-VS-NBR          TO                                
089900              DS-AUCNUP-VS-NBR                                            
090000         MOVE WS-AUCNUP-UPC-NBR         TO                                
090100              DS-AUCNUP-UPC-NBR                                           
090200         MOVE WS-AUCNUP-PO-LNE-NBR      TO                                
090300              DS-AUCNUP-PO-LNE-NBR                                        
090400         MOVE WS-AUCNUP-AUD-TMST        TO                                
090500              DS-AUCNUP-AUD-TMST                                          
090600                                                                          
090700         WHEN DS009-PROCESS-TABLE = 'TRT_AUD_IMPRT_CART'                  
090800         MOVE WS-TRT00009-CONTNR-ID       TO                              
090900              DS-TRT00009-CONTNR-ID                                       
091000         MOVE WS-TRT00009-CONTNR-SEQ-NBR  TO                              
091100              DS-TRT00009-CONTNR-SEQ-NBR                                  
091200         MOVE WS-TRT00009-PO-NBR          TO                              
091300              DS-TRT00009-PO-NBR                                          
091400         MOVE WS-TRT00009-UPC-NBR         TO                              
091500              DS-TRT00009-UPC-NBR                                         
091600         MOVE WS-TRT00009-SSCC-ID         TO                              
091700              DS-TRT00009-SSCC-ID                                         
091800         MOVE WS-TRT00009-AUD-TMST        TO                              
091900              DS-TRT00009-AUD-TMST                                        
092000                                                                          
092100         WHEN DS009-PROCESS-TABLE = 'TRT_AUD_IMPRT_SEAL'                  
092200         MOVE WS-TRT00007-CONTNR-ID       TO                              
092300              DS-TRT00007-CONTNR-ID                                       
092400         MOVE WS-TRT00007-CONTNR-SEQ-NBR  TO                              
092500              DS-TRT00007-CONTNR-SEQ-NBR                                  
092600         MOVE WS-TRT00007-SEAL-NBR        TO                              
092700              DS-TRT00007-SEAL-NBR                                        
092800         MOVE WS-TRT00007-AUD-TMST        TO                              
092900              DS-TRT00007-AUD-TMST                                        
093000                                                                          
093100         WHEN DS009-PROCESS-TABLE = 'TAUCNTK'                             
093200         MOVE WS-AUCNTK-CONTNR-ID       TO                                
093300              DS-AUCNTK-CONTNR-ID                                         
093400         MOVE WS-AUCNTK-CONTNR-SEQ-NBR  TO                                
093500              DS-AUCNTK-CONTNR-SEQ-NBR                                    
093600         MOVE WS-AUCNTK-AUD-TMST        TO                                
093700              DS-AUCNTK-AUD-TMST                                          
093800                                                                          
093900         WHEN DS009-PROCESS-TABLE = 'TAUSHIP'                             
094000         MOVE WS-AUSHIP-SHIPT-ID        TO                                
094100              DS-AUSHIP-SHIPT-ID                                          
094200         MOVE WS-AUSHIP-LAST-UPD-DTE    TO                                
094300              DS-AUSHIP-LAST-UPD-DTE                                      
094400         MOVE WS-AUSHIP-LAST-UPD-TME    TO                                
094500              DS-AUSHIP-LAST-UPD-TME                                      
094600                                                                          
094700         WHEN DS009-PROCESS-TABLE = 'TAUSHPO'                             
094800         MOVE WS-AUSHPO-SHIPT-ID        TO                                
094900              DS-AUSHPO-SHIPT-ID                                          
095000         MOVE WS-AUSHPO-PO-NBR          TO                                
095100              DS-AUSHPO-PO-NBR                                            
095200         MOVE WS-AUSHPO-CRE-TMST        TO                                
095300              DS-AUSHPO-CRE-TMST                                          
095400                                                                          
095500         WHEN DS009-PROCESS-TABLE = 'TAUVHCL'                             
095600         MOVE WS-AUVHCL-OWNER-SCAC-ID   TO                                
095700              DS-AUVHCL-OWNER-SCAC-ID                                     
095800         MOVE WS-AUVHCL-VEH-NBR         TO                                
095900              DS-AUVHCL-VEH-NBR                                           
096000         MOVE WS-AUVHCL-LAST-UPD-DTE    TO                                
096100              DS-AUVHCL-LAST-UPD-DTE                                      
096200         MOVE WS-AUVHCL-LAST-UPD-TME    TO                                
096300              DS-AUVHCL-LAST-UPD-TME                                      
096400                                                                          
096500         WHEN DS009-PROCESS-TABLE = 'TELCPO'                              
096600         MOVE WS-ELCPO-PO-NBR           TO                                
096700              DS-ELCPO-PO-NBR                                             
096800         WHEN DS009-PROCESS-TABLE = 'TELCVS'                              
096900         MOVE WS-ELCVS-PO-NBR           TO                                
097000              DS-ELCVS-PO-NBR                                             
097100         MOVE WS-ELCVS-VND-STYL-NM      TO                                
097200              DS-ELCVS-VND-STYL-NM                                        
097300         WHEN DS009-PROCESS-TABLE = 'TVSCPT'                              
097400         MOVE WS-VSCPT-PO-NBR           TO                                
097500              DS-VSCPT-PO-NBR                                             
097600         MOVE WS-VSCPT-VND-STYL-NM      TO                                
097700              DS-VSCPT-VND-STYL-NM                                        
097800         MOVE WS-VSCPT-CST-CPT-CDE      TO                                
097900              DS-VSCPT-CST-CPT-CDE                                        
098000                                                                          
098100*        WHEN DS009-PROCESS-TABLE = 'TPOUPC'                              
098200*        MOVE WS-POUPC-PO-NBR           TO                                
098300*             DS-POUPC-PO-NBR                                             
098400*        MOVE WS-POUPC-PO-LNE-NBR       TO                                
098500*             DS-POUPC-PO-LNE-NBR                                         
098600*        MOVE WS-POUPC-UPC-ID           TO                                
098700*             DS-POUPC-UPC-ID                                             
098800                                                                          
098900         WHEN DS009-PROCESS-TABLE = 'TALLTMP'                             
099000         MOVE WS-ALLTMP-PO-NBR          TO                                
099100              DS-ALLTMP-PO-NBR                                            
099200         MOVE WS-ALLTMP-DEST-NBR        TO                                
099300              DS-ALLTMP-DEST-NBR                                          
099400                                                                          
099500         WHEN DS009-PROCESS-TABLE = 'TVNDAGR'                             
099600         MOVE WS-VNDAGR-ENT-ID          TO                                
099700              DS-VNDAGR-ENT-ID                                            
099800         MOVE WS-VNDAGR-DEPT-NBR        TO                                
099900              DS-VNDAGR-DEPT-NBR                                          
100000         MOVE WS-VNDAGR-AGRMT-TYP-ID    TO                                
100100              DS-VNDAGR-AGRMT-TYP-ID                                      
100200         MOVE WS-VNDAGR-SEQ-NBR         TO                                
100300              DS-VNDAGR-SEQ-NBR                                           
100400                                                                          
100500         WHEN DS009-PROCESS-TABLE = 'TPAYREQ'                             
100600         MOVE WS-PAYREQ-PAYT-REQ-SEQ-NBR TO                               
100700              DS-PAYREQ-PAYT-REQ-SEQ-NBR                                  
100800                                                                          
100900                                                                          
101000         WHEN DS009-PROCESS-TABLE = 'TINVOIC'                             
101100         MOVE WS-INVOIC-PAYT-REQ-SEQ-NBR TO                               
101200              DS-INVOIC-PAYT-REQ-SEQ-NBR                                  
101300                                                                          
101400                                                                          
101500         WHEN DS009-PROCESS-TABLE = 'TALCHRG'                             
101600*        MOVE WS-ALCHRG-PAYT-REQ-SEQ-NBR TO                               
101700*             DS-ALCHRG-PAYT-REQ-SEQ-NBR                                  
101800         MOVE WS-ALCHRG-ALW-CHRG-SEQ-NBR TO                               
101900              DS-ALCHRG-ALW-CHRG-SEQ-NBR                                  
102000                                                                          
102100                                                                          
102200         WHEN DS009-PROCESS-TABLE = 'TPREQIT'                             
102300         MOVE WS-PREQIT-PAYT-REQ-SEQ-NBR TO                               
102400              DS-PREQIT-PAYT-REQ-SEQ-NBR                                  
102500         MOVE WS-PREQIT-PAYT-REQ-LNE-NBR TO                               
102600              DS-PREQIT-PAYT-REQ-LNE-NBR                                  
102700                                                                          
102800                                                                          
102900         WHEN DS009-PROCESS-TABLE = 'TASNDTL'                             
103000         MOVE WS-ASNDTL-ASNHDR-ID       TO                                
103100              DS-ASNDTL-ASNHDR-ID                                         
103200         MOVE WS-ASNDTL-ASNDTL-NBR      TO                                
103300              DS-ASNDTL-ASNDTL-NBR                                        
103400                                                                          
103500                                                                          
103600         WHEN DS009-PROCESS-TABLE = 'TASNORD'                             
103700         MOVE WS-ASNORD-ASNHDR-ID       TO                                
103800              DS-ASNORD-ASNHDR-ID                                         
103900         MOVE WS-ASNORD-PO-NBR          TO                                
104000              DS-SASNORD-PO-NBR                                           
104100         MOVE WS-ASNORD-SEQ-NBR         TO                                
104200              DS-ASNORD-SEQ-NBR                                           
104300         MOVE WS-ASNORD-SELR-INV-NBR    TO                                
104400              DS-ASNORD-SELR-INV-NBR                                      
104500                                                                          
104600                                                                          
104700         WHEN DS009-PROCESS-TABLE = 'TASNHDR'                             
104800         MOVE WS-ASNHDR-ASNHDR-ID       TO                                
104900              DS-ASNHDR-ASNHDR-ID                                         
105000         MOVE WS-ASNHDR-ASNHDR-TMST     TO                                
105100              DS-ASNHDR-ASNHDR-TMST                                       
105200                                                                          
105300                                                                          
105400         WHEN DS009-PROCESS-TABLE = 'TASCRIT'                             
105500         MOVE WS-ASCRIT-ASNHDR-ID       TO                                
105600              DS-ASCRIT-ASNHDR-ID                                         
105700         MOVE WS-ASCRIT-ASNCAR-NBR       TO                               
105800              DS-ASCRIT-SASNCAR-NBR                                       
105900         MOVE WS-ASCRIT-ASNDTL-NBR       TO                               
106000              DS-ASCRIT-ASNDTL-NBR                                        
106100                                                                          
106200                                                                          
106300         WHEN DS009-PROCESS-TABLE = 'TASNCAR'                             
106400         MOVE WS-ASNCAR-ASNHDR-ID       TO                                
106500              DS-ASNCAR-ASNHDR-ID                                         
106600         MOVE WS-ASNCAR-ASNCAR-NBR      TO                                
106700              DS-ASNCAR-ASNCAR-NBR                                        
106800                                                                          
106810                                                                          
106820         WHEN DS009-PROCESS-TABLE = 'TASDTPL'                             
106830         MOVE WS-ASDTPL-ASNHDR-ID       TO                                
106840              DS-ASDTPL-ASNHDR-ID                                         
106850         MOVE WS-ASDTPL-ASNDTL-NBR      TO                                
106860              DS-ASDTPL-ASNDTL-NBR                                        
106861         MOVE WS-ASDTPL-PO-LN-NBR       TO                                
106862              DS-ASDTPL-PO-LN-NBR                                         
106870                                                                          
106900         WHEN DS009-PROCESS-TABLE = 'TDISTHD'                             
107000         MOVE WS-DISTHD-ORD-NBR         TO                                
107100              DS-DISTHD-ORD-NBR                                           
107200         MOVE WS-DISTHD-RCVR-SEQ-NBR    TO                                
107300              DS-DISTHD-RCVR-SEQ-NBR                                      
107400         MOVE WS-DISTHD-ORD-LNE-NBR     TO                                
107500              DS-DISTHD-ORD-LNE-NBR                                       
107600                                                                          
107700         WHEN DS009-PROCESS-TABLE = 'TDISTDT'                             
107800         MOVE WS-DISTDT-ORD-NBR         TO                                
107900              DS-DISTDT-ORD-NBR                                           
108000         MOVE WS-DISTDT-RCVR-SEQ-NBR    TO                                
108100              DS-DISTDT-RCVR-SEQ-NBR                                      
108200         MOVE WS-DISTDT-ORD-LNE-NBR     TO                                
108300              DS-DISTDT-ORD-LNE-NBR                                       
108400         MOVE WS-DISTDT-STR-NBR         TO                                
108500              DS-DISTDT-STR-NBR                                           
108600                                                                          
108700         WHEN DS009-PROCESS-TABLE = 'TWRKORD'                             
108800         MOVE WS-WRKORD-ORD-NBR          TO                               
108900              DS-WRKORD-ORD-NBR                                           
109000         MOVE WS-WRKORD-RCVR-SEQ-NBR     TO                               
109100              DS-WRKORD-RCVR-SEQ-NBR                                      
109200         MOVE WS-WRKORD-ORD-LNE-NBR      TO                               
109300              DS-WRKORD-ORD-LNE-NBR                                       
109400         MOVE WS-WRKORD-WORK-ORD-SEQ-NBR TO                               
109500              DS-WRKORD-WORK-ORD-SEQ-NBR                                  
109600         MOVE WS-WRKORD-OPER-UNT-ID      TO                               
109700              DS-WRKORD-OPER-UNT-ID                                       
109800         MOVE WS-WRKORD-FCLTY-ID         TO                               
109900              DS-WRKORD-FCLTY-ID                                          
110000         MOVE WS-WRKORD-CRE-TMST         TO                               
110100              DS-WRKORD-CRE-TMST                                          
110200                                                                          
110300         WHEN DS009-PROCESS-TABLE = 'TWKORIN'                             
110400         MOVE WS-WKORIN-ORD-NBR          TO                               
110500              DS-WKORIN-ORD-NBR                                           
110600         MOVE WS-WKORIN-RCVR-SEQ-NBR     TO                               
110700              DS-WKORIN-RCVR-SEQ-NBR                                      
110800         MOVE WS-WKORIN-ORD-LNE-NBR      TO                               
110900              DS-WKORIN-ORD-LNE-NBR                                       
111000         MOVE WS-WKORIN-WORK-ORD-SEQ-NBR TO                               
111100              DS-WKORIN-WORK-ORD-SEQ-NBR                                  
111200         MOVE WS-WKORIN-OPER-UNT-ID      TO                               
111300              DS-WKORIN-OPER-UNT-ID                                       
111400         MOVE WS-WKORIN-FCLTY-ID         TO                               
111500              DS-WKORIN-FCLTY-ID                                          
111600         MOVE WS-WKORIN-WO-INSTR-SEQ-NBR TO                               
111700              DS-WKORIN-WO-INSTR-SEQ-NBR                                  
111800         MOVE WS-WKORIN-CRE-TMST         TO                               
111900              DS-WKORIN-CRE-TMST                                          
112000                                                                          
112100         WHEN DS009-PROCESS-TABLE = 'TSEASET'                             
112200         MOVE WS-SEASET-SEASET-YR       TO                                
112300              DS-SEASET-SEASET-YR                                         
112400         MOVE WS-SEASET-SEASET-SHRT-NM  TO                                
112500              DS-SEASET-SEASET-SHRT-NM                                    
112600                                                                          
112700         WHEN DS009-PROCESS-TABLE = 'TSUNAUD'                             
112800         MOVE WS-SUNAUD-AUD-CNTL-NBR    TO                                
112900              DS-SUNAUD-AUD-CNTL-NBR                                      
113000                                                                          
113100         WHEN DS009-PROCESS-TABLE = 'TSUATRN'                             
113200         MOVE WS-SUATRN-SHIPT-UNT-ID    TO                                
113300              DS-SUATRN-SHIPT-UNT-ID                                      
113400         MOVE WS-SUATRN-AUD-CNTL-NBR    TO                                
113500              DS-SUATRN-AUD-CNTL-NBR                                      
113600                                                                          
113700         WHEN DS009-PROCESS-TABLE = 'TSUAUPC'                             
113800         MOVE WS-SUAUPC-SHIPT-UNT-ID    TO                                
113900              DS-SUAUPC-SHIPT-UNT-ID                                      
114000         MOVE WS-SUAUPC-AUD-CNTL-NBR    TO                                
114100              DS-SUAUPC-AUD-CNTL-NBR                                      
114200         MOVE WS-SUAUPC-UPC-NBR         TO                                
114300              DS-SUAUPC-UPC-NBR                                           
114400         MOVE WS-SUAUPC-SCN-TMST        TO                                
114500              DS-SUAUPC-SCN-TMST                                          
114600                                                                          
114700         WHEN DS009-PROCESS-TABLE = 'TSUEXCP'                             
114800         MOVE WS-SUEXCP-SHIPT-UNT-ID    TO                                
114900              DS-SUEXCP-SHIPT-UNT-ID                                      
115000         MOVE WS-SUEXCP-AUD-CNTL-NBR    TO                                
115100              DS-SUEXCP-AUD-CNTL-NBR                                      
115200         MOVE WS-SUEXCP-UPC-NBR         TO                                
115300              DS-SUEXCP-UPC-NBR                                           
115400         MOVE WS-SUEXCP-VILN-GP-CDE     TO                                
115500              DS-SUEXCP-VILN-GP-CDE                                       
115600         MOVE WS-SUEXCP-VILN-GP-SEQ-NBR TO                                
115700              DS-SUEXCP-VILN-GP-SEQ-NBR                                   
115800         MOVE WS-SUEXCP-SCN-TMST        TO                                
115900              DS-SUEXCP-SCN-TMST                                          
116000                                                                          
116100         WHEN DS009-PROCESS-TABLE = 'TCTEXCP'                             
116200         MOVE WS-CTEXCP-SHIPT-UNT-ID    TO                                
116300              DS-CTEXCP-SHIPT-UNT-ID                                      
116400         MOVE WS-CTEXCP-AUD-CNTL-NBR    TO                                
116500              DS-CTEXCP-AUD-CNTL-NBR                                      
116600         MOVE WS-CTEXCP-VILN-GP-CDE     TO                                
116700              DS-CTEXCP-VILN-GP-CDE                                       
116800         MOVE WS-CTEXCP-VILN-GP-SEQ-NBR TO                                
116900              DS-CTEXCP-VILN-GP-SEQ-NBR                                   
117000                                                                          
117100         WHEN DS009-PROCESS-TABLE = 'TIMTBKY'                             
117200         MOVE WS-IMTBKY-NOTIF-NBR       TO                                
117300              DS-IMTBKY-NOTIF-NBR                                         
117400                                                                          
117500         WHEN DS009-PROCESS-TABLE = 'TPOPRPK'                             
117600         MOVE WS-POPRPK-PO-NBR          TO                                
117700              DS-POPRPK-PO-NBR                                            
117800         MOVE WS-POPRPK-VER-NBR         TO                                
117900              DS-POPRPK-VER-NBR                                           
118000         MOVE WS-POPRPK-PO-PREPK-ID     TO                                
118100              DS-POPRPK-PO-PREPK-ID                                       
118200                                                                          
118300         WHEN DS009-PROCESS-TABLE = 'TAUCNRL'                             
118400         MOVE AUCNRL-CONTNR-ID       TO                                   
118500              DS-AUCNRL-CONTNR-ID                                         
118600         MOVE AUCNRL-CONTNR-SEQ-NBR  TO                                   
118700              DS-AUCNRL-CONTNR-SEQ-NBR                                    
118800         MOVE AUCNRL-PO-NBR          TO                                   
118900              DS-AUCNRL-PO-NBR                                            
119000         MOVE AUCNRL-LAST-UPD-TMST   TO                                   
119100              DS-AUCNRL-LAST-UPD-TMST                                     
119200                                                                          
119300*        WHEN DS009-PROCESS-TABLE = 'TSPSTDS'                             
119400*        MOVE WS-SPSTDS-PO-NBR          TO                                
119500*             DS-SPSTDS-PO-NBR                                            
119600*        MOVE WS-SPSTDS-PO-LNE-NBR      TO                                
119700*             DS-SPSTDS-PO-LNE-NBR                                        
119800*        MOVE WS-SPSTDS-PLAN-NBR        TO                                
119900*             DS-SPSTDS-PLAN-NBR                                          
120000*        MOVE WS-SPSTDS-STR-NBR         TO                                
120100*             DS-SPSTDS-STR-NBR                                           
120200                                                                          
120300         WHEN DS009-PROCESS-TABLE = 'TSHPSUM'                             
120400         MOVE WS-SHPSUM-PO-NBR          TO                                
120500              DS-SHPSUM-PO-NBR                                            
120600         MOVE WS-SHPSUM-PKSL-SEQ-NBR    TO                                
120700              DS-SHPSUM-PKSL-SEQ-NBR                                      
120800         MOVE WS-SHPSUM-CART-COMB-NBR   TO                                
120900              DS-SHPSUM-CART-COMB-NBR                                     
121000         MOVE WS-SHPSUM-PO-LNE-NBR      TO                                
121100              DS-SHPSUM-PO-LNE-NBR                                        
121200                                                                          
121300         WHEN DS009-PROCESS-TABLE = 'TLBVRDA'                             
121400         MOVE WS-LBVRDA-PO-NBR          TO                                
121500              DS-LBVRDA-PO-NBR                                            
121600         MOVE WS-LBVRDA-RCVR-SEQ-NBR    TO                                
121700              DS-LBVRDA-RCVR-SEQ-NBR                                      
121800         MOVE WS-LBVRDA-PO-LNE-NBR      TO                                
121900              DS-LBVRDA-PO-LNE-NBR                                        
122000         MOVE WS-LBVRDA-PREPK-ID        TO                                
122100              DS-LBVRDA-PREPK-ID                                          
122200         MOVE WS-LBVRDA-OTPK-UNT-QTY    TO                                
122300              DS-LBVRDA-OTPK-UNT-QTY                                      
122400         MOVE WS-LBVRDA-LBL-ASG-IND     TO                                
122500              DS-LBVRDA-LBL-ASG-IND                                       
122600         MOVE WS-LBVRDA-LBL-TYP-CDE     TO                                
122700              DS-LBVRDA-LBL-TYP-CDE                                       
122800         MOVE WS-LBVRDA-LBL-ASG-SEQ-NBR TO                                
122900              DS-LBVRDA-LBL-ASG-SEQ-NBR                                   
123000                                                                          
123100         WHEN DS009-PROCESS-TABLE = 'TLBPTDA'                             
123200         MOVE WS-LBPTDA-TRIP-ID         TO                                
123300              DS-LBPTDA-TRIP-ID                                           
123400         MOVE WS-LBPTDA-CRE-USR-ID      TO                                
123500              DS-LBPTDA-CRE-USR-ID                                        
123600         MOVE WS-LBPTDA-LBL-PRT-BTCH-ID TO                                
123700              DS-LBPTDA-LBL-PRT-BTCH-ID                                   
123800         MOVE WS-LBPTDA-BRCDE-NBR       TO                                
123900              DS-LBPTDA-BRCDE-NBR                                         
124000         MOVE WS-LBPTDA-PO-NBR          TO                                
124100              DS-LBPTDA-PO-NBR                                            
124200         MOVE WS-LBPTDA-RCVR-SEQ-NBR    TO                                
124300              DS-LBPTDA-RCVR-SEQ-NBR                                      
124400         MOVE WS-LBPTDA-PO-LNE-NBR      TO                                
124500              DS-LBPTDA-PO-LNE-NBR                                        
124600         MOVE WS-LBPTDA-CRE-TMST        TO                                
124700              DS-LBPTDA-CRE-TMST                                          
124800                                                                          
124900         WHEN DS009-PROCESS-TABLE = 'TWEBITM'                             
125000         MOVE WS-WEBITM-INTR-UPC-ID     TO                                
125100              DS-WEBITM-INTR-UPC-ID                                       
125200         MOVE WS-WEBITM-EFF-BEG-TMST    TO                                
125300              DS-WEBITM-EFF-BEG-TMST                                      
125400         MOVE WS-WEBITM-EFF-END-TMST    TO                                
125500              DS-WEBITM-EFF-END-TMST                                      
125600         MOVE WS-WEBITM-EFF-END-TMST-NN TO                                
125700              DS-WEBITM-EFF-END-TMST-NN                                   
125800                                                                          
125900         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_CART'                      
126000             MOVE SUT00024-SHIPT-UNT-ID TO                                
126100                               DS-OTBCART-SHIPT-UNT-ID                    
126200                               DS008K-SUT00024-SHIPT-UNT-ID               
126300             MOVE SUT00024-OTBND-TRIP-ID                                  
126400                             TO DS008K-SUT00024-OTBND-TRIP-ID             
126500                                                                          
126600         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_UPC'                       
126700             MOVE SUT00028-SHIPT-UNT-ID TO                                
126800                               DS-OTBUPC-SHIPT-UNT-ID                     
126900             MOVE SUT00028-TRN-NBR      TO                                
127000                               DS-OTBUPC-TRN-NBR                          
127100             MOVE SUT00028-RCVR-SEQ-NBR TO                                
127200                               DS-OTBUPC-RCVR-SEQ-NBR                     
127300             MOVE SUT00028-TRN-LNE-NBR  TO                                
127400                               DS-OTBUPC-TRN-LNE-NBR                      
127500             MOVE SUT00028-TRN-TYP-CDE  TO                                
127600                               DS-OTBUPC-TRN-TYP-CDE                      
127700             MOVE SUT00028-UPC-NBR      TO                                
127800                               DS-OTBUPC-UPC-NBR                          
127900                                                                          
128000         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_PKD_UPC'                   
128100             MOVE SUT00025-SHIPT-UNT-ID TO                                
128200                               DS008-OTBPKD-SHIPT-UNT-ID                  
128300             MOVE SUT00025-TRN-NBR      TO                                
128400                               DS008-OTBPKD-TRN-NBR                       
128500             MOVE SUT00025-RCVR-SEQ-NBR TO                                
128600                               DS008-OTBPKD-RCVR-SEQ-NBR                  
128700             MOVE SUT00025-TRN-LNE-NBR  TO                                
128800                               DS008-OTBPKD-TRN-LNE-NBR                   
128900             MOVE SUT00025-TRN-TYP-CDE  TO                                
129000                               DS008-OTBPKD-TRN-TYP-CDE                   
129100             MOVE SUT00025-UPC-NBR      TO                                
129200                               DS008-OTBPKD-UPC-NBR                       
129300             MOVE SUT00025-PKD-BY-USR-ID  TO                              
129400                               DS008-OTBPKD-PKD-BY-USR-ID                 
129500             MOVE SUT00025-PKD-TMST     TO                                
129600                               DS008-OTBPKD-PKD-TMST                      
129700                                                                          
129800         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_LOC'                       
129900             MOVE DS008-OTBLOC-SHIPT-UNT-ID TO                            
130000                               DS008K-OTBLOC-SHIPT-UNT-ID                 
130100             MOVE DS008-OTBLOC-CRE-TMST     TO                            
130200                               DS008K-OTBLOC-CRE-TMST                     
130300                                                                          
130400         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_PK'                        
130500             MOVE DS008-SUT00041-SHIPT-UNT-ID TO                          
130600                             DS008K-SUT00041-SHIPT-UNT-ID                 
130700             MOVE DS008-SUT00041-TRN-NBR TO                               
130800                              DS008K-SUT00041-TRN-NBR                     
130900             MOVE DS008-SUT00041-RCVR-SEQ-NBR TO                          
131000                               DS008K-SUT00041-RCVR-SEQ-NBR               
131100             MOVE DS008-SUT00041-TRN-TYP-CDE TO                           
131200                               DS008K-SUT00041-TRN-TYP-CDE                
131300             MOVE DS008-SUT00041-PK-SKU-NBR TO                            
131400                               DS008K-SUT00041-PK-SKU-NBR                 
131500                                                                          
131600         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_VND'                       
131700             MOVE SUT00026-SHIPT-UNT-ID TO                                
131800                               DS008K-OTBVND-SHIPT-UNT-ID                 
131900                                                                          
132000         WHEN DS009-PROCESS-TABLE = 'TSUQADJ'                             
132100             MOVE SUQADJ-SHIPT-UNT-ID                                     
132200                                     TO DS008K-SUQADJ-SHIPT-UNT-ID        
132300             MOVE SUQADJ-UPC-NBR                                          
132400                                     TO DS008K-SUQADJ-UPC-NBR             
132500             MOVE SUQADJ-ADJ-TMST                                         
132600                                     TO DS008K-SUQADJ-ADJ-TMST            
132700                                                                          
133600         WHEN DS009-PROCESS-TABLE = 'TSUOBTR'                             
133700             MOVE SUOBTR-OTBND-TRIP-ID  TO DS-TSUOBTR-TRIP-ID             
133800                                                                          
133900         WHEN DS009-PROCESS-TABLE = 'TSUOBTS'                             
134000             MOVE SUOBTS-OTBND-TRIP-ID  TO DS-TSUOBTS-TRIP-ID             
134100             MOVE SUOBTS-OTBND-STAT-TMST TO                               
134200                                  DS-TSUOBTS-OTBND-STAT-TMST              
134300                                                                          
134400         WHEN DS009-PROCESS-TABLE = 'XLT_SKU'                             
134500             MOVE XLT00003-INTR-UPC-ID  TO                                
134600                                      DS008K-XLTSKU-INTR-UPC-ID           
134700                                                                          
134800         WHEN DS009-PROCESS-TABLE = 'XLT_UPC'                             
134900             MOVE XLT00006-UPC-ID       TO                                
135000                                      DS008K-XLTUPC-UPC-ID                
135100             MOVE XLT00006-INTR-UPC-ID  TO                                
135200                                      DS008K-XLTUPC-INTR-UPC-ID           
135300                                                                          
135400         WHEN DS009-PROCESS-TABLE = 'XLT_VND_STYL'                        
135500             MOVE XLT00004-STYL-ID    TO                                  
135600                                     DS008K-XLTVNDSTYL-STYL-ID            
135700                                                                          
135800         WHEN DS009-PROCESS-TABLE = 'SUT_FINCL_ADJ'                       
135900             MOVE DS008-FINCL-ADJ-ID     TO                               
136000                                     DS008K-FINCL-ADJ-ID                  
136100                                                                          
136200         WHEN DS009-PROCESS-TABLE = 'SUT_PO_AUD_REQ'                      
136300             MOVE DS008-SUT00015-PO-NBR                                   
136400                              TO DS008K-SUT00015-PO-NBR                   
136500             MOVE DS008-SUT00015-PO-LNE-NBR                               
136600                              TO DS008K-SUT00015-PO-LNE-NBR               
136700             MOVE DS008-SUT00015-PO-PREPK-ID                              
136800                              TO DS008K-SUT00015-PO-PREPK-ID              
136900             MOVE DS008-SUT00015-OPER-UNT-ID                              
137000                              TO DS008K-SUT00015-OPER-UNT-ID              
137100             MOVE DS008-SUT00015-INBND-TRIP-ID                            
137200                              TO DS008K-SUT00015-INBND-TRIP-ID            
137300             MOVE DS008-SUT00015-RCVR-SEQ-NBR                             
137400                               TO DS008K-SUT00015-RCVR-SEQ-NBR            
137500                                                                          
137600         WHEN DS009-PROCESS-TABLE = 'SUT_OTBND_CART'                      
137700             MOVE DS008-FINCL-ADJ-ID     TO                               
137800                                     DS008K-FINCL-ADJ-ID                  
137900                                                                          
138000         WHEN DS009-PROCESS-TABLE = 'TVSCHVL'                             
138100             MOVE WS-VSCHVL-CHARTC-CDE   TO                               
138200                  DS-VSCHVL-CHARTC-CDE                                    
138300             MOVE WS-VSCHVL-CHARTC-SEQ-NBR TO                             
138400                  DS-VSCHVL-CHARTC-SEQ-NBR                                
138500                                                                          
138600         WHEN DS009-PROCESS-TABLE = 'XLT_PK'                              
138700         MOVE XLT00007-PK-SKU-NBR       TO                                
138800                                      DS008K-XLT00007-PK-SKU-NBR          
138900                                                                          
139000         WHEN DS009-PROCESS-TABLE = 'XLT_PK_CPT_SKU'                      
139100         MOVE XLT00008-PK-SKU-NBR       TO                                
139200                                      DS008K-XLT00008-PK-SKU-NBR          
139300         MOVE XLT00008-CPT-SKU-NBR       TO                               
139400                                      DS008K-XLT00008-CPT-SKU-NBR         
139500                                                                          
139600         WHEN DS009-PROCESS-TABLE = 'XLT_PK_UPC'                          
139700         MOVE XLT00009-PK-SKU-NBR       TO                                
139800                                      DS008K-XLT00009-PK-SKU-NBR          
139900         MOVE XLT00009-UPC-NBR           TO                               
140000                                      DS008K-XLT00009-UPC-NBR             
140100                                                                          
140200         WHEN DS009-PROCESS-TABLE = 'TRT_RUL'                             
140300             MOVE TRT00014-RUL-ID     TO DS008K-TRT00014-RUL-ID           
140400                                                                          
140500         WHEN DS009-PROCESS-TABLE = 'TRT_RUL_CNSTR'                       
140600             MOVE TRT00015-RUL-ID     TO DS008K-TRT00015-RUL-ID           
140700             MOVE TRT00015-RUL-CNSTR-CDE  TO                              
140800                                    DS008K-TRT00015-CNSTR-CDE             
140900             MOVE TRT00015-RUL-CNSTR-TYP-CDE TO                           
141000                                    DS008K-TRT00015-CNSTR-TYP-CDE         
141100                                                                          
141200         WHEN DS009-PROCESS-TABLE = 'RCT_PO_RCVR_TRKG'                    
141300             MOVE RCT00017-PO-NBR     TO DS008K-RCT00017-PO-NBR           
141400             MOVE RCT00017-RCVR-SEQ-NBR  TO                               
141500                                    DS008K-RCT00017-RCVR-SEQ-NBR          
141600             MOVE RCT00017-CRE-BY-USR-ID TO                               
141700                                    DS008K-RCT00017-CRE-BY-USR-ID         
141800             MOVE RCT00017-CRE-TMST      TO                               
141900                                    DS008K-RCT00017-CRE-TMST              
142000                                                                          
142100         WHEN DS009-PROCESS-TABLE = 'IMT_STYL_PRTNR'                      
142200             MOVE DS008-IMT16-SUB-CL-MDSEAR-ID  TO                        
142300                  DS008K-IMT16-SUB-CL-MDSEAR-ID                           
142400             MOVE DS008-IMT16-VS-ID             TO                        
142500                  DS008K-IMT16-VS-ID                                      
142600             MOVE DS008-IMT16-BUS-PRTNR-ROL-CDE TO                        
142700                  DS008K-IMT16-BUS-PRTNR-ROL-CDE                          
142800                                                                          
142900         WHEN DS009-PROCESS-TABLE = 'TIMCNRL'                             
143000             MOVE IMCNRL-CONTNR-ID              TO                        
143100                  DS008K-IMCNRL-CONTNR-ID                                 
143200             MOVE IMCNRL-CONTNR-SEQ-NBR         TO                        
143300                  DS008K-IMCNRL-CONTNR-SEQ-NBR                            
143400             MOVE IMCNRL-PO-NBR                 TO                        
143500                  DS008K-IMCNRL-PO-NBR                                    
143600                                                                          
143700         WHEN DS009-PROCESS-TABLE = 'TRT_AUD_RUL_CNSTR'                   
143800             MOVE TRT00018-RUL-ID               TO                        
143900                  DS008K-TRT00018-RUL-ID                                  
144000             MOVE TRT00018-RUL-CNSTR-CDE        TO                        
144100                  DS008K-TRT00018-CNSTR-CDE                               
144200             MOVE TRT00018-RUL-CNSTR-TYP-CDE    TO                        
144300                  DS008K-TRT00018-CNSTR-TYP-CDE                           
144400             MOVE TRT00018-CRE-TMST             TO                        
144500                  DS008K-TRT00018-CRE-TMST                                
144600                                                                          
144700         WHEN DS009-PROCESS-TABLE = 'TRT_AUD_RUL'                         
144800             MOVE TRT00017-AUD-CRE-TMST          TO                       
144900                  DS008K-TRT00017-AUD-CRE-TMST                            
145000                                                                          
145100         WHEN DS009-PROCESS-TABLE = 'IMT_LBL'                             
145200             MOVE DS008-IMT00-LBL-SEQ-NBR       TO                        
145300                  DS008K-IMT00-LBL-SEQ-NBR                                
145400                                                                          
145500         WHEN DS009-PROCESS-TABLE = 'WST_SHPMT_XREF_DTL'                  
145600             MOVE WST00002-EXT-SHP-ID   TO                                
145700                                  DS008K-WST00002-EXT-SHP-ID              
145800             MOVE WST00002-PO-NBR       TO                                
145900                                  DS008K-WST00002-PO-NBR                  
146000             MOVE WST00002-PO-LNE-NBR   TO                                
146100                                  DS008K-WST00002-PO-LNE-NBR              
146200             MOVE WST00002-RCVR-SEQ-NBR TO                                
146300                                  DS008K-WST00002-RCVR-SEQ-NBR            
146400             MOVE WST00002-PREPK-ID     TO                                
146500                                  DS008K-WST00002-PREPK-ID                
146600                                                                          
146700         WHEN DS009-PROCESS-TABLE = 'WST_SHPMT_XREF_HDR'                  
146800             MOVE DS008-EXT-SHP-ID TO DS008K-WST00001-EXT-SHP-ID          
146900                                                                          
147000      END-EVALUATE.                                                       
147100/                                                                         
147200*     DO NOT DELETE THIS.  IT IS USED BY DSKUT002                         
147300 DS002-FIND-SEQUENCE.                                                     
147400     SET DS009-SRCH-IDX               TO 1                                
147500     SEARCH DS009-CNTL-RECORDS VARYING DS009-SRCH-IDX                     
147600     AT END                                                               
147700         DISPLAY '*****  PARA DS002-FIND SEQUENCE '                       
147800         DISPLAY '*****  NO CAN FIND ' DS002-NAME                         
147900     WHEN                                                                 
148000         CNTL-TABLE (DS009-SRCH-IDX) = DS002-NAME                         
148100             MOVE DS009-CNTL-SEQ (DS009-SRCH-IDX)                         
148200                                      TO DS002-SEQUENCE                   
148300     END-SEARCH.                                                          
