000100*----------------------------------------------------------------*        
000200*                         DSWS002                                *        
000300*                                                                *        
000400*   THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE *        
000500*   MAINTENANCE PROGRAMS TO PASS THE MESSAGE NUMBER.             *        
000600*                                                                *        
000700*----------------------------------------------------------------*        
000700*      10/06/14 - JIM ARENDT                                     *TRWS001 
000700*               - INCREASED PO-RCVR FROM 12 TO 13                *TRWS001 
000700*----------------------------------------------------------------*        
000800                                                                          
000900 01  DS002-PRINT-SELECT-RECORD.                                           
001000       05  DS002-SELECTED-ITEMS         PIC S9(05)  COMP-3                
001100                                                    VALUE ZERO.           
001200       05  DS002-MAX-ITEMS              PIC  9(02)  VALUE 20.             
001300       05  DS002-SELECTED-ITEM-ARRAY.                                     
001400           10  FILLER                   OCCURS 20 TIMES                   
001500                                        INDEXED BY DS002-IDX.             
001600               15  DS002-ITEM           PIC S9(09)  COMP-3.               
001700               15  DS002-ACTION-SW      PIC  X(01).                       
001800                   88  DS002-INQ                    VALUE 'I'.            
001900                   88  DS002-UPD                    VALUE 'U'.            
002000                   88  DS002-DEL                    VALUE 'D'.            
002100                   88  DS002-ERR                    VALUE 'E'.            
002200               15  DS002-KEY-DATA.                                        
002401                   20  DS002-SCAC              PIC  X(04).                
002403                   20  DS002-TRAILER           PIC  X(10).                
002404                   20  DS002-TRIP-ID           PIC  9(09).                
002405                   20  DS002-NBR-OF-RCVRS      PIC  9(05).                
002406                   20  DS002-STATUS            PIC  X(02).                
002500                   20  DS002-ETA-DATE          PIC  X(10).                
002502                   20  DS002-PO-RCVR           PIC  X(13).                
002503                   20  DS002-TROUBLE-IND       PIC  X(01).                
002506                   20  DS002-PACK-BY-STORE-IND PIC  X(01).                
002509                   20  DS002-DEPT              PIC  X(03).                
002511                   20  DS002-VENDOR            PIC  X(15).                
002513                   20  DS002-ME-HDR-IND        PIC  X(01).                
002515                   20  DS002-ME-IND            PIC  X(01).                
002517                   20  DS002-MOPS-IND          PIC  X(01).                
002519                   20  DS002-HDR-LBL-CNT       PIC  9(02).                
002600                   20  DS002-SMF-CNT           PIC  9(03).                
002700                   20  DS002-PRT-REQ-NBR       PIC S9(09) COMP.           
