000100***************************************************************** 00010008
000200* COBOL DECLARATION FOR TABLE TPURCHS                             00020008
000300***************************************************************** 00030008
000400 01  WS-PURCHS.                                                   00040008
000500     10 WS-PURCHS-PO-NBR              PIC  S9(9) COMP.            00050008
000600     10 WS-PURCHS-VER-NBR             PIC  S9(9) COMP.            00060008
000700     10 WS-PURCHS-VER-STATUS-CDE      PIC   X(1).                 00070008
000800     10 WS-PURCHS-PO-TYP-CDE          PIC   X(2).                 00080008
000900     10 WS-PURCHS-PO-CATEG-CDE        PIC   X(2).                 00090008
001000     10 WS-PURCHS-EDI-IND             PIC   X(1).                 00100008
001100     10 WS-PURCHS-TOT-UNT-QTY         PIC  S9(9) COMP.            00110008
001200     10 WS-PURCHS-TOT-VAL-COST-AMT    PIC  S9(8)V9(2) COMP-3.     00120008
001300     10 WS-PURCHS-TOT-VAL-RTL-AMT     PIC  S9(8)V9(2) COMP-3.     00130008
001400     10 WS-PURCHS-TOT-MU-PCT          PIC  S9(3)V9(2) COMP-3.     00140008
001500     10 WS-PURCHS-TOT-SKUS-QTY        PIC  S9(4) COMP.            00150008
001600     10 WS-PURCHS-IMPRT-AGNT-PO-NBR   PIC  S9(9) COMP.            00160008
001700     10 WS-PURCHS-IMPRT-ORD-OFF-NAME  PIC   X(20).                00170008
001800     10 WS-PURCHS-IMPRT-VEND-NAME     PIC   X(35).                00180008
001900     10 WS-PURCHS-IMPRT-FCTRY-NAME    PIC   X(35).                00190008
002000     10 WS-PURCHS-IMPRT-CNTRY-NAME    PIC   X(20).                00200008
002100     10 WS-PURCHS-VEND-CNTRY-NAME     PIC   X(20).                00210008
002200     10 WS-PURCHS-NEW-STR-PO-IND      PIC   X(1).                 00220008
002300     10 WS-PURCHS-IMPRT-PO-IND        PIC   X(1).                 00230008
002400     10 WS-PURCHS-IMPRT-AGNT-PO-IND   PIC   X(1).                 00240008
002500     10 WS-PURCHS-STATUS-TMST         PIC   X(26).                00250008
002600     10 WS-PURCHS-LAST-UPD-TMST       PIC   X(26).                00260008
002700     10 WS-PURCHS-EDI-REXMIT-IND      PIC   X(1).                 00270008
002800     10 WS-PURCHS-EDI-REXMIT-TMST     PIC   X(26).                00280008
002900     10 WS-PURCHS-DIR-STR-IND         PIC   X(1).                 00290008
003000     10 WS-PURCHS-LAST-UPD-BY-UID     PIC   X(8).                 00300008
003100     10 WS-PURCHS-APP-BY-UID          PIC   X(8).                 00310008
003200     10 WS-PURCHS-OTB-PER-NBR         PIC   X(6).                 00320008
003300     10 WS-PURCHS-DEPT-NBR            PIC   X(3).                 00330008
003400     10 WS-PURCHS-ENT-ID              PIC  S9(9) COMP.            00340008
003500     10 WS-PURCHS-STATUS-CDE          PIC   X(2).                 00350008
003600     10 WS-PURCHS-CRE-BY-UID          PIC   X(8).                 00360008
003700     10 WS-PURCHS-REJ-CT              PIC  S9(4) COMP.            00370008
003800     10 WS-PURCHS-REJ-UID             PIC   X(8).                 00380008
003900     10 WS-PURCHS-ORD-DTE             PIC   X(10).                00390008
004000     10 WS-PURCHS-REVISION-CT         PIC  S9(4) COMP.            00400008
004100     10 WS-PURCHS-ADR-SEQ-NBR         PIC  S9(4) COMP.            00410008
004200     10 WS-PURCHS-DEST-KNOWN-IND      PIC   X(1).                 00420008
004300     10 WS-PURCHS-RLSE-IND            PIC   X(1).                 00430008
004400     10 WS-PURCHS-RLSE-DTE            PIC   X(10).                00440008
004500     10 WS-PURCHS-ANLYS-HOLD-IND      PIC   X(1).                 00450008
004600     10 WS-PURCHS-PLCMNT-CNTRY-CDE    PIC   X(3).                 00460008
004700     10 WS-PURCHS-PROD-CNTRY-CDE      PIC   X(3).                 00470008
004800     10 WS-PURCHS-UNT-PER-CBMT-QTY    PIC  S9(9) COMP.            00480008
004900     10 WS-PURCHS-TKT-FMT-NBR         PIC   X(15).                00490008
005000     10 WS-PURCHS-TKT-FMT-DESC        PIC   X(30).                00500008
005100     10 WS-PURCHS-CRE-TMST            PIC   X(26).                00510008
005200     10 WS-PURCHS-PRG-LAST-ACTVY-DTE  PIC   X(10).                00520008
005300     10 WS-PURCHS-PKGNG-CDE           PIC   X(1).                 00530008
005400     10 WS-PURCHS-SEASET-YR           PIC   X(4).                 00540008
005500     10 WS-PURCHS-SEASET-SHRT-NM      PIC   X(5).                 00550008
005600     10 WS-PURCHS-QTA-CTG-CDE         PIC   X(5).                 00560008
005700     10 WS-PURCHS-PO-IN-RMS-IND       PIC   X(1).                 00570008
005800     10 WS-PURCHS-RMS-PO-UPD-TMST        PIC   X(26).             00580008
005900     10 WS-PURCHS-DUP-SKU-IND            PIC   X(1).              00590008
006000     10 WS-PURCHS-ORIG-PKGNG-CDE         PIC   X(1).              00600008
006100     10 WS-PURCHS-IMPRT-VND-ID           PIC  S9(9) COMP.         00610008
006200     10 WS-PURCHS-IMPRT-FCTRY-ID         PIC  S9(9) COMP.         00620008
006300     10 WS-PURCHS-DERVD-LBL-TYP-CDE      PIC   X(1).              00630008
006400     10 WS-PURCHS-DELY-ID            PIC  S9(10)V COMP-3.         00640008
006500     10 WS-PURCHS-DELY-ID-NULL       PIC  S9(4) COMP.             00650008
006600     10 WS-PURCHS-PO-SHRT-CYC-IND        PIC   X(1).              00660008
006700     10 WS-PURCHS-WHSE-RPLNT-IND         PIC   X(1).              00670008
006800 01  WS-PURCHS-KEYS.                                              00680008
006900     10 DS-PURCHS-PO-NBR              PIC  S9(9) COMP.            00690008
007000     10 DS-PURCHS-VER-NBR             PIC  S9(9) COMP.            00700008
007100***************************************************************** 00710008
007200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  51      00720008
007300***************************************************************** 00730008
007400***************************************************************** 00740008
007500* COBOL DECLARATION FOR TABLE TWS-PURITM                          00750008
007600***************************************************************** 00760008
007700 01  WS-PURITM.                                                   00770008
007800     10 WS-PURITM-PO-NBR              PIC  S9(9) COMP.            00780008
007900     10 WS-PURITM-VER-NBR             PIC  S9(9) COMP.            00790008
008000     10 WS-PURITM-PO-LNE-NBR          PIC  S9(9) COMP.            00800008
008100     10 WS-PURITM-VER-STATUS-CDE      PIC   X(1).                 00810008
008200     10 WS-PURITM-SKU-SEQ-NBR         PIC   X(3).                 00820008
008300     10 WS-PURITM-CL-NBR              PIC   X(2).                 00830008
008400     10 WS-PURITM-VEND-STYL-NAME      PIC   X(20).                00840008
008500     10 WS-PURITM-COLOR-DESC          PIC   X(25).                00850008
008600     10 WS-PURITM-SIZE-DESC           PIC   X(25).                00860008
008700     10 WS-PURITM-UM-IND              PIC   X(2).                 00870008
008800     10 WS-PURITM-UNT-QTY             PIC  S9(9) COMP.            00880008
008900     10 WS-PURITM-UNT-RTL-PR-AMT      PIC  S9(6)V9(2) COMP-3.     00890008
009000     10 WS-PURITM-UNT-COST-AMT        PIC  S9(4)V9(3) COMP-3.     00900008
009100     10 WS-PURITM-TOT-VAL-COST-AMT    PIC  S9(8)V9(2) COMP-3.     00910008
009200     10 WS-PURITM-TOT-VAL-RTL-AMT     PIC  S9(8)V9(2) COMP-3.     00920008
009300     10 WS-PURITM-MU-PCT              PIC  S9(3)V9(2) COMP-3.     00930008
009400     10 WS-PURITM-CRE-TMST            PIC   X(26).                00940008
009500     10 WS-PURITM-LAST-UPD-TMST       PIC   X(26).                00950008
009600     10 WS-PURITM-ITM-NBR             PIC  S9(15)V COMP-3.        00960008
009700     10 WS-PURITM-SKU-DESC            PIC   X(25).                00970008
009800     10 WS-PURITM-COLOR-CDE           PIC   X(4).                 00980008
009900     10 WS-PURITM-SIZE-CDE            PIC   X(5).                 00990008
010000     10 WS-PURITM-AD-EVNT-DTE         PIC   X(10).                01000008
010100     10 WS-PURITM-STATUS-CDE          PIC   X(2).                 01010008
010200     10 WS-PURITM-CRE-BY-UID          PIC   X(8).                 01020008
010300     10 WS-PURITM-LAST-UPD-BY-UID     PIC   X(8).                 01030008
010400     10 WS-PURITM-GP-RTL-AMT          PIC  S9(5)V9(2) COMP-3.     01040008
010500     10 WS-PURITM-GP-QTY              PIC  S9(4) COMP.            01050008
010600     10 WS-PURITM-APP-PO-LNE-NBR      PIC  S9(4) COMP.            01060008
010700     10 WS-PURITM-PIC-ITM-IND         PIC   X(1).                 01070008
010800     10 WS-PURITM-PIC-PG-NBR          PIC  S9(4) COMP.            01080008
010900     10 WS-PURITM-PRD-1ST-COST-AMT    PIC  S9(4)V9(3) COMP-3.     01090008
011000     10 WS-PURITM-STAT-TMST           PIC   X(26).                01100008
011100     10 WS-02-PURITM-PO-PREPK-ID      PIC  S9(4) COMP.            01110008
011200     10 WS-02-PURITM-PREPK-RATO-QTY   PIC  S9(4) COMP.            01120008
011300     10 WS-PURITM-SHIP-TO-TMP-DC-IND  PIC   X(1).                 01130008
011400     10 WS-PURITM-RMS-PO-SKU-NBR      PIC  S9(8)V COMP-3.         01140008
011500     10 WS-PURITM-CNCLD-UNT-QTY       PIC  S9(9) COMP.            01150008
011600     10 WS-PURITM-INNR-PK-QTY         PIC  S9(4) COMP.            01160008
011700     10 WS-PURITM-OUTR-PK-QTY         PIC  S9(4) COMP.            01170008
011800 01  WS-PURITM-KEYS.                                              01180008
011900     10 DS-PURITM-PO-NBR              PIC  S9(9) COMP.            01190008
012000     10 DS-PURITM-VER-NBR             PIC  S9(9) COMP.            01200008
012100     10 DS-PURITM-PO-LNE-NBR          PIC  S9(9) COMP.            01210008
012200***************************************************************** 01220008
012300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  33      01230008
012400***************************************************************** 01240008
012500***************************************************************** 01250008
012600* COBOL DECLARATION FOR TABLE TPOAGMT                             01260008
012700***************************************************************** 01270008
012800 01  WS-POAGMT.                                                   01280008
012900     10 WS-POAGMT-PO-NBR              PIC  S9(9) COMP.            01290008
013000     10 WS-POAGMT-VER-NBR             PIC  S9(9) COMP.            01300008
013100     10 WS-POAGMT-AGRMT-TYP-ID        PIC   X(1).                 01310008
013200     10 WS-POAGMT-SEQ-NBR             PIC  S9(9) COMP.            01320008
013300     10 WS-POAGMT-VER-STATUS-CDE      PIC   X(1).                 01330008
013400     10 WS-POAGMT-TYP-CDE             PIC  S9(4) COMP.            01340008
013500     10 WS-POAGMT-TKT-MKR-IND         PIC   X(1).                 01350008
013600     10 WS-POAGMT-BULK-STK-TKT-IND    PIC   X(1).                 01360008
013700     10 WS-POAGMT-EDI-PROMO-TXT       PIC   X(30).                01370008
013800     10 WS-POAGMT-PO-CAN-DAY-QTY      PIC  S9(4) COMP.            01380008
013900     10 WS-POAGMT-AUTO-PO-CAN-IND     PIC   X(1).                 01390008
014000     10 WS-POAGMT-DISC-DOL-AMT        PIC  S9(6)V9(2) COMP-3.     01400008
014100     10 WS-POAGMT-DISC-PCT            PIC  SV9(4) COMP-3.         01410008
014200     10 WS-POAGMT-DISC-PAY-DAY-QTY    PIC  S9(4) COMP.            01420008
014300     10 WS-POAGMT-LAST-UPD-TMST       PIC   X(26).                01430008
014400     10 WS-POAGMT-PAYT-TERM-ID        PIC  S9(4) COMP.            01440008
014500     10 WS-POAGMT-LAST-UPD-BY-UID     PIC   X(8).                 01450008
014600     10 WS-POAGMT-LEADTIME-DAYS-QTY   PIC  S9(4) COMP.            01460008
014700 01  WS-POAGMT-KEYS.                                              01470008
014800     10 DS-POAGMT-PO-NBR              PIC  S9(9) COMP.            01480008
014900     10 DS-POAGMT-VER-NBR             PIC  S9(9) COMP.            01490008
015000     10 DS-POAGMT-AGRMT-TYP-ID        PIC   X(1).                 01500008
015100     10 DS-POAGMT-SEQ-NBR             PIC  S9(9) COMP.            01510008
015200***************************************************************** 01520008
015300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  18      01530008
015400***************************************************************** 01540008
015500***************************************************************** 01550008
015600* COBOL DECLARATION FOR TABLE TPOINST                             01560008
015700***************************************************************** 01570008
015800 01  WS-POINST.                                                   01580008
015900     10 WS-POINST-PO-NBR              PIC  S9(9) COMP.            01590008
016000     10 WS-POINST-RECIP-CDE           PIC   X(2).                 01600008
016100     10 WS-POINST-INSTR-NBR           PIC  S9(9) COMP.            01610008
016200     10 WS-POINST-CRE-BY-UID          PIC   X(8).                 01620008
016300     10 WS-POINST-CRE-TMST            PIC   X(26).                01630008
016400 01  WS-POINST-KEYS.                                              01640008
016500     10 DS-POINST-PO-NBR              PIC  S9(9) COMP.            01650008
016600     10 DS-POINST-RECIP-CDE           PIC   X(2).                 01660008
016700     10 DS-POINST-INSTR-NBR           PIC  S9(9) COMP.            01670008
016800***************************************************************** 01680008
016900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   5      01690008
017000***************************************************************** 01700008
017100***************************************************************** 01710008
017200* COBOL DECLARATION FOR TABLE TIMPORL                             01720008
017300***************************************************************** 01730008
017400 01  WS-IMPORL.                                                   01740008
017500     10 WS-IMPORL-PO-NBR              PIC  S9(9) COMP.            01750008
017600     10 WS-IMPORL-VER-NBR             PIC  S9(9) COMP.            01760008
017700     10 WS-IMPORL-VER-STATUS-CDE      PIC   X(1).                 01770008
017800     10 WS-IMPORL-CONSLR-RLSE-CDE     PIC   X(1).                 01780008
017900     10 WS-IMPORL-CONSLR-REQR-DTE     PIC   X(10).                01790008
018000     10 WS-IMPORL-CONSLR-ACTL-DTE     PIC   X(10).                01800008
018100     10 WS-IMPORL-CONSLR-ACTL-TM      PIC   X(8).                 01810008
018200     10 WS-IMPORL-CSTM-BKR-RLSE-CDE   PIC   X(1).                 01820008
018300     10 WS-IMPORL-CSTM-BKR-REQR-DTE   PIC   X(10).                01830008
018400     10 WS-IMPORL-CSTM-BKR-ACTL-DTE   PIC   X(10).                01840008
018500     10 WS-IMPORL-CSTM-BKR-ACTL-TM    PIC   X(8).                 01850008
018600     10 WS-IMPORL-TKT-PRTR-RLSE-CDE   PIC   X(1).                 01860008
018700     10 WS-IMPORL-TKT-PRTR-REQR-DTE   PIC   X(10).                01870008
018800     10 WS-IMPORL-TKT-PRTR-ACTL-DTE   PIC   X(10).                01880008
018900     10 WS-IMPORL-TKT-PRTR-ACTL-TM    PIC   X(8).                 01890008
019000     10 WS-IMPORL-DCONSLR-RLSE-CDE    PIC   X(1).                 01900008
019100     10 WS-IMPORL-DCONSLR-REQR-DTE    PIC   X(10).                01910008
019200     10 WS-IMPORL-DCONSLR-ACTL-DTE    PIC   X(10).                01920008
019300     10 WS-IMPORL-DCONSLR-ACTL-TM     PIC   X(8).                 01930008
019400     10 WS-IMPORL-LAST-UPD-TMST       PIC   X(26).                01940008
019500     10 WS-IMPORL-LAST-UPD-BY-UID     PIC   X(8).                 01950008
019600     10 WS-IMPORL-DCONSLR-ENT-ID      PIC  S9(9) COMP.            01960008
019700 01  WS-IMPORL-KEYS.                                              01970008
019800     10 DS-IMPORL-PO-NBR              PIC  S9(9) COMP.            01980008
019900     10 DS-IMPORL-VER-NBR             PIC  S9(9) COMP.            01990008
020000***************************************************************** 02000008
020100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  21      02010008
020200***************************************************************** 02020008
020300***************************************************************** 02030008
020400* COBOL DECLARATION FOR TABLE TALLPLN                             02040008
020500***************************************************************** 02050008
020600 01  WS-ALLPLN.                                                   02060008
020700     10 WS-ALLPLN-PO-NBR              PIC  S9(9) COMP.            02070008
020800     10 WS-ALLPLN-PO-LNE-NBR          PIC  S9(9) COMP.            02080008
020900     10 WS-ALLPLN-PLAN-NBR            PIC  S9(4) COMP.            02090008
021000     10 WS-ALLPLN-CURR-SPLIT-QTY      PIC  S9(9) COMP.            02100008
021100     10 WS-ALLPLN-DEST-NBR            PIC  S9(4) COMP.            02110008
021200     10 WS-ALLPLN-STATUS-CDE          PIC   X(2).                 02120008
021300     10 WS-ALLPLN-DC-SPLIT-QTY        PIC  S9(9) COMP.            02130008
021400     10 WS-ALLPLN-SPLIT-REQ-ID        PIC  S9(9) COMP.            02140008
021500     10 WS-ALLPLN-SPLIT-CRE-DATE      PIC   X(10).                02150008
021600     10 WS-ALLPLN-SPLIT-CRE-ID        PIC   X(8).                 02160008
021700     10 WS-ALLPLN-SPLIT-UPD-DATE      PIC   X(10).                02170008
021800     10 WS-ALLPLN-SPLIT-UPD-ID        PIC   X(8).                 02180008
021900     10 WS-ALLPLN-DISTRO-REQ-ID       PIC  S9(9) COMP.            02190008
022000     10 WS-ALLPLN-DISTRO-CRE-DATE     PIC   X(10).                02200008
022100     10 WS-ALLPLN-DISTRO-CRE-ID       PIC   X(8).                 02210008
022200     10 WS-ALLPLN-DISTRO-KEY-SEQ-NBR  PIC  S9(9) COMP.            02220008
022300     10 WS-ALLPLN-SPLIT-KEY-SEQ-NBR   PIC  S9(9) COMP.            02230008
022400     10 WS-ALLPLN-ALOC-PACK-QTY       PIC  S9(5)V COMP-3.         02240008
022500     10 WS-ALLPLN-PK-SIZE-RND-CDE     PIC   X(1).                 02250008
022600     10 WS-ALLPLN-ALLOC-OUTR-PK-QTY   PIC  S9(5)V COMP-3.         02260008
022700     10 WS-ALLPLN-SHTG-PRRT-OPT-CDE   PIC   X(1).                 02270008
022800     10 WS-ALLPLN-OVRG-PRRT-OPT-CDE   PIC   X(1).                 02280008
022900     10 WS-ALLPLN-EXST-SHTG-THRS-IND  PIC   X(1).                 02290008
023000 01  WS-ALLPLN-KEYS.                                              02300008
023100     10 DS-ALLPLN-PO-NBR              PIC  S9(9) COMP.            02310008
023200     10 DS-ALLPLN-PO-LNE-NBR          PIC  S9(9) COMP.            02320008
023300     10 DS-ALLPLN-PLAN-NBR            PIC  S9(4) COMP.            02330008
023400***************************************************************** 02340008
023500* COBOL DECLARATION FOR TABLE TPLNSHP                             02350008
023600***************************************************************** 02360008
023700 01  WS-PLNSHP.                                                   02370008
023800     10 WS-PLNSHP-SHIPT-NBR           PIC  S9(9) COMP.            02380008
023900     10 WS-PLNSHP-VER-NBR             PIC  S9(9) COMP.            02390008
024000     10 WS-PLNSHP-VER-STATUS-CDE      PIC   X(1).                 02400008
024100     10 WS-PLNSHP-SHIPT-TYP-CDE       PIC   X(2).                 02410008
024200     10 WS-PLNSHP-SHIPT-DEST-NBR      PIC  S9(4) COMP.            02420008
024300     10 WS-PLNSHP-SHIPT-POINT-TXT     PIC   X(20).                02430008
024400     10 WS-PLNSHP-FOB-POINT-TXT       PIC   X(20).                02440008
024500     10 WS-PLNSHP-FRGT-PAYT-CDE       PIC   X(1).                 02450008
024600     10 WS-PLNSHP-VEND-FRGT-PCT       PIC  SV9(4) COMP-3.         02460008
024700     10 WS-PLNSHP-KOHLS-FRGT-PCT      PIC  SV9(4) COMP-3.         02470008
024800     10 WS-PLNSHP-LATE-SHIPT-IND      PIC   X(1).                 02480008
024900     10 WS-PLNSHP-EARLY-SHIPT-IND     PIC   X(1).                 02490008
025000     10 WS-PLNSHP-PARTIAL-SHIPT-IND   PIC   X(1).                 02500008
025100     10 WS-PLNSHP-BCKORDS-PERMTD-IND  PIC   X(1).                 02510008
025200     10 WS-PLNSHP-PORT-ENTR-DESC      PIC   X(20).                02520008
025300     10 WS-PLNSHP-STRT-FCTRY-DTE      PIC   X(10).                02530008
025400     10 WS-PLNSHP-LAST-FCTRY-DTE      PIC   X(10).                02540008
025500     10 WS-PLNSHP-DONT-SHIP-BEF-DTE   PIC   X(10).                02550008
025600     10 WS-PLNSHP-CAN-IFNOT-SHIP-DTE  PIC   X(10).                02560008
025700     10 WS-PLNSHP-EXT-CAN-DTE         PIC   X(10).                02570008
025800     10 WS-PLNSHP-LAST-UPD-TMST       PIC   X(26).                02580008
025900     10 WS-PLNSHP-STATUS-CDE          PIC   X(2).                 02590008
026000     10 WS-PLNSHP-ENT-ID              PIC  S9(9) COMP.            02600008
026100     10 WS-PLNSHP-PO-NBR              PIC  S9(9) COMP.            02610008
026200     10 WS-PLNSHP-LAST-UPD-BY-UID     PIC   X(8).                 02620008
026300     10 WS-PLNSHP-FOB-CDE             PIC   X(3).                 02630008
026400     10 WS-PLNSHP-POE-CDE             PIC   X(3).                 02640008
026500 01  WS-PLNSHP-KEYS.                                              02650008
026600     10 DS-PLNSHP-SHIPT-NBR           PIC  S9(9) COMP.            02660008
026700     10 DS-PLNSHP-VER-NBR             PIC  S9(9) COMP.            02670008
026800***************************************************************** 02680008
026900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  27      02690008
027000***************************************************************** 02700008
027100***************************************************************** 02710008
027200* COBOL DECLARATION FOR TABLE TSK                                 02720008
027300***************************************************************** 02730008
027400 01  WS-SK.                                                       02740008
027500     10 WS-TSK-MERCH-DEPT-NMBR        PIC   X(3).                 02750008
027600     10 WS-TSK-MERCH-CLASS-NMBR       PIC   X(2).                 02760008
027700     10 WS-TSK-SEQ-NMBR               PIC   X(3).                 02770008
027800     10 WS-TSK-CUM-SALES-UNIT-QTY     PIC  S9(7)V COMP-3.         02780008
027900     10 WS-TSK-RTL-UNIT-RCVD-QTY      PIC  S9(7)V COMP-3.         02790008
028000     10 WS-TSK-COST-UNIT-MSRMNT       PIC   X(4).                 02800008
028100     10 WS-TSK-RTL-UNIT-MSRMNT        PIC   X(4).                 02810008
028200     10 WS-TSK-UNIT-COST-AMT          PIC  S9(4)V9(3) COMP-3.     02820008
028300     10 WS-TSK-CUR-UNIT-RTL-AMT       PIC  S9(5)V9(2) COMP-3.     02830008
028400     10 WS-TSK-ORIG-UNIT-RTL-AMT      PIC  S9(5)V9(2) COMP-3.     02840008
028500     10 WS-TSK-VNDR-INNR-PACK-QTY     PIC  S9(5)V COMP-3.         02850008
028600     10 WS-TSK-SHPMT-COUNT-QTY        PIC  S9(3)V COMP-3.         02860008
028700     10 WS-TSK-VENDOR-STYLE-CODE      PIC   X(15).                02870008
028800     10 WS-TSK-STAT-CHNGD-DATE        PIC  S9(7)V COMP-3.         02880008
028900     10 WS-TSK-STATUS-CODE            PIC  S9(3)V COMP-3.         02890008
029000     10 WS-TSK-AUTO-RORD-MTH-CODE     PIC   X(1).                 02900008
029100     10 WS-TSK-RTL-CST-CVRSN-FCTR     PIC  S9(3)V COMP-3.         02910008
029200     10 WS-TSK-SETUP-DATE             PIC  S9(7)V COMP-3.         02920008
029300     10 WS-TSK-PRICE-CHNG-DATE        PIC  S9(7)V COMP-3.         02930008
029400     10 WS-TSK-GROUP-CODE             PIC   X(3).                 02940008
029500     10 WS-TSK-SKU-DESC               PIC   X(25).                02950008
029600     10 WS-TSK-SIZE-DESC              PIC   X(5).                 02960008
029700     10 WS-TSK-COLOR-DESC             PIC   X(4).                 02970008
029800     10 WS-TSK-REORDER-FRMT-CODE      PIC   X(1).                 02980008
029900     10 WS-TSK-MERCH-DIV-CODE         PIC  S9(1)V COMP-3.         02990008
030000     10 WS-TSK-DMM-NMBR               PIC  S9(3)V COMP-3.         03000008
030100     10 WS-TSK-BUYER-NMBR             PIC  S9(3)V COMP-3.         03010008
030200     10 WS-TSK-VENDOR-NMBR            PIC  S9(5)V COMP-3.         03020008
030300     10 WS-TSK-VNDR-IN-HSE-NMBR       PIC  S9(3)V COMP-3.         03030008
030400     10 WS-TSK-MKDN-PGM-CODE          PIC   X(1).                 03040008
030500     10 WS-TSK-LOWST-UNIT-RTL-AMT     PIC  S9(5)V9(2) COMP-3.     03050008
030600     10 WS-TSK-LOW-RTL-PRICE-DATE     PIC  S9(7)V COMP-3.         03060008
030700     10 WS-TSK-ITEM-NMBR              PIC  S9(15)V COMP-3.        03070008
030800     10 WS-TSK-GP-RTL-AMT             PIC  S9(5)V9(2) COMP-3.     03080008
030900     10 WS-TSK-ORIG-GP-QTY            PIC  S9(3)V COMP-3.         03090008
031000     10 WS-TSK-ORIG-GP-RTL-AMT        PIC  S9(5)V9(2) COMP-3.     03100008
031100     10 WS-TSK-FS-RPT-IND             PIC   X(1).                 03110008
031200     10 WS-TSK-GP-QTY                 PIC  S9(3)V COMP-3.         03120008
031300     10 WS-TSK-MULT-PR-PT-IND         PIC   X(1).                 03130008
031400     10 WS-TSK-PLU-DWNLD-EXCL-IND     PIC   X(1).                 03140008
031500     10 WS-TSK-LAST-PO-REV-DTE        PIC   X(10).                03150008
031600     10 WS-TSK-PO-REV-DAY-NBR         PIC  S9(3)V COMP-3.         03160008
031700     10 WS-TSK-PO-REV-SUN-WK-NBR      PIC  S9(1)V COMP-3.         03170008
031800     10 WS-TSK-PO-REV-MON-WK-NBR      PIC  S9(1)V COMP-3.         03180008
031900     10 WS-TSK-PO-REV-TUE-WK-NBR      PIC  S9(1)V COMP-3.         03190008
032000     10 WS-TSK-PO-REV-WED-WK-NBR      PIC  S9(1)V COMP-3.         03200008
032100     10 WS-TSK-PO-REV-THU-WK-NBR      PIC  S9(1)V COMP-3.         03210008
032200     10 WS-TSK-PO-REV-FRI-WK-NBR      PIC  S9(1)V COMP-3.         03220008
032300     10 WS-TSK-PO-REV-SAT-WK-NBR      PIC  S9(1)V COMP-3.         03230008
032400     10 WS-TSK-CENT-STK-CDE           PIC   X(2).                 03240008
032500     10 WS-TSK-MEITGP-NBR             PIC  S9(9) COMP.            03250008
032600     10 WS-TSK-SKU-TYP-CDE            PIC   X(1).                 03260008
032700     10 WS-TSK-VEND-OUTR-PACK-QTY     PIC  S9(5)V COMP-3.         03270008
032800     10 WS-TSK-LONG-VENDOR-STYLE      PIC   X(20).                03280008
032900     10 WS-TSK-SIZE-CDE               PIC   X(5).                 03290008
033000     10 WS-TSK-LONG-SIZE-DESC         PIC   X(20).                03300008
033100     10 WS-TSK-COLOR-CDE              PIC   X(3).                 03310008
033200     10 WS-TSK-LONG-COLOR-DESC        PIC   X(20).                03320008
033300     10 WS-TSK-STICKER-NBR            PIC   X(3).                 03330008
033400     10 WS-TSK-ENT-ID                 PIC  S9(9) COMP.            03340008
033500     10 WS-TSK-TKT-FMT-ID             PIC   X(6).                 03350008
033600     10 WS-TSK-KY-ITM-IND             PIC   X(1).                 03360008
033700     10 WS-TSK-VS-CHARTC-CDE          PIC  S9(4) COMP.            03370008
033800     10 WS-TSK-VS-CHARTC-SEQ-NBR      PIC  S9(4) COMP.            03380008
033900     10 WS-TSK-UNT-COST-1ST-AMT       PIC  S9(7)V9(3) COMP-3.     03390008
034000     10 WS-TSK-REGN-PRIC-IND          PIC   X(1).                 03400008
034100 01  WS-SK-KEYS.                                                  03410008
034200     10 DS-TSK-ITEM-NMBR              PIC  S9(15)V COMP-3.        03420008
034300***************************************************************** 03430008
034400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  66      03440008
034500***************************************************************** 03450008
034600***************************************************************** 03460008
034700* COBOL DECLARATION FOR TABLE TUPCSKU                             03470008
034800***************************************************************** 03480008
034900 01  WS-UPCSKU.                                                   03490008
035000     10 WS-TUPCSKU-UPC-NBR            PIC  S9(15)V COMP-3.        03500008
035100     10 WS-TUPCSKU-ITEM-NBR           PIC  S9(15)V COMP-3.        03510008
035200     10 WS-TUPCSKU-EDI-ORD-IND        PIC   X(1).                 03520008
035300     10 WS-TUPCSKU-PLU-DWNLD-IND      PIC   X(1).                 03530008
035400     10 WS-TUPCSKU-XREF-CRE-DTE       PIC   X(10).                03540008
035500     10 WS-TUPCSKU-UPC-DESC           PIC   X(15).                03550008
035600     10 WS-TUPCSKU-CERT-IND           PIC   X(1).                 03560008
035700     10 WS-TUPCSKU-CERT-DTE           PIC   X(10).                03570008
035800     10 WS-TUPCSKU-UPC-SRC-IND        PIC   X(1).                 03580008
035900     10 WS-TUPCSKU-UMDCLN-IND         PIC   X(1).                 03590008
036000 01  WS-UPCSKU-KEYS.                                              03600008
036100     10 DS-TUPCSKU-UPC-NBR            PIC  S9(15)V COMP-3.        03610008
036200***************************************************************** 03620008
036300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  10      03630008
036400***************************************************************** 03640008
036500***************************************************************** 03650008
036600* COBOL DECLARATION FOR TABLE TUPCPLS                             03660008
036700***************************************************************** 03670008
036800 01  WS-UPCPLS.                                                   03680008
036900     10 WS-UPCPLS-UPC-ID              PIC  S9(9) COMP.            03690008
037000     10 WS-UPCPLS-OPERCO-NBR          PIC   X(2).                 03700008
037100     10 WS-UPCPLS-STR-NBR             PIC  S9(4) COMP.            03710008
037200     10 WS-UPCPLS-EFF-BEG-TMST        PIC   X(26).                03720008
037300     10 WS-UPCPLS-EFF-END-TMST        PIC   X(26).                03730008
037400     10 WS-UPCPLS-EFF-END-TMST-NN     PIC  S9(4) COMP.            03740008
037500     10 WS-UPCPLS-UPC-STAT-CDE        PIC   X(2).                 03750008
037600     10 WS-UPCPLS-UPC-STAT-CDE-NN     PIC  S9(4) COMP.            03760008
037700     10 WS-UPCPLS-UNT-COST-AMT        PIC  S9(7)V9(3) COMP-3.     03770008
037800     10 WS-UPCPLS-UNT-COST-AMT-NN     PIC  S9(4) COMP.            03780008
037900     10 WS-UPCPLS-UNT-RTL-AMT         PIC  S9(7)V9(2) COMP-3.     03790008
038000     10 WS-UPCPLS-UNT-RTL-AMT-NN      PIC  S9(4) COMP.            03800008
038100     10 WS-UPCPLS-MEITGP-NBR          PIC  S9(9) COMP.            03810008
038200     10 WS-UPCPLS-MEITGP-NBR-NN       PIC  S9(4) COMP.            03820008
038300     10 WS-UPCPLS-CRE-BY-USR-ID       PIC   X(8).                 03830008
038400     10 WS-UPCPLS-CRE-TMST            PIC   X(26).                03840008
038500     10 WS-UPCPLS-ITM-NBR             PIC  S9(15)V COMP-3.        03850008
038600     10 WS-UPCPLS-PLU-IND             PIC   X(1).                 03860008
038700     10 WS-UPCPLS-UPC-STAT-CHG-DTE    PIC   X(10).                03870008
038800     10 WS-UPCPLS-UNT-RTL-CHG-DTE     PIC   X(10).                03880008
038900     10 WS-UPCPLS-ORIG-CLR-DTE        PIC   X(10).                03890008
039000     10 WS-UPCPLS-ORIG-CLR-DTE-NN     PIC  S9(4) COMP.            03900008
039100     10 WS-UPCPLS-MKDN-CDE            PIC   X(1).                 03910008
039200     10 WS-UPCPLS-MKDN-CDE-NN         PIC  S9(4) COMP.            03920008
039300 01  WS-UPCPLS-KEYS.                                              03930008
039400     10 DS-UPCPLS-UPC-ID              PIC  S9(15)V COMP-3.        03940008
039500     10 DS-UPCPLS-OPERCO-NBR          PIC   X(2).                 03950008
039600     10 DS-UPCPLS-STR-NBR             PIC  S9(4) COMP.            03960008
039700     10 DS-UPCPLS-EFF-BEG-TMST        PIC   X(26).                03970008
039800***************************************************************** 03980008
039900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  15      03990008
040000***************************************************************** 04000008
040100***************************************************************** 04010008
040200* COBOL DECLARATION FOR TABLE TMDARVS                             04020008
040300***************************************************************** 04030008
040400 01  WS-MDARVS.                                                   04040008
040500     10 WS-MDARVS-SUB-CL-MDSEAR-ID    PIC  S9(6)V COMP-3.         04050008
040600     10 WS-MDARVS-VS-ID               PIC  S9(9) COMP.            04060008
040700     10 WS-MDARVS-ACTV-IND            PIC   X(1).                 04070008
040800     10 WS-MDARVS-VS-DESC             PIC   X(30).                04080008
040900     10 WS-MDARVS-STKR-NBR            PIC  S9(4) COMP.            04090008
041000     10 WS-MDARVS-TKT-TYP-SEQ-NBR     PIC  S9(4) COMP.            04100008
041100     10 WS-MDARVS-LBL-SEQ-NBR         PIC  S9(4) COMP.            04110008
041200     10 WS-MDARVS-HNG-FOLD-SEQ-NBR    PIC  S9(4) COMP.            04120008
041300     10 WS-MDARVS-KY-CLSN-SEQ-NBR     PIC  S9(4) COMP.            04130008
041400     10 WS-MDARVS-FBRCN-SEQ-NBR       PIC  S9(4) COMP.            04140008
041500     10 WS-MDARVS-FNSH-SEQ-NBR        PIC  S9(4) COMP.            04150008
041600     10 WS-MDARVS-RMS-STYL-ID         PIC  S9(8)V COMP-3.         04160008
041700     10 WS-MDARVS-STYL-RECLS-IND      PIC   X(1).                 04170008
041800     10 WS-MDARVS-RTL-CLSN-SEQ-NBR    PIC  S9(4) COMP.            04180008
041900     10 WS-MDARVS-DEPT-NBR            PIC  S9(4)V COMP-3.         04190008
042000     10 WS-MDARVS-MAJ-CL-NBR          PIC  S9(4)V COMP-3.         04200008
042100     10 WS-MDARVS-SUB-CL-NBR          PIC  S9(4)V COMP-3.         04210008
042200     10 WS-MDARVS-ESL-SEQ-NBR         PIC  S9(4) COMP.            04220008
042300     10 WS-MDARVS-RPT-HIER-SEQ-NBR    PIC  S9(4) COMP.            04230008
042400     10 WS-MDARVS-BDY-STYL-SEQ-NBR    PIC  S9(4) COMP.            04240008
042500     10 WS-MDARVS-CONST-SEQ-NBR       PIC  S9(4) COMP.            04250008
042600     10 WS-MDARVS-FUNC-SEQ-NBR        PIC  S9(4) COMP.            04260008
042700     10 WS-MDARVS-GNDR-SEQ-NBR        PIC  S9(4) COMP.            04270008
042800     10 WS-MDARVS-PATRN-SEQ-NBR       PIC  S9(4) COMP.            04280008
042900     10 WS-MDARVS-SLHTT-SEQ-NBR       PIC  S9(4) COMP.            04290008
043000     10 WS-MDARVS-CLLCTN-SEQ-NBR      PIC  S9(4) COMP.            04300008
043100     10 WS-MDARVS-MAP-UNT-RTL-AMT     PIC  S9(7)V9(2) COMP-3.     04310008
043200     10 WS-MDARVS-C-O-ORGN-CDE        PIC   X(3).                 04320008
043300     10 WS-MDARVS-PRIC-TIER-SEQ-NBR   PIC  S9(4) COMP.            04330008
043400     10 WS-MDARVS-LFSTYL-SEQ-NBR      PIC  S9(4) COMP.            04340008
043500     10 WS-MDARVS-CUST-INTFC-DESC     PIC   X(26).                04350008
043600     10 WS-MDARVS-FSHN-PYRMD-SEQ-NBR  PIC  S9(4) COMP.            04360008
043700     10 WS-MDARVS-PRFL-GP-NM-TXT      PIC   X(20).                04370008
043800     10 WS-MDARVS-CTG-SEQ-NBR         PIC  S9(4) COMP.            04380008
043900     10 WS-MDARVS-MAJ-CTG-SEQ-NBR     PIC  S9(4) COMP.            04390008
044000     10 WS-MDARVS-MTRL-SEQ-NBR        PIC  S9(4) COMP.            04400008
044100     10 WS-MDARVS-PRIM-TRND-SEQ-NBR   PIC  S9(4) COMP.            04410008
044200     10 WS-MDARVS-SEC-TRND-SEQ-NBR    PIC  S9(4) COMP.            04420008
044300     10 WS-MDARVS-ATTR-1-SEQ-NBR      PIC  S9(4) COMP.            04430008
044400     10 WS-MDARVS-ATTR-2-SEQ-NBR      PIC  S9(4) COMP.            04440008
044500     10 WS-MDARVS-NW-SLHTT-SEQ-NBR    PIC  S9(4) COMP.            04450008
044600 01  WS-MDARVS-KEYS.                                              04460008
044700     10 DS-MDARVS-SUB-CL-MDSEAR-ID    PIC  S9(6)V COMP-3.         04470008
044800     10 DS-MDARVS-VS-ID               PIC  S9(9) COMP.            04480008
044900***************************************************************** 04490008
045000* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  13      04500008
045100***************************************************************** 04510008
045200***************************************************************** 04520008
045300* COBOL DECLARATION FOR TABLE TSKXREF                             04530008
045400***************************************************************** 04540008
045500 01  WS-SKXREF.                                                   04550008
045600     10 WS-SKXREF-DEPT-NBR            PIC   X(3).                 04560008
045700     10 WS-SKXREF-CL-NBR              PIC   X(2).                 04570008
045800     10 WS-SKXREF-SKU-SEQ-NBR         PIC   X(3).                 04580008
045900     10 WS-SKXREF-SKU-STAT-CDE        PIC   X(2).                 04590008
046000     10 WS-SKXREF-ITM-NBR             PIC  S9(15)V COMP-3.        04600008
046100     10 WS-SKXREF-INTR-UPC-ID         PIC  S9(9) COMP.            04610008
046200     10 WS-SKXREF-DEPT                PIC  S9(4)V COMP-3.         04620008
046300     10 WS-SKXREF-CLASS               PIC  S9(4)V COMP-3.         04630008
046400     10 WS-SKXREF-SUBCLASS            PIC  S9(4)V COMP-3.         04640008
046500     10 WS-SKXREF-SKU                 PIC  S9(8)V COMP-3.         04650008
046600 01  WS-SKXREF-KEYS.                                              04660008
046700     10 DS-SKXREF-ITM-NBR             PIC  S9(15)V COMP-3.        04670008
046800***************************************************************** 04680008
046900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  10      04690008
047000***************************************************************** 04700008
047100***************************************************************** 04710008
047200* COBOL DECLARATION FOR TABLE TVNDSTL                             04720008
047300***************************************************************** 04730008
047400 01  WS-VNDSTL.                                                   04740008
047500     10 WS-VNDSTL-VS-ID               PIC  S9(9) COMP.            04750008
047600     10 WS-VNDSTL-ENT-ID              PIC  S9(9) COMP.            04760008
047700     10 WS-VNDSTL-VS-NBR              PIC   X(20).                04770008
047800     10 WS-VNDSTL-EFF-BEG-DTE         PIC   X(10).                04780008
047900     10 WS-VNDSTL-EFF-BEG-DTE-NN      PIC  S9(4) COMP.            04790008
048000     10 WS-VNDSTL-EFF-END-DTE         PIC   X(10).                04800008
048100     10 WS-VNDSTL-EFF-END-DTE-NN      PIC  S9(4) COMP.            04810008
048200     10 WS-VNDSTL-COST-UM-CDE         PIC   X(2).                 04820008
048300     10 WS-VNDSTL-RTL-UM-CDE          PIC   X(2).                 04830008
048400     10 WS-VNDSTL-MLT-PRIC-PT-IND     PIC   X(1).                 04840008
048500     10 WS-VNDSTL-BYP-CAT-IND         PIC   X(1).                 04850008
048600     10 WS-VNDSTL-SLHTT-SEQ-NBR       PIC  S9(4) COMP.            04860008
048700     10 WS-VNDSTL-CRE-BY-USR-ID       PIC   X(8).                 04870008
048800     10 WS-VNDSTL-LAST-UPD-BY-USR-ID  PIC   X(8).                 04880008
048900     10 WS-VNDSTL-LAST-UPD-TMST       PIC   X(26).                04890008
049000 01  WS-VNDSTL-KEYS.                                              04900008
049100     10 DS-VNDSTL-VS-ID               PIC  S9(9) COMP.            04910008
049200***************************************************************** 04920008
049300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  13      04930008
049400***************************************************************** 04940008
049500***************************************************************** 04950008
049600* COBOL DECLARATION FOR TABLE TVEHICL                             04960008
049700***************************************************************** 04970008
049800 01  WS-VEHICL.                                                   04980008
049900     10 WS-VEHICL-OWNER-SCAC-ID       PIC   X(4).                 04990008
050000     10 WS-VEHICL-VEH-NBR             PIC   X(10).                05000008
050100     10 WS-VEHICL-CRT-SRC-CDE         PIC   X(2).                 05010008
050200     10 WS-VEHICL-LAST-UPD-DTE        PIC   X(10).                05020008
050300     10 WS-VEHICL-LAST-UPD-TME        PIC   X(8).                 05030008
050400     10 WS-VEHICL-LAST-UPD-UID        PIC   X(8).                 05040008
050500     10 WS-VEHICL-USAGE-CDE           PIC   X(3).                 05050008
050600     10 WS-VEHICL-VEH-TYP-CDE         PIC   X(2).                 05060008
050700     10 WS-VEHICL-CURR-STATUS-CDE     PIC   X(2).                 05070008
050800     10 WS-VEHICL-CURR-STATUS-DTE     PIC   X(10).                05080008
050900     10 WS-VEHICL-CURR-STATUS-TME     PIC   X(8).                 05090008
051000     10 WS-VEHICL-CURR-OPER-UNT-ID    PIC  S9(4) COMP.            05100008
051100     10 WS-VEHICL-CURR-FCLTY-ID       PIC  S9(4) COMP.            05110008
051200     10 WS-VEHICL-CURR-FAC-AREA-ID    PIC   X(6).                 05120008
051300     10 WS-VEHICL-CURR-LOC-DTE        PIC   X(10).                05130008
051400     10 WS-VEHICL-CURR-LOC-TME        PIC   X(8).                 05140008
051500     10 WS-VEHICL-CURR-TRIP-ID        PIC  S9(9) COMP.            05150008
051600     10 WS-VEHICL-CURR-TRIP-ID-NN     PIC  S9(4) COMP.            05160008
051700     10 WS-VEHICL-VEH-SIZE-CDE        PIC   X(2).                 05170008
051800 01  WS-VEHICL-KEYS.                                              05180008
051900     10 DS-VEHICL-OWNER-SCAC-ID       PIC   X(4).                 05190008
052000     10 DS-VEHICL-VEH-NBR             PIC   X(10).                05200008
052100***************************************************************** 05210008
052200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  18      05220008
052300***************************************************************** 05230008
052400***************************************************************** 05240008
052500* COBOL DECLARATION FOR TABLE TVHTRIP                             05250008
052600***************************************************************** 05260008
052700 01  WS-VHTRIP.                                                   05270008
052800     10 WS-VHTRIP-OWNER-SCAC-ID       PIC   X(4).                 05280008
052900     10 WS-VHTRIP-VEH-NBR             PIC   X(10).                05290008
053000     10 WS-VHTRIP-VEH-NBR-NN          PIC  S9(4) COMP.            05300008
053100     10 WS-VHTRIP-TRIP-ID             PIC  S9(9) COMP.            05310008
053200     10 WS-VHTRIP-TRIP-BEG-DTE        PIC   X(10).                05320008
053300     10 WS-VHTRIP-TRIP-BEG-TME        PIC   X(8).                 05330008
053400     10 WS-VHTRIP-CRT-SRC-CDE         PIC   X(2).                 05340008
053500     10 WS-VHTRIP-LAST-UPD-DTE        PIC   X(10).                05350008
053600     10 WS-VHTRIP-LAST-UPD-TME        PIC   X(8).                 05360008
053700     10 WS-VHTRIP-LAST-UPD-UID        PIC   X(8).                 05370008
053800     10 WS-VHTRIP-MANIFEST-NBR        PIC   X(15).                05380008
053900     10 WS-VHTRIP-PLND-TRIP-SEQ       PIC  S9(4) COMP.            05390008
054000     10 WS-VHTRIP-PLND-ACTVY-CDE      PIC   X(1).                 05400008
054100     10 WS-VHTRIP-OWNR-SCAC-SHIP-DTE  PIC   X(10).                05410008
054200     10 WS-VHTRIP-REF-TRIP-ID         PIC  S9(9) COMP.            05420008
054300     10 WS-VHTRIP-EST-AR-TMST         PIC   X(26).                05430008
054400     10 WS-VHTRIP-EST-AR-TMST-NN      PIC  S9(4) COMP.            05440008
054500     10 WS-VHTRIP-SPLT-XMIT-IND       PIC   X(1).                 05450008
054600     10 WS-VHTRIP-SPLT-XMIT-DTE       PIC   X(10).                05460008
054700     10 WS-VHTRIP-SPLT-XMIT-TM        PIC   X(8).                 05470008
054800 01  WS-VHTRIP-KEYS.                                              05480008
054900     10 DS-VHTRIP-TRIP-ID             PIC  S9(9) COMP.            05490008
055000***************************************************************** 05500008
055100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  18      05510008
055200***************************************************************** 05520008
055300***************************************************************** 05530008
055400* COBOL DECLARATION FOR TABLE TSHIPMT                             05540008
055500***************************************************************** 05550008
055600 01  WS-SHIPMT.                                                   05560008
055700     10 WS-SHIPMT-TRIP-ID             PIC  S9(9) COMP.            05570008
055800     10 WS-SHIPMT-TRIP-ID-NN          PIC  S9(4) COMP.            05580008
055900     10 WS-SHIPMT-SHIPT-ID            PIC  S9(9) COMP.            05590008
056000     10 WS-SHIPMT-CRT-SRC-CDE         PIC   X(2).                 05600008
056100     10 WS-SHIPMT-LAST-UPD-DTE        PIC   X(10).                05610008
056200     10 WS-SHIPMT-LAST-UPD-TME        PIC   X(8).                 05620008
056300     10 WS-SHIPMT-LAST-UPD-UID        PIC   X(8).                 05630008
056400     10 WS-SHIPMT-PRO-SCAC-ID         PIC   X(4).                 05640008
056500     10 WS-SHIPMT-PRO-NBR             PIC   X(22).                05650008
056600     10 WS-SHIPMT-BOL-NBR             PIC   X(30).                05660008
056700     10 WS-SHIPMT-SHIPPER-NME         PIC   X(20).                05670008
056800     10 WS-SHIPMT-SHIPT-TYP-CDE       PIC  S9(4) COMP.            05680008
056900     10 WS-SHIPMT-EXPTED-GRO-WGHT     PIC  S9(9) COMP.            05690008
057000     10 WS-SHIPMT-PKG-TYP-CDE         PIC   X(3).                 05700008
057100     10 WS-SHIPMT-EXPTED-PKG-QTY      PIC  S9(9) COMP.            05710008
057200     10 WS-SHIPMT-FRGT-CHG-AMT        PIC  S9(5)V9(2) COMP-3.     05720008
057300     10 WS-SHIPMT-FRGT-TERMS-CDE      PIC   X(1).                 05730008
057400     10 WS-SHIPMT-EXPTED-PLT-QTY      PIC  S9(9) COMP.            05740008
057500     10 WS-SHIPMT-VEND-SHIP-DTE       PIC   X(10).                05750008
057600     10 WS-SHIPMT-EST-AR-TMST         PIC   X(26).                05760008
057700     10 WS-SHIPMT-EST-AR-TMST-NN      PIC  S9(4) COMP.            05770008
057800     10 WS-SHIPMT-ORIG-SCAC-ID        PIC   X(4).                 05780008
057900     10 WS-SHIPMT-LAST-UPD-PGM-ID     PIC   X(8).                 05790008
058000     10 WS-SHIPMT-CRE-USER-ID         PIC   X(8).                 05800008
058100     10 WS-SHIPMT-CARR-CART-CT        PIC  S9(9) COMP.            05810008
058200     10 WS-SHIPMT-CARR-LAST-UPD-DTE   PIC   X(10).                05820008
058300     10 WS-SHIPMT-CARR-LAST-UPD-TIME  PIC   X(8).                 05830008
058400     10 WS-SHIPMT-VEND-CART-CT        PIC  S9(9) COMP.            05840008
058500     10 WS-SHIPMT-VEND-LAST-UPD-DTE   PIC   X(10).                05850008
058600     10 WS-SHIPMT-VEND-LAST-UPD-TIME  PIC   X(8).                 05860008
058700     10 WS-SHIPMT-VEH-NBR             PIC   X(10).                05870008
058800     10 WS-SHIPMT-AUTH-NBR            PIC   X(7).                 05880008
058900     10 WS-SHIPMT-AUTH-DTE            PIC   X(10).                05890008
059000     10 WS-SHIPMT-CONFIRM-DTE         PIC   X(10).                05900008
059100     10 WS-SHIPMT-CONFIRM-TIME        PIC   X(8).                 05910008
059200     10 WS-SHIPMT-COMPLETE-PRO-NBR    PIC   X(22).                05920008
059300     10 WS-SHIPMT-COMPLETE-BOL-NBR    PIC   X(30).                05930008
059400     10 WS-SHIPMT-PROCESSED-DTE       PIC   X(10).                05940008
059500     10 WS-SHIPMT-INVC-NBR            PIC   X(15).                05950008
059600     10 WS-SHIPMT-CARR-AUTH-ID        PIC   X(30).                05960008
059700 01  WS-SHIPMT-KEYS.                                              05970008
059800     10 DS-SHIPMT-SHIPT-ID            PIC  S9(9) COMP.            05980008
059900     10 DS-SHIPMT-TRIP-ID             PIC  S9(9) COMP.            05990008
060000     10 DS-SHIPMT-TRIP-ID-NN          PIC  S9(4) COMP.            06000008
060100***************************************************************** 06010008
060200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  37      06020008
060300***************************************************************** 06030008
060400***************************************************************** 06040008
060500* COBOL DECLARATION FOR TABLE TSHPTPO                             06050008
060600***************************************************************** 06060008
060700 01  WS-SHPTPO.                                                   06070008
060800     10 WS-SHPTPO-SHIPT-ID            PIC  S9(9) COMP.            06080008
060900     10 WS-SHPTPO-PO-NBR              PIC  S9(9) COMP.            06090008
061000*    10 WS-SHPTPO-DEPT-NBR            PIC   X(3).                 06100008
061100     10 WS-SHPTPO-REC-SEQ-NBR         PIC  S9(9) COMP.            06110008
061200     10 WS-SHPTPO-EXPTED-CART-CNT     PIC  S9(4) COMP.            06120008
061300     10 WS-SHPTPO-ACTL-CART-CNT       PIC  S9(4) COMP.            06130008
061400     10 WS-SHPTPO-DMG-CART-CNT        PIC  S9(4) COMP.            06140008
061500     10 WS-SHPTPO-PKSL-IND            PIC   X(1).                 06150008
061600     10 WS-SHPTPO-VEND-NAME           PIC   X(30).                06160008
061700     10 WS-SHPTPO-FRGT-CHG-AMT        PIC  S9(7)V9(2) COMP-3.     06170008
061800     10 WS-SHPTPO-LAST-UPD-PGM-ID     PIC   X(8).                 06180008
061900     10 WS-SHPTPO-CRE-USER-ID         PIC   X(8).                 06190008
062000     10 WS-SHPTPO-CARR-CART-CT        PIC  S9(9) COMP.            06200008
062100     10 WS-SHPTPO-CARR-LAST-UPD-DTE   PIC   X(10).                06210008
062200     10 WS-SHPTPO-CARR-LAST-UPD-TIME  PIC   X(8).                 06220008
062300     10 WS-SHPTPO-VEND-CART-CT        PIC  S9(9) COMP.            06230008
062400     10 WS-SHPTPO-VEND-LAST-UPD-DTE   PIC   X(10).                06240008
062500     10 WS-SHPTPO-VEND-LAST-UPD-TIME  PIC   X(8).                 06250008
062600     10 WS-SHPTPO-CRE-TMST            PIC   X(26).                06260008
062700     10 WS-SHPTPO-LAST-UPD-DTE        PIC   X(10).                06270008
062800     10 WS-SHPTPO-LAST-UPD-TIME       PIC   X(8).                 06280008
062900     10 WS-SHPTPO-LAST-UPD-USER-ID    PIC   X(8).                 06290008
063000     10 WS-SHPTPO-PRIM-SHIPT-IND      PIC   X(1).                 06300008
063100     10 WS-SHPTPO-SPLT-XMIT-IND       PIC   X(1).                 06310008
063200     10 WS-SHPTPO-SPLT-XMIT-DTE       PIC   X(10).                06320008
063300     10 WS-SHPTPO-SPLT-XMIT-TM        PIC   X(8).                 06330008
063400 01  WS-SHPTPO-KEYS.                                              06340008
063500     10 DS-SHPTPO-SHIPT-ID            PIC  S9(9) COMP.            06350008
063600     10 DS-SHPTPO-PO-NBR              PIC  S9(9) COMP.            06360008
063700     10 DS-SHPTPO-REC-SEQ-NBR         PIC  S9(9) COMP.            06370008
063800***************************************************************** 06380008
063900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  26      06390008
064000***************************************************************** 06400008
064100***************************************************************** 06410008
064200* COBOL DECLARATION FOR TABLE TPKSLIP                             06420008
064300***************************************************************** 06430008
064400 01  WS-PKSLIP.                                                   06440008
064500     10 WS-PKSLIP-PO-NBR              PIC  S9(9) COMP.            06450008
064600     10 WS-PKSLIP-SEQ-NBR             PIC  S9(4) COMP.            06460008
064700     10 WS-PKSLIP-CRE-TMST            PIC   X(26).                06470008
064800     10 WS-PKSLIP-VER-STAT-CDE        PIC   X(1).                 06480008
064900     10 WS-PKSLIP-OPER-UNT-ID         PIC  S9(4) COMP.            06490008
065000     10 WS-PKSLIP-FCLTY-ID            PIC  S9(4) COMP.            06500008
065100     10 WS-PKSLIP-PKSL-NBR            PIC   X(10).                06510008
065200     10 WS-PKSLIP-STR-DEST-NBR        PIC  S9(4) COMP.            06520008
065300     10 WS-PKSLIP-REC-SEQ-NBR         PIC  S9(9) COMP.            06530008
065400     10 WS-PKSLIP-SHIPT-ID            PIC  S9(9) COMP.            06540008
065500     10 WS-PKSLIP-BOL-NBR             PIC   X(16).                06550008
065600     10 WS-PKSLIP-PRO-NBR             PIC   X(16).                06560008
065700     10 WS-PKSLIP-PKSL-STAT-CDE       PIC   X(2).                 06570008
065800     10 WS-PKSLIP-CRE-UID             PIC   X(8).                 06580008
065900     10 WS-PKSLIP-PO-VER-NBR          PIC  S9(9) COMP.            06590008
066000     10 WS-PKSLIP-CRE-SRC-CDE         PIC   X(4).                 06600008
066100     10 WS-PKSLIP-EXPTED-PKG-QTY      PIC  S9(9) COMP.            06610008
066200     10 WS-PKSLIP-OWNER-SCAC-ID       PIC   X(4).                 06620008
066300     10 WS-PKSLIP-ASN-NBR             PIC   X(30).                06630008
066400     10 WS-PKSLIP-VEND-SHIP-DTE       PIC   X(10).                06640008
066500     10 WS-PKSLIP-PKSL-PG-CNT         PIC  S9(4) COMP.            06650008
066600     10 WS-PKSLIP-CONTNR-ID           PIC   X(12).                06660008
066700     10 WS-PKSLIP-ORIG-PKSL-SEQ-NBR   PIC  S9(4) COMP.            06670008
066800 01  WS-PKSLIP-KEYS.                                              06680008
066900     10 DS-PKSLIP-PO-NBR              PIC  S9(9) COMP.            06690008
067000     10 DS-PKSLIP-SEQ-NBR             PIC  S9(4) COMP.            06700008
067100     10 DS-PKSLIP-CRE-TMST            PIC   X(26).                06710008
067200***************************************************************** 06720008
067300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  22      06730008
067400***************************************************************** 06740008
067500***************************************************************** 06750008
067600* COBOL DECLARATION FOR TABLE TPKITEM                             06760008
067700***************************************************************** 06770008
067800 01  WS-PKITEM.                                                   06780008
067900     10 WS-PKITEM-PO-NBR              PIC  S9(9) COMP.            06790008
068000     10 WS-PKITEM-SEQ-NBR             PIC  S9(4) COMP.            06800008
068100     10 WS-PKITEM-PKSL-LNE-NBR        PIC  S9(9) COMP.            06810008
068200     10 WS-PKITEM-CRE-TMST            PIC   X(26).                06820008
068300     10 WS-PKITEM-VER-STAT-CDE        PIC   X(1).                 06830008
068400     10 WS-PKITEM-PKSL-ITM-QTY        PIC  S9(9) COMP.            06840008
068500     10 WS-PKITEM-CRE-UID             PIC   X(8).                 06850008
068600     10 WS-PKITEM-PURITM-VER-NBR      PIC  S9(9) COMP.            06860008
068700     10 WS-PKITEM-ORIG-PKSL-ITM-QTY   PIC  S9(9) COMP.            06870008
068800 01  WS-PKITEM-KEYS.                                              06880008
068900     10 DS-PKITEM-PO-NBR              PIC  S9(9) COMP.            06890008
069000     10 DS-PKITEM-SEQ-NBR             PIC  S9(4) COMP.            06900008
069100     10 DS-PKITEM-PKSL-LNE-NBR        PIC  S9(9) COMP.            06910008
069200     10 DS-PKITEM-CRE-TMST            PIC   X(26).                06920008
069300***************************************************************** 06930008
069400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   8      06940008
069500***************************************************************** 06950008
069600***************************************************************** 06960008
069700* COBOL DECLARATION FOR TABLE TSHIPST                             06970008
069800***************************************************************** 06980008
069900 01  WS-SHIPST.                                                   06990008
070000     10 WS-SHIPST-SHIPT-ID            PIC  S9(9) COMP.            07000008
070100     10 WS-SHIPST-SHIPT-STATUS-CDE    PIC   X(2).                 07010008
070200     10 WS-SHIPST-STATUS-DTE          PIC   X(10).                07020008
070300     10 WS-SHIPST-STATUS-TME          PIC   X(8).                 07030008
070400     10 WS-SHIPST-STATUS-UID          PIC   X(8).                 07040008
070500     10 WS-SHIPST-DELAY-RSN-CDE       PIC   X(3).                 07050008
070600     10 WS-SHIPST-CARR-STATUS-CDE     PIC   X(2).                 07060008
070700     10 WS-SHIPST-TIME-ZONE-CDE       PIC   X(2).                 07070008
070800     10 WS-SHIPST-CITY-NAME           PIC   X(19).                07080008
070900     10 WS-SHIPST-STATE-CDE           PIC   X(2).                 07090008
071000 01  WS-SHIPST-KEYS.                                              07100008
071100     10 DS-SHIPST-SHIPT-ID            PIC  S9(9) COMP.            07110008
071200     10 DS-SHIPST-SHIPT-STATUS-CDE    PIC   X(2).                 07120008
071300***************************************************************** 07130008
071400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  10      07140008
071500***************************************************************** 07150008
071600***************************************************************** 07160008
071700* COBOL DECLARATION FOR TABLE TTRIPST                             07170008
071800***************************************************************** 07180008
071900 01  WS-TRIPST.                                                   07190008
072000     10 WS-TRIPST-TRIP-ID             PIC  S9(9) COMP.            07200008
072100     10 WS-TRIPST-TRIP-STATUS-CDE     PIC   X(2).                 07210008
072200     10 WS-TRIPST-STATUS-DTE          PIC   X(10).                07220008
072300     10 WS-TRIPST-STATUS-TME          PIC   X(8).                 07230008
072400     10 WS-TRIPST-STATUS-UID          PIC   X(8).                 07240008
072500     10 WS-TRIPST-OPER-UNT-ID         PIC  S9(4) COMP.            07250008
072600     10 WS-TRIPST-FCLTY-ID            PIC  S9(4) COMP.            07260008
072700     10 WS-TRIPST-FCLTY-AREA-ID       PIC   X(6).                 07270008
072800 01  WS-TRIPST-KEYS.                                              07280008
072900     10 DS-TRIPST-TRIP-ID             PIC  S9(9) COMP.            07290008
073000     10 DS-TRIPST-TRIP-STATUS-CDE     PIC   X(2).                 07300008
073100***************************************************************** 07310008
073200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   8      07320008
073300***************************************************************** 07330008
073400***************************************************************** 07340008
073500* COBOL DECLARATION FOR TABLE TRECEIV                             07350008
073600***************************************************************** 07360008
073700 01  WS-RECEIV.                                                   07370008
073800     10 WS-RECEIV-ORD-NBR             PIC  S9(9) COMP.            07380008
073900     10 WS-RECEIV-REC-SEQ-NBR         PIC  S9(9) COMP.            07390008
074000     10 WS-RECEIV-CRE-TMST            PIC   X(26).                07400008
074100     10 WS-RECEIV-CRE-UID             PIC   X(8).                 07410008
074200     10 WS-RECEIV-PO-VER-NBR          PIC  S9(9) COMP.            07420008
074300     10 WS-RECEIV-OPER-UNT-ID         PIC  S9(4) COMP.            07430008
074400     10 WS-RECEIV-FCLTY-ID            PIC  S9(4) COMP.            07440008
074500     10 WS-RECEIV-STATUS-CDE          PIC   X(2).                 07450008
074600     10 WS-RECEIV-SYST-CRE-CDE        PIC   X(1).                 07460008
074700     10 WS-RECEIV-REC-TYP-CDE         PIC   X(2).                 07470008
074800     10 WS-RECEIV-VER-STATUS-CDE      PIC   X(1).                 07480008
074900     10 WS-RECEIV-PACK-BY-ST-IND      PIC   X(1).                 07490008
075000     10 WS-RECEIV-REC-TMST            PIC   X(26).                07500008
075100     10 WS-RECEIV-EXPTED-CART-CNT     PIC  S9(4) COMP.            07510008
075200     10 WS-RECEIV-ACTL-CART-CNT       PIC  S9(4) COMP.            07520008
075300     10 WS-RECEIV-EXPTED-ITM-QTY      PIC  S9(9) COMP.            07530008
075400     10 WS-RECEIV-ACTL-ITM-QTY        PIC  S9(9) COMP.            07540008
075500     10 WS-RECEIV-RCVR-NBR            PIC  S9(9) COMP.            07550008
075600     10 WS-RECEIV-ML-POST-TMST        PIC   X(26).                07560008
075700     10 WS-RECEIV-FS-POST-TMST        PIC   X(26).                07570008
075800     10 WS-RECEIV-PRE-TKT-IND         PIC   X(1).                 07580008
075900     10 WS-RECEIV-AD-INFO-DESC        PIC   X(4).                 07590008
076000     10 WS-RECEIV-IN-TRBL-TMST        PIC   X(26).                07600008
076100     10 WS-RECEIV-IN-TRBL-MIN-CNT     PIC  S9(4) COMP.            07610008
076200     10 WS-RECEIV-IN-TRBL-HOUR-CNT    PIC  S9(4) COMP.            07620008
076300     10 WS-RECEIV-VERFYD-TMST         PIC   X(26).                07630008
076400     10 WS-RECEIV-RCVG-CLERK-INIT-ID  PIC   X(3).                 07640008
076500     10 WS-RECEIV-REFER-BACK-SEQ-NBR  PIC  S9(9) COMP.            07650008
076600     10 WS-RECEIV-AP-PRC-CDE          PIC   X(1).                 07660008
076700     10 WS-RECEIV-AP-PRC-DTE          PIC   X(10).                07670008
076800     10 WS-RECEIV-MIS-DIRECT-IND      PIC   X(1).                 07680008
076900     10 WS-RECEIV-IMPRT-IND           PIC   X(1).                 07690008
077000     10 WS-RECEIV-CRE-OPER-UNT-ID     PIC  S9(4) COMP.            07700008
077100     10 WS-RECEIV-CRE-FCLTY-ID        PIC  S9(4) COMP.            07710008
077200     10 WS-RECEIV-CURR-OPER-UNT-ID    PIC  S9(4) COMP.            07720008
077300     10 WS-RECEIV-CURR-FCLTY-ID       PIC  S9(4) COMP.            07730008
077400     10 WS-RECEIV-UPD-TMST            PIC   X(26).                07740008
077500     10 WS-RECEIV-UPD-UID             PIC   X(8).                 07750008
077600     10 WS-RECEIV-UPD-PGM-ID          PIC   X(8).                 07760008
077700     10 WS-RECEIV-APRON-LOC-DESC      PIC   X(8).                 07770008
077800     10 WS-RECEIV-MKNG-APRN-PRT-TMST  PIC   X(26).                07780008
077900     10 WS-RECEIV-GOH-IND             PIC   X(1).                 07790008
078000     10 WS-RECEIV-VRFD-USR-ID         PIC   X(8).                 07800008
078100     10 WS-RECEIV-AP-RVRSL-IND        PIC   X(1).                 07810008
078200     10 WS-RECEIV-AP-RVRSL-DTE        PIC   X(10).                07820008
078300     10 WS-RECEIV-PKGNG-CDE           PIC   X(1).                 07830008
078400     10 WS-RECEIV-FRE-ASTRA-IND       PIC   X(1).                 07840008
078500 01  WS-RECEIV-KEYS.                                              07850008
078600     10 DS-RECEIV-ORD-NBR             PIC  S9(9) COMP.            07860008
078700     10 DS-RECEIV-REC-SEQ-NBR         PIC  S9(9) COMP.            07870008
078800***************************************************************** 07880008
078900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  45      07890008
079000***************************************************************** 07900008
079100***************************************************************** 07910008
079200* COBOL DECLARATION FOR TABLE TRECITM                             07920008
079300***************************************************************** 07930008
079400 01  WS-RECITM.                                                   07940008
079500     10 WS-RECITM-ORD-NBR             PIC  S9(9) COMP.            07950008
079600     10 WS-RECITM-ORD-LNE-NBR         PIC  S9(9) COMP.            07960008
079700     10 WS-RECITM-REC-SEQ-NBR         PIC  S9(9) COMP.            07970008
079800     10 WS-RECITM-OPER-UNT-ID         PIC  S9(4) COMP.            07980008
079900     10 WS-RECITM-FCLTY-ID            PIC  S9(4) COMP.            07990008
080000     10 WS-RECITM-CRE-TMST            PIC   X(26).                08000008
080100     10 WS-RECITM-CRE-UID             PIC   X(8).                 08010008
080200     10 WS-RECITM-PO-VER-NBR          PIC  S9(9) COMP.            08020008
080300     10 WS-RECITM-ITM-NBR             PIC  S9(15)V COMP-3.        08030008
080400     10 WS-RECITM-PRE-TKT-IND         PIC   X(1).                 08040008
080500     10 WS-RECITM-TKT-FMT-ID          PIC   X(6).                 08050008
080600     10 WS-RECITM-RTV-IND             PIC   X(1).                 08060008
080700     10 WS-RECITM-STATUS-CDE          PIC   X(2).                 08070008
080800     10 WS-RECITM-VER-STATUS-CDE      PIC   X(1).                 08080008
080900     10 WS-RECITM-PKSL-ITM-QTY        PIC  S9(9) COMP.            08090008
081000     10 WS-RECITM-DTL-CK-ITM-QTY      PIC  S9(9) COMP.            08100008
081100     10 WS-RECITM-INNR-PACK-QTY       PIC  S9(4) COMP.            08110008
081200     10 WS-RECITM-CASE-PACK-QTY       PIC  S9(4) COMP.            08120008
081300     10 WS-RECITM-RTV-QTY             PIC  S9(9) COMP.            08130008
081400     10 WS-RECITM-EXPTED-CART-CNT     PIC  S9(9) COMP.            08140008
081500     10 WS-RECITM-ACTL-CART-CNT       PIC  S9(9) COMP.            08150008
081600     10 WS-RECITM-MKING-APRON-TMST    PIC   X(26).                08160008
081700     10 WS-RECITM-UNT-COST-AMT        PIC  S9(4)V9(3) COMP-3.     08170008
081800     10 WS-RECITM-COLOR-DESC          PIC   X(25).                08180008
081900     10 WS-RECITM-SIZE-DESC           PIC   X(25).                08190008
082000     10 WS-RECITM-VEND-STYL-NAME      PIC   X(20).                08200008
082100     10 WS-RECITM-VEND-DESC           PIC   X(25).                08210008
082200     10 WS-RECITM-VERFYD-TMST         PIC   X(26).                08220008
082300     10 WS-RECITM-PKSL-NBR            PIC   X(10).                08230008
082400     10 WS-RECITM-REC-INV-LNE-NBR     PIC  S9(3)V COMP-3.         08240008
082500     10 WS-RECITM-DMG-ITM-QTY         PIC  S9(9) COMP.            08250008
082600     10 WS-RECITM-UPD-TMST            PIC   X(26).                08260008
082700     10 WS-RECITM-UPD-UID             PIC   X(8).                 08270008
082800     10 WS-RECITM-UPD-PGM-ID          PIC   X(8).                 08280008
082900     10 WS-RECITM-RCPT-DISTR-UPD-CDE  PIC   X(1).                 08290008
083000     10 WS-RECITM-VRFD-USR-ID         PIC   X(8).                 08300008
083100     10 WS-RECITM-LAST-TRSCP-TMST     PIC   X(26).                08310008
083200     10 WS-RECITM-LAST-TRSCP-USR-ID   PIC   X(8).                 08320008
083300     10 WS-RECITM-PREPK-ID            PIC  S9(4) COMP.            08330008
083400     10 WS-RECITM-PREPK-RATO-QTY      PIC  S9(4) COMP.            08340008
083500     10 WS-RECITM-PREPK-ODD-UNT-QTY   PIC  S9(4) COMP.            08350008
083600     10 WS-RECITM-PREPK-DRV-LNE-CDE   PIC   X(1).                 08360008
083700     10 WS-RECITM-UNT-RTL-AMT         PIC S9(7)V9(2) COMP-3.      08370008
083800     10 WS-RECITM-GP-RTL-AMT          PIC S9(7)V9(2) COMP-3.      08380008
083900     10 WS-RECITM-GP-QTY              PIC S9(4) COMP.             08390008
084000     10 WS-RECITM-ORIG-PKSL-ITM-QTY   PIC S9(9) COMP.             08400008
084100 01  WS-RECITM-KEYS.                                              08410008
084200     10 DS-RECITM-ORD-NBR             PIC  S9(9) COMP.            08420008
084300     10 DS-RECITM-ORD-LNE-NBR         PIC  S9(9) COMP.            08430008
084400     10 DS-RECITM-REC-SEQ-NBR         PIC  S9(9) COMP.            08440008
084500     10 DS-RECITM-OPER-UNT-ID         PIC  S9(4) COMP.            08450008
084600     10 DS-RECITM-FCLTY-ID            PIC  S9(4) COMP.            08460008
084700***************************************************************** 08470008
084800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  38      08480008
084900***************************************************************** 08490008
085000***************************************************************** 08500008
085100* COBOL DECLARATION FOR TABLE TRECDIS                             08510008
085200***************************************************************** 08520008
085300 01  WS-RECDIS.                                                   08530008
085400     10 WS-RECDIS-ORD-NBR             PIC  S9(9) COMP.            08540008
085500     10 WS-RECDIS-ORD-LNE-NBR         PIC  S9(9) COMP.            08550008
085600     10 WS-RECDIS-REC-SEQ-NBR         PIC  S9(9) COMP.            08560008
085700     10 WS-RECDIS-OPER-UNT-ID         PIC  S9(4) COMP.            08570008
085800     10 WS-RECDIS-FCLTY-ID            PIC  S9(4) COMP.            08580008
085900     10 WS-RECDIS-CRE-TMST            PIC   X(26).                08590008
086000     10 WS-RECDIS-CRE-UID             PIC   X(8).                 08600008
086100     10 WS-RECDIS-VER-STATUS-CDE      PIC   X(1).                 08610008
086200     10 WS-RECDIS-EXPTED-ITM-QTY      PIC  S9(9) COMP.            08620008
086300     10 WS-RECDIS-VERIFY-ITM-QTY      PIC  S9(9) COMP.            08630008
086400     10 WS-RECDIS-AP-VERIFY-ITM-QTY   PIC  S9(9) COMP.            08640008
086500     10 WS-RECDIS-STR-NBR             PIC  S9(4) COMP.            08650008
086600     10 WS-RECDIS-STR-FCLTY-ID        PIC  S9(4) COMP.            08660008
086700     10 WS-RECDIS-PLAN-ITM-QTY        PIC  S9(4) COMP.            08670008
086800     10 WS-RECDIS-AP-PRC-CDE          PIC   X(1).                 08680008
086900     10 WS-RECDIS-AP-PRC-DTE          PIC   X(10).                08690008
087000 01  WS-RECDIS-KEYS.                                              08700008
087100     10 DS-RECDIS-ORD-NBR             PIC  S9(9) COMP.            08710008
087200     10 DS-RECDIS-ORD-LNE-NBR         PIC  S9(9) COMP.            08720008
087300     10 DS-RECDIS-REC-SEQ-NBR         PIC  S9(9) COMP.            08730008
087400     10 DS-RECDIS-OPER-UNT-ID         PIC  S9(4) COMP.            08740008
087500     10 DS-RECDIS-FCLTY-ID            PIC  S9(4) COMP.            08750008
087600     10 DS-RECDIS-STR-NBR             PIC  S9(4) COMP.            08760008
087700     10 DS-RECDIS-STR-FCLTY-ID        PIC  S9(4) COMP.            08770008
087800***************************************************************** 08780008
087900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  16      08790008
088000***************************************************************** 08800008
088100******************************************************************08810008
088200* COBOL DECLARATION FOR TABLE TSHUNLO                             08820008
088300******************************************************************08830008
088400 01  WS-SHUNLO.                                                   08840008
088500     10 WS-SHUNLO-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.     08850008
088600     10 WS-SHUNLO-OPER-UNT-ID            PIC  S9(4) COMP.         08860008
088700     10 WS-SHUNLO-FCLTY-ID               PIC  S9(4) COMP.         08870008
088800     10 WS-SHUNLO-SCN-LOC-ID             PIC   X(4).              08880008
088900     10 WS-SHUNLO-CRE-USR-ID             PIC   X(8).              08890008
089000     10 WS-SHUNLO-CRE-TMST               PIC   X(26).             08900008
089100     10 WS-SHUNLO-TRIP-ID                PIC  S9(9) COMP.         08910008
089200     10 WS-SHUNLO-PRTR-TYP-CDE           PIC   X(1).              08920008
089300     10 WS-SHUNLO-LBL-PRT-BTCH-ID        PIC  S9(4) COMP.         08930008
089400     10 WS-SHUNLO-ACTV-CDE               PIC   X(1).              08940008
089500 01  WS-SHUNLO-KEYS.                                              08950008
089600     10 DS-SHUNLO-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.     08960008
089700******************************************************************08970008
089800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   9     *08980008
089900******************************************************************08990008
090000***************************************************************** 09000008
090100* COBOL DECLARATION FOR TABLE TSHUUPC                             09010008
090200***************************************************************** 09020008
090300 01  WS-SHUUPC.                                                   09030008
090400     10 WS-SHUUPC-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.        09040008
090500     10 WS-SHUUPC-TRN-NBR             PIC  S9(9) COMP.            09050008
090600     10 WS-SHUUPC-TRN-LNE-NBR         PIC  S9(9) COMP.            09060008
090700     10 WS-SHUUPC-TRN-TYP-CDE         PIC   X(2).                 09070008
090800     10 WS-SHUUPC-UPC-NBR             PIC  S9(15)V COMP-3.        09080008
090900     10 WS-SHUUPC-SHPD-QTY            PIC  S9(9)V COMP-3.         09090008
091000     10 WS-SHUUPC-RCVR-SEQ-NBR           PIC  S9(9) COMP.         09100008
091100 01  WS-SHUUPC-KEYS.                                              09110008
091200     10 DS-SHUUPC-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.        09120008
091300     10 DS-SHUUPC-TRN-NBR             PIC  S9(9) COMP.            09130008
091400     10 DS-SHUUPC-TRN-LNE-NBR         PIC  S9(9) COMP.            09140008
091500     10 DS-SHUUPC-TRN-TYP-CDE         PIC   X(2).                 09150008
091600     10 DS-SHUUPC-UPC-NBR             PIC  S9(15)V COMP-3.        09160008
091700***************************************************************** 09170008
091800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   6      09180008
091900***************************************************************** 09190008
092000***************************************************************** 09200008
092100* COBOL DECLARATION FOR TABLE TSHPUNT                             09210008
092200***************************************************************** 09220008
092300 01  WS-SHPUNT.                                                   09230008
092400     10 WS-SHPUNT-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.        09240008
092500     10 WS-SHPUNT-ORGN-OPER-UNT-ID    PIC  S9(4) COMP.            09250008
092600     10 WS-SHPUNT-ORGN-FCLTY-ID       PIC  S9(4) COMP.            09260008
092700     10 WS-SHPUNT-DEST-OPER-UNT-ID    PIC  S9(4) COMP.            09270008
092800     10 WS-SHPUNT-DEST-FCLTY-ID       PIC  S9(4) COMP.            09280008
092900     10 WS-SHPUNT-SHIPT-UNT-SRC-ID    PIC   X(3).                 09290008
093000     10 WS-SHPUNT-HIER-LVL-CDE        PIC   X(1).                 09300008
093100     10 WS-SHPUNT-NEXT-SHIPT-UNT-ID   PIC  S9(18)V COMP-3.        09310008
093200     10 WS-SHPUNT-ORIG-SHIPT-UNT-ID   PIC  S9(18)V COMP-3.        09320008
093300     10 WS-SHPUNT-ACTV-IND            PIC   X(1).                 09330008
093400     10 WS-SHPUNT-CRE-DTE             PIC   X(10).                09340008
093500     10 WS-SHPUNT-CRE-TM              PIC   X(8).                 09350008
093600     10 WS-SHPUNT-CRE-USR-ID          PIC   X(8).                 09360008
093700     10 WS-SHPUNT-CRE-PGM-NM          PIC   X(8).                 09370008
093800 01  WS-SHPUNT-KEYS.                                              09380008
093900     10 DS-SHPUNT-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.        09390008
094000***************************************************************** 09400008
094100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  14      09410008
094200***************************************************************** 09420008
094300***************************************************************** 09430008
094400* COBOL DECLARATION FOR TABLE TINPKSU                             09440008
094500***************************************************************** 09450008
094600 01  WS-INPKSU.                                                   09460008
094700     10 WS-INPKSU-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.        09470008
094800     10 WS-INPKSU-PO-NBR              PIC  S9(9) COMP.            09480008
094900     10 WS-INPKSU-SEQ-NBR             PIC  S9(4) COMP.            09490008
095000     10 WS-INPKSU-PKSL-SEQ-NBR        PIC  S9(4) COMP.            09500008
095100 01  WS-INPKSU-KEYS.                                              09510008
095200     10 DS-INPKSU-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.        09520008
095300***************************************************************** 09530008
095400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   3      09540008
095500***************************************************************** 09550008
095600***************************************************************** 09560008
095700* COBOL DECLARATION FOR TABLE TIMCNTK       49 COLUMNS            09570008
095800***************************************************************** 09580008
095900 01  WS-IMCNTK.                                                   09590008
096000     10 WS-IMCNTK-CONTNR-ID           PIC   X(12).                09600008
096100     10 WS-IMCNTK-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            09610008
096200     10 WS-IMCNTK-CONSLR-SCAC-ID      PIC   X(4).                 09620008
096300     10 WS-IMCNTK-MOM-IMPRT-TRIP-ID   PIC   X(10).                09630008
096400     10 WS-IMCNTK-MOM-DPRTR-TMST      PIC   X(26).                09640008
096500     10 WS-IMCNTK-MOM-POE-DELY-TMST   PIC   X(26).                09650008
096600     10 WS-IMCNTK-MOM-CARR-SCAC-ID    PIC   X(4).                 09660008
096700     10 WS-IMCNTK-MOM-FOB-CDE         PIC   X(5).                 09670008
096800     10 WS-IMCNTK-MOM-IMPRT-VEH-NM    PIC   X(25).                09680008
096900     10 WS-IMCNTK-MOM-TRIP-TYP-CDE    PIC   X(1).                 09690008
097000     10 WS-IMCNTK-MOM-DEST-POE-CDE    PIC   X(4).                 09700008
097100     10 WS-IMCNTK-FDR-IMPRT-TRIP-ID   PIC   X(10).                09710008
097200     10 WS-IMCNTK-FDR-DPRTR-TMST      PIC   X(26).                09720008
097300     10 WS-IMCNTK-FDR-POE-DELY-TMST   PIC   X(26).                09730008
097400     10 WS-IMCNTK-FDR-CARR-SCAC-ID    PIC   X(4).                 09740008
097500     10 WS-IMCNTK-FDR-FOB-CDE         PIC   X(5).                 09750008
097600     10 WS-IMCNTK-FDR-IMPRT-VEH-NM    PIC   X(25).                09760008
097700     10 WS-IMCNTK-FDR-TRIP-TYP-CDE    PIC   X(1).                 09770008
097800     10 WS-IMCNTK-FDR-DEST-POE-CDE    PIC   X(4).                 09780008
097900     10 WS-IMCNTK-SIZE-CDE            PIC   X(5).                 09790008
098000     10 WS-IMCNTK-CART-CNT            PIC  S9(9) COMP.            09800008
098100     10 WS-IMCNTK-CBMT-QTY            PIC  S9(9)V9(2) COMP-3.     09810008
098200     10 WS-IMCNTK-WT-KGRM-QTY         PIC  S9(9) COMP.            09820008
098300     10 WS-IMCNTK-UNT-QTY             PIC  S9(9) COMP.            09830008
098400     10 WS-IMCNTK-ORGN-SHPD-FR-CDE    PIC   X(3).                 09840008
098500     10 WS-IMCNTK-ORGN-SHPD-TO-CDE    PIC   X(3).                 09850008
098600     10 WS-IMCNTK-EST-LBD-NM          PIC   X(30).                09860008
098700     10 WS-IMCNTK-EST-LBD-TMST        PIC   X(26).                09870008
098800     10 WS-IMCNTK-RISU-DO-RSN-CDE     PIC   X(3).                 09880008
098900     10 WS-IMCNTK-BKR-FRGT-RLSE-TMST  PIC   X(26).                09890008
099000     10 WS-IMCNTK-DO-TO-DCONSLR-TMST  PIC   X(26).                09900008
099100     10 WS-IMCNTK-DO-RCVD-TMST        PIC   X(26).                09910008
099200     10 WS-IMCNTK-CONTNR-PU-TMST      PIC   X(26).                09920008
099300     10 WS-IMCNTK-DAT-SRC-ENT-ID      PIC  S9(9) COMP.            09930008
099400     10 WS-IMCNTK-CRE-BY-USR-ID       PIC   X(8).                 09940008
099500     10 WS-IMCNTK-CRE-TMST            PIC   X(26).                09950008
099600     10 WS-IMCNTK-LAST-UPD-BY-USR-ID  PIC   X(8).                 09960008
099700     10 WS-IMCNTK-LAST-UPD-TMST       PIC   X(26).                09970008
099800     10 WS-IMCNTK-ACTL-POE-DELY-TMST  PIC   X(26).                09980008
099900     10 WS-IMCNTK-ACTL-DEST-POE-CDE   PIC   X(4).                 09990008
100000     10 WS-IMCNTK-ACTL-LBD-NM         PIC   X(30).                10000008
100100     10 WS-IMCNTK-ACTL-LBD-TMST       PIC   X(26).                10010008
100200     10 WS-02-IMCNTK-DVN-TMST         PIC   X(26).                10020008
100300     10 WS-02-IMCNTK-DCONSLR-SCAC-ID  PIC   X(4).                 10030008
100400     10 WS-IMCNTK-DCONSLR-RET-TMST    PIC   X(26).                10040008
100500     10 WS-IMCNTK-MOM-POL-CDE         PIC   X(05).                10050008
100600     10 WS-IMCNTK-FDR-POL-CDE         PIC   X(05).                10060008
100700     10 WS-IMCNTK-MOM-POR-CDE         PIC   X(05).                10070008
100800     10 WS-IMCNTK-FDR-POR-CDE         PIC   X(05).                10080008
100900     10 WS-IMCNTK-DCONSLR-DELY-TMST   PIC   X(26).                10090008
101000 01  WS-IMCNTK-KEYS.                                              10100008
101100     10 DS-IMCNTK-CONTNR-ID           PIC   X(12).                10110008
101200     10 DS-IMCNTK-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            10120008
101300***************************************************************** 10130008
101400* COBOL DECLARATION FOR TABLE TIMCNPO       19 COLUMNS            10140008
101500***************************************************************** 10150008
101600 01  WS-IMCNPO.                                                   10160008
101700     10 WS-IMCNPO-CONTNR-ID           PIC   X(12).                10170008
101800     10 WS-IMCNPO-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            10180008
101900     10 WS-IMCNPO-PO-NBR              PIC  S9(9) COMP.            10190008
102000     10 WS-IMCNPO-CSTM-ENTR-ID        PIC   X(12).                10200008
102100     10 WS-IMCNPO-MSTR-BOL-NBR        PIC   X(30).                10210008
102200     10 WS-IMCNPO-HSE-BOL-NBR         PIC   X(30).                10220008
102300     10 WS-IMCNPO-LTR-OF-CR-NBR       PIC   X(15).                10230008
102400     10 WS-IMCNPO-PO-RCVD-DELY-TMST   PIC   X(26).                10240008
102500     10 WS-IMCNPO-PO-C-O-PROD-CDE     PIC   X(3).                 10250008
102600     10 WS-IMCNPO-PO-CART-CNT         PIC  S9(4) COMP.            10260008
102700     10 WS-IMCNPO-PO-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.     10270008
102800     10 WS-IMCNPO-PO-WT-KGRM-QTY      PIC  S9(9) COMP.            10280008
102900     10 WS-IMCNPO-PO-UNT-QTY          PIC  S9(9) COMP.            10290008
103000     10 WS-IMCNPO-CRE-BY-USR-ID       PIC   X(8).                 10300008
103100     10 WS-IMCNPO-CRE-TMST            PIC   X(26).                10310008
103200     10 WS-IMCNPO-LAST-UPD-BY-USR-ID  PIC   X(8).                 10320008
103300     10 WS-IMCNPO-LAST-UPD-TMST       PIC   X(26).                10330008
103400     10 WS-IMCNPO-EXTL-REF-NBR        PIC   X(15).                10340008
103500     10 WS-IMCNPO-BKR-FRGT-RLSE-CDE   PIC   X(1).                 10350008
103600     10 WS-IMCNPO-DO-RCVD-CDE         PIC   X(1).                 10360008
103700     10 WS-IMCNPO-CONTNR-PU-CDE       PIC   X(1).                 10370008
103800     10 WS-IMCNPO-ACTL-POE-DELY-CDE   PIC   X(1).                 10380008
103900     10 WS-IMCNPO-DVN-CDE             PIC   X(1).                 10390008
104000     10 WS-IMCNPO-DCONSLR-RET-CDE     PIC   X(1).                 10400008
104100     10 WS-IMCNPO-SPLT-XMIT-CDE       PIC   X(1).                 10410008
104200     10 WS-IMCNPO-DOC-RCVD-ORGN-TMST  PIC   X(26).                10420008
104300     10 WS-IMCNPO-DCONSLR-DELY-CDE    PIC   X(1).                 10430008
104400 01  WS-IMCNPO-KEYS.                                              10440008
104500     10 DS-IMCNPO-CONTNR-ID           PIC   X(12).                10450008
104600     10 DS-IMCNPO-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            10460008
104700     10 DS-IMCNPO-PO-NBR              PIC  S9(9) COMP.            10470008
104800***************************************************************** 10480008
104900* COBOL DECLARATION FOR TABLE TIMCNUP       18 COLUMNS            10490008
105000***************************************************************** 10500008
105100 01  WS-IMCNUP.                                                   10510008
105200     10 WS-IMCNUP-CONTNR-ID           PIC   X(12).                10520008
105300     10 WS-IMCNUP-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            10530008
105400     10 WS-IMCNUP-PO-NBR              PIC  S9(9) COMP.            10540008
105500     10 WS-IMCNUP-VS-NBR              PIC   X(30).                10550008
105600     10 WS-IMCNUP-UPC-NBR             PIC  S9(15)V COMP-3.        10560008
105700     10 WS-IMCNUP-PO-LNE-NBR          PIC  S9(9) COMP.            10570008
105800     10 WS-IMCNUP-UPC-CART-CNT        PIC  S9(9) COMP.            10580008
105900     10 WS-IMCNUP-UPC-CBMT-QTY        PIC  S9(7)V9(2) COMP-3.     10590008
106000     10 WS-IMCNUP-UPC-WT-KGRM-QTY     PIC  S9(9) COMP.            10600008
106100     10 WS-IMCNUP-UPC-UNT-QTY         PIC  S9(9) COMP.            10610008
106200     10 WS-IMCNUP-CRE-BY-USR-ID       PIC   X(8).                 10620008
106300     10 WS-IMCNUP-CRE-TMST            PIC   X(26).                10630008
106400     10 WS-IMCNUP-LAST-UPD-BY-USR-ID  PIC   X(8).                 10640008
106500     10 WS-IMCNUP-LAST-UPD-TMST       PIC   X(26).                10650008
106600     10 WS-IMCNUP-SKU-NBR             PIC  S9(8)V COMP-3.         10660008
106700     10 WS-IMCNUP-ASN-PKGNG-CDE       PIC   X(2).                 10670008
106800 01  WS-IMCNUP-KEYS.                                              10680008
106900     10 DS-IMCNUP-CONTNR-ID           PIC   X(12).                10690008
107000     10 DS-IMCNUP-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            10700008
107100     10 DS-IMCNUP-PO-NBR              PIC  S9(9) COMP.            10710008
107200*    10 DS-IMCNUP-VS-NBR              PIC   X(30).                10720008
107300     10 DS-IMCNUP-UPC-NBR             PIC  S9(15)V COMP-3.        10730008
107400     10 DS-IMCNUP-PO-LNE-NBR          PIC  S9(9) COMP.            10740008
107500***************************************************************** 10750008
107600* COBOL DECLARATION FOR TABLE TRT_IMPRT_CART     10 COLUMNS       10760008
107700***************************************************************** 10770008
107800 01  WS-TRT00008.                                                 10780008
107900     10 WS-TRT00008-CONTNR-ID         PIC   X(12).                10790008
108000     10 WS-TRT00008-CONTNR-SEQ-NBR    PIC  S9(4) COMP.            10800008
108100     10 WS-TRT00008-PO-NBR            PIC  S9(9) COMP.            10810008
108200     10 WS-TRT00008-UPC-NBR           PIC  S9(15)V COMP-3.        10820008
108300     10 WS-TRT00008-SSCC-ID           PIC   X(48).                10830008
108400     10 WS-TRT00008-CRE-BY-USR-ID     PIC   X(8).                 10840008
108500     10 WS-TRT00008-CRE-TMST          PIC   X(26).                10850008
108600     10 WS-TRT00008-UNT-QTY           PIC  S9(9) COMP.            10860008
108700     10 WS-TRT00008-LAST-UPD-BY-USR-ID  PIC   X(8).               10870008
108800     10 WS-TRT00008-LAST-UPD-TMST     PIC   X(26).                10880008
108900 01  WS-TRT00008-KEYS.                                            10890008
109000     10 DS-TRT00008-CONTNR-ID         PIC   X(12).                10900008
109100     10 DS-TRT00008-CONTNR-SEQ-NBR    PIC  S9(4) COMP.            10910008
109200     10 DS-TRT00008-PO-NBR            PIC  S9(9) COMP.            10920008
109300     10 DS-TRT00008-UPC-NBR           PIC  S9(15)V COMP-3.        10930008
109400     10 DS-TRT00008-SSCC-ID           PIC   X(48).                10940008
109500***************************************************************** 10950008
109600* COBOL DECLARATION FOR TABLE TRT_AUD_IMPRT_CART     10 COLUMNS   10960008
109700***************************************************************** 10970008
109800 01  WS-TRT00009.                                                 10980008
109900     10 WS-TRT00009-CONTNR-ID         PIC   X(12).                10990008
110000     10 WS-TRT00009-CONTNR-SEQ-NBR    PIC  S9(4) COMP.            11000008
110100     10 WS-TRT00009-PO-NBR            PIC  S9(9) COMP.            11010008
110200     10 WS-TRT00009-UPC-NBR           PIC  S9(15)V COMP-3.        11020008
110300     10 WS-TRT00009-SSCC-ID           PIC   X(48).                11030008
110400     10 WS-TRT00009-UNT-QTY           PIC  S9(9) COMP.            11040008
110500     10 WS-TRT00009-LAST-UPD-BY-USR-ID  PIC   X(8).               11050008
110600     10 WS-TRT00009-LAST-UPD-TMST     PIC   X(26).                11060008
110700     10 WS-TRT00009-AUD-FUNC-CDE      PIC   X(1).                 11070008
110800     10 WS-TRT00009-AUD-TMST          PIC   X(26).                11080008
110900 01  WS-TRT00009-KEYS.                                            11090008
111000     10 DS-TRT00009-CONTNR-ID         PIC   X(12).                11100008
111100     10 DS-TRT00009-CONTNR-SEQ-NBR    PIC  S9(4) COMP.            11110008
111200     10 DS-TRT00009-PO-NBR            PIC  S9(9) COMP.            11120008
111300     10 DS-TRT00009-UPC-NBR           PIC  S9(15)V COMP-3.        11130008
111400     10 DS-TRT00009-SSCC-ID           PIC   X(48).                11140008
111500     10 DS-TRT00009-AUD-TMST          PIC   X(26).                11150008
111600***************************************************************** 11160008
111700* COBOL DECLARATION FOR TABLE TRT_IMPRT_SEAL     7 COLUMNS        11170008
111800***************************************************************** 11180008
111900 01  WS-TRT00006.                                                 11190008
112000     10 WS-TRT00006-CONTNR-ID         PIC   X(12).                11200008
112100     10 WS-TRT00006-CONTNR-SEQ-NBR    PIC  S9(4) COMP.            11210008
112200     10 WS-TRT00006-SEAL-NBR          PIC   X(15).                11220008
112300     10 WS-TRT00006-CRE-TMST          PIC   X(26).                11230008
112400     10 WS-TRT00006-CRE-BY-USR-ID     PIC   X(8).                 11240008
112500     10 WS-TRT00006-LAST-UPD-TMST     PIC   X(26).                11250008
112600     10 WS-TRT00006-LAST-UPD-BY-USR-ID  PIC   X(8).               11260008
112700 01  WS-TRT00006-KEYS.                                            11270008
112800     10 DS-TRT00006-CONTNR-ID         PIC   X(12).                11280008
112900     10 DS-TRT00006-CONTNR-SEQ-NBR    PIC  S9(4) COMP.            11290008
113000     10 DS-TRT00006-SEAL-NBR          PIC   X(15).                11300008
113100***************************************************************** 11310008
113200* COBOL DECLARATION FOR TABLE TRT_AUD_IMPRT_SEAL   7 COLUMNS      11320008
113300***************************************************************** 11330008
113400 01  WS-TRT00007.                                                 11340008
113500     10 WS-TRT00007-CONTNR-ID         PIC   X(12).                11350008
113600     10 WS-TRT00007-CONTNR-SEQ-NBR    PIC  S9(4) COMP.            11360008
113700     10 WS-TRT00007-SEAL-NBR          PIC   X(15).                11370008
113800     10 WS-TRT00007-LAST-UPD-TMST     PIC   X(26).                11380008
113900     10 WS-TRT00007-LAST-UPD-BY-USR-ID PIC   X(8).                11390008
114000     10 WS-TRT00007-AUD-FUNC-CDE      PIC   X(1).                 11400008
114100     10 WS-TRT00007-AUD-TMST          PIC   X(26).                11410008
114200 01  WS-TRT00007-KEYS.                                            11420008
114300     10 DS-TRT00007-CONTNR-ID         PIC   X(12).                11430008
114400     10 DS-TRT00007-CONTNR-SEQ-NBR    PIC  S9(4) COMP.            11440008
114500     10 DS-TRT00007-SEAL-NBR          PIC   X(15).                11450008
114600     10 DS-TRT00007-AUD-TMST          PIC   X(26).                11460008
114700***************************************************************** 11470008
114800* COBOL DECLARATION FOR TABLE TIMBKPO       33 COLUMNS            11480008
114900***************************************************************** 11490008
115000 01  WS-IMBKPO.                                                   11500008
115100     10 WS-IMBKPO-PO-NBR              PIC  S9(9) COMP.            11510008
115200     10 WS-IMBKPO-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.            11520008
115300     10 WS-IMBKPO-PO-BKG-DELY-TMST    PIC   X(26).                11530008
115400     10 WS-IMBKPO-EXTL-REF-NBR        PIC   X(15).                11540008
115500     10 WS-IMBKPO-ORGN-SHPD-FR-CDE    PIC   X(3).                 11550008
115600     10 WS-IMBKPO-CONSLR-SCAC-ID      PIC   X(4).                 11560008
115700     10 WS-IMBKPO-IMPRT-TRIP-ID       PIC   X(10).                11570008
115800     10 WS-IMBKPO-DPRTR-TMST          PIC   X(26).                11580008
115900     10 WS-IMBKPO-POE-DELY-TMST       PIC   X(26).                11590008
116000     10 WS-IMBKPO-CARR-SCAC-ID        PIC   X(4).                 11600008
116100     10 WS-IMBKPO-FOB-CDE             PIC   X(5).                 11610008
116200     10 WS-IMBKPO-IMPRT-VEH-NM        PIC   X(25).                11620008
116300     10 WS-IMBKPO-TRIP-TYP-CDE        PIC   X(1).                 11630008
116400     10 WS-IMBKPO-DEST-POE-CDE        PIC   X(4).                 11640008
116500     10 WS-IMBKPO-C-O-PROD-CDE        PIC   X(3).                 11650008
116600     10 WS-IMBKPO-PROD-FCTRY-NM       PIC   X(35).                11660008
116700     10 WS-IMBKPO-PO-CART-CNT         PIC  S9(9) COMP.            11670008
116800     10 WS-IMBKPO-PO-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.     11680008
116900     10 WS-IMBKPO-PO-WT-KGRM-QTY      PIC  S9(9) COMP.            11690008
117000     10 WS-IMBKPO-PO-UNT-QTY          PIC  S9(9) COMP.            11700008
117100     10 WS-IMBKPO-PO-EXC-APVL-CDE     PIC   X(2).                 11710008
117200     10 WS-IMBKPO-PO-EXC-APVL-USR-ID  PIC   X(8).                 11720008
117300     10 WS-IMBKPO-PO-EXC-APVL-TMST    PIC   X(26).                11730008
117400     10 WS-IMBKPO-PO-EXC-RSN-DESC     PIC   X(30).                11740008
117500     10 WS-IMBKPO-EST-LBD-NM          PIC   X(30).                11750008
117600     10 WS-IMBKPO-EST-LBD-TMST        PIC   X(26).                11760008
117700     10 WS-IMBKPO-SHIPT-BKG-TMST      PIC   X(26).                11770008
117800     10 WS-IMBKPO-VOY-CHG-RSN-DESC    PIC   X(30).                11780008
117900     10 WS-IMBKPO-DAT-SRC-ENT-ID      PIC  S9(9) COMP.            11790008
118000     10 WS-IMBKPO-CRE-BY-USR-ID       PIC   X(8).                 11800008
118100     10 WS-IMBKPO-CRE-TMST            PIC   X(26).                11810008
118200     10 WS-IMBKPO-LAST-UPD-BY-USR-ID  PIC   X(8).                 11820008
118300     10 WS-IMBKPO-LAST-UPD-TMST       PIC   X(26).                11830008
118400 01  WS-IMBKPO-KEYS.                                              11840008
118500     10 DS-IMBKPO-PO-NBR              PIC  S9(9) COMP.            11850008
118600     10 DS-IMBKPO-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.            11860008
118700***************************************************************** 11870008
118800* COBOL DECLARATION FOR TABLE TIMBKVS       13 COLUMNS            11880008
118900***************************************************************** 11890008
119000*01  WS-IMBKVS.                                                   11900008
119100*    10 WS-IMBKVS-PO-NBR              PIC  S9(9) COMP.            11910008
119200*    10 WS-IMBKVS-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.            11920008
119300*    10 WS-IMBKVS-VS-NBR              PIC   X(20).                11930008
119400*    10 WS-IMBKVS-HTS-ID              PIC   X(13).                11940008
119500*    10 WS-IMBKVS-VS-CART-CNT         PIC  S9(9) COMP.            11950008
119600*    10 WS-IMBKVS-VS-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.     11960008
119700*    10 WS-IMBKVS-VS-WT-KGRM-QTY      PIC  S9(9) COMP.            11970008
119800*    10 WS-IMBKVS-VS-UNT-QTY          PIC  S9(9) COMP.            11980008
119900*    10 WS-IMBKVS-QTA-CTG-IND         PIC   X(1).                 11990008
120000*    10 WS-IMBKVS-CRE-BY-USR-ID       PIC   X(8).                 12000008
120100*    10 WS-IMBKVS-CRE-TMST            PIC   X(26).                12010008
120200*    10 WS-IMBKVS-LAST-UPD-BY-USR-ID  PIC   X(8).                 12020008
120300*    10 WS-IMBKVS-LAST-UPD-TMST       PIC   X(26).                12030008
120400*01  WS-IMBKVS-KEYS.                                              12040008
120500*    10 DS-IMBKVS-PO-NBR              PIC  S9(9) COMP.            12050008
120600*    10 DS-IMBKVS-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.            12060008
120700*    10 DS-IMBKVS-VS-NBR              PIC   X(20).                12070008
120800***************************************************************** 12080008
120900* COBOL DECLARATION FOR TABLE TIMBKUP      12 COLUMNS           * 12090008
121000***************************************************************** 12100008
121100*01  WS-IMBKUP.                                                   12110008
121200*    10 WS-IMBKUP-PO-NBR              PIC  S9(9) COMP.            12120008
121300*    10 WS-IMBKUP-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.            12130008
121400*    10 WS-IMBKUP-VS-NBR              PIC   X(20).                12140008
121500*    10 WS-IMBKUP-UPC-NBR             PIC  S9(15)V COMP-3.        12150008
121600*    10 WS-IMBKUP-UPC-CART-CNT        PIC  S9(9) COMP.            12160008
121700*    10 WS-IMBKUP-UPC-CBMT-QTY        PIC  S9(7)V9(2) COMP-3.     12170008
121800*    10 WS-IMBKUP-UPC-WT-KGRM-QTY     PIC  S9(9) COMP.            12180008
121900*    10 WS-IMBKUP-UPC-UNT-QTY         PIC  S9(9) COMP.            12190008
122000*    10 WS-IMBKUP-CRE-BY-USR-ID       PIC   X(8).                 12200008
122100*    10 WS-IMBKUP-CRE-TMST            PIC   X(26).                12210008
122200*    10 WS-IMBKUP-LAST-UPD-BY-USR-ID  PIC   X(8).                 12220008
122300*    10 WS-IMBKUP-LAST-UPD-TMST       PIC   X(26).                12230008
122400*01  WS-IMBKUP-KEYS.                                              12240008
122500*    10 DS-IMBKUP-PO-NBR              PIC  S9(9) COMP.            12250008
122600*    10 DS-IMBKUP-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.            12260008
122700*    10 DS-IMBKUP-VS-NBR              PIC   X(20).                12270008
122800*    10 DS-IMBKUP-UPC-NBR             PIC  S9(15)V COMP-3.        12280008
122900***************************************************************** 12290008
123000* COBOL DECLARATION FOR TABLE TIMRCPO       32 COLUMNS            12300008
123100***************************************************************** 12310008
123200 01  WS-IMRCPO.                                                   12320008
123300     10 WS-IMRCPO-PO-NBR              PIC  S9(9) COMP.            12330008
123400     10 WS-IMRCPO-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.            12340008
123500     10 WS-IMRCPO-PO-RCVD-DELY-TMST   PIC   X(26).                12350008
123600     10 WS-IMRCPO-EXTL-REF-NBR        PIC   X(15).                12360008
123700     10 WS-IMRCPO-ORGN-SHPD-FR-CDE    PIC   X(3).                 12370008
123800     10 WS-IMRCPO-CONSLR-SCAC-ID      PIC   X(4).                 12380008
123900     10 WS-IMRCPO-IMPRT-TRIP-ID       PIC   X(10).                12390008
124000     10 WS-IMRCPO-DPRTR-TMST          PIC   X(26).                12400008
124100     10 WS-IMRCPO-POE-DELY-TMST       PIC   X(26).                12410008
124200     10 WS-IMRCPO-CARR-SCAC-ID        PIC   X(4).                 12420008
124300     10 WS-IMRCPO-FOB-CDE             PIC   X(5).                 12430008
124400     10 WS-IMRCPO-IMPRT-VEH-NM        PIC   X(25).                12440008
124500     10 WS-IMRCPO-TRIP-TYP-CDE        PIC   X(1).                 12450008
124600     10 WS-IMRCPO-DEST-POE-CDE        PIC   X(4).                 12460008
124700     10 WS-IMRCPO-C-O-PROD-CDE        PIC   X(3).                 12470008
124800     10 WS-IMRCPO-PROD-FCTRY-NM       PIC   X(35).                12480008
124900     10 WS-IMRCPO-PO-CART-CNT         PIC  S9(9) COMP.            12490008
125000     10 WS-IMRCPO-PO-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.     12500008
125100     10 WS-IMRCPO-PO-WT-KGRM-QTY      PIC  S9(9) COMP.            12510008
125200     10 WS-IMRCPO-PO-UNT-QTY          PIC  S9(9) COMP.            12520008
125300     10 WS-IMRCPO-PO-EXC-APVL-CDE     PIC   X(2).                 12530008
125400     10 WS-IMRCPO-PO-EXC-APVL-USR-ID  PIC   X(8).                 12540008
125500     10 WS-IMRCPO-PO-EXC-APVL-TMST    PIC   X(26).                12550008
125600     10 WS-IMRCPO-PO-EXC-RSN-DESC     PIC   X(30).                12560008
125700     10 WS-IMRCPO-EST-LBD-NM          PIC   X(30).                12570008
125800     10 WS-IMRCPO-EST-LBD-TMST        PIC   X(26).                12580008
125900     10 WS-IMRCPO-VOY-CHG-RSN-DESC    PIC   X(30).                12590008
126000     10 WS-IMRCPO-DAT-SRC-ENT-ID      PIC  S9(9) COMP.            12600008
126100     10 WS-IMRCPO-CRE-BY-USR-ID       PIC   X(8).                 12610008
126200     10 WS-IMRCPO-CRE-TMST            PIC   X(26).                12620008
126300     10 WS-IMRCPO-LAST-UPD-BY-USR-ID  PIC   X(8).                 12630008
126400     10 WS-IMRCPO-LAST-UPD-TMST       PIC   X(26).                12640008
126500 01  WS-IMRCPO-KEYS.                                              12650008
126600     10 DS-IMRCPO-PO-NBR              PIC  S9(9) COMP.            12660008
126700     10 DS-IMRCPO-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.            12670008
126800***************************************************************** 12680008
126900* COBOL DECLARATION FOR TABLE TIMRCVS       13 COLUMNS            12690008
127000***************************************************************** 12700008
127100*01  WS-IMRCVS.                                                   12710008
127200*    10 WS-IMRCVS-PO-NBR              PIC  S9(9) COMP.            12720008
127300*    10 WS-IMRCVS-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.            12730008
127400*    10 WS-IMRCVS-VS-NBR              PIC   X(20).                12740008
127500*    10 WS-IMRCVS-HTS-ID              PIC   X(13).                12750008
127600*    10 WS-IMRCVS-VS-CART-CNT         PIC  S9(9) COMP.            12760008
127700*    10 WS-IMRCVS-VS-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.     12770008
127800*    10 WS-IMRCVS-VS-WT-KGRM-QTY      PIC  S9(9) COMP.            12780008
127900*    10 WS-IMRCVS-VS-UNT-QTY          PIC  S9(9) COMP.            12790008
128000*    10 WS-IMRCVS-QTA-CTG-IND         PIC   X(1).                 12800008
128100*    10 WS-IMRCVS-CRE-BY-USR-ID       PIC   X(8).                 12810008
128200*    10 WS-IMRCVS-CRE-TMST            PIC   X(26).                12820008
128300*    10 WS-IMRCVS-LAST-UPD-BY-USR-ID  PIC   X(8).                 12830008
128400*    10 WS-IMRCVS-LAST-UPD-TMST       PIC   X(26).                12840008
128500*01  WS-IMRCVS-KEYS.                                              12850008
128600*    10 DS-IMRCVS-PO-NBR              PIC  S9(9) COMP.            12860008
128700*    10 DS-IMRCVS-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.            12870008
128800*    10 DS-IMRCVS-VS-NBR              PIC   X(20).                12880008
128900***************************************************************** 12890008
129000* COBOL DECLARATION FOR TABLE TIMRCUP       12 COLUMNS            12900008
129100***************************************************************** 12910008
129200*01  WS-IMRCUP.                                                   12920008
129300*    10 WS-IMRCUP-PO-NBR              PIC  S9(9) COMP.            12930008
129400*    10 WS-IMRCUP-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.            12940008
129500*    10 WS-IMRCUP-VS-NBR              PIC   X(20).                12950008
129600*    10 WS-IMRCUP-UPC-NBR             PIC  S9(15)V COMP-3.        12960008
129700*    10 WS-IMRCUP-UPC-CART-CNT        PIC  S9(9) COMP.            12970008
129800*    10 WS-IMRCUP-UPC-CBMT-QTY        PIC  S9(7)V9(2) COMP-3.     12980008
129900*    10 WS-IMRCUP-UPC-WT-KGRM-QTY     PIC  S9(9) COMP.            12990008
130000*    10 WS-IMRCUP-UPC-UNT-QTY         PIC  S9(9) COMP.            13000008
130100*    10 WS-IMRCUP-CRE-BY-USR-ID       PIC   X(8).                 13010008
130200*    10 WS-IMRCUP-CRE-TMST            PIC   X(26).                13020008
130300*    10 WS-IMRCUP-LAST-UPD-BY-USR-ID  PIC   X(8).                 13030008
130400*    10 WS-IMRCUP-LAST-UPD-TMST       PIC   X(26).                13040008
130500*01  WS-IMRCUP-KEYS.                                              13050008
130600*    10 DS-IMRCUP-PO-NBR              PIC  S9(9) COMP.            13060008
130700*    10 DS-IMRCUP-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.            13070008
130800*    10 DS-IMRCUP-VS-NBR              PIC   X(20).                13080008
130900*    10 DS-IMRCUP-UPC-NBR             PIC  S9(15)V COMP-3.        13090008
131000******************************************************************13100008
131100* COBOL DECLARATION FOR TABLE TMESTDS                             13110008
131200******************************************************************13120008
131300 01  WS-MESTDS.                                                   13130008
131400     10 WS-MESTDS-PO-NBR              PIC  S9(9) COMP.            13140008
131500     10 WS-MESTDS-PO-LNE-NBR          PIC  S9(9) COMP.            13150008
131600     10 WS-MESTDS-PLAN-NBR            PIC  S9(4) COMP.            13160008
131700     10 WS-MESTDS-STR-NBR             PIC  S9(4) COMP.            13170008
131800     10 WS-MESTDS-STR-DISTRO-QTY      PIC  S9(9) COMP.            13180008
131900     10 WS-MESTDS-ALLOC-SEQ-CDE       PIC   X(1).                 13190008
132000     10 WS-MESTDS-RNK-SEQ-NBR         PIC  S9(4) COMP.            13200008
132100     10 WS-02-MESTDS-STR-CNSTR-CDE    PIC   X(1).                 13210008
132200     10 WS-02-MESTDS-STR-CNSTR-QTY    PIC  S9(9) COMP.            13220008
132300 01  WS-MESTDS-KEYS.                                              13230008
132400     10 DS-MESTDS-PO-NBR              PIC  S9(9) COMP.            13240008
132500     10 DS-MESTDS-PO-LNE-NBR          PIC  S9(9) COMP.            13250008
132600     10 DS-MESTDS-PLAN-NBR            PIC  S9(4) COMP.            13260008
132700     10 DS-MESTDS-STR-NBR             PIC  S9(4) COMP.            13270008
132800******************************************************************13280008
132900* COBOL DECLARATION FOR TABLE TEXTENT                             13290008
133000******************************************************************13300008
133100 01  WS-EXTENT.                                                   13310008
133200     10 WS-EXTENT-ENT-ID              PIC  S9(9) COMP.            13320008
133300     10 WS-EXTENT-SCAC-CDE            PIC   X(4).                 13330008
133400     10 WS-EXTENT-DUN-NBR             PIC   X(9).                 13340008
133500     10 WS-EXTENT-ASN-TRSCP-IND       PIC   X(1).                 13350008
133600     10 WS-EXTENT-FED-EXPRESS-NBR     PIC   X(9).                 13360008
133700     10 WS-EXTENT-MDSE-VENDOR-IND     PIC   X(1).                 13370008
133800     10 WS-EXTENT-CARRIER-IND         PIC   X(1).                 13380008
133900     10 WS-EXTENT-STATUS-CDE          PIC   X(1).                 13390008
134000     10 WS-EXTENT-CARR-MAN-PRO-IND    PIC   X(1).                 13400008
134100     10 WS-EXTENT-EDI214-TEST-IND     PIC   X(1).                 13410008
134200     10 WS-EXTENT-IMPRT-IND           PIC   X(1).                 13420008
134300     10 WS-EXTENT-SHIP-INSTR-LT-QTY   PIC  S9(4) COMP.            13430008
134400     10 WS-EXTENT-SHIP-INSTR-REQD     PIC   X(1).                 13440008
134500     10 WS-EXTENT-EXP-VEND-IND        PIC   X(1).                 13450008
134600     10 WS-EXTENT-NEED-1099-IND       PIC   X(1).                 13460008
134700     10 WS-EXTENT-CRE-BY-UID          PIC   X(8).                 13470008
134800     10 WS-EXTENT-CRE-TMST            PIC   X(26).                13480008
134900     10 WS-EXTENT-LAST-UPD-BY-UID     PIC   X(8).                 13490008
135000     10 WS-EXTENT-LAST-UPD-TMST       PIC   X(26).                13500008
135100     10 WS-EXTENT-CFY-SLSRNK-NBR      PIC  S9(4) COMP.            13510008
135200     10 WS-EXTENT-PFY-SLSRNK-NBR      PIC  S9(4) COMP.            13520008
135300     10 WS-EXTENT-CRE-ASN-FCST-IND    PIC   X(1).                 13530008
135400     10 WS-EXTENT-CRE-SHIPT-FCST-IND  PIC   X(1).                 13540008
135500     10 WS-EXTENT-STR-DISTRO-LT-QTY   PIC  S9(4) COMP.            13550008
135600     10 WS-EXTENT-VLD-CART-LBL-IND    PIC   X(1).                 13560008
135700     10 WS-EXTENT-PRNT-CO-ENT-ID      PIC  S9(9) COMP.            13570008
135800     10 WS-EXTENT-VND-CLSN-CDE        PIC   X(1).                 13580008
135900     10 WS-EXTENT-VND-PRSST-CDE       PIC   X(1).                 13590008
136000     10 WS-EXTENT-FED-TX-ID-TYP-CDE   PIC   X(1).                 13600008
136100     10 WS-EXTENT-FED-TX-ID-NBR       PIC   X(9).                 13610008
136200     10 WS-EXTENT-FCTR-IND            PIC   X(1).                 13620008
136300     10 WS-EXTENT-PRNT-CO-IND         PIC   X(1).                 13630008
136400     10 WS-EXTENT-CAP-EXP-CDE         PIC   X(1).                 13640008
136500     10 WS-EXTENT-HLD-PAYT-IND        PIC   X(1).                 13650008
136600     10 WS-EXTENT-PAY-FCTR-VND-IND    PIC   X(1).                 13660008
136700     10 WS-EXTENT-SEPR-INVC-PAYT-IND  PIC   X(1).                 13670008
136800     10 WS-EXTENT-WHLDG-PAYT-TYP-CDE  PIC   X(5).                 13680008
136900     10 WS-EXTENT-PAYT-HNDLG-CDE      PIC   X(2).                 13690008
137000     10 WS-EXTENT-P12MN-SLSRNK-NBR    PIC  S9(4) COMP.            13700008
137100     10 WS-EXTENT-EDI-PO-PREPK-CDE    PIC   X(1).                 13710008
137200     10 WS-EXTENT-PRIM-TYP-CDE        PIC   X(1).                 13720008
137300     10 WS-EXTENT-PRTNR-IND           PIC   X(1).                 13730008
137400     10 WS-EXTENT-PRTNR-TYP-CDE       PIC   X(2).                 13740008
137500     10 WS-EXTENT-LNE-OF-CR-AMT       PIC  S9(11)V9(2) COMP-3.    13750008
137600     10 WS-EXTENT-VND-IN-RMS-IND      PIC   X(1).                 13760008
137700 01  WS-EXTENT-KEYS.                                              13770008
137800     10 DS-EXTENT-ENT-ID              PIC  S9(9) COMP.            13780008
137900******************************************************************13790008
138000* COBOL DECLARATION FOR TABLE TENTNME                            *13800008
138100******************************************************************13810008
138200 01  WS-ENTNME.                                                   13820008
138300     10 WS-ENTNME-ENT-ID            PIC S9(9) USAGE COMP.         13830008
138400     10 WS-ENTNME-SEQ-NBR           PIC S9(4) USAGE COMP.         13840008
138500     10 WS-ENTNME-ENT-NAME-DESC     PIC X(250).                   13850008
138600     10 WS-ENTNME-TYPE-CDE          PIC X(2).                     13860008
138700 01  WS-ENTNME-KEYS.                                              13870008
138800     10 DS-ENTNME-ENT-ID            PIC S9(9) USAGE COMP.         13880008
138900     10 DS-ENTNME-SEQ-NBR           PIC S9(4) USAGE COMP.         13890008
139000******************************************************************13900008
139100* COBOL DECLARATION FOR TABLE TVNDDPT                             13910008
139200******************************************************************13920008
139300 01  WS-VNDDPT.                                                   13930008
139400     10 WS-VNDDPT-ENT-ID              PIC  S9(9) COMP.            13940008
139500     10 WS-VNDDPT-DEPT-NBR            PIC   X(3).                 13950008
139600     10 WS-VNDDPT-INHOUSE-NBR         PIC  S9(3)V COMP-3.         13960008
139700     10 WS-VNDDPT-VEND-TYP-IND        PIC   X(1).                 13970008
139800     10 WS-VNDDPT-INVC-REQ-PO-IND     PIC   X(1).                 13980008
139900     10 WS-VNDDPT-VND-DEPT-STAT-CD    PIC   X(1).                 13990008
140000 01  WS-VNDDPT-KEYS.                                              14000008
140100     10 DS-VNDDPT-ENT-ID              PIC  S9(9) COMP.            14010008
140200     10 DS-VNDDPT-DEPT-NBR            PIC   X(3).                 14020008
140300******************************************************************14030008
140400* COBOL DECLARATION FOR TABLE TINSTCD                             14040008
140500******************************************************************14050008
140600 01  WS-INSTCD.                                                   14060008
140700     10 WS-INSTCD-INSTR-NBR           PIC  S9(9) COMP.            14070008
140800     10 WS-INSTCD-INSTR-DESC          PIC   X(150).               14080008
140900     10 WS-INSTCD-CRE-BY-UID          PIC   X(8).                 14090008
141000     10 WS-INSTCD-CRE-DTE             PIC   X(10).                14100008
141100 01  WS-INSTCD-KEYS.                                              14110008
141200     10 DS-INSTCD-INSTR-NBR           PIC  S9(9) COMP.            14120008
141300******************************************************************14130008
141400* COBOL DECLARATION FOR TABLE TSPSTDS                             14140008
141500******************************************************************14150008
141600*01  WS-SPSTDS.                                                   14160008
141700*    10 WS-SPSTDS-PO-NBR              PIC  S9(9) COMP.            14170008
141800*    10 WS-SPSTDS-PO-LNE-NBR          PIC  S9(9) COMP.            14180008
141900*    10 WS-SPSTDS-PLAN-NBR            PIC  S9(4) COMP.            14190008
142000*    10 WS-SPSTDS-STR-NBR             PIC  S9(4) COMP.            14200008
142100*    10 WS-SPSTDS-STR-DISTRO-QTY      PIC  S9(9) COMP.            14210008
142200*01  WS-SPSTDS-KEYS.                                              14220008
142300*    10 DS-SPSTDS-PO-NBR              PIC  S9(9) COMP.            14230008
142400*    10 DS-SPSTDS-PO-LNE-NBR          PIC  S9(9) COMP.            14240008
142500*    10 DS-SPSTDS-PLAN-NBR            PIC  S9(4) COMP.            14250008
142600*    10 DS-SPSTDS-STR-NBR             PIC  S9(4) COMP.            14260008
142700******************************************************************14270008
142800* COBOL DECLARATION FOR TABLE TTRBNTF - TABLE VERSION 01          14280008
142900******************************************************************14290008
143000 01  WS-TRBNTF.                                                   14300008
143100     10 WS-TRBNTF-NOTIF-NBR           PIC  S9(9) COMP.            14310008
143200     10 WS-TRBNTF-OPER-UNT-ID         PIC  S9(4) COMP.            14320008
143300     10 WS-TRBNTF-FCLTY-ID            PIC  S9(4) COMP.            14330008
143400     10 WS-TRBNTF-DEPT-NBR            PIC   X(3).                 14340008
143500     10 WS-TRBNTF-ENT-ID              PIC  S9(9) COMP.            14350008
143600     10 WS-TRBNTF-PO-NBR              PIC  S9(9) COMP.            14360008
143700     10 WS-TRBNTF-PO-LNE-NBR          PIC  S9(9) COMP.            14370008
143800     10 WS-TRBNTF-REC-SEQ-NBR         PIC  S9(9) COMP.            14380008
143900     10 WS-TRBNTF-TRBL-RSN-CDE        PIC  S9(4) COMP.            14390008
144000     10 WS-TRBNTF-NOTIF-TMST          PIC   X(26).                14400008
144100     10 WS-TRBNTF-NOTIF-UID           PIC   X(8).                 14410008
144200     10 WS-TRBNTF-RESOLVED-IND        PIC   X(1).                 14420008
144300     10 WS-TRBNTF-RESOLVED-TMST       PIC   X(26).                14430008
144400     10 WS-TRBNTF-RESOLVED-UID        PIC   X(8).                 14440008
144500     10 WS-TRBNTF-ACKNOWLG-TMST       PIC   X(26).                14450008
144600     10 WS-TRBNTF-ACKNOWLG-UID        PIC   X(8).                 14460008
144700     10 WS-TRBNTF-CNTCT-EXT           PIC  S9(9) COMP.            14470008
144800     10 WS-TRBNTF-FCLTY-AREA-ID       PIC   X(6).                 14480008
144900     10 WS-TRBNTF-SHIPT-ID            PIC  S9(9) COMP.            14490008
145000     10 WS-TRBNTF-PKSL-SEQ-NBR        PIC  S9(4) COMP.            14500008
145100     10 WS-TRBNTF-PKSL-LNE-NBR        PIC  S9(9) COMP.            14510008
145200     10 WS-TRBNTF-WORK-ORD-SEQ-NBR    PIC  S9(4) COMP.            14520008
145300     10 WS-TRBNTF-WO-INSTR-SEQ-NBR    PIC  S9(4) COMP.            14530008
145400     10 WS-TRBNTF-OVER-SHT-PCT        PIC  S9(4) COMP.            14540008
145500     10 WS-TRBNTF-LAST-DTL-CRE-TMST PIC     X(26).                14550008
145600     10 WS-TRBNTF-CRE-IND             PIC   X(1).                 14560008
145700     10 WS-TRBNTF-PRORATE-IND         PIC   X(1).                 14570008
145800     10 WS-TRBNTF-RTV-IND             PIC   X(1).                 14580008
145900     10 WS-TRBNTF-RTV-RESPONSE-TMST   PIC   X(26).                14590008
146000     10 WS-TRBNTF-PO-VER-NBR          PIC  S9(9) COMP.            14600008
146100     10 WS-TRBNTF-PO-LNE-VER-NBR      PIC  S9(9) COMP.            14610008
146200     10 WS-TRBNTF-PLN-SHIP-VER-NBR    PIC  S9(9) COMP.            14620008
146300     10 WS-TRBNTF-ERLY-LTE-DAY-QTY    PIC  S9(4) COMP.            14630008
146400     10 WS-TRBNTF-INITR-ID            PIC  S9(4) COMP.            14640008
146500     10 WS-TRBNTF-RSPNB-RSLU-ID       PIC  S9(4) COMP.            14650008
146600     10 WS-TRBNTF-PFMC-TRKG-ID        PIC  S9(4) COMP.            14660008
146700     10 WS-TRBNTF-ACTVY-RSLU-CDE      PIC   X(2).                 14670008
146800     10 WS-TRBNTF-INITR-ENT-ID        PIC  S9(9) COMP.            14680008
146900     10 WS-02-TRBNTF-FOB-CDE          PIC  X(03).                 14690008
147000     10 WS-02-TRBNTF-POE-CDE          PIC  X(03).                 14700008
147100     10 WS-02-TRBNTF-PREPK-ID         PIC  S9(4) COMP.            14710008
147200 01  WS-TRBNTF-KEYS.                                              14720008
147300     10 DS-TRBNTF-NOTIF-NBR           PIC  S9(9) COMP.            14730008
147400******************************************************************14740008
147500* COBOL DECLARATION FOR TABLE TTRBDTL                             14750008
147600******************************************************************14760008
147700 01  WS-TRBDTL.                                                   14770008
147800     10 WS-TRBDTL-NOTIF-NBR           PIC  S9(9) COMP.            14780008
147900     10 WS-TRBDTL-CRE-TMST            PIC   X(26).                14790008
148000     10 WS-TRBDTL-CRE-UID             PIC   X(8).                 14800008
148100     10 WS-TRBDTL-FREEFORM-TEXT.                                  14810008
148200         49 TRBDTL-FREEFORM-TEXT-LEN       PIC S9(4) COMP.        14820008
148300         49 TRBDTL-FREEFORM-TEXT-TEXT      PIC X(250).            14830008
148400 01  WS-TRBDTL-KEYS.                                              14840008
148500     10 DS-TRBDTL-NOTIF-NBR           PIC  S9(9) COMP.            14850008
148600     10 DS-TRBDTL-CRE-TMST            PIC   X(26).                14860008
148700******************************************************************14870008
148800* COBOL DECLARATION FOR TABLE TRECDVS                             14880008
148900******************************************************************14890008
149000 01  WS-RECDVS.                                                   14900008
149100     10 WS-RECDVS-ORD-NBR             PIC  S9(9) COMP.            14910008
149200     10 WS-RECDVS-ORD-LNE-NBR         PIC  S9(9) COMP.            14920008
149300     10 WS-RECDVS-REC-SEQ-NBR         PIC  S9(9) COMP.            14930008
149400     10 WS-RECDVS-STR-NBR             PIC  S9(4) COMP.            14940008
149500     10 WS-RECDVS-VRFY-SRC-CDE        PIC   X(2).                 14950008
149600     10 WS-RECDVS-EXPTED-ITM-QTY      PIC  S9(9) COMP.            14960008
149700     10 WS-RECDVS-VRFY-ITM-QTY        PIC  S9(9) COMP.            14970008
149800     10 WS-RECDVS-VER-STAT-CDE        PIC   X(1).                 14980008
149900 01  WS-RECDVS-KEYS.                                              14990008
150000     10 DS-RECDVS-ORD-NBR             PIC  S9(9) COMP.            15000008
150100     10 DS-RECDVS-ORD-LNE-NBR         PIC  S9(9) COMP.            15010008
150200     10 DS-RECDVS-REC-SEQ-NBR         PIC  S9(9) COMP.            15020008
150300     10 DS-RECDVS-STR-NBR             PIC  S9(4) COMP.            15030008
150400     10 DS-RECDVS-VRFY-SRC-CDE        PIC   X(2).                 15040008
150500******************************************************************15050008
150600* COBOL DECLARATION FOR TABLE TAUTRIP                             15060008
150700******************************************************************15070008
150800 01  WS-AUTRIP.                                                   15080008
150900     10 WS-AUTRIP-OWNER-SCAC-ID       PIC   X(4).                 15090008
151000     10 WS-AUTRIP-VEH-NBR             PIC   X(10).                15100008
151100     10 WS-AUTRIP-VEH-NBR-NN          PIC  S9(4) COMP.            15110008
151200     10 WS-AUTRIP-TRIP-ID             PIC  S9(9) COMP.            15120008
151300     10 WS-AUTRIP-TRIP-BEG-DTE        PIC   X(10).                15130008
151400     10 WS-AUTRIP-TRIP-BEG-TME        PIC   X(8).                 15140008
151500     10 WS-AUTRIP-CRT-SRC-CDE         PIC   X(2).                 15150008
151600     10 WS-AUTRIP-LAST-UPD-DTE        PIC   X(10).                15160008
151700     10 WS-AUTRIP-LAST-UPD-TME        PIC   X(8).                 15170008
151800     10 WS-AUTRIP-LAST-UPD-UID        PIC   X(8).                 15180008
151900     10 WS-AUTRIP-MANIFEST-NBR        PIC   X(15).                15190008
152000     10 WS-AUTRIP-PLND-TRIP-SEQ       PIC  S9(4) COMP.            15200008
152100     10 WS-AUTRIP-PLND-ACTVY-CDE      PIC   X(1).                 15210008
152200     10 WS-AUTRIP-REF-TRIP-ID         PIC  S9(9) COMP.            15220008
152300     10 WS-AUTRIP-EST-AR-TMST         PIC   X(26).                15230008
152400     10 WS-AUTRIP-EST-AR-TMST-NN      PIC  S9(4) COMP.            15240008
152500     10 WS-AUTRIP-OWNR-SCAC-SHIP-DTE  PIC   X(10).                15250008
152600     10 WS-AUTRIP-AUD-STATUS-CDE      PIC   X(2).                 15260008
152700     10 WS-AUTRIP-SPLT-XMIT-IND       PIC   X(1).                 15270008
152800     10 WS-AUTRIP-SPLT-XMIT-DTE       PIC   X(10).                15280008
152900     10 WS-AUTRIP-SPLT-XMIT-TM        PIC   X(8).                 15290008
153000 01  WS-AUTRIP-KEYS.                                              15300008
153100     10 DS-AUTRIP-TRIP-ID             PIC  S9(9) COMP.            15310008
153200     10 DS-AUTRIP-LAST-UPD-DTE        PIC   X(10).                15320008
153300     10 DS-AUTRIP-LAST-UPD-TME        PIC   X(8).                 15330008
153400******************************************************************15340008
153500* COBOL DECLARATION FOR TABLE TIMCSBL                             15350008
153600******************************************************************15360008
153700 01  WS-IMCSBL.                                                   15370008
153800     10 WS-IMCSBL-CSTM-ENTR-ID           PIC   X(12).             15380008
153900     10 WS-IMCSBL-MSTR-BOL-NBR           PIC   X(30).             15390008
154000     10 WS-IMCSBL-HSE-BOL-NBR            PIC   X(30).             15400008
154100     10 WS-IMCSBL-CRE-BY-USR-ID          PIC   X(8).              15410008
154200     10 WS-IMCSBL-CRE-TMST               PIC   X(26).             15420008
154300     10 WS-IMCSBL-LAST-UPD-BY-USR-ID     PIC   X(8).              15430008
154400     10 WS-IMCSBL-LAST-UPD-TMST          PIC   X(26).             15440008
154500 01  WS-IMCSBL-KEYS.                                              15450008
154600     10 DS-IMCSBL-CSTM-ENTR-ID           PIC   X(12).             15460008
154700     10 DS-IMCSBL-MSTR-BOL-NBR           PIC   X(30).             15470008
154800     10 DS-IMCSBL-HSE-BOL-NBR            PIC   X(30).             15480008
154900******************************************************************15490008
155000* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *15500008
155100******************************************************************15510008
155200******************************************************************15520008
155300* COBOL DECLARATION FOR TABLE TIMCSCN                             15530008
155400******************************************************************15540008
155500 01  WS-IMCSCN.                                                   15550008
155600     10 WS-IMCSCN-CSTM-ENTR-ID           PIC   X(12).             15560008
155700     10 WS-IMCSCN-CONTNR-ID              PIC   X(12).             15570008
155800     10 WS-IMCSCN-CRE-BY-USR-ID          PIC   X(8).              15580008
155900     10 WS-IMCSCN-CRE-TMST               PIC   X(26).             15590008
156000     10 WS-IMCSCN-LAST-UPD-BY-USR-ID     PIC   X(8).              15600008
156100     10 WS-IMCSCN-LAST-UPD-TMST          PIC   X(26).             15610008
156200 01  WS-IMCSCN-KEYS.                                              15620008
156300     10 DS-IMCSCN-CSTM-ENTR-ID           PIC   X(12).             15630008
156400     10 DS-IMCSCN-CONTNR-ID              PIC   X(12).             15640008
156500******************************************************************15650008
156600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   6     *15660008
156700******************************************************************15670008
156800******************************************************************15680008
156900* COBOL DECLARATION FOR TABLE TIMCSPO                             15690008
157000******************************************************************15700008
157100 01  WS-IMCSPO.                                                   15710008
157200     10 WS-IMCSPO-CSTM-ENTR-ID           PIC   X(12).             15720008
157300     10 WS-IMCSPO-PO-NBR                 PIC  S9(9) COMP.         15730008
157400     10 WS-IMCSPO-CRE-BY-USR-ID          PIC   X(8).              15740008
157500     10 WS-IMCSPO-CRE-TMST               PIC   X(26).             15750008
157600     10 WS-IMCSPO-LAST-UPD-BY-USR-ID     PIC   X(8).              15760008
157700     10 WS-IMCSPO-LAST-UPD-TMST          PIC   X(26).             15770008
157800 01  WS-IMCSPO-KEYS.                                              15780008
157900     10 DS-IMCSPO-CSTM-ENTR-ID           PIC   X(12).             15790008
158000     10 DS-IMCSPO-PO-NBR                 PIC  S9(9) COMP.         15800008
158100******************************************************************15810008
158200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   6     *15820008
158300******************************************************************15830008
158400******************************************************************15840008
158500* COBOL DECLARATION FOR TABLE TIMCSEN                             15850008
158600******************************************************************15860008
158700 01  WS-IMCSEN.                                                   15870008
158800     10 WS-IMCSEN-CSTM-ENTR-ID           PIC   X(12).             15880008
158900     10 WS-IMCSEN-ENT-ID                 PIC  S9(9) COMP.         15890008
159000     10 WS-IMCSEN-BKR-REF-NBR            PIC   X(15).             15900008
159100     10 WS-IMCSEN-FILD-TMST              PIC   X(26).             15910008
159200     10 WS-IMCSEN-EST-CLR-TMST           PIC   X(26).             15920008
159300     10 WS-IMCSEN-ACTL-CLR-TMST          PIC   X(26).             15930008
159400     10 WS-IMCSEN-EXM-TMST               PIC   X(26).             15940008
159500     10 WS-IMCSEN-REJ-TMST               PIC   X(26).             15950008
159600     10 WS-IMCSEN-REJ-DESC               PIC   X(30).             15960008
159700     10 WS-IMCSEN-LQDN-TMST              PIC   X(26).             15970008
159800     10 WS-IMCSEN-LQDN-SSPNN-TMST        PIC   X(26).             15980008
159900     10 WS-IMCSEN-LQDN-SSPNN-DESC        PIC   X(30).             15990008
160000     10 WS-IMCSEN-DAT-SRC-ENT-ID         PIC  S9(9) COMP.         16000008
160100     10 WS-IMCSEN-CRE-BY-USR-ID          PIC   X(8).              16010008
160200     10 WS-IMCSEN-CRE-TMST               PIC   X(26).             16020008
160300     10 WS-IMCSEN-LAST-UPD-BY-USR-ID     PIC   X(8).              16030008
160400     10 WS-IMCSEN-LAST-UPD-TMST          PIC   X(26).             16040008
160500     10 WS-IMCSEN-MOM-DEST-POE-CDE       PIC   X(4).              16050008
160600 01  WS-IMCSEN-KEYS.                                              16060008
160700     10 DS-IMCSEN-CSTM-ENTR-ID           PIC   X(12).             16070008
160800******************************************************************16080008
160900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  18     *16090008
161000******************************************************************16100008
161100******************************************************************16110008
161200* COBOL DECLARATION FOR TABLE TAUCSEN                             16120008
161300******************************************************************16130008
161400 01  WS-AUCSEN.                                                   16140008
161500     10 WS-AUCSEN-CSTM-ENTR-ID           PIC   X(12).             16150008
161600     10 WS-AUCSEN-ENT-ID                 PIC  S9(9) COMP.         16160008
161700     10 WS-AUCSEN-BKR-REF-NBR            PIC   X(15).             16170008
161800     10 WS-AUCSEN-FILD-TMST              PIC   X(26).             16180008
161900     10 WS-AUCSEN-EST-CLR-TMST           PIC   X(26).             16190008
162000     10 WS-AUCSEN-ACTL-CLR-TMST          PIC   X(26).             16200008
162100     10 WS-AUCSEN-EXM-TMST               PIC   X(26).             16210008
162200     10 WS-AUCSEN-REJ-TMST               PIC   X(26).             16220008
162300     10 WS-AUCSEN-REJ-DESC               PIC   X(30).             16230008
162400     10 WS-AUCSEN-LQDN-TMST              PIC   X(26).             16240008
162500     10 WS-AUCSEN-LQDN-SSPNN-TMST        PIC   X(26).             16250008
162600     10 WS-AUCSEN-LQDN-SSPNN-DESC        PIC   X(30).             16260008
162700     10 WS-AUCSEN-DAT-SRC-ENT-ID         PIC  S9(9) COMP.         16270008
162800     10 WS-AUCSEN-LAST-UPD-BY-USR-ID     PIC   X(8).              16280008
162900     10 WS-AUCSEN-LAST-UPD-TMST          PIC   X(26).             16290008
163000     10 WS-AUCSEN-AUD-FUNC-CDE           PIC   X(1).              16300008
163100     10 WS-AUCSEN-AUD-TMST               PIC   X(26).             16310008
163200     10 WS-AUCSEN-MOM-DEST-POE-CDE       PIC   X(4).              16320008
163300 01  WS-AUCSEN-KEYS.                                              16330008
163400     10 DS-AUCSEN-CSTM-ENTR-ID           PIC   X(12).             16340008
163500     10 DS-AUCSEN-LAST-UPD-TMST          PIC   X(26).             16350008
163600******************************************************************16360008
163700* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  18     *16370008
163800******************************************************************16380008
163900******************************************************************16390008
164000* COBOL DECLARATION FOR TABLE TAUCSPO                             16400008
164100******************************************************************16410008
164200 01  WS-AUCSPO.                                                   16420008
164300     10 WS-AUCSPO-CSTM-ENTR-ID           PIC   X(12).             16430008
164400     10 WS-AUCSPO-PO-NBR                 PIC  S9(9) COMP.         16440008
164500     10 WS-AUCSPO-LAST-UPD-BY-USR-ID     PIC   X(8).              16450008
164600     10 WS-AUCSPO-LAST-UPD-TMST          PIC   X(26).             16460008
164700     10 WS-AUCSPO-AUD-FUNC-CDE           PIC   X(1).              16470008
164800     10 WS-AUCSPO-AUD-TMST               PIC   X(26).             16480008
164900 01  WS-AUCSPO-KEYS.                                              16490008
165000     10 DS-AUCSPO-CSTM-ENTR-ID           PIC   X(12).             16500008
165100     10 DS-AUCSPO-LAST-UPD-TMST          PIC   X(26).             16510008
165200******************************************************************16520008
165300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   6     *16530008
165400******************************************************************16540008
165500******************************************************************16550008
165600* COBOL DECLARATION FOR TABLE TAUCSCN                             16560008
165700******************************************************************16570008
165800 01  WS-AUCSCN.                                                   16580008
165900     10 WS-AUCSCN-CSTM-ENTR-ID           PIC   X(12).             16590008
166000     10 WS-AUCSCN-CONTNR-ID              PIC   X(12).             16600008
166100     10 WS-AUCSCN-LAST-UPD-BY-USR-ID     PIC   X(8).              16610008
166200     10 WS-AUCSCN-LAST-UPD-TMST          PIC   X(26).             16620008
166300     10 WS-AUCSCN-AUD-FUNC-CDE           PIC   X(1).              16630008
166400     10 WS-AUCSCN-AUD-TMST               PIC   X(26).             16640008
166500 01  WS-AUCSCN-KEYS.                                              16650008
166600     10 DS-AUCSCN-CSTM-ENTR-ID           PIC   X(12).             16660008
166700     10 DS-AUCSCN-LAST-UPD-TMST          PIC   X(26).             16670008
166800******************************************************************16680008
166900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   6     *16690008
167000******************************************************************16700008
167100******************************************************************16710008
167200* COBOL DECLARATION FOR TABLE TAUCSBL                             16720008
167300******************************************************************16730008
167400 01  WS-AUCSBL.                                                   16740008
167500     10 WS-AUCSBL-CSTM-ENTR-ID           PIC   X(12).             16750008
167600     10 WS-AUCSBL-MSTR-BOL-NBR           PIC   X(30).             16760008
167700     10 WS-AUCSBL-HSE-BOL-NBR            PIC   X(30).             16770008
167800     10 WS-AUCSBL-LAST-UPD-BY-USR-ID     PIC   X(8).              16780008
167900     10 WS-AUCSBL-LAST-UPD-TMST          PIC   X(26).             16790008
168000     10 WS-AUCSBL-AUD-FUNC-CDE           PIC   X(1).              16800008
168100     10 WS-AUCSBL-AUD-TMST               PIC   X(26).             16810008
168200 01  WS-AUCSBL-KEYS.                                              16820008
168300     10 DS-AUCSBL-CSTM-ENTR-ID           PIC   X(12).             16830008
168400     10 DS-AUCSBL-LAST-UPD-TMST          PIC   X(26).             16840008
168500******************************************************************16850008
168600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *16860008
168700******************************************************************16870008
168800******************************************************************16880008
168900* COBOL DECLARATION FOR TABLE TAURCPO                             16890008
169000******************************************************************16900008
169100 01  WS-AURCPO.                                                   16910008
169200     10 WS-AURCPO-PO-NBR              PIC  S9(9) COMP.            16920008
169300     10 WS-AURCPO-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.            16930008
169400     10 WS-AURCPO-PO-RCVD-DELY-TMST   PIC   X(26).                16940008
169500     10 WS-AURCPO-EXTL-REF-NBR        PIC   X(15).                16950008
169600     10 WS-AURCPO-ORGN-SHPD-FR-CDE    PIC   X(3).                 16960008
169700     10 WS-AURCPO-CONSLR-SCAC-ID      PIC   X(4).                 16970008
169800     10 WS-AURCPO-IMPRT-TRIP-ID       PIC   X(10).                16980008
169900     10 WS-AURCPO-DPRTR-TMST          PIC   X(26).                16990008
170000     10 WS-AURCPO-POE-DELY-TMST       PIC   X(26).                17000008
170100     10 WS-AURCPO-CARR-SCAC-ID        PIC   X(4).                 17010008
170200     10 WS-AURCPO-FOB-CDE             PIC   X(5).                 17020008
170300     10 WS-AURCPO-IMPRT-VEH-NM        PIC   X(25).                17030008
170400     10 WS-AURCPO-TRIP-TYP-CDE        PIC   X(1).                 17040008
170500     10 WS-AURCPO-DEST-POE-CDE        PIC   X(4).                 17050008
170600     10 WS-AURCPO-C-O-PROD-CDE        PIC   X(3).                 17060008
170700     10 WS-AURCPO-PROD-FCTRY-NM       PIC   X(35).                17070008
170800     10 WS-AURCPO-PO-CART-CNT         PIC  S9(9) COMP.            17080008
170900     10 WS-AURCPO-PO-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.     17090008
171000     10 WS-AURCPO-PO-WT-KGRM-QTY      PIC  S9(9) COMP.            17100008
171100     10 WS-AURCPO-PO-UNT-QTY          PIC  S9(9) COMP.            17110008
171200     10 WS-AURCPO-PO-EXC-APVL-CDE     PIC   X(2).                 17120008
171300     10 WS-AURCPO-PO-EXC-APVL-USR-ID  PIC   X(8).                 17130008
171400     10 WS-AURCPO-PO-EXC-APVL-TMST    PIC   X(26).                17140008
171500     10 WS-AURCPO-PO-EXC-RSN-DESC     PIC   X(30).                17150008
171600     10 WS-AURCPO-EST-LBD-NM          PIC   X(30).                17160008
171700     10 WS-AURCPO-EST-LBD-TMST        PIC   X(26).                17170008
171800     10 WS-AURCPO-VOY-CHG-RSN-DESC    PIC   X(30).                17180008
171900     10 WS-AURCPO-DAT-SRC-ENT-ID      PIC  S9(9) COMP.            17190008
172000     10 WS-AURCPO-LAST-UPD-BY-USR-ID  PIC   X(8).                 17200008
172100     10 WS-AURCPO-LAST-UPD-TMST       PIC   X(26).                17210008
172200     10 WS-AURCPO-AUD-FUNC-CDE        PIC   X(1).                 17220008
172300     10 WS-AURCPO-AUD-TMST            PIC   X(26).                17230008
172400 01  WS-AURCPO-KEYS.                                              17240008
172500     10 DS-AURCPO-PO-NBR              PIC  S9(9) COMP.            17250008
172600     10 DS-AURCPO-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.            17260008
172700     10 DS-AURCPO-AUD-TMST            PIC   X(26).                17270008
172800******************************************************************17280008
172900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  32     *17290008
173000******************************************************************17300008
173100******************************************************************17310008
173200* COBOL DECLARATION FOR TABLE TAURCVS                             17320008
173300******************************************************************17330008
173400*01  WS-AURCVS.                                                   17340008
173500*    10 WS-AURCVS-PO-NBR              PIC  S9(9) COMP.            17350008
173600*    10 WS-AURCVS-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.            17360008
173700*    10 WS-AURCVS-VS-NBR              PIC   X(20).                17370008
173800*    10 WS-AURCVS-HTS-ID              PIC   X(13).                17380008
173900*    10 WS-AURCVS-VS-CART-CNT         PIC  S9(9) COMP.            17390008
174000*    10 WS-AURCVS-VS-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.     17400008
174100*    10 WS-AURCVS-VS-WT-KGRM-QTY      PIC  S9(9) COMP.            17410008
174200*    10 WS-AURCVS-VS-UNT-QTY          PIC  S9(9) COMP.            17420008
174300*    10 WS-AURCVS-QTA-CTG-IND         PIC   X(1).                 17430008
174400*    10 WS-AURCVS-LAST-UPD-BY-USR-ID  PIC   X(8).                 17440008
174500*    10 WS-AURCVS-LAST-UPD-TMST       PIC   X(26).                17450008
174600*    10 WS-AURCVS-AUD-FUNC-CDE        PIC   X(1).                 17460008
174700*    10 WS-AURCVS-AUD-TMST            PIC   X(26).                17470008
174800*01  WS-AURCVS-KEYS.                                              17480008
174900*    10 DS-AURCVS-PO-NBR              PIC  S9(9) COMP.            17490008
175000*    10 DS-AURCVS-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.            17500008
175100*    10 DS-AURCVS-VS-NBR              PIC   X(20).                17510008
175200*    10 DS-AURCVS-AUD-TMST            PIC   X(26).                17520008
175300******************************************************************17530008
175400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  13     *17540008
175500******************************************************************17550008
175600******************************************************************17560008
175700* COBOL DECLARATION FOR TABLE TAURCUP                             17570008
175800******************************************************************17580008
175900*01  WS-AURCUP.                                                   17590008
176000*    10 WS-AURCUP-PO-NBR              PIC  S9(9) COMP.            17600008
176100*    10 WS-AURCUP-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.            17610008
176200*    10 WS-AURCUP-VS-NBR              PIC   X(20).                17620008
176300*    10 WS-AURCUP-UPC-NBR             PIC  S9(15)V COMP-3.        17630008
176400*    10 WS-AURCUP-UPC-CART-CNT        PIC  S9(9) COMP.            17640008
176500*    10 WS-AURCUP-UPC-CBMT-QTY        PIC  S9(7)V9(2) COMP-3.     17650008
176600*    10 WS-AURCUP-UPC-WT-KGRM-QTY     PIC  S9(9) COMP.            17660008
176700*    10 WS-AURCUP-UPC-UNT-QTY         PIC  S9(9) COMP.            17670008
176800*    10 WS-AURCUP-LAST-UPD-BY-USR-ID  PIC   X(8).                 17680008
176900*    10 WS-AURCUP-LAST-UPD-TMST       PIC   X(26).                17690008
177000*    10 WS-AURCUP-AUD-FUNC-CDE        PIC   X(1).                 17700008
177100*    10 WS-AURCUP-AUD-TMST            PIC   X(26).                17710008
177200*01  WS-AURCUP-KEYS.                                              17720008
177300*    10 DS-AURCUP-PO-NBR              PIC  S9(9) COMP.            17730008
177400*    10 DS-AURCUP-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.            17740008
177500*    10 DS-AURCUP-VS-NBR              PIC   X(20).                17750008
177600*    10 DS-AURCUP-UPC-NBR             PIC  S9(15)V COMP-3.        17760008
177700*    10 DS-AURCUP-AUD-TMST            PIC   X(26).                17770008
177800******************************************************************17780008
177900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  12     *17790008
178000******************************************************************17800008
178100******************************************************************17810008
178200* COBOL DECLARATION FOR TABLE TAUBKUP                             17820008
178300******************************************************************17830008
178400*01  WS-AUBKUP.                                                   17840008
178500*    10 WS-AUBKUP-PO-NBR              PIC  S9(9) COMP.            17850008
178600*    10 WS-AUBKUP-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.            17860008
178700*    10 WS-AUBKUP-VS-NBR              PIC   X(20).                17870008
178800*    10 WS-AUBKUP-UPC-NBR             PIC  S9(15)V COMP-3.        17880008
178900*    10 WS-AUBKUP-UPC-CART-CNT        PIC  S9(9) COMP.            17890008
179000*    10 WS-AUBKUP-UPC-CBMT-QTY        PIC  S9(7)V9(2) COMP-3.     17900008
179100*    10 WS-AUBKUP-UPC-WT-KGRM-QTY     PIC  S9(9) COMP.            17910008
179200*    10 WS-AUBKUP-UPC-UNT-QTY         PIC  S9(9) COMP.            17920008
179300*    10 WS-AUBKUP-LAST-UPD-BY-USR-ID  PIC   X(8).                 17930008
179400*    10 WS-AUBKUP-LAST-UPD-TMST       PIC   X(26).                17940008
179500*    10 WS-AUBKUP-AUD-FUNC-CDE        PIC   X(1).                 17950008
179600*    10 WS-AUBKUP-AUD-TMST            PIC   X(26).                17960008
179700*01  WS-AUBKUP-KEYS.                                              17970008
179800*    10 DS-AUBKUP-PO-NBR              PIC  S9(9) COMP.            17980008
179900*    10 DS-AUBKUP-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.            17990008
180000*    10 DS-AUBKUP-VS-NBR              PIC   X(20).                18000008
180100*    10 DS-AUBKUP-UPC-NBR             PIC  S9(15)V COMP-3.        18010008
180200*    10 DS-AUBKUP-AUD-TMST            PIC   X(26).                18020008
180300******************************************************************18030008
180400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  12     *18040008
180500******************************************************************18050008
180600******************************************************************18060008
180700* COBOL DECLARATION FOR TABLE TAUBKVS                             18070008
180800******************************************************************18080008
180900*01  WS-AUBKVS.                                                   18090008
181000*    10 WS-AUBKVS-PO-NBR              PIC  S9(9) COMP.            18100008
181100*    10 WS-AUBKVS-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.            18110008
181200*    10 WS-AUBKVS-VS-NBR              PIC   X(20).                18120008
181300*    10 WS-AUBKVS-HTS-ID              PIC   X(13).                18130008
181400*    10 WS-AUBKVS-VS-CART-CNT         PIC  S9(9) COMP.            18140008
181500*    10 WS-AUBKVS-VS-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.     18150008
181600*    10 WS-AUBKVS-VS-WT-KGRM-QTY      PIC  S9(9) COMP.            18160008
181700*    10 WS-AUBKVS-VS-UNT-QTY          PIC  S9(9) COMP.            18170008
181800*    10 WS-AUBKVS-QTA-CTG-IND         PIC   X(1).                 18180008
181900*    10 WS-AUBKVS-LAST-UPD-BY-USR-ID  PIC   X(8).                 18190008
182000*    10 WS-AUBKVS-LAST-UPD-TMST       PIC   X(26).                18200008
182100*    10 WS-AUBKVS-AUD-FUNC-CDE        PIC   X(1).                 18210008
182200*    10 WS-AUBKVS-AUD-TMST            PIC   X(26).                18220008
182300*01  WS-AUBKVS-KEYS.                                              18230008
182400*    10 DS-AUBKVS-PO-NBR              PIC  S9(9) COMP.            18240008
182500*    10 DS-AUBKVS-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.            18250008
182600*    10 DS-AUBKVS-VS-NBR              PIC   X(20).                18260008
182700*    10 DS-AUBKVS-AUD-TMST            PIC   X(26).                18270008
182800******************************************************************18280008
182900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  13     *18290008
183000******************************************************************18300008
183100******************************************************************18310008
183200* COBOL DECLARATION FOR TABLE TAUBKPO                             18320008
183300******************************************************************18330008
183400 01  WS-AUBKPO.                                                   18340008
183500     10 WS-AUBKPO-PO-NBR              PIC  S9(9) COMP.            18350008
183600     10 WS-AUBKPO-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.            18360008
183700     10 WS-AUBKPO-PO-BKG-DELY-TMST    PIC   X(26).                18370008
183800     10 WS-AUBKPO-EXTL-REF-NBR        PIC   X(15).                18380008
183900     10 WS-AUBKPO-ORGN-SHPD-FR-CDE    PIC   X(3).                 18390008
184000     10 WS-AUBKPO-CONSLR-SCAC-ID      PIC   X(4).                 18400008
184100     10 WS-AUBKPO-IMPRT-TRIP-ID       PIC   X(10).                18410008
184200     10 WS-AUBKPO-DPRTR-TMST          PIC   X(26).                18420008
184300     10 WS-AUBKPO-POE-DELY-TMST       PIC   X(26).                18430008
184400     10 WS-AUBKPO-CARR-SCAC-ID        PIC   X(4).                 18440008
184500     10 WS-AUBKPO-FOB-CDE             PIC   X(5).                 18450008
184600     10 WS-AUBKPO-IMPRT-VEH-NM        PIC   X(25).                18460008
184700     10 WS-AUBKPO-TRIP-TYP-CDE        PIC   X(1).                 18470008
184800     10 WS-AUBKPO-DEST-POE-CDE        PIC   X(4).                 18480008
184900     10 WS-AUBKPO-C-O-PROD-CDE        PIC   X(3).                 18490008
185000     10 WS-AUBKPO-PROD-FCTRY-NM       PIC   X(35).                18500008
185100     10 WS-AUBKPO-PO-CART-CNT         PIC  S9(9) COMP.            18510008
185200     10 WS-AUBKPO-PO-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.     18520008
185300     10 WS-AUBKPO-PO-WT-KGRM-QTY      PIC  S9(9) COMP.            18530008
185400     10 WS-AUBKPO-PO-UNT-QTY          PIC  S9(9) COMP.            18540008
185500     10 WS-AUBKPO-PO-EXC-APVL-CDE     PIC   X(2).                 18550008
185600     10 WS-AUBKPO-PO-EXC-APVL-USR-ID  PIC   X(8).                 18560008
185700     10 WS-AUBKPO-PO-EXC-APVL-TMST    PIC   X(26).                18570008
185800     10 WS-AUBKPO-PO-EXC-RSN-DESC     PIC   X(30).                18580008
185900     10 WS-AUBKPO-EST-LBD-NM          PIC   X(30).                18590008
186000     10 WS-AUBKPO-EST-LBD-TMST        PIC   X(26).                18600008
186100     10 WS-AUBKPO-SHIPT-BKG-TMST      PIC   X(26).                18610008
186200     10 WS-AUBKPO-VOY-CHG-RSN-DESC    PIC   X(30).                18620008
186300     10 WS-AUBKPO-DAT-SRC-ENT-ID      PIC  S9(9) COMP.            18630008
186400     10 WS-AUBKPO-LAST-UPD-BY-USR-ID  PIC   X(8).                 18640008
186500     10 WS-AUBKPO-LAST-UPD-TMST       PIC   X(26).                18650008
186600     10 WS-AUBKPO-AUD-FUNC-CDE        PIC   X(1).                 18660008
186700     10 WS-AUBKPO-AUD-TMST            PIC   X(26).                18670008
186800 01  WS-AUBKPO-KEYS.                                              18680008
186900     10 DS-AUBKPO-PO-NBR              PIC  S9(9) COMP.            18690008
187000     10 DS-AUBKPO-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.            18700008
187100     10 DS-AUBKPO-AUD-TMST            PIC   X(26).                18710008
187200******************************************************************18720008
187300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  33     *18730008
187400******************************************************************18740008
187500******************************************************************18750008
187600* COBOL DECLARATION FOR TABLE TAUCNTK                             18760008
187700******************************************************************18770008
187800 01  WS-AUCNTK.                                                   18780008
187900     10 WS-AUCNTK-CONTNR-ID           PIC   X(12).                18790008
188000     10 WS-AUCNTK-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            18800008
188100     10 WS-AUCNTK-CONSLR-SCAC-ID      PIC   X(4).                 18810008
188200     10 WS-AUCNTK-MOM-IMPRT-TRIP-ID   PIC   X(10).                18820008
188300     10 WS-AUCNTK-MOM-DPRTR-TMST      PIC   X(26).                18830008
188400     10 WS-AUCNTK-MOM-POE-DELY-TMST   PIC   X(26).                18840008
188500     10 WS-AUCNTK-MOM-CARR-SCAC-ID    PIC   X(4).                 18850008
188600     10 WS-AUCNTK-MOM-FOB-CDE         PIC   X(5).                 18860008
188700     10 WS-AUCNTK-MOM-IMPRT-VEH-NM    PIC   X(25).                18870008
188800     10 WS-AUCNTK-MOM-TRIP-TYP-CDE    PIC   X(1).                 18880008
188900     10 WS-AUCNTK-MOM-DEST-POE-CDE    PIC   X(4).                 18890008
189000     10 WS-AUCNTK-FDR-IMPRT-TRIP-ID   PIC   X(10).                18900008
189100     10 WS-AUCNTK-FDR-DPRTR-TMST      PIC   X(26).                18910008
189200     10 WS-AUCNTK-FDR-POE-DELY-TMST   PIC   X(26).                18920008
189300     10 WS-AUCNTK-FDR-CARR-SCAC-ID    PIC   X(4).                 18930008
189400     10 WS-AUCNTK-FDR-FOB-CDE         PIC   X(5).                 18940008
189500     10 WS-AUCNTK-FDR-IMPRT-VEH-NM    PIC   X(25).                18950008
189600     10 WS-AUCNTK-FDR-TRIP-TYP-CDE    PIC   X(1).                 18960008
189700     10 WS-AUCNTK-FDR-DEST-POE-CDE    PIC   X(4).                 18970008
189800     10 WS-AUCNTK-SIZE-CDE            PIC   X(3).                 18980008
189900     10 WS-AUCNTK-CART-CNT            PIC  S9(9) COMP.            18990008
190000     10 WS-AUCNTK-CBMT-QTY            PIC  S9(9)V9(2) COMP-3.     19000008
190100     10 WS-AUCNTK-WT-KGRM-QTY         PIC  S9(9) COMP.            19010008
190200     10 WS-AUCNTK-UNT-QTY             PIC  S9(9) COMP.            19020008
190300     10 WS-AUCNTK-ORGN-SHPD-FR-CDE    PIC   X(3).                 19030008
190400     10 WS-AUCNTK-ORGN-SHPD-TO-CDE    PIC   X(3).                 19040008
190500     10 WS-AUCNTK-EST-LBD-NM          PIC   X(30).                19050008
190600     10 WS-AUCNTK-EST-LBD-TMST        PIC   X(26).                19060008
190700     10 WS-AUCNTK-RISU-DO-RSN-CDE     PIC   X(3).                 19070008
190800     10 WS-AUCNTK-BKR-FRGT-RLSE-TMST  PIC   X(26).                19080008
190900     10 WS-AUCNTK-DO-TO-DCONSLR-TMST  PIC   X(26).                19090008
191000     10 WS-AUCNTK-DO-RCVD-TMST        PIC   X(26).                19100008
191100     10 WS-AUCNTK-CONTNR-PU-TMST      PIC   X(26).                19110008
191200     10 WS-AUCNTK-DAT-SRC-ENT-ID      PIC  S9(9) COMP.            19120008
191300     10 WS-AUCNTK-LAST-UPD-BY-USR-ID  PIC   X(8).                 19130008
191400     10 WS-AUCNTK-LAST-UPD-TMST       PIC   X(26).                19140008
191500     10 WS-AUCNTK-AUD-FUNC-CDE        PIC   X(1).                 19150008
191600     10 WS-AUCNTK-AUD-TMST            PIC   X(26).                19160008
191700     10 WS-AUCNTK-ACTL-POE-DELY-TMST  PIC   X(26).                19170008
191800     10 WS-AUCNTK-ACTL-DEST-POE-CDE   PIC   X(4).                 19180008
191900     10 WS-AUCNTK-ACTL-LBD-NM         PIC   X(30).                19190008
192000     10 WS-AUCNTK-ACTL-LBD-TMST       PIC   X(26).                19200008
192100     10 WS-02-AUCNTK-DVN-TMST         PIC   X(26).                19210008
192200     10 WS-02-AUCNTK-DCONSLR-SCAC-ID  PIC   X(4).                 19220008
192300     10 WS-02-AUCNTK-SIZE-CDE         PIC   X(5).                 19230008
192400     10 WS-AUCNTK-DCONSLR-RET-TMST    PIC   X(26).                19240008
192500     10 WS-AUCNTK-MOM-POL-CDE         PIC   X(05).                19250008
192600     10 WS-AUCNTK-FDR-POL-CDE         PIC   X(05).                19260008
192700     10 WS-AUCNTK-MOM-POR-CDE         PIC   X(05).                19270008
192800     10 WS-AUCNTK-FDR-POR-CDE         PIC   X(05).                19280008
192900     10 WS-AUCNTK-DCONSLR-DELY-TMST   PIC   X(26).                19290008
193000 01  WS-AUCNTK-KEYS.                                              19300008
193100     10 DS-AUCNTK-CONTNR-ID           PIC   X(12).                19310008
193200     10 DS-AUCNTK-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            19320008
193300     10 DS-AUCNTK-AUD-TMST            PIC   X(26).                19330008
193400******************************************************************19340008
193500* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  50     *19350008
193600******************************************************************19360008
193700******************************************************************19370008
193800* COBOL DECLARATION FOR TABLE TAUCNUP                             19380008
193900******************************************************************19390008
194000 01  WS-AUCNUP.                                                   19400008
194100     10 WS-AUCNUP-CONTNR-ID           PIC   X(12).                19410008
194200     10 WS-AUCNUP-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            19420008
194300     10 WS-AUCNUP-PO-NBR              PIC  S9(9) COMP.            19430008
194400     10 WS-AUCNUP-VS-NBR              PIC   X(30).                19440008
194500     10 WS-AUCNUP-UPC-NBR             PIC  S9(15)V COMP-3.        19450008
194600     10 WS-AUCNUP-PO-LNE-NBR          PIC  S9(9) COMP.            19460008
194700     10 WS-AUCNUP-UPC-CART-CNT        PIC  S9(9) COMP.            19470008
194800     10 WS-AUCNUP-UPC-CBMT-QTY        PIC  S9(7)V9(2) COMP-3.     19480008
194900     10 WS-AUCNUP-UPC-WT-KGRM-QTY     PIC  S9(9) COMP.            19490008
195000     10 WS-AUCNUP-UPC-UNT-QTY         PIC  S9(9) COMP.            19500008
195100     10 WS-AUCNUP-LAST-UPD-BY-USR-ID  PIC   X(8).                 19510008
195200     10 WS-AUCNUP-LAST-UPD-TMST       PIC   X(26).                19520008
195300     10 WS-AUCNUP-AUD-FUNC-CDE        PIC   X(1).                 19530008
195400     10 WS-AUCNUP-AUD-TMST            PIC   X(26).                19540008
195500     10 WS-AUCNUP-SKU-NBR             PIC  S9(8)V COMP-3.         19550008
195600     10 WS-AUCNUP-ASN-PKGNG-CDE       PIC   X(2).                 19560008
195700 01  WS-AUCNUP-KEYS.                                              19570008
195800     10 DS-AUCNUP-CONTNR-ID           PIC   X(12).                19580008
195900     10 DS-AUCNUP-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            19590008
196000     10 DS-AUCNUP-PO-NBR              PIC  S9(9) COMP.            19600008
196100     10 DS-AUCNUP-VS-NBR              PIC   X(20).                19610008
196200     10 DS-AUCNUP-UPC-NBR             PIC  S9(15)V COMP-3.        19620008
196300     10 DS-AUCNUP-PO-LNE-NBR          PIC  S9(9) COMP.            19630008
196400     10 DS-AUCNUP-AUD-TMST            PIC   X(26).                19640008
196500******************************************************************19650008
196600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  17     *19660008
196700******************************************************************19670008
196800******************************************************************19680008
196900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  15     *19690008
197000******************************************************************19700008
197100******************************************************************19710008
197200* COBOL DECLARATION FOR TABLE TAUCNPO                             19720008
197300******************************************************************19730008
197400 01  WS-AUCNPO.                                                   19740008
197500     10 WS-AUCNPO-CONTNR-ID           PIC   X(12).                19750008
197600     10 WS-AUCNPO-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            19760008
197700     10 WS-AUCNPO-PO-NBR              PIC  S9(9) COMP.            19770008
197800     10 WS-AUCNPO-CSTM-ENTR-ID        PIC   X(12).                19780008
197900     10 WS-AUCNPO-MSTR-BOL-NBR        PIC   X(30).                19790008
198000     10 WS-AUCNPO-HSE-BOL-NBR         PIC   X(30).                19800008
198100     10 WS-AUCNPO-LTR-OF-CR-NBR       PIC   X(15).                19810008
198200     10 WS-AUCNPO-PO-RCVD-DELY-TMST   PIC   X(26).                19820008
198300     10 WS-AUCNPO-PO-C-O-PROD-CDE     PIC   X(3).                 19830008
198400     10 WS-AUCNPO-PO-CART-CNT         PIC  S9(4) COMP.            19840008
198500     10 WS-AUCNPO-PO-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.     19850008
198600     10 WS-AUCNPO-PO-WT-KGRM-QTY      PIC  S9(9) COMP.            19860008
198700     10 WS-AUCNPO-PO-UNT-QTY          PIC  S9(9) COMP.            19870008
198800     10 WS-AUCNPO-LAST-UPD-BY-USR-ID  PIC   X(8).                 19880008
198900     10 WS-AUCNPO-LAST-UPD-TMST       PIC   X(26).                19890008
199000     10 WS-AUCNPO-AUD-FUNC-CDE        PIC   X(1).                 19900008
199100     10 WS-AUCNPO-AUD-TMST            PIC   X(26).                19910008
199200     10 WS-AUCNPO-EXTL-REF-NBR        PIC   X(15).                19920008
199300     10 WS-AUCNPO-BKR-FRGT-RLSE-CDE   PIC   X(1).                 19930008
199400     10 WS-AUCNPO-DO-RCVD-CDE         PIC   X(1).                 19940008
199500     10 WS-AUCNPO-CONTNR-PU-CDE       PIC   X(1).                 19950008
199600     10 WS-AUCNPO-ACTL-POE-DELY-CDE   PIC   X(1).                 19960008
199700     10 WS-AUCNPO-DVN-CDE             PIC   X(1).                 19970008
199800     10 WS-AUCNPO-DCONSLR-RET-CDE     PIC   X(1).                 19980008
199900     10 WS-AUCNPO-SPLT-XMIT-CDE       PIC   X(1).                 19990008
200000     10 WS-AUCNPO-DOC-RCVD-ORGN-TMST  PIC   X(26).                20000008
200100     10 WS-AUCNPO-DCONSLR-DELY-CDE    PIC   X(1).                 20010008
200200 01  WS-AUCNPO-KEYS.                                              20020008
200300     10 DS-AUCNPO-CONTNR-ID           PIC   X(12).                20030008
200400     10 DS-AUCNPO-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            20040008
200500     10 DS-AUCNPO-PO-NBR              PIC  S9(9) COMP.            20050008
200600     10 DS-AUCNPO-AUD-TMST            PIC   X(26).                20060008
200700******************************************************************20070008
200800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  27     *20080008
200900******************************************************************20090008
201000******************************************************************20100008
201100* COBOL DECLARATION FOR TABLE TAUSHIP                             20110008
201200******************************************************************20120008
201300 01  WS-AUSHIP.                                                   20130008
201400     10 WS-AUSHIP-TRIP-ID             PIC  S9(9) COMP.            20140008
201500     10 WS-AUSHIP-TRIP-ID-NN          PIC  S9(4) COMP.            20150008
201600     10 WS-AUSHIP-SHIPT-ID            PIC  S9(9) COMP.            20160008
201700     10 WS-AUSHIP-CRT-SRC-CDE         PIC   X(2).                 20170008
201800     10 WS-AUSHIP-LAST-UPD-DTE        PIC   X(10).                20180008
201900     10 WS-AUSHIP-LAST-UPD-TME        PIC   X(8).                 20190008
202000     10 WS-AUSHIP-LAST-UPD-UID        PIC   X(8).                 20200008
202100     10 WS-AUSHIP-PRO-SCAC-ID         PIC   X(4).                 20210008
202200     10 WS-AUSHIP-PRO-NBR             PIC   X(22).                20220008
202300     10 WS-AUSHIP-BOL-NBR             PIC   X(30).                20230008
202400     10 WS-AUSHIP-SHIPPER-NME         PIC   X(20).                20240008
202500     10 WS-AUSHIP-SHIPT-TYP-CDE       PIC  S9(4) COMP.            20250008
202600     10 WS-AUSHIP-EXPTED-GRO-WGHT     PIC  S9(9) COMP.            20260008
202700     10 WS-AUSHIP-PKG-TYP-CDE         PIC   X(3).                 20270008
202800     10 WS-AUSHIP-EXPTED-PKG-QTY      PIC  S9(9) COMP.            20280008
202900     10 WS-AUSHIP-FRGT-CHG-AMT        PIC  S9(5)V9(2) COMP-3.     20290008
203000     10 WS-AUSHIP-FRGT-TERMS-CDE      PIC   X(1).                 20300008
203100     10 WS-AUSHIP-EST-AR-TMST         PIC   X(26).                20310008
203200     10 WS-AUSHIP-EST-AR-TMST-NN      PIC  S9(4) COMP.            20320008
203300     10 WS-AUSHIP-VEND-SHIP-DTE       PIC   X(10).                20330008
203400     10 WS-AUSHIP-EXPTED-PLT-QTY      PIC  S9(9) COMP.            20340008
203500     10 WS-AUSHIP-ORIG-SCAC-ID        PIC   X(4).                 20350008
203600     10 WS-AUSHIP-LAST-UPD-PGM-ID     PIC   X(8).                 20360008
203700     10 WS-AUSHIP-CRE-USER-ID         PIC   X(8).                 20370008
203800     10 WS-AUSHIP-CARR-CART-CT        PIC  S9(9) COMP.            20380008
203900     10 WS-AUSHIP-CARR-LAST-UPD-DTE   PIC   X(10).                20390008
204000     10 WS-AUSHIP-CARR-LAST-UPD-TIME  PIC   X(8).                 20400008
204100     10 WS-AUSHIP-VEND-CART-CT        PIC  S9(9) COMP.            20410008
204200     10 WS-AUSHIP-VEND-LAST-UPD-DTE   PIC   X(10).                20420008
204300     10 WS-AUSHIP-VEND-LAST-UPD-TIME  PIC   X(8).                 20430008
204400     10 WS-AUSHIP-VEH-NBR             PIC   X(10).                20440008
204500     10 WS-AUSHIP-AUTH-NBR            PIC   X(7).                 20450008
204600     10 WS-AUSHIP-AUTH-DTE            PIC   X(10).                20460008
204700     10 WS-AUSHIP-CONFIRM-DTE         PIC   X(10).                20470008
204800     10 WS-AUSHIP-CONFIRM-TIME        PIC   X(8).                 20480008
204900     10 WS-AUSHIP-AUD-STATUS-CDE      PIC   X(2).                 20490008
205000     10 WS-AUSHIP-PROCESSED-DTE       PIC   X(10).                20500008
205100     10 WS-AUSHIP-INVC-NBR            PIC   X(15).                20510008
205200     10 WS-AUSHIP-CARR-AUTH-ID        PIC   X(30).                20520008
205300 01  WS-AUSHIP-KEYS.                                              20530008
205400     10 DS-AUSHIP-SHIPT-ID            PIC  S9(9) COMP.            20540008
205500     10 DS-AUSHIP-LAST-UPD-DTE        PIC   X(10).                20550008
205600     10 DS-AUSHIP-LAST-UPD-TME        PIC   X(8).                 20560008
205700******************************************************************20570008
205800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  36     *20580008
205900******************************************************************20590008
206000******************************************************************20600008
206100* COBOL DECLARATION FOR TABLE TAUSHPO                             20610008
206200******************************************************************20620008
206300 01  WS-AUSHPO.                                                   20630008
206400     10 WS-AUSHPO-SHIPT-ID            PIC  S9(9) COMP.            20640008
206500     10 WS-AUSHPO-PO-NBR              PIC  S9(9) COMP.            20650008
206600     10 WS-AUSHPO-REC-SEQ-NBR         PIC  S9(9) COMP.            20660008
206700     10 WS-AUSHPO-EXPTED-CART-CNT     PIC  S9(4) COMP.            20670008
206800     10 WS-AUSHPO-ACTL-CART-CNT       PIC  S9(4) COMP.            20680008
206900     10 WS-AUSHPO-DMG-CART-CNT        PIC  S9(4) COMP.            20690008
207000     10 WS-AUSHPO-PKSL-IND            PIC   X(1).                 20700008
207100     10 WS-AUSHPO-VEND-NAME           PIC   X(30).                20710008
207200     10 WS-AUSHPO-FRGT-CHG-AMT        PIC  S9(7)V9(2) COMP-3.     20720008
207300     10 WS-AUSHPO-LAST-UPD-PGM-ID     PIC   X(8).                 20730008
207400     10 WS-AUSHPO-CRE-USER-ID         PIC   X(8).                 20740008
207500     10 WS-AUSHPO-CARR-CART-CT        PIC  S9(9) COMP.            20750008
207600     10 WS-AUSHPO-CARR-LAST-UPD-DTE   PIC   X(10).                20760008
207700     10 WS-AUSHPO-CARR-LAST-UPD-TIME  PIC   X(8).                 20770008
207800     10 WS-AUSHPO-VEND-CART-CT        PIC  S9(9) COMP.            20780008
207900     10 WS-AUSHPO-VEND-LAST-UPD-DTE   PIC   X(10).                20790008
208000     10 WS-AUSHPO-VEND-LAST-UPD-TIME  PIC   X(8).                 20800008
208100     10 WS-AUSHPO-CRE-TMST            PIC   X(26).                20810008
208200     10 WS-AUSHPO-LAST-UPD-DTE        PIC   X(10).                20820008
208300     10 WS-AUSHPO-LAST-UPD-TIME       PIC   X(8).                 20830008
208400     10 WS-AUSHPO-LAST-UPD-USER-ID    PIC   X(8).                 20840008
208500     10 WS-AUSHPO-PRIM-SHIPT-IND      PIC   X(1).                 20850008
208600     10 WS-AUSHPO-SPLT-XMIT-IND       PIC   X(1).                 20860008
208700     10 WS-AUSHPO-SPLT-XMIT-DTE       PIC   X(10).                20870008
208800     10 WS-AUSHPO-SPLT-XMIT-TM        PIC   X(8).                 20880008
208900     10 WS-AUSHPO-TRN-CDE             PIC   X(1).                 20890008
209000 01  WS-AUSHPO-KEYS.                                              20900008
209100     10 DS-AUSHPO-SHIPT-ID            PIC  S9(9) COMP.            20910008
209200     10 DS-AUSHPO-PO-NBR              PIC  S9(9) COMP.            20920008
209300     10 DS-AUSHPO-CRE-TMST            PIC   X(26).                20930008
209400******************************************************************20940008
209500* COBOL DECLARATION FOR TABLE TAUVHCL                             20950008
209600******************************************************************20960008
209700 01  WS-AUVHCL.                                                   20970008
209800     10 WS-AUVHCL-OWNER-SCAC-ID       PIC   X(4).                 20980008
209900     10 WS-AUVHCL-VEH-NBR             PIC   X(10).                20990008
210000     10 WS-AUVHCL-CRT-SRC-CDE         PIC   X(2).                 21000008
210100     10 WS-AUVHCL-LAST-UPD-DTE        PIC   X(10).                21010008
210200     10 WS-AUVHCL-LAST-UPD-TME        PIC   X(8).                 21020008
210300     10 WS-AUVHCL-LAST-UPD-UID        PIC   X(8).                 21030008
210400     10 WS-AUVHCL-USAGE-CDE           PIC   X(3).                 21040008
210500     10 WS-AUVHCL-VEH-TYP-CDE         PIC   X(2).                 21050008
210600     10 WS-AUVHCL-CURR-STATUS-CDE     PIC   X(2).                 21060008
210700     10 WS-AUVHCL-CURR-STATUS-DTE     PIC   X(10).                21070008
210800     10 WS-AUVHCL-CURR-STATUS-TME     PIC   X(8).                 21080008
210900     10 WS-AUVHCL-CURR-OPER-UNT-ID    PIC  S9(4) COMP.            21090008
211000     10 WS-AUVHCL-CURR-FCLTY-ID       PIC  S9(4) COMP.            21100008
211100     10 WS-AUVHCL-CURR-FAC-AREA-ID    PIC   X(6).                 21110008
211200     10 WS-AUVHCL-CURR-LOC-DTE        PIC   X(10).                21120008
211300     10 WS-AUVHCL-CURR-LOC-TME        PIC   X(8).                 21130008
211400     10 WS-AUVHCL-CURR-TRIP-ID        PIC  S9(9) COMP.            21140008
211500     10 WS-AUVHCL-CURR-TRIP-ID-NN     PIC  S9(4) COMP.            21150008
211600     10 WS-AUVHCL-VEH-SIZE-CDE        PIC   X(2).                 21160008
211700 01  WS-AUVHCL-KEYS.                                              21170008
211800     10 DS-AUVHCL-OWNER-SCAC-ID       PIC   X(4).                 21180008
211900     10 DS-AUVHCL-VEH-NBR             PIC   X(10).                21190008
212000     10 DS-AUVHCL-LAST-UPD-DTE        PIC   X(10).                21200008
212100     10 DS-AUVHCL-LAST-UPD-TME        PIC   X(8).                 21210008
212200******************************************************************21220008
212300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  18     *21230008
212400******************************************************************21240008
212500******************************************************************21250008
212600* COBOL DECLARATION FOR TABLE TELCPO                              21260008
212700******************************************************************21270008
212800 01  WS-ELCPO.                                                    21280008
212900     10 WS-ELCPO-PO-NBR                PIC  S9(9) COMP.           21290008
213000     10 WS-ELCPO-DEPT-NBR              PIC   X(3).                21300008
213100     10 WS-ELCPO-FOB-CDE               PIC   X(3).                21310008
213200     10 WS-ELCPO-OTB-PER-NBR           PIC   X(6).                21320008
213300     10 WS-ELCPO-IMPRT-TYP-CDE         PIC   X(3).                21330008
213400     10 WS-ELCPO-STRT-FCTRY-DTE        PIC   X(10).               21340008
213500     10 WS-ELCPO-LAST-FCTRY-DTE        PIC   X(10).               21350008
213600     10 WS-ELCPO-TRIP-STRT-DTE         PIC   X(10).               21360008
213700     10 WS-ELCPO-CRE-TMST              PIC   X(26).               21370008
213800     10 WS-ELCPO-LAST-UPD-TMST         PIC   X(26).               21380008
213900 01  WS-ELCPO-KEYS.                                               21390008
214000     10 DS-ELCPO-PO-NBR                  PIC  S9(9) COMP.         21400008
214100******************************************************************21410008
214200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  10     *21420008
214300******************************************************************21430008
214400******************************************************************21440008
214500* COBOL DECLARATION FOR TABLE TELCVS                              21450008
214600******************************************************************21460008
214700 01  WS-ELCVS.                                                    21470008
214800     10 WS-ELCVS-PO-NBR                  PIC  S9(9) COMP.         21480008
214900     10 WS-ELCVS-VND-STYL-NM             PIC   X(20).             21490008
215000     10 WS-ELCVS-VND-OUTR-PK-QTY         PIC  S9(5)V COMP-3.      21500008
215100     10 WS-ELCVS-UNT-PER-CBMT-QTY        PIC  S9(9) COMP.         21510008
215200     10 WS-ELCVS-UNT-QTY                 PIC  S9(9) COMP.         21520008
215300     10 WS-ELCVS-LAST-UPD-TMST           PIC   X(26).             21530008
215400 01  WS-ELCVS-KEYS.                                               21540008
215500     10 DS-ELCVS-PO-NBR                  PIC  S9(9) COMP.         21550008
215600     10 DS-ELCVS-VND-STYL-NM             PIC   X(20).             21560008
215700******************************************************************21570008
215800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   6     *21580008
215900******************************************************************21590008
216000******************************************************************21600008
216100* COBOL DECLARATION FOR TABLE TVSCPT                              21610008
216200******************************************************************21620008
216300 01  WS-VSCPT.                                                    21630008
216400     10 WS-VSCPT-PO-NBR                  PIC  S9(9) COMP.         21640008
216500     10 WS-VSCPT-VND-STYL-NM             PIC   X(20).             21650008
216600     10 WS-VSCPT-CST-CPT-CDE             PIC   X(3).              21660008
216700     10 WS-VSCPT-ALW-CHRG-CDE            PIC   X(3).              21670008
216800     10 WS-VSCPT-CPT-CHRG-AMT            PIC  S9(7)V9(3) COMP-3.  21680008
216900     10 WS-VSCPT-INCL-IN-ELC-IND         PIC   X(1).              21690008
217000     10 WS-VSCPT-LAST-UPD-TMST           PIC   X(26).             21700008
217100 01  WS-VSCPT-KEYS.                                               21710008
217200     10 DS-VSCPT-PO-NBR                  PIC  S9(9) COMP.         21720008
217300     10 DS-VSCPT-VND-STYL-NM             PIC   X(20).             21730008
217400     10 DS-VSCPT-CST-CPT-CDE             PIC   X(3).              21740008
217500******************************************************************21750008
217600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *21760008
217700******************************************************************21770008
217800***************************************************************** 21780008
217900* COBOL DECLARATION FOR TABLE TUPC - CURRENT VERSION              21790008
218000***************************************************************** 21800008
218100 01  WS-UPC.                                                      21810008
218200     10 WS-UPC-UPC-ID                 PIC  S9(9) COMP.            21820008
218300     10 WS-UPC-UPC-NBR                PIC  S9(15)V COMP-3.        21830008
218400     10 WS-UPC-SUB-CL-MDSEAR-ID       PIC  S9(6)V COMP-3.         21840008
218500     10 WS-UPC-VS-ID                  PIC  S9(9) COMP.            21850008
218600     10 WS-UPC-INTR-UPC-ID            PIC  S9(9) COMP.            21860008
218700     10 WS-UPC-UPC-TYP-CDE            PIC   X(1).                 21870008
218800     10 WS-UPC-EFF-BEG-DTE            PIC   X(10).                21880008
218900     10 WS-UPC-EFF-END-DTE            PIC   X(10).                21890008
219000     10 WS-UPC-EFF-END-DTE-NN         PIC  S9(4) COMP.            21900008
219100     10 WS-UPC-KOHLS-SIZE-CDE         PIC  S9(9) COMP.            21910008
219200     10 WS-UPC-NRF-SIZE-IND           PIC   X(1).                 21920008
219300     10 WS-UPC-NRF-CLOR-CDE           PIC   X(3).                 21930008
219400     10 WS-UPC-NRF-CLOR-IND           PIC   X(1).                 21940008
219500     10 WS-UPC-CSTM-CLOR-DESC         PIC   X(10).                21950008
219600     10 WS-UPC-EDI-ORD-IND            PIC   X(1).                 21960008
219700     10 WS-UPC-PREPK-IND              PIC   X(1).                 21970008
219800     10 WS-UPC-GP-CDE                 PIC   X(3).                 21980008
219900     10 WS-UPC-CERTD-IND              PIC   X(1).                 21990008
220000     10 WS-UPC-CERTD-DTE              PIC   X(10).                22000008
220100     10 WS-UPC-RPLNMT-IND             PIC   X(1).                 22010008
220200     10 WS-UPC-KY-ITM-IND             PIC   X(1).                 22020008
220300     10 WS-UPC-UNT-COST-1ST-AMT       PIC  S9(7)V9(3) COMP-3.     22030008
220400     10 WS-UPC-UPC-SRC-CDE            PIC   X(1).                 22040008
220500     10 WS-UPC-INNR-PK-QTY            PIC  S9(4) COMP.            22050008
220600     10 WS-UPC-OUTR-PK-QTY            PIC  S9(4) COMP.            22060008
220700     10 WS-UPC-SEA-SEQ-NBR            PIC  S9(4) COMP.            22070008
220800     10 WS-UPC-MDSE-TYP-SEQ-NBR       PIC  S9(4) COMP.            22080008
220900     10 WS-UPC-PATRN-SEQ-NBR          PIC  S9(4) COMP.            22090008
221000     10 WS-UPC-TRND-SEQ-NBR           PIC  S9(4) COMP.            22100008
221100     10 WS-UPC-FBRCN-SEQ-NBR          PIC  S9(4) COMP.            22110008
221200     10 WS-UPC-FNSH-SEQ-NBR           PIC  S9(4) COMP.            22120008
221300     10 WS-UPC-CRE-BY-USR-ID          PIC   X(8).                 22130008
221400     10 WS-UPC-LAST-UPD-BY-USR-ID     PIC   X(8).                 22140008
221500     10 WS-UPC-LAST-UPD-TMST          PIC   X(26).                22150008
221600     10 WS-UPC-WD-UM-QTY              PIC  S9(4)V9(3) COMP-3.     22160008
221700     10 WS-UPC-DPTH-UM-QTY            PIC  S9(4)V9(3) COMP-3.     22170008
221800     10 WS-UPC-HT-UM-QTY              PIC  S9(4)V9(3) COMP-3.     22180008
221900     10 WS-UPC-SIZE-UM-CDE            PIC   X(2).                 22190008
222000     10 WS-UPC-WT-UM-QTY              PIC  S9(5)V9(3) COMP-3.     22200008
222100     10 WS-UPC-WT-UM-CDE              PIC   X(2).                 22210008
222200     10 WS-UPC-POG-IND                PIC   X(1).                 22220008
222300     10 WS-UPC-REGN-PRIC-IND          PIC   X(1).                 22230008
222400     10 WS-UPC-TX-PRD-CDE-SEQ-NBR     PIC  S9(4) COMP.            22240008
222500     10 WS-UPC-CUSTFACG-CLOR-DESC     PIC   X(22).                22250008
222600     10 WS-UPC-INTR-UPC-DESC          PIC   X(30).                22260008
222700     10 WS-UPC-TRNSTN-IND             PIC   X(1).                 22270008
222800     10 WS-UPC-PO-SHRT-CYC-IND        PIC   X(1).                 22280008
222900     10 WS-UPC-TST-PRD-TYP-SEQ-NBR    PIC  S9(4) COMP.            22290008
223000     10 WS-UPC-WHSE-RPLNT-IND         PIC   X(1).                 22300008
223100 01  WS-UPC-KEYS.                                                 22310008
223200     10 DS-UPC-UPC-ID                 PIC  S9(9) COMP.            22320008
223300***************************************************************** 22330008
223400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  40      22340008
223500***************************************************************** 22350008
223600******************************************************************22360008
223700* COBOL DECLARATION FOR TABLE TPOUPC                              22370008
223800******************************************************************22380008
223900*01  WS-POUPC.                                                    22390008
224000*    10 WS-POUPC-PO-NBR                  PIC  S9(9) COMP.         22400008
224100*    10 WS-POUPC-PO-LNE-NBR              PIC  S9(9) COMP.         22410008
224200*    10 WS-POUPC-UPC-ID                  PIC  S9(9) COMP.         22420008
224300*    10 WS-POUPC-UPC-QTY                 PIC  S9(9) COMP.         22430008
224400*    10 WS-POUPC-UPC-RATO-QTY-NBR        PIC  S9(4) COMP.         22440008
224500*    10 WS-POUPC-LAST-UPD-TMST           PIC   X(26).             22450008
224600*    10 WS-POUPC-LAST-UPD-USR-ID         PIC   X(8).              22460008
224700*01  WS-POUPC-KEYS.                                               22470008
224800*    10 DS-POUPC-PO-NBR                  PIC  S9(9) COMP.         22480008
224900*    10 DS-POUPC-PO-LNE-NBR              PIC  S9(9) COMP.         22490008
225000*    10 DS-POUPC-UPC-ID                  PIC  S9(9) COMP.         22500008
225100******************************************************************22510008
225200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *22520008
225300******************************************************************22530008
225400******************************************************************22540008
225500* COBOL DECLARATION FOR TABLE TALLTMP                             22550008
225600******************************************************************22560008
225700 01  WS-ALLTMP.                                                   22570008
225800     10 WS-ALLTMP-PO-NBR                 PIC  S9(9) COMP.         22580008
225900     10 WS-ALLTMP-DEST-NBR               PIC  S9(4) COMP.         22590008
226000     10 WS-ALLTMP-DEST-PCT               PIC  S9(4) COMP.         22600008
226100 01  WS-ALLTMP-KEYS.                                              22610008
226200     10 DS-ALLTMP-PO-NBR                 PIC  S9(9) COMP.         22620008
226300     10 DS-ALLTMP-DEST-NBR               PIC  S9(4) COMP.         22630008
226400******************************************************************22640008
226500* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   3     *22650008
226600******************************************************************22660008
226700******************************************************************22670008
226800* COBOL DECLARATION FOR TABLE TVNDAGR                             22680008
226900******************************************************************22690008
227000 01  WS-VNDAGR.                                                   22700008
227100     05  WS-VNDAGR-DATA.                                          22710008
227200         10 WS-VNDAGR-ENT-ID              PIC  S9(9) COMP.        22720008
227300         10 WS-VNDAGR-DEPT-NBR            PIC   X(3).             22730008
227400         10 WS-VNDAGR-AGRMT-TYP-ID        PIC   X(1).             22740008
227500         10 WS-VNDAGR-SEQ-NBR             PIC  S9(4) COMP.        22750008
227600         10 WS-VNDAGR-TYP-CDE             PIC  S9(4) COMP.        22760008
227700         10 WS-VNDAGR-EFFECTIVE-DATE      PIC   X(10).            22770008
227800         10 WS-VNDAGR-EXPIRATION-DATE     PIC   X(10).            22780008
227900         10 WS-VNDAGR-PROD-STATUS-IND     PIC   X(1).             22790008
228000         10 WS-VNDAGR-LEADTIME-DAYS-QTY   PIC  S9(4) COMP.        22800008
228100         10 WS-VNDAGR-BULK-STK-TKT-IND    PIC   X(1).             22810008
228200         10 WS-VNDAGR-TKT-MKR-IND         PIC   X(1).             22820008
228300         10 WS-VNDAGR-RTV-RA-REQD-IND     PIC   X(1).             22830008
228400         10 WS-VNDAGR-RTV-NO-RA-REQD-IND  PIC   X(1).             22840008
228500         10 WS-VNDAGR-DEBIT-DESTROY-IND   PIC   X(1).             22850008
228600         10 WS-VNDAGR-MARKOUT-IND         PIC   X(1).             22860008
228700         10 WS-VNDAGR-EARLY-SHIPT-IND     PIC   X(1).             22870008
228800         10 WS-VNDAGR-LATE-SHIPT-IND      PIC   X(1).             22880008
228900         10 WS-VNDAGR-PARTIAL-SHIPT-IND   PIC   X(1).             22890008
229000         10 WS-VNDAGR-FOB-POINT-TXT       PIC   X(20).            22900008
229100         10 WS-VNDAGR-SHIPT-POINT-TXT     PIC   X(20).            22910008
229200         10 WS-VNDAGR-DISCOUNT-PCT        PIC  SV9(4) COMP-3.     22920008
229300         10 WS-VNDAGR-EXT-PAY-DAYS-QTY    PIC  S9(4) COMP.        22930008
229400         10 WS-VNDAGR-PAYT-TERM-ID        PIC  S9(4) COMP.        22940008
229500         10 WS-VNDAGR-LAST-UPD-TMST       PIC   X(26).            22950008
229600         10 WS-VNDAGR-LAST-UPD-ID         PIC   X(8).             22960008
229700         10 WS-VNDAGR-PARTIAL-IND         PIC   X(1).             22970008
229800         10 WS-VNDAGR-FRGT-TERM-ID        PIC  S9(4) COMP.        22980008
229900         10 WS-VNDAGR-AP-TRN-CDE          PIC   X(2).             22990008
230000         10 WS-VNDAGR-VND-AUTH-ID         PIC   X(10).            23000008
230100         10 WS-VNDAGR-PSTG-FRQ-CDE        PIC   X(2).             23010008
230200         10 WS-VNDAGR-DED-DISC-IND        PIC   X(1).             23020008
230300         10 WS-VNDAGR-DED-RTV-IND         PIC   X(1).             23030008
230400     05  WS-VNDAGR-NULL.                                          23040008
230500*        10 WS-VNDAGR-NULLS OCCURS 36 TIMES PIC S9(4) COMP.       23050008
230600*        10 WS-VNDAGR-NULLS OCCURS 37 TIMES PIC S9(4) COMP.       23060008
230700         10 WS-VNDAGR-NULLS OCCURS 32 TIMES PIC S9(4) COMP.       23070008
230800 01  WS-VNDAGR-KEYS.                                              23080008
230900     10 DS-VNDAGR-ENT-ID              PIC  S9(9) COMP.            23090008
231000     10 DS-VNDAGR-DEPT-NBR            PIC   X(3).                 23100008
231100     10 DS-VNDAGR-AGRMT-TYP-ID        PIC   X(1).                 23110008
231200     10 DS-VNDAGR-SEQ-NBR             PIC  S9(4) COMP.            23120008
231300******************************************************************23130008
231400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  36     *23140008
231500******************************************************************23150008
231600******************************************************************23160008
231700* COBOL DECLARATION FOR TABLE TPAYREQ                             23170008
231800******************************************************************23180008
231900 01  WS-PAYREQ.                                                   23190008
232000     05  WS-PAYREQ-DATA.                                          23200008
232100         10 WS-PAYREQ-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.        23210008
232200         10 WS-PAYREQ-PAYT-REQ-TYP-CDE    PIC   X(2).             23220008
232300         10 WS-PAYREQ-REMIT-TO-DUN-NBR    PIC   X(9).             23230008
232400         10 WS-PAYREQ-ENTR-UID            PIC   X(8).             23240008
232500         10 WS-PAYREQ-ENTR-DTE            PIC   X(10).            23250008
232600         10 WS-PAYREQ-ENTR-TRMNL-ID       PIC   X(4).             23260008
232700         10 WS-PAYREQ-PO-NBR              PIC  S9(9) COMP.        23270008
232800         10 WS-PAYREQ-VER-NBR             PIC  S9(9) COMP.        23280008
232900     05 WS-PAYREQ-NULL.                                           23290008
233000        10 WS-PAYREQ-NULLS OCCURS 8 TIMES PIC S9(4) COMP.         23300008
233100 01  WS-PAYREQ-KEYS.                                              23310008
233200     10 DS-PAYREQ-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.            23320008
233300******************************************************************23330008
233400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   8     *23340008
233500******************************************************************23350008
233600******************************************************************23360008
233700* COBOL DECLARATION FOR TABLE TINVOIC                             23370008
233800******************************************************************23380008
233900 01  WS-INVOIC.                                                   23390008
234000     05  WS-INVOIC-DATA.                                          23400008
234100         10 WS-INVOIC-PO-NBR              PIC  S9(9) COMP.        23410008
234200         10 WS-INVOIC-INVC-ID             PIC   X(22).            23420008
234300         10 WS-INVOIC-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.        23430008
234400         10 WS-INVOIC-INVC-TYP-CDE        PIC   X(2).             23440008
234500         10 WS-INVOIC-ENTR-MTHD-CDE       PIC   X(2).             23450008
234600         10 WS-INVOIC-CRE-BY-USR-ID       PIC   X(8).             23460008
234700         10 WS-INVOIC-BAR-CDE             PIC   X(9).             23470008
234800         10 WS-INVOIC-SPLIT-TERMS-IND     PIC   X(1).             23480008
234900         10 WS-INVOIC-DTL-ENTR-IND        PIC   X(1).             23490008
235000         10 WS-INVOIC-INVC-CART-CT        PIC  S9(4) COMP.        23500008
235100         10 WS-INVOIC-CRE-DTE             PIC   X(10).            23510008
235200         10 WS-INVOIC-PPD-RVRSL-IND       PIC   X(1).             23520008
235300         10 WS-INVOIC-INVC-DTE            PIC   X(10).            23530008
235400         10 WS-INVOIC-GRO-COST-AMT        PIC  S9(8)V9(2) COMP-3. 23540008
235500         10 WS-INVOIC-INVC-NET-COST-AMT   PIC  S9(8)V9(2) COMP-3. 23550008
235600         10 WS-INVOIC-RMIT-VND-ID         PIC   X(9).             23560008
235700         10 WS-INVOIC-STR-NBR             PIC  S9(4) COMP.        23570008
235800         10 WS-INVOIC-HOLD-IND            PIC   X(1).             23580008
235900         10 WS-INVOIC-DUE-DTE-SRC-CDE     PIC   X(1).             23590008
236000         10 WS-INVOIC-CALC-DUE-DTE        PIC   X(10).            23600008
236100         10 WS-INVOIC-PAYT-DTE            PIC   X(10).            23610008
236200         10 WS-INVOIC-AP-PRC-DTE          PIC   X(10).            23620008
236300         10 WS-INVOIC-AP-PRC-CDE          PIC   X(1).             23630008
236400         10 WS-INVOIC-PAYT-RLSE-TMST      PIC   X(26).            23640008
236500         10 WS-INVOIC-STATUS-CDE          PIC   X(2).             23650008
236600         10 WS-INVOIC-STATUS-CHG-TMST     PIC   X(26).            23660008
236700     05  WS-INVOIC-NULL.                                          23670008
236800         10 WS-INVOIC-NULLS OCCURS 22 TIMES PIC S9(4) COMP.       23680008
236900 01  WS-INVOIC-KEYS.                                              23690008
237000     10 DS-INVOIC-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.            23700008
237100******************************************************************23710008
237200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  22     *23720008
237300******************************************************************23730008
237400******************************************************************23740008
237500* COBOL DECLARATION FOR TABLE TALCHRG                             23750008
237600******************************************************************23760008
237700 01  WS-ALCHRG.                                                   23770008
237800*    10 WS-ALCHRG-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.            23780008
237900     10 WS-ALCHRG-PO-NBR              PIC  S9(9) COMP.            23790008
238000     10 WS-ALCHRG-INVC-ID             PIC   X(22).                23800008
238100     10 WS-ALCHRG-ALW-CHRG-SEQ-NBR    PIC  S9(4) COMP.            23810008
238200     10 WS-ALCHRG-ALW-CHRG-TYP-CDE    PIC   X(1).                 23820008
238300     10 WS-ALCHRG-ALW-CHRG-CDE        PIC   X(3).                 23830008
238400     10 WS-ALCHRG-ALW-CHRG-SER-CDE    PIC   X(10).                23840008
238500     10 WS-ALCHRG-ALW-CHRG-PCT        PIC  SV9(4) COMP-3.         23850008
238600     10 WS-ALCHRG-ALW-CHRG-AMT        PIC  S9(8)V9(2) COMP-3.     23860008
238700 01  WS-ALCHRG-KEYS.                                              23870008
238800     10 DS-ALCHRG-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.            23880008
238900     10 DS-ALCHRG-ALW-CHRG-SEQ-NBR    PIC  S9(4) COMP.            23890008
239000******************************************************************23900008
239100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *23910008
239200******************************************************************23920008
239300******************************************************************23930008
239400* COBOL DECLARATION FOR TABLE TPREQIT                             23940008
239500******************************************************************23950008
239600 01  WS-PREQIT.                                                   23960008
239700     10 WS-PREQIT-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.            23970008
239800     10 WS-PREQIT-PAYT-REQ-LNE-NBR    PIC  S9(9) COMP.            23980008
239900     10 WS-PREQIT-PAY-REQ-LNE-QTY     PIC  S9(9) COMP.            23990008
240000     10 WS-PREQIT-QTY-UNT-OF-MSMT     PIC   X(2).                 24000008
240100     10 WS-PREQIT-UNT-COST-AMT        PIC  S9(7)V9(3) COMP-3.     24010008
240200 01  WS-PREQIT-KEYS.                                              24020008
240300     10 DS-PREQIT-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.            24030008
240400     10 DS-PREQIT-PAYT-REQ-LNE-NBR    PIC  S9(9) COMP.            24040008
240500******************************************************************24050008
240600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   5     *24060008
240700******************************************************************24070008
240800******************************************************************24080008
240900* COBOL DECLARATION FOR TABLE TASNDTL                             24090008
241000******************************************************************24100008
241100 01  WS-ASNDTL.                                                   24110008
241200     05  WS-ASNDTL-DATA.                                          24120008
241300         10 WS-ASNDTL-ASNHDR-ID           PIC  S9(9) COMP.        24130008
241400         10 WS-ASNDTL-ASNDTL-NBR          PIC  S9(7)V COMP-3.     24140008
241500         10 WS-ASNDTL-PO-NBR              PIC   X(22).            24150008
241600         10 WS-ASNDTL-SELR-INV-NBR        PIC   X(30).            24160008
241700         10 WS-ASNDTL-SEQ-NBR             PIC  S9(3)V COMP-3.     24170008
241800         10 WS-ASNDTL-UPC-NBR             PIC  S9(15)V COMP-3.    24180008
241900         10 WS-ASNDTL-ALT-PROD1-CDE       PIC   X(2).             24190008
242000         10 WS-ASNDTL-ALT-PROD1-ID        PIC   X(30).            24200008
242100         10 WS-ASNDTL-ALT-PROD2-CDE       PIC   X(2).             24210008
242200         10 WS-ASNDTL-ALT-PROD2-ID        PIC   X(30).            24220008
242300         10 WS-ASNDTL-SHIPT-QTY           PIC  S9(7)V COMP-3.     24230008
242400         10 WS-ASNDTL-SHIPT-DTE-QTY       PIC  S9(7)V COMP-3.     24240008
242500         10 WS-ASNDTL-SHIPT-UM-CDE        PIC   X(2).             24250008
242600         10 WS-ASNDTL-ITM-STATUS-CDE      PIC   X(2).             24260008
242700         10 WS-ASNDTL-ITM-ERR-CDE         PIC   X(1).             24270008
242800         10 WS-ASNDTL-ITM-ERR-QTY         PIC  S9(7)V COMP-3.     24280008
242900         10 WS-ASNDTL-ITM-ERR-QTY-UM-CDE  PIC   X(2).             24290008
243000         10 WS-ASNDTL-PKG-QTY             PIC  S9(7)V COMP-3.     24300008
243100         10 WS-ASNDTL-PKG-QTY-UM-CDE      PIC   X(2).             24310008
243200         10 WS-ASNDTL-VEND-ORD-QTY        PIC  S9(7)V COMP-3.     24320008
243300         10 WS-ASNDTL-ORD-QTY-UM-CDE      PIC   X(2).             24330008
243400         10 WS-ASNDTL-WGT-MSMT            PIC  S9(9)V9(2) COMP-3. 24340008
243500         10 WS-ASNDTL-VOL-MSMT            PIC  S9(9)V9(2) COMP-3. 24350008
243600         10 WS-ASNDTL-VOL-UM-CDE          PIC   X(2).             24360008
243700         10 WS-ASNDTL-LEN-MSMT            PIC  S9(9)V9(2) COMP-3. 24370008
243800         10 WS-ASNDTL-HT-MSMT             PIC  S9(9)V9(2) COMP-3. 24380008
243900         10 WS-ASNDTL-WDTH-MSMT           PIC  S9(9)V9(2) COMP-3. 24390008
244000         10 WS-ASNDTL-SIZE-UM-CDE         PIC   X(2).             24400008
244100         10 WS-ASNDTL-ITM-SUBST-UPC-NBR   PIC   X(12).            24410008
244200         10 WS-ASNDTL-TKT-ERR-CDE         PIC   X(4).             24420008
244300         10 WS-ASNDTL-WGT-UM-CDE          PIC   X(2).             24430008
244400         10 WS-ASNDTL-INPK-EA-QTY         PIC  S9(4) COMP.        24440008
244500         10 WS-ASNDTL-LOC-NBR             PIC  S9(4) COMP.        24450008
244600     05  WS-ASNDTL-NULL.                                          24460008
244700         10 WS-ASNDTL-NULLS OCCURS 32 TIMES PIC S9(4) COMP.       24470008
244800 01  WS-ASNDTL-KEYS.                                              24480008
244900     10 DS-ASNDTL-ASNHDR-ID           PIC  S9(9) COMP.            24490008
245000     10 DS-ASNDTL-ASNDTL-NBR          PIC  S9(7)V COMP-3.         24500008
245100******************************************************************24510008
245200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  32     *24520008
245300******************************************************************24530008
245400******************************************************************24540008
245500* COBOL DECLARATION FOR TABLE TASNORD                            *24550008
245600******************************************************************24560008
245700 01  WS-ASNORD.                                                   24570008
245800     05  WS-ASNORD-DATA.                                          24580008
245900         10 WS-ASNORD-ASNHDR-ID  PIC S9(9) USAGE COMP.            24590008
246000         10 WS-ASNORD-PO-NBR     PIC X(22).                       24600008
246100         10 WS-ASNORD-SEQ-NBR    PIC S9(3)V USAGE COMP-3.         24610008
246200         10 WS-ASNORD-SELR-INV-NBR PIC X(30).                     24620008
246300         10 WS-ASNORD-VEND-ORD-NBR PIC X(30).                     24630008
246400         10 WS-ASNORD-CUST-NBR   PIC X(30).                       24640008
246500         10 WS-ASNORD-PROMO-NBR  PIC X(30).                       24650008
246600         10 WS-ASNORD-VEND-NBR   PIC S9(3)V USAGE COMP-3.         24660008
246700         10 WS-ASNORD-MDSEDP-NBR PIC X(3).                        24670008
246800         10 WS-ASNORD-ORD-STATUS-CDE PIC X(2).                    24680008
246900         10 WS-ASNORD-CHG-ORD-SEQ-NBR PIC X(8).                   24690008
247000         10 WS-ASNORD-PO-DTE     PIC X(10).                       24700008
247100         10 WS-ASNORD-LTE-CHG-AMT PIC S9(6)V9(2) USAGE COMP-3.    24710008
247200         10 WS-ASNORD-EXCH-FCTR  PIC S9(6)V9(5) USAGE COMP-3.     24720008
247300         10 WS-ASNORD-SELR-CUR-CDE PIC X(3).                      24730008
247400         10 WS-ASNORD-MTCH-PO-CDE PIC X(1).                       24740008
247500         10 WS-ASNORD-EARLY-LTE-CDE PIC X(1).                     24750008
247600         10 WS-ASNORD-SEQ-NBR-IND PIC X(1).                       24760008
247700         10 WS-ASNORD-CART-SHIP-QTY PIC S9(9) USAGE COMP.         24770008
246300         10 WS-ASNORD-LOC-NBR       PIC S9(4) USAGE COMP.         24771009
247800     05  WS-ASNORD-NULL.                                          24780008
247900         10 WS-ASNORD-NULLS OCCURS 18 TIMES PIC S9(4) COMP.       24790008
248000 01  WS-ASNORD-KEYS.                                              24800008
248100     10 DS-ASNORD-ASNHDR-ID     PIC S9(9) USAGE COMP.             24810008
248200     10 DS-SASNORD-PO-NBR       PIC X(15).                        24820008
248300     10 DS-ASNORD-SEQ-NBR       PIC S9(3)V USAGE COMP-3.          24830008
248400     10 DS-ASNORD-SELR-INV-NBR  PIC X(30).                        24840008
248500******************************************************************24850008
248600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 18      *24860008
248700******************************************************************24870008
248800******************************************************************24880008
248900* COBOL DECLARATION FOR TABLE TASNHDR                             24890008
249000******************************************************************24900008
249100 01  WS-ASNHDR.                                                   24910008
249200     05  WS-ASNHDR-DATA.                                          24920008
249300         10 WS-ASNHDR-OPERCO-NBR          PIC   X(2).             24930008
249400         10 WS-ASNHDR-EDI-VEND-ID         PIC   X(17).            24940008
249500         10 WS-ASNHDR-ASNHDR-NBR          PIC   X(30).            24950008
249600         10 WS-ASNHDR-ASNHDR-ID           PIC  S9(9) COMP.        24960008
249700         10 WS-ASNHDR-ASNHDR-TMST         PIC   X(26).            24970008
249800         10 WS-ASNHDR-CRE-DTE             PIC   X(10).            24980008
249900         10 WS-ASNHDR-SHIP-DTE            PIC   X(10).            24990008
250000         10 WS-ASNHDR-BOL-NBR             PIC   X(30).            25000008
250100         10 WS-ASNHDR-PRO-NBR             PIC   X(30).            25010008
250200         10 WS-ASNHDR-CART-SHIP-QTY       PIC  S9(7)V COMP-3.     25020008
250300         10 WS-ASNHDR-GRO-WGHT-MSMT       PIC  S9(9)V9(2) COMP-3. 25030008
250400         10 WS-ASNHDR-ANTC-DELY-DTE       PIC   X(10).            25040008
250500         10 WS-ASNHDR-REC-MTHD-IND        PIC   X(1).             25050008
250600         10 WS-ASNHDR-SHIPT-STATUS-CDE    PIC   X(2).             25060008
250700         10 WS-ASNHDR-CARR-NAME           PIC   X(35).            25070008
250800         10 WS-ASNHDR-TRANS-MTHD-CDE      PIC   X(2).             25080008
250900         10 WS-ASNHDR-CARR-ID-CDE         PIC   X(17).            25090008
251000         10 WS-ASNHDR-CARR-ID-QUAL-CDE    PIC   X(2).             25100008
251100         10 WS-ASNHDR-RTE-SEQ-CDE         PIC   X(2).             25110008
251200         10 WS-ASNHDR-SHPT-VOL-MSMT       PIC  S9(9)V9(2) COMP-3. 25120008
251300         10 WS-ASNHDR-EQUIP-INIT-CDE      PIC   X(4).             25130008
251400         10 WS-ASNHDR-EQUIP-NBR           PIC   X(10).            25140008
251500         10 WS-ASNHDR-SCHD-SHIP-DTE       PIC   X(10).            25150008
251600         10 WS-ASNHDR-CRE-TM              PIC   X(8).             25160008
251700         10 WS-ASNHDR-REJ-SHIPT-CDE       PIC   X(1).             25170008
251800         10 WS-ASNHDR-SHPT-VOL-UM-CDE     PIC   X(2).             25180008
251900         10 WS-ASNHDR-GRO-WGHT-UM-CDE     PIC   X(2).             25190008
252000         10 WS-ASNHDR-PRINT-IND           PIC   X(1).             25200008
252100         10 WS-ASNHDR-SHIP-PAYT-TERM-CDE  PIC   X(2).             25210008
252200         10 WS-ASNHDR-RESPBL-LOC-CDE      PIC   X(2).             25220008
252300         10 WS-ASNHDR-RESPBL-LOC-DESC.                            25230008
252400            49 ASNHDR-RESPBL-LOC-DESC-LEN     PIC S9(4) COMP.     25240008
252500            49 ASNHDR-RESPBL-LOC-DESC-TEXT    PIC X(80).          25250008
252600         10 WS-ASNHDR-DC-PRT-IND          PIC   X(1).             25260008
252700         10 WS-ASNHDR-SHIP-TM             PIC   X(8).             25270008
252800    05  WS-ASNHDR-NULL.                                           25280008
252900        10 WS-ASNHDR-NULLS OCCURS 33 TIMES PIC S9(4) COMP.        25290008
253000 01  WS-ASNHDR-KEYS.                                              25300008
253100     10 DS-ASNHDR-ASNHDR-ID           PIC  S9(9) COMP.            25310008
253200     10 DS-ASNHDR-ASNHDR-TMST         PIC   X(26).                25320008
253300******************************************************************25330008
253400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  33     *25340008
253500******************************************************************25350008
253600******************************************************************25360008
253700* COBOL DECLARATION FOR TABLE TASCRIT                            *25370008
253800******************************************************************25380008
253900 01  WS-ASCRIT.                                                   25390008
254000     10 WS-ASCRIT-ASNHDR-ID     PIC S9(9) USAGE COMP.             25400008
254100     10 WS-ASCRIT-ASNCAR-NBR    PIC X(45).                        25410008
254200     10 WS-ASCRIT-ASNDTL-NBR    PIC S9(7)V USAGE COMP-3.          25420008
254300 01  WS-ASCRIT-KEYS.                                              25430008
254400     10 DS-ASCRIT-ASNHDR-ID     PIC S9(9) USAGE COMP.             25440008
254500     10 DS-ASCRIT-SASNCAR-NBR   PIC X(42).                        25450008
254600     10 DS-ASCRIT-ASNDTL-NBR    PIC S9(7)V USAGE COMP-3.          25460008
254700******************************************************************25470008
254800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 3       *25480008
254900******************************************************************25490008
255000******************************************************************25500008
255100* COBOL DECLARATION FOR TABLE TASNCAR                             25510008
255200******************************************************************25520008
255300 01  WS-ASNCAR.                                                   25530008
255400     05  WS-ASNCAR-DATA.                                          25540008
255500         10 WS-ASNCAR-ASNHDR-ID           PIC  S9(9) COMP.        25550008
255600         10 WS-ASNCAR-ASNCAR-NBR          PIC   X(45).            25560008
255700         10 WS-ASNCAR-PO-NBR              PIC   X(22).            25570008
255800         10 WS-ASNCAR-SEQ-NBR             PIC  S9(3)V COMP-3.     25580008
255900         10 WS-ASNCAR-SELR-INV-NBR        PIC   X(30).            25590008
256000         10 WS-ASNCAR-VOL-MSMT            PIC  S9(9)V9(2) COMP-3. 25600008
256100         10 WS-ASNCAR-WGHT-MSMT           PIC  S9(9)V9(2) COMP-3. 25610008
256200         10 WS-ASNCAR-NBR-QUAL-CDE        PIC   X(2).             25620008
256300         10 WS-ASNCAR-PKG-QTY             PIC  S9(7)V COMP-3.     25630008
256400         10 WS-ASNCAR-PKG-QTY-UM-CDE      PIC   X(2).             25640008
256500         10 WS-ASNCAR-WGHT-UM-CDE         PIC   X(2).             25650008
256600         10 WS-ASNCAR-VOL-UM-CDE          PIC   X(2).             25660008
256700         10 WS-ASNCAR-PKG-CDE             PIC   X(3).             25670008
256800         10 WS-ASNCAR-LEN-MSMT            PIC  S9(9)V9(2) COMP-3. 25680008
256900         10 WS-ASNCAR-HT-MSMT             PIC  S9(9)V9(2) COMP-3. 25690008
257000         10 WS-ASNCAR-WDTH-MSMT           PIC  S9(9)V9(2) COMP-3. 25700008
257100         10 WS-ASNCAR-SIZE-UM-CDE         PIC   X(2).             25710008
257200         10 WS-ASNCAR-PKG-SIZE-QTY        PIC  S9(7)V COMP-3.     25720008
257300         10 WS-ASNCAR-INPK-EA-QTY         PIC  S9(4) COMP.        25730008
257400    05  WS-ASNCAR-NULL.                                           25740008
257500        10 WS-ASNCAR-NULLS OCCURS 19 TIMES PIC S9(4) COMP.        25750008
257600 01  WS-ASNCAR-KEYS.                                              25760008
257700     10 DS-ASNCAR-ASNHDR-ID           PIC  S9(9) COMP.            25770008
257800     10 DS-ASNCAR-ASNCAR-NBR          PIC   X(45).                25780008
257900******************************************************************25790008
258000* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  19     *25800008
258100******************************************************************25810008
258200******************************************************************25820008
258300* COBOL DECLARATION FOR TABLE TDISTHD                             25830008
258400******************************************************************25840008
258500 01  WS-DISTHD.                                                   25850008
258600     10 WS-DISTHD-ORD-NBR                PIC  S9(9) COMP.         25860008
258700     10 WS-DISTHD-RCVR-SEQ-NBR           PIC  S9(9) COMP.         25870008
258800     10 WS-DISTHD-ORD-LNE-NBR            PIC  S9(9) COMP.         25880008
258900     10 WS-DISTHD-WRK-ORD-SEQ-NBR        PIC  S9(4) COMP.         25890008
259000     10 WS-DISTHD-OPER-UNT-ID            PIC  S9(4) COMP.         25900008
259100     10 WS-DISTHD-DISTRB-PRC-AREA-ID     PIC   X(4).              25910008
259200     10 WS-DISTHD-PRCG-STAT-CDE          PIC   X(1).              25920008
259300     10 WS-DISTHD-CRE-TMST               PIC   X(26).             25930008
259400     10 WS-DISTHD-RSLTS-RCVD-TMST        PIC   X(26).             25940008
259500     10 WS-DISTHD-VRFD-TMST              PIC   X(26).             25950008
259600     10 WS-DISTHD-PRC-AREA-MODU-ID       PIC   X(3).              25960008
259700     10 WS-DISTHD-CRE-USR-ID             PIC   X(8).              25970008
259800     10 WS-DISTHD-TOT-CART-CNT           PIC  S9(4) COMP.         25980008
259900     10 WS-DISTHD-CART-DWNLD-DTE         PIC   X(10).             25990008
260000     10 WS-DISTHD-CART-DWNLD-TM          PIC   X(8).              26000008
260100     10 WS-DISTHD-CART-DWNLD-USR-ID      PIC   X(8).              26010008
260200     10 WS-DISTHD-FCSE-CART-CNT          PIC  S9(4) COMP.         26020008
260300     10 WS-DISTHD-FCSE-LBL-TYP-CDE       PIC   X(1).              26030008
260400     10 WS-DISTHD-P2L-CART-CNT           PIC  S9(4) COMP.         26040008
260500     10 WS-DISTHD-INPK-CART-CNT          PIC  S9(4) COMP.         26050008
260600     10 WS-DISTHD-INPK-UNT-QTY           PIC  S9(4) COMP.         26060008
260700     10 WS-DISTHD-INPK-CNVYB-IND         PIC   X(1).              26070008
260800     10 WS-DISTHD-OTPK-UNT-QTY           PIC  S9(4) COMP.         26080008
260900     10 WS-DISTHD-SYS-CRE-CDE            PIC   X(1).              26090008
261000     10 WS-DISTHD-SPC-INSTR-DESC         PIC   X(5).              26100008
261100     10 WS-DISTHD-FCSE-CNFRMN-TMST       PIC   X(26).             26110008
261200     10 WS-DISTHD-FCSE-CNFRMN-USR-ID     PIC   X(8).              26120008
261300     10 WS-DISTHD-FCSE-CNFRMN-PGM-ID     PIC   X(8).              26130008
261400     10 WS-DISTHD-ACTV-IND               PIC   X(1).              26140008
261500     10 WS-DISTHD-DLT-REQ-SRC-ID         PIC   X(8).              26150008
261600     10 WS-DISTHD-DLT-REQ-TMST           PIC   X(26).             26160008
261700     10 WS-DISTHD-DLT-RSLT-CDE           PIC   X(1).              26170008
261800     10 WS-DISTHD-P2L-SCN-CART-CNT       PIC  S9(4) COMP.         26180008
261900     10 WS-DISTHD-CRE-LBL-OPT-CDE        PIC   X(1).              26190008
262000     10 WS-DISTHD-FCSE-FCLTY-AREA-ID     PIC   X(6).              26200008
262100     10 WS-DISTHD-ODD-CART-UNT-QTY       PIC  S9(4) COMP.         26210008
262200     10 WS-DISTHD-PREPK-LNE-PRC-CDE      PIC   X(1).              26220008
262300     10 WS-DISTHD-UCC128-DAT-USG-CDE     PIC   X(1).              26230008
262400     10 WS-DISTHD-CAL-UNT-PRCD-QTY       PIC  S9(4) COMP.         26240008
262500 01  WS-DISTHD-KEYS.                                              26250008
262600     10 DS-DISTHD-ORD-NBR                PIC  S9(9) COMP.         26260008
262700     10 DS-DISTHD-RCVR-SEQ-NBR           PIC  S9(9) COMP.         26270008
262800     10 DS-DISTHD-ORD-LNE-NBR            PIC  S9(9) COMP.         26280008
262900******************************************************************26290008
263000* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  36     *26300008
263100******************************************************************26310008
263200******************************************************************26320008
263300* COBOL DECLARATION FOR TABLE TDISTDT                             26330008
263400******************************************************************26340008
263500 01  WS-DISTDT.                                                   26350008
263600     10 WS-DISTDT-ORD-NBR                PIC  S9(9) COMP.         26360008
263700     10 WS-DISTDT-RCVR-SEQ-NBR           PIC  S9(9) COMP.         26370008
263800     10 WS-DISTDT-ORD-LNE-NBR            PIC  S9(9) COMP.         26380008
263900     10 WS-DISTDT-WRK-ORD-SEQ-NBR        PIC  S9(4) COMP.         26390008
264000     10 WS-DISTDT-STR-NBR                PIC  S9(4) COMP.         26400008
264100     10 WS-DISTDT-EXPTED-ALLOC-QTY       PIC  S9(9) COMP.         26410008
264200     10 WS-DISTDT-ACTL-ALLOC-QTY         PIC  S9(9) COMP.         26420008
264300     10 WS-DISTDT-RCVG-PSTD-STAT-CDE     PIC   X(1).              26430008
264400     10 WS-DISTDT-P2L-SPLT-UNT-QTY       PIC  S9(9) COMP.         26440008
264500     10 WS-DISTDT-FCSE-SPLT-UNT-QTY      PIC  S9(9) COMP.         26450008
264600     10 WS-DISTDT-INPK-SPLT-UNT-QTY      PIC  S9(9) COMP.         26460008
264700     10 WS-DISTDT-FCSE-ACTL-UNT-QTY      PIC  S9(9) COMP.         26470008
264800     10 WS-DISTDT-ODD-CART-IND           PIC   X(1).              26480008
264900     10 WS-DISTDT-PREPK-ODD-UNT-QTY      PIC  S9(4) COMP.         26490008
265000 01  WS-DISTDT-KEYS.                                              26500008
265100     10 DS-DISTDT-ORD-NBR                PIC  S9(9) COMP.         26510008
265200     10 DS-DISTDT-RCVR-SEQ-NBR           PIC  S9(9) COMP.         26520008
265300     10 DS-DISTDT-ORD-LNE-NBR            PIC  S9(9) COMP.         26530008
265400     10 DS-DISTDT-STR-NBR                PIC  S9(4) COMP.         26540008
265500******************************************************************26550008
265600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  13     *26560008
265700******************************************************************26570008
265800******************************************************************26580008
265900* COBOL DECLARATION FOR TABLE TWRKORD                             26590008
266000******************************************************************26600008
266100 01  WS-WRKORD.                                                   26610008
266200     10 WS-WRKORD-ORD-NBR                PIC  S9(9) COMP.         26620008
266300     10 WS-WRKORD-RCVR-SEQ-NBR           PIC  S9(9) COMP.         26630008
266400     10 WS-WRKORD-ORD-LNE-NBR            PIC  S9(4) COMP.         26640008
266500     10 WS-WRKORD-WORK-ORD-SEQ-NBR       PIC  S9(4) COMP.         26650008
266600     10 WS-WRKORD-OPER-UNT-ID            PIC  S9(4) COMP.         26660008
266700     10 WS-WRKORD-FCLTY-ID               PIC  S9(4) COMP.         26670008
266800     10 WS-WRKORD-CRE-TMST               PIC   X(26).             26680008
266900     10 WS-WRKORD-VER-STATUS-CDE         PIC   X(1).              26690008
267000     10 WS-WRKORD-CRE-UID-ID             PIC   X(8).              26700008
267100     10 WS-WRKORD-EXPTED-CART-CNT        PIC  S9(9) COMP.         26710008
267200     10 WS-WRKORD-ACTL-CART-CNT          PIC  S9(9) COMP.         26720008
267300     10 WS-WRKORD-EXPTED-ITM-CNT         PIC  S9(9) COMP.         26730008
267400     10 WS-WRKORD-ACTL-ITM-CNT           PIC  S9(9) COMP.         26740008
267500     10 WS-WRKORD-STAT-CDE               PIC   X(2).              26750008
267600     10 WS-WRKORD-WORK-ORD-DISTR-IND     PIC   X(2).              26760008
267700     10 WS-WRKORD-OPER-SET-ID            PIC  S9(4) COMP.         26770008
267800     10 WS-WRKORD-INST-CART-CNT          PIC  S9(9) COMP.         26780008
267900     10 WS-WRKORD-INST-LNE-LOC-CDE       PIC   X(5).              26790008
268000     10 WS-WRKORD-INST-PRC-AREA-ID       PIC   X(6).              26800008
268100     10 WS-WRKORD-WO-INSTR-SEL-IND       PIC   X(1).              26810008
268200     10 WS-WRKORD-INST-ITM-CNT           PIC  S9(9) COMP.         26820008
268300 01  WS-WRKORD-KEYS.                                              26830008
268400     10 DS-WRKORD-ORD-NBR                PIC  S9(9) COMP.         26840008
268500     10 DS-WRKORD-RCVR-SEQ-NBR           PIC  S9(9) COMP.         26850008
268600     10 DS-WRKORD-ORD-LNE-NBR            PIC  S9(4) COMP.         26860008
268700     10 DS-WRKORD-WORK-ORD-SEQ-NBR       PIC  S9(4) COMP.         26870008
268800     10 DS-WRKORD-OPER-UNT-ID            PIC  S9(4) COMP.         26880008
268900     10 DS-WRKORD-FCLTY-ID               PIC  S9(4) COMP.         26890008
269000     10 DS-WRKORD-CRE-TMST               PIC   X(26).             26900008
269100******************************************************************26910008
269200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  21     *26920008
269300******************************************************************26930008
269400******************************************************************26940008
269500* COBOL DECLARATION FOR TABLE TWKORIN                             26950008
269600******************************************************************26960008
269700 01  WS-WKORIN.                                                   26970008
269800     10 WS-WKORIN-ORD-NBR                PIC  S9(9) COMP.         26980008
269900     10 WS-WKORIN-RCVR-SEQ-NBR           PIC  S9(9) COMP.         26990008
270000     10 WS-WKORIN-ORD-LNE-NBR            PIC  S9(4) COMP.         27000008
270100     10 WS-WKORIN-WORK-ORD-SEQ-NBR       PIC  S9(4) COMP.         27010008
270200     10 WS-WKORIN-OPER-UNT-ID            PIC  S9(4) COMP.         27020008
270300     10 WS-WKORIN-FCLTY-ID               PIC  S9(4) COMP.         27030008
270400     10 WS-WKORIN-WO-INSTR-SEQ-NBR       PIC  S9(4) COMP.         27040008
270500     10 WS-WKORIN-CRE-TMST               PIC   X(26).             27050008
270600     10 WS-WKORIN-VER-STATUS-CDE         PIC   X(1).              27060008
270700     10 WS-WKORIN-CRE-UID-ID             PIC   X(8).              27070008
270800     10 WS-WKORIN-OPER-ID                PIC  S9(4) COMP.         27080008
270900     10 WS-WKORIN-FCLTY-AREA-ID          PIC   X(6).              27090008
271000     10 WS-WKORIN-PRC-FCLTY-AREA-ID      PIC   X(6).              27100008
271100     10 WS-WKORIN-EXPTED-CART-CNT        PIC  S9(9) COMP.         27110008
271200     10 WS-WKORIN-ACTL-CART-CNT          PIC  S9(9) COMP.         27120008
271300     10 WS-WKORIN-ALLOC-IND              PIC   X(1).              27130008
271400     10 WS-WKORIN-REPACK-IND             PIC   X(1).              27140008
271500     10 WS-WKORIN-STRT-TMST              PIC   X(26).             27150008
271600     10 WS-WKORIN-STOP-TMST              PIC   X(26).             27160008
271700     10 WS-WKORIN-SCREEN-SEQ-NBR         PIC  S9(4) COMP.         27170008
271800     10 WS-WKORIN-LNE-LOC-CDE            PIC   X(5).              27180008
271900     10 WS-WKORIN-REC-SEL-IND            PIC   X(1).              27190008
272000 01  WS-WKORIN-KEYS.                                              27200008
272100     10 DS-WKORIN-ORD-NBR                PIC  S9(9) COMP.         27210008
272200     10 DS-WKORIN-RCVR-SEQ-NBR           PIC  S9(9) COMP.         27220008
272300     10 DS-WKORIN-ORD-LNE-NBR            PIC  S9(4) COMP.         27230008
272400     10 DS-WKORIN-WORK-ORD-SEQ-NBR       PIC  S9(4) COMP.         27240008
272500     10 DS-WKORIN-OPER-UNT-ID            PIC  S9(4) COMP.         27250008
272600     10 DS-WKORIN-FCLTY-ID               PIC  S9(4) COMP.         27260008
272700     10 DS-WKORIN-WO-INSTR-SEQ-NBR       PIC  S9(4) COMP.         27270008
272800     10 DS-WKORIN-CRE-TMST               PIC   X(26).             27280008
272900******************************************************************27290008
273000* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  22     *27300008
273100******************************************************************27310008
273200******************************************************************27320008
273300* COBOL DECLARATION FOR TABLE TSEASET                             27330008
273400******************************************************************27340008
273500 01  WS-SEASET.                                                   27350008
273600     10 WS-SEASET-SEASET-YR              PIC   X(4).              27360008
273700     10 WS-SEASET-SEASET-SHRT-NM         PIC   X(5).              27370008
273800     10 WS-SEASET-SEASET-TYP-CDE         PIC   X(3).              27380008
273900     10 WS-SEASET-SEASET-NM              PIC   X(25).             27390008
274000     10 WS-SEASET-SEASET-STAT-CDE        PIC   X(1).              27400008
274100     10 WS-SEASET-STR-STUP-BEG-DTE       PIC   X(10).             27410008
274200     10 WS-SEASET-STR-STUP-END-DTE       PIC   X(10).             27420008
274300     10 WS-SEASET-STR-RLSE-BEG-DTE       PIC   X(10).             27430008
274400     10 WS-SEASET-STR-RLSE-END-DTE       PIC   X(10).             27440008
274500     10 WS-SEASET-LAST-UPD-BY-USR-ID     PIC   X(8).              27450008
274600     10 WS-SEASET-LAST-UPD-TMST          PIC   X(26).             27460008
274700     10 WS-SEASET-DIVERT-PFX-NBR         PIC  S9(4) COMP.         27470008
274800 01  WS-SEASET-KEYS.                                              27480008
274900     10 DS-SEASET-SEASET-YR              PIC   X(4).              27490008
275000     10 DS-SEASET-SEASET-SHRT-NM         PIC   X(5).              27500008
275100******************************************************************27510008
275200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  12     *27520008
275300******************************************************************27530008
275400******************************************************************27540008
275500* COBOL DECLARATION FOR TABLE TSUNAUD                             27550008
275600******************************************************************27560008
275700 01  WS-SUNAUD.                                                   27570008
275800     10 WS-SUNAUD-AUD-CNTL-NBR           PIC  S9(9) COMP.         27580008
275900     10 WS-SUNAUD-AUD-STRT-TMST          PIC   X(26).             27590008
276000     10 WS-SUNAUD-AUD-STP-TMST           PIC   X(26).             27600008
276100     10 WS-SUNAUD-AUD-PSPND-MNIT-QTY     PIC  S9(9) COMP.         27610008
276200     10 WS-SUNAUD-AUD-CLO-MNIT-QTY       PIC  S9(9) COMP.         27620008
276300     10 WS-SUNAUD-AUD-USR-ID             PIC   X(8).              27630008
276400     10 WS-SUNAUD-OPER-UNT-ID            PIC  S9(4) COMP.         27640008
276500     10 WS-SUNAUD-FCLTY-ID               PIC  S9(4) COMP.         27650008
276600     10 WS-SUNAUD-PRC-FCLTY-AREA-ID      PIC   X(6).              27660008
276700     10 WS-SUNAUD-AUD-STAT-CDE           PIC   X(2).              27670008
276800     10 WS-SUNAUD-AUD-TYP-CDE            PIC   X(2).              27680008
276900 01  WS-SUNAUD-KEYS.                                              27690008
277000     10 DS-SUNAUD-AUD-CNTL-NBR           PIC  S9(9) COMP.         27700008
277100******************************************************************27710008
277200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  11     *27720008
277300******************************************************************27730008
277400******************************************************************27740008
277500* COBOL DECLARATION FOR TABLE TSUATRN                             27750008
277600******************************************************************27760008
277700 01  WS-SUATRN.                                                   27770008
277800     10 WS-SUATRN-AUD-CNTL-NBR           PIC  S9(9) COMP.         27780008
277900     10 WS-SUATRN-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.     27790008
278000     10 WS-SUATRN-UNT-AUD-STRT-TMST      PIC   X(26).             27800008
278100     10 WS-SUATRN-UNT-AUD-STP-TMST       PIC   X(26).             27810008
278200     10 WS-SUATRN-UNT-PSPND-MNIT-QTY     PIC  S9(9) COMP.         27820008
278300     10 WS-SUATRN-UNT-CLO-MNIT-QTY       PIC  S9(9) COMP.         27830008
278400     10 WS-SUATRN-UNT-AUD-USR-ID         PIC   X(8).              27840008
278500     10 WS-SUATRN-UNT-AUD-STAT-CDE       PIC   X(2).              27850008
278600     10 WS-SUATRN-TRN-NBR                PIC  S9(9) COMP.         27860008
278700     10 WS-SUATRN-REC-SEQ-NBR            PIC  S9(9) COMP.         27870008
278800     10 WS-SUATRN-DEST-OPER-UNT-ID       PIC  S9(4) COMP.         27880008
278900     10 WS-SUATRN-DEST-FCLTY-ID          PIC  S9(4) COMP.         27890008
279000     10 WS-SUATRN-UNT-AUD-ERR-IND        PIC   X(1).              27900008
279100     10 WS-SUATRN-UNT-RSTRT-MNIT-QTY     PIC  S9(9) COMP.         27910008
279200 01  WS-SUATRN-KEYS.                                              27920008
279300     10 DS-SUATRN-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.     27930008
279400     10 DS-SUATRN-AUD-CNTL-NBR           PIC  S9(9) COMP.         27940008
279500******************************************************************27950008
279600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  14     *27960008
279700******************************************************************27970008
279800******************************************************************27980008
279900* COBOL DECLARATION FOR TABLE TSUAUPC                             27990008
280000******************************************************************28000008
280100 01  WS-SUAUPC.                                                   28010008
280200     10 WS-SUAUPC-AUD-CNTL-NBR        PIC  S9(9) COMP.            28020008
280300     10 WS-SUAUPC-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.        28030008
280400     10 WS-SUAUPC-UPC-NBR             PIC  S9(15)V COMP-3.        28040008
280500     10 WS-SUAUPC-SCN-TMST            PIC   X(26).                28050008
280600     10 WS-SUAUPC-AUD-USR-ID          PIC   X(8).                 28060008
280700     10 WS-SUAUPC-ITM-DESC            PIC   X(20).                28070008
280800     10 WS-SUAUPC-VND-STYL-DESC       PIC   X(20).                28080008
280900     10 WS-SUAUPC-UPC-CLOR-DESC       PIC   X(10).                28090008
281000     10 WS-SUAUPC-UPC-SIZE-DESC       PIC   X(10).                28100008
281100     10 WS-SUAUPC-UPC-RTL-AMT         PIC  S9(5)V9(2) COMP-3.     28110008
281200     10 WS-SUAUPC-UPC-CERTD-IND       PIC   X(1).                 28120008
281300     10 WS-SUAUPC-SCND-UNT-QTY        PIC  S9(9) COMP.            28130008
281400     10 WS-SUAUPC-SCN-TYP-CDE         PIC   X(1).                 28140008
281500     10 WS-SUAUPC-SKU-NBR             PIC  S9(8)V COMP-3.         28150008
281600     10 WS-SUAUPC-DEPT-NBR            PIC  S9(4)V COMP-3.         28160008
281700     10 WS-SUAUPC-MAJ-CL-NBR          PIC  S9(4)V COMP-3.         28170008
281800     10 WS-SUAUPC-SUB-CL-NBR          PIC  S9(4)V COMP-3.         28180008
281900 01  WS-SUAUPC-KEYS.                                              28190008
282000     10 DS-SUAUPC-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.     28200008
282100     10 DS-SUAUPC-AUD-CNTL-NBR           PIC  S9(9) COMP.         28210008
282200     10 DS-SUAUPC-UPC-NBR                PIC  S9(15)V COMP-3.     28220008
282300     10 DS-SUAUPC-SCN-TMST               PIC   X(26).             28230008
282400******************************************************************28240008
282500* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  14     *28250008
282600******************************************************************28260008
282700******************************************************************28270008
282800* COBOL DECLARATION FOR TABLE TSUEXCP                             28280008
282900******************************************************************28290008
283000 01  WS-SUEXCP.                                                   28300008
283100     10 WS-SUEXCP-AUD-CNTL-NBR           PIC  S9(9) COMP.         28310008
283200     10 WS-SUEXCP-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.     28320008
283300     10 WS-SUEXCP-UPC-NBR                PIC  S9(15)V COMP-3.     28330008
283400     10 WS-SUEXCP-SCN-TMST               PIC   X(26).             28340008
283500     10 WS-SUEXCP-VILN-GP-CDE            PIC   X(3).              28350008
283600     10 WS-SUEXCP-VILN-GP-SEQ-NBR        PIC  S9(4) COMP.         28360008
283700     10 WS-SUEXCP-OVRRID-SYS-DAT-TXT     PIC   X(20).             28370008
283800 01  WS-SUEXCP-KEYS.                                              28380008
283900     10 DS-SUEXCP-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.     28390008
284000     10 DS-SUEXCP-AUD-CNTL-NBR           PIC  S9(9) COMP.         28400008
284100     10 DS-SUEXCP-UPC-NBR                PIC  S9(15)V COMP-3.     28410008
284200     10 DS-SUEXCP-VILN-GP-CDE            PIC   X(3).              28420008
284300     10 DS-SUEXCP-VILN-GP-SEQ-NBR        PIC  S9(4) COMP.         28430008
284400     10 DS-SUEXCP-SCN-TMST               PIC   X(26).             28440008
284500******************************************************************28450008
284600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *28460008
284700******************************************************************28470008
284800******************************************************************28480008
284900* COBOL DECLARATION FOR TABLE TCTEXCP                             28490008
285000******************************************************************28500008
285100 01  WS-CTEXCP.                                                   28510008
285200     10 WS-CTEXCP-AUD-CNTL-NBR           PIC  S9(9) COMP.         28520008
285300     10 WS-CTEXCP-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.     28530008
285400     10 WS-CTEXCP-VILN-GP-CDE            PIC   X(3).              28540008
285500     10 WS-CTEXCP-VILN-GP-SEQ-NBR        PIC  S9(4) COMP.         28550008
285600     10 WS-CTEXCP-OVRRID-SYS-DAT-TXT     PIC   X(20).             28560008
285700 01  WS-CTEXCP-KEYS.                                              28570008
285800     10 DS-CTEXCP-AUD-CNTL-NBR           PIC  S9(9) COMP.         28580008
285900     10 DS-CTEXCP-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.     28590008
286000     10 DS-CTEXCP-VILN-GP-CDE            PIC   X(3).              28600008
286100     10 DS-CTEXCP-VILN-GP-SEQ-NBR        PIC  S9(4) COMP.         28610008
286200******************************************************************28620008
286300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   5     *28630008
286400******************************************************************28640008
286500******************************************************************28650008
286600* COBOL DECLARATION FOR TABLE TIMTBKY                             28660008
286700******************************************************************28670008
286800 01  WS-IMTBKY.                                                   28680008
286900     10 WS-IMTBKY-NOTIF-NBR              PIC  S9(9) COMP.         28690008
287000     10 WS-IMTBKY-IMPRT-ID               PIC   X(12).             28700008
287100     10 WS-IMTBKY-IMPRT-SEQ-NBR          PIC  S9(4) COMP.         28710008
287200     10 WS-IMTBKY-PRCS-TYP-CDE           PIC   X(2).              28720008
287300     10 WS-IMTBKY-CRE-TMST               PIC   X(26).             28730008
287400 01  WS-IMTBKY-KEYS.                                              28740008
287500     10 DS-IMTBKY-NOTIF-NBR              PIC  S9(9) COMP.         28750008
287600******************************************************************28760008
287700* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   5     *28770008
287800******************************************************************28780008
287900******************************************************************28790008
288000* COBOL DECLARATION FOR TABLE TPOPRPK                             28800008
288100******************************************************************28810008
288200 01  WS-POPRPK.                                                   28820008
288300     10 WS-POPRPK-PO-NBR              PIC  S9(9) COMP.            28830008
288400     10 WS-POPRPK-VER-NBR             PIC  S9(9) COMP.            28840008
288500     10 WS-POPRPK-PO-PREPK-ID         PIC  S9(4) COMP.            28850008
288600     10 WS-POPRPK-PREPK-TYP-CDE       PIC   X(1).                 28860008
288700     10 WS-POPRPK-PREPK-DESC          PIC   X(40).                28870008
288800     10 WS-POPRPK-PREPK-STAT-CDE      PIC   X(1).                 28880008
288900     10 WS-POPRPK-PREPK-UPC-NBR       PIC  S9(15)V COMP-3.        28890008
289000     10 WS-POPRPK-INPK-UNT-QTY        PIC  S9(9) COMP.            28900008
289100     10 WS-POPRPK-INPK-CNVYB-IND      PIC   X(1).                 28910008
289200     10 WS-POPRPK-OTPK-UNT-QTY        PIC  S9(9) COMP.            28920008
289300     10 WS-POPRPK-OTPK-ORD-QTY        PIC  S9(9) COMP.            28930008
289400     10 WS-POPRPK-PK-DTL-CHG-TMST     PIC   X(26).                28940008
289500     10 WS-POPRPK-PK-SKU-NBR          PIC  S9(8)V COMP-3.         28950008
289600 01  WS-POPRPK-KEYS.                                              28960008
289700     10 DS-POPRPK-PO-NBR              PIC  S9(9) COMP.            28970008
289800     10 DS-POPRPK-VER-NBR             PIC  S9(9) COMP.            28980008
289900     10 DS-POPRPK-PO-PREPK-ID         PIC  S9(4) COMP.            28990008
290000******************************************************************29000008
290100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  11     *29010008
290200******************************************************************29020008
290300******************************************************************29030008
290400* COBOL DECLARATION FOR TABLE TIMCNRL                             29040008
290500******************************************************************29050008
290600 01  WS-IMCNRL.                                                   29060008
290700     10 WS-IMCNRL-CONTNR-ID           PIC   X(12).                29070008
290800     10 WS-IMCNRL-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            29080008
290900     10 WS-IMCNRL-PO-NBR              PIC  S9(9) COMP.            29090008
291000     10 WS-IMCNRL-DCONSLR-RLSE-CDE    PIC   X(1).                 29100008
291100     10 WS-IMCNRL-DCONSLR-REQR-DTE    PIC   X(10).                29110008
291200     10 WS-IMCNRL-DCONSLR-ACTL-DTE    PIC   X(10).                29120008
291300     10 WS-IMCNRL-DCONSLR-ACTL-TM     PIC   X(8).                 29130008
291400     10 WS-IMCNRL-CRE-TMST            PIC   X(26).                29140008
291500     10 WS-IMCNRL-CRE-BY-UID          PIC   X(8).                 29150008
291600     10 WS-IMCNRL-LAST-UPD-TMST       PIC   X(26).                29160008
291700     10 WS-IMCNRL-LAST-UPD-BY-UID     PIC   X(8).                 29170008
291800     10 WS-IMCNRL-DCONSLR-ENT-ID      PIC  S9(9) COMP.            29180008
291900 01  WS-IMCNRL-KEYS.                                              29190008
292000     10 DS-IMCNRL-CONTNR-ID           PIC   X(12).                29200008
292100     10 DS-IMCNRL-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            29210008
292200     10 DS-IMCNRL-PO-NBR              PIC  S9(9) COMP.            29220008
292300******************************************************************29230008
292400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  11     *29240008
292500******************************************************************29250008
292600******************************************************************29260008
292700* COBOL DECLARATION FOR TABLE TAUCNRL                             29270008
292800******************************************************************29280008
292900 01  WS-AUCNRL.                                                   29290008
293000     10 WS-AUCNRL-CONTNR-ID           PIC   X(12).                29300008
293100     10 WS-AUCNRL-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            29310008
293200     10 WS-AUCNRL-PO-NBR              PIC  S9(9) COMP.            29320008
293300     10 WS-AUCNRL-DCONSLR-RLSE-CDE    PIC   X(1).                 29330008
293400     10 WS-AUCNRL-DCONSLR-REQR-DTE    PIC   X(10).                29340008
293500     10 WS-AUCNRL-DCONSLR-ACTL-DTE    PIC   X(10).                29350008
293600     10 WS-AUCNRL-DCONSLR-ACTL-TM     PIC   X(8).                 29360008
293700     10 WS-AUCNRL-CRE-TMST            PIC   X(26).                29370008
293800     10 WS-AUCNRL-CRE-BY-UID          PIC   X(8).                 29380008
293900     10 WS-AUCNRL-AUD-FUNC-CDE        PIC   X(1).                 29390008
294000     10 WS-AUCNRL-AUD-TMST            PIC   X(26).                29400008
294100     10 WS-AUCNRL-LAST-UPD-TMST       PIC   X(26).                29410008
294200     10 WS-AUCNRL-LAST-UPD-BY-UID     PIC   X(8).                 29420008
294300     10 WS-AUCNRL-DCONSLR-ENT-ID      PIC  S9(9) COMP.            29430008
294400 01  WS-AUCNRL-KEYS.                                              29440008
294500     10 DS-AUCNRL-CONTNR-ID           PIC   X(12).                29450008
294600     10 DS-AUCNRL-CONTNR-SEQ-NBR      PIC  S9(4) COMP.            29460008
294700     10 DS-AUCNRL-PO-NBR              PIC  S9(9) COMP.            29470008
294800     10 DS-AUCNRL-LAST-UPD-TMST       PIC   X(26).                29480008
294900******************************************************************29490008
295000* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  13     *29500008
295100******************************************************************29510008
295200******************************************************************29520008
295300* COBOL DECLARATION FOR TABLE TLBVRDA                             29530008
295400******************************************************************29540008
295500 01  WS-LBVRDA.                                                   29550008
295600     10 WS-LBVRDA-PO-NBR                 PIC  S9(9) COMP.         29560008
295700     10 WS-LBVRDA-RCVR-SEQ-NBR           PIC  S9(9) COMP.         29570008
295800     10 WS-LBVRDA-PO-LNE-NBR             PIC  S9(9) COMP.         29580008
295900     10 WS-LBVRDA-PREPK-ID               PIC  S9(4) COMP.         29590008
296000     10 WS-LBVRDA-OTPK-UNT-QTY           PIC  S9(9) COMP.         29600008
296100     10 WS-LBVRDA-LBL-ASG-IND            PIC   X(1).              29610008
296200     10 WS-LBVRDA-LBL-TYP-CDE            PIC   X(1).              29620008
296300     10 WS-LBVRDA-LBL-ASG-SEQ-NBR        PIC  S9(4) COMP.         29630008
296400     10 WS-LBVRDA-PRNT-CART-SEQ-ID       PIC  S9(4) COMP.         29640008
296500     10 WS-LBVRDA-CART-LBL-TYP-CDE       PIC   X(1).              29650008
296600     10 WS-LBVRDA-PREPK-PRCG-LNE-NBR     PIC  S9(9) COMP.         29660008
296700     10 WS-LBVRDA-INPK-UNT-QTY           PIC  S9(9) COMP.         29670008
296800     10 WS-LBVRDA-PREPK-RATO-QTY         PIC  S9(4) COMP.         29680008
296900     10 WS-LBVRDA-PREPK-UNT-QTY          PIC  S9(4) COMP.         29690008
297000     10 WS-LBVRDA-DEST-OPER-UNT-ID       PIC  S9(4) COMP.         29700008
297100     10 WS-LBVRDA-CSE-PK-QTY             PIC  S9(4) COMP.         29710008
297200     10 WS-LBVRDA-ODD-CART-IND           PIC   X(1).              29720008
297300     10 WS-LBVRDA-INPK-CNVYB-IND         PIC   X(1).              29730008
297400     10 WS-LBVRDA-LBL-TYP-LBL-SEQ-ID     PIC  S9(4) COMP.         29740008
297500     10 WS-LBVRDA-LBL-TYP-TOT-QTY        PIC  S9(4) COMP.         29750008
297600     10 WS-LBVRDA-BRCDE-NBR              PIC   X(22).             29760008
297700     10 WS-LBVRDA-STR-ZN-ID              PIC   X(5).              29770008
297800     10 WS-LBVRDA-MODU-DESC              PIC   X(7).              29780008
297900     10 WS-LBVRDA-ITM-NBR                PIC  S9(15)V COMP-3.     29790008
298000     10 WS-LBVRDA-DEPT-DESC              PIC   X(25).             29800008
298100     10 WS-LBVRDA-MAJ-CL-DESC            PIC   X(25).             29810008
298200     10 WS-LBVRDA-SEASET-NM              PIC   X(25).             29820008
298300     10 WS-LBVRDA-FIXT-ID                PIC   X(10).             29830008
298400     10 WS-LBVRDA-STRG-AREA-CDE          PIC   X(5).              29840008
298500     10 WS-LBVRDA-RCLM-IND               PIC   X(1).              29850008
298600*CLP 03/21/2106                                                   29860008
298700     10 WS-LBVRDA-LBL-MSG-TXT            PIC   X(100).            29870008
298800 01  WS-LBVRDA-KEYS.                                              29880008
298900     10 DS-LBVRDA-PO-NBR                 PIC  S9(9) COMP.         29890008
299000     10 DS-LBVRDA-RCVR-SEQ-NBR           PIC  S9(9) COMP.         29900008
299100     10 DS-LBVRDA-PO-LNE-NBR             PIC  S9(9) COMP.         29910008
299200     10 DS-LBVRDA-PREPK-ID               PIC  S9(4) COMP.         29920008
299300     10 DS-LBVRDA-OTPK-UNT-QTY           PIC  S9(9) COMP.         29930008
299400     10 DS-LBVRDA-LBL-ASG-IND            PIC   X(1).              29940008
299500     10 DS-LBVRDA-LBL-TYP-CDE            PIC   X(1).              29950008
299600     10 DS-LBVRDA-LBL-ASG-SEQ-NBR        PIC  S9(4) COMP.         29960008
299700******************************************************************29970008
299800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  29     *29980008
299900******************************************************************29990008
300000******************************************************************30000008
300100* COBOL DECLARATION FOR TABLE TSULBXF                             30010008
300200******************************************************************30020008
300300 01  WS-SULBXF.                                                   30030008
300400     10 WS-SULBXF-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.     30040008
300500     10 WS-SULBXF-BRCDE-NBR              PIC   X(22).             30050008
300600     10 WS-SULBXF-CART-LBL-TYP-CDE       PIC   X(1).              30060008
300700     10 WS-SULBXF-DEST-OPER-UNT-ID       PIC  S9(4) COMP.         30070008
300800     10 WS-SULBXF-STAT-CDE               PIC   X(1).              30080008
300900     10 WS-SULBXF-LAST-STAT-CHG-TMST     PIC   X(26).             30090008
301000     10 WS-SULBXF-CRE-TMST               PIC   X(26).             30100008
301100******************************************************************30110008
301200* KEYS CAN ADD UP TO 50 ONLY SO TMST WAS SHORTENED               *30120008
301300******************************************************************30130008
301400 01  WS-SULBXF-KEYS.                                              30140008
301500     10 DS-SULBXF-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.     30150008
301600     10 DS-SULBXF-BRCDE-NBR              PIC   X(22).             30160008
301700     10 DS-SULBXF-LAST-STAT-CHG-TMST     PIC   X(16).             30170008
301800******************************************************************30180008
301900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *30190008
302000******************************************************************30200008
302100******************************************************************30210008
302200* COBOL DECLARATION FOR TABLE TSHPSUM                             30220008
302300******************************************************************30230008
302400 01  WS-SHPSUM.                                                   30240008
302500     10 WS-SHPSUM-PO-NBR                 PIC  S9(9) COMP.         30250008
302600     10 WS-SHPSUM-PKSL-SEQ-NBR           PIC  S9(4) COMP.         30260008
302700     10 WS-SHPSUM-CART-COMB-NBR          PIC  S9(4) COMP.         30270008
302800     10 WS-SHPSUM-PO-LNE-NBR             PIC  S9(9) COMP.         30280008
302900     10 WS-SHPSUM-TOT-CART-CNT           PIC  S9(4) COMP.         30290008
303000     10 WS-SHPSUM-OTPK-UNT-QTY           PIC  S9(4) COMP.         30300008
303100     10 WS-SHPSUM-CRE-TMST               PIC   X(26).             30310008
303200 01  WS-SHPSUM-KEYS.                                              30320008
303300     10 DS-SHPSUM-PO-NBR                 PIC  S9(9) COMP.         30330008
303400     10 DS-SHPSUM-PKSL-SEQ-NBR           PIC  S9(4) COMP.         30340008
303500     10 DS-SHPSUM-CART-COMB-NBR          PIC  S9(4) COMP.         30350008
303600     10 DS-SHPSUM-PO-LNE-NBR             PIC  S9(9) COMP.         30360008
303700******************************************************************30370008
303800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *30380008
303900******************************************************************30390008
304000******************************************************************30400008
304100* COBOL DECLARATION FOR TABLE TLBPTDA                             30410008
304200******************************************************************30420008
304300 01  WS-LBPTDA.                                                   30430008
304400     10 WS-LBPTDA-TRIP-ID                PIC  S9(9) COMP.         30440008
304500     10 WS-LBPTDA-CRE-USR-ID             PIC   X(8).              30450008
304600     10 WS-LBPTDA-LBL-PRT-BTCH-ID        PIC  S9(4) COMP.         30460008
304700     10 WS-LBPTDA-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.     30470008
304800     10 WS-LBPTDA-OPER-UNT-ID            PIC  S9(4) COMP.         30480008
304900     10 WS-LBPTDA-FCLTY-ID               PIC  S9(4) COMP.         30490008
305000     10 WS-LBPTDA-CRE-TMST               PIC   X(26).             30500008
305100     10 WS-LBPTDA-OWNR-SCAC-ID           PIC   X(4).              30510008
305200     10 WS-LBPTDA-VEH-NBR                PIC   X(10).             30520008
305300     10 WS-LBPTDA-RPRT-IND               PIC   X(1).              30530008
305400     10 WS-LBPTDA-SU-DUP-LBL-IND         PIC   X(1).              30540008
305500     10 WS-LBPTDA-SU-FRE-ASTRA-IND       PIC   X(1).              30550008
305600     10 WS-LBPTDA-SU-MSSG-DAT-IND        PIC   X(1).              30560008
305700     10 WS-LBPTDA-SU-MISDIR-IND          PIC   X(1).              30570008
305800     10 WS-LBPTDA-MISDIR-OPER-UNT-ID     PIC  S9(4) COMP.         30580008
305900     10 WS-LBPTDA-PO-NBR                 PIC  S9(9) COMP.         30590008
306000     10 WS-LBPTDA-RCVR-SEQ-NBR           PIC  S9(9) COMP.         30600008
306100     10 WS-LBPTDA-PO-LNE-NBR             PIC  S9(9) COMP.         30610008
306200     10 WS-LBPTDA-DEST-OPER-UNT-ID       PIC  S9(4) COMP.         30620008
306300     10 WS-LBPTDA-STR-NM                 PIC   X(10).             30630008
306400     10 WS-LBPTDA-STR-ZN-ID              PIC   X(5).              30640008
306500     10 WS-LBPTDA-SKU-DEPT-NBR           PIC   X(3).              30650008
306600     10 WS-LBPTDA-SKU-CL-NBR             PIC   X(2).              30660008
306700     10 WS-LBPTDA-VS-NBR                 PIC   X(20).             30670008
306800     10 WS-LBPTDA-OTPK-UNT-QTY           PIC  S9(9) COMP.         30680008
306900     10 WS-LBPTDA-INPK-UNT-QTY           PIC  S9(9) COMP.         30690008
307000     10 WS-LBPTDA-PRTR-ID                PIC   X(8).              30700008
307100     10 WS-LBPTDA-BRCDE-NBR              PIC   X(22).             30710008
307200     10 WS-LBPTDA-DC-PRTD-AT-CDE         PIC   X(2).              30720008
307300     10 WS-LBPTDA-INVLD-DAT-ERR-CDE      PIC   X(1).              30730008
307400     10 WS-LBPTDA-PREPK-ID               PIC  S9(4) COMP.         30740008
307500     10 WS-LBPTDA-PREPK-RATO-QTY         PIC  S9(4) COMP.         30750008
307600     10 WS-LBPTDA-PREPK-UNT-QTY          PIC  S9(4) COMP.         30760008
307700     10 WS-LBPTDA-CSE-PK-QTY             PIC  S9(4) COMP.         30770008
307800     10 WS-LBPTDA-ODD-CART-IND           PIC   X(1).              30780008
307900     10 WS-LBPTDA-INPK-CNVYB-IND         PIC   X(1).              30790008
308000     10 WS-LBPTDA-LBL-TYP-LBL-SEQ-ID     PIC  S9(4) COMP.         30800008
308100     10 WS-LBPTDA-LBL-TYP-TOT-QTY        PIC  S9(4) COMP.         30810008
308200     10 WS-LBPTDA-MODU-DESC              PIC   X(7).              30820008
308300     10 WS-LBPTDA-ITM-NBR                PIC  S9(15)V COMP-3.     30830008
308400     10 WS-LBPTDA-DEPT-DESC              PIC   X(25).             30840008
308500     10 WS-LBPTDA-MAJ-CL-DESC            PIC   X(25).             30850008
308600     10 WS-LBPTDA-SEASET-NM              PIC   X(25).             30860008
308700     10 WS-LBPTDA-FIXT-ID                PIC   X(10).             30870008
308800     10 WS-LBPTDA-CART-LBL-TYP-CDE       PIC   X(1).              30880008
308900     10 WS-LBPTDA-STRG-AREA-CDE          PIC   X(5).              30890008
309000     10 WS-LBPTDA-CART-ACTN-CDE          PIC   X(1).              30900008
309100     10 WS-LBPTDA-HNG-FOLD-SEQ-NBR       PIC  S9(4) COMP.         30910008
309200     10 WS-LBPTDA-BUS-AREA-ID            PIC  S9(2)V COMP-3.      30920008
309300     10 WS-LBPTDA-SKU-NBR                PIC  S9(8)V COMP-3.      30930008
309400*CLP 03/21/2106                                                   30940008
309500     10 WS-LBPTDA-LBL-MSG-TXT            PIC   X(100).            30950008
309600 01  WS-LBPTDA-KEYS.                                              30960008
309700     10 DS-LBPTDA-TRIP-ID                PIC  S9(9) COMP.         30970008
309800     10 DS-LBPTDA-CRE-USR-ID             PIC   X(8).              30980008
309900     10 DS-LBPTDA-LBL-PRT-BTCH-ID        PIC  S9(4) COMP.         30990008
310000     10 DS-LBPTDA-BRCDE-NBR              PIC   X(22).             31000008
310100     10 DS-LBPTDA-PO-NBR                 PIC  S9(9) COMP.         31010008
310200     10 DS-LBPTDA-RCVR-SEQ-NBR           PIC  S9(9) COMP.         31020008
310300     10 DS-LBPTDA-PO-LNE-NBR             PIC  S9(9) COMP.         31030008
310400     10 DS-LBPTDA-CRE-TMST               PIC  X(26).              31040008
310500******************************************************************31050008
310600* COBOL DECLARATION FOR TABLE TWEBITM                             31060008
310700******************************************************************31070008
310800 01  WS-WEBITM.                                                   31080008
310900     10 WS-WEBITM-INTR-UPC-ID            PIC  S9(9) COMP.         31090008
311000     10 WS-WEBITM-EFF-BEG-TMST           PIC   X(26).             31100008
311100     10 WS-WEBITM-EFF-END-TMST           PIC   X(26).             31110008
311200     10 WS-WEBITM-EFF-END-TMST-NN        PIC  S9(4) COMP.         31120008
311300     10 WS-WEBITM-ASRT-BEG-DTE           PIC   X(10).             31130008
311400     10 WS-WEBITM-ASRT-END-DTE           PIC   X(10).             31140008
311500     10 WS-WEBITM-STRG-AREA-SEQ-NBR      PIC  S9(4) COMP.         31150008
311600     10 WS-WEBITM-SHIP-WD-QTY            PIC  S9(4)V9(3) COMP-3.  31160008
311700     10 WS-WEBITM-SHIP-DPTH-QTY          PIC  S9(4)V9(3) COMP-3.  31170008
311800     10 WS-WEBITM-SHIP-HT-QTY            PIC  S9(4)V9(3) COMP-3.  31180008
311900     10 WS-WEBITM-SHIP-WT-QTY            PIC  S9(5)V9(3) COMP-3.  31190008
312000     10 WS-WEBITM-SHIP-DIM-SRC-CDE       PIC   X(1).              31200008
312100     10 WS-WEBITM-PKG-SEQ-NBR            PIC  S9(4) COMP.         31210008
312200     10 WS-WEBITM-SHIP-RSTRC-SEQ-NBR     PIC  S9(4) COMP.         31220008
312300     10 WS-WEBITM-GFT-WRAP-AVL-IND       PIC   X(1).              31230008
312400     10 WS-WEBITM-PRD-GP-NBR             PIC  S9(8)V COMP-3.      31240008
312500     10 WS-WEBITM-PRD-GP-IND             PIC   X(1).              31250008
312600     10 WS-WEBITM-SHIP-SRCHG-FEE-AMT     PIC  S9(3)V9(2) COMP-3.  31260008
312700     10 WS-WEBITM-SHIP-SRVC-SEQ-NBR      PIC  S9(4) COMP.         31270008
312800     10 WS-WEBITM-SHIP-GP-SEQ-NBR        PIC  S9(4) COMP.         31280008
312900     10 WS-WEBITM-CRE-BY-USR-ID          PIC   X(8).              31290008
313000     10 WS-WEBITM-WEB-ITM-DLTD-IND       PIC   X(1).              31300008
313100     10 WS-WEBITM-HAZDS-IND              PIC   X(1).              31310008
313200     10 WS-WEBITM-BRKBL-IND              PIC   X(1).              31320008
313300     10 WS-WEBITM-GC-IND                 PIC   X(1).              31330008
313400     10 WS-WEBITM-SHIP-ALN-IND           PIC   X(1).              31340008
313500     10 WS-WEBITM-WEB-EXCLV-IND          PIC   X(1).              31350008
313600 01  WS-WEBITM-KEYS.                                              31360008
313700     10 DS-WEBITM-INTR-UPC-ID            PIC  S9(9) COMP.         31370008
313800     10 DS-WEBITM-EFF-BEG-TMST           PIC   X(20).             31380008
313900     10 DS-WEBITM-EFF-END-TMST           PIC   X(20).             31390008
314000     10 DS-WEBITM-EFF-END-TMST-NN        PIC  S9(4) COMP.         31400008
314100******************************************************************31410008
314200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  21     *31420008
314300******************************************************************31430008
314400******************************************************************31440008
314500* COBOL DECLARATION FOR TABLE TMDSEAR                             31450008
314600******************************************************************31460008
314700 01  WS-MDSEAR.                                                   31470008
314800     10 WS-MDSEAR-OPERCO-NBR             PIC   X(2).              31480008
314900     10 WS-MDSEAR-GMA-NBR                PIC   X(2).              31490008
315000     10 WS-MDSEAR-DMA-NBR                PIC   X(2).              31500008
315100     10 WS-MDSEAR-DEPT-NBR               PIC   X(3).              31510008
315200     10 WS-MDSEAR-MAJ-CL-NBR             PIC   X(2).              31520008
315300     10 WS-MDSEAR-SUB-CL-NBR             PIC   X(3).              31530008
315400     10 WS-MDSEAR-MDSELV-CDE             PIC   X(3).              31540008
315500     10 WS-MDSEAR-MDSEAR-DKEY            PIC  S9(6)V COMP-3.      31550008
315600     10 WS-MDSEAR-CHG-DTE                PIC   X(10).             31560008
315700     10 WS-MDSEAR-CRE-DTE                PIC   X(10).             31570008
315800     10 WS-MDSEAR-STRT-DTE               PIC   X(10).             31580008
315900     10 WS-MDSEAR-END-DTE                PIC   X(10).             31590008
316000     10 WS-MDSEAR-GEN-MDSE-TYP-CDE       PIC   X(1).              31600008
316100     10 WS-MDSEAR-DESC                   PIC   X(25).             31610008
316200     10 WS-MDSEAR-BYR-NBR                PIC   X(3).              31620008
316300     10 WS-MDSEAR-LIST-SEQ-NBR           PIC  S9(15)V COMP-3.     31630008
316400     10 WS-MDSEAR-PHY-INV-OH-VAR-PCT     PIC  S9(3)V COMP-3.      31640008
316500     10 WS-MDSEAR-PHY-INV-OH-VAR-PCT-N   PIC  S9(4)  COMP.        31650008
316600     10 WS-MDSEAR-PHY-INV-OH-VAR-QTY     PIC  S9(5)V COMP-3.      31660008
316700     10 WS-MDSEAR-PHY-INV-OH-VAR-QTY-N   PIC  S9(4)  COMP.        31670008
316800 01  WS-MDSEAR-KEYS.                                              31680008
316900     10 DS-MDSEAR-MDSEAR-DKEY            PIC  S9(6)V COMP-3.      31690008
317000******************************************************************31700008
317100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  18     *31710008
317200******************************************************************31720008
317300******************************************************************31730008
317400* COBOL DECLARATION FOR TABLE TSKST                               31740008
317500******************************************************************31750008
317600 01  WS-SKST.                                                     31760008
317700     10 WS-SKST-ITEM-NMBR                PIC  S9(15)V COMP-3.     31770008
317800     10 WS-SKST-LOC-NBR                  PIC  S9(4) COMP.         31780008
317900     10 WS-SKST-LAST-SALE-DATE           PIC  S9(7)V COMP-3.      31790008
318000     10 WS-SKST-LAST-RCVD-DATE           PIC  S9(7)V COMP-3.      31800008
318100     10 WS-SKST-ONHAND-QTY               PIC  S9(7)V COMP-3.      31810008
318200     10 WS-SKST-FIRST-RCVD-DATE          PIC  S9(7)V COMP-3.      31820008
318300     10 WS-SKST-FIRST-SALE-DATE          PIC  S9(7)V COMP-3.      31830008
318400     10 WS-SKST-YTD-SALES-UNIT-QTY       PIC  S9(7)V COMP-3.      31840008
318500     10 WS-SKST-YTD-SALES-AMT            PIC  S9(7)V9(2) COMP-3.  31850008
318600     10 WS-SKST-LAST-UPD-TMST            PIC   X(26).             31860008
318700 01  WS-SKST-KEYS.                                                31870008
318800     10 DS-SKST-ITEM-NMBR                PIC  S9(15)V COMP-3.     31880008
318900     10 DS-SKST-LOC-NBR                  PIC  S9(4) COMP.         31890008
319000******************************************************************31900008
319100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  12     *31910008
319200******************************************************************31920008
319300******************************************************************31930008
319400* COBOL DECLARATION FOR TABLE TPPCPRC                             31940008
319500******************************************************************31950008
319600 01  WS-PPCPRC.                                                   31960008
319700     10 WS-PPCPRC-TSK-ITM-NBR            PIC  S9(15)V COMP-3.     31970008
319800     10 WS-PPCPRC-STRT-TMST              PIC   X(26).             31980008
319900     10 WS-PPCPRC-STR-NBR                PIC  S9(4) COMP.         31990008
320000     10 WS-PPCPRC-END-TMST               PIC   X(26).             32000008
320100     10 WS-PPCPRC-MEITGP-NBR             PIC  S9(9) COMP.         32010008
320200     10 WS-PPCPRC-RTL-AMT                PIC  S9(7)V9(2) COMP-3.  32020008
320300     10 WS-PPCPRC-STATUS-CDE             PIC  S9(3)V COMP-3.      32030008
320400     10 WS-PPCPRC-UID-NBR                PIC   X(8).              32040008
320500 01  WS-PPCPRC-KEYS.                                              32050008
320600     10 DS-PPCPRC-TSK-ITM-NBR            PIC  S9(15)V COMP-3.     32060008
320700     10 DS-PPCPRC-STR-NBR                PIC  S9(4) COMP.         32070008
320800     10 DS-PPCPRC-STRT-TMST              PIC   X(26).             32080008
320900******************************************************************32090008
321000* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   8     *32100008
321100******************************************************************32110008
321200/                                                                 32120008
321300 01  WS-OTBCART-KEYS.                                             32130008
321400     10  DS-OTBCART-SHIPT-UNT-ID         PIC  S9(18)V COMP-3.     32140008
321500                                                                  32150008
321600 01  WS-OTBUPC-KEYS.                                              32160008
321700     10 DS-OTBUPC-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.     32170008
321800     10 DS-OTBUPC-TRN-NBR                PIC  S9(9) COMP.         32180008
321900     10 DS-OTBUPC-RCVR-SEQ-NBR           PIC  S9(9) COMP.         32190008
322000     10 DS-OTBUPC-TRN-LNE-NBR            PIC  S9(9) COMP.         32200008
322100     10 DS-OTBUPC-TRN-TYP-CDE            PIC   X(2).              32210008
322200     10 DS-OTBUPC-UPC-NBR                PIC  S9(15)V COMP-3.     32220008
322300                                                                  32230008
322400 01  DS008-OTBPKD-KEYS.                                           32240008
322500     10 DS008-OTBPKD-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.     32250008
322600     10 DS008-OTBPKD-TRN-NBR             PIC  S9(9) COMP.         32260008
322700     10 DS008-OTBPKD-RCVR-SEQ-NBR        PIC  S9(9) COMP.         32270008
322800     10 DS008-OTBPKD-TRN-LNE-NBR         PIC  S9(9) COMP.         32280008
322900     10 DS008-OTBPKD-TRN-TYP-CDE         PIC   X(2).              32290008
323000     10 DS008-OTBPKD-UPC-NBR             PIC  S9(15)V COMP-3.     32300008
323100     10 DS008-OTBPKD-PKD-BY-USR-ID       PIC  X(08).              32310008
323200     10 DS008-OTBPKD-PKD-TMST            PIC  X(26).              32320008
323300                                                                  32330008
323400 01  WS-TSUOBTR-KEYS.                                             32340008
323500     10 DS-TSUOBTR-TRIP-ID                PIC S9(9) COMP.         32350008
323600                                                                  32360008
323700 01  WS-TSUOBTS-KEYS.                                             32370008
323800     10 DS-TSUOBTS-TRIP-ID            PIC S9(9) COMP.             32380008
323900     10 DS-TSUOBTS-OTBND-STAT-TMST    PIC X(26).                  32390008
324000                                                                  32400008
324100 01  DS008-OTBND-VND-KEYS.                                        32410008
324200     10 DS008K-OTBVND-SHIPT-UNT-ID    PIC S9(18)V COMP-3.         32420008
324300                                                                  32430008
324400 01  DS008-SUT-OTBND-LOC.                                         32440008
324500     10  DS008-OTBLOC-SHIPT-UNT-ID    PIC  S9(18)V COMP-3.        32450008
324600     10  DS008-OTBLOC-CRE-TMST        PIC  X(26).                 32460008
324700     10  DS008-OTBLOC-OTBND-TRIP-ID   PIC  S9(9) COMP.            32470008
324800     10  DS008-OTBLOC-OTBND-TRIP-ID-N PIC  S9(4) COMP.            32480008
324900     10  DS008-OTBLOC-LOC-NBR         PIC  S9(4) COMP.            32490008
325000     10  DS008-OTBLOC-SCN-CDE         PIC   X(4).                 32500008
325100     10  DS008-OTBLOC-CRE-USR-ID      PIC   X(8).                 32510008
325200     10  DS008-OTBLOC-ACTV-CDE        PIC   X(1).                 32520008
325300     10  DS008-OTBLOC-INBD-TRIP-ID    PIC  S9(9) COMP.            32530008
325400 01  DS008-OTBLOC-KEYS.                                           32540008
325500     05  DS008K-OTBLOC-SHIPT-UNT-ID   PIC  S9(18)V COMP-3.        32550008
325600     05  DS008K-OTBLOC-CRE-TMST       PIC  X(26).                 32560008
325700                                                                  32570008
325800 01  DS008-SUQADJ-KEYS.                                           32580008
325900     05  DS008K-SUQADJ-SHIPT-UNT-ID   PIC  S9(18)V COMP-3.        32590008
326000     05  DS008K-SUQADJ-UPC-NBR        PIC  S9(15)V COMP-3.        32600008
326100     05  DS008K-SUQADJ-ADJ-TMST       PIC  X(26).                 32610008
326200                                                                  32620008
326800 01  DS008-XLTSKU-KEYS.                                           32680008
326900     05  DS008K-XLTSKU-INTR-UPC-ID    PIC  S9(09) COMP.           32690008
327000                                                                  32700008
327100 01  DS008-XLTUPC-KEYS.                                           32710008
327200     05  DS008K-XLTUPC-UPC-ID         PIC  S9(09) COMP.           32720008
327300     05  DS008K-XLTUPC-INTR-UPC-ID    PIC  S9(09) COMP.           32730008
327400                                                                  32740008
327500 01  DS008-XLTVNDSTYL-KEYS.                                       32750008
327600     05  DS008K-XLTVNDSTYL-STYL-ID    PIC  S9(08) COMP-3.         32760008
327700                                                                  32770008
327800 01  DS008-DCLSUT00030.                                           32780008
327900     05  DS008-SUT00030-DATA.                                     32790008
328000         10  DS008-FINCL-ADJ-ID         PIC  S9(9) COMP.          32800008
328100         10  DS008-ADJ-ERR-CDE          PIC  S9(4) COMP.          32810008
328200         10  DS008-PO-NBR               PIC  S9(9) COMP.          32820008
328300         10  DS008-RCVR-LNE-NBR         PIC  S9(9) COMP.          32830008
328400         10  DS008-RCVR-SEQ-NBR         PIC  S9(9) COMP.          32840008
328500         10  DS008-DEST-LOC-NBR         PIC  S9(4) COMP.          32850008
328600         10  DS008-CRE-TMST             PIC   X(26).              32860008
328700         10  DS008-UPC-NBR              PIC  S9(15)V COMP-3.      32870008
328800         10  DS008-SHIPT-UNT-ID         PIC  S9(18)V COMP-3.      32880008
328900         10  DS008-PRC-RSN-CDE          PIC   X(8).               32890008
329000         10  DS008-AUD-CNTL-NBR         PIC  S9(9) COMP.          32900008
329100         10  DS008-ORGN-LOC-NBR         PIC  S9(4) COMP.          32910008
329200         10  DS008-AUD-ADJ-STAT-CDE     PIC   X(1).               32920008
329300         10  DS008-AUTO-APL-IND         PIC   X(1).               32930008
329400         10  DS008-CRE-BY-USR-ID        PIC   X(8).               32940008
329500         10  DS008-CRE-PGM-NM           PIC   X(8).               32950008
329600         10  DS008-FINCL-BEF-QTY        PIC  S9(4) COMP.          32960008
329700         10  DS008-FINCL-AFT-QTY        PIC  S9(4) COMP.          32970008
329800         10  DS008-RSLV-BY-USR-ID       PIC   X(8).               32980008
329900         10  DS008-RSLV-TMST            PIC   X(26).              32990008
330000         10  DS008-PROB-RSN-CDE         PIC  S9(4) COMP.          33000008
330100         10  DS008-ADJ-QTY              PIC  S9(4) COMP.          33010008
330200         10  DS008-RSLV-CMNT-TXT        PIC   X(255).             33020008
330300     05  DS008-SUT00030-NULL.                                     33030008
330400         10  DS008-SUT00030-NULLS OCCURS 23 TIMES PIC S9(4) COMP. 33040008
330500 01  DS008-FINCL-ADJ-KEYS.                                        33050008
330600     05  DS008K-FINCL-ADJ-ID          PIC  S9(09) COMP.           33060008
330700/                                                                 33070008
330800 01  DS008-DCLSUT00015.                                           33080008
330900     05  DS008-SUT00015-DATA.                                     33090008
331000         10 DS008-SUT00015-PO-NBR           PIC S9(9) COMP.       33100008
331100         10 DS008-SUT00015-PO-LNE-NBR       PIC S9(9) COMP.       33110008
331200         10 DS008-SUT00015-PO-PREPK-ID      PIC S9(4) COMP.       33120008
331300         10 DS008-SUT00015-OPER-UNT-ID      PIC S9(4) COMP.       33130008
331400         10 DS008-SUT00015-INBND-TRIP-ID    PIC S9(9) COMP.       33140008
331500         10 DS008-SUT00015-RCVR-SEQ-NBR     PIC S9(9) COMP.       33150008
331600         10 DS008-SUT00015-AUD-CNTL-NBR     PIC S9(9) COMP.       33160008
331700         10 DS008-SUT00015-CART-QTY         PIC S9(9) COMP.       33170008
331800         10 DS008-SUT00015-UNT-QTY          PIC S9(9) COMP.       33180008
331900         10 DS008-SUT00015-AUD-CART-QTY     PIC S9(9) COMP.       33190008
332000         10 DS008-SUT00015-AUD-UNT-QTY      PIC S9(9) COMP.       33200008
332100         10 DS008-SUT00015-AUD-STAT-CDE     PIC X(1).             33210008
332200         10 DS008-SUT00015-DFRD-AUD-IND     PIC X(1).             33220008
332300         10 DS008-SUT00015-AUD-ERR-PCT      PIC S9(3)V9(2) COMP-3.33230008
332400         10 DS008-SUT00015-CRE-TMST         PIC X(26).            33240008
332500         10 DS008-SUT00015-CART-PRMPT-CDE   PIC X(1).             33250008
332600         10 DS008-SUT00015-VND-RNKG-CDE     PIC X(6).             33260008
332700         10 DS008-SUT00015-PKGNG-TYP-CDE    PIC X(2).             33270008
332800         10 DS008-SUT00015-EFF-BEG-TMST     PIC X(26).            33280008
332900         10 DS008-SUT00015-ENT-ID           PIC  S9(9) COMP.      33290008
333000         10 DS008-SUT00015-DEPT-NBR         PIC  S9(4)V COMP-3.   33300008
333100         10 DS008-SUT00015-AUD-STAT-RSN-CD  PIC X(1).             33310008
333200         10 DS008-SUT00015-MOD-QTY-IND      PIC  X(1).            33320008
333300         10 DS008-SUT00015-RWK-AUD-CTL-NBR                        33330008
333400                                            PIC S9(9) COMP.       33340008
333500     05  DS008-SUT00015-NULL.                                     33350008
333600         10  DS008-SUT00015-NULLS OCCURS 24 TIMES                 33360008
333700                                      PIC S9(4) COMP.             33370008
333800 01  DS008-SUT00015-KEYS COMP.                                    33380008
333900     05  DS008K-SUT00015-PO-NBR       PIC  S9(08).                33390008
334000     05  DS008K-SUT00015-PO-LNE-NBR   PIC  S9(08).                33400008
334100     05  DS008K-SUT00015-PO-PREPK-ID  PIC  S9(04).                33410008
334200     05  DS008K-SUT00015-OPER-UNT-ID  PIC  S9(04).                33420008
334300     05  DS008K-SUT00015-INBND-TRIP-ID  PIC  S9(08).              33430008
334400     05  DS008K-SUT00015-RCVR-SEQ-NBR  PIC  S9(08).               33440008
334500/                                                                 33450008
334600 01  DS008-DCLSUT00024.                                           33460008
334700     05  DS008-SUT00024-DATA.                                     33470008
334800         10 DS008-SUT00024-SHIPT-UNT-ID     PIC S9(18)V COMP-3.   33480008
334900         10 DS008-SUT00024-ORGN-LOC-NBR     PIC S9(4) COMP.       33490008
335000         10 DS008-SUT00024-DEST-LOC-NBR     PIC S9(4) COMP.       33500008
335100         10 DS008-SUT00024-CART-SRC-CDE     PIC  X(3).            33510008
335200         10 DS008-SUT00024-CRE-DTE          PIC  X(10).           33520008
335300         10 DS008-SUT00024-CRE-TM           PIC  X(8).            33530008
335400         10 DS008-SUT00024-CRE-USR-ID       PIC  X(8).            33540008
335500         10 DS008-SUT00024-CRE-PGM-NM       PIC  X(8).            33550008
335600         10 DS008-SUT00024-MSTR-CART-IND    PIC  X(1).            33560008
335700         10 DS008-SUT00024-PRNT-CART-ID     PIC S9(18)V COMP-3.   33570008
335800         10 DS008-SUT00024-ORIG-CART-ID     PIC S9(18)V COMP-3.   33580008
335900         10 DS008-SUT00024-CART-TYP-CDE     PIC  X(1).            33590008
336000         10 DS008-SUT00024-LBL-PRT-SEQ-NBR  PIC S9(4) COMP.       33600008
336100         10 DS008-SUT00024-CART-RVSN-NBR    PIC S9(4) COMP.       33610008
336200         10 DS008-SUT00024-OTBND-TRIP-ID    PIC S9(9) COMP.       33620008
336300         10 DS008-SUT00024-ACTV-IND         PIC  X(1).            33630008
336400         10 DS008-SUT00024-ODD-UNT-IND      PIC  X(1).            33640008
336500     05  DS008-SUT00024-NULL.                                     33650008
336600         10  DS008-SUT00024-NULLS OCCURS 17 TIMES                 33660008
336700                                      PIC S9(4) COMP.             33670008
336800 01  DS008-SUT00024-KEYS COMP.                                    33680008
336900     05  DS008K-SUT00024-SHIPT-UNT-ID PIC  S9(08).                33690008
337000     05  DS008K-SUT00024-OTBND-TRIP-ID PIC  S9(08).               33700008
337100 01  DS008-RCT00013-KEYS COMP.                                    33710008
337200     05  DS008K-RCT00013-ORD-NBR      PIC  S9(08).                33720008
337300     05  DS008K-RCT00013-ORD-LNE-NBR  PIC  S9(08).                33730008
337400     05  DS008K-RCT00013-REC-SEQ-NBR  PIC  S9(04).                33740008
337500     05  DS008K-RCT00013-OPER-UNT-ID  PIC  S9(04).                33750008
337600     05  DS008K-RCT00013-FCLTY-ID     PIC  S9(04).                33760008
337700     05  DS008K-RCT00013-STR-NBR      PIC  S9(04).                33770008
337800     05  DS008K-RCT00013-STR-FCLTY-ID PIC  S9(04).                33780008
337900                                                                  33790008
338000 01  DS008-TSUQADJ-NULL.                                          33800008
338100     05  DS008-TSUQADJ-NULLS OCCURS 11 TIMES                      33810008
338200                                      PIC S9(4) COMP.             33820008
338300                                                                  33830008
338400*    SUT_OTBND_PK (THERE ARE NO NULLABLE COLUMNS)                 33840008
338500 01  DS008-DCLSUT00041.                                           33850008
338600     05  DS008-SUT00041-DATA.                                     33860008
338700         10  DS008-SUT00041-SHIPT-UNT-ID    PIC  S9(18)V COMP-3.  33870008
338800         10  DS008-SUT00041-TRN-NBR         PIC  S9(9) COMP.      33880008
338900         10  DS008-SUT00041-RCVR-SEQ-NBR    PIC  S9(9) COMP.      33890008
339000         10  DS008-SUT00041-TRN-TYP-CDE     PIC   X(2).           33900008
339100         10  DS008-SUT00041-PK-SKU-NBR      PIC  S9(8)V COMP-3.   33910008
339200         10  DS008-SUT00041-SHPD-PK-QTY     PIC  S9(9) COMP.      33920008
339300     05  DS008K-SUT00041-KEYS.                                    33930008
339400         10  DS008K-SUT00041-SHIPT-UNT-ID    PIC  S9(18)V COMP-3. 33940008
339500         10  DS008K-SUT00041-TRN-NBR         PIC  S9(9) COMP.     33950008
339600         10  DS008K-SUT00041-RCVR-SEQ-NBR    PIC  S9(9) COMP.     33960008
339700         10  DS008K-SUT00041-TRN-TYP-CDE     PIC   X(2).          33970008
339800         10  DS008K-SUT00041-PK-SKU-NBR      PIC  S9(8)V COMP-3.  33980008
339900/                                                                 33990008
340000***************************************************************** 34000008
340100* COBOL DECLARATION FOR TABLE TVSCHVL                             34010008
340200***************************************************************** 34020008
340300 01  WS-VSCHVL.                                                   34030008
340400     10 WS-VSCHVL-CHARTC-CDE          PIC  S9(4) COMP.            34040008
340500     10 WS-VSCHVL-CHARTC-SEQ-NBR      PIC  S9(4) COMP.            34050008
340600     10 WS-VSCHVL-CHARTC-VAL-DESC     PIC   X(20).                34060008
340700     10 WS-VSCHVL-STAT-CDE            PIC   X(1).                 34070008
340800 01  WS-VSCHVL-KEYS.                                              34080008
340900     10 DS-VSCHVL-CHARTC-CDE          PIC  S9(4) COMP.            34090008
341000     10 DS-VSCHVL-CHARTC-SEQ-NBR      PIC  S9(4) COMP.            34100008
341100/                                                                 34110008
341200 01  DS008-XLT00007-KEYS.                                         34120008
341300     05  DS008K-XLT00007-PK-SKU-NBR   PIC  S9(08) COMP-3.         34130008
341400 01  DS008-XLT00008-KEYS.                                         34140008
341500     05  DS008K-XLT00008-PK-SKU-NBR   PIC  S9(08) COMP-3.         34150008
341600     05  DS008K-XLT00008-CPT-SKU-NBR  PIC  S9(08) COMP-3.         34160008
341700 01  DS008-XLT00009-KEYS.                                         34170008
341800     05  DS008K-XLT00009-PK-SKU-NBR   PIC  S9(08) COMP-3.         34180008
341900     05  DS008K-XLT00009-UPC-NBR      PIC  S9(15) COMP-3.         34190008
342000                                                                  34200008
342100 01  DS008-RCT00017-KEYS.                                         34210008
342200     05  DS008K-RCT00017-PO-NBR       PIC  S9(08) COMP.           34220008
342300     05  DS008K-RCT00017-RCVR-SEQ-NBR PIC  S9(09) COMP.           34230008
342400     05  DS008K-RCT00017-CRE-BY-USR-ID PIC  X(08).                34240008
342500     05  DS008K-RCT00017-CRE-TMST     PIC   X(26).                34250008
342600/                                                                 34260008
342700*    TRT_RUL TABLE                                                34270008
342800 01  DS008-TRT00014-KEYS.                                         34280008
342900     05  DS008K-TRT00014-RUL-ID       PIC  S9(09) COMP.           34290008
343000*    TRT_RULCNSTR TABLE                                           34300008
343100 01  DS008-TRT00015-KEYS.                                         34310008
343200     05  DS008K-TRT00015-RUL-ID       PIC  S9(09) COMP.           34320008
343300     05  DS008K-TRT00015-CNSTR-CDE    PIC  S9(04) COMP.           34330008
343400     05  DS008K-TRT00015-CNSTR-TYP-CDE PIC  X(08).                34340008
343500/                                                                 34350008
343600***************************************************************** 34360008
343700* COBOL DECLARATION FOR TABLE IMT_STYL_PRTNR                      34370008
343800***************************************************************** 34380008
343900 01  DS008-DCLIMT00016.                                           34390008
344000     05  DS008-IMT00016-DATA.                                     34400008
344100         10 DS008-IMT16-SUB-CL-MDSEAR-ID  PIC  S9(6)V COMP-3.     34410008
344200         10 DS008-IMT16-VS-ID             PIC  S9(9) COMP.        34420008
344300         10 DS008-IMT16-BUS-PRTNR-ROL-CDE PIC   X(2).             34430008
344400         10 DS008-IMT16-ENT-ID            PIC  S9(9) COMP.        34440008
344500 01  DS008-IMT00016-KEYS.                                         34450008
344600     05 DS008K-IMT16-SUB-CL-MDSEAR-ID     PIC  S9(6)V COMP-3.     34460008
344700     05 DS008K-IMT16-VS-ID                PIC  S9(9) COMP.        34470008
344800     05 DS008K-IMT16-BUS-PRTNR-ROL-CDE    PIC   X(2).             34480008
344900******************************************************************34490008
345000* COBOL DECLARATION FOR TABLE TRT_RUL                             34500008
345100******************************************************************34510008
345200 01  DS008-DCLTRT00014.                                           34520008
345300     10 WS-TRT00014-RUL-ID               PIC  S9(9) COMP.         34530008
345400   05 WS-TRT-RUL.                                                 34540008
345500     10 WS-TRT00014-RUL-CDE              PIC   X(4).              34550008
345600     10 WS-TRT00014-RUL-TYP-CDE          PIC   X(3).              34560008
345700     10 WS-TRT00014-RUL-BEG-DTE          PIC   X(10).             34570008
345800     10 WS-TRT00014-RUL-END-DTE          PIC   X(10).             34580008
345900     10 WS-TRT00014-CRE-TMST             PIC   X(26).             34590008
346000     10 WS-TRT00014-CRE-BY-USR-ID        PIC   X(8).              34600008
346100 01  DS008-TRT00014-KEY.                                          34610008
346200     10 WSK-TRT00014-RUL-ID              PIC  S9(9) COMP.         34620008
346300                                                                  34630008
346400******************************************************************34640008
346500* COBOL DECLARATION FOR TABLE TRT_RUL_CNSTR                       34650008
346600******************************************************************34660008
346700 01  DS008-DCLTRT00015.                                           34670008
346800     10 WS-TRT00015-RUL-ID               PIC  S9(9) COMP.         34680008
346900   05 WS-TRT-RUL-CNSTR.                                           34690008
347000     10 WS-TRT00015-RUL-CNSTR-CDE        PIC  S9(4) COMP.         34700008
347100     10 WS-TRT00015-RUL-CNSTR-TYP-CDE    PIC   X(8).              34710008
347200     10 WS-TRT00015-RUL-CNSTR-VAL-TXT    PIC   X(30).             34720008
347300     10 WS-TRT00015-CRE-TMST             PIC   X(26).             34730008
347400     10 WS-TRT00015-CRE-BY-USR-ID        PIC   X(8).              34740008
347500 01  DS008-TRT00015-KEY.                                          34750008
347600     10 WSK-TRT00015-RUL-ID              PIC  S9(9) COMP.         34760008
347700     10 WSK-TRT00015-RUL-CNSTR-CDE       PIC  S9(4) COMP.         34770008
347800     10 WSK-TRT00015-RUL-CNSTR-TYP-CDE   PIC   X(8).              34780008
347900                                                                  34790008
348000*    KEYS FOR TIMCNRL                                             34800008
348100 01  DS008-TIMCNRL-KEY.                                           34810008
348200     05  DS008K-IMCNRL-CONTNR-ID       PIC   X(12).               34820008
348300     05  DS008K-IMCNRL-CONTNR-SEQ-NBR  PIC  S9(4) COMP.           34830008
348400     05  DS008K-IMCNRL-PO-NBR          PIC  S9(9) COMP.           34840008
348500                                                                  34850008
348600*    KEYS FOR TRT_AUD_RUL_CNSTR                                   34860008
348601 01  DS008-TRT00018-KEY.                                          34860108
348602     05  DS008K-TRT00018-RUL-ID       PIC  S9(9) COMP.            34860208
348603     05  DS008K-TRT00018-CNSTR-CDE    PIC  S9(4) COMP.            34860308
348604     05  DS008K-TRT00018-CNSTR-TYP-CDE PIC   X(8).                34860408
348605     05  DS008K-TRT00018-CRE-TMST      PIC   X(26).               34860508
348606                                                                  34860608
348607*    KEYS FOR TRT_AUD_RUL                                         34860708
348608 01  DS008-TRT00017-KEY.                                          34860808
348609     05  DS008K-TRT00017-AUD-CRE-TMST      PIC   X(26).           34860908
348610                                                                  34861008
348620***************************************************************** 34862008
348630* COBOL DECLARATION FOR TABLE IMT_LBL                             34863008
348640***************************************************************** 34864008
348650 01  DS008-DCLIMT00000.                                           34865008
348660     05  DS008-IMT00000-DATA.                                     34866008
348670         10 DS008-IMT00-LBL-SEQ-NBR       PIC  S9(4) COMP.        34867008
348680         10 DS008-IMT00-LBL-TYP-CDE       PIC   X(1).             34868008
348690         10 DS008-IMT00-LBL-ABBR-NM       PIC   X(5).             34869008
348700         10 DS008-IMT00-PRIC-TIER-SEQ-NBR PIC  S9(4) COMP.        34870008
348800         10 DS008-IMT00-LFSTYL-SEQ-NBR    PIC  S9(4) COMP.        34880008
348900 01  DS008-IMT00000-KEYS.                                         34890008
349000     05 DS008K-IMT00-LBL-SEQ-NBR          PIC  S9(4) COMP.        34900008
349100                                                                  34910008
349200 01  DS008-WST00002-KEYS.                                         34920008
349300     05  DS008K-WST00002-EXT-SHP-ID           PIC   X(20).        34930008
349400     05  DS008K-WST00002-PO-NBR               PIC  S9(9) COMP.    34940008
349500     05  DS008K-WST00002-PO-LNE-NBR           PIC  S9(9) COMP.    34950008
349600     05  DS008K-WST00002-RCVR-SEQ-NBR         PIC  S9(9) COMP.    34960008
349700     05  DS008K-WST00002-PREPK-ID             PIC  S9(4) COMP.    34970008
349800                                                                  34980008
349900 01  DS008-DCLWST00001.                                           34990008
350000     05  DS008-DCLWST00001-DATA.                                  35000008
350100         10 DS008-EXT-SHP-ID          PIC   X(20).                35010008
350200         10 DS008-INTR-TRIP-ID        PIC  S9(9) COMP.            35020008
350300         10 DS008-SOR-CDE             PIC   X(2).                 35030008
350400         10 DS008-DMY-SEQ-NBR         PIC  S9(4) COMP.            35040008
350500         10 DS008-DEST-LOC-NBR        PIC  S9(4) COMP.            35050008
350600         10 DS008-DWNLD-CDE           PIC   X(1).                 35060008
350700         10 DS008-RCPT-TMST           PIC   X(26).                35070008
350800         10 DS008-CRE-USR-ID          PIC   X(8).                 35080008
350900         10 DS008-CRE-TMST            PIC   X(26).                35090008
351000         10 DS008-DWNLD-TMST          PIC   X(26).                35100008
351100         10 DS008-LAST-PRCG-TMST      PIC   X(26).                35110008
351200         10 DS008-PRC-CDE             PIC   X(1).                 35120008
351300         10 DS008-VER-NBR             PIC  S9(4) COMP.            35130008
351400         10 DS008-CRE-PGM-CDE         PIC   X(8).                 35140008
351500     05  DS008-DST00001-NULL.                                     35150008
351600         10 DS008-DST00001-NULLS                                  35160008
351700                              OCCURS 14 TIMES PIC S9(4) COMP.     35170008
351800 01  DS008-WST00001-KEYS.                                         35180008
351900     05  DS008K-WST00001-EXT-SHP-ID   PIC X(20).                  35190008
352000******************************************************************35200008
352100* COBOL DECLARATION FOR TABLE TRT_WHSE_RPLNT_INBND_PO             35210008
352200******************************************************************35220008
352300*01  DS008-DCLTRT00057.                                           35230008
352400*    10 WS-TRT57-WHSE-RPLNT-INBND-ID   PIC  S9(9) COMP.           35240008
352500*    10 WS-TRT57-PO-NBR                PIC  S9(9) COMP.           35250008
352600*    10 WS-TRT57-EXTL-REF-NBR          PIC   X(15).               35260008
352700*    10 WS-TRT57-DCONSLR-VEH-DPRTR-IND PIC   X(1).                35270008
352800*    10 WS-TRT57-WHSE-ARRVL-IND        PIC   X(1).                35280008
352900*    10 WS-TRT57-WHSE-AUD-CMPLT-IND    PIC   X(1).                35290008
353000*    10 WS-TRT57-CRE-USR-ID            PIC   X(8).                35300008
353100*    10 WS-TRT57-CRE-TMST              PIC   X(26).               35310008
353200*    10 WS-TRT57-LAST-UPD-USR-ID       PIC   X(8).                35320008
353300*    10 WS-TRT57-LAST-UPD-TMST         PIC   X(26).               35330008
353400*01  DS008-TRT00057-KEYS.                                         35340008
353500*    10 WSK-TRT57-WHSE-RPLNT-INBND-ID  PIC  S9(9) COMP.           35350008
353600*    10 WSK-TRT57-PO-NBR               PIC  S9(9) COMP.           35360008
353700*    10 WSK-TRT57-EXTL-REF-NBR         PIC   X(15).               35370008
353800******************************************************************35380008
353900* COBOL DECLARATION FOR TABLE TRT_WHSE_RPLNT_INBND_CART           35390008
354000******************************************************************35400008
354100*01  DS008-DCLTRT00058.                                           35410008
354200*    10 WS-TRT58-WHSE-RPLNT-INBND-ID   PIC  S9(9) COMP.           35420008
354300*    10 WS-TRT58-PO-NBR                PIC  S9(9) COMP.           35430008
354400*    10 WS-TRT58-EXTL-REF-NBR          PIC   X(15).               35440008
354500*    10 WS-TRT58-SSCC-ID               PIC   X(48).               35450008
354600*    10 WS-TRT58-DCONSLR-DPRTR-IND     PIC   X(1).                35460008
354700*    10 WS-TRT58-WHSE-ARRVL-SSCC-IND   PIC   X(1).                35470008
354800*    10 WS-TRT58-WHSE-AUD-CMPLT-IND    PIC   X(1).                35480008
354900*    10 WS-TRT58-WHSE-AUD-UNT-QTY      PIC   S9(9) COMP.          35490008
355000*    10 WS-TRT58-CRE-USR-ID            PIC   X(8).                35500008
355100*    10 WS-TRT58-CRE-TMST              PIC   X(26).               35510008
355200*    10 WS-TRT58-LAST-UPD-USR-ID       PIC   X(8).                35520008
355300*    10 WS-TRT58-LAST-UPD-TMST         PIC   X(26).               35530008
355400*01  DS008-TRT00058-KEYS.                                         35540008
355500*    10 WSK-TRT58-WHSE-RPLNT-INBND-ID  PIC  S9(9) COMP.           35550008
355600*    10 WSK-TRT58-PO-NBR               PIC  S9(9) COMP.           35560008
355700*    10 WSK-TRT58-EXTL-REF-NBR         PIC   X(15).               35570008
355800*    10 WSK-TRT58-SSCC-ID              PIC   X(48).               35580008
355900******************************************************************35590008
356000* COBOL DECLARATION FOR TABLE TRT_WHSE_RPLNT_INBND                35600008
356100******************************************************************35610008
356200*01  DS008-DCLTRT00056.                                           35620008
356300*    10 WS-TRT56-WHSE-RPLNT-INBND-ID   PIC  S9(9) COMP.           35630008
356400*    10 WS-TRT56-OWNER-SCAC-ID         PIC   X(4).                35640008
356500*    10 WS-TRT56-VEH-NBR               PIC   X(10).               35650008
356600*    10 WS-TRT56-DCONSLR-DPRTR-TMST    PIC   X(26).               35660008
356700*    10 WS-TRT56-DCONSLR-TRP-ID        PIC   X(20).               35670008
356800*    10 WS-TRT56-WHSE-LOC-ID           PIC  S9(4) COMP.           35680008
356900*    10 WS-TRT56-DCONSLR-SCAC-CDE      PIC   X(4).                35690008
357000*    10 WS-TRT56-WHSE-ARRVL-TMST       PIC   X(26).               35700008
357100*    10 WS-TRT56-WHSE-AUD-CMPLT-TMST   PIC   X(26).               35710008
357200*    10 WS-TRT56-POE-STD-EDI-CDE       PIC   X(4).                35720008
357300*    10 WS-TRT56-CRE-USR-ID            PIC   X(8).                35730008
357400*    10 WS-TRT56-CRE-TMST              PIC   X(26).               35740008
357500*    10 WS-TRT56-LAST-UPD-USR-ID       PIC   X(8).                35750008
357600*    10 WS-TRT56-LAST-UPD-TMST         PIC   X(26).               35760008
357700*01  DS008-TRT00056-KEYS.                                         35770008
357800*    10 WSK-TRT56-WHSE-RPLNT-INBND-ID  PIC  S9(9) COMP.           35780008
357900******************************************************************35790008
358000* COBOL DECLARATION FOR TABLE TRT_WHSE_RPLNT_INBND_PO_AUD         35800008
358100******************************************************************35810008
358200*01  DS008-DCLTRT00060.                                           35820008
358300*    10 WS-TRT60-WHSE-RPLNT-INBND-ID   PIC  S9(9) COMP.           35830008
358400*    10 WS-TRT60-PO-NBR                PIC  S9(9) COMP.           35840008
358500*    10 WS-TRT60-EXTL-REF-NBR          PIC   X(15).               35850008
358600*    10 WS-TRT60-DCONSLR-VEH-DPRTR-IND PIC   X(1).                35860008
358700*    10 WS-TRT60-WHSE-ARRVL-IND        PIC   X(1).                35870008
358800*    10 WS-TRT60-WHSE-AUD-CMPLT-IND    PIC   X(1).                35880008
358900*    10 WS-TRT60-CRE-USR-ID            PIC   X(8).                35890008
359000*    10 WS-TRT60-CRE-TMST              PIC   X(26).               35900008
359100*    10 WS-TRT60-LAST-UPD-USR-ID       PIC   X(8).                35910008
359200*    10 WS-TRT60-LAST-UPD-TMST         PIC   X(26).               35920008
359300*    10 WS-TRT60-AUD-FUNC-CDE          PIC   X(1).                35930008
359400*    10 WS-TRT60-AUD-TMST              PIC   X(26).               35940008
359500*01  DS008-TRT00060-KEYS.                                         35950008
359600*    10 WSK-TRT60-WHSE-RPLNT-INBND-ID  PIC  S9(9) COMP.           35960008
359700*    10 WSK-TRT60-PO-NBR               PIC  S9(9) COMP.           35970008
359800*    10 WSK-TRT60-EXTL-REF-NBR         PIC   X(15).               35980008
359900*    10 WSK-TRT60-LAST-UPD-TMST        PIC   X(26).               35990008
360000******************************************************************36000008
360100* COBOL DECLARATION FOR TABLE TRT_WHSE_RPLNT_INBND_CART_AUD       36010008
360200******************************************************************36020008
360300*01  DS008-DCLTRT00061.                                           36030008
360400*    10 WS-TRT61-WHSE-RPLNT-INBND-ID   PIC  S9(9) COMP.           36040008
360500*    10 WS-TRT61-PO-NBR                PIC  S9(9) COMP.           36050008
360600*    10 WS-TRT61-EXTL-REF-NBR          PIC   X(15).               36060008
360700*    10 WS-TRT61-SSCC-ID               PIC   X(48).               36070008
360800*    10 WS-TRT61-DCONSLR-DPRTR-IND     PIC   X(1).                36080008
360900*    10 WS-TRT61-WHSE-ARRVL-SSCC-IND   PIC   X(1).                36090008
361000*    10 WS-TRT61-WHSE-AUD-CMPLT-IND    PIC   X(1).                36100008
361100*    10 WS-TRT61-WHSE-AUD-UNT-QTY      PIC   S9(9) COMP.          36110008
361200*    10 WS-TRT61-CRE-USR-ID            PIC   X(8).                36120008
361300*    10 WS-TRT61-CRE-TMST              PIC   X(26).               36130008
361400*    10 WS-TRT61-LAST-UPD-USR-ID       PIC   X(8).                36140008
361500*    10 WS-TRT61-LAST-UPD-TMST         PIC   X(26).               36150008
361600*    10 WS-TRT61-AUD-FUNC-CDE          PIC   X(1).                36160008
361700*    10 WS-TRT61-AUD-TMST              PIC   X(26).               36170008
361800*01  DS008-TRT00061-KEYS.                                         36180008
361900*    10 WSK-TRT61-WHSE-RPLNT-INBND-ID  PIC  S9(9) COMP.           36190008
362000*    10 WSK-TRT61-PO-NBR               PIC  S9(9) COMP.           36200008
362100*    10 WSK-TRT61-EXTL-REF-NBR         PIC   X(15).               36210008
362200*    10 WSK-TRT16-SSCC-ID              PIC   X(48).               36220008
362300*    10 WSK-TRT61-LAST-UPD-TMST        PIC   X(26).               36230008
362400******************************************************************36240008
362500* COBOL DECLARATION FOR TABLE TRT_WHSE_RPLNT_INBND_AUD            36250008
362600******************************************************************36260008
362700*01  DS008-DCLTRT00059.                                           36270008
362800*    10 WS-TRT59-WHSE-RPLNT-INBND-ID   PIC  S9(9) COMP.           36280008
362900*    10 WS-TRT59-OWNER-SCAC-ID         PIC   X(4).                36290008
363000*    10 WS-TRT59-VEH-NBR               PIC   X(10).               36300008
363100*    10 WS-TRT59-DCONSLR-DPRTR-TMST    PIC   X(26).               36310008
363200*    10 WS-TRT59-DCONSLR-TRP-ID        PIC   X(20).               36320008
363300*    10 WS-TRT59-WHSE-LOC-ID           PIC  S9(4) COMP.           36330008
363400*    10 WS-TRT59-DCONSLR-SCAC-CDE      PIC   X(4).                36340008
363500*    10 WS-TRT59-WHSE-ARRVL-TMST       PIC   X(26).               36350008
363600*    10 WS-TRT59-WHSE-AUD-CMPLT-TMST   PIC   X(26).               36360008
363700*    10 WS-TRT59-POE-STD-EDI-CDE       PIC   X(4).                36370008
363800*    10 WS-TRT59-CRE-USR-ID            PIC   X(8).                36380008
363900*    10 WS-TRT59-CRE-TMST              PIC   X(26).               36390008
364000*    10 WS-TRT59-LAST-UPD-USR-ID       PIC   X(8).                36400008
364100*    10 WS-TRT59-LAST-UPD-TMST         PIC   X(26).               36410008
364200*    10 WS-TRT59-AUD-FUNC-CDE          PIC   X(1).                36420008
364300*    10 WS-TRT59-AUD-TMST              PIC   X(26).               36430008
364400*01  DS008-TRT00059-KEYS.                                         36440008
364500*    10 WSK-TRT59-WHSE-RPLNT-INBND-ID  PIC  S9(9) COMP.           36450008
364600*    10 WSK-TRT59-LAST-UPD-TMST        PIC   X(26).               36460008
364700******************************************************************36470008
364800* COBOL DECLARATION FOR TABLE TASDTPL                             36480008
364900******************************************************************36490008
365000 01  WS-ASDTPL.                                                   36500008
365100     05  WS-ASDTPL-DATA.                                          36510008
365200         10 WS-ASDTPL-ASNHDR-ID     PIC S9(9) COMP.               36520008
365300         10 WS-ASDTPL-ASNDTL-NBR    PIC S9(7)V COMP-3.            36530008
365400         10 WS-ASDTPL-PO-LN-NBR     PIC S9(3)V COMP-3.            36540008
365500         10 WS-ASDTPL-ASSOC-QTY     PIC S9(7)V COMP-3.            36550008
365600         10 WS-ASDTPL-ASDTPL-ALLOC-IND PIC X(1).                  36560008
365700         10 WS-ASDTPL-SHIPT-VAR-QTY PIC S9(7)V COMP-3.            36570008
365800         10 WS-ASDTPL-PR-CHG-EFF-DAY-NBR PIC S9(2)V COMP-3.       36580008
365900         10 WS-ASDTPL-PR-VAR-IND    PIC X(1).                     36590008
366000         10 WS-ASDTPL-PR-DISC-IND   PIC X(1).                     36600008
366100         10 WS-ASDTPL-PO-NBR        PIC X(22).                    36610008
366200     05  WS-ASDTPL-NULL.                                          36620008
366300         10 WS-ASDTPL-NULLS OCCURS 10 TIMES PIC S9(4) COMP.       36630008
366400 01  WS-ASDTPL-KEYS.                                              36640008
366500     10 DS-ASDTPL-ASNHDR-ID           PIC  S9(9) COMP.            36650008
366600     10 DS-ASDTPL-ASNDTL-NBR          PIC  S9(7)V COMP-3.         36660008
366700     10 DS-ASDTPL-PO-LN-NBR           PIC S9(3)V COMP-3.          36670008
239500******************************************************************36680009
239600* COBOL DECLARATION FOR TABLE TTRDPRT                             36690009
239700******************************************************************36700009
239800 01  WS-TRDPRT.                                                   36710009
239900     05  WS-TRDPRT-DATA.                                          36720009
243500         10 WS-TRDPRT-TP-DKEY       PIC  S9(9) COMP.              36730009
243600         10 WS-TRDPRT-ENT-ID        PIC  S9(9) COMP.              36740009
240000         10 WS-TRDPRT-VEND-INCHG-ID PIC X(15).                    36750009
240000         10 WS-TRDPRT-VEND-INCHG-ID-DESC PIC X(2).                36760009
240000         10 WS-TRDPRT-NETWK-ID      PIC X(1).                     36770009
240000         10 WS-TRDPRT-KOHL-INCHG-ID PIC X(15).                    36780009
240000         10 WS-TRDPRT-KOHL-INCHG-ID-DESC PIC X(2).                36790009
240000         10 WS-TRDPRT-SEND-FMT-VER-CDE PIC X(5).                  36800009
240000         10 WS-TRDPRT-SEND-FMT-NME  PIC X(1).                     36810009
240000         10 WS-TRDPRT-LAST-SEND-CNTL-NBR  PIC S9(9)V COMP-3.      36820009
240000         10 WS-TRDPRT-SEND-CNTL-NBR-CDE  PIC X(1).                36830009
240000         10 WS-TRDPRT-OVRRD-SND-CNTL-NBR  PIC S9(9)V COMP-3.      36840009
240000         10 WS-TRDPRT-OVRRD-SND-CNTL-ID PIC X(1).                 36850009
240000         10 WS-TRDPRT-RECV-FMT-VER-CDE  PIC X(5).                 36860009
240000         10 WS-TRDPRT-RECV-FMT-NME      PIC X(1).                 36870009
240000         10 WS-TRDPRT-LAST-RECV-CNTL-NBR  PIC S9(9)V COMP-3.      36880009
240000         10 WS-TRDPRT-RECV-CNTL-NBR-CDE PIC X(1).                 36890009
240000         10 WS-TRDPRT-OVRRD-RCV-CNTL-NBR  PIC S9(9)V COMP-3.      36900009
240000         10 WS-TRDPRT-OVRRD-RCV-CNTL-ID PIC X(1).                 36910009
240000         10 WS-TRDPRT-SETUP-DTE         PIC X(10).                36920009
240000         10 WS-TRDPRT-LAST-CHG-DTE      PIC X(10).                36930009
240000         10 WS-TRDPRT-LAST-CHG-UID      PIC X(8).                 36940009
240000         10 WS-TRDPRT-ACTV-DTE          PIC X(10).                36950009
240000         10 WS-TRDPRT-INACTV-DTE        PIC X(10).                36960009
240000         10 WS-TRDPRT-SER-LVL-CDE       PIC X(3).                 36970009
240000         10 WS-TRDPRT-NOTES-TXT         PIC X(80).                36980009
240000         10 WS-TRDPRT-LAST-CALL-DTE     PIC X(10).                36990009
240000         10 WS-TRDPRT-NEXT-CALL-DTE     PIC X(10).                37000009
240000         10 WS-TRDPRT-SEND-AUTH-INFO-ID PIC X(10).                37010009
240000         10 WS-TRDPRT-SEND-AUTH-INF-DESC PIC X(2).                37020009
240000         10 WS-TRDPRT-SEND-SEC-INFO-ID  PIC X(10).                37030009
240000         10 WS-TRDPRT-SEND-SEC-INFO-DESC PIC X(2).                37040009
240000         10 WS-TRDPRT-SEND-DATA-ELEM-IND PIC X(2).                37050009
240000         10 WS-TRDPRT-SEND-SEG-TERM-IND  PIC X(2).                37060009
240000         10 WS-TRDPRT-SEND-SUB-ELEM-IND  PIC X(2).                37070009
240000         10 WS-TRDPRT-SEND-ACK-REQD-IND  PIC X(1).                37080009
240000         10 WS-TRDPRT-INTRCONN-NETWK-IND PIC X(1).                37090009
240000         10 WS-TRDPRT-FA-COM-MTHD-CDE    PIC X(1).                37100009
243400 01  WS-TRDPRT-KEYS.                                              37110009
243500     10 DS-TRDPRT-TP-DKEY             PIC  S9(9) COMP.            37120009
243600     10 DS-TRDPRT-ENT-ID              PIC  S9(9) COMP.            37130009
239500******************************************************************37140009
239600* COBOL DECLARATION FOR TABLE TFGTRST                             37150009
239700******************************************************************37160009
239800 01  WS-FGTRST.                                                   37170009
239900     05  WS-FGTRST-DATA.                                          37180009
243500         10 WS-FGTRST-TP-DKEY                PIC  S9(9) COMP.     37190009
243600         10 WS-FGTRST-TP-DKEY-TMST           PIC   X(26).         37200009
240000         10 WS-FGTRST-FUNC-CDE-SEQ-NBR       PIC  S9(9) COMP.     37210009
240000         10 WS-FGTRST-TRN-SET-SEQ-NBR        PIC  S9(9) COMP.     37220009
240000         10 WS-FGTRST-TRN-SET-CDE            PIC   X(3).          37230009
240000         10 WS-FGTRST-FUNC-CDE-CNTL-NBR      PIC  S9(9)V COMP-3.  37240009
240000         10 WS-FGTRST-VEND-ACK-IND           PIC   X(1).          37250009
240000         10 WS-FGTRST-TRN-SET-CNTL-NBR       PIC   X(9).          37260009
240000         10 WS-FGTRST-TRN-DTL-TXT            PIC   X(30).         37270009
240000         10 WS-FGTRST-CHARS-XMIT-NBR         PIC  S9(9) COMP.     37280009
240000         10 WS-FGTRST-RTE-IND                PIC   X(1).          37290009
240000         10 WS-FGTRST-TRANSL-ERR-IND         PIC   X(1).          37300009
240000         10 WS-FGTRST-TRN-RLSE-TMST          PIC   X(26).         37310009
240000         10 WS-FGTRST-PO-ACKNL-STAT-CDE      PIC   X(1).          37320009
243400 01  WS-FGTRST-KEYS.                                              37330009
243500     10 DS-FGTRST-TP-DKEY             PIC  S9(9) COMP.            37340009
243500     10 DS-FGTRST-TP-DKEY-TMST        PIC   X(26).                37350009
243500     10 DS-FGTRST-FUNC-CDE-SEQ-NBR    PIC  S9(9) COMP.            37360009
243500     10 DS-FGTRST-TRN-SET-SEQ-NBR     PIC  S9(9) COMP.            37370009
239500******************************************************************37380009
239600* COBOL DECLARATION FOR TABLE TINTTRN                             37390009
239700******************************************************************37400009
239800 01  WS-INTTRN.                                                   37410009
239900     05  WS-INTTRN-DATA.                                          37420009
243500         10 WS-INTTRN-TP-DKEY                PIC  S9(9) COMP.     37430009
243600         10 WS-INTTRN-TP-DKEY-TMST           PIC   X(26).         37440009
240000         10 WS-INTTRN-DIR-IND                PIC   X(1).          37450009
240000         10 WS-INTTRN-INCHG-CNTL-NBR         PIC  S9(9)V COMP-3.  37460009
240000         10 WS-INTTRN-CRE-DTE                PIC   X(10).         37470009
240000         10 WS-INTTRN-CRE-TME                PIC   X(8).          37480009
240000         10 WS-INTTRN-MAILBOX-REC-DTE        PIC   X(10).         37490009
240000         10 WS-INTTRN-MAILBOX-REC-TME        PIC   X(8).          37500009
240000         10 WS-INTTRN-MAILBOX-PU-DTE         PIC   X(10).         37510009
240000         10 WS-INTTRN-MAILBOX-PU-TME         PIC   X(8).          37520009
240000         10 WS-INTTRN-ERR-IND                PIC   X(1).          37530009
240000         10 WS-INTTRN-PROD-TEST-IND          PIC   X(1).          37540009
240000         10 WS-INTTRN-TRANSL-SESS-ID         PIC  S9(9) COMP.     37550009
240000         10 WS-INTTRN-TRN-MANL-FRCD-IND      PIC   X(1).          37560009
243400 01  WS-INTTRN-KEYS.                                              37570009
243500     10 DS-INTTRN-TP-DKEY             PIC  S9(9) COMP.            37580009
243500     10 DS-INTTRN-TP-DKEY-TMST        PIC   X(26).                37590009
