000100* FIELDS ADDED TO WS-MDARVS (TO MATCH TABLE LAYOUT) 05/19/2004            
000200* WR26682 (S. JACKSON)                                                    
000300* 09/14/2005  P. KEBER  WR28563  C-O-ORGN-CDE FIELD ADDED TO              
000400* WS-MDARVS.  TABLE IMT_STYL_PRTNR ADDED.                                 
000500* 09/28/2006  P. KEBER  WR30627  TABLE IMT_LBL ADDED.                     
000600* 04/30/2007  P. KEBER  ADD CUST_INTFC_DESC TO TMDARVS UNLOAD.            
000700* 08/02/2007  P.KEBER   ADD NEW TWEBITM COLUMNS.                          
000700* 08/15/2010  B.GRAHAM - KFORCE ADD TMDARVS AND TUPC COLUMNS              
000700*                        WR35681, WR37044, WR37184, WR38861               
000700* 05/24/2020  G.BANDA   ADD TPKSLIP COLUMN                                
000800*                       WS-PKSLIP-ORIG-PKSL-SEQ-NBR                       
000700* 05/24/2020  G.BANDA   ADD TABLE TASDTPL                                 
000700* 03/17/2022  J.KURK    REMOVE TPOUPC & TSPSTDS                           
000700* 04/15/2023  J.KURK    ADD LOC_NBR TO TASNORD TABLE                      
000700*                       ADD TABLES TTRDPRT, TFGTRST, TINTTRN              
000900*****************************************************************         
001000* COBOL DECLARATION FOR TABLE TPURCHS                                     
001100*****************************************************************         
001200 01  WS-PURCHS.                                                           
001300     10 WS-PURCHS-PO-NBR              PIC  S9(9) COMP.                    
001400     10 WS-PURCHS-VER-NBR             PIC  S9(9) COMP.                    
001500     10 WS-PURCHS-VER-STATUS-CDE      PIC   X(1).                         
001600     10 WS-PURCHS-PO-TYP-CDE          PIC   X(2).                         
001700     10 WS-PURCHS-PO-CATEG-CDE        PIC   X(2).                         
001800     10 WS-PURCHS-EDI-IND             PIC   X(1).                         
001900     10 WS-PURCHS-TOT-UNT-QTY         PIC  S9(9) COMP.                    
002000     10 WS-PURCHS-TOT-VAL-COST-AMT    PIC  S9(8)V9(2) COMP-3.             
002100     10 WS-PURCHS-TOT-VAL-RTL-AMT     PIC  S9(8)V9(2) COMP-3.             
002200     10 WS-PURCHS-TOT-MU-PCT          PIC  S9(3)V9(2) COMP-3.             
002300     10 WS-PURCHS-TOT-SKUS-QTY        PIC  S9(4) COMP.                    
002400     10 WS-PURCHS-IMPRT-AGNT-PO-NBR   PIC  S9(9) COMP.                    
002500     10 WS-PURCHS-IMPRT-ORD-OFF-NAME  PIC   X(20).                        
002600     10 WS-PURCHS-IMPRT-VEND-NAME     PIC   X(35).                        
002700     10 WS-PURCHS-IMPRT-FCTRY-NAME    PIC   X(35).                        
002800     10 WS-PURCHS-IMPRT-CNTRY-NAME    PIC   X(20).                        
002900     10 WS-PURCHS-VEND-CNTRY-NAME     PIC   X(20).                        
003000     10 WS-PURCHS-NEW-STR-PO-IND      PIC   X(1).                         
003100     10 WS-PURCHS-IMPRT-PO-IND        PIC   X(1).                         
003200     10 WS-PURCHS-IMPRT-AGNT-PO-IND   PIC   X(1).                         
003300     10 WS-PURCHS-STATUS-TMST         PIC   X(26).                        
003400     10 WS-PURCHS-LAST-UPD-TMST       PIC   X(26).                        
003500     10 WS-PURCHS-EDI-REXMIT-IND      PIC   X(1).                         
003600     10 WS-PURCHS-EDI-REXMIT-TMST     PIC   X(26).                        
003700     10 WS-PURCHS-DIR-STR-IND         PIC   X(1).                         
003800     10 WS-PURCHS-LAST-UPD-BY-UID     PIC   X(8).                         
003900     10 WS-PURCHS-APP-BY-UID          PIC   X(8).                         
004000     10 WS-PURCHS-OTB-PER-NBR         PIC   X(6).                         
004100     10 WS-PURCHS-DEPT-NBR            PIC   X(3).                         
004200     10 WS-PURCHS-ENT-ID              PIC  S9(9) COMP.                    
004300     10 WS-PURCHS-STATUS-CDE          PIC   X(2).                         
004400     10 WS-PURCHS-CRE-BY-UID          PIC   X(8).                         
004500     10 WS-PURCHS-REJ-CT              PIC  S9(4) COMP.                    
004600     10 WS-PURCHS-REJ-UID             PIC   X(8).                         
004700     10 WS-PURCHS-ORD-DTE             PIC   X(10).                        
004800     10 WS-PURCHS-REVISION-CT         PIC  S9(4) COMP.                    
004900     10 WS-PURCHS-ADR-SEQ-NBR         PIC  S9(4) COMP.                    
005000     10 WS-PURCHS-DEST-KNOWN-IND      PIC   X(1).                         
005100     10 WS-PURCHS-RLSE-IND            PIC   X(1).                         
005200     10 WS-PURCHS-RLSE-DTE            PIC   X(10).                        
005300     10 WS-PURCHS-ANLYS-HOLD-IND      PIC   X(1).                         
005400     10 WS-PURCHS-PLCMNT-CNTRY-CDE    PIC   X(3).                         
005500     10 WS-PURCHS-PROD-CNTRY-CDE      PIC   X(3).                         
005600     10 WS-PURCHS-UNT-PER-CBMT-QTY    PIC  S9(9) COMP.                    
005700     10 WS-PURCHS-TKT-FMT-NBR         PIC   X(15).                        
005800     10 WS-PURCHS-TKT-FMT-DESC        PIC   X(30).                        
005900     10 WS-PURCHS-CRE-TMST            PIC   X(26).                        
006000     10 WS-PURCHS-PRG-LAST-ACTVY-DTE  PIC   X(10).                        
006100     10 WS-PURCHS-PKGNG-CDE           PIC   X(1).                         
006200     10 WS-PURCHS-SEASET-YR           PIC   X(4).                         
006300     10 WS-PURCHS-SEASET-SHRT-NM      PIC   X(5).                         
006400     10 WS-PURCHS-QTA-CTG-CDE         PIC   X(5).                         
006500     10 WS-PURCHS-PO-IN-RMS-IND       PIC   X(1).                         
006600     10 WS-PURCHS-RMS-PO-UPD-TMST        PIC   X(26).                     
006700     10 WS-PURCHS-DUP-SKU-IND            PIC   X(1).                      
006800     10 WS-PURCHS-ORIG-PKGNG-CDE         PIC   X(1).                      
006900     10 WS-PURCHS-IMPRT-VND-ID           PIC  S9(9) COMP.                 
007000     10 WS-PURCHS-IMPRT-FCTRY-ID         PIC  S9(9) COMP.                 
007100     10 WS-PURCHS-DERVD-LBL-TYP-CDE      PIC   X(1).                      
007200     10 WS-PURCHS-DELY-ID            PIC  S9(10)V COMP-3.                 
007300     10 WS-PURCHS-DELY-ID-NULL       PIC  S9(4) COMP.                     
007400     10 WS-PURCHS-PO-SHRT-CYC-IND        PIC   X(1).                      
007400     10 WS-PURCHS-WHSE-RPLNT-IND         PIC   X(1).                      
007500 01  WS-PURCHS-KEYS.                                                      
007600     10 DS-PURCHS-PO-NBR              PIC  S9(9) COMP.                    
007700     10 DS-PURCHS-VER-NBR             PIC  S9(9) COMP.                    
007800*****************************************************************         
007900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  51              
008000*****************************************************************         
008100*****************************************************************         
008200* COBOL DECLARATION FOR TABLE TWS-PURITM                                  
008300*****************************************************************         
008400 01  WS-PURITM.                                                           
008500     10 WS-PURITM-PO-NBR              PIC  S9(9) COMP.                    
008600     10 WS-PURITM-VER-NBR             PIC  S9(9) COMP.                    
008700     10 WS-PURITM-PO-LNE-NBR          PIC  S9(9) COMP.                    
008800     10 WS-PURITM-VER-STATUS-CDE      PIC   X(1).                         
008900     10 WS-PURITM-SKU-SEQ-NBR         PIC   X(3).                         
009000     10 WS-PURITM-CL-NBR              PIC   X(2).                         
009100     10 WS-PURITM-VEND-STYL-NAME      PIC   X(20).                        
009200     10 WS-PURITM-COLOR-DESC          PIC   X(25).                        
009300     10 WS-PURITM-SIZE-DESC           PIC   X(25).                        
009400     10 WS-PURITM-UM-IND              PIC   X(2).                         
009500     10 WS-PURITM-UNT-QTY             PIC  S9(9) COMP.                    
009600     10 WS-PURITM-UNT-RTL-PR-AMT      PIC  S9(6)V9(2) COMP-3.             
009700     10 WS-PURITM-UNT-COST-AMT        PIC  S9(4)V9(3) COMP-3.             
009800     10 WS-PURITM-TOT-VAL-COST-AMT    PIC  S9(8)V9(2) COMP-3.             
009900     10 WS-PURITM-TOT-VAL-RTL-AMT     PIC  S9(8)V9(2) COMP-3.             
010000     10 WS-PURITM-MU-PCT              PIC  S9(3)V9(2) COMP-3.             
010100     10 WS-PURITM-CRE-TMST            PIC   X(26).                        
010200     10 WS-PURITM-LAST-UPD-TMST       PIC   X(26).                        
010300     10 WS-PURITM-ITM-NBR             PIC  S9(15)V COMP-3.                
010400     10 WS-PURITM-SKU-DESC            PIC   X(25).                        
010500     10 WS-PURITM-COLOR-CDE           PIC   X(4).                         
010600     10 WS-PURITM-SIZE-CDE            PIC   X(5).                         
010700     10 WS-PURITM-AD-EVNT-DTE         PIC   X(10).                        
010800     10 WS-PURITM-STATUS-CDE          PIC   X(2).                         
010900     10 WS-PURITM-CRE-BY-UID          PIC   X(8).                         
011000     10 WS-PURITM-LAST-UPD-BY-UID     PIC   X(8).                         
011100     10 WS-PURITM-GP-RTL-AMT          PIC  S9(5)V9(2) COMP-3.             
011200     10 WS-PURITM-GP-QTY              PIC  S9(4) COMP.                    
011300     10 WS-PURITM-APP-PO-LNE-NBR      PIC  S9(4) COMP.                    
011400     10 WS-PURITM-PIC-ITM-IND         PIC   X(1).                         
011500     10 WS-PURITM-PIC-PG-NBR          PIC  S9(4) COMP.                    
011600     10 WS-PURITM-PRD-1ST-COST-AMT    PIC  S9(4)V9(3) COMP-3.             
011700     10 WS-PURITM-STAT-TMST           PIC   X(26).                        
011800     10 WS-02-PURITM-PO-PREPK-ID      PIC  S9(4) COMP.                    
011900     10 WS-02-PURITM-PREPK-RATO-QTY   PIC  S9(4) COMP.                    
012000     10 WS-PURITM-SHIP-TO-TMP-DC-IND  PIC   X(1).                         
012100     10 WS-PURITM-RMS-PO-SKU-NBR      PIC  S9(8)V COMP-3.                 
012200     10 WS-PURITM-CNCLD-UNT-QTY       PIC  S9(9) COMP.                    
012200     10 WS-PURITM-INNR-PK-QTY         PIC  S9(4) COMP.                    
012200     10 WS-PURITM-OUTR-PK-QTY         PIC  S9(4) COMP.                    
012300 01  WS-PURITM-KEYS.                                                      
012400     10 DS-PURITM-PO-NBR              PIC  S9(9) COMP.                    
012500     10 DS-PURITM-VER-NBR             PIC  S9(9) COMP.                    
012600     10 DS-PURITM-PO-LNE-NBR          PIC  S9(9) COMP.                    
012700*****************************************************************         
012800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  33              
012900*****************************************************************         
013000*****************************************************************         
013100* COBOL DECLARATION FOR TABLE TPOAGMT                                     
013200*****************************************************************         
013300 01  WS-POAGMT.                                                           
013400     10 WS-POAGMT-PO-NBR              PIC  S9(9) COMP.                    
013500     10 WS-POAGMT-VER-NBR             PIC  S9(9) COMP.                    
013600     10 WS-POAGMT-AGRMT-TYP-ID        PIC   X(1).                         
013700     10 WS-POAGMT-SEQ-NBR             PIC  S9(9) COMP.                    
013800     10 WS-POAGMT-VER-STATUS-CDE      PIC   X(1).                         
013900     10 WS-POAGMT-TYP-CDE             PIC  S9(4) COMP.                    
014000     10 WS-POAGMT-TKT-MKR-IND         PIC   X(1).                         
014100     10 WS-POAGMT-BULK-STK-TKT-IND    PIC   X(1).                         
014200     10 WS-POAGMT-EDI-PROMO-TXT       PIC   X(30).                        
014300     10 WS-POAGMT-PO-CAN-DAY-QTY      PIC  S9(4) COMP.                    
014400     10 WS-POAGMT-AUTO-PO-CAN-IND     PIC   X(1).                         
014500     10 WS-POAGMT-DISC-DOL-AMT        PIC  S9(6)V9(2) COMP-3.             
014600     10 WS-POAGMT-DISC-PCT            PIC  SV9(4) COMP-3.                 
014700     10 WS-POAGMT-DISC-PAY-DAY-QTY    PIC  S9(4) COMP.                    
014800     10 WS-POAGMT-LAST-UPD-TMST       PIC   X(26).                        
014900     10 WS-POAGMT-PAYT-TERM-ID        PIC  S9(4) COMP.                    
015000     10 WS-POAGMT-LAST-UPD-BY-UID     PIC   X(8).                         
015100     10 WS-POAGMT-LEADTIME-DAYS-QTY   PIC  S9(4) COMP.                    
015200 01  WS-POAGMT-KEYS.                                                      
015300     10 DS-POAGMT-PO-NBR              PIC  S9(9) COMP.                    
015400     10 DS-POAGMT-VER-NBR             PIC  S9(9) COMP.                    
015500     10 DS-POAGMT-AGRMT-TYP-ID        PIC   X(1).                         
015600     10 DS-POAGMT-SEQ-NBR             PIC  S9(9) COMP.                    
015700*****************************************************************         
015800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  18              
015900*****************************************************************         
016000*****************************************************************         
016100* COBOL DECLARATION FOR TABLE TPOINST                                     
016200*****************************************************************         
016300 01  WS-POINST.                                                           
016400     10 WS-POINST-PO-NBR              PIC  S9(9) COMP.                    
016500     10 WS-POINST-RECIP-CDE           PIC   X(2).                         
016600     10 WS-POINST-INSTR-NBR           PIC  S9(9) COMP.                    
016700     10 WS-POINST-CRE-BY-UID          PIC   X(8).                         
016800     10 WS-POINST-CRE-TMST            PIC   X(26).                        
016900 01  WS-POINST-KEYS.                                                      
017000     10 DS-POINST-PO-NBR              PIC  S9(9) COMP.                    
017100     10 DS-POINST-RECIP-CDE           PIC   X(2).                         
017200     10 DS-POINST-INSTR-NBR           PIC  S9(9) COMP.                    
017300*****************************************************************         
017400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   5              
017500*****************************************************************         
017600*****************************************************************         
017700* COBOL DECLARATION FOR TABLE TIMPORL                                     
017800*****************************************************************         
017900 01  WS-IMPORL.                                                           
018000     10 WS-IMPORL-PO-NBR              PIC  S9(9) COMP.                    
018100     10 WS-IMPORL-VER-NBR             PIC  S9(9) COMP.                    
018200     10 WS-IMPORL-VER-STATUS-CDE      PIC   X(1).                         
018300     10 WS-IMPORL-CONSLR-RLSE-CDE     PIC   X(1).                         
018400     10 WS-IMPORL-CONSLR-REQR-DTE     PIC   X(10).                        
018500     10 WS-IMPORL-CONSLR-ACTL-DTE     PIC   X(10).                        
018600     10 WS-IMPORL-CONSLR-ACTL-TM      PIC   X(8).                         
018700     10 WS-IMPORL-CSTM-BKR-RLSE-CDE   PIC   X(1).                         
018800     10 WS-IMPORL-CSTM-BKR-REQR-DTE   PIC   X(10).                        
018900     10 WS-IMPORL-CSTM-BKR-ACTL-DTE   PIC   X(10).                        
019000     10 WS-IMPORL-CSTM-BKR-ACTL-TM    PIC   X(8).                         
019100     10 WS-IMPORL-TKT-PRTR-RLSE-CDE   PIC   X(1).                         
019200     10 WS-IMPORL-TKT-PRTR-REQR-DTE   PIC   X(10).                        
019300     10 WS-IMPORL-TKT-PRTR-ACTL-DTE   PIC   X(10).                        
019400     10 WS-IMPORL-TKT-PRTR-ACTL-TM    PIC   X(8).                         
019500     10 WS-IMPORL-DCONSLR-RLSE-CDE    PIC   X(1).                         
019600     10 WS-IMPORL-DCONSLR-REQR-DTE    PIC   X(10).                        
019700     10 WS-IMPORL-DCONSLR-ACTL-DTE    PIC   X(10).                        
019800     10 WS-IMPORL-DCONSLR-ACTL-TM     PIC   X(8).                         
019900     10 WS-IMPORL-LAST-UPD-TMST       PIC   X(26).                        
020000     10 WS-IMPORL-LAST-UPD-BY-UID     PIC   X(8).                         
020100     10 WS-IMPORL-DCONSLR-ENT-ID      PIC  S9(9) COMP.                    
020200 01  WS-IMPORL-KEYS.                                                      
020300     10 DS-IMPORL-PO-NBR              PIC  S9(9) COMP.                    
020400     10 DS-IMPORL-VER-NBR             PIC  S9(9) COMP.                    
020500*****************************************************************         
020600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  21              
020700*****************************************************************         
020800*****************************************************************         
020900* COBOL DECLARATION FOR TABLE TALLPLN                                     
021000*****************************************************************         
021100 01  WS-ALLPLN.                                                           
021200     10 WS-ALLPLN-PO-NBR              PIC  S9(9) COMP.                    
021300     10 WS-ALLPLN-PO-LNE-NBR          PIC  S9(9) COMP.                    
021400     10 WS-ALLPLN-PLAN-NBR            PIC  S9(4) COMP.                    
021500     10 WS-ALLPLN-CURR-SPLIT-QTY      PIC  S9(9) COMP.                    
021600     10 WS-ALLPLN-DEST-NBR            PIC  S9(4) COMP.                    
021700     10 WS-ALLPLN-STATUS-CDE          PIC   X(2).                         
021800     10 WS-ALLPLN-DC-SPLIT-QTY        PIC  S9(9) COMP.                    
021900     10 WS-ALLPLN-SPLIT-REQ-ID        PIC  S9(9) COMP.                    
022000     10 WS-ALLPLN-SPLIT-CRE-DATE      PIC   X(10).                        
022100     10 WS-ALLPLN-SPLIT-CRE-ID        PIC   X(8).                         
022200     10 WS-ALLPLN-SPLIT-UPD-DATE      PIC   X(10).                        
022300     10 WS-ALLPLN-SPLIT-UPD-ID        PIC   X(8).                         
022400     10 WS-ALLPLN-DISTRO-REQ-ID       PIC  S9(9) COMP.                    
022500     10 WS-ALLPLN-DISTRO-CRE-DATE     PIC   X(10).                        
022600     10 WS-ALLPLN-DISTRO-CRE-ID       PIC   X(8).                         
022700     10 WS-ALLPLN-DISTRO-KEY-SEQ-NBR  PIC  S9(9) COMP.                    
022800     10 WS-ALLPLN-SPLIT-KEY-SEQ-NBR   PIC  S9(9) COMP.                    
022900     10 WS-ALLPLN-ALOC-PACK-QTY       PIC  S9(5)V COMP-3.                 
023000     10 WS-ALLPLN-PK-SIZE-RND-CDE     PIC   X(1).                         
023100     10 WS-ALLPLN-ALLOC-OUTR-PK-QTY   PIC  S9(5)V COMP-3.                 
023200     10 WS-ALLPLN-SHTG-PRRT-OPT-CDE   PIC   X(1).                         
023300     10 WS-ALLPLN-OVRG-PRRT-OPT-CDE   PIC   X(1).                         
023400     10 WS-ALLPLN-EXST-SHTG-THRS-IND  PIC   X(1).                         
023500 01  WS-ALLPLN-KEYS.                                                      
023600     10 DS-ALLPLN-PO-NBR              PIC  S9(9) COMP.                    
023700     10 DS-ALLPLN-PO-LNE-NBR          PIC  S9(9) COMP.                    
023800     10 DS-ALLPLN-PLAN-NBR            PIC  S9(4) COMP.                    
023900*****************************************************************         
024000* COBOL DECLARATION FOR TABLE TPLNSHP                                     
024100*****************************************************************         
024200 01  WS-PLNSHP.                                                           
024300     10 WS-PLNSHP-SHIPT-NBR           PIC  S9(9) COMP.                    
024400     10 WS-PLNSHP-VER-NBR             PIC  S9(9) COMP.                    
024500     10 WS-PLNSHP-VER-STATUS-CDE      PIC   X(1).                         
024600     10 WS-PLNSHP-SHIPT-TYP-CDE       PIC   X(2).                         
024700     10 WS-PLNSHP-SHIPT-DEST-NBR      PIC  S9(4) COMP.                    
024800     10 WS-PLNSHP-SHIPT-POINT-TXT     PIC   X(20).                        
024900     10 WS-PLNSHP-FOB-POINT-TXT       PIC   X(20).                        
025000     10 WS-PLNSHP-FRGT-PAYT-CDE       PIC   X(1).                         
025100     10 WS-PLNSHP-VEND-FRGT-PCT       PIC  SV9(4) COMP-3.                 
025200     10 WS-PLNSHP-KOHLS-FRGT-PCT      PIC  SV9(4) COMP-3.                 
025300     10 WS-PLNSHP-LATE-SHIPT-IND      PIC   X(1).                         
025400     10 WS-PLNSHP-EARLY-SHIPT-IND     PIC   X(1).                         
025500     10 WS-PLNSHP-PARTIAL-SHIPT-IND   PIC   X(1).                         
025600     10 WS-PLNSHP-BCKORDS-PERMTD-IND  PIC   X(1).                         
025700     10 WS-PLNSHP-PORT-ENTR-DESC      PIC   X(20).                        
025800     10 WS-PLNSHP-STRT-FCTRY-DTE      PIC   X(10).                        
025900     10 WS-PLNSHP-LAST-FCTRY-DTE      PIC   X(10).                        
026000     10 WS-PLNSHP-DONT-SHIP-BEF-DTE   PIC   X(10).                        
026100     10 WS-PLNSHP-CAN-IFNOT-SHIP-DTE  PIC   X(10).                        
026200     10 WS-PLNSHP-EXT-CAN-DTE         PIC   X(10).                        
026300     10 WS-PLNSHP-LAST-UPD-TMST       PIC   X(26).                        
026400     10 WS-PLNSHP-STATUS-CDE          PIC   X(2).                         
026500     10 WS-PLNSHP-ENT-ID              PIC  S9(9) COMP.                    
026600     10 WS-PLNSHP-PO-NBR              PIC  S9(9) COMP.                    
026700     10 WS-PLNSHP-LAST-UPD-BY-UID     PIC   X(8).                         
026800     10 WS-PLNSHP-FOB-CDE             PIC   X(3).                         
026900     10 WS-PLNSHP-POE-CDE             PIC   X(3).                         
027000 01  WS-PLNSHP-KEYS.                                                      
027100     10 DS-PLNSHP-SHIPT-NBR           PIC  S9(9) COMP.                    
027200     10 DS-PLNSHP-VER-NBR             PIC  S9(9) COMP.                    
027300*****************************************************************         
027400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  27              
027500*****************************************************************         
027600*****************************************************************         
027700* COBOL DECLARATION FOR TABLE TSK                                         
027800*****************************************************************         
027900 01  WS-SK.                                                               
028000     10 WS-TSK-MERCH-DEPT-NMBR        PIC   X(3).                         
028100     10 WS-TSK-MERCH-CLASS-NMBR       PIC   X(2).                         
028200     10 WS-TSK-SEQ-NMBR               PIC   X(3).                         
028300     10 WS-TSK-CUM-SALES-UNIT-QTY     PIC  S9(7)V COMP-3.                 
028400     10 WS-TSK-RTL-UNIT-RCVD-QTY      PIC  S9(7)V COMP-3.                 
028500     10 WS-TSK-COST-UNIT-MSRMNT       PIC   X(4).                         
028600     10 WS-TSK-RTL-UNIT-MSRMNT        PIC   X(4).                         
028700     10 WS-TSK-UNIT-COST-AMT          PIC  S9(4)V9(3) COMP-3.             
028800     10 WS-TSK-CUR-UNIT-RTL-AMT       PIC  S9(5)V9(2) COMP-3.             
028900     10 WS-TSK-ORIG-UNIT-RTL-AMT      PIC  S9(5)V9(2) COMP-3.             
029000     10 WS-TSK-VNDR-INNR-PACK-QTY     PIC  S9(5)V COMP-3.                 
029100     10 WS-TSK-SHPMT-COUNT-QTY        PIC  S9(3)V COMP-3.                 
029200     10 WS-TSK-VENDOR-STYLE-CODE      PIC   X(15).                        
029300     10 WS-TSK-STAT-CHNGD-DATE        PIC  S9(7)V COMP-3.                 
029400     10 WS-TSK-STATUS-CODE            PIC  S9(3)V COMP-3.                 
029500     10 WS-TSK-AUTO-RORD-MTH-CODE     PIC   X(1).                         
029600     10 WS-TSK-RTL-CST-CVRSN-FCTR     PIC  S9(3)V COMP-3.                 
029700     10 WS-TSK-SETUP-DATE             PIC  S9(7)V COMP-3.                 
029800     10 WS-TSK-PRICE-CHNG-DATE        PIC  S9(7)V COMP-3.                 
029900     10 WS-TSK-GROUP-CODE             PIC   X(3).                         
030000     10 WS-TSK-SKU-DESC               PIC   X(25).                        
030100     10 WS-TSK-SIZE-DESC              PIC   X(5).                         
030200     10 WS-TSK-COLOR-DESC             PIC   X(4).                         
030300     10 WS-TSK-REORDER-FRMT-CODE      PIC   X(1).                         
030400     10 WS-TSK-MERCH-DIV-CODE         PIC  S9(1)V COMP-3.                 
030500     10 WS-TSK-DMM-NMBR               PIC  S9(3)V COMP-3.                 
030600     10 WS-TSK-BUYER-NMBR             PIC  S9(3)V COMP-3.                 
030700     10 WS-TSK-VENDOR-NMBR            PIC  S9(5)V COMP-3.                 
030800     10 WS-TSK-VNDR-IN-HSE-NMBR       PIC  S9(3)V COMP-3.                 
030900     10 WS-TSK-MKDN-PGM-CODE          PIC   X(1).                         
031000     10 WS-TSK-LOWST-UNIT-RTL-AMT     PIC  S9(5)V9(2) COMP-3.             
031100     10 WS-TSK-LOW-RTL-PRICE-DATE     PIC  S9(7)V COMP-3.                 
031200     10 WS-TSK-ITEM-NMBR              PIC  S9(15)V COMP-3.                
031300     10 WS-TSK-GP-RTL-AMT             PIC  S9(5)V9(2) COMP-3.             
031400     10 WS-TSK-ORIG-GP-QTY            PIC  S9(3)V COMP-3.                 
031500     10 WS-TSK-ORIG-GP-RTL-AMT        PIC  S9(5)V9(2) COMP-3.             
031600     10 WS-TSK-FS-RPT-IND             PIC   X(1).                         
031700     10 WS-TSK-GP-QTY                 PIC  S9(3)V COMP-3.                 
031800     10 WS-TSK-MULT-PR-PT-IND         PIC   X(1).                         
031900     10 WS-TSK-PLU-DWNLD-EXCL-IND     PIC   X(1).                         
032000     10 WS-TSK-LAST-PO-REV-DTE        PIC   X(10).                        
032100     10 WS-TSK-PO-REV-DAY-NBR         PIC  S9(3)V COMP-3.                 
032200     10 WS-TSK-PO-REV-SUN-WK-NBR      PIC  S9(1)V COMP-3.                 
032300     10 WS-TSK-PO-REV-MON-WK-NBR      PIC  S9(1)V COMP-3.                 
032400     10 WS-TSK-PO-REV-TUE-WK-NBR      PIC  S9(1)V COMP-3.                 
032500     10 WS-TSK-PO-REV-WED-WK-NBR      PIC  S9(1)V COMP-3.                 
032600     10 WS-TSK-PO-REV-THU-WK-NBR      PIC  S9(1)V COMP-3.                 
032700     10 WS-TSK-PO-REV-FRI-WK-NBR      PIC  S9(1)V COMP-3.                 
032800     10 WS-TSK-PO-REV-SAT-WK-NBR      PIC  S9(1)V COMP-3.                 
032900     10 WS-TSK-CENT-STK-CDE           PIC   X(2).                         
033000     10 WS-TSK-MEITGP-NBR             PIC  S9(9) COMP.                    
033100     10 WS-TSK-SKU-TYP-CDE            PIC   X(1).                         
033200     10 WS-TSK-VEND-OUTR-PACK-QTY     PIC  S9(5)V COMP-3.                 
033300     10 WS-TSK-LONG-VENDOR-STYLE      PIC   X(20).                        
033400     10 WS-TSK-SIZE-CDE               PIC   X(5).                         
033500     10 WS-TSK-LONG-SIZE-DESC         PIC   X(20).                        
033600     10 WS-TSK-COLOR-CDE              PIC   X(3).                         
033700     10 WS-TSK-LONG-COLOR-DESC        PIC   X(20).                        
033800     10 WS-TSK-STICKER-NBR            PIC   X(3).                         
033900     10 WS-TSK-ENT-ID                 PIC  S9(9) COMP.                    
034000     10 WS-TSK-TKT-FMT-ID             PIC   X(6).                         
034100     10 WS-TSK-KY-ITM-IND             PIC   X(1).                         
034200     10 WS-TSK-VS-CHARTC-CDE          PIC  S9(4) COMP.                    
034300     10 WS-TSK-VS-CHARTC-SEQ-NBR      PIC  S9(4) COMP.                    
034400     10 WS-TSK-UNT-COST-1ST-AMT       PIC  S9(7)V9(3) COMP-3.             
034500     10 WS-TSK-REGN-PRIC-IND          PIC   X(1).                         
034600 01  WS-SK-KEYS.                                                          
034700     10 DS-TSK-ITEM-NMBR              PIC  S9(15)V COMP-3.                
034800*****************************************************************         
034900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  66              
035000*****************************************************************         
035100*****************************************************************         
035200* COBOL DECLARATION FOR TABLE TUPCSKU                                     
035300*****************************************************************         
035400 01  WS-UPCSKU.                                                           
035500     10 WS-TUPCSKU-UPC-NBR            PIC  S9(15)V COMP-3.                
035600     10 WS-TUPCSKU-ITEM-NBR           PIC  S9(15)V COMP-3.                
035700     10 WS-TUPCSKU-EDI-ORD-IND        PIC   X(1).                         
035800     10 WS-TUPCSKU-PLU-DWNLD-IND      PIC   X(1).                         
035900     10 WS-TUPCSKU-XREF-CRE-DTE       PIC   X(10).                        
036000     10 WS-TUPCSKU-UPC-DESC           PIC   X(15).                        
036100     10 WS-TUPCSKU-CERT-IND           PIC   X(1).                         
036200     10 WS-TUPCSKU-CERT-DTE           PIC   X(10).                        
036300     10 WS-TUPCSKU-UPC-SRC-IND        PIC   X(1).                         
036400     10 WS-TUPCSKU-UMDCLN-IND         PIC   X(1).                         
036500 01  WS-UPCSKU-KEYS.                                                      
036600     10 DS-TUPCSKU-UPC-NBR            PIC  S9(15)V COMP-3.                
036700*****************************************************************         
036800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  10              
036900*****************************************************************         
037000*****************************************************************         
037100* COBOL DECLARATION FOR TABLE TUPCPLS                                     
037200*****************************************************************         
037300 01  WS-UPCPLS.                                                           
037400     10 WS-UPCPLS-UPC-ID              PIC  S9(9) COMP.                    
037500     10 WS-UPCPLS-OPERCO-NBR          PIC   X(2).                         
037600     10 WS-UPCPLS-STR-NBR             PIC  S9(4) COMP.                    
037700     10 WS-UPCPLS-EFF-BEG-TMST        PIC   X(26).                        
037800     10 WS-UPCPLS-EFF-END-TMST        PIC   X(26).                        
037900     10 WS-UPCPLS-EFF-END-TMST-NN     PIC  S9(4) COMP.                    
038000     10 WS-UPCPLS-UPC-STAT-CDE        PIC   X(2).                         
038100     10 WS-UPCPLS-UPC-STAT-CDE-NN     PIC  S9(4) COMP.                    
038200     10 WS-UPCPLS-UNT-COST-AMT        PIC  S9(7)V9(3) COMP-3.             
038300     10 WS-UPCPLS-UNT-COST-AMT-NN     PIC  S9(4) COMP.                    
038400     10 WS-UPCPLS-UNT-RTL-AMT         PIC  S9(7)V9(2) COMP-3.             
038500     10 WS-UPCPLS-UNT-RTL-AMT-NN      PIC  S9(4) COMP.                    
038600     10 WS-UPCPLS-MEITGP-NBR          PIC  S9(9) COMP.                    
038700     10 WS-UPCPLS-MEITGP-NBR-NN       PIC  S9(4) COMP.                    
038800     10 WS-UPCPLS-CRE-BY-USR-ID       PIC   X(8).                         
038900     10 WS-UPCPLS-CRE-TMST            PIC   X(26).                        
039000     10 WS-UPCPLS-ITM-NBR             PIC  S9(15)V COMP-3.                
039100     10 WS-UPCPLS-PLU-IND             PIC   X(1).                         
039200     10 WS-UPCPLS-UPC-STAT-CHG-DTE    PIC   X(10).                        
039300     10 WS-UPCPLS-UNT-RTL-CHG-DTE     PIC   X(10).                        
039400     10 WS-UPCPLS-ORIG-CLR-DTE        PIC   X(10).                        
039500     10 WS-UPCPLS-ORIG-CLR-DTE-NN     PIC  S9(4) COMP.                    
039600     10 WS-UPCPLS-MKDN-CDE            PIC   X(1).                         
039700     10 WS-UPCPLS-MKDN-CDE-NN         PIC  S9(4) COMP.                    
039800 01  WS-UPCPLS-KEYS.                                                      
039900     10 DS-UPCPLS-UPC-ID              PIC  S9(15)V COMP-3.                
040000     10 DS-UPCPLS-OPERCO-NBR          PIC   X(2).                         
040100     10 DS-UPCPLS-STR-NBR             PIC  S9(4) COMP.                    
040200     10 DS-UPCPLS-EFF-BEG-TMST        PIC   X(26).                        
040300*****************************************************************         
040400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  15              
040500*****************************************************************         
040600*****************************************************************         
040700* COBOL DECLARATION FOR TABLE TMDARVS                                     
040800*****************************************************************         
040900 01  WS-MDARVS.                                                           
041000     10 WS-MDARVS-SUB-CL-MDSEAR-ID    PIC  S9(6)V COMP-3.                 
041100     10 WS-MDARVS-VS-ID               PIC  S9(9) COMP.                    
041200     10 WS-MDARVS-ACTV-IND            PIC   X(1).                         
041300     10 WS-MDARVS-VS-DESC             PIC   X(30).                        
041400     10 WS-MDARVS-STKR-NBR            PIC  S9(4) COMP.                    
041500     10 WS-MDARVS-TKT-TYP-SEQ-NBR     PIC  S9(4) COMP.                    
041600     10 WS-MDARVS-LBL-SEQ-NBR         PIC  S9(4) COMP.                    
041700     10 WS-MDARVS-HNG-FOLD-SEQ-NBR    PIC  S9(4) COMP.                    
041800     10 WS-MDARVS-KY-CLSN-SEQ-NBR     PIC  S9(4) COMP.                    
041900     10 WS-MDARVS-FBRCN-SEQ-NBR       PIC  S9(4) COMP.                    
042000     10 WS-MDARVS-FNSH-SEQ-NBR        PIC  S9(4) COMP.                    
042100     10 WS-MDARVS-RMS-STYL-ID         PIC  S9(8)V COMP-3.                 
042200     10 WS-MDARVS-STYL-RECLS-IND      PIC   X(1).                         
042300     10 WS-MDARVS-RTL-CLSN-SEQ-NBR    PIC  S9(4) COMP.                    
042400     10 WS-MDARVS-DEPT-NBR            PIC  S9(4)V COMP-3.                 
042500     10 WS-MDARVS-MAJ-CL-NBR          PIC  S9(4)V COMP-3.                 
042600     10 WS-MDARVS-SUB-CL-NBR          PIC  S9(4)V COMP-3.                 
042700     10 WS-MDARVS-ESL-SEQ-NBR         PIC  S9(4) COMP.                    
042800     10 WS-MDARVS-RPT-HIER-SEQ-NBR    PIC  S9(4) COMP.                    
042900     10 WS-MDARVS-BDY-STYL-SEQ-NBR    PIC  S9(4) COMP.                    
043000     10 WS-MDARVS-CONST-SEQ-NBR       PIC  S9(4) COMP.                    
043100     10 WS-MDARVS-FUNC-SEQ-NBR        PIC  S9(4) COMP.                    
043200     10 WS-MDARVS-GNDR-SEQ-NBR        PIC  S9(4) COMP.                    
043300     10 WS-MDARVS-PATRN-SEQ-NBR       PIC  S9(4) COMP.                    
043400     10 WS-MDARVS-SLHTT-SEQ-NBR       PIC  S9(4) COMP.                    
043500     10 WS-MDARVS-CLLCTN-SEQ-NBR      PIC  S9(4) COMP.                    
043600     10 WS-MDARVS-MAP-UNT-RTL-AMT     PIC  S9(7)V9(2) COMP-3.             
043700     10 WS-MDARVS-C-O-ORGN-CDE        PIC   X(3).                         
043800     10 WS-MDARVS-PRIC-TIER-SEQ-NBR   PIC  S9(4) COMP.                    
043900     10 WS-MDARVS-LFSTYL-SEQ-NBR      PIC  S9(4) COMP.                    
044000     10 WS-MDARVS-CUST-INTFC-DESC     PIC   X(26).                        
           10 WS-MDARVS-FSHN-PYRMD-SEQ-NBR  PIC  S9(4) COMP.                    
           10 WS-MDARVS-PRFL-GP-NM-TXT      PIC   X(20).                        
           10 WS-MDARVS-CTG-SEQ-NBR         PIC  S9(4) COMP.                    
           10 WS-MDARVS-MAJ-CTG-SEQ-NBR     PIC  S9(4) COMP.                    
           10 WS-MDARVS-MTRL-SEQ-NBR        PIC  S9(4) COMP.                    
           10 WS-MDARVS-PRIM-TRND-SEQ-NBR   PIC  S9(4) COMP.                    
           10 WS-MDARVS-SEC-TRND-SEQ-NBR    PIC  S9(4) COMP.                    
           10 WS-MDARVS-ATTR-1-SEQ-NBR      PIC  S9(4) COMP.                    
           10 WS-MDARVS-ATTR-2-SEQ-NBR      PIC  S9(4) COMP.                    
           10 WS-MDARVS-NW-SLHTT-SEQ-NBR    PIC  S9(4) COMP.                    
044100 01  WS-MDARVS-KEYS.                                                      
044200     10 DS-MDARVS-SUB-CL-MDSEAR-ID    PIC  S9(6)V COMP-3.                 
044300     10 DS-MDARVS-VS-ID               PIC  S9(9) COMP.                    
044400*****************************************************************         
044500* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  13              
044600*****************************************************************         
044700*****************************************************************         
044800* COBOL DECLARATION FOR TABLE TSKXREF                                     
044900*****************************************************************         
045000 01  WS-SKXREF.                                                           
045100     10 WS-SKXREF-DEPT-NBR            PIC   X(3).                         
045200     10 WS-SKXREF-CL-NBR              PIC   X(2).                         
045300     10 WS-SKXREF-SKU-SEQ-NBR         PIC   X(3).                         
045400     10 WS-SKXREF-SKU-STAT-CDE        PIC   X(2).                         
045500     10 WS-SKXREF-ITM-NBR             PIC  S9(15)V COMP-3.                
045600     10 WS-SKXREF-INTR-UPC-ID         PIC  S9(9) COMP.                    
045700     10 WS-SKXREF-DEPT                PIC  S9(4)V COMP-3.                 
045800     10 WS-SKXREF-CLASS               PIC  S9(4)V COMP-3.                 
045900     10 WS-SKXREF-SUBCLASS            PIC  S9(4)V COMP-3.                 
046000     10 WS-SKXREF-SKU                 PIC  S9(8)V COMP-3.                 
046100 01  WS-SKXREF-KEYS.                                                      
046200     10 DS-SKXREF-ITM-NBR             PIC  S9(15)V COMP-3.                
046300*****************************************************************         
046400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  10              
046500*****************************************************************         
046600*****************************************************************         
046700* COBOL DECLARATION FOR TABLE TVNDSTL                                     
046800*****************************************************************         
046900 01  WS-VNDSTL.                                                           
047000     10 WS-VNDSTL-VS-ID               PIC  S9(9) COMP.                    
047100     10 WS-VNDSTL-ENT-ID              PIC  S9(9) COMP.                    
047200     10 WS-VNDSTL-VS-NBR              PIC   X(20).                        
047300     10 WS-VNDSTL-EFF-BEG-DTE         PIC   X(10).                        
047400     10 WS-VNDSTL-EFF-BEG-DTE-NN      PIC  S9(4) COMP.                    
047500     10 WS-VNDSTL-EFF-END-DTE         PIC   X(10).                        
047600     10 WS-VNDSTL-EFF-END-DTE-NN      PIC  S9(4) COMP.                    
047700     10 WS-VNDSTL-COST-UM-CDE         PIC   X(2).                         
047800     10 WS-VNDSTL-RTL-UM-CDE          PIC   X(2).                         
047900     10 WS-VNDSTL-MLT-PRIC-PT-IND     PIC   X(1).                         
048000     10 WS-VNDSTL-BYP-CAT-IND         PIC   X(1).                         
048100     10 WS-VNDSTL-SLHTT-SEQ-NBR       PIC  S9(4) COMP.                    
048200     10 WS-VNDSTL-CRE-BY-USR-ID       PIC   X(8).                         
048300     10 WS-VNDSTL-LAST-UPD-BY-USR-ID  PIC   X(8).                         
048400     10 WS-VNDSTL-LAST-UPD-TMST       PIC   X(26).                        
048500 01  WS-VNDSTL-KEYS.                                                      
048600     10 DS-VNDSTL-VS-ID               PIC  S9(9) COMP.                    
048700*****************************************************************         
048800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  13              
048900*****************************************************************         
049000*****************************************************************         
049100* COBOL DECLARATION FOR TABLE TVEHICL                                     
049200*****************************************************************         
049300 01  WS-VEHICL.                                                           
049400     10 WS-VEHICL-OWNER-SCAC-ID       PIC   X(4).                         
049500     10 WS-VEHICL-VEH-NBR             PIC   X(10).                        
049600     10 WS-VEHICL-CRT-SRC-CDE         PIC   X(2).                         
049700     10 WS-VEHICL-LAST-UPD-DTE        PIC   X(10).                        
049800     10 WS-VEHICL-LAST-UPD-TME        PIC   X(8).                         
049900     10 WS-VEHICL-LAST-UPD-UID        PIC   X(8).                         
050000     10 WS-VEHICL-USAGE-CDE           PIC   X(3).                         
050100     10 WS-VEHICL-VEH-TYP-CDE         PIC   X(2).                         
050200     10 WS-VEHICL-CURR-STATUS-CDE     PIC   X(2).                         
050300     10 WS-VEHICL-CURR-STATUS-DTE     PIC   X(10).                        
050400     10 WS-VEHICL-CURR-STATUS-TME     PIC   X(8).                         
050500     10 WS-VEHICL-CURR-OPER-UNT-ID    PIC  S9(4) COMP.                    
050600     10 WS-VEHICL-CURR-FCLTY-ID       PIC  S9(4) COMP.                    
050700     10 WS-VEHICL-CURR-FAC-AREA-ID    PIC   X(6).                         
050800     10 WS-VEHICL-CURR-LOC-DTE        PIC   X(10).                        
050900     10 WS-VEHICL-CURR-LOC-TME        PIC   X(8).                         
051000     10 WS-VEHICL-CURR-TRIP-ID        PIC  S9(9) COMP.                    
051100     10 WS-VEHICL-CURR-TRIP-ID-NN     PIC  S9(4) COMP.                    
051200     10 WS-VEHICL-VEH-SIZE-CDE        PIC   X(2).                         
051300 01  WS-VEHICL-KEYS.                                                      
051400     10 DS-VEHICL-OWNER-SCAC-ID       PIC   X(4).                         
051500     10 DS-VEHICL-VEH-NBR             PIC   X(10).                        
051600*****************************************************************         
051700* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  18              
051800*****************************************************************         
051900*****************************************************************         
052000* COBOL DECLARATION FOR TABLE TVHTRIP                                     
052100*****************************************************************         
052200 01  WS-VHTRIP.                                                           
052300     10 WS-VHTRIP-OWNER-SCAC-ID       PIC   X(4).                         
052400     10 WS-VHTRIP-VEH-NBR             PIC   X(10).                        
052500     10 WS-VHTRIP-VEH-NBR-NN          PIC  S9(4) COMP.                    
052600     10 WS-VHTRIP-TRIP-ID             PIC  S9(9) COMP.                    
052700     10 WS-VHTRIP-TRIP-BEG-DTE        PIC   X(10).                        
052800     10 WS-VHTRIP-TRIP-BEG-TME        PIC   X(8).                         
052900     10 WS-VHTRIP-CRT-SRC-CDE         PIC   X(2).                         
053000     10 WS-VHTRIP-LAST-UPD-DTE        PIC   X(10).                        
053100     10 WS-VHTRIP-LAST-UPD-TME        PIC   X(8).                         
053200     10 WS-VHTRIP-LAST-UPD-UID        PIC   X(8).                         
053300     10 WS-VHTRIP-MANIFEST-NBR        PIC   X(15).                        
053400     10 WS-VHTRIP-PLND-TRIP-SEQ       PIC  S9(4) COMP.                    
053500     10 WS-VHTRIP-PLND-ACTVY-CDE      PIC   X(1).                         
053600     10 WS-VHTRIP-OWNR-SCAC-SHIP-DTE  PIC   X(10).                        
053700     10 WS-VHTRIP-REF-TRIP-ID         PIC  S9(9) COMP.                    
053800     10 WS-VHTRIP-EST-AR-TMST         PIC   X(26).                        
053900     10 WS-VHTRIP-EST-AR-TMST-NN      PIC  S9(4) COMP.                    
054000     10 WS-VHTRIP-SPLT-XMIT-IND       PIC   X(1).                         
054100     10 WS-VHTRIP-SPLT-XMIT-DTE       PIC   X(10).                        
054200     10 WS-VHTRIP-SPLT-XMIT-TM        PIC   X(8).                         
054300 01  WS-VHTRIP-KEYS.                                                      
054400     10 DS-VHTRIP-TRIP-ID             PIC  S9(9) COMP.                    
054500*****************************************************************         
054600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  18              
054700*****************************************************************         
054800*****************************************************************         
054900* COBOL DECLARATION FOR TABLE TSHIPMT                                     
055000*****************************************************************         
055100 01  WS-SHIPMT.                                                           
055200     10 WS-SHIPMT-TRIP-ID             PIC  S9(9) COMP.                    
055300     10 WS-SHIPMT-TRIP-ID-NN          PIC  S9(4) COMP.                    
055400     10 WS-SHIPMT-SHIPT-ID            PIC  S9(9) COMP.                    
055500     10 WS-SHIPMT-CRT-SRC-CDE         PIC   X(2).                         
055600     10 WS-SHIPMT-LAST-UPD-DTE        PIC   X(10).                        
055700     10 WS-SHIPMT-LAST-UPD-TME        PIC   X(8).                         
055800     10 WS-SHIPMT-LAST-UPD-UID        PIC   X(8).                         
055900     10 WS-SHIPMT-PRO-SCAC-ID         PIC   X(4).                         
056000     10 WS-SHIPMT-PRO-NBR             PIC   X(22).                        
056100     10 WS-SHIPMT-BOL-NBR             PIC   X(30).                        
056200     10 WS-SHIPMT-SHIPPER-NME         PIC   X(20).                        
056300     10 WS-SHIPMT-SHIPT-TYP-CDE       PIC  S9(4) COMP.                    
056400     10 WS-SHIPMT-EXPTED-GRO-WGHT     PIC  S9(9) COMP.                    
056500     10 WS-SHIPMT-PKG-TYP-CDE         PIC   X(3).                         
056600     10 WS-SHIPMT-EXPTED-PKG-QTY      PIC  S9(9) COMP.                    
056700     10 WS-SHIPMT-FRGT-CHG-AMT        PIC  S9(5)V9(2) COMP-3.             
056800     10 WS-SHIPMT-FRGT-TERMS-CDE      PIC   X(1).                         
056900     10 WS-SHIPMT-EXPTED-PLT-QTY      PIC  S9(9) COMP.                    
057000     10 WS-SHIPMT-VEND-SHIP-DTE       PIC   X(10).                        
057100     10 WS-SHIPMT-EST-AR-TMST         PIC   X(26).                        
057200     10 WS-SHIPMT-EST-AR-TMST-NN      PIC  S9(4) COMP.                    
057300     10 WS-SHIPMT-ORIG-SCAC-ID        PIC   X(4).                         
057400     10 WS-SHIPMT-LAST-UPD-PGM-ID     PIC   X(8).                         
057500     10 WS-SHIPMT-CRE-USER-ID         PIC   X(8).                         
057600     10 WS-SHIPMT-CARR-CART-CT        PIC  S9(9) COMP.                    
057700     10 WS-SHIPMT-CARR-LAST-UPD-DTE   PIC   X(10).                        
057800     10 WS-SHIPMT-CARR-LAST-UPD-TIME  PIC   X(8).                         
057900     10 WS-SHIPMT-VEND-CART-CT        PIC  S9(9) COMP.                    
058000     10 WS-SHIPMT-VEND-LAST-UPD-DTE   PIC   X(10).                        
058100     10 WS-SHIPMT-VEND-LAST-UPD-TIME  PIC   X(8).                         
058200     10 WS-SHIPMT-VEH-NBR             PIC   X(10).                        
058300     10 WS-SHIPMT-AUTH-NBR            PIC   X(7).                         
058400     10 WS-SHIPMT-AUTH-DTE            PIC   X(10).                        
058500     10 WS-SHIPMT-CONFIRM-DTE         PIC   X(10).                        
058600     10 WS-SHIPMT-CONFIRM-TIME        PIC   X(8).                         
058700     10 WS-SHIPMT-COMPLETE-PRO-NBR    PIC   X(22).                        
058800     10 WS-SHIPMT-COMPLETE-BOL-NBR    PIC   X(30).                        
058900     10 WS-SHIPMT-PROCESSED-DTE       PIC   X(10).                        
059000     10 WS-SHIPMT-INVC-NBR            PIC   X(15).                        
059000     10 WS-SHIPMT-CARR-AUTH-ID        PIC   X(30).                        
059100 01  WS-SHIPMT-KEYS.                                                      
059200     10 DS-SHIPMT-SHIPT-ID            PIC  S9(9) COMP.                    
059300     10 DS-SHIPMT-TRIP-ID             PIC  S9(9) COMP.                    
059400     10 DS-SHIPMT-TRIP-ID-NN          PIC  S9(4) COMP.                    
059500*****************************************************************         
059600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  37              
059700*****************************************************************         
059800*****************************************************************         
059900* COBOL DECLARATION FOR TABLE TSHPTPO                                     
060000*****************************************************************         
060100 01  WS-SHPTPO.                                                           
060200     10 WS-SHPTPO-SHIPT-ID            PIC  S9(9) COMP.                    
060300     10 WS-SHPTPO-PO-NBR              PIC  S9(9) COMP.                    
060400*    10 WS-SHPTPO-DEPT-NBR            PIC   X(3).                         
060500     10 WS-SHPTPO-REC-SEQ-NBR         PIC  S9(9) COMP.                    
060600     10 WS-SHPTPO-EXPTED-CART-CNT     PIC  S9(4) COMP.                    
060700     10 WS-SHPTPO-ACTL-CART-CNT       PIC  S9(4) COMP.                    
060800     10 WS-SHPTPO-DMG-CART-CNT        PIC  S9(4) COMP.                    
060900     10 WS-SHPTPO-PKSL-IND            PIC   X(1).                         
061000     10 WS-SHPTPO-VEND-NAME           PIC   X(30).                        
061100     10 WS-SHPTPO-FRGT-CHG-AMT        PIC  S9(7)V9(2) COMP-3.             
061200     10 WS-SHPTPO-LAST-UPD-PGM-ID     PIC   X(8).                         
061300     10 WS-SHPTPO-CRE-USER-ID         PIC   X(8).                         
061400     10 WS-SHPTPO-CARR-CART-CT        PIC  S9(9) COMP.                    
061500     10 WS-SHPTPO-CARR-LAST-UPD-DTE   PIC   X(10).                        
061600     10 WS-SHPTPO-CARR-LAST-UPD-TIME  PIC   X(8).                         
061700     10 WS-SHPTPO-VEND-CART-CT        PIC  S9(9) COMP.                    
061800     10 WS-SHPTPO-VEND-LAST-UPD-DTE   PIC   X(10).                        
061900     10 WS-SHPTPO-VEND-LAST-UPD-TIME  PIC   X(8).                         
062000     10 WS-SHPTPO-CRE-TMST            PIC   X(26).                        
062100     10 WS-SHPTPO-LAST-UPD-DTE        PIC   X(10).                        
062200     10 WS-SHPTPO-LAST-UPD-TIME       PIC   X(8).                         
062300     10 WS-SHPTPO-LAST-UPD-USER-ID    PIC   X(8).                         
062400     10 WS-SHPTPO-PRIM-SHIPT-IND      PIC   X(1).                         
062500     10 WS-SHPTPO-SPLT-XMIT-IND       PIC   X(1).                         
062600     10 WS-SHPTPO-SPLT-XMIT-DTE       PIC   X(10).                        
062700     10 WS-SHPTPO-SPLT-XMIT-TM        PIC   X(8).                         
062800 01  WS-SHPTPO-KEYS.                                                      
062900     10 DS-SHPTPO-SHIPT-ID            PIC  S9(9) COMP.                    
063000     10 DS-SHPTPO-PO-NBR              PIC  S9(9) COMP.                    
063100     10 DS-SHPTPO-REC-SEQ-NBR         PIC  S9(9) COMP.                    
063200*****************************************************************         
063300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  26              
063400*****************************************************************         
063500*****************************************************************         
063600* COBOL DECLARATION FOR TABLE TPKSLIP                                     
063700*****************************************************************         
063800 01  WS-PKSLIP.                                                           
063900     10 WS-PKSLIP-PO-NBR              PIC  S9(9) COMP.                    
064000     10 WS-PKSLIP-SEQ-NBR             PIC  S9(4) COMP.                    
064100     10 WS-PKSLIP-CRE-TMST            PIC   X(26).                        
064200     10 WS-PKSLIP-VER-STAT-CDE        PIC   X(1).                         
064300     10 WS-PKSLIP-OPER-UNT-ID         PIC  S9(4) COMP.                    
064400     10 WS-PKSLIP-FCLTY-ID            PIC  S9(4) COMP.                    
064500     10 WS-PKSLIP-PKSL-NBR            PIC   X(10).                        
064600     10 WS-PKSLIP-STR-DEST-NBR        PIC  S9(4) COMP.                    
064700     10 WS-PKSLIP-REC-SEQ-NBR         PIC  S9(9) COMP.                    
064800     10 WS-PKSLIP-SHIPT-ID            PIC  S9(9) COMP.                    
064900     10 WS-PKSLIP-BOL-NBR             PIC   X(16).                        
065000     10 WS-PKSLIP-PRO-NBR             PIC   X(16).                        
065100     10 WS-PKSLIP-PKSL-STAT-CDE       PIC   X(2).                         
065200     10 WS-PKSLIP-CRE-UID             PIC   X(8).                         
065300     10 WS-PKSLIP-PO-VER-NBR          PIC  S9(9) COMP.                    
065400     10 WS-PKSLIP-CRE-SRC-CDE         PIC   X(4).                         
065500     10 WS-PKSLIP-EXPTED-PKG-QTY      PIC  S9(9) COMP.                    
065600     10 WS-PKSLIP-OWNER-SCAC-ID       PIC   X(4).                         
065700     10 WS-PKSLIP-ASN-NBR             PIC   X(30).                        
065800     10 WS-PKSLIP-VEND-SHIP-DTE       PIC   X(10).                        
065900     10 WS-PKSLIP-PKSL-PG-CNT         PIC  S9(4) COMP.                    
066000     10 WS-PKSLIP-CONTNR-ID           PIC   X(12).                        
066100     10 WS-PKSLIP-ORIG-PKSL-SEQ-NBR   PIC  S9(4) COMP.                    
066200 01  WS-PKSLIP-KEYS.                                                      
066300     10 DS-PKSLIP-PO-NBR              PIC  S9(9) COMP.                    
066400     10 DS-PKSLIP-SEQ-NBR             PIC  S9(4) COMP.                    
066500     10 DS-PKSLIP-CRE-TMST            PIC   X(26).                        
066600*****************************************************************         
066700* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  22              
066800*****************************************************************         
066900*****************************************************************         
067000* COBOL DECLARATION FOR TABLE TPKITEM                                     
067100*****************************************************************         
067200 01  WS-PKITEM.                                                           
067300     10 WS-PKITEM-PO-NBR              PIC  S9(9) COMP.                    
067400     10 WS-PKITEM-SEQ-NBR             PIC  S9(4) COMP.                    
067500     10 WS-PKITEM-PKSL-LNE-NBR        PIC  S9(9) COMP.                    
067600     10 WS-PKITEM-CRE-TMST            PIC   X(26).                        
067700     10 WS-PKITEM-VER-STAT-CDE        PIC   X(1).                         
067800     10 WS-PKITEM-PKSL-ITM-QTY        PIC  S9(9) COMP.                    
067900     10 WS-PKITEM-CRE-UID             PIC   X(8).                         
068000     10 WS-PKITEM-PURITM-VER-NBR      PIC  S9(9) COMP.                    
068100     10 WS-PKITEM-ORIG-PKSL-ITM-QTY   PIC  S9(9) COMP.                    
068200 01  WS-PKITEM-KEYS.                                                      
068300     10 DS-PKITEM-PO-NBR              PIC  S9(9) COMP.                    
068400     10 DS-PKITEM-SEQ-NBR             PIC  S9(4) COMP.                    
068500     10 DS-PKITEM-PKSL-LNE-NBR        PIC  S9(9) COMP.                    
068600     10 DS-PKITEM-CRE-TMST            PIC   X(26).                        
068700*****************************************************************         
068800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   8              
068900*****************************************************************         
069000*****************************************************************         
069100* COBOL DECLARATION FOR TABLE TSHIPST                                     
069200*****************************************************************         
069300 01  WS-SHIPST.                                                           
069400     10 WS-SHIPST-SHIPT-ID            PIC  S9(9) COMP.                    
069500     10 WS-SHIPST-SHIPT-STATUS-CDE    PIC   X(2).                         
069600     10 WS-SHIPST-STATUS-DTE          PIC   X(10).                        
069700     10 WS-SHIPST-STATUS-TME          PIC   X(8).                         
069800     10 WS-SHIPST-STATUS-UID          PIC   X(8).                         
069900     10 WS-SHIPST-DELAY-RSN-CDE       PIC   X(3).                         
070000     10 WS-SHIPST-CARR-STATUS-CDE     PIC   X(2).                         
070100     10 WS-SHIPST-TIME-ZONE-CDE       PIC   X(2).                         
070200     10 WS-SHIPST-CITY-NAME           PIC   X(19).                        
070300     10 WS-SHIPST-STATE-CDE           PIC   X(2).                         
070400 01  WS-SHIPST-KEYS.                                                      
070500     10 DS-SHIPST-SHIPT-ID            PIC  S9(9) COMP.                    
070600     10 DS-SHIPST-SHIPT-STATUS-CDE    PIC   X(2).                         
070700*****************************************************************         
070800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  10              
070900*****************************************************************         
071000*****************************************************************         
071100* COBOL DECLARATION FOR TABLE TTRIPST                                     
071200*****************************************************************         
071300 01  WS-TRIPST.                                                           
071400     10 WS-TRIPST-TRIP-ID             PIC  S9(9) COMP.                    
071500     10 WS-TRIPST-TRIP-STATUS-CDE     PIC   X(2).                         
071600     10 WS-TRIPST-STATUS-DTE          PIC   X(10).                        
071700     10 WS-TRIPST-STATUS-TME          PIC   X(8).                         
071800     10 WS-TRIPST-STATUS-UID          PIC   X(8).                         
071900     10 WS-TRIPST-OPER-UNT-ID         PIC  S9(4) COMP.                    
072000     10 WS-TRIPST-FCLTY-ID            PIC  S9(4) COMP.                    
072100     10 WS-TRIPST-FCLTY-AREA-ID       PIC   X(6).                         
072200 01  WS-TRIPST-KEYS.                                                      
072300     10 DS-TRIPST-TRIP-ID             PIC  S9(9) COMP.                    
072400     10 DS-TRIPST-TRIP-STATUS-CDE     PIC   X(2).                         
072500*****************************************************************         
072600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   8              
072700*****************************************************************         
072800*****************************************************************         
072900* COBOL DECLARATION FOR TABLE TRECEIV                                     
073000*****************************************************************         
073100 01  WS-RECEIV.                                                           
073200     10 WS-RECEIV-ORD-NBR             PIC  S9(9) COMP.                    
073300     10 WS-RECEIV-REC-SEQ-NBR         PIC  S9(9) COMP.                    
073400     10 WS-RECEIV-CRE-TMST            PIC   X(26).                        
073500     10 WS-RECEIV-CRE-UID             PIC   X(8).                         
073600     10 WS-RECEIV-PO-VER-NBR          PIC  S9(9) COMP.                    
073700     10 WS-RECEIV-OPER-UNT-ID         PIC  S9(4) COMP.                    
073800     10 WS-RECEIV-FCLTY-ID            PIC  S9(4) COMP.                    
073900     10 WS-RECEIV-STATUS-CDE          PIC   X(2).                         
074000     10 WS-RECEIV-SYST-CRE-CDE        PIC   X(1).                         
074100     10 WS-RECEIV-REC-TYP-CDE         PIC   X(2).                         
074200     10 WS-RECEIV-VER-STATUS-CDE      PIC   X(1).                         
074300     10 WS-RECEIV-PACK-BY-ST-IND      PIC   X(1).                         
074400     10 WS-RECEIV-REC-TMST            PIC   X(26).                        
074500     10 WS-RECEIV-EXPTED-CART-CNT     PIC  S9(4) COMP.                    
074600     10 WS-RECEIV-ACTL-CART-CNT       PIC  S9(4) COMP.                    
074700     10 WS-RECEIV-EXPTED-ITM-QTY      PIC  S9(9) COMP.                    
074800     10 WS-RECEIV-ACTL-ITM-QTY        PIC  S9(9) COMP.                    
074900     10 WS-RECEIV-RCVR-NBR            PIC  S9(9) COMP.                    
075000     10 WS-RECEIV-ML-POST-TMST        PIC   X(26).                        
075100     10 WS-RECEIV-FS-POST-TMST        PIC   X(26).                        
075200     10 WS-RECEIV-PRE-TKT-IND         PIC   X(1).                         
075300     10 WS-RECEIV-AD-INFO-DESC        PIC   X(4).                         
075400     10 WS-RECEIV-IN-TRBL-TMST        PIC   X(26).                        
075500     10 WS-RECEIV-IN-TRBL-MIN-CNT     PIC  S9(4) COMP.                    
075600     10 WS-RECEIV-IN-TRBL-HOUR-CNT    PIC  S9(4) COMP.                    
075700     10 WS-RECEIV-VERFYD-TMST         PIC   X(26).                        
075800     10 WS-RECEIV-RCVG-CLERK-INIT-ID  PIC   X(3).                         
075900     10 WS-RECEIV-REFER-BACK-SEQ-NBR  PIC  S9(9) COMP.                    
076000     10 WS-RECEIV-AP-PRC-CDE          PIC   X(1).                         
076100     10 WS-RECEIV-AP-PRC-DTE          PIC   X(10).                        
076200     10 WS-RECEIV-MIS-DIRECT-IND      PIC   X(1).                         
076300     10 WS-RECEIV-IMPRT-IND           PIC   X(1).                         
076400     10 WS-RECEIV-CRE-OPER-UNT-ID     PIC  S9(4) COMP.                    
076500     10 WS-RECEIV-CRE-FCLTY-ID        PIC  S9(4) COMP.                    
076600     10 WS-RECEIV-CURR-OPER-UNT-ID    PIC  S9(4) COMP.                    
076700     10 WS-RECEIV-CURR-FCLTY-ID       PIC  S9(4) COMP.                    
076800     10 WS-RECEIV-UPD-TMST            PIC   X(26).                        
076900     10 WS-RECEIV-UPD-UID             PIC   X(8).                         
077000     10 WS-RECEIV-UPD-PGM-ID          PIC   X(8).                         
077100     10 WS-RECEIV-APRON-LOC-DESC      PIC   X(8).                         
077200     10 WS-RECEIV-MKNG-APRN-PRT-TMST  PIC   X(26).                        
077300     10 WS-RECEIV-GOH-IND             PIC   X(1).                         
077400     10 WS-RECEIV-VRFD-USR-ID         PIC   X(8).                         
077500     10 WS-RECEIV-AP-RVRSL-IND        PIC   X(1).                         
077600     10 WS-RECEIV-AP-RVRSL-DTE        PIC   X(10).                        
077700     10 WS-RECEIV-PKGNG-CDE           PIC   X(1).                         
077800     10 WS-RECEIV-FRE-ASTRA-IND       PIC   X(1).                         
077900 01  WS-RECEIV-KEYS.                                                      
078000     10 DS-RECEIV-ORD-NBR             PIC  S9(9) COMP.                    
078100     10 DS-RECEIV-REC-SEQ-NBR         PIC  S9(9) COMP.                    
078200*****************************************************************         
078300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  45              
078400*****************************************************************         
078500*****************************************************************         
078600* COBOL DECLARATION FOR TABLE TRECITM                                     
078700*****************************************************************         
078800 01  WS-RECITM.                                                           
078900     10 WS-RECITM-ORD-NBR             PIC  S9(9) COMP.                    
079000     10 WS-RECITM-ORD-LNE-NBR         PIC  S9(9) COMP.                    
079100     10 WS-RECITM-REC-SEQ-NBR         PIC  S9(9) COMP.                    
079200     10 WS-RECITM-OPER-UNT-ID         PIC  S9(4) COMP.                    
079300     10 WS-RECITM-FCLTY-ID            PIC  S9(4) COMP.                    
079400     10 WS-RECITM-CRE-TMST            PIC   X(26).                        
079500     10 WS-RECITM-CRE-UID             PIC   X(8).                         
079600     10 WS-RECITM-PO-VER-NBR          PIC  S9(9) COMP.                    
079700     10 WS-RECITM-ITM-NBR             PIC  S9(15)V COMP-3.                
079800     10 WS-RECITM-PRE-TKT-IND         PIC   X(1).                         
079900     10 WS-RECITM-TKT-FMT-ID          PIC   X(6).                         
080000     10 WS-RECITM-RTV-IND             PIC   X(1).                         
080100     10 WS-RECITM-STATUS-CDE          PIC   X(2).                         
080200     10 WS-RECITM-VER-STATUS-CDE      PIC   X(1).                         
080300     10 WS-RECITM-PKSL-ITM-QTY        PIC  S9(9) COMP.                    
080400     10 WS-RECITM-DTL-CK-ITM-QTY      PIC  S9(9) COMP.                    
080500     10 WS-RECITM-INNR-PACK-QTY       PIC  S9(4) COMP.                    
080600     10 WS-RECITM-CASE-PACK-QTY       PIC  S9(4) COMP.                    
080700     10 WS-RECITM-RTV-QTY             PIC  S9(9) COMP.                    
080800     10 WS-RECITM-EXPTED-CART-CNT     PIC  S9(9) COMP.                    
080900     10 WS-RECITM-ACTL-CART-CNT       PIC  S9(9) COMP.                    
081000     10 WS-RECITM-MKING-APRON-TMST    PIC   X(26).                        
081100     10 WS-RECITM-UNT-COST-AMT        PIC  S9(4)V9(3) COMP-3.             
081200     10 WS-RECITM-COLOR-DESC          PIC   X(25).                        
081300     10 WS-RECITM-SIZE-DESC           PIC   X(25).                        
081400     10 WS-RECITM-VEND-STYL-NAME      PIC   X(20).                        
081500     10 WS-RECITM-VEND-DESC           PIC   X(25).                        
081600     10 WS-RECITM-VERFYD-TMST         PIC   X(26).                        
081700     10 WS-RECITM-PKSL-NBR            PIC   X(10).                        
081800     10 WS-RECITM-REC-INV-LNE-NBR     PIC  S9(3)V COMP-3.                 
081900     10 WS-RECITM-DMG-ITM-QTY         PIC  S9(9) COMP.                    
082000     10 WS-RECITM-UPD-TMST            PIC   X(26).                        
082100     10 WS-RECITM-UPD-UID             PIC   X(8).                         
082200     10 WS-RECITM-UPD-PGM-ID          PIC   X(8).                         
082300     10 WS-RECITM-RCPT-DISTR-UPD-CDE  PIC   X(1).                         
082400     10 WS-RECITM-VRFD-USR-ID         PIC   X(8).                         
082500     10 WS-RECITM-LAST-TRSCP-TMST     PIC   X(26).                        
082600     10 WS-RECITM-LAST-TRSCP-USR-ID   PIC   X(8).                         
082700     10 WS-RECITM-PREPK-ID            PIC  S9(4) COMP.                    
082800     10 WS-RECITM-PREPK-RATO-QTY      PIC  S9(4) COMP.                    
082900     10 WS-RECITM-PREPK-ODD-UNT-QTY   PIC  S9(4) COMP.                    
083000     10 WS-RECITM-PREPK-DRV-LNE-CDE   PIC   X(1).                         
083100     10 WS-RECITM-UNT-RTL-AMT         PIC S9(7)V9(2) COMP-3.              
083200     10 WS-RECITM-GP-RTL-AMT          PIC S9(7)V9(2) COMP-3.              
083300     10 WS-RECITM-GP-QTY              PIC S9(4) COMP.                     
083400     10 WS-RECITM-ORIG-PKSL-ITM-QTY   PIC S9(9) COMP.                     
083500 01  WS-RECITM-KEYS.                                                      
083600     10 DS-RECITM-ORD-NBR             PIC  S9(9) COMP.                    
083700     10 DS-RECITM-ORD-LNE-NBR         PIC  S9(9) COMP.                    
083800     10 DS-RECITM-REC-SEQ-NBR         PIC  S9(9) COMP.                    
083900     10 DS-RECITM-OPER-UNT-ID         PIC  S9(4) COMP.                    
084000     10 DS-RECITM-FCLTY-ID            PIC  S9(4) COMP.                    
084100*****************************************************************         
084200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  38              
084300*****************************************************************         
084400*****************************************************************         
084500* COBOL DECLARATION FOR TABLE TRECDIS                                     
084600*****************************************************************         
084700 01  WS-RECDIS.                                                           
084800     10 WS-RECDIS-ORD-NBR             PIC  S9(9) COMP.                    
084900     10 WS-RECDIS-ORD-LNE-NBR         PIC  S9(9) COMP.                    
085000     10 WS-RECDIS-REC-SEQ-NBR         PIC  S9(9) COMP.                    
085100     10 WS-RECDIS-OPER-UNT-ID         PIC  S9(4) COMP.                    
085200     10 WS-RECDIS-FCLTY-ID            PIC  S9(4) COMP.                    
085300     10 WS-RECDIS-CRE-TMST            PIC   X(26).                        
085400     10 WS-RECDIS-CRE-UID             PIC   X(8).                         
085500     10 WS-RECDIS-VER-STATUS-CDE      PIC   X(1).                         
085600     10 WS-RECDIS-EXPTED-ITM-QTY      PIC  S9(9) COMP.                    
085700     10 WS-RECDIS-VERIFY-ITM-QTY      PIC  S9(9) COMP.                    
085800     10 WS-RECDIS-AP-VERIFY-ITM-QTY   PIC  S9(9) COMP.                    
085900     10 WS-RECDIS-STR-NBR             PIC  S9(4) COMP.                    
086000     10 WS-RECDIS-STR-FCLTY-ID        PIC  S9(4) COMP.                    
086100     10 WS-RECDIS-PLAN-ITM-QTY        PIC  S9(4) COMP.                    
086200     10 WS-RECDIS-AP-PRC-CDE          PIC   X(1).                         
086300     10 WS-RECDIS-AP-PRC-DTE          PIC   X(10).                        
086400 01  WS-RECDIS-KEYS.                                                      
086500     10 DS-RECDIS-ORD-NBR             PIC  S9(9) COMP.                    
086600     10 DS-RECDIS-ORD-LNE-NBR         PIC  S9(9) COMP.                    
086700     10 DS-RECDIS-REC-SEQ-NBR         PIC  S9(9) COMP.                    
086800     10 DS-RECDIS-OPER-UNT-ID         PIC  S9(4) COMP.                    
086900     10 DS-RECDIS-FCLTY-ID            PIC  S9(4) COMP.                    
087000     10 DS-RECDIS-STR-NBR             PIC  S9(4) COMP.                    
087100     10 DS-RECDIS-STR-FCLTY-ID        PIC  S9(4) COMP.                    
087200*****************************************************************         
087300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  16              
087400*****************************************************************         
087500******************************************************************        
087600* COBOL DECLARATION FOR TABLE TSHUNLO                                     
087700******************************************************************        
087800 01  WS-SHUNLO.                                                           
087900     10 WS-SHUNLO-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.             
088000     10 WS-SHUNLO-OPER-UNT-ID            PIC  S9(4) COMP.                 
088100     10 WS-SHUNLO-FCLTY-ID               PIC  S9(4) COMP.                 
088200     10 WS-SHUNLO-SCN-LOC-ID             PIC   X(4).                      
088300     10 WS-SHUNLO-CRE-USR-ID             PIC   X(8).                      
088400     10 WS-SHUNLO-CRE-TMST               PIC   X(26).                     
088500     10 WS-SHUNLO-TRIP-ID                PIC  S9(9) COMP.                 
088600     10 WS-SHUNLO-PRTR-TYP-CDE           PIC   X(1).                      
088700     10 WS-SHUNLO-LBL-PRT-BTCH-ID        PIC  S9(4) COMP.                 
088800     10 WS-SHUNLO-ACTV-CDE               PIC   X(1).                      
088900 01  WS-SHUNLO-KEYS.                                                      
089000     10 DS-SHUNLO-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.             
089100******************************************************************        
089200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   9     *        
089300******************************************************************        
089400*****************************************************************         
089500* COBOL DECLARATION FOR TABLE TSHUUPC                                     
089600*****************************************************************         
089700 01  WS-SHUUPC.                                                           
089800     10 WS-SHUUPC-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.                
089900     10 WS-SHUUPC-TRN-NBR             PIC  S9(9) COMP.                    
090000     10 WS-SHUUPC-TRN-LNE-NBR         PIC  S9(9) COMP.                    
090100     10 WS-SHUUPC-TRN-TYP-CDE         PIC   X(2).                         
090200     10 WS-SHUUPC-UPC-NBR             PIC  S9(15)V COMP-3.                
090300     10 WS-SHUUPC-SHPD-QTY            PIC  S9(9)V COMP-3.                 
090400     10 WS-SHUUPC-RCVR-SEQ-NBR           PIC  S9(9) COMP.                 
090500 01  WS-SHUUPC-KEYS.                                                      
090600     10 DS-SHUUPC-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.                
090700     10 DS-SHUUPC-TRN-NBR             PIC  S9(9) COMP.                    
090800     10 DS-SHUUPC-TRN-LNE-NBR         PIC  S9(9) COMP.                    
090900     10 DS-SHUUPC-TRN-TYP-CDE         PIC   X(2).                         
091000     10 DS-SHUUPC-UPC-NBR             PIC  S9(15)V COMP-3.                
091100*****************************************************************         
091200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   6              
091300*****************************************************************         
091400*****************************************************************         
091500* COBOL DECLARATION FOR TABLE TSHPUNT                                     
091600*****************************************************************         
091700 01  WS-SHPUNT.                                                           
091800     10 WS-SHPUNT-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.                
091900     10 WS-SHPUNT-ORGN-OPER-UNT-ID    PIC  S9(4) COMP.                    
092000     10 WS-SHPUNT-ORGN-FCLTY-ID       PIC  S9(4) COMP.                    
092100     10 WS-SHPUNT-DEST-OPER-UNT-ID    PIC  S9(4) COMP.                    
092200     10 WS-SHPUNT-DEST-FCLTY-ID       PIC  S9(4) COMP.                    
092300     10 WS-SHPUNT-SHIPT-UNT-SRC-ID    PIC   X(3).                         
092400     10 WS-SHPUNT-HIER-LVL-CDE        PIC   X(1).                         
092500     10 WS-SHPUNT-NEXT-SHIPT-UNT-ID   PIC  S9(18)V COMP-3.                
092600     10 WS-SHPUNT-ORIG-SHIPT-UNT-ID   PIC  S9(18)V COMP-3.                
092700     10 WS-SHPUNT-ACTV-IND            PIC   X(1).                         
092800     10 WS-SHPUNT-CRE-DTE             PIC   X(10).                        
092900     10 WS-SHPUNT-CRE-TM              PIC   X(8).                         
093000     10 WS-SHPUNT-CRE-USR-ID          PIC   X(8).                         
093100     10 WS-SHPUNT-CRE-PGM-NM          PIC   X(8).                         
093200 01  WS-SHPUNT-KEYS.                                                      
093300     10 DS-SHPUNT-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.                
093400*****************************************************************         
093500* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  14              
093600*****************************************************************         
093700*****************************************************************         
093800* COBOL DECLARATION FOR TABLE TINPKSU                                     
093900*****************************************************************         
094000 01  WS-INPKSU.                                                           
094100     10 WS-INPKSU-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.                
094200     10 WS-INPKSU-PO-NBR              PIC  S9(9) COMP.                    
094300     10 WS-INPKSU-SEQ-NBR             PIC  S9(4) COMP.                    
094400     10 WS-INPKSU-PKSL-SEQ-NBR        PIC  S9(4) COMP.                    
094500 01  WS-INPKSU-KEYS.                                                      
094600     10 DS-INPKSU-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.                
094700*****************************************************************         
094800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   3              
094900*****************************************************************         
095000*****************************************************************         
095100* COBOL DECLARATION FOR TABLE TIMCNTK       49 COLUMNS                    
095200*****************************************************************         
095300 01  WS-IMCNTK.                                                           
095400     10 WS-IMCNTK-CONTNR-ID           PIC   X(12).                        
095500     10 WS-IMCNTK-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
095600     10 WS-IMCNTK-CONSLR-SCAC-ID      PIC   X(4).                         
095700     10 WS-IMCNTK-MOM-IMPRT-TRIP-ID   PIC   X(10).                        
095800     10 WS-IMCNTK-MOM-DPRTR-TMST      PIC   X(26).                        
095900     10 WS-IMCNTK-MOM-POE-DELY-TMST   PIC   X(26).                        
096000     10 WS-IMCNTK-MOM-CARR-SCAC-ID    PIC   X(4).                         
096100     10 WS-IMCNTK-MOM-FOB-CDE         PIC   X(5).                         
096200     10 WS-IMCNTK-MOM-IMPRT-VEH-NM    PIC   X(25).                        
096300     10 WS-IMCNTK-MOM-TRIP-TYP-CDE    PIC   X(1).                         
096400     10 WS-IMCNTK-MOM-DEST-POE-CDE    PIC   X(4).                         
096500     10 WS-IMCNTK-FDR-IMPRT-TRIP-ID   PIC   X(10).                        
096600     10 WS-IMCNTK-FDR-DPRTR-TMST      PIC   X(26).                        
096700     10 WS-IMCNTK-FDR-POE-DELY-TMST   PIC   X(26).                        
096800     10 WS-IMCNTK-FDR-CARR-SCAC-ID    PIC   X(4).                         
096900     10 WS-IMCNTK-FDR-FOB-CDE         PIC   X(5).                         
097000     10 WS-IMCNTK-FDR-IMPRT-VEH-NM    PIC   X(25).                        
097100     10 WS-IMCNTK-FDR-TRIP-TYP-CDE    PIC   X(1).                         
097200     10 WS-IMCNTK-FDR-DEST-POE-CDE    PIC   X(4).                         
097300     10 WS-IMCNTK-SIZE-CDE            PIC   X(5).                         
097400     10 WS-IMCNTK-CART-CNT            PIC  S9(9) COMP.                    
097500     10 WS-IMCNTK-CBMT-QTY            PIC  S9(9)V9(2) COMP-3.             
097600     10 WS-IMCNTK-WT-KGRM-QTY         PIC  S9(9) COMP.                    
097700     10 WS-IMCNTK-UNT-QTY             PIC  S9(9) COMP.                    
097800     10 WS-IMCNTK-ORGN-SHPD-FR-CDE    PIC   X(3).                         
097900     10 WS-IMCNTK-ORGN-SHPD-TO-CDE    PIC   X(3).                         
098000     10 WS-IMCNTK-EST-LBD-NM          PIC   X(30).                        
098100     10 WS-IMCNTK-EST-LBD-TMST        PIC   X(26).                        
098200     10 WS-IMCNTK-RISU-DO-RSN-CDE     PIC   X(3).                         
098300     10 WS-IMCNTK-BKR-FRGT-RLSE-TMST  PIC   X(26).                        
098400     10 WS-IMCNTK-DO-TO-DCONSLR-TMST  PIC   X(26).                        
098500     10 WS-IMCNTK-DO-RCVD-TMST        PIC   X(26).                        
098600     10 WS-IMCNTK-CONTNR-PU-TMST      PIC   X(26).                        
098700     10 WS-IMCNTK-DAT-SRC-ENT-ID      PIC  S9(9) COMP.                    
098800     10 WS-IMCNTK-CRE-BY-USR-ID       PIC   X(8).                         
098900     10 WS-IMCNTK-CRE-TMST            PIC   X(26).                        
099000     10 WS-IMCNTK-LAST-UPD-BY-USR-ID  PIC   X(8).                         
099100     10 WS-IMCNTK-LAST-UPD-TMST       PIC   X(26).                        
099200     10 WS-IMCNTK-ACTL-POE-DELY-TMST  PIC   X(26).                        
099300     10 WS-IMCNTK-ACTL-DEST-POE-CDE   PIC   X(4).                         
099400     10 WS-IMCNTK-ACTL-LBD-NM         PIC   X(30).                        
099500     10 WS-IMCNTK-ACTL-LBD-TMST       PIC   X(26).                        
099600     10 WS-02-IMCNTK-DVN-TMST         PIC   X(26).                        
099700     10 WS-02-IMCNTK-DCONSLR-SCAC-ID  PIC   X(4).                         
099800     10 WS-IMCNTK-DCONSLR-RET-TMST    PIC   X(26).                        
099900     10 WS-IMCNTK-MOM-POL-CDE         PIC   X(05).                        
100000     10 WS-IMCNTK-FDR-POL-CDE         PIC   X(05).                        
100100     10 WS-IMCNTK-MOM-POR-CDE         PIC   X(05).                        
100200     10 WS-IMCNTK-FDR-POR-CDE         PIC   X(05).                        
100200     10 WS-IMCNTK-DCONSLR-DELY-TMST   PIC   X(26).                        
100300 01  WS-IMCNTK-KEYS.                                                      
100400     10 DS-IMCNTK-CONTNR-ID           PIC   X(12).                        
100500     10 DS-IMCNTK-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
100600*****************************************************************         
100700* COBOL DECLARATION FOR TABLE TIMCNPO       19 COLUMNS                    
100800*****************************************************************         
100900 01  WS-IMCNPO.                                                           
101000     10 WS-IMCNPO-CONTNR-ID           PIC   X(12).                        
101100     10 WS-IMCNPO-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
101200     10 WS-IMCNPO-PO-NBR              PIC  S9(9) COMP.                    
101300     10 WS-IMCNPO-CSTM-ENTR-ID        PIC   X(12).                        
101400     10 WS-IMCNPO-MSTR-BOL-NBR        PIC   X(30).                        
101500     10 WS-IMCNPO-HSE-BOL-NBR         PIC   X(30).                        
101600     10 WS-IMCNPO-LTR-OF-CR-NBR       PIC   X(15).                        
101700     10 WS-IMCNPO-PO-RCVD-DELY-TMST   PIC   X(26).                        
101800     10 WS-IMCNPO-PO-C-O-PROD-CDE     PIC   X(3).                         
101900     10 WS-IMCNPO-PO-CART-CNT         PIC  S9(4) COMP.                    
102000     10 WS-IMCNPO-PO-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.             
102100     10 WS-IMCNPO-PO-WT-KGRM-QTY      PIC  S9(9) COMP.                    
102200     10 WS-IMCNPO-PO-UNT-QTY          PIC  S9(9) COMP.                    
102300     10 WS-IMCNPO-CRE-BY-USR-ID       PIC   X(8).                         
102400     10 WS-IMCNPO-CRE-TMST            PIC   X(26).                        
102500     10 WS-IMCNPO-LAST-UPD-BY-USR-ID  PIC   X(8).                         
102600     10 WS-IMCNPO-LAST-UPD-TMST       PIC   X(26).                        
102700     10 WS-IMCNPO-EXTL-REF-NBR        PIC   X(15).                        
102800     10 WS-IMCNPO-BKR-FRGT-RLSE-CDE   PIC   X(1).                         
102900     10 WS-IMCNPO-DO-RCVD-CDE         PIC   X(1).                         
103000     10 WS-IMCNPO-CONTNR-PU-CDE       PIC   X(1).                         
103100     10 WS-IMCNPO-ACTL-POE-DELY-CDE   PIC   X(1).                         
103200     10 WS-IMCNPO-DVN-CDE             PIC   X(1).                         
103300     10 WS-IMCNPO-DCONSLR-RET-CDE     PIC   X(1).                         
103400     10 WS-IMCNPO-SPLT-XMIT-CDE       PIC   X(1).                         
103500     10 WS-IMCNPO-DOC-RCVD-ORGN-TMST  PIC   X(26).                        
103500     10 WS-IMCNPO-DCONSLR-DELY-CDE    PIC   X(1).                         
103600 01  WS-IMCNPO-KEYS.                                                      
103700     10 DS-IMCNPO-CONTNR-ID           PIC   X(12).                        
103800     10 DS-IMCNPO-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
103900     10 DS-IMCNPO-PO-NBR              PIC  S9(9) COMP.                    
104000*****************************************************************         
104100* COBOL DECLARATION FOR TABLE TIMCNUP       18 COLUMNS                    
104200*****************************************************************         
104300 01  WS-IMCNUP.                                                           
104400     10 WS-IMCNUP-CONTNR-ID           PIC   X(12).                        
104500     10 WS-IMCNUP-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
104600     10 WS-IMCNUP-PO-NBR              PIC  S9(9) COMP.                    
104700     10 WS-IMCNUP-VS-NBR              PIC   X(30).                        
104800     10 WS-IMCNUP-UPC-NBR             PIC  S9(15)V COMP-3.                
104900     10 WS-IMCNUP-PO-LNE-NBR          PIC  S9(9) COMP.                    
105000     10 WS-IMCNUP-UPC-CART-CNT        PIC  S9(9) COMP.                    
105100     10 WS-IMCNUP-UPC-CBMT-QTY        PIC  S9(7)V9(2) COMP-3.             
105200     10 WS-IMCNUP-UPC-WT-KGRM-QTY     PIC  S9(9) COMP.                    
105300     10 WS-IMCNUP-UPC-UNT-QTY         PIC  S9(9) COMP.                    
105400     10 WS-IMCNUP-CRE-BY-USR-ID       PIC   X(8).                         
105500     10 WS-IMCNUP-CRE-TMST            PIC   X(26).                        
105600     10 WS-IMCNUP-LAST-UPD-BY-USR-ID  PIC   X(8).                         
105700     10 WS-IMCNUP-LAST-UPD-TMST       PIC   X(26).                        
105800     10 WS-IMCNUP-SKU-NBR             PIC  S9(8)V COMP-3.                 
105900     10 WS-IMCNUP-ASN-PKGNG-CDE       PIC   X(2).                         
106000 01  WS-IMCNUP-KEYS.                                                      
106100     10 DS-IMCNUP-CONTNR-ID           PIC   X(12).                        
106200     10 DS-IMCNUP-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
106300     10 DS-IMCNUP-PO-NBR              PIC  S9(9) COMP.                    
106400*    10 DS-IMCNUP-VS-NBR              PIC   X(30).                        
106500     10 DS-IMCNUP-UPC-NBR             PIC  S9(15)V COMP-3.                
106600     10 DS-IMCNUP-PO-LNE-NBR          PIC  S9(9) COMP.                    
106700*****************************************************************         
106800* COBOL DECLARATION FOR TABLE TRT_IMPRT_CART     10 COLUMNS               
106900*****************************************************************         
107000 01  WS-TRT00008.                                                         
107100     10 WS-TRT00008-CONTNR-ID         PIC   X(12).                        
107200     10 WS-TRT00008-CONTNR-SEQ-NBR    PIC  S9(4) COMP.                    
107300     10 WS-TRT00008-PO-NBR            PIC  S9(9) COMP.                    
107400     10 WS-TRT00008-UPC-NBR           PIC  S9(15)V COMP-3.                
107500     10 WS-TRT00008-SSCC-ID           PIC   X(48).                        
107600     10 WS-TRT00008-CRE-BY-USR-ID     PIC   X(8).                         
107700     10 WS-TRT00008-CRE-TMST          PIC   X(26).                        
107800     10 WS-TRT00008-UNT-QTY           PIC  S9(9) COMP.                    
107900     10 WS-TRT00008-LAST-UPD-BY-USR-ID  PIC   X(8).                       
108000     10 WS-TRT00008-LAST-UPD-TMST     PIC   X(26).                        
108100 01  WS-TRT00008-KEYS.                                                    
108200     10 DS-TRT00008-CONTNR-ID         PIC   X(12).                        
108300     10 DS-TRT00008-CONTNR-SEQ-NBR    PIC  S9(4) COMP.                    
108400     10 DS-TRT00008-PO-NBR            PIC  S9(9) COMP.                    
108500     10 DS-TRT00008-UPC-NBR           PIC  S9(15)V COMP-3.                
108600     10 DS-TRT00008-SSCC-ID           PIC   X(48).                        
108700*****************************************************************         
108800* COBOL DECLARATION FOR TABLE TRT_AUD_IMPRT_CART     10 COLUMNS           
108900*****************************************************************         
109000 01  WS-TRT00009.                                                         
109100     10 WS-TRT00009-CONTNR-ID         PIC   X(12).                        
109200     10 WS-TRT00009-CONTNR-SEQ-NBR    PIC  S9(4) COMP.                    
109300     10 WS-TRT00009-PO-NBR            PIC  S9(9) COMP.                    
109400     10 WS-TRT00009-UPC-NBR           PIC  S9(15)V COMP-3.                
109500     10 WS-TRT00009-SSCC-ID           PIC   X(48).                        
109600     10 WS-TRT00009-UNT-QTY           PIC  S9(9) COMP.                    
109700     10 WS-TRT00009-LAST-UPD-BY-USR-ID  PIC   X(8).                       
109800     10 WS-TRT00009-LAST-UPD-TMST     PIC   X(26).                        
109900     10 WS-TRT00009-AUD-FUNC-CDE      PIC   X(1).                         
110000     10 WS-TRT00009-AUD-TMST          PIC   X(26).                        
110100 01  WS-TRT00009-KEYS.                                                    
110200     10 DS-TRT00009-CONTNR-ID         PIC   X(12).                        
110300     10 DS-TRT00009-CONTNR-SEQ-NBR    PIC  S9(4) COMP.                    
110400     10 DS-TRT00009-PO-NBR            PIC  S9(9) COMP.                    
110500     10 DS-TRT00009-UPC-NBR           PIC  S9(15)V COMP-3.                
110600     10 DS-TRT00009-SSCC-ID           PIC   X(48).                        
110700     10 DS-TRT00009-AUD-TMST          PIC   X(26).                        
110800*****************************************************************         
110900* COBOL DECLARATION FOR TABLE TRT_IMPRT_SEAL     7 COLUMNS                
111000*****************************************************************         
111100 01  WS-TRT00006.                                                         
111200     10 WS-TRT00006-CONTNR-ID         PIC   X(12).                        
111300     10 WS-TRT00006-CONTNR-SEQ-NBR    PIC  S9(4) COMP.                    
111400     10 WS-TRT00006-SEAL-NBR          PIC   X(15).                        
111500     10 WS-TRT00006-CRE-TMST          PIC   X(26).                        
111600     10 WS-TRT00006-CRE-BY-USR-ID     PIC   X(8).                         
111700     10 WS-TRT00006-LAST-UPD-TMST     PIC   X(26).                        
111800     10 WS-TRT00006-LAST-UPD-BY-USR-ID  PIC   X(8).                       
111900 01  WS-TRT00006-KEYS.                                                    
112000     10 DS-TRT00006-CONTNR-ID         PIC   X(12).                        
112100     10 DS-TRT00006-CONTNR-SEQ-NBR    PIC  S9(4) COMP.                    
112200     10 DS-TRT00006-SEAL-NBR          PIC   X(15).                        
112300*****************************************************************         
112400* COBOL DECLARATION FOR TABLE TRT_AUD_IMPRT_SEAL   7 COLUMNS              
112500*****************************************************************         
112600 01  WS-TRT00007.                                                         
112700     10 WS-TRT00007-CONTNR-ID         PIC   X(12).                        
112800     10 WS-TRT00007-CONTNR-SEQ-NBR    PIC  S9(4) COMP.                    
112900     10 WS-TRT00007-SEAL-NBR          PIC   X(15).                        
113000     10 WS-TRT00007-LAST-UPD-TMST     PIC   X(26).                        
113100     10 WS-TRT00007-LAST-UPD-BY-USR-ID PIC   X(8).                        
113200     10 WS-TRT00007-AUD-FUNC-CDE      PIC   X(1).                         
113300     10 WS-TRT00007-AUD-TMST          PIC   X(26).                        
113400 01  WS-TRT00007-KEYS.                                                    
113500     10 DS-TRT00007-CONTNR-ID         PIC   X(12).                        
113600     10 DS-TRT00007-CONTNR-SEQ-NBR    PIC  S9(4) COMP.                    
113700     10 DS-TRT00007-SEAL-NBR          PIC   X(15).                        
113800     10 DS-TRT00007-AUD-TMST          PIC   X(26).                        
113900*****************************************************************         
114000* COBOL DECLARATION FOR TABLE TIMBKPO       33 COLUMNS                    
114100*****************************************************************         
114200 01  WS-IMBKPO.                                                           
114300     10 WS-IMBKPO-PO-NBR              PIC  S9(9) COMP.                    
114400     10 WS-IMBKPO-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.                    
114500     10 WS-IMBKPO-PO-BKG-DELY-TMST    PIC   X(26).                        
114600     10 WS-IMBKPO-EXTL-REF-NBR        PIC   X(15).                        
114700     10 WS-IMBKPO-ORGN-SHPD-FR-CDE    PIC   X(3).                         
114800     10 WS-IMBKPO-CONSLR-SCAC-ID      PIC   X(4).                         
114900     10 WS-IMBKPO-IMPRT-TRIP-ID       PIC   X(10).                        
115000     10 WS-IMBKPO-DPRTR-TMST          PIC   X(26).                        
115100     10 WS-IMBKPO-POE-DELY-TMST       PIC   X(26).                        
115200     10 WS-IMBKPO-CARR-SCAC-ID        PIC   X(4).                         
115300     10 WS-IMBKPO-FOB-CDE             PIC   X(5).                         
115400     10 WS-IMBKPO-IMPRT-VEH-NM        PIC   X(25).                        
115500     10 WS-IMBKPO-TRIP-TYP-CDE        PIC   X(1).                         
115600     10 WS-IMBKPO-DEST-POE-CDE        PIC   X(4).                         
115700     10 WS-IMBKPO-C-O-PROD-CDE        PIC   X(3).                         
115800     10 WS-IMBKPO-PROD-FCTRY-NM       PIC   X(35).                        
115900     10 WS-IMBKPO-PO-CART-CNT         PIC  S9(9) COMP.                    
116000     10 WS-IMBKPO-PO-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.             
116100     10 WS-IMBKPO-PO-WT-KGRM-QTY      PIC  S9(9) COMP.                    
116200     10 WS-IMBKPO-PO-UNT-QTY          PIC  S9(9) COMP.                    
116300     10 WS-IMBKPO-PO-EXC-APVL-CDE     PIC   X(2).                         
116400     10 WS-IMBKPO-PO-EXC-APVL-USR-ID  PIC   X(8).                         
116500     10 WS-IMBKPO-PO-EXC-APVL-TMST    PIC   X(26).                        
116600     10 WS-IMBKPO-PO-EXC-RSN-DESC     PIC   X(30).                        
116700     10 WS-IMBKPO-EST-LBD-NM          PIC   X(30).                        
116800     10 WS-IMBKPO-EST-LBD-TMST        PIC   X(26).                        
116900     10 WS-IMBKPO-SHIPT-BKG-TMST      PIC   X(26).                        
117000     10 WS-IMBKPO-VOY-CHG-RSN-DESC    PIC   X(30).                        
117100     10 WS-IMBKPO-DAT-SRC-ENT-ID      PIC  S9(9) COMP.                    
117200     10 WS-IMBKPO-CRE-BY-USR-ID       PIC   X(8).                         
117300     10 WS-IMBKPO-CRE-TMST            PIC   X(26).                        
117400     10 WS-IMBKPO-LAST-UPD-BY-USR-ID  PIC   X(8).                         
117500     10 WS-IMBKPO-LAST-UPD-TMST       PIC   X(26).                        
117600 01  WS-IMBKPO-KEYS.                                                      
117700     10 DS-IMBKPO-PO-NBR              PIC  S9(9) COMP.                    
117800     10 DS-IMBKPO-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.                    
117900*****************************************************************         
118000* COBOL DECLARATION FOR TABLE TIMBKVS       13 COLUMNS                    
118100*****************************************************************         
118200*01  WS-IMBKVS.                                                           
118300*    10 WS-IMBKVS-PO-NBR              PIC  S9(9) COMP.                    
118400*    10 WS-IMBKVS-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.                    
118500*    10 WS-IMBKVS-VS-NBR              PIC   X(20).                        
118600*    10 WS-IMBKVS-HTS-ID              PIC   X(13).                        
118700*    10 WS-IMBKVS-VS-CART-CNT         PIC  S9(9) COMP.                    
118800*    10 WS-IMBKVS-VS-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.             
118900*    10 WS-IMBKVS-VS-WT-KGRM-QTY      PIC  S9(9) COMP.                    
119000*    10 WS-IMBKVS-VS-UNT-QTY          PIC  S9(9) COMP.                    
119100*    10 WS-IMBKVS-QTA-CTG-IND         PIC   X(1).                         
119200*    10 WS-IMBKVS-CRE-BY-USR-ID       PIC   X(8).                         
119300*    10 WS-IMBKVS-CRE-TMST            PIC   X(26).                        
119400*    10 WS-IMBKVS-LAST-UPD-BY-USR-ID  PIC   X(8).                         
119500*    10 WS-IMBKVS-LAST-UPD-TMST       PIC   X(26).                        
119600*01  WS-IMBKVS-KEYS.                                                      
119700*    10 DS-IMBKVS-PO-NBR              PIC  S9(9) COMP.                    
119800*    10 DS-IMBKVS-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.                    
119900*    10 DS-IMBKVS-VS-NBR              PIC   X(20).                        
120000*****************************************************************         
120100* COBOL DECLARATION FOR TABLE TIMBKUP      12 COLUMNS           *         
120200*****************************************************************         
120300*01  WS-IMBKUP.                                                           
120400*    10 WS-IMBKUP-PO-NBR              PIC  S9(9) COMP.                    
120500*    10 WS-IMBKUP-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.                    
120600*    10 WS-IMBKUP-VS-NBR              PIC   X(20).                        
120700*    10 WS-IMBKUP-UPC-NBR             PIC  S9(15)V COMP-3.                
120800*    10 WS-IMBKUP-UPC-CART-CNT        PIC  S9(9) COMP.                    
120900*    10 WS-IMBKUP-UPC-CBMT-QTY        PIC  S9(7)V9(2) COMP-3.             
121000*    10 WS-IMBKUP-UPC-WT-KGRM-QTY     PIC  S9(9) COMP.                    
121100*    10 WS-IMBKUP-UPC-UNT-QTY         PIC  S9(9) COMP.                    
121200*    10 WS-IMBKUP-CRE-BY-USR-ID       PIC   X(8).                         
121300*    10 WS-IMBKUP-CRE-TMST            PIC   X(26).                        
121400*    10 WS-IMBKUP-LAST-UPD-BY-USR-ID  PIC   X(8).                         
121500*    10 WS-IMBKUP-LAST-UPD-TMST       PIC   X(26).                        
121600*01  WS-IMBKUP-KEYS.                                                      
121700*    10 DS-IMBKUP-PO-NBR              PIC  S9(9) COMP.                    
121800*    10 DS-IMBKUP-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.                    
121900*    10 DS-IMBKUP-VS-NBR              PIC   X(20).                        
122000*    10 DS-IMBKUP-UPC-NBR             PIC  S9(15)V COMP-3.                
122100*****************************************************************         
122200* COBOL DECLARATION FOR TABLE TIMRCPO       32 COLUMNS                    
122300*****************************************************************         
122400 01  WS-IMRCPO.                                                           
122500     10 WS-IMRCPO-PO-NBR              PIC  S9(9) COMP.                    
122600     10 WS-IMRCPO-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.                    
122700     10 WS-IMRCPO-PO-RCVD-DELY-TMST   PIC   X(26).                        
122800     10 WS-IMRCPO-EXTL-REF-NBR        PIC   X(15).                        
122900     10 WS-IMRCPO-ORGN-SHPD-FR-CDE    PIC   X(3).                         
123000     10 WS-IMRCPO-CONSLR-SCAC-ID      PIC   X(4).                         
123100     10 WS-IMRCPO-IMPRT-TRIP-ID       PIC   X(10).                        
123200     10 WS-IMRCPO-DPRTR-TMST          PIC   X(26).                        
123300     10 WS-IMRCPO-POE-DELY-TMST       PIC   X(26).                        
123400     10 WS-IMRCPO-CARR-SCAC-ID        PIC   X(4).                         
123500     10 WS-IMRCPO-FOB-CDE             PIC   X(5).                         
123600     10 WS-IMRCPO-IMPRT-VEH-NM        PIC   X(25).                        
123700     10 WS-IMRCPO-TRIP-TYP-CDE        PIC   X(1).                         
123800     10 WS-IMRCPO-DEST-POE-CDE        PIC   X(4).                         
123900     10 WS-IMRCPO-C-O-PROD-CDE        PIC   X(3).                         
124000     10 WS-IMRCPO-PROD-FCTRY-NM       PIC   X(35).                        
124100     10 WS-IMRCPO-PO-CART-CNT         PIC  S9(9) COMP.                    
124200     10 WS-IMRCPO-PO-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.             
124300     10 WS-IMRCPO-PO-WT-KGRM-QTY      PIC  S9(9) COMP.                    
124400     10 WS-IMRCPO-PO-UNT-QTY          PIC  S9(9) COMP.                    
124500     10 WS-IMRCPO-PO-EXC-APVL-CDE     PIC   X(2).                         
124600     10 WS-IMRCPO-PO-EXC-APVL-USR-ID  PIC   X(8).                         
124700     10 WS-IMRCPO-PO-EXC-APVL-TMST    PIC   X(26).                        
124800     10 WS-IMRCPO-PO-EXC-RSN-DESC     PIC   X(30).                        
124900     10 WS-IMRCPO-EST-LBD-NM          PIC   X(30).                        
125000     10 WS-IMRCPO-EST-LBD-TMST        PIC   X(26).                        
125100     10 WS-IMRCPO-VOY-CHG-RSN-DESC    PIC   X(30).                        
125200     10 WS-IMRCPO-DAT-SRC-ENT-ID      PIC  S9(9) COMP.                    
125300     10 WS-IMRCPO-CRE-BY-USR-ID       PIC   X(8).                         
125400     10 WS-IMRCPO-CRE-TMST            PIC   X(26).                        
125500     10 WS-IMRCPO-LAST-UPD-BY-USR-ID  PIC   X(8).                         
125600     10 WS-IMRCPO-LAST-UPD-TMST       PIC   X(26).                        
125700 01  WS-IMRCPO-KEYS.                                                      
125800     10 DS-IMRCPO-PO-NBR              PIC  S9(9) COMP.                    
125900     10 DS-IMRCPO-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.                    
126000*****************************************************************         
126100* COBOL DECLARATION FOR TABLE TIMRCVS       13 COLUMNS                    
126200*****************************************************************         
126300*01  WS-IMRCVS.                                                           
126400*    10 WS-IMRCVS-PO-NBR              PIC  S9(9) COMP.                    
126500*    10 WS-IMRCVS-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.                    
126600*    10 WS-IMRCVS-VS-NBR              PIC   X(20).                        
126700*    10 WS-IMRCVS-HTS-ID              PIC   X(13).                        
126800*    10 WS-IMRCVS-VS-CART-CNT         PIC  S9(9) COMP.                    
126900*    10 WS-IMRCVS-VS-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.             
127000*    10 WS-IMRCVS-VS-WT-KGRM-QTY      PIC  S9(9) COMP.                    
127100*    10 WS-IMRCVS-VS-UNT-QTY          PIC  S9(9) COMP.                    
127200*    10 WS-IMRCVS-QTA-CTG-IND         PIC   X(1).                         
127300*    10 WS-IMRCVS-CRE-BY-USR-ID       PIC   X(8).                         
127400*    10 WS-IMRCVS-CRE-TMST            PIC   X(26).                        
127500*    10 WS-IMRCVS-LAST-UPD-BY-USR-ID  PIC   X(8).                         
127600*    10 WS-IMRCVS-LAST-UPD-TMST       PIC   X(26).                        
127700*01  WS-IMRCVS-KEYS.                                                      
127800*    10 DS-IMRCVS-PO-NBR              PIC  S9(9) COMP.                    
127900*    10 DS-IMRCVS-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.                    
128000*    10 DS-IMRCVS-VS-NBR              PIC   X(20).                        
128100*****************************************************************         
128200* COBOL DECLARATION FOR TABLE TIMRCUP       12 COLUMNS                    
128300*****************************************************************         
128400*01  WS-IMRCUP.                                                           
128500*    10 WS-IMRCUP-PO-NBR              PIC  S9(9) COMP.                    
128600*    10 WS-IMRCUP-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.                    
128700*    10 WS-IMRCUP-VS-NBR              PIC   X(20).                        
128800*    10 WS-IMRCUP-UPC-NBR             PIC  S9(15)V COMP-3.                
128900*    10 WS-IMRCUP-UPC-CART-CNT        PIC  S9(9) COMP.                    
129000*    10 WS-IMRCUP-UPC-CBMT-QTY        PIC  S9(7)V9(2) COMP-3.             
129100*    10 WS-IMRCUP-UPC-WT-KGRM-QTY     PIC  S9(9) COMP.                    
129200*    10 WS-IMRCUP-UPC-UNT-QTY         PIC  S9(9) COMP.                    
129300*    10 WS-IMRCUP-CRE-BY-USR-ID       PIC   X(8).                         
129400*    10 WS-IMRCUP-CRE-TMST            PIC   X(26).                        
129500*    10 WS-IMRCUP-LAST-UPD-BY-USR-ID  PIC   X(8).                         
129600*    10 WS-IMRCUP-LAST-UPD-TMST       PIC   X(26).                        
129700*01  WS-IMRCUP-KEYS.                                                      
129800*    10 DS-IMRCUP-PO-NBR              PIC  S9(9) COMP.                    
129900*    10 DS-IMRCUP-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.                    
130000*    10 DS-IMRCUP-VS-NBR              PIC   X(20).                        
130100*    10 DS-IMRCUP-UPC-NBR             PIC  S9(15)V COMP-3.                
130200******************************************************************        
130300* COBOL DECLARATION FOR TABLE TMESTDS                                     
130400******************************************************************        
130500 01  WS-MESTDS.                                                           
130600     10 WS-MESTDS-PO-NBR              PIC  S9(9) COMP.                    
130700     10 WS-MESTDS-PO-LNE-NBR          PIC  S9(9) COMP.                    
130800     10 WS-MESTDS-PLAN-NBR            PIC  S9(4) COMP.                    
130900     10 WS-MESTDS-STR-NBR             PIC  S9(4) COMP.                    
131000     10 WS-MESTDS-STR-DISTRO-QTY      PIC  S9(9) COMP.                    
131100     10 WS-MESTDS-ALLOC-SEQ-CDE       PIC   X(1).                         
131200     10 WS-MESTDS-RNK-SEQ-NBR         PIC  S9(4) COMP.                    
131300     10 WS-02-MESTDS-STR-CNSTR-CDE    PIC   X(1).                         
131400     10 WS-02-MESTDS-STR-CNSTR-QTY    PIC  S9(9) COMP.                    
131500 01  WS-MESTDS-KEYS.                                                      
131600     10 DS-MESTDS-PO-NBR              PIC  S9(9) COMP.                    
131700     10 DS-MESTDS-PO-LNE-NBR          PIC  S9(9) COMP.                    
131800     10 DS-MESTDS-PLAN-NBR            PIC  S9(4) COMP.                    
131900     10 DS-MESTDS-STR-NBR             PIC  S9(4) COMP.                    
132000******************************************************************        
132100* COBOL DECLARATION FOR TABLE TEXTENT                                     
132200******************************************************************        
132300 01  WS-EXTENT.                                                           
132400     10 WS-EXTENT-ENT-ID              PIC  S9(9) COMP.                    
132500     10 WS-EXTENT-SCAC-CDE            PIC   X(4).                         
132600     10 WS-EXTENT-DUN-NBR             PIC   X(9).                         
132700     10 WS-EXTENT-ASN-TRSCP-IND       PIC   X(1).                         
132800     10 WS-EXTENT-FED-EXPRESS-NBR     PIC   X(9).                         
132900     10 WS-EXTENT-MDSE-VENDOR-IND     PIC   X(1).                         
133000     10 WS-EXTENT-CARRIER-IND         PIC   X(1).                         
133100     10 WS-EXTENT-STATUS-CDE          PIC   X(1).                         
133200     10 WS-EXTENT-CARR-MAN-PRO-IND    PIC   X(1).                         
133300     10 WS-EXTENT-EDI214-TEST-IND     PIC   X(1).                         
133400     10 WS-EXTENT-IMPRT-IND           PIC   X(1).                         
133500     10 WS-EXTENT-SHIP-INSTR-LT-QTY   PIC  S9(4) COMP.                    
133600     10 WS-EXTENT-SHIP-INSTR-REQD     PIC   X(1).                         
133700     10 WS-EXTENT-EXP-VEND-IND        PIC   X(1).                         
133800     10 WS-EXTENT-NEED-1099-IND       PIC   X(1).                         
133900     10 WS-EXTENT-CRE-BY-UID          PIC   X(8).                         
134000     10 WS-EXTENT-CRE-TMST            PIC   X(26).                        
134100     10 WS-EXTENT-LAST-UPD-BY-UID     PIC   X(8).                         
134200     10 WS-EXTENT-LAST-UPD-TMST       PIC   X(26).                        
134300     10 WS-EXTENT-CFY-SLSRNK-NBR      PIC  S9(4) COMP.                    
134400     10 WS-EXTENT-PFY-SLSRNK-NBR      PIC  S9(4) COMP.                    
134500     10 WS-EXTENT-CRE-ASN-FCST-IND    PIC   X(1).                         
134600     10 WS-EXTENT-CRE-SHIPT-FCST-IND  PIC   X(1).                         
134700     10 WS-EXTENT-STR-DISTRO-LT-QTY   PIC  S9(4) COMP.                    
134800     10 WS-EXTENT-VLD-CART-LBL-IND    PIC   X(1).                         
134900     10 WS-EXTENT-PRNT-CO-ENT-ID      PIC  S9(9) COMP.                    
135000     10 WS-EXTENT-VND-CLSN-CDE        PIC   X(1).                         
135100     10 WS-EXTENT-VND-PRSST-CDE       PIC   X(1).                         
135200     10 WS-EXTENT-FED-TX-ID-TYP-CDE   PIC   X(1).                         
135300     10 WS-EXTENT-FED-TX-ID-NBR       PIC   X(9).                         
135400     10 WS-EXTENT-FCTR-IND            PIC   X(1).                         
135500     10 WS-EXTENT-PRNT-CO-IND         PIC   X(1).                         
135600     10 WS-EXTENT-CAP-EXP-CDE         PIC   X(1).                         
135700     10 WS-EXTENT-HLD-PAYT-IND        PIC   X(1).                         
135800     10 WS-EXTENT-PAY-FCTR-VND-IND    PIC   X(1).                         
135900     10 WS-EXTENT-SEPR-INVC-PAYT-IND  PIC   X(1).                         
136000     10 WS-EXTENT-WHLDG-PAYT-TYP-CDE  PIC   X(5).                         
136100     10 WS-EXTENT-PAYT-HNDLG-CDE      PIC   X(2).                         
136200     10 WS-EXTENT-P12MN-SLSRNK-NBR    PIC  S9(4) COMP.                    
136300     10 WS-EXTENT-EDI-PO-PREPK-CDE    PIC   X(1).                         
136400     10 WS-EXTENT-PRIM-TYP-CDE        PIC   X(1).                         
136500     10 WS-EXTENT-PRTNR-IND           PIC   X(1).                         
136600     10 WS-EXTENT-PRTNR-TYP-CDE       PIC   X(2).                         
136700     10 WS-EXTENT-LNE-OF-CR-AMT       PIC  S9(11)V9(2) COMP-3.            
136800     10 WS-EXTENT-VND-IN-RMS-IND      PIC   X(1).                         
136900 01  WS-EXTENT-KEYS.                                                      
137000     10 DS-EXTENT-ENT-ID              PIC  S9(9) COMP.                    
137100******************************************************************        
137200* COBOL DECLARATION FOR TABLE TENTNME                            *        
137300******************************************************************        
137400 01  WS-ENTNME.                                                           
137500     10 WS-ENTNME-ENT-ID            PIC S9(9) USAGE COMP.                 
137600     10 WS-ENTNME-SEQ-NBR           PIC S9(4) USAGE COMP.                 
137700     10 WS-ENTNME-ENT-NAME-DESC     PIC X(250).                           
137800     10 WS-ENTNME-TYPE-CDE          PIC X(2).                             
137900 01  WS-ENTNME-KEYS.                                                      
138000     10 DS-ENTNME-ENT-ID            PIC S9(9) USAGE COMP.                 
138100     10 DS-ENTNME-SEQ-NBR           PIC S9(4) USAGE COMP.                 
138200******************************************************************        
138300* COBOL DECLARATION FOR TABLE TVNDDPT                                     
138400******************************************************************        
138500 01  WS-VNDDPT.                                                           
138600     10 WS-VNDDPT-ENT-ID              PIC  S9(9) COMP.                    
138700     10 WS-VNDDPT-DEPT-NBR            PIC   X(3).                         
138800     10 WS-VNDDPT-INHOUSE-NBR         PIC  S9(3)V COMP-3.                 
138900     10 WS-VNDDPT-VEND-TYP-IND        PIC   X(1).                         
139000     10 WS-VNDDPT-INVC-REQ-PO-IND     PIC   X(1).                         
139100     10 WS-VNDDPT-VND-DEPT-STAT-CD    PIC   X(1).                         
139200 01  WS-VNDDPT-KEYS.                                                      
139300     10 DS-VNDDPT-ENT-ID              PIC  S9(9) COMP.                    
139400     10 DS-VNDDPT-DEPT-NBR            PIC   X(3).                         
139500******************************************************************        
139600* COBOL DECLARATION FOR TABLE TINSTCD                                     
139700******************************************************************        
139800 01  WS-INSTCD.                                                           
139900     10 WS-INSTCD-INSTR-NBR           PIC  S9(9) COMP.                    
140000     10 WS-INSTCD-INSTR-DESC          PIC   X(150).                       
140100     10 WS-INSTCD-CRE-BY-UID          PIC   X(8).                         
140200     10 WS-INSTCD-CRE-DTE             PIC   X(10).                        
140300 01  WS-INSTCD-KEYS.                                                      
140400     10 DS-INSTCD-INSTR-NBR           PIC  S9(9) COMP.                    
140500******************************************************************        
140600* COBOL DECLARATION FOR TABLE TSPSTDS                                     
140700******************************************************************        
140800*01  WS-SPSTDS.                                                           
140900*    10 WS-SPSTDS-PO-NBR              PIC  S9(9) COMP.                    
141000*    10 WS-SPSTDS-PO-LNE-NBR          PIC  S9(9) COMP.                    
141100*    10 WS-SPSTDS-PLAN-NBR            PIC  S9(4) COMP.                    
141200*    10 WS-SPSTDS-STR-NBR             PIC  S9(4) COMP.                    
141300*    10 WS-SPSTDS-STR-DISTRO-QTY      PIC  S9(9) COMP.                    
141400*01  WS-SPSTDS-KEYS.                                                      
141500*    10 DS-SPSTDS-PO-NBR              PIC  S9(9) COMP.                    
141600*    10 DS-SPSTDS-PO-LNE-NBR          PIC  S9(9) COMP.                    
141700*    10 DS-SPSTDS-PLAN-NBR            PIC  S9(4) COMP.                    
141800*    10 DS-SPSTDS-STR-NBR             PIC  S9(4) COMP.                    
141900******************************************************************        
142000* COBOL DECLARATION FOR TABLE TTRBNTF - TABLE VERSION 01                  
142100******************************************************************        
142200 01  WS-TRBNTF.                                                           
142300     10 WS-TRBNTF-NOTIF-NBR           PIC  S9(9) COMP.                    
142400     10 WS-TRBNTF-OPER-UNT-ID         PIC  S9(4) COMP.                    
142500     10 WS-TRBNTF-FCLTY-ID            PIC  S9(4) COMP.                    
142600     10 WS-TRBNTF-DEPT-NBR            PIC   X(3).                         
142700     10 WS-TRBNTF-ENT-ID              PIC  S9(9) COMP.                    
142800     10 WS-TRBNTF-PO-NBR              PIC  S9(9) COMP.                    
142900     10 WS-TRBNTF-PO-LNE-NBR          PIC  S9(9) COMP.                    
143000     10 WS-TRBNTF-REC-SEQ-NBR         PIC  S9(9) COMP.                    
143100     10 WS-TRBNTF-TRBL-RSN-CDE        PIC  S9(4) COMP.                    
143200     10 WS-TRBNTF-NOTIF-TMST          PIC   X(26).                        
143300     10 WS-TRBNTF-NOTIF-UID           PIC   X(8).                         
143400     10 WS-TRBNTF-RESOLVED-IND        PIC   X(1).                         
143500     10 WS-TRBNTF-RESOLVED-TMST       PIC   X(26).                        
143600     10 WS-TRBNTF-RESOLVED-UID        PIC   X(8).                         
143700     10 WS-TRBNTF-ACKNOWLG-TMST       PIC   X(26).                        
143800     10 WS-TRBNTF-ACKNOWLG-UID        PIC   X(8).                         
143900     10 WS-TRBNTF-CNTCT-EXT           PIC  S9(9) COMP.                    
144000     10 WS-TRBNTF-FCLTY-AREA-ID       PIC   X(6).                         
144100     10 WS-TRBNTF-SHIPT-ID            PIC  S9(9) COMP.                    
144200     10 WS-TRBNTF-PKSL-SEQ-NBR        PIC  S9(4) COMP.                    
144300     10 WS-TRBNTF-PKSL-LNE-NBR        PIC  S9(9) COMP.                    
144400     10 WS-TRBNTF-WORK-ORD-SEQ-NBR    PIC  S9(4) COMP.                    
144500     10 WS-TRBNTF-WO-INSTR-SEQ-NBR    PIC  S9(4) COMP.                    
144600     10 WS-TRBNTF-OVER-SHT-PCT        PIC  S9(4) COMP.                    
144700     10 WS-TRBNTF-LAST-DTL-CRE-TMST PIC     X(26).                        
144800     10 WS-TRBNTF-CRE-IND             PIC   X(1).                         
144900     10 WS-TRBNTF-PRORATE-IND         PIC   X(1).                         
145000     10 WS-TRBNTF-RTV-IND             PIC   X(1).                         
145100     10 WS-TRBNTF-RTV-RESPONSE-TMST   PIC   X(26).                        
145200     10 WS-TRBNTF-PO-VER-NBR          PIC  S9(9) COMP.                    
145300     10 WS-TRBNTF-PO-LNE-VER-NBR      PIC  S9(9) COMP.                    
145400     10 WS-TRBNTF-PLN-SHIP-VER-NBR    PIC  S9(9) COMP.                    
145500     10 WS-TRBNTF-ERLY-LTE-DAY-QTY    PIC  S9(4) COMP.                    
145600     10 WS-TRBNTF-INITR-ID            PIC  S9(4) COMP.                    
145700     10 WS-TRBNTF-RSPNB-RSLU-ID       PIC  S9(4) COMP.                    
145800     10 WS-TRBNTF-PFMC-TRKG-ID        PIC  S9(4) COMP.                    
145900     10 WS-TRBNTF-ACTVY-RSLU-CDE      PIC   X(2).                         
146000     10 WS-TRBNTF-INITR-ENT-ID        PIC  S9(9) COMP.                    
146100     10 WS-02-TRBNTF-FOB-CDE          PIC  X(03).                         
146200     10 WS-02-TRBNTF-POE-CDE          PIC  X(03).                         
146300     10 WS-02-TRBNTF-PREPK-ID         PIC  S9(4) COMP.                    
146400 01  WS-TRBNTF-KEYS.                                                      
146500     10 DS-TRBNTF-NOTIF-NBR           PIC  S9(9) COMP.                    
146600******************************************************************        
146700* COBOL DECLARATION FOR TABLE TTRBDTL                                     
146800******************************************************************        
146900 01  WS-TRBDTL.                                                           
147000     10 WS-TRBDTL-NOTIF-NBR           PIC  S9(9) COMP.                    
147100     10 WS-TRBDTL-CRE-TMST            PIC   X(26).                        
147200     10 WS-TRBDTL-CRE-UID             PIC   X(8).                         
147300     10 WS-TRBDTL-FREEFORM-TEXT.                                          
147400         49 TRBDTL-FREEFORM-TEXT-LEN       PIC S9(4) COMP.                
147500         49 TRBDTL-FREEFORM-TEXT-TEXT      PIC X(250).                    
147600 01  WS-TRBDTL-KEYS.                                                      
147700     10 DS-TRBDTL-NOTIF-NBR           PIC  S9(9) COMP.                    
147800     10 DS-TRBDTL-CRE-TMST            PIC   X(26).                        
147900******************************************************************        
148000* COBOL DECLARATION FOR TABLE TRECDVS                                     
148100******************************************************************        
148200 01  WS-RECDVS.                                                           
148300     10 WS-RECDVS-ORD-NBR             PIC  S9(9) COMP.                    
148400     10 WS-RECDVS-ORD-LNE-NBR         PIC  S9(9) COMP.                    
148500     10 WS-RECDVS-REC-SEQ-NBR         PIC  S9(9) COMP.                    
148600     10 WS-RECDVS-STR-NBR             PIC  S9(4) COMP.                    
148700     10 WS-RECDVS-VRFY-SRC-CDE        PIC   X(2).                         
148800     10 WS-RECDVS-EXPTED-ITM-QTY      PIC  S9(9) COMP.                    
148900     10 WS-RECDVS-VRFY-ITM-QTY        PIC  S9(9) COMP.                    
149000     10 WS-RECDVS-VER-STAT-CDE        PIC   X(1).                         
149100 01  WS-RECDVS-KEYS.                                                      
149200     10 DS-RECDVS-ORD-NBR             PIC  S9(9) COMP.                    
149300     10 DS-RECDVS-ORD-LNE-NBR         PIC  S9(9) COMP.                    
149400     10 DS-RECDVS-REC-SEQ-NBR         PIC  S9(9) COMP.                    
149500     10 DS-RECDVS-STR-NBR             PIC  S9(4) COMP.                    
149600     10 DS-RECDVS-VRFY-SRC-CDE        PIC   X(2).                         
149700******************************************************************        
149800* COBOL DECLARATION FOR TABLE TAUTRIP                                     
149900******************************************************************        
150000 01  WS-AUTRIP.                                                           
150100     10 WS-AUTRIP-OWNER-SCAC-ID       PIC   X(4).                         
150200     10 WS-AUTRIP-VEH-NBR             PIC   X(10).                        
150300     10 WS-AUTRIP-VEH-NBR-NN          PIC  S9(4) COMP.                    
150400     10 WS-AUTRIP-TRIP-ID             PIC  S9(9) COMP.                    
150500     10 WS-AUTRIP-TRIP-BEG-DTE        PIC   X(10).                        
150600     10 WS-AUTRIP-TRIP-BEG-TME        PIC   X(8).                         
150700     10 WS-AUTRIP-CRT-SRC-CDE         PIC   X(2).                         
150800     10 WS-AUTRIP-LAST-UPD-DTE        PIC   X(10).                        
150900     10 WS-AUTRIP-LAST-UPD-TME        PIC   X(8).                         
151000     10 WS-AUTRIP-LAST-UPD-UID        PIC   X(8).                         
151100     10 WS-AUTRIP-MANIFEST-NBR        PIC   X(15).                        
151200     10 WS-AUTRIP-PLND-TRIP-SEQ       PIC  S9(4) COMP.                    
151300     10 WS-AUTRIP-PLND-ACTVY-CDE      PIC   X(1).                         
151400     10 WS-AUTRIP-REF-TRIP-ID         PIC  S9(9) COMP.                    
151500     10 WS-AUTRIP-EST-AR-TMST         PIC   X(26).                        
151600     10 WS-AUTRIP-EST-AR-TMST-NN      PIC  S9(4) COMP.                    
151700     10 WS-AUTRIP-OWNR-SCAC-SHIP-DTE  PIC   X(10).                        
151800     10 WS-AUTRIP-AUD-STATUS-CDE      PIC   X(2).                         
151900     10 WS-AUTRIP-SPLT-XMIT-IND       PIC   X(1).                         
152000     10 WS-AUTRIP-SPLT-XMIT-DTE       PIC   X(10).                        
152100     10 WS-AUTRIP-SPLT-XMIT-TM        PIC   X(8).                         
152200 01  WS-AUTRIP-KEYS.                                                      
152300     10 DS-AUTRIP-TRIP-ID             PIC  S9(9) COMP.                    
152400     10 DS-AUTRIP-LAST-UPD-DTE        PIC   X(10).                        
152500     10 DS-AUTRIP-LAST-UPD-TME        PIC   X(8).                         
152600******************************************************************        
152700* COBOL DECLARATION FOR TABLE TIMCSBL                                     
152800******************************************************************        
152900 01  WS-IMCSBL.                                                           
153000     10 WS-IMCSBL-CSTM-ENTR-ID           PIC   X(12).                     
153100     10 WS-IMCSBL-MSTR-BOL-NBR           PIC   X(30).                     
153200     10 WS-IMCSBL-HSE-BOL-NBR            PIC   X(30).                     
153300     10 WS-IMCSBL-CRE-BY-USR-ID          PIC   X(8).                      
153400     10 WS-IMCSBL-CRE-TMST               PIC   X(26).                     
153500     10 WS-IMCSBL-LAST-UPD-BY-USR-ID     PIC   X(8).                      
153600     10 WS-IMCSBL-LAST-UPD-TMST          PIC   X(26).                     
153700 01  WS-IMCSBL-KEYS.                                                      
153800     10 DS-IMCSBL-CSTM-ENTR-ID           PIC   X(12).                     
153900     10 DS-IMCSBL-MSTR-BOL-NBR           PIC   X(30).                     
154000     10 DS-IMCSBL-HSE-BOL-NBR            PIC   X(30).                     
154100******************************************************************        
154200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *        
154300******************************************************************        
154400******************************************************************        
154500* COBOL DECLARATION FOR TABLE TIMCSCN                                     
154600******************************************************************        
154700 01  WS-IMCSCN.                                                           
154800     10 WS-IMCSCN-CSTM-ENTR-ID           PIC   X(12).                     
154900     10 WS-IMCSCN-CONTNR-ID              PIC   X(12).                     
155000     10 WS-IMCSCN-CRE-BY-USR-ID          PIC   X(8).                      
155100     10 WS-IMCSCN-CRE-TMST               PIC   X(26).                     
155200     10 WS-IMCSCN-LAST-UPD-BY-USR-ID     PIC   X(8).                      
155300     10 WS-IMCSCN-LAST-UPD-TMST          PIC   X(26).                     
155400 01  WS-IMCSCN-KEYS.                                                      
155500     10 DS-IMCSCN-CSTM-ENTR-ID           PIC   X(12).                     
155600     10 DS-IMCSCN-CONTNR-ID              PIC   X(12).                     
155700******************************************************************        
155800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   6     *        
155900******************************************************************        
156000******************************************************************        
156100* COBOL DECLARATION FOR TABLE TIMCSPO                                     
156200******************************************************************        
156300 01  WS-IMCSPO.                                                           
156400     10 WS-IMCSPO-CSTM-ENTR-ID           PIC   X(12).                     
156500     10 WS-IMCSPO-PO-NBR                 PIC  S9(9) COMP.                 
156600     10 WS-IMCSPO-CRE-BY-USR-ID          PIC   X(8).                      
156700     10 WS-IMCSPO-CRE-TMST               PIC   X(26).                     
156800     10 WS-IMCSPO-LAST-UPD-BY-USR-ID     PIC   X(8).                      
156900     10 WS-IMCSPO-LAST-UPD-TMST          PIC   X(26).                     
157000 01  WS-IMCSPO-KEYS.                                                      
157100     10 DS-IMCSPO-CSTM-ENTR-ID           PIC   X(12).                     
157200     10 DS-IMCSPO-PO-NBR                 PIC  S9(9) COMP.                 
157300******************************************************************        
157400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   6     *        
157500******************************************************************        
157600******************************************************************        
157700* COBOL DECLARATION FOR TABLE TIMCSEN                                     
157800******************************************************************        
157900 01  WS-IMCSEN.                                                           
158000     10 WS-IMCSEN-CSTM-ENTR-ID           PIC   X(12).                     
158100     10 WS-IMCSEN-ENT-ID                 PIC  S9(9) COMP.                 
158200     10 WS-IMCSEN-BKR-REF-NBR            PIC   X(15).                     
158300     10 WS-IMCSEN-FILD-TMST              PIC   X(26).                     
158400     10 WS-IMCSEN-EST-CLR-TMST           PIC   X(26).                     
158500     10 WS-IMCSEN-ACTL-CLR-TMST          PIC   X(26).                     
158600     10 WS-IMCSEN-EXM-TMST               PIC   X(26).                     
158700     10 WS-IMCSEN-REJ-TMST               PIC   X(26).                     
158800     10 WS-IMCSEN-REJ-DESC               PIC   X(30).                     
158900     10 WS-IMCSEN-LQDN-TMST              PIC   X(26).                     
159000     10 WS-IMCSEN-LQDN-SSPNN-TMST        PIC   X(26).                     
159100     10 WS-IMCSEN-LQDN-SSPNN-DESC        PIC   X(30).                     
159200     10 WS-IMCSEN-DAT-SRC-ENT-ID         PIC  S9(9) COMP.                 
159300     10 WS-IMCSEN-CRE-BY-USR-ID          PIC   X(8).                      
159400     10 WS-IMCSEN-CRE-TMST               PIC   X(26).                     
159500     10 WS-IMCSEN-LAST-UPD-BY-USR-ID     PIC   X(8).                      
159600     10 WS-IMCSEN-LAST-UPD-TMST          PIC   X(26).                     
159700     10 WS-IMCSEN-MOM-DEST-POE-CDE       PIC   X(4).                      
159800 01  WS-IMCSEN-KEYS.                                                      
159900     10 DS-IMCSEN-CSTM-ENTR-ID           PIC   X(12).                     
160000******************************************************************        
160100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  18     *        
160200******************************************************************        
160300******************************************************************        
160400* COBOL DECLARATION FOR TABLE TAUCSEN                                     
160500******************************************************************        
160600 01  WS-AUCSEN.                                                           
160700     10 WS-AUCSEN-CSTM-ENTR-ID           PIC   X(12).                     
160800     10 WS-AUCSEN-ENT-ID                 PIC  S9(9) COMP.                 
160900     10 WS-AUCSEN-BKR-REF-NBR            PIC   X(15).                     
161000     10 WS-AUCSEN-FILD-TMST              PIC   X(26).                     
161100     10 WS-AUCSEN-EST-CLR-TMST           PIC   X(26).                     
161200     10 WS-AUCSEN-ACTL-CLR-TMST          PIC   X(26).                     
161300     10 WS-AUCSEN-EXM-TMST               PIC   X(26).                     
161400     10 WS-AUCSEN-REJ-TMST               PIC   X(26).                     
161500     10 WS-AUCSEN-REJ-DESC               PIC   X(30).                     
161600     10 WS-AUCSEN-LQDN-TMST              PIC   X(26).                     
161700     10 WS-AUCSEN-LQDN-SSPNN-TMST        PIC   X(26).                     
161800     10 WS-AUCSEN-LQDN-SSPNN-DESC        PIC   X(30).                     
161900     10 WS-AUCSEN-DAT-SRC-ENT-ID         PIC  S9(9) COMP.                 
162000     10 WS-AUCSEN-LAST-UPD-BY-USR-ID     PIC   X(8).                      
162100     10 WS-AUCSEN-LAST-UPD-TMST          PIC   X(26).                     
162200     10 WS-AUCSEN-AUD-FUNC-CDE           PIC   X(1).                      
162300     10 WS-AUCSEN-AUD-TMST               PIC   X(26).                     
162400     10 WS-AUCSEN-MOM-DEST-POE-CDE       PIC   X(4).                      
162500 01  WS-AUCSEN-KEYS.                                                      
162600     10 DS-AUCSEN-CSTM-ENTR-ID           PIC   X(12).                     
162700     10 DS-AUCSEN-LAST-UPD-TMST          PIC   X(26).                     
162800******************************************************************        
162900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  18     *        
163000******************************************************************        
163100******************************************************************        
163200* COBOL DECLARATION FOR TABLE TAUCSPO                                     
163300******************************************************************        
163400 01  WS-AUCSPO.                                                           
163500     10 WS-AUCSPO-CSTM-ENTR-ID           PIC   X(12).                     
163600     10 WS-AUCSPO-PO-NBR                 PIC  S9(9) COMP.                 
163700     10 WS-AUCSPO-LAST-UPD-BY-USR-ID     PIC   X(8).                      
163800     10 WS-AUCSPO-LAST-UPD-TMST          PIC   X(26).                     
163900     10 WS-AUCSPO-AUD-FUNC-CDE           PIC   X(1).                      
164000     10 WS-AUCSPO-AUD-TMST               PIC   X(26).                     
164100 01  WS-AUCSPO-KEYS.                                                      
164200     10 DS-AUCSPO-CSTM-ENTR-ID           PIC   X(12).                     
164300     10 DS-AUCSPO-LAST-UPD-TMST          PIC   X(26).                     
164400******************************************************************        
164500* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   6     *        
164600******************************************************************        
164700******************************************************************        
164800* COBOL DECLARATION FOR TABLE TAUCSCN                                     
164900******************************************************************        
165000 01  WS-AUCSCN.                                                           
165100     10 WS-AUCSCN-CSTM-ENTR-ID           PIC   X(12).                     
165200     10 WS-AUCSCN-CONTNR-ID              PIC   X(12).                     
165300     10 WS-AUCSCN-LAST-UPD-BY-USR-ID     PIC   X(8).                      
165400     10 WS-AUCSCN-LAST-UPD-TMST          PIC   X(26).                     
165500     10 WS-AUCSCN-AUD-FUNC-CDE           PIC   X(1).                      
165600     10 WS-AUCSCN-AUD-TMST               PIC   X(26).                     
165700 01  WS-AUCSCN-KEYS.                                                      
165800     10 DS-AUCSCN-CSTM-ENTR-ID           PIC   X(12).                     
165900     10 DS-AUCSCN-LAST-UPD-TMST          PIC   X(26).                     
166000******************************************************************        
166100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   6     *        
166200******************************************************************        
166300******************************************************************        
166400* COBOL DECLARATION FOR TABLE TAUCSBL                                     
166500******************************************************************        
166600 01  WS-AUCSBL.                                                           
166700     10 WS-AUCSBL-CSTM-ENTR-ID           PIC   X(12).                     
166800     10 WS-AUCSBL-MSTR-BOL-NBR           PIC   X(30).                     
166900     10 WS-AUCSBL-HSE-BOL-NBR            PIC   X(30).                     
167000     10 WS-AUCSBL-LAST-UPD-BY-USR-ID     PIC   X(8).                      
167100     10 WS-AUCSBL-LAST-UPD-TMST          PIC   X(26).                     
167200     10 WS-AUCSBL-AUD-FUNC-CDE           PIC   X(1).                      
167300     10 WS-AUCSBL-AUD-TMST               PIC   X(26).                     
167400 01  WS-AUCSBL-KEYS.                                                      
167500     10 DS-AUCSBL-CSTM-ENTR-ID           PIC   X(12).                     
167600     10 DS-AUCSBL-LAST-UPD-TMST          PIC   X(26).                     
167700******************************************************************        
167800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *        
167900******************************************************************        
168000******************************************************************        
168100* COBOL DECLARATION FOR TABLE TAURCPO                                     
168200******************************************************************        
168300 01  WS-AURCPO.                                                           
168400     10 WS-AURCPO-PO-NBR              PIC  S9(9) COMP.                    
168500     10 WS-AURCPO-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.                    
168600     10 WS-AURCPO-PO-RCVD-DELY-TMST   PIC   X(26).                        
168700     10 WS-AURCPO-EXTL-REF-NBR        PIC   X(15).                        
168800     10 WS-AURCPO-ORGN-SHPD-FR-CDE    PIC   X(3).                         
168900     10 WS-AURCPO-CONSLR-SCAC-ID      PIC   X(4).                         
169000     10 WS-AURCPO-IMPRT-TRIP-ID       PIC   X(10).                        
169100     10 WS-AURCPO-DPRTR-TMST          PIC   X(26).                        
169200     10 WS-AURCPO-POE-DELY-TMST       PIC   X(26).                        
169300     10 WS-AURCPO-CARR-SCAC-ID        PIC   X(4).                         
169400     10 WS-AURCPO-FOB-CDE             PIC   X(5).                         
169500     10 WS-AURCPO-IMPRT-VEH-NM        PIC   X(25).                        
169600     10 WS-AURCPO-TRIP-TYP-CDE        PIC   X(1).                         
169700     10 WS-AURCPO-DEST-POE-CDE        PIC   X(4).                         
169800     10 WS-AURCPO-C-O-PROD-CDE        PIC   X(3).                         
169900     10 WS-AURCPO-PROD-FCTRY-NM       PIC   X(35).                        
170000     10 WS-AURCPO-PO-CART-CNT         PIC  S9(9) COMP.                    
170100     10 WS-AURCPO-PO-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.             
170200     10 WS-AURCPO-PO-WT-KGRM-QTY      PIC  S9(9) COMP.                    
170300     10 WS-AURCPO-PO-UNT-QTY          PIC  S9(9) COMP.                    
170400     10 WS-AURCPO-PO-EXC-APVL-CDE     PIC   X(2).                         
170500     10 WS-AURCPO-PO-EXC-APVL-USR-ID  PIC   X(8).                         
170600     10 WS-AURCPO-PO-EXC-APVL-TMST    PIC   X(26).                        
170700     10 WS-AURCPO-PO-EXC-RSN-DESC     PIC   X(30).                        
170800     10 WS-AURCPO-EST-LBD-NM          PIC   X(30).                        
170900     10 WS-AURCPO-EST-LBD-TMST        PIC   X(26).                        
171000     10 WS-AURCPO-VOY-CHG-RSN-DESC    PIC   X(30).                        
171100     10 WS-AURCPO-DAT-SRC-ENT-ID      PIC  S9(9) COMP.                    
171200     10 WS-AURCPO-LAST-UPD-BY-USR-ID  PIC   X(8).                         
171300     10 WS-AURCPO-LAST-UPD-TMST       PIC   X(26).                        
171400     10 WS-AURCPO-AUD-FUNC-CDE        PIC   X(1).                         
171500     10 WS-AURCPO-AUD-TMST            PIC   X(26).                        
171600 01  WS-AURCPO-KEYS.                                                      
171700     10 DS-AURCPO-PO-NBR              PIC  S9(9) COMP.                    
171800     10 DS-AURCPO-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.                    
171900     10 DS-AURCPO-AUD-TMST            PIC   X(26).                        
172000******************************************************************        
172100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  32     *        
172200******************************************************************        
172300******************************************************************        
172400* COBOL DECLARATION FOR TABLE TAURCVS                                     
172500******************************************************************        
172600*01  WS-AURCVS.                                                           
172700*    10 WS-AURCVS-PO-NBR              PIC  S9(9) COMP.                    
172800*    10 WS-AURCVS-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.                    
172900*    10 WS-AURCVS-VS-NBR              PIC   X(20).                        
173000*    10 WS-AURCVS-HTS-ID              PIC   X(13).                        
173100*    10 WS-AURCVS-VS-CART-CNT         PIC  S9(9) COMP.                    
173200*    10 WS-AURCVS-VS-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.             
173300*    10 WS-AURCVS-VS-WT-KGRM-QTY      PIC  S9(9) COMP.                    
173400*    10 WS-AURCVS-VS-UNT-QTY          PIC  S9(9) COMP.                    
173500*    10 WS-AURCVS-QTA-CTG-IND         PIC   X(1).                         
173600*    10 WS-AURCVS-LAST-UPD-BY-USR-ID  PIC   X(8).                         
173700*    10 WS-AURCVS-LAST-UPD-TMST       PIC   X(26).                        
173800*    10 WS-AURCVS-AUD-FUNC-CDE        PIC   X(1).                         
173900*    10 WS-AURCVS-AUD-TMST            PIC   X(26).                        
174000*01  WS-AURCVS-KEYS.                                                      
174100*    10 DS-AURCVS-PO-NBR              PIC  S9(9) COMP.                    
174200*    10 DS-AURCVS-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.                    
174300*    10 DS-AURCVS-VS-NBR              PIC   X(20).                        
174400*    10 DS-AURCVS-AUD-TMST            PIC   X(26).                        
174500******************************************************************        
174600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  13     *        
174700******************************************************************        
174800******************************************************************        
174900* COBOL DECLARATION FOR TABLE TAURCUP                                     
175000******************************************************************        
175100*01  WS-AURCUP.                                                           
175200*    10 WS-AURCUP-PO-NBR              PIC  S9(9) COMP.                    
175300*    10 WS-AURCUP-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.                    
175400*    10 WS-AURCUP-VS-NBR              PIC   X(20).                        
175500*    10 WS-AURCUP-UPC-NBR             PIC  S9(15)V COMP-3.                
175600*    10 WS-AURCUP-UPC-CART-CNT        PIC  S9(9) COMP.                    
175700*    10 WS-AURCUP-UPC-CBMT-QTY        PIC  S9(7)V9(2) COMP-3.             
175800*    10 WS-AURCUP-UPC-WT-KGRM-QTY     PIC  S9(9) COMP.                    
175900*    10 WS-AURCUP-UPC-UNT-QTY         PIC  S9(9) COMP.                    
176000*    10 WS-AURCUP-LAST-UPD-BY-USR-ID  PIC   X(8).                         
176100*    10 WS-AURCUP-LAST-UPD-TMST       PIC   X(26).                        
176200*    10 WS-AURCUP-AUD-FUNC-CDE        PIC   X(1).                         
176300*    10 WS-AURCUP-AUD-TMST            PIC   X(26).                        
176400*01  WS-AURCUP-KEYS.                                                      
176500*    10 DS-AURCUP-PO-NBR              PIC  S9(9) COMP.                    
176600*    10 DS-AURCUP-PO-RCVD-SEQ-NBR     PIC  S9(4) COMP.                    
176700*    10 DS-AURCUP-VS-NBR              PIC   X(20).                        
176800*    10 DS-AURCUP-UPC-NBR             PIC  S9(15)V COMP-3.                
176900*    10 DS-AURCUP-AUD-TMST            PIC   X(26).                        
177000******************************************************************        
177100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  12     *        
177200******************************************************************        
177300******************************************************************        
177400* COBOL DECLARATION FOR TABLE TAUBKUP                                     
177500******************************************************************        
177600*01  WS-AUBKUP.                                                           
177700*    10 WS-AUBKUP-PO-NBR              PIC  S9(9) COMP.                    
177800*    10 WS-AUBKUP-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.                    
177900*    10 WS-AUBKUP-VS-NBR              PIC   X(20).                        
178000*    10 WS-AUBKUP-UPC-NBR             PIC  S9(15)V COMP-3.                
178100*    10 WS-AUBKUP-UPC-CART-CNT        PIC  S9(9) COMP.                    
178200*    10 WS-AUBKUP-UPC-CBMT-QTY        PIC  S9(7)V9(2) COMP-3.             
178300*    10 WS-AUBKUP-UPC-WT-KGRM-QTY     PIC  S9(9) COMP.                    
178400*    10 WS-AUBKUP-UPC-UNT-QTY         PIC  S9(9) COMP.                    
178500*    10 WS-AUBKUP-LAST-UPD-BY-USR-ID  PIC   X(8).                         
178600*    10 WS-AUBKUP-LAST-UPD-TMST       PIC   X(26).                        
178700*    10 WS-AUBKUP-AUD-FUNC-CDE        PIC   X(1).                         
178800*    10 WS-AUBKUP-AUD-TMST            PIC   X(26).                        
178900*01  WS-AUBKUP-KEYS.                                                      
179000*    10 DS-AUBKUP-PO-NBR              PIC  S9(9) COMP.                    
179100*    10 DS-AUBKUP-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.                    
179200*    10 DS-AUBKUP-VS-NBR              PIC   X(20).                        
179300*    10 DS-AUBKUP-UPC-NBR             PIC  S9(15)V COMP-3.                
179400*    10 DS-AUBKUP-AUD-TMST            PIC   X(26).                        
179500******************************************************************        
179600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  12     *        
179700******************************************************************        
179800******************************************************************        
179900* COBOL DECLARATION FOR TABLE TAUBKVS                                     
180000******************************************************************        
180100*01  WS-AUBKVS.                                                           
180200*    10 WS-AUBKVS-PO-NBR              PIC  S9(9) COMP.                    
180300*    10 WS-AUBKVS-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.                    
180400*    10 WS-AUBKVS-VS-NBR              PIC   X(20).                        
180500*    10 WS-AUBKVS-HTS-ID              PIC   X(13).                        
180600*    10 WS-AUBKVS-VS-CART-CNT         PIC  S9(9) COMP.                    
180700*    10 WS-AUBKVS-VS-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.             
180800*    10 WS-AUBKVS-VS-WT-KGRM-QTY      PIC  S9(9) COMP.                    
180900*    10 WS-AUBKVS-VS-UNT-QTY          PIC  S9(9) COMP.                    
181000*    10 WS-AUBKVS-QTA-CTG-IND         PIC   X(1).                         
181100*    10 WS-AUBKVS-LAST-UPD-BY-USR-ID  PIC   X(8).                         
181200*    10 WS-AUBKVS-LAST-UPD-TMST       PIC   X(26).                        
181300*    10 WS-AUBKVS-AUD-FUNC-CDE        PIC   X(1).                         
181400*    10 WS-AUBKVS-AUD-TMST            PIC   X(26).                        
181500*01  WS-AUBKVS-KEYS.                                                      
181600*    10 DS-AUBKVS-PO-NBR              PIC  S9(9) COMP.                    
181700*    10 DS-AUBKVS-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.                    
181800*    10 DS-AUBKVS-VS-NBR              PIC   X(20).                        
181900*    10 DS-AUBKVS-AUD-TMST            PIC   X(26).                        
182000******************************************************************        
182100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  13     *        
182200******************************************************************        
182300******************************************************************        
182400* COBOL DECLARATION FOR TABLE TAUBKPO                                     
182500******************************************************************        
182600 01  WS-AUBKPO.                                                           
182700     10 WS-AUBKPO-PO-NBR              PIC  S9(9) COMP.                    
182800     10 WS-AUBKPO-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.                    
182900     10 WS-AUBKPO-PO-BKG-DELY-TMST    PIC   X(26).                        
183000     10 WS-AUBKPO-EXTL-REF-NBR        PIC   X(15).                        
183100     10 WS-AUBKPO-ORGN-SHPD-FR-CDE    PIC   X(3).                         
183200     10 WS-AUBKPO-CONSLR-SCAC-ID      PIC   X(4).                         
183300     10 WS-AUBKPO-IMPRT-TRIP-ID       PIC   X(10).                        
183400     10 WS-AUBKPO-DPRTR-TMST          PIC   X(26).                        
183500     10 WS-AUBKPO-POE-DELY-TMST       PIC   X(26).                        
183600     10 WS-AUBKPO-CARR-SCAC-ID        PIC   X(4).                         
183700     10 WS-AUBKPO-FOB-CDE             PIC   X(5).                         
183800     10 WS-AUBKPO-IMPRT-VEH-NM        PIC   X(25).                        
183900     10 WS-AUBKPO-TRIP-TYP-CDE        PIC   X(1).                         
184000     10 WS-AUBKPO-DEST-POE-CDE        PIC   X(4).                         
184100     10 WS-AUBKPO-C-O-PROD-CDE        PIC   X(3).                         
184200     10 WS-AUBKPO-PROD-FCTRY-NM       PIC   X(35).                        
184300     10 WS-AUBKPO-PO-CART-CNT         PIC  S9(9) COMP.                    
184400     10 WS-AUBKPO-PO-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.             
184500     10 WS-AUBKPO-PO-WT-KGRM-QTY      PIC  S9(9) COMP.                    
184600     10 WS-AUBKPO-PO-UNT-QTY          PIC  S9(9) COMP.                    
184700     10 WS-AUBKPO-PO-EXC-APVL-CDE     PIC   X(2).                         
184800     10 WS-AUBKPO-PO-EXC-APVL-USR-ID  PIC   X(8).                         
184900     10 WS-AUBKPO-PO-EXC-APVL-TMST    PIC   X(26).                        
185000     10 WS-AUBKPO-PO-EXC-RSN-DESC     PIC   X(30).                        
185100     10 WS-AUBKPO-EST-LBD-NM          PIC   X(30).                        
185200     10 WS-AUBKPO-EST-LBD-TMST        PIC   X(26).                        
185300     10 WS-AUBKPO-SHIPT-BKG-TMST      PIC   X(26).                        
185400     10 WS-AUBKPO-VOY-CHG-RSN-DESC    PIC   X(30).                        
185500     10 WS-AUBKPO-DAT-SRC-ENT-ID      PIC  S9(9) COMP.                    
185600     10 WS-AUBKPO-LAST-UPD-BY-USR-ID  PIC   X(8).                         
185700     10 WS-AUBKPO-LAST-UPD-TMST       PIC   X(26).                        
185800     10 WS-AUBKPO-AUD-FUNC-CDE        PIC   X(1).                         
185900     10 WS-AUBKPO-AUD-TMST            PIC   X(26).                        
186000 01  WS-AUBKPO-KEYS.                                                      
186100     10 DS-AUBKPO-PO-NBR              PIC  S9(9) COMP.                    
186200     10 DS-AUBKPO-PO-BKG-SEQ-NBR      PIC  S9(4) COMP.                    
186300     10 DS-AUBKPO-AUD-TMST            PIC   X(26).                        
186400******************************************************************        
186500* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  33     *        
186600******************************************************************        
186700******************************************************************        
186800* COBOL DECLARATION FOR TABLE TAUCNTK                                     
186900******************************************************************        
187000 01  WS-AUCNTK.                                                           
187100     10 WS-AUCNTK-CONTNR-ID           PIC   X(12).                        
187200     10 WS-AUCNTK-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
187300     10 WS-AUCNTK-CONSLR-SCAC-ID      PIC   X(4).                         
187400     10 WS-AUCNTK-MOM-IMPRT-TRIP-ID   PIC   X(10).                        
187500     10 WS-AUCNTK-MOM-DPRTR-TMST      PIC   X(26).                        
187600     10 WS-AUCNTK-MOM-POE-DELY-TMST   PIC   X(26).                        
187700     10 WS-AUCNTK-MOM-CARR-SCAC-ID    PIC   X(4).                         
187800     10 WS-AUCNTK-MOM-FOB-CDE         PIC   X(5).                         
187900     10 WS-AUCNTK-MOM-IMPRT-VEH-NM    PIC   X(25).                        
188000     10 WS-AUCNTK-MOM-TRIP-TYP-CDE    PIC   X(1).                         
188100     10 WS-AUCNTK-MOM-DEST-POE-CDE    PIC   X(4).                         
188200     10 WS-AUCNTK-FDR-IMPRT-TRIP-ID   PIC   X(10).                        
188300     10 WS-AUCNTK-FDR-DPRTR-TMST      PIC   X(26).                        
188400     10 WS-AUCNTK-FDR-POE-DELY-TMST   PIC   X(26).                        
188500     10 WS-AUCNTK-FDR-CARR-SCAC-ID    PIC   X(4).                         
188600     10 WS-AUCNTK-FDR-FOB-CDE         PIC   X(5).                         
188700     10 WS-AUCNTK-FDR-IMPRT-VEH-NM    PIC   X(25).                        
188800     10 WS-AUCNTK-FDR-TRIP-TYP-CDE    PIC   X(1).                         
188900     10 WS-AUCNTK-FDR-DEST-POE-CDE    PIC   X(4).                         
189000     10 WS-AUCNTK-SIZE-CDE            PIC   X(3).                         
189100     10 WS-AUCNTK-CART-CNT            PIC  S9(9) COMP.                    
189200     10 WS-AUCNTK-CBMT-QTY            PIC  S9(9)V9(2) COMP-3.             
189300     10 WS-AUCNTK-WT-KGRM-QTY         PIC  S9(9) COMP.                    
189400     10 WS-AUCNTK-UNT-QTY             PIC  S9(9) COMP.                    
189500     10 WS-AUCNTK-ORGN-SHPD-FR-CDE    PIC   X(3).                         
189600     10 WS-AUCNTK-ORGN-SHPD-TO-CDE    PIC   X(3).                         
189700     10 WS-AUCNTK-EST-LBD-NM          PIC   X(30).                        
189800     10 WS-AUCNTK-EST-LBD-TMST        PIC   X(26).                        
189900     10 WS-AUCNTK-RISU-DO-RSN-CDE     PIC   X(3).                         
190000     10 WS-AUCNTK-BKR-FRGT-RLSE-TMST  PIC   X(26).                        
190100     10 WS-AUCNTK-DO-TO-DCONSLR-TMST  PIC   X(26).                        
190200     10 WS-AUCNTK-DO-RCVD-TMST        PIC   X(26).                        
190300     10 WS-AUCNTK-CONTNR-PU-TMST      PIC   X(26).                        
190400     10 WS-AUCNTK-DAT-SRC-ENT-ID      PIC  S9(9) COMP.                    
190500     10 WS-AUCNTK-LAST-UPD-BY-USR-ID  PIC   X(8).                         
190600     10 WS-AUCNTK-LAST-UPD-TMST       PIC   X(26).                        
190700     10 WS-AUCNTK-AUD-FUNC-CDE        PIC   X(1).                         
190800     10 WS-AUCNTK-AUD-TMST            PIC   X(26).                        
190900     10 WS-AUCNTK-ACTL-POE-DELY-TMST  PIC   X(26).                        
191000     10 WS-AUCNTK-ACTL-DEST-POE-CDE   PIC   X(4).                         
191100     10 WS-AUCNTK-ACTL-LBD-NM         PIC   X(30).                        
191200     10 WS-AUCNTK-ACTL-LBD-TMST       PIC   X(26).                        
191300     10 WS-02-AUCNTK-DVN-TMST         PIC   X(26).                        
191400     10 WS-02-AUCNTK-DCONSLR-SCAC-ID  PIC   X(4).                         
191500     10 WS-02-AUCNTK-SIZE-CDE         PIC   X(5).                         
191600     10 WS-AUCNTK-DCONSLR-RET-TMST    PIC   X(26).                        
191700     10 WS-AUCNTK-MOM-POL-CDE         PIC   X(05).                        
191800     10 WS-AUCNTK-FDR-POL-CDE         PIC   X(05).                        
191900     10 WS-AUCNTK-MOM-POR-CDE         PIC   X(05).                        
192000     10 WS-AUCNTK-FDR-POR-CDE         PIC   X(05).                        
192000     10 WS-AUCNTK-DCONSLR-DELY-TMST   PIC   X(26).                        
192100 01  WS-AUCNTK-KEYS.                                                      
192200     10 DS-AUCNTK-CONTNR-ID           PIC   X(12).                        
192300     10 DS-AUCNTK-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
192400     10 DS-AUCNTK-AUD-TMST            PIC   X(26).                        
192500******************************************************************        
192600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  50     *        
192700******************************************************************        
192800******************************************************************        
192900* COBOL DECLARATION FOR TABLE TAUCNUP                                     
193000******************************************************************        
193100 01  WS-AUCNUP.                                                           
193200     10 WS-AUCNUP-CONTNR-ID           PIC   X(12).                        
193300     10 WS-AUCNUP-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
193400     10 WS-AUCNUP-PO-NBR              PIC  S9(9) COMP.                    
193500     10 WS-AUCNUP-VS-NBR              PIC   X(30).                        
193600     10 WS-AUCNUP-UPC-NBR             PIC  S9(15)V COMP-3.                
193700     10 WS-AUCNUP-PO-LNE-NBR          PIC  S9(9) COMP.                    
193800     10 WS-AUCNUP-UPC-CART-CNT        PIC  S9(9) COMP.                    
193900     10 WS-AUCNUP-UPC-CBMT-QTY        PIC  S9(7)V9(2) COMP-3.             
194000     10 WS-AUCNUP-UPC-WT-KGRM-QTY     PIC  S9(9) COMP.                    
194100     10 WS-AUCNUP-UPC-UNT-QTY         PIC  S9(9) COMP.                    
194200     10 WS-AUCNUP-LAST-UPD-BY-USR-ID  PIC   X(8).                         
194300     10 WS-AUCNUP-LAST-UPD-TMST       PIC   X(26).                        
194400     10 WS-AUCNUP-AUD-FUNC-CDE        PIC   X(1).                         
194500     10 WS-AUCNUP-AUD-TMST            PIC   X(26).                        
194600     10 WS-AUCNUP-SKU-NBR             PIC  S9(8)V COMP-3.                 
194700     10 WS-AUCNUP-ASN-PKGNG-CDE       PIC   X(2).                         
194800 01  WS-AUCNUP-KEYS.                                                      
194900     10 DS-AUCNUP-CONTNR-ID           PIC   X(12).                        
195000     10 DS-AUCNUP-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
195100     10 DS-AUCNUP-PO-NBR              PIC  S9(9) COMP.                    
195200     10 DS-AUCNUP-VS-NBR              PIC   X(20).                        
195300     10 DS-AUCNUP-UPC-NBR             PIC  S9(15)V COMP-3.                
195400     10 DS-AUCNUP-PO-LNE-NBR          PIC  S9(9) COMP.                    
195500     10 DS-AUCNUP-AUD-TMST            PIC   X(26).                        
195600******************************************************************        
195700* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  17     *        
195800******************************************************************        
195900******************************************************************        
196000* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  15     *        
196100******************************************************************        
196200******************************************************************        
196300* COBOL DECLARATION FOR TABLE TAUCNPO                                     
196400******************************************************************        
196500 01  WS-AUCNPO.                                                           
196600     10 WS-AUCNPO-CONTNR-ID           PIC   X(12).                        
196700     10 WS-AUCNPO-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
196800     10 WS-AUCNPO-PO-NBR              PIC  S9(9) COMP.                    
196900     10 WS-AUCNPO-CSTM-ENTR-ID        PIC   X(12).                        
197000     10 WS-AUCNPO-MSTR-BOL-NBR        PIC   X(30).                        
197100     10 WS-AUCNPO-HSE-BOL-NBR         PIC   X(30).                        
197200     10 WS-AUCNPO-LTR-OF-CR-NBR       PIC   X(15).                        
197300     10 WS-AUCNPO-PO-RCVD-DELY-TMST   PIC   X(26).                        
197400     10 WS-AUCNPO-PO-C-O-PROD-CDE     PIC   X(3).                         
197500     10 WS-AUCNPO-PO-CART-CNT         PIC  S9(4) COMP.                    
197600     10 WS-AUCNPO-PO-CBMT-QTY         PIC  S9(7)V9(2) COMP-3.             
197700     10 WS-AUCNPO-PO-WT-KGRM-QTY      PIC  S9(9) COMP.                    
197800     10 WS-AUCNPO-PO-UNT-QTY          PIC  S9(9) COMP.                    
197900     10 WS-AUCNPO-LAST-UPD-BY-USR-ID  PIC   X(8).                         
198000     10 WS-AUCNPO-LAST-UPD-TMST       PIC   X(26).                        
198100     10 WS-AUCNPO-AUD-FUNC-CDE        PIC   X(1).                         
198200     10 WS-AUCNPO-AUD-TMST            PIC   X(26).                        
198300     10 WS-AUCNPO-EXTL-REF-NBR        PIC   X(15).                        
198400     10 WS-AUCNPO-BKR-FRGT-RLSE-CDE   PIC   X(1).                         
198500     10 WS-AUCNPO-DO-RCVD-CDE         PIC   X(1).                         
198600     10 WS-AUCNPO-CONTNR-PU-CDE       PIC   X(1).                         
198700     10 WS-AUCNPO-ACTL-POE-DELY-CDE   PIC   X(1).                         
198800     10 WS-AUCNPO-DVN-CDE             PIC   X(1).                         
198900     10 WS-AUCNPO-DCONSLR-RET-CDE     PIC   X(1).                         
199000     10 WS-AUCNPO-SPLT-XMIT-CDE       PIC   X(1).                         
199100     10 WS-AUCNPO-DOC-RCVD-ORGN-TMST  PIC   X(26).                        
199100     10 WS-AUCNPO-DCONSLR-DELY-CDE    PIC   X(1).                         
199200 01  WS-AUCNPO-KEYS.                                                      
199300     10 DS-AUCNPO-CONTNR-ID           PIC   X(12).                        
199400     10 DS-AUCNPO-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
199500     10 DS-AUCNPO-PO-NBR              PIC  S9(9) COMP.                    
199600     10 DS-AUCNPO-AUD-TMST            PIC   X(26).                        
199700******************************************************************        
199800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  27     *        
199900******************************************************************        
200000******************************************************************        
200100* COBOL DECLARATION FOR TABLE TAUSHIP                                     
200200******************************************************************        
200300 01  WS-AUSHIP.                                                           
200400     10 WS-AUSHIP-TRIP-ID             PIC  S9(9) COMP.                    
200500     10 WS-AUSHIP-TRIP-ID-NN          PIC  S9(4) COMP.                    
200600     10 WS-AUSHIP-SHIPT-ID            PIC  S9(9) COMP.                    
200700     10 WS-AUSHIP-CRT-SRC-CDE         PIC   X(2).                         
200800     10 WS-AUSHIP-LAST-UPD-DTE        PIC   X(10).                        
200900     10 WS-AUSHIP-LAST-UPD-TME        PIC   X(8).                         
201000     10 WS-AUSHIP-LAST-UPD-UID        PIC   X(8).                         
201100     10 WS-AUSHIP-PRO-SCAC-ID         PIC   X(4).                         
201200     10 WS-AUSHIP-PRO-NBR             PIC   X(22).                        
201300     10 WS-AUSHIP-BOL-NBR             PIC   X(30).                        
201400     10 WS-AUSHIP-SHIPPER-NME         PIC   X(20).                        
201500     10 WS-AUSHIP-SHIPT-TYP-CDE       PIC  S9(4) COMP.                    
201600     10 WS-AUSHIP-EXPTED-GRO-WGHT     PIC  S9(9) COMP.                    
201700     10 WS-AUSHIP-PKG-TYP-CDE         PIC   X(3).                         
201800     10 WS-AUSHIP-EXPTED-PKG-QTY      PIC  S9(9) COMP.                    
201900     10 WS-AUSHIP-FRGT-CHG-AMT        PIC  S9(5)V9(2) COMP-3.             
202000     10 WS-AUSHIP-FRGT-TERMS-CDE      PIC   X(1).                         
202100     10 WS-AUSHIP-EST-AR-TMST         PIC   X(26).                        
202200     10 WS-AUSHIP-EST-AR-TMST-NN      PIC  S9(4) COMP.                    
202300     10 WS-AUSHIP-VEND-SHIP-DTE       PIC   X(10).                        
202400     10 WS-AUSHIP-EXPTED-PLT-QTY      PIC  S9(9) COMP.                    
202500     10 WS-AUSHIP-ORIG-SCAC-ID        PIC   X(4).                         
202600     10 WS-AUSHIP-LAST-UPD-PGM-ID     PIC   X(8).                         
202700     10 WS-AUSHIP-CRE-USER-ID         PIC   X(8).                         
202800     10 WS-AUSHIP-CARR-CART-CT        PIC  S9(9) COMP.                    
202900     10 WS-AUSHIP-CARR-LAST-UPD-DTE   PIC   X(10).                        
203000     10 WS-AUSHIP-CARR-LAST-UPD-TIME  PIC   X(8).                         
203100     10 WS-AUSHIP-VEND-CART-CT        PIC  S9(9) COMP.                    
203200     10 WS-AUSHIP-VEND-LAST-UPD-DTE   PIC   X(10).                        
203300     10 WS-AUSHIP-VEND-LAST-UPD-TIME  PIC   X(8).                         
203400     10 WS-AUSHIP-VEH-NBR             PIC   X(10).                        
203500     10 WS-AUSHIP-AUTH-NBR            PIC   X(7).                         
203600     10 WS-AUSHIP-AUTH-DTE            PIC   X(10).                        
203700     10 WS-AUSHIP-CONFIRM-DTE         PIC   X(10).                        
203800     10 WS-AUSHIP-CONFIRM-TIME        PIC   X(8).                         
203900     10 WS-AUSHIP-AUD-STATUS-CDE      PIC   X(2).                         
204000     10 WS-AUSHIP-PROCESSED-DTE       PIC   X(10).                        
204100     10 WS-AUSHIP-INVC-NBR            PIC   X(15).                        
059000     10 WS-AUSHIP-CARR-AUTH-ID        PIC   X(30).                        
204200 01  WS-AUSHIP-KEYS.                                                      
204300     10 DS-AUSHIP-SHIPT-ID            PIC  S9(9) COMP.                    
204400     10 DS-AUSHIP-LAST-UPD-DTE        PIC   X(10).                        
204500     10 DS-AUSHIP-LAST-UPD-TME        PIC   X(8).                         
204600******************************************************************        
204700* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  36     *        
204800******************************************************************        
204900******************************************************************        
205000* COBOL DECLARATION FOR TABLE TAUSHPO                                     
205100******************************************************************        
205200 01  WS-AUSHPO.                                                           
205300     10 WS-AUSHPO-SHIPT-ID            PIC  S9(9) COMP.                    
205400     10 WS-AUSHPO-PO-NBR              PIC  S9(9) COMP.                    
205500     10 WS-AUSHPO-REC-SEQ-NBR         PIC  S9(9) COMP.                    
205600     10 WS-AUSHPO-EXPTED-CART-CNT     PIC  S9(4) COMP.                    
205700     10 WS-AUSHPO-ACTL-CART-CNT       PIC  S9(4) COMP.                    
205800     10 WS-AUSHPO-DMG-CART-CNT        PIC  S9(4) COMP.                    
205900     10 WS-AUSHPO-PKSL-IND            PIC   X(1).                         
206000     10 WS-AUSHPO-VEND-NAME           PIC   X(30).                        
206100     10 WS-AUSHPO-FRGT-CHG-AMT        PIC  S9(7)V9(2) COMP-3.             
206200     10 WS-AUSHPO-LAST-UPD-PGM-ID     PIC   X(8).                         
206300     10 WS-AUSHPO-CRE-USER-ID         PIC   X(8).                         
206400     10 WS-AUSHPO-CARR-CART-CT        PIC  S9(9) COMP.                    
206500     10 WS-AUSHPO-CARR-LAST-UPD-DTE   PIC   X(10).                        
206600     10 WS-AUSHPO-CARR-LAST-UPD-TIME  PIC   X(8).                         
206700     10 WS-AUSHPO-VEND-CART-CT        PIC  S9(9) COMP.                    
206800     10 WS-AUSHPO-VEND-LAST-UPD-DTE   PIC   X(10).                        
206900     10 WS-AUSHPO-VEND-LAST-UPD-TIME  PIC   X(8).                         
207000     10 WS-AUSHPO-CRE-TMST            PIC   X(26).                        
207100     10 WS-AUSHPO-LAST-UPD-DTE        PIC   X(10).                        
207200     10 WS-AUSHPO-LAST-UPD-TIME       PIC   X(8).                         
207300     10 WS-AUSHPO-LAST-UPD-USER-ID    PIC   X(8).                         
207400     10 WS-AUSHPO-PRIM-SHIPT-IND      PIC   X(1).                         
207500     10 WS-AUSHPO-SPLT-XMIT-IND       PIC   X(1).                         
207600     10 WS-AUSHPO-SPLT-XMIT-DTE       PIC   X(10).                        
207700     10 WS-AUSHPO-SPLT-XMIT-TM        PIC   X(8).                         
207800     10 WS-AUSHPO-TRN-CDE             PIC   X(1).                         
207900 01  WS-AUSHPO-KEYS.                                                      
208000     10 DS-AUSHPO-SHIPT-ID            PIC  S9(9) COMP.                    
208100     10 DS-AUSHPO-PO-NBR              PIC  S9(9) COMP.                    
208200     10 DS-AUSHPO-CRE-TMST            PIC   X(26).                        
208300******************************************************************        
208400* COBOL DECLARATION FOR TABLE TAUVHCL                                     
208500******************************************************************        
208600 01  WS-AUVHCL.                                                           
208700     10 WS-AUVHCL-OWNER-SCAC-ID       PIC   X(4).                         
208800     10 WS-AUVHCL-VEH-NBR             PIC   X(10).                        
208900     10 WS-AUVHCL-CRT-SRC-CDE         PIC   X(2).                         
209000     10 WS-AUVHCL-LAST-UPD-DTE        PIC   X(10).                        
209100     10 WS-AUVHCL-LAST-UPD-TME        PIC   X(8).                         
209200     10 WS-AUVHCL-LAST-UPD-UID        PIC   X(8).                         
209300     10 WS-AUVHCL-USAGE-CDE           PIC   X(3).                         
209400     10 WS-AUVHCL-VEH-TYP-CDE         PIC   X(2).                         
209500     10 WS-AUVHCL-CURR-STATUS-CDE     PIC   X(2).                         
209600     10 WS-AUVHCL-CURR-STATUS-DTE     PIC   X(10).                        
209700     10 WS-AUVHCL-CURR-STATUS-TME     PIC   X(8).                         
209800     10 WS-AUVHCL-CURR-OPER-UNT-ID    PIC  S9(4) COMP.                    
209900     10 WS-AUVHCL-CURR-FCLTY-ID       PIC  S9(4) COMP.                    
210000     10 WS-AUVHCL-CURR-FAC-AREA-ID    PIC   X(6).                         
210100     10 WS-AUVHCL-CURR-LOC-DTE        PIC   X(10).                        
210200     10 WS-AUVHCL-CURR-LOC-TME        PIC   X(8).                         
210300     10 WS-AUVHCL-CURR-TRIP-ID        PIC  S9(9) COMP.                    
210400     10 WS-AUVHCL-CURR-TRIP-ID-NN     PIC  S9(4) COMP.                    
210500     10 WS-AUVHCL-VEH-SIZE-CDE        PIC   X(2).                         
210600 01  WS-AUVHCL-KEYS.                                                      
210700     10 DS-AUVHCL-OWNER-SCAC-ID       PIC   X(4).                         
210800     10 DS-AUVHCL-VEH-NBR             PIC   X(10).                        
210900     10 DS-AUVHCL-LAST-UPD-DTE        PIC   X(10).                        
211000     10 DS-AUVHCL-LAST-UPD-TME        PIC   X(8).                         
211100******************************************************************        
211200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  18     *        
211300******************************************************************        
211400******************************************************************        
211500* COBOL DECLARATION FOR TABLE TELCPO                                      
211600******************************************************************        
211700 01  WS-ELCPO.                                                            
211800     10 WS-ELCPO-PO-NBR                PIC  S9(9) COMP.                   
211900     10 WS-ELCPO-DEPT-NBR              PIC   X(3).                        
212000     10 WS-ELCPO-FOB-CDE               PIC   X(3).                        
212100     10 WS-ELCPO-OTB-PER-NBR           PIC   X(6).                        
212200     10 WS-ELCPO-IMPRT-TYP-CDE         PIC   X(3).                        
212300     10 WS-ELCPO-STRT-FCTRY-DTE        PIC   X(10).                       
212400     10 WS-ELCPO-LAST-FCTRY-DTE        PIC   X(10).                       
212500     10 WS-ELCPO-TRIP-STRT-DTE         PIC   X(10).                       
212600     10 WS-ELCPO-CRE-TMST              PIC   X(26).                       
212700     10 WS-ELCPO-LAST-UPD-TMST         PIC   X(26).                       
212800 01  WS-ELCPO-KEYS.                                                       
212900     10 DS-ELCPO-PO-NBR                  PIC  S9(9) COMP.                 
213000******************************************************************        
213100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  10     *        
213200******************************************************************        
213300******************************************************************        
213400* COBOL DECLARATION FOR TABLE TELCVS                                      
213500******************************************************************        
213600 01  WS-ELCVS.                                                            
213700     10 WS-ELCVS-PO-NBR                  PIC  S9(9) COMP.                 
213800     10 WS-ELCVS-VND-STYL-NM             PIC   X(20).                     
213900     10 WS-ELCVS-VND-OUTR-PK-QTY         PIC  S9(5)V COMP-3.              
214000     10 WS-ELCVS-UNT-PER-CBMT-QTY        PIC  S9(9) COMP.                 
214100     10 WS-ELCVS-UNT-QTY                 PIC  S9(9) COMP.                 
214200     10 WS-ELCVS-LAST-UPD-TMST           PIC   X(26).                     
214300 01  WS-ELCVS-KEYS.                                                       
214400     10 DS-ELCVS-PO-NBR                  PIC  S9(9) COMP.                 
214500     10 DS-ELCVS-VND-STYL-NM             PIC   X(20).                     
214600******************************************************************        
214700* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   6     *        
214800******************************************************************        
214900******************************************************************        
215000* COBOL DECLARATION FOR TABLE TVSCPT                                      
215100******************************************************************        
215200 01  WS-VSCPT.                                                            
215300     10 WS-VSCPT-PO-NBR                  PIC  S9(9) COMP.                 
215400     10 WS-VSCPT-VND-STYL-NM             PIC   X(20).                     
215500     10 WS-VSCPT-CST-CPT-CDE             PIC   X(3).                      
215600     10 WS-VSCPT-ALW-CHRG-CDE            PIC   X(3).                      
215700     10 WS-VSCPT-CPT-CHRG-AMT            PIC  S9(7)V9(3) COMP-3.          
215800     10 WS-VSCPT-INCL-IN-ELC-IND         PIC   X(1).                      
215900     10 WS-VSCPT-LAST-UPD-TMST           PIC   X(26).                     
216000 01  WS-VSCPT-KEYS.                                                       
216100     10 DS-VSCPT-PO-NBR                  PIC  S9(9) COMP.                 
216200     10 DS-VSCPT-VND-STYL-NM             PIC   X(20).                     
216300     10 DS-VSCPT-CST-CPT-CDE             PIC   X(3).                      
216400******************************************************************        
216500* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *        
216600******************************************************************        
216700*****************************************************************         
216800* COBOL DECLARATION FOR TABLE TUPC - CURRENT VERSION                      
216900*****************************************************************         
217000 01  WS-UPC.                                                              
217100     10 WS-UPC-UPC-ID                 PIC  S9(9) COMP.                    
217200     10 WS-UPC-UPC-NBR                PIC  S9(15)V COMP-3.                
217300     10 WS-UPC-SUB-CL-MDSEAR-ID       PIC  S9(6)V COMP-3.                 
217400     10 WS-UPC-VS-ID                  PIC  S9(9) COMP.                    
217500     10 WS-UPC-INTR-UPC-ID            PIC  S9(9) COMP.                    
217600     10 WS-UPC-UPC-TYP-CDE            PIC   X(1).                         
217700     10 WS-UPC-EFF-BEG-DTE            PIC   X(10).                        
217800     10 WS-UPC-EFF-END-DTE            PIC   X(10).                        
217900     10 WS-UPC-EFF-END-DTE-NN         PIC  S9(4) COMP.                    
218000     10 WS-UPC-KOHLS-SIZE-CDE         PIC  S9(9) COMP.                    
218100     10 WS-UPC-NRF-SIZE-IND           PIC   X(1).                         
218200     10 WS-UPC-NRF-CLOR-CDE           PIC   X(3).                         
218300     10 WS-UPC-NRF-CLOR-IND           PIC   X(1).                         
218400     10 WS-UPC-CSTM-CLOR-DESC         PIC   X(10).                        
218500     10 WS-UPC-EDI-ORD-IND            PIC   X(1).                         
218600     10 WS-UPC-PREPK-IND              PIC   X(1).                         
218700     10 WS-UPC-GP-CDE                 PIC   X(3).                         
218800     10 WS-UPC-CERTD-IND              PIC   X(1).                         
218900     10 WS-UPC-CERTD-DTE              PIC   X(10).                        
219000     10 WS-UPC-RPLNMT-IND             PIC   X(1).                         
219100     10 WS-UPC-KY-ITM-IND             PIC   X(1).                         
219200     10 WS-UPC-UNT-COST-1ST-AMT       PIC  S9(7)V9(3) COMP-3.             
219300     10 WS-UPC-UPC-SRC-CDE            PIC   X(1).                         
219400     10 WS-UPC-INNR-PK-QTY            PIC  S9(4) COMP.                    
219500     10 WS-UPC-OUTR-PK-QTY            PIC  S9(4) COMP.                    
219600     10 WS-UPC-SEA-SEQ-NBR            PIC  S9(4) COMP.                    
219700     10 WS-UPC-MDSE-TYP-SEQ-NBR       PIC  S9(4) COMP.                    
219800     10 WS-UPC-PATRN-SEQ-NBR          PIC  S9(4) COMP.                    
219900     10 WS-UPC-TRND-SEQ-NBR           PIC  S9(4) COMP.                    
220000     10 WS-UPC-FBRCN-SEQ-NBR          PIC  S9(4) COMP.                    
220100     10 WS-UPC-FNSH-SEQ-NBR           PIC  S9(4) COMP.                    
220200     10 WS-UPC-CRE-BY-USR-ID          PIC   X(8).                         
220300     10 WS-UPC-LAST-UPD-BY-USR-ID     PIC   X(8).                         
220400     10 WS-UPC-LAST-UPD-TMST          PIC   X(26).                        
220500     10 WS-UPC-WD-UM-QTY              PIC  S9(4)V9(3) COMP-3.             
220600     10 WS-UPC-DPTH-UM-QTY            PIC  S9(4)V9(3) COMP-3.             
220700     10 WS-UPC-HT-UM-QTY              PIC  S9(4)V9(3) COMP-3.             
220800     10 WS-UPC-SIZE-UM-CDE            PIC   X(2).                         
220900     10 WS-UPC-WT-UM-QTY              PIC  S9(5)V9(3) COMP-3.             
221000     10 WS-UPC-WT-UM-CDE              PIC   X(2).                         
221100     10 WS-UPC-POG-IND                PIC   X(1).                         
221200     10 WS-UPC-REGN-PRIC-IND          PIC   X(1).                         
221300     10 WS-UPC-TX-PRD-CDE-SEQ-NBR     PIC  S9(4) COMP.                    
221400     10 WS-UPC-CUSTFACG-CLOR-DESC     PIC   X(22).                        
221500     10 WS-UPC-INTR-UPC-DESC          PIC   X(30).                        
221600     10 WS-UPC-TRNSTN-IND             PIC   X(1).                         
221700     10 WS-UPC-PO-SHRT-CYC-IND        PIC   X(1).                         
           10 WS-UPC-TST-PRD-TYP-SEQ-NBR    PIC  S9(4) COMP.                    
           10 WS-UPC-WHSE-RPLNT-IND         PIC   X(1).                         
221800 01  WS-UPC-KEYS.                                                         
221900     10 DS-UPC-UPC-ID                 PIC  S9(9) COMP.                    
222000*****************************************************************         
222100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  40              
222200*****************************************************************         
222300******************************************************************        
222400* COBOL DECLARATION FOR TABLE TPOUPC                                      
222500******************************************************************        
222600*01  WS-POUPC.                                                            
222700*    10 WS-POUPC-PO-NBR                  PIC  S9(9) COMP.                 
222800*    10 WS-POUPC-PO-LNE-NBR              PIC  S9(9) COMP.                 
222900*    10 WS-POUPC-UPC-ID                  PIC  S9(9) COMP.                 
223000*    10 WS-POUPC-UPC-QTY                 PIC  S9(9) COMP.                 
223100*    10 WS-POUPC-UPC-RATO-QTY-NBR        PIC  S9(4) COMP.                 
223200*    10 WS-POUPC-LAST-UPD-TMST           PIC   X(26).                     
223300*    10 WS-POUPC-LAST-UPD-USR-ID         PIC   X(8).                      
223400*01  WS-POUPC-KEYS.                                                       
223500*    10 DS-POUPC-PO-NBR                  PIC  S9(9) COMP.                 
223600*    10 DS-POUPC-PO-LNE-NBR              PIC  S9(9) COMP.                 
223700*    10 DS-POUPC-UPC-ID                  PIC  S9(9) COMP.                 
223800******************************************************************        
223900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *        
224000******************************************************************        
224100******************************************************************        
224200* COBOL DECLARATION FOR TABLE TALLTMP                                     
224300******************************************************************        
224400 01  WS-ALLTMP.                                                           
224500     10 WS-ALLTMP-PO-NBR                 PIC  S9(9) COMP.                 
224600     10 WS-ALLTMP-DEST-NBR               PIC  S9(4) COMP.                 
224700     10 WS-ALLTMP-DEST-PCT               PIC  S9(4) COMP.                 
224800 01  WS-ALLTMP-KEYS.                                                      
224900     10 DS-ALLTMP-PO-NBR                 PIC  S9(9) COMP.                 
225000     10 DS-ALLTMP-DEST-NBR               PIC  S9(4) COMP.                 
225100******************************************************************        
225200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   3     *        
225300******************************************************************        
225400******************************************************************        
225500* COBOL DECLARATION FOR TABLE TVNDAGR                                     
225600******************************************************************        
225700 01  WS-VNDAGR.                                                           
225800     05  WS-VNDAGR-DATA.                                                  
225900         10 WS-VNDAGR-ENT-ID              PIC  S9(9) COMP.                
226000         10 WS-VNDAGR-DEPT-NBR            PIC   X(3).                     
226100         10 WS-VNDAGR-AGRMT-TYP-ID        PIC   X(1).                     
226200         10 WS-VNDAGR-SEQ-NBR             PIC  S9(4) COMP.                
226300         10 WS-VNDAGR-TYP-CDE             PIC  S9(4) COMP.                
226400         10 WS-VNDAGR-EFFECTIVE-DATE      PIC   X(10).                    
226500         10 WS-VNDAGR-EXPIRATION-DATE     PIC   X(10).                    
226600         10 WS-VNDAGR-PROD-STATUS-IND     PIC   X(1).                     
226700         10 WS-VNDAGR-LEADTIME-DAYS-QTY   PIC  S9(4) COMP.                
226800         10 WS-VNDAGR-BULK-STK-TKT-IND    PIC   X(1).                     
226900         10 WS-VNDAGR-TKT-MKR-IND         PIC   X(1).                     
227000         10 WS-VNDAGR-RTV-RA-REQD-IND     PIC   X(1).                     
227100         10 WS-VNDAGR-RTV-NO-RA-REQD-IND  PIC   X(1).                     
227200         10 WS-VNDAGR-DEBIT-DESTROY-IND   PIC   X(1).                     
227300         10 WS-VNDAGR-MARKOUT-IND         PIC   X(1).                     
227400         10 WS-VNDAGR-EARLY-SHIPT-IND     PIC   X(1).                     
227500         10 WS-VNDAGR-LATE-SHIPT-IND      PIC   X(1).                     
227600         10 WS-VNDAGR-PARTIAL-SHIPT-IND   PIC   X(1).                     
227700         10 WS-VNDAGR-FOB-POINT-TXT       PIC   X(20).                    
227800         10 WS-VNDAGR-SHIPT-POINT-TXT     PIC   X(20).                    
227900         10 WS-VNDAGR-DISCOUNT-PCT        PIC  SV9(4) COMP-3.             
228000         10 WS-VNDAGR-EXT-PAY-DAYS-QTY    PIC  S9(4) COMP.                
228100         10 WS-VNDAGR-PAYT-TERM-ID        PIC  S9(4) COMP.                
228200         10 WS-VNDAGR-LAST-UPD-TMST       PIC   X(26).                    
228300         10 WS-VNDAGR-LAST-UPD-ID         PIC   X(8).                     
228400         10 WS-VNDAGR-PARTIAL-IND         PIC   X(1).                     
228500         10 WS-VNDAGR-FRGT-TERM-ID        PIC  S9(4) COMP.                
228600         10 WS-VNDAGR-AP-TRN-CDE          PIC   X(2).                     
228700         10 WS-VNDAGR-VND-AUTH-ID         PIC   X(10).                    
228800         10 WS-VNDAGR-PSTG-FRQ-CDE        PIC   X(2).                     
228900         10 WS-VNDAGR-DED-DISC-IND        PIC   X(1).                     
229000         10 WS-VNDAGR-DED-RTV-IND         PIC   X(1).                     
229100     05  WS-VNDAGR-NULL.                                                  
229200*        10 WS-VNDAGR-NULLS OCCURS 36 TIMES PIC S9(4) COMP.               
229300*        10 WS-VNDAGR-NULLS OCCURS 37 TIMES PIC S9(4) COMP.               
229400         10 WS-VNDAGR-NULLS OCCURS 32 TIMES PIC S9(4) COMP.               
229500 01  WS-VNDAGR-KEYS.                                                      
229600     10 DS-VNDAGR-ENT-ID              PIC  S9(9) COMP.                    
229700     10 DS-VNDAGR-DEPT-NBR            PIC   X(3).                         
229800     10 DS-VNDAGR-AGRMT-TYP-ID        PIC   X(1).                         
229900     10 DS-VNDAGR-SEQ-NBR             PIC  S9(4) COMP.                    
230000******************************************************************        
230100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  36     *        
230200******************************************************************        
230300******************************************************************        
230400* COBOL DECLARATION FOR TABLE TPAYREQ                                     
230500******************************************************************        
230600 01  WS-PAYREQ.                                                           
230700     05  WS-PAYREQ-DATA.                                                  
230800         10 WS-PAYREQ-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.                
230900         10 WS-PAYREQ-PAYT-REQ-TYP-CDE    PIC   X(2).                     
231000         10 WS-PAYREQ-REMIT-TO-DUN-NBR    PIC   X(9).                     
231100         10 WS-PAYREQ-ENTR-UID            PIC   X(8).                     
231200         10 WS-PAYREQ-ENTR-DTE            PIC   X(10).                    
231300         10 WS-PAYREQ-ENTR-TRMNL-ID       PIC   X(4).                     
231400         10 WS-PAYREQ-PO-NBR              PIC  S9(9) COMP.                
231500         10 WS-PAYREQ-VER-NBR             PIC  S9(9) COMP.                
231600     05 WS-PAYREQ-NULL.                                                   
231700        10 WS-PAYREQ-NULLS OCCURS 8 TIMES PIC S9(4) COMP.                 
231800 01  WS-PAYREQ-KEYS.                                                      
231900     10 DS-PAYREQ-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.                    
232000******************************************************************        
232100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   8     *        
232200******************************************************************        
232300******************************************************************        
232400* COBOL DECLARATION FOR TABLE TINVOIC                                     
232500******************************************************************        
232600 01  WS-INVOIC.                                                           
232700     05  WS-INVOIC-DATA.                                                  
232800         10 WS-INVOIC-PO-NBR              PIC  S9(9) COMP.                
232900         10 WS-INVOIC-INVC-ID             PIC   X(22).                    
233000         10 WS-INVOIC-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.                
233100         10 WS-INVOIC-INVC-TYP-CDE        PIC   X(2).                     
233200         10 WS-INVOIC-ENTR-MTHD-CDE       PIC   X(2).                     
233300         10 WS-INVOIC-CRE-BY-USR-ID       PIC   X(8).                     
233400         10 WS-INVOIC-BAR-CDE             PIC   X(9).                     
233500         10 WS-INVOIC-SPLIT-TERMS-IND     PIC   X(1).                     
233600         10 WS-INVOIC-DTL-ENTR-IND        PIC   X(1).                     
233700         10 WS-INVOIC-INVC-CART-CT        PIC  S9(4) COMP.                
233800         10 WS-INVOIC-CRE-DTE             PIC   X(10).                    
233900         10 WS-INVOIC-PPD-RVRSL-IND       PIC   X(1).                     
234000         10 WS-INVOIC-INVC-DTE            PIC   X(10).                    
234100         10 WS-INVOIC-GRO-COST-AMT        PIC  S9(8)V9(2) COMP-3.         
234200         10 WS-INVOIC-INVC-NET-COST-AMT   PIC  S9(8)V9(2) COMP-3.         
234300         10 WS-INVOIC-RMIT-VND-ID         PIC   X(9).                     
234400         10 WS-INVOIC-STR-NBR             PIC  S9(4) COMP.                
234500         10 WS-INVOIC-HOLD-IND            PIC   X(1).                     
234600         10 WS-INVOIC-DUE-DTE-SRC-CDE     PIC   X(1).                     
234700         10 WS-INVOIC-CALC-DUE-DTE        PIC   X(10).                    
234800         10 WS-INVOIC-PAYT-DTE            PIC   X(10).                    
234900         10 WS-INVOIC-AP-PRC-DTE          PIC   X(10).                    
235000         10 WS-INVOIC-AP-PRC-CDE          PIC   X(1).                     
235100         10 WS-INVOIC-PAYT-RLSE-TMST      PIC   X(26).                    
235200         10 WS-INVOIC-STATUS-CDE          PIC   X(2).                     
235300         10 WS-INVOIC-STATUS-CHG-TMST     PIC   X(26).                    
235400     05  WS-INVOIC-NULL.                                                  
235500         10 WS-INVOIC-NULLS OCCURS 22 TIMES PIC S9(4) COMP.               
235600 01  WS-INVOIC-KEYS.                                                      
235700     10 DS-INVOIC-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.                    
235800******************************************************************        
235900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  22     *        
236000******************************************************************        
236100******************************************************************        
236200* COBOL DECLARATION FOR TABLE TALCHRG                                     
236300******************************************************************        
236400 01  WS-ALCHRG.                                                           
236500*    10 WS-ALCHRG-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.                    
236600     10 WS-ALCHRG-PO-NBR              PIC  S9(9) COMP.                    
236700     10 WS-ALCHRG-INVC-ID             PIC   X(22).                        
236800     10 WS-ALCHRG-ALW-CHRG-SEQ-NBR    PIC  S9(4) COMP.                    
236900     10 WS-ALCHRG-ALW-CHRG-TYP-CDE    PIC   X(1).                         
237000     10 WS-ALCHRG-ALW-CHRG-CDE        PIC   X(3).                         
237100     10 WS-ALCHRG-ALW-CHRG-SER-CDE    PIC   X(10).                        
237200     10 WS-ALCHRG-ALW-CHRG-PCT        PIC  SV9(4) COMP-3.                 
237300     10 WS-ALCHRG-ALW-CHRG-AMT        PIC  S9(8)V9(2) COMP-3.             
237400 01  WS-ALCHRG-KEYS.                                                      
237500     10 DS-ALCHRG-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.                    
237600     10 DS-ALCHRG-ALW-CHRG-SEQ-NBR    PIC  S9(4) COMP.                    
237700******************************************************************        
237800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *        
237900******************************************************************        
238000******************************************************************        
238100* COBOL DECLARATION FOR TABLE TPREQIT                                     
238200******************************************************************        
238300 01  WS-PREQIT.                                                           
238400     10 WS-PREQIT-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.                    
238500     10 WS-PREQIT-PAYT-REQ-LNE-NBR    PIC  S9(9) COMP.                    
238600     10 WS-PREQIT-PAY-REQ-LNE-QTY     PIC  S9(9) COMP.                    
238700     10 WS-PREQIT-QTY-UNT-OF-MSMT     PIC   X(2).                         
238800     10 WS-PREQIT-UNT-COST-AMT        PIC  S9(7)V9(3) COMP-3.             
238900 01  WS-PREQIT-KEYS.                                                      
239000     10 DS-PREQIT-PAYT-REQ-SEQ-NBR    PIC  S9(9) COMP.                    
239100     10 DS-PREQIT-PAYT-REQ-LNE-NBR    PIC  S9(9) COMP.                    
239200******************************************************************        
239300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   5     *        
239400******************************************************************        
239500******************************************************************        
239600* COBOL DECLARATION FOR TABLE TASNDTL                                     
239700******************************************************************        
239800 01  WS-ASNDTL.                                                           
239900     05  WS-ASNDTL-DATA.                                                  
240000         10 WS-ASNDTL-ASNHDR-ID           PIC  S9(9) COMP.                
240100         10 WS-ASNDTL-ASNDTL-NBR          PIC  S9(7)V COMP-3.             
240200         10 WS-ASNDTL-PO-NBR              PIC   X(22).                    
240300         10 WS-ASNDTL-SELR-INV-NBR        PIC   X(30).                    
240400         10 WS-ASNDTL-SEQ-NBR             PIC  S9(3)V COMP-3.             
240500         10 WS-ASNDTL-UPC-NBR             PIC  S9(15)V COMP-3.            
240600         10 WS-ASNDTL-ALT-PROD1-CDE       PIC   X(2).                     
240700         10 WS-ASNDTL-ALT-PROD1-ID        PIC   X(30).                    
240800         10 WS-ASNDTL-ALT-PROD2-CDE       PIC   X(2).                     
240900         10 WS-ASNDTL-ALT-PROD2-ID        PIC   X(30).                    
241000         10 WS-ASNDTL-SHIPT-QTY           PIC  S9(7)V COMP-3.             
241100         10 WS-ASNDTL-SHIPT-DTE-QTY       PIC  S9(7)V COMP-3.             
241200         10 WS-ASNDTL-SHIPT-UM-CDE        PIC   X(2).                     
241300         10 WS-ASNDTL-ITM-STATUS-CDE      PIC   X(2).                     
241400         10 WS-ASNDTL-ITM-ERR-CDE         PIC   X(1).                     
241500         10 WS-ASNDTL-ITM-ERR-QTY         PIC  S9(7)V COMP-3.             
241600         10 WS-ASNDTL-ITM-ERR-QTY-UM-CDE  PIC   X(2).                     
241700         10 WS-ASNDTL-PKG-QTY             PIC  S9(7)V COMP-3.             
241800         10 WS-ASNDTL-PKG-QTY-UM-CDE      PIC   X(2).                     
241900         10 WS-ASNDTL-VEND-ORD-QTY        PIC  S9(7)V COMP-3.             
242000         10 WS-ASNDTL-ORD-QTY-UM-CDE      PIC   X(2).                     
242100         10 WS-ASNDTL-WGT-MSMT            PIC  S9(9)V9(2) COMP-3.         
242200         10 WS-ASNDTL-VOL-MSMT            PIC  S9(9)V9(2) COMP-3.         
242300         10 WS-ASNDTL-VOL-UM-CDE          PIC   X(2).                     
242400         10 WS-ASNDTL-LEN-MSMT            PIC  S9(9)V9(2) COMP-3.         
242500         10 WS-ASNDTL-HT-MSMT             PIC  S9(9)V9(2) COMP-3.         
242600         10 WS-ASNDTL-WDTH-MSMT           PIC  S9(9)V9(2) COMP-3.         
242700         10 WS-ASNDTL-SIZE-UM-CDE         PIC   X(2).                     
242800         10 WS-ASNDTL-ITM-SUBST-UPC-NBR   PIC   X(12).                    
242900         10 WS-ASNDTL-TKT-ERR-CDE         PIC   X(4).                     
243000         10 WS-ASNDTL-WGT-UM-CDE          PIC   X(2).                     
243100         10 WS-ASNDTL-INPK-EA-QTY         PIC  S9(4) COMP.                
               10 WS-ASNDTL-LOC-NBR             PIC  S9(4) COMP.                
243200     05  WS-ASNDTL-NULL.                                                  
243300         10 WS-ASNDTL-NULLS OCCURS 32 TIMES PIC S9(4) COMP.               
243400 01  WS-ASNDTL-KEYS.                                                      
243500     10 DS-ASNDTL-ASNHDR-ID           PIC  S9(9) COMP.                    
243600     10 DS-ASNDTL-ASNDTL-NBR          PIC  S9(7)V COMP-3.                 
243700******************************************************************        
243800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  32     *        
243900******************************************************************        
244000******************************************************************        
244100* COBOL DECLARATION FOR TABLE TASNORD                            *        
244200******************************************************************        
244300 01  WS-ASNORD.                                                           
244400     05  WS-ASNORD-DATA.                                                  
244500         10 WS-ASNORD-ASNHDR-ID  PIC S9(9) USAGE COMP.                    
244600         10 WS-ASNORD-PO-NBR     PIC X(22).                               
244700         10 WS-ASNORD-SEQ-NBR    PIC S9(3)V USAGE COMP-3.                 
244800         10 WS-ASNORD-SELR-INV-NBR PIC X(30).                             
244900         10 WS-ASNORD-VEND-ORD-NBR PIC X(30).                             
245000         10 WS-ASNORD-CUST-NBR   PIC X(30).                               
245100         10 WS-ASNORD-PROMO-NBR  PIC X(30).                               
245200         10 WS-ASNORD-VEND-NBR   PIC S9(3)V USAGE COMP-3.                 
245300         10 WS-ASNORD-MDSEDP-NBR PIC X(3).                                
245400         10 WS-ASNORD-ORD-STATUS-CDE PIC X(2).                            
245500         10 WS-ASNORD-CHG-ORD-SEQ-NBR PIC X(8).                           
245600         10 WS-ASNORD-PO-DTE     PIC X(10).                               
245700         10 WS-ASNORD-LTE-CHG-AMT PIC S9(6)V9(2) USAGE COMP-3.            
245800         10 WS-ASNORD-EXCH-FCTR  PIC S9(6)V9(5) USAGE COMP-3.             
245900         10 WS-ASNORD-SELR-CUR-CDE PIC X(3).                              
246000         10 WS-ASNORD-MTCH-PO-CDE PIC X(1).                               
246100         10 WS-ASNORD-EARLY-LTE-CDE PIC X(1).                             
246200         10 WS-ASNORD-SEQ-NBR-IND PIC X(1).                               
246300         10 WS-ASNORD-CART-SHIP-QTY PIC S9(9) USAGE COMP.                 
246300         10 WS-ASNORD-LOC-NBR       PIC S9(4) USAGE COMP.                 
246400     05  WS-ASNORD-NULL.                                                  
246500         10 WS-ASNORD-NULLS OCCURS 18 TIMES PIC S9(4) COMP.               
246600 01  WS-ASNORD-KEYS.                                                      
246700     10 DS-ASNORD-ASNHDR-ID     PIC S9(9) USAGE COMP.                     
246800     10 DS-SASNORD-PO-NBR       PIC X(15).                                
246900     10 DS-ASNORD-SEQ-NBR       PIC S9(3)V USAGE COMP-3.                  
247000     10 DS-ASNORD-SELR-INV-NBR  PIC X(30).                                
247100******************************************************************        
247200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 18      *        
247300******************************************************************        
247400******************************************************************        
247500* COBOL DECLARATION FOR TABLE TASNHDR                                     
247600******************************************************************        
247700 01  WS-ASNHDR.                                                           
247800     05  WS-ASNHDR-DATA.                                                  
247900         10 WS-ASNHDR-OPERCO-NBR          PIC   X(2).                     
248000         10 WS-ASNHDR-EDI-VEND-ID         PIC   X(17).                    
248100         10 WS-ASNHDR-ASNHDR-NBR          PIC   X(30).                    
248200         10 WS-ASNHDR-ASNHDR-ID           PIC  S9(9) COMP.                
248300         10 WS-ASNHDR-ASNHDR-TMST         PIC   X(26).                    
248400         10 WS-ASNHDR-CRE-DTE             PIC   X(10).                    
248500         10 WS-ASNHDR-SHIP-DTE            PIC   X(10).                    
248600         10 WS-ASNHDR-BOL-NBR             PIC   X(30).                    
248700         10 WS-ASNHDR-PRO-NBR             PIC   X(30).                    
248800         10 WS-ASNHDR-CART-SHIP-QTY       PIC  S9(7)V COMP-3.             
248900         10 WS-ASNHDR-GRO-WGHT-MSMT       PIC  S9(9)V9(2) COMP-3.         
249000         10 WS-ASNHDR-ANTC-DELY-DTE       PIC   X(10).                    
249100         10 WS-ASNHDR-REC-MTHD-IND        PIC   X(1).                     
249200         10 WS-ASNHDR-SHIPT-STATUS-CDE    PIC   X(2).                     
249300         10 WS-ASNHDR-CARR-NAME           PIC   X(35).                    
249400         10 WS-ASNHDR-TRANS-MTHD-CDE      PIC   X(2).                     
249500         10 WS-ASNHDR-CARR-ID-CDE         PIC   X(17).                    
249600         10 WS-ASNHDR-CARR-ID-QUAL-CDE    PIC   X(2).                     
249700         10 WS-ASNHDR-RTE-SEQ-CDE         PIC   X(2).                     
249800         10 WS-ASNHDR-SHPT-VOL-MSMT       PIC  S9(9)V9(2) COMP-3.         
249900         10 WS-ASNHDR-EQUIP-INIT-CDE      PIC   X(4).                     
250000         10 WS-ASNHDR-EQUIP-NBR           PIC   X(10).                    
250100         10 WS-ASNHDR-SCHD-SHIP-DTE       PIC   X(10).                    
250200         10 WS-ASNHDR-CRE-TM              PIC   X(8).                     
250300         10 WS-ASNHDR-REJ-SHIPT-CDE       PIC   X(1).                     
250400         10 WS-ASNHDR-SHPT-VOL-UM-CDE     PIC   X(2).                     
250500         10 WS-ASNHDR-GRO-WGHT-UM-CDE     PIC   X(2).                     
250600         10 WS-ASNHDR-PRINT-IND           PIC   X(1).                     
250700         10 WS-ASNHDR-SHIP-PAYT-TERM-CDE  PIC   X(2).                     
250800         10 WS-ASNHDR-RESPBL-LOC-CDE      PIC   X(2).                     
250900         10 WS-ASNHDR-RESPBL-LOC-DESC.                                    
251000            49 ASNHDR-RESPBL-LOC-DESC-LEN     PIC S9(4) COMP.             
251100            49 ASNHDR-RESPBL-LOC-DESC-TEXT    PIC X(80).                  
251200         10 WS-ASNHDR-DC-PRT-IND          PIC   X(1).                     
251300         10 WS-ASNHDR-SHIP-TM             PIC   X(8).                     
251400    05  WS-ASNHDR-NULL.                                                   
251500        10 WS-ASNHDR-NULLS OCCURS 33 TIMES PIC S9(4) COMP.                
251600 01  WS-ASNHDR-KEYS.                                                      
251700     10 DS-ASNHDR-ASNHDR-ID           PIC  S9(9) COMP.                    
251800     10 DS-ASNHDR-ASNHDR-TMST         PIC   X(26).                        
251900******************************************************************        
252000* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  33     *        
252100******************************************************************        
252200******************************************************************        
252300* COBOL DECLARATION FOR TABLE TASCRIT                            *        
252400******************************************************************        
252500 01  WS-ASCRIT.                                                           
252600     10 WS-ASCRIT-ASNHDR-ID     PIC S9(9) USAGE COMP.                     
252700     10 WS-ASCRIT-ASNCAR-NBR    PIC X(45).                                
252800     10 WS-ASCRIT-ASNDTL-NBR    PIC S9(7)V USAGE COMP-3.                  
252900 01  WS-ASCRIT-KEYS.                                                      
253000     10 DS-ASCRIT-ASNHDR-ID     PIC S9(9) USAGE COMP.                     
253100     10 DS-ASCRIT-SASNCAR-NBR   PIC X(42).                                
253200     10 DS-ASCRIT-ASNDTL-NBR    PIC S9(7)V USAGE COMP-3.                  
253300******************************************************************        
253400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 3       *        
253500******************************************************************        
253600******************************************************************        
253700* COBOL DECLARATION FOR TABLE TASNCAR                                     
253800******************************************************************        
253900 01  WS-ASNCAR.                                                           
254000     05  WS-ASNCAR-DATA.                                                  
254100         10 WS-ASNCAR-ASNHDR-ID           PIC  S9(9) COMP.                
254200         10 WS-ASNCAR-ASNCAR-NBR          PIC   X(45).                    
254300         10 WS-ASNCAR-PO-NBR              PIC   X(22).                    
254400         10 WS-ASNCAR-SEQ-NBR             PIC  S9(3)V COMP-3.             
254500         10 WS-ASNCAR-SELR-INV-NBR        PIC   X(30).                    
254600         10 WS-ASNCAR-VOL-MSMT            PIC  S9(9)V9(2) COMP-3.         
254700         10 WS-ASNCAR-WGHT-MSMT           PIC  S9(9)V9(2) COMP-3.         
254800         10 WS-ASNCAR-NBR-QUAL-CDE        PIC   X(2).                     
254900         10 WS-ASNCAR-PKG-QTY             PIC  S9(7)V COMP-3.             
255000         10 WS-ASNCAR-PKG-QTY-UM-CDE      PIC   X(2).                     
255100         10 WS-ASNCAR-WGHT-UM-CDE         PIC   X(2).                     
255200         10 WS-ASNCAR-VOL-UM-CDE          PIC   X(2).                     
255300         10 WS-ASNCAR-PKG-CDE             PIC   X(3).                     
255400         10 WS-ASNCAR-LEN-MSMT            PIC  S9(9)V9(2) COMP-3.         
255500         10 WS-ASNCAR-HT-MSMT             PIC  S9(9)V9(2) COMP-3.         
255600         10 WS-ASNCAR-WDTH-MSMT           PIC  S9(9)V9(2) COMP-3.         
255700         10 WS-ASNCAR-SIZE-UM-CDE         PIC   X(2).                     
255800         10 WS-ASNCAR-PKG-SIZE-QTY        PIC  S9(7)V COMP-3.             
255900         10 WS-ASNCAR-INPK-EA-QTY         PIC  S9(4) COMP.                
256000    05  WS-ASNCAR-NULL.                                                   
256100        10 WS-ASNCAR-NULLS OCCURS 19 TIMES PIC S9(4) COMP.                
256200 01  WS-ASNCAR-KEYS.                                                      
256300     10 DS-ASNCAR-ASNHDR-ID           PIC  S9(9) COMP.                    
256400     10 DS-ASNCAR-ASNCAR-NBR          PIC   X(45).                        
256500******************************************************************        
256600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  19     *        
256700******************************************************************        
256800******************************************************************        
256900* COBOL DECLARATION FOR TABLE TDISTHD                                     
257000******************************************************************        
257100 01  WS-DISTHD.                                                           
257200     10 WS-DISTHD-ORD-NBR                PIC  S9(9) COMP.                 
257300     10 WS-DISTHD-RCVR-SEQ-NBR           PIC  S9(9) COMP.                 
257400     10 WS-DISTHD-ORD-LNE-NBR            PIC  S9(9) COMP.                 
257500     10 WS-DISTHD-WRK-ORD-SEQ-NBR        PIC  S9(4) COMP.                 
257600     10 WS-DISTHD-OPER-UNT-ID            PIC  S9(4) COMP.                 
257700     10 WS-DISTHD-DISTRB-PRC-AREA-ID     PIC   X(4).                      
257800     10 WS-DISTHD-PRCG-STAT-CDE          PIC   X(1).                      
257900     10 WS-DISTHD-CRE-TMST               PIC   X(26).                     
258000     10 WS-DISTHD-RSLTS-RCVD-TMST        PIC   X(26).                     
258100     10 WS-DISTHD-VRFD-TMST              PIC   X(26).                     
258200     10 WS-DISTHD-PRC-AREA-MODU-ID       PIC   X(3).                      
258300     10 WS-DISTHD-CRE-USR-ID             PIC   X(8).                      
258400     10 WS-DISTHD-TOT-CART-CNT           PIC  S9(4) COMP.                 
258500     10 WS-DISTHD-CART-DWNLD-DTE         PIC   X(10).                     
258600     10 WS-DISTHD-CART-DWNLD-TM          PIC   X(8).                      
258700     10 WS-DISTHD-CART-DWNLD-USR-ID      PIC   X(8).                      
258800     10 WS-DISTHD-FCSE-CART-CNT          PIC  S9(4) COMP.                 
258900     10 WS-DISTHD-FCSE-LBL-TYP-CDE       PIC   X(1).                      
259000     10 WS-DISTHD-P2L-CART-CNT           PIC  S9(4) COMP.                 
259100     10 WS-DISTHD-INPK-CART-CNT          PIC  S9(4) COMP.                 
259200     10 WS-DISTHD-INPK-UNT-QTY           PIC  S9(4) COMP.                 
259300     10 WS-DISTHD-INPK-CNVYB-IND         PIC   X(1).                      
259400     10 WS-DISTHD-OTPK-UNT-QTY           PIC  S9(4) COMP.                 
259500     10 WS-DISTHD-SYS-CRE-CDE            PIC   X(1).                      
259600     10 WS-DISTHD-SPC-INSTR-DESC         PIC   X(5).                      
259700     10 WS-DISTHD-FCSE-CNFRMN-TMST       PIC   X(26).                     
259800     10 WS-DISTHD-FCSE-CNFRMN-USR-ID     PIC   X(8).                      
259900     10 WS-DISTHD-FCSE-CNFRMN-PGM-ID     PIC   X(8).                      
260000     10 WS-DISTHD-ACTV-IND               PIC   X(1).                      
260100     10 WS-DISTHD-DLT-REQ-SRC-ID         PIC   X(8).                      
260200     10 WS-DISTHD-DLT-REQ-TMST           PIC   X(26).                     
260300     10 WS-DISTHD-DLT-RSLT-CDE           PIC   X(1).                      
260400     10 WS-DISTHD-P2L-SCN-CART-CNT       PIC  S9(4) COMP.                 
260500     10 WS-DISTHD-CRE-LBL-OPT-CDE        PIC   X(1).                      
260600     10 WS-DISTHD-FCSE-FCLTY-AREA-ID     PIC   X(6).                      
260700     10 WS-DISTHD-ODD-CART-UNT-QTY       PIC  S9(4) COMP.                 
260800     10 WS-DISTHD-PREPK-LNE-PRC-CDE      PIC   X(1).                      
260900     10 WS-DISTHD-UCC128-DAT-USG-CDE     PIC   X(1).                      
261000     10 WS-DISTHD-CAL-UNT-PRCD-QTY       PIC  S9(4) COMP.                 
261100 01  WS-DISTHD-KEYS.                                                      
261200     10 DS-DISTHD-ORD-NBR                PIC  S9(9) COMP.                 
261300     10 DS-DISTHD-RCVR-SEQ-NBR           PIC  S9(9) COMP.                 
261400     10 DS-DISTHD-ORD-LNE-NBR            PIC  S9(9) COMP.                 
261500******************************************************************        
261600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  36     *        
261700******************************************************************        
261800******************************************************************        
261900* COBOL DECLARATION FOR TABLE TDISTDT                                     
262000******************************************************************        
262100 01  WS-DISTDT.                                                           
262200     10 WS-DISTDT-ORD-NBR                PIC  S9(9) COMP.                 
262300     10 WS-DISTDT-RCVR-SEQ-NBR           PIC  S9(9) COMP.                 
262400     10 WS-DISTDT-ORD-LNE-NBR            PIC  S9(9) COMP.                 
262500     10 WS-DISTDT-WRK-ORD-SEQ-NBR        PIC  S9(4) COMP.                 
262600     10 WS-DISTDT-STR-NBR                PIC  S9(4) COMP.                 
262700     10 WS-DISTDT-EXPTED-ALLOC-QTY       PIC  S9(9) COMP.                 
262800     10 WS-DISTDT-ACTL-ALLOC-QTY         PIC  S9(9) COMP.                 
262900     10 WS-DISTDT-RCVG-PSTD-STAT-CDE     PIC   X(1).                      
263000     10 WS-DISTDT-P2L-SPLT-UNT-QTY       PIC  S9(9) COMP.                 
263100     10 WS-DISTDT-FCSE-SPLT-UNT-QTY      PIC  S9(9) COMP.                 
263200     10 WS-DISTDT-INPK-SPLT-UNT-QTY      PIC  S9(9) COMP.                 
263300     10 WS-DISTDT-FCSE-ACTL-UNT-QTY      PIC  S9(9) COMP.                 
263400     10 WS-DISTDT-ODD-CART-IND           PIC   X(1).                      
263500     10 WS-DISTDT-PREPK-ODD-UNT-QTY      PIC  S9(4) COMP.                 
263600 01  WS-DISTDT-KEYS.                                                      
263700     10 DS-DISTDT-ORD-NBR                PIC  S9(9) COMP.                 
263800     10 DS-DISTDT-RCVR-SEQ-NBR           PIC  S9(9) COMP.                 
263900     10 DS-DISTDT-ORD-LNE-NBR            PIC  S9(9) COMP.                 
264000     10 DS-DISTDT-STR-NBR                PIC  S9(4) COMP.                 
264100******************************************************************        
264200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  13     *        
264300******************************************************************        
264400******************************************************************        
264500* COBOL DECLARATION FOR TABLE TWRKORD                                     
264600******************************************************************        
264700 01  WS-WRKORD.                                                           
264800     10 WS-WRKORD-ORD-NBR                PIC  S9(9) COMP.                 
264900     10 WS-WRKORD-RCVR-SEQ-NBR           PIC  S9(9) COMP.                 
265000     10 WS-WRKORD-ORD-LNE-NBR            PIC  S9(4) COMP.                 
265100     10 WS-WRKORD-WORK-ORD-SEQ-NBR       PIC  S9(4) COMP.                 
265200     10 WS-WRKORD-OPER-UNT-ID            PIC  S9(4) COMP.                 
265300     10 WS-WRKORD-FCLTY-ID               PIC  S9(4) COMP.                 
265400     10 WS-WRKORD-CRE-TMST               PIC   X(26).                     
265500     10 WS-WRKORD-VER-STATUS-CDE         PIC   X(1).                      
265600     10 WS-WRKORD-CRE-UID-ID             PIC   X(8).                      
265700     10 WS-WRKORD-EXPTED-CART-CNT        PIC  S9(9) COMP.                 
265800     10 WS-WRKORD-ACTL-CART-CNT          PIC  S9(9) COMP.                 
265900     10 WS-WRKORD-EXPTED-ITM-CNT         PIC  S9(9) COMP.                 
266000     10 WS-WRKORD-ACTL-ITM-CNT           PIC  S9(9) COMP.                 
266100     10 WS-WRKORD-STAT-CDE               PIC   X(2).                      
266200     10 WS-WRKORD-WORK-ORD-DISTR-IND     PIC   X(2).                      
266300     10 WS-WRKORD-OPER-SET-ID            PIC  S9(4) COMP.                 
266400     10 WS-WRKORD-INST-CART-CNT          PIC  S9(9) COMP.                 
266500     10 WS-WRKORD-INST-LNE-LOC-CDE       PIC   X(5).                      
266600     10 WS-WRKORD-INST-PRC-AREA-ID       PIC   X(6).                      
266700     10 WS-WRKORD-WO-INSTR-SEL-IND       PIC   X(1).                      
266800     10 WS-WRKORD-INST-ITM-CNT           PIC  S9(9) COMP.                 
266900 01  WS-WRKORD-KEYS.                                                      
267000     10 DS-WRKORD-ORD-NBR                PIC  S9(9) COMP.                 
267100     10 DS-WRKORD-RCVR-SEQ-NBR           PIC  S9(9) COMP.                 
267200     10 DS-WRKORD-ORD-LNE-NBR            PIC  S9(4) COMP.                 
267300     10 DS-WRKORD-WORK-ORD-SEQ-NBR       PIC  S9(4) COMP.                 
267400     10 DS-WRKORD-OPER-UNT-ID            PIC  S9(4) COMP.                 
267500     10 DS-WRKORD-FCLTY-ID               PIC  S9(4) COMP.                 
267600     10 DS-WRKORD-CRE-TMST               PIC   X(26).                     
267700******************************************************************        
267800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  21     *        
267900******************************************************************        
268000******************************************************************        
268100* COBOL DECLARATION FOR TABLE TWKORIN                                     
268200******************************************************************        
268300 01  WS-WKORIN.                                                           
268400     10 WS-WKORIN-ORD-NBR                PIC  S9(9) COMP.                 
268500     10 WS-WKORIN-RCVR-SEQ-NBR           PIC  S9(9) COMP.                 
268600     10 WS-WKORIN-ORD-LNE-NBR            PIC  S9(4) COMP.                 
268700     10 WS-WKORIN-WORK-ORD-SEQ-NBR       PIC  S9(4) COMP.                 
268800     10 WS-WKORIN-OPER-UNT-ID            PIC  S9(4) COMP.                 
268900     10 WS-WKORIN-FCLTY-ID               PIC  S9(4) COMP.                 
269000     10 WS-WKORIN-WO-INSTR-SEQ-NBR       PIC  S9(4) COMP.                 
269100     10 WS-WKORIN-CRE-TMST               PIC   X(26).                     
269200     10 WS-WKORIN-VER-STATUS-CDE         PIC   X(1).                      
269300     10 WS-WKORIN-CRE-UID-ID             PIC   X(8).                      
269400     10 WS-WKORIN-OPER-ID                PIC  S9(4) COMP.                 
269500     10 WS-WKORIN-FCLTY-AREA-ID          PIC   X(6).                      
269600     10 WS-WKORIN-PRC-FCLTY-AREA-ID      PIC   X(6).                      
269700     10 WS-WKORIN-EXPTED-CART-CNT        PIC  S9(9) COMP.                 
269800     10 WS-WKORIN-ACTL-CART-CNT          PIC  S9(9) COMP.                 
269900     10 WS-WKORIN-ALLOC-IND              PIC   X(1).                      
270000     10 WS-WKORIN-REPACK-IND             PIC   X(1).                      
270100     10 WS-WKORIN-STRT-TMST              PIC   X(26).                     
270200     10 WS-WKORIN-STOP-TMST              PIC   X(26).                     
270300     10 WS-WKORIN-SCREEN-SEQ-NBR         PIC  S9(4) COMP.                 
270400     10 WS-WKORIN-LNE-LOC-CDE            PIC   X(5).                      
270500     10 WS-WKORIN-REC-SEL-IND            PIC   X(1).                      
270600 01  WS-WKORIN-KEYS.                                                      
270700     10 DS-WKORIN-ORD-NBR                PIC  S9(9) COMP.                 
270800     10 DS-WKORIN-RCVR-SEQ-NBR           PIC  S9(9) COMP.                 
270900     10 DS-WKORIN-ORD-LNE-NBR            PIC  S9(4) COMP.                 
271000     10 DS-WKORIN-WORK-ORD-SEQ-NBR       PIC  S9(4) COMP.                 
271100     10 DS-WKORIN-OPER-UNT-ID            PIC  S9(4) COMP.                 
271200     10 DS-WKORIN-FCLTY-ID               PIC  S9(4) COMP.                 
271300     10 DS-WKORIN-WO-INSTR-SEQ-NBR       PIC  S9(4) COMP.                 
271400     10 DS-WKORIN-CRE-TMST               PIC   X(26).                     
271500******************************************************************        
271600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  22     *        
271700******************************************************************        
271800******************************************************************        
271900* COBOL DECLARATION FOR TABLE TSEASET                                     
272000******************************************************************        
272100 01  WS-SEASET.                                                           
272200     10 WS-SEASET-SEASET-YR              PIC   X(4).                      
272300     10 WS-SEASET-SEASET-SHRT-NM         PIC   X(5).                      
272400     10 WS-SEASET-SEASET-TYP-CDE         PIC   X(3).                      
272500     10 WS-SEASET-SEASET-NM              PIC   X(25).                     
272600     10 WS-SEASET-SEASET-STAT-CDE        PIC   X(1).                      
272700     10 WS-SEASET-STR-STUP-BEG-DTE       PIC   X(10).                     
272800     10 WS-SEASET-STR-STUP-END-DTE       PIC   X(10).                     
272900     10 WS-SEASET-STR-RLSE-BEG-DTE       PIC   X(10).                     
273000     10 WS-SEASET-STR-RLSE-END-DTE       PIC   X(10).                     
273100     10 WS-SEASET-LAST-UPD-BY-USR-ID     PIC   X(8).                      
273200     10 WS-SEASET-LAST-UPD-TMST          PIC   X(26).                     
273300     10 WS-SEASET-DIVERT-PFX-NBR         PIC  S9(4) COMP.                 
273400 01  WS-SEASET-KEYS.                                                      
273500     10 DS-SEASET-SEASET-YR              PIC   X(4).                      
273600     10 DS-SEASET-SEASET-SHRT-NM         PIC   X(5).                      
273700******************************************************************        
273800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  12     *        
273900******************************************************************        
274000******************************************************************        
274100* COBOL DECLARATION FOR TABLE TSUNAUD                                     
274200******************************************************************        
274300 01  WS-SUNAUD.                                                           
274400     10 WS-SUNAUD-AUD-CNTL-NBR           PIC  S9(9) COMP.                 
274500     10 WS-SUNAUD-AUD-STRT-TMST          PIC   X(26).                     
274600     10 WS-SUNAUD-AUD-STP-TMST           PIC   X(26).                     
274700     10 WS-SUNAUD-AUD-PSPND-MNIT-QTY     PIC  S9(9) COMP.                 
274800     10 WS-SUNAUD-AUD-CLO-MNIT-QTY       PIC  S9(9) COMP.                 
274900     10 WS-SUNAUD-AUD-USR-ID             PIC   X(8).                      
275000     10 WS-SUNAUD-OPER-UNT-ID            PIC  S9(4) COMP.                 
275100     10 WS-SUNAUD-FCLTY-ID               PIC  S9(4) COMP.                 
275200     10 WS-SUNAUD-PRC-FCLTY-AREA-ID      PIC   X(6).                      
275300     10 WS-SUNAUD-AUD-STAT-CDE           PIC   X(2).                      
275400     10 WS-SUNAUD-AUD-TYP-CDE            PIC   X(2).                      
275500 01  WS-SUNAUD-KEYS.                                                      
275600     10 DS-SUNAUD-AUD-CNTL-NBR           PIC  S9(9) COMP.                 
275700******************************************************************        
275800* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  11     *        
275900******************************************************************        
276000******************************************************************        
276100* COBOL DECLARATION FOR TABLE TSUATRN                                     
276200******************************************************************        
276300 01  WS-SUATRN.                                                           
276400     10 WS-SUATRN-AUD-CNTL-NBR           PIC  S9(9) COMP.                 
276500     10 WS-SUATRN-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.             
276600     10 WS-SUATRN-UNT-AUD-STRT-TMST      PIC   X(26).                     
276700     10 WS-SUATRN-UNT-AUD-STP-TMST       PIC   X(26).                     
276800     10 WS-SUATRN-UNT-PSPND-MNIT-QTY     PIC  S9(9) COMP.                 
276900     10 WS-SUATRN-UNT-CLO-MNIT-QTY       PIC  S9(9) COMP.                 
277000     10 WS-SUATRN-UNT-AUD-USR-ID         PIC   X(8).                      
277100     10 WS-SUATRN-UNT-AUD-STAT-CDE       PIC   X(2).                      
277200     10 WS-SUATRN-TRN-NBR                PIC  S9(9) COMP.                 
277300     10 WS-SUATRN-REC-SEQ-NBR            PIC  S9(9) COMP.                 
277400     10 WS-SUATRN-DEST-OPER-UNT-ID       PIC  S9(4) COMP.                 
277500     10 WS-SUATRN-DEST-FCLTY-ID          PIC  S9(4) COMP.                 
277600     10 WS-SUATRN-UNT-AUD-ERR-IND        PIC   X(1).                      
277700     10 WS-SUATRN-UNT-RSTRT-MNIT-QTY     PIC  S9(9) COMP.                 
277800 01  WS-SUATRN-KEYS.                                                      
277900     10 DS-SUATRN-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.             
278000     10 DS-SUATRN-AUD-CNTL-NBR           PIC  S9(9) COMP.                 
278100******************************************************************        
278200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  14     *        
278300******************************************************************        
278400******************************************************************        
278500* COBOL DECLARATION FOR TABLE TSUAUPC                                     
278600******************************************************************        
278700 01  WS-SUAUPC.                                                           
278800     10 WS-SUAUPC-AUD-CNTL-NBR        PIC  S9(9) COMP.                    
278900     10 WS-SUAUPC-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.                
279000     10 WS-SUAUPC-UPC-NBR             PIC  S9(15)V COMP-3.                
279100     10 WS-SUAUPC-SCN-TMST            PIC   X(26).                        
279200     10 WS-SUAUPC-AUD-USR-ID          PIC   X(8).                         
279300     10 WS-SUAUPC-ITM-DESC            PIC   X(20).                        
279400     10 WS-SUAUPC-VND-STYL-DESC       PIC   X(20).                        
279500     10 WS-SUAUPC-UPC-CLOR-DESC       PIC   X(10).                        
279600     10 WS-SUAUPC-UPC-SIZE-DESC       PIC   X(10).                        
279700     10 WS-SUAUPC-UPC-RTL-AMT         PIC  S9(5)V9(2) COMP-3.             
279800     10 WS-SUAUPC-UPC-CERTD-IND       PIC   X(1).                         
279900     10 WS-SUAUPC-SCND-UNT-QTY        PIC  S9(9) COMP.                    
280000     10 WS-SUAUPC-SCN-TYP-CDE         PIC   X(1).                         
280100     10 WS-SUAUPC-SKU-NBR             PIC  S9(8)V COMP-3.                 
280200     10 WS-SUAUPC-DEPT-NBR            PIC  S9(4)V COMP-3.                 
280300     10 WS-SUAUPC-MAJ-CL-NBR          PIC  S9(4)V COMP-3.                 
280400     10 WS-SUAUPC-SUB-CL-NBR          PIC  S9(4)V COMP-3.                 
280500 01  WS-SUAUPC-KEYS.                                                      
280600     10 DS-SUAUPC-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.             
280700     10 DS-SUAUPC-AUD-CNTL-NBR           PIC  S9(9) COMP.                 
280800     10 DS-SUAUPC-UPC-NBR                PIC  S9(15)V COMP-3.             
280900     10 DS-SUAUPC-SCN-TMST               PIC   X(26).                     
281000******************************************************************        
281100* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  14     *        
281200******************************************************************        
281300******************************************************************        
281400* COBOL DECLARATION FOR TABLE TSUEXCP                                     
281500******************************************************************        
281600 01  WS-SUEXCP.                                                           
281700     10 WS-SUEXCP-AUD-CNTL-NBR           PIC  S9(9) COMP.                 
281800     10 WS-SUEXCP-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.             
281900     10 WS-SUEXCP-UPC-NBR                PIC  S9(15)V COMP-3.             
282000     10 WS-SUEXCP-SCN-TMST               PIC   X(26).                     
282100     10 WS-SUEXCP-VILN-GP-CDE            PIC   X(3).                      
282200     10 WS-SUEXCP-VILN-GP-SEQ-NBR        PIC  S9(4) COMP.                 
282300     10 WS-SUEXCP-OVRRID-SYS-DAT-TXT     PIC   X(20).                     
282400 01  WS-SUEXCP-KEYS.                                                      
282500     10 DS-SUEXCP-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.             
282600     10 DS-SUEXCP-AUD-CNTL-NBR           PIC  S9(9) COMP.                 
282700     10 DS-SUEXCP-UPC-NBR                PIC  S9(15)V COMP-3.             
282800     10 DS-SUEXCP-VILN-GP-CDE            PIC   X(3).                      
282900     10 DS-SUEXCP-VILN-GP-SEQ-NBR        PIC  S9(4) COMP.                 
283000     10 DS-SUEXCP-SCN-TMST               PIC   X(26).                     
283100******************************************************************        
283200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *        
283300******************************************************************        
283400******************************************************************        
283500* COBOL DECLARATION FOR TABLE TCTEXCP                                     
283600******************************************************************        
283700 01  WS-CTEXCP.                                                           
283800     10 WS-CTEXCP-AUD-CNTL-NBR           PIC  S9(9) COMP.                 
283900     10 WS-CTEXCP-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.             
284000     10 WS-CTEXCP-VILN-GP-CDE            PIC   X(3).                      
284100     10 WS-CTEXCP-VILN-GP-SEQ-NBR        PIC  S9(4) COMP.                 
284200     10 WS-CTEXCP-OVRRID-SYS-DAT-TXT     PIC   X(20).                     
284300 01  WS-CTEXCP-KEYS.                                                      
284400     10 DS-CTEXCP-AUD-CNTL-NBR           PIC  S9(9) COMP.                 
284500     10 DS-CTEXCP-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.             
284600     10 DS-CTEXCP-VILN-GP-CDE            PIC   X(3).                      
284700     10 DS-CTEXCP-VILN-GP-SEQ-NBR        PIC  S9(4) COMP.                 
284800******************************************************************        
284900* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   5     *        
285000******************************************************************        
285100******************************************************************        
285200* COBOL DECLARATION FOR TABLE TIMTBKY                                     
285300******************************************************************        
285400 01  WS-IMTBKY.                                                           
285500     10 WS-IMTBKY-NOTIF-NBR              PIC  S9(9) COMP.                 
285600     10 WS-IMTBKY-IMPRT-ID               PIC   X(12).                     
285700     10 WS-IMTBKY-IMPRT-SEQ-NBR          PIC  S9(4) COMP.                 
285800     10 WS-IMTBKY-PRCS-TYP-CDE           PIC   X(2).                      
285900     10 WS-IMTBKY-CRE-TMST               PIC   X(26).                     
286000 01  WS-IMTBKY-KEYS.                                                      
286100     10 DS-IMTBKY-NOTIF-NBR              PIC  S9(9) COMP.                 
286200******************************************************************        
286300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   5     *        
286400******************************************************************        
286500******************************************************************        
286600* COBOL DECLARATION FOR TABLE TPOPRPK                                     
286700******************************************************************        
286800 01  WS-POPRPK.                                                           
286900     10 WS-POPRPK-PO-NBR              PIC  S9(9) COMP.                    
287000     10 WS-POPRPK-VER-NBR             PIC  S9(9) COMP.                    
287100     10 WS-POPRPK-PO-PREPK-ID         PIC  S9(4) COMP.                    
287200     10 WS-POPRPK-PREPK-TYP-CDE       PIC   X(1).                         
287300     10 WS-POPRPK-PREPK-DESC          PIC   X(40).                        
287400     10 WS-POPRPK-PREPK-STAT-CDE      PIC   X(1).                         
287500     10 WS-POPRPK-PREPK-UPC-NBR       PIC  S9(15)V COMP-3.                
287600     10 WS-POPRPK-INPK-UNT-QTY        PIC  S9(9) COMP.                    
287700     10 WS-POPRPK-INPK-CNVYB-IND      PIC   X(1).                         
287800     10 WS-POPRPK-OTPK-UNT-QTY        PIC  S9(9) COMP.                    
287900     10 WS-POPRPK-OTPK-ORD-QTY        PIC  S9(9) COMP.                    
288000     10 WS-POPRPK-PK-DTL-CHG-TMST     PIC   X(26).                        
288100     10 WS-POPRPK-PK-SKU-NBR          PIC  S9(8)V COMP-3.                 
288200 01  WS-POPRPK-KEYS.                                                      
288300     10 DS-POPRPK-PO-NBR              PIC  S9(9) COMP.                    
288400     10 DS-POPRPK-VER-NBR             PIC  S9(9) COMP.                    
288500     10 DS-POPRPK-PO-PREPK-ID         PIC  S9(4) COMP.                    
288600******************************************************************        
288700* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  11     *        
288800******************************************************************        
288900******************************************************************        
289000* COBOL DECLARATION FOR TABLE TIMCNRL                                     
289100******************************************************************        
289200 01  WS-IMCNRL.                                                           
289300     10 WS-IMCNRL-CONTNR-ID           PIC   X(12).                        
289400     10 WS-IMCNRL-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
289500     10 WS-IMCNRL-PO-NBR              PIC  S9(9) COMP.                    
289600     10 WS-IMCNRL-DCONSLR-RLSE-CDE    PIC   X(1).                         
289700     10 WS-IMCNRL-DCONSLR-REQR-DTE    PIC   X(10).                        
289800     10 WS-IMCNRL-DCONSLR-ACTL-DTE    PIC   X(10).                        
289900     10 WS-IMCNRL-DCONSLR-ACTL-TM     PIC   X(8).                         
290000     10 WS-IMCNRL-CRE-TMST            PIC   X(26).                        
290100     10 WS-IMCNRL-CRE-BY-UID          PIC   X(8).                         
290200     10 WS-IMCNRL-LAST-UPD-TMST       PIC   X(26).                        
290300     10 WS-IMCNRL-LAST-UPD-BY-UID     PIC   X(8).                         
290400     10 WS-IMCNRL-DCONSLR-ENT-ID      PIC  S9(9) COMP.                    
290500 01  WS-IMCNRL-KEYS.                                                      
290600     10 DS-IMCNRL-CONTNR-ID           PIC   X(12).                        
290700     10 DS-IMCNRL-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
290800     10 DS-IMCNRL-PO-NBR              PIC  S9(9) COMP.                    
290900******************************************************************        
291000* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  11     *        
291100******************************************************************        
291200******************************************************************        
291300* COBOL DECLARATION FOR TABLE TAUCNRL                                     
291400******************************************************************        
291500 01  WS-AUCNRL.                                                           
291600     10 WS-AUCNRL-CONTNR-ID           PIC   X(12).                        
291700     10 WS-AUCNRL-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
291800     10 WS-AUCNRL-PO-NBR              PIC  S9(9) COMP.                    
291900     10 WS-AUCNRL-DCONSLR-RLSE-CDE    PIC   X(1).                         
292000     10 WS-AUCNRL-DCONSLR-REQR-DTE    PIC   X(10).                        
292100     10 WS-AUCNRL-DCONSLR-ACTL-DTE    PIC   X(10).                        
292200     10 WS-AUCNRL-DCONSLR-ACTL-TM     PIC   X(8).                         
292300     10 WS-AUCNRL-CRE-TMST            PIC   X(26).                        
292400     10 WS-AUCNRL-CRE-BY-UID          PIC   X(8).                         
292500     10 WS-AUCNRL-AUD-FUNC-CDE        PIC   X(1).                         
292600     10 WS-AUCNRL-AUD-TMST            PIC   X(26).                        
292700     10 WS-AUCNRL-LAST-UPD-TMST       PIC   X(26).                        
292800     10 WS-AUCNRL-LAST-UPD-BY-UID     PIC   X(8).                         
292900     10 WS-AUCNRL-DCONSLR-ENT-ID      PIC  S9(9) COMP.                    
293000 01  WS-AUCNRL-KEYS.                                                      
293100     10 DS-AUCNRL-CONTNR-ID           PIC   X(12).                        
293200     10 DS-AUCNRL-CONTNR-SEQ-NBR      PIC  S9(4) COMP.                    
293300     10 DS-AUCNRL-PO-NBR              PIC  S9(9) COMP.                    
293400     10 DS-AUCNRL-LAST-UPD-TMST       PIC   X(26).                        
293500******************************************************************        
293600* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  13     *        
293700******************************************************************        
293800******************************************************************        
293900* COBOL DECLARATION FOR TABLE TLBVRDA                                     
294000******************************************************************        
294100 01  WS-LBVRDA.                                                           
294200     10 WS-LBVRDA-PO-NBR                 PIC  S9(9) COMP.                 
294300     10 WS-LBVRDA-RCVR-SEQ-NBR           PIC  S9(9) COMP.                 
294400     10 WS-LBVRDA-PO-LNE-NBR             PIC  S9(9) COMP.                 
294500     10 WS-LBVRDA-PREPK-ID               PIC  S9(4) COMP.                 
294600     10 WS-LBVRDA-OTPK-UNT-QTY           PIC  S9(9) COMP.                 
294700     10 WS-LBVRDA-LBL-ASG-IND            PIC   X(1).                      
294800     10 WS-LBVRDA-LBL-TYP-CDE            PIC   X(1).                      
294900     10 WS-LBVRDA-LBL-ASG-SEQ-NBR        PIC  S9(4) COMP.                 
295000     10 WS-LBVRDA-PRNT-CART-SEQ-ID       PIC  S9(4) COMP.                 
295100     10 WS-LBVRDA-CART-LBL-TYP-CDE       PIC   X(1).                      
295200     10 WS-LBVRDA-PREPK-PRCG-LNE-NBR     PIC  S9(9) COMP.                 
295300     10 WS-LBVRDA-INPK-UNT-QTY           PIC  S9(9) COMP.                 
295400     10 WS-LBVRDA-PREPK-RATO-QTY         PIC  S9(4) COMP.                 
295500     10 WS-LBVRDA-PREPK-UNT-QTY          PIC  S9(4) COMP.                 
295600     10 WS-LBVRDA-DEST-OPER-UNT-ID       PIC  S9(4) COMP.                 
295700     10 WS-LBVRDA-CSE-PK-QTY             PIC  S9(4) COMP.                 
295800     10 WS-LBVRDA-ODD-CART-IND           PIC   X(1).                      
295900     10 WS-LBVRDA-INPK-CNVYB-IND         PIC   X(1).                      
296000     10 WS-LBVRDA-LBL-TYP-LBL-SEQ-ID     PIC  S9(4) COMP.                 
296100     10 WS-LBVRDA-LBL-TYP-TOT-QTY        PIC  S9(4) COMP.                 
296200     10 WS-LBVRDA-BRCDE-NBR              PIC   X(22).                     
296300     10 WS-LBVRDA-STR-ZN-ID              PIC   X(5).                      
296400     10 WS-LBVRDA-MODU-DESC              PIC   X(7).                      
296500     10 WS-LBVRDA-ITM-NBR                PIC  S9(15)V COMP-3.             
296600     10 WS-LBVRDA-DEPT-DESC              PIC   X(25).                     
296700     10 WS-LBVRDA-MAJ-CL-DESC            PIC   X(25).                     
296800     10 WS-LBVRDA-SEASET-NM              PIC   X(25).                     
296900     10 WS-LBVRDA-FIXT-ID                PIC   X(10).                     
297000     10 WS-LBVRDA-STRG-AREA-CDE          PIC   X(5).                      
297100     10 WS-LBVRDA-RCLM-IND               PIC   X(1).                      
      *CLP 03/21/2106                                                           
297100     10 WS-LBVRDA-LBL-MSG-TXT            PIC   X(100).                    
297200 01  WS-LBVRDA-KEYS.                                                      
297300     10 DS-LBVRDA-PO-NBR                 PIC  S9(9) COMP.                 
297400     10 DS-LBVRDA-RCVR-SEQ-NBR           PIC  S9(9) COMP.                 
297500     10 DS-LBVRDA-PO-LNE-NBR             PIC  S9(9) COMP.                 
297600     10 DS-LBVRDA-PREPK-ID               PIC  S9(4) COMP.                 
297700     10 DS-LBVRDA-OTPK-UNT-QTY           PIC  S9(9) COMP.                 
297800     10 DS-LBVRDA-LBL-ASG-IND            PIC   X(1).                      
297900     10 DS-LBVRDA-LBL-TYP-CDE            PIC   X(1).                      
298000     10 DS-LBVRDA-LBL-ASG-SEQ-NBR        PIC  S9(4) COMP.                 
298100******************************************************************        
298200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  29     *        
298300******************************************************************        
298400******************************************************************        
298500* COBOL DECLARATION FOR TABLE TSULBXF                                     
298600******************************************************************        
298700 01  WS-SULBXF.                                                           
298800     10 WS-SULBXF-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.             
298900     10 WS-SULBXF-BRCDE-NBR              PIC   X(22).                     
299000     10 WS-SULBXF-CART-LBL-TYP-CDE       PIC   X(1).                      
299100     10 WS-SULBXF-DEST-OPER-UNT-ID       PIC  S9(4) COMP.                 
299200     10 WS-SULBXF-STAT-CDE               PIC   X(1).                      
299300     10 WS-SULBXF-LAST-STAT-CHG-TMST     PIC   X(26).                     
299400     10 WS-SULBXF-CRE-TMST               PIC   X(26).                     
299500******************************************************************        
299600* KEYS CAN ADD UP TO 50 ONLY SO TMST WAS SHORTENED               *        
299700******************************************************************        
299800 01  WS-SULBXF-KEYS.                                                      
299900     10 DS-SULBXF-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.             
300000     10 DS-SULBXF-BRCDE-NBR              PIC   X(22).                     
300100     10 DS-SULBXF-LAST-STAT-CHG-TMST     PIC   X(16).                     
300200******************************************************************        
300300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *        
300400******************************************************************        
300500******************************************************************        
300600* COBOL DECLARATION FOR TABLE TSHPSUM                                     
300700******************************************************************        
300800 01  WS-SHPSUM.                                                           
300900     10 WS-SHPSUM-PO-NBR                 PIC  S9(9) COMP.                 
301000     10 WS-SHPSUM-PKSL-SEQ-NBR           PIC  S9(4) COMP.                 
301100     10 WS-SHPSUM-CART-COMB-NBR          PIC  S9(4) COMP.                 
301200     10 WS-SHPSUM-PO-LNE-NBR             PIC  S9(9) COMP.                 
301300     10 WS-SHPSUM-TOT-CART-CNT           PIC  S9(4) COMP.                 
301400     10 WS-SHPSUM-OTPK-UNT-QTY           PIC  S9(4) COMP.                 
301500     10 WS-SHPSUM-CRE-TMST               PIC   X(26).                     
301600 01  WS-SHPSUM-KEYS.                                                      
301700     10 DS-SHPSUM-PO-NBR                 PIC  S9(9) COMP.                 
301800     10 DS-SHPSUM-PKSL-SEQ-NBR           PIC  S9(4) COMP.                 
301900     10 DS-SHPSUM-CART-COMB-NBR          PIC  S9(4) COMP.                 
302000     10 DS-SHPSUM-PO-LNE-NBR             PIC  S9(9) COMP.                 
302100******************************************************************        
302200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   7     *        
302300******************************************************************        
302400******************************************************************        
302500* COBOL DECLARATION FOR TABLE TLBPTDA                                     
302600******************************************************************        
302700 01  WS-LBPTDA.                                                           
302800     10 WS-LBPTDA-TRIP-ID                PIC  S9(9) COMP.                 
302900     10 WS-LBPTDA-CRE-USR-ID             PIC   X(8).                      
303000     10 WS-LBPTDA-LBL-PRT-BTCH-ID        PIC  S9(4) COMP.                 
303100     10 WS-LBPTDA-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.             
303200     10 WS-LBPTDA-OPER-UNT-ID            PIC  S9(4) COMP.                 
303300     10 WS-LBPTDA-FCLTY-ID               PIC  S9(4) COMP.                 
303400     10 WS-LBPTDA-CRE-TMST               PIC   X(26).                     
303500     10 WS-LBPTDA-OWNR-SCAC-ID           PIC   X(4).                      
303600     10 WS-LBPTDA-VEH-NBR                PIC   X(10).                     
303700     10 WS-LBPTDA-RPRT-IND               PIC   X(1).                      
303800     10 WS-LBPTDA-SU-DUP-LBL-IND         PIC   X(1).                      
303900     10 WS-LBPTDA-SU-FRE-ASTRA-IND       PIC   X(1).                      
304000     10 WS-LBPTDA-SU-MSSG-DAT-IND        PIC   X(1).                      
304100     10 WS-LBPTDA-SU-MISDIR-IND          PIC   X(1).                      
304200     10 WS-LBPTDA-MISDIR-OPER-UNT-ID     PIC  S9(4) COMP.                 
304300     10 WS-LBPTDA-PO-NBR                 PIC  S9(9) COMP.                 
304400     10 WS-LBPTDA-RCVR-SEQ-NBR           PIC  S9(9) COMP.                 
304500     10 WS-LBPTDA-PO-LNE-NBR             PIC  S9(9) COMP.                 
304600     10 WS-LBPTDA-DEST-OPER-UNT-ID       PIC  S9(4) COMP.                 
304700     10 WS-LBPTDA-STR-NM                 PIC   X(10).                     
304800     10 WS-LBPTDA-STR-ZN-ID              PIC   X(5).                      
304900     10 WS-LBPTDA-SKU-DEPT-NBR           PIC   X(3).                      
305000     10 WS-LBPTDA-SKU-CL-NBR             PIC   X(2).                      
305100     10 WS-LBPTDA-VS-NBR                 PIC   X(20).                     
305200     10 WS-LBPTDA-OTPK-UNT-QTY           PIC  S9(9) COMP.                 
305300     10 WS-LBPTDA-INPK-UNT-QTY           PIC  S9(9) COMP.                 
305400     10 WS-LBPTDA-PRTR-ID                PIC   X(8).                      
305500     10 WS-LBPTDA-BRCDE-NBR              PIC   X(22).                     
305600     10 WS-LBPTDA-DC-PRTD-AT-CDE         PIC   X(2).                      
305700     10 WS-LBPTDA-INVLD-DAT-ERR-CDE      PIC   X(1).                      
305800     10 WS-LBPTDA-PREPK-ID               PIC  S9(4) COMP.                 
305900     10 WS-LBPTDA-PREPK-RATO-QTY         PIC  S9(4) COMP.                 
306000     10 WS-LBPTDA-PREPK-UNT-QTY          PIC  S9(4) COMP.                 
306100     10 WS-LBPTDA-CSE-PK-QTY             PIC  S9(4) COMP.                 
306200     10 WS-LBPTDA-ODD-CART-IND           PIC   X(1).                      
306300     10 WS-LBPTDA-INPK-CNVYB-IND         PIC   X(1).                      
306400     10 WS-LBPTDA-LBL-TYP-LBL-SEQ-ID     PIC  S9(4) COMP.                 
306500     10 WS-LBPTDA-LBL-TYP-TOT-QTY        PIC  S9(4) COMP.                 
306600     10 WS-LBPTDA-MODU-DESC              PIC   X(7).                      
306700     10 WS-LBPTDA-ITM-NBR                PIC  S9(15)V COMP-3.             
306800     10 WS-LBPTDA-DEPT-DESC              PIC   X(25).                     
306900     10 WS-LBPTDA-MAJ-CL-DESC            PIC   X(25).                     
307000     10 WS-LBPTDA-SEASET-NM              PIC   X(25).                     
307100     10 WS-LBPTDA-FIXT-ID                PIC   X(10).                     
307200     10 WS-LBPTDA-CART-LBL-TYP-CDE       PIC   X(1).                      
307300     10 WS-LBPTDA-STRG-AREA-CDE          PIC   X(5).                      
307400     10 WS-LBPTDA-CART-ACTN-CDE          PIC   X(1).                      
307500     10 WS-LBPTDA-HNG-FOLD-SEQ-NBR       PIC  S9(4) COMP.                 
307600     10 WS-LBPTDA-BUS-AREA-ID            PIC  S9(2)V COMP-3.              
307700     10 WS-LBPTDA-SKU-NBR                PIC  S9(8)V COMP-3.              
      *CLP 03/21/2106                                                           
297100     10 WS-LBPTDA-LBL-MSG-TXT            PIC   X(100).                    
307800 01  WS-LBPTDA-KEYS.                                                      
307900     10 DS-LBPTDA-TRIP-ID                PIC  S9(9) COMP.                 
308000     10 DS-LBPTDA-CRE-USR-ID             PIC   X(8).                      
308100     10 DS-LBPTDA-LBL-PRT-BTCH-ID        PIC  S9(4) COMP.                 
308200     10 DS-LBPTDA-BRCDE-NBR              PIC   X(22).                     
308300     10 DS-LBPTDA-PO-NBR                 PIC  S9(9) COMP.                 
308400     10 DS-LBPTDA-RCVR-SEQ-NBR           PIC  S9(9) COMP.                 
308500     10 DS-LBPTDA-PO-LNE-NBR             PIC  S9(9) COMP.                 
308600     10 DS-LBPTDA-CRE-TMST               PIC  X(26).                      
308700******************************************************************        
308800* COBOL DECLARATION FOR TABLE TWEBITM                                     
308900******************************************************************        
309000 01  WS-WEBITM.                                                           
309100     10 WS-WEBITM-INTR-UPC-ID            PIC  S9(9) COMP.                 
309200     10 WS-WEBITM-EFF-BEG-TMST           PIC   X(26).                     
309300     10 WS-WEBITM-EFF-END-TMST           PIC   X(26).                     
309400     10 WS-WEBITM-EFF-END-TMST-NN        PIC  S9(4) COMP.                 
309500     10 WS-WEBITM-ASRT-BEG-DTE           PIC   X(10).                     
309600     10 WS-WEBITM-ASRT-END-DTE           PIC   X(10).                     
309700     10 WS-WEBITM-STRG-AREA-SEQ-NBR      PIC  S9(4) COMP.                 
309800     10 WS-WEBITM-SHIP-WD-QTY            PIC  S9(4)V9(3) COMP-3.          
309900     10 WS-WEBITM-SHIP-DPTH-QTY          PIC  S9(4)V9(3) COMP-3.          
310000     10 WS-WEBITM-SHIP-HT-QTY            PIC  S9(4)V9(3) COMP-3.          
310100     10 WS-WEBITM-SHIP-WT-QTY            PIC  S9(5)V9(3) COMP-3.          
310200     10 WS-WEBITM-SHIP-DIM-SRC-CDE       PIC   X(1).                      
310300     10 WS-WEBITM-PKG-SEQ-NBR            PIC  S9(4) COMP.                 
310400     10 WS-WEBITM-SHIP-RSTRC-SEQ-NBR     PIC  S9(4) COMP.                 
310500     10 WS-WEBITM-GFT-WRAP-AVL-IND       PIC   X(1).                      
310600     10 WS-WEBITM-PRD-GP-NBR             PIC  S9(8)V COMP-3.              
310700     10 WS-WEBITM-PRD-GP-IND             PIC   X(1).                      
310800     10 WS-WEBITM-SHIP-SRCHG-FEE-AMT     PIC  S9(3)V9(2) COMP-3.          
310900     10 WS-WEBITM-SHIP-SRVC-SEQ-NBR      PIC  S9(4) COMP.                 
311000     10 WS-WEBITM-SHIP-GP-SEQ-NBR        PIC  S9(4) COMP.                 
311100     10 WS-WEBITM-CRE-BY-USR-ID          PIC   X(8).                      
311200     10 WS-WEBITM-WEB-ITM-DLTD-IND       PIC   X(1).                      
311300     10 WS-WEBITM-HAZDS-IND              PIC   X(1).                      
311400     10 WS-WEBITM-BRKBL-IND              PIC   X(1).                      
311500     10 WS-WEBITM-GC-IND                 PIC   X(1).                      
311600     10 WS-WEBITM-SHIP-ALN-IND           PIC   X(1).                      
311700     10 WS-WEBITM-WEB-EXCLV-IND          PIC   X(1).                      
311800 01  WS-WEBITM-KEYS.                                                      
311900     10 DS-WEBITM-INTR-UPC-ID            PIC  S9(9) COMP.                 
312000     10 DS-WEBITM-EFF-BEG-TMST           PIC   X(20).                     
312100     10 DS-WEBITM-EFF-END-TMST           PIC   X(20).                     
312200     10 DS-WEBITM-EFF-END-TMST-NN        PIC  S9(4) COMP.                 
312300******************************************************************        
312400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  21     *        
312500******************************************************************        
312600******************************************************************        
312700* COBOL DECLARATION FOR TABLE TMDSEAR                                     
312800******************************************************************        
312900 01  WS-MDSEAR.                                                           
313000     10 WS-MDSEAR-OPERCO-NBR             PIC   X(2).                      
313100     10 WS-MDSEAR-GMA-NBR                PIC   X(2).                      
313200     10 WS-MDSEAR-DMA-NBR                PIC   X(2).                      
313300     10 WS-MDSEAR-DEPT-NBR               PIC   X(3).                      
313400     10 WS-MDSEAR-MAJ-CL-NBR             PIC   X(2).                      
313500     10 WS-MDSEAR-SUB-CL-NBR             PIC   X(3).                      
313600     10 WS-MDSEAR-MDSELV-CDE             PIC   X(3).                      
313700     10 WS-MDSEAR-MDSEAR-DKEY            PIC  S9(6)V COMP-3.              
313800     10 WS-MDSEAR-CHG-DTE                PIC   X(10).                     
313900     10 WS-MDSEAR-CRE-DTE                PIC   X(10).                     
314000     10 WS-MDSEAR-STRT-DTE               PIC   X(10).                     
314100     10 WS-MDSEAR-END-DTE                PIC   X(10).                     
314200     10 WS-MDSEAR-GEN-MDSE-TYP-CDE       PIC   X(1).                      
314300     10 WS-MDSEAR-DESC                   PIC   X(25).                     
314400     10 WS-MDSEAR-BYR-NBR                PIC   X(3).                      
314500     10 WS-MDSEAR-LIST-SEQ-NBR           PIC  S9(15)V COMP-3.             
314600     10 WS-MDSEAR-PHY-INV-OH-VAR-PCT     PIC  S9(3)V COMP-3.              
314700     10 WS-MDSEAR-PHY-INV-OH-VAR-PCT-N   PIC  S9(4)  COMP.                
314800     10 WS-MDSEAR-PHY-INV-OH-VAR-QTY     PIC  S9(5)V COMP-3.              
314900     10 WS-MDSEAR-PHY-INV-OH-VAR-QTY-N   PIC  S9(4)  COMP.                
315000 01  WS-MDSEAR-KEYS.                                                      
315100     10 DS-MDSEAR-MDSEAR-DKEY            PIC  S9(6)V COMP-3.              
315200******************************************************************        
315300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  18     *        
315400******************************************************************        
315500******************************************************************        
315600* COBOL DECLARATION FOR TABLE TSKST                                       
315700******************************************************************        
315800 01  WS-SKST.                                                             
315900     10 WS-SKST-ITEM-NMBR                PIC  S9(15)V COMP-3.             
316000     10 WS-SKST-LOC-NBR                  PIC  S9(4) COMP.                 
316100     10 WS-SKST-LAST-SALE-DATE           PIC  S9(7)V COMP-3.              
316200     10 WS-SKST-LAST-RCVD-DATE           PIC  S9(7)V COMP-3.              
316300     10 WS-SKST-ONHAND-QTY               PIC  S9(7)V COMP-3.              
316400     10 WS-SKST-FIRST-RCVD-DATE          PIC  S9(7)V COMP-3.              
316500     10 WS-SKST-FIRST-SALE-DATE          PIC  S9(7)V COMP-3.              
316600     10 WS-SKST-YTD-SALES-UNIT-QTY       PIC  S9(7)V COMP-3.              
316700     10 WS-SKST-YTD-SALES-AMT            PIC  S9(7)V9(2) COMP-3.          
316800     10 WS-SKST-LAST-UPD-TMST            PIC   X(26).                     
316900 01  WS-SKST-KEYS.                                                        
317000     10 DS-SKST-ITEM-NMBR                PIC  S9(15)V COMP-3.             
317100     10 DS-SKST-LOC-NBR                  PIC  S9(4) COMP.                 
317200******************************************************************        
317300* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS  12     *        
317400******************************************************************        
317500******************************************************************        
317600* COBOL DECLARATION FOR TABLE TPPCPRC                                     
317700******************************************************************        
317800 01  WS-PPCPRC.                                                           
317900     10 WS-PPCPRC-TSK-ITM-NBR            PIC  S9(15)V COMP-3.             
318000     10 WS-PPCPRC-STRT-TMST              PIC   X(26).                     
318100     10 WS-PPCPRC-STR-NBR                PIC  S9(4) COMP.                 
318200     10 WS-PPCPRC-END-TMST               PIC   X(26).                     
318300     10 WS-PPCPRC-MEITGP-NBR             PIC  S9(9) COMP.                 
318400     10 WS-PPCPRC-RTL-AMT                PIC  S9(7)V9(2) COMP-3.          
318500     10 WS-PPCPRC-STATUS-CDE             PIC  S9(3)V COMP-3.              
318600     10 WS-PPCPRC-UID-NBR                PIC   X(8).                      
318700 01  WS-PPCPRC-KEYS.                                                      
318800     10 DS-PPCPRC-TSK-ITM-NBR            PIC  S9(15)V COMP-3.             
318900     10 DS-PPCPRC-STR-NBR                PIC  S9(4) COMP.                 
319000     10 DS-PPCPRC-STRT-TMST              PIC   X(26).                     
319100******************************************************************        
319200* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS   8     *        
319300******************************************************************        
319400/                                                                         
319500 01  WS-OTBCART-KEYS.                                                     
319600     10  DS-OTBCART-SHIPT-UNT-ID         PIC  S9(18)V COMP-3.             
319700                                                                          
319800 01  WS-OTBUPC-KEYS.                                                      
319900     10 DS-OTBUPC-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.             
320000     10 DS-OTBUPC-TRN-NBR                PIC  S9(9) COMP.                 
320100     10 DS-OTBUPC-RCVR-SEQ-NBR           PIC  S9(9) COMP.                 
320200     10 DS-OTBUPC-TRN-LNE-NBR            PIC  S9(9) COMP.                 
320300     10 DS-OTBUPC-TRN-TYP-CDE            PIC   X(2).                      
320400     10 DS-OTBUPC-UPC-NBR                PIC  S9(15)V COMP-3.             
320500                                                                          
320600 01  DS008-OTBPKD-KEYS.                                                   
320700     10 DS008-OTBPKD-SHIPT-UNT-ID        PIC  S9(18)V COMP-3.             
320800     10 DS008-OTBPKD-TRN-NBR             PIC  S9(9) COMP.                 
320900     10 DS008-OTBPKD-RCVR-SEQ-NBR        PIC  S9(9) COMP.                 
321000     10 DS008-OTBPKD-TRN-LNE-NBR         PIC  S9(9) COMP.                 
321100     10 DS008-OTBPKD-TRN-TYP-CDE         PIC   X(2).                      
321200     10 DS008-OTBPKD-UPC-NBR             PIC  S9(15)V COMP-3.             
321300     10 DS008-OTBPKD-PKD-BY-USR-ID       PIC  X(08).                      
321400     10 DS008-OTBPKD-PKD-TMST            PIC  X(26).                      
321500                                                                          
321600 01  WS-TSUOBTR-KEYS.                                                     
321700     10 DS-TSUOBTR-TRIP-ID                PIC S9(9) COMP.                 
321800                                                                          
321900 01  WS-TSUOBTS-KEYS.                                                     
322000     10 DS-TSUOBTS-TRIP-ID            PIC S9(9) COMP.                     
322100     10 DS-TSUOBTS-OTBND-STAT-TMST    PIC X(26).                          
322200                                                                          
322300 01  DS008-OTBND-VND-KEYS.                                                
322400     10 DS008K-OTBVND-SHIPT-UNT-ID    PIC S9(18)V COMP-3.                 
322500                                                                          
322600 01  DS008-SUT-OTBND-LOC.                                                 
322700     10  DS008-OTBLOC-SHIPT-UNT-ID    PIC  S9(18)V COMP-3.                
322800     10  DS008-OTBLOC-CRE-TMST        PIC  X(26).                         
322900     10  DS008-OTBLOC-OTBND-TRIP-ID   PIC  S9(9) COMP.                    
323000     10  DS008-OTBLOC-OTBND-TRIP-ID-N PIC  S9(4) COMP.                    
323100     10  DS008-OTBLOC-LOC-NBR         PIC  S9(4) COMP.                    
323200     10  DS008-OTBLOC-SCN-CDE         PIC   X(4).                         
323300     10  DS008-OTBLOC-CRE-USR-ID      PIC   X(8).                         
323400     10  DS008-OTBLOC-ACTV-CDE        PIC   X(1).                         
323500     10  DS008-OTBLOC-INBD-TRIP-ID    PIC  S9(9) COMP.                    
323600 01  DS008-OTBLOC-KEYS.                                                   
323700     05  DS008K-OTBLOC-SHIPT-UNT-ID   PIC  S9(18)V COMP-3.                
323800     05  DS008K-OTBLOC-CRE-TMST       PIC  X(26).                         
323900                                                                          
324000 01  DS008-SUQADJ-KEYS.                                                   
324100     05  DS008K-SUQADJ-SHIPT-UNT-ID   PIC  S9(18)V COMP-3.                
324200     05  DS008K-SUQADJ-UPC-NBR        PIC  S9(15)V COMP-3.                
324300     05  DS008K-SUQADJ-ADJ-TMST       PIC  X(26).                         
324400                                                                          
325000 01  DS008-XLTSKU-KEYS.                                                   
325100     05  DS008K-XLTSKU-INTR-UPC-ID    PIC  S9(09) COMP.                   
325200                                                                          
325300 01  DS008-XLTUPC-KEYS.                                                   
325400     05  DS008K-XLTUPC-UPC-ID         PIC  S9(09) COMP.                   
325500     05  DS008K-XLTUPC-INTR-UPC-ID    PIC  S9(09) COMP.                   
325600                                                                          
325700 01  DS008-XLTVNDSTYL-KEYS.                                               
325800     05  DS008K-XLTVNDSTYL-STYL-ID    PIC  S9(08) COMP-3.                 
325900                                                                          
326000 01  DS008-DCLSUT00030.                                                   
326100     05  DS008-SUT00030-DATA.                                             
326200         10  DS008-FINCL-ADJ-ID         PIC  S9(9) COMP.                  
326300         10  DS008-ADJ-ERR-CDE          PIC  S9(4) COMP.                  
326400         10  DS008-PO-NBR               PIC  S9(9) COMP.                  
326500         10  DS008-RCVR-LNE-NBR         PIC  S9(9) COMP.                  
326600         10  DS008-RCVR-SEQ-NBR         PIC  S9(9) COMP.                  
326700         10  DS008-DEST-LOC-NBR         PIC  S9(4) COMP.                  
326800         10  DS008-CRE-TMST             PIC   X(26).                      
326900         10  DS008-UPC-NBR              PIC  S9(15)V COMP-3.              
327000         10  DS008-SHIPT-UNT-ID         PIC  S9(18)V COMP-3.              
327100         10  DS008-PRC-RSN-CDE          PIC   X(8).                       
327200         10  DS008-AUD-CNTL-NBR         PIC  S9(9) COMP.                  
327300         10  DS008-ORGN-LOC-NBR         PIC  S9(4) COMP.                  
327400         10  DS008-AUD-ADJ-STAT-CDE     PIC   X(1).                       
327500         10  DS008-AUTO-APL-IND         PIC   X(1).                       
327600         10  DS008-CRE-BY-USR-ID        PIC   X(8).                       
327700         10  DS008-CRE-PGM-NM           PIC   X(8).                       
327800         10  DS008-FINCL-BEF-QTY        PIC  S9(4) COMP.                  
327900         10  DS008-FINCL-AFT-QTY        PIC  S9(4) COMP.                  
328000         10  DS008-RSLV-BY-USR-ID       PIC   X(8).                       
328100         10  DS008-RSLV-TMST            PIC   X(26).                      
328200         10  DS008-PROB-RSN-CDE         PIC  S9(4) COMP.                  
328300         10  DS008-ADJ-QTY              PIC  S9(4) COMP.                  
328400         10  DS008-RSLV-CMNT-TXT        PIC   X(255).                     
328500     05  DS008-SUT00030-NULL.                                             
328600         10  DS008-SUT00030-NULLS OCCURS 23 TIMES PIC S9(4) COMP.         
328700 01  DS008-FINCL-ADJ-KEYS.                                                
328800     05  DS008K-FINCL-ADJ-ID          PIC  S9(09) COMP.                   
328900/                                                                         
329000 01  DS008-DCLSUT00015.                                                   
329100     05  DS008-SUT00015-DATA.                                             
329200         10 DS008-SUT00015-PO-NBR           PIC S9(9) COMP.               
329300         10 DS008-SUT00015-PO-LNE-NBR       PIC S9(9) COMP.               
329400         10 DS008-SUT00015-PO-PREPK-ID      PIC S9(4) COMP.               
329500         10 DS008-SUT00015-OPER-UNT-ID      PIC S9(4) COMP.               
329600         10 DS008-SUT00015-INBND-TRIP-ID    PIC S9(9) COMP.               
329700         10 DS008-SUT00015-RCVR-SEQ-NBR     PIC S9(9) COMP.               
329800         10 DS008-SUT00015-AUD-CNTL-NBR     PIC S9(9) COMP.               
329900         10 DS008-SUT00015-CART-QTY         PIC S9(9) COMP.               
330000         10 DS008-SUT00015-UNT-QTY          PIC S9(9) COMP.               
330100         10 DS008-SUT00015-AUD-CART-QTY     PIC S9(9) COMP.               
330200         10 DS008-SUT00015-AUD-UNT-QTY      PIC S9(9) COMP.               
330300         10 DS008-SUT00015-AUD-STAT-CDE     PIC X(1).                     
330400         10 DS008-SUT00015-DFRD-AUD-IND     PIC X(1).                     
330500         10 DS008-SUT00015-AUD-ERR-PCT      PIC S9(3)V9(2) COMP-3.        
330600         10 DS008-SUT00015-CRE-TMST         PIC X(26).                    
330700         10 DS008-SUT00015-CART-PRMPT-CDE   PIC X(1).                     
330800         10 DS008-SUT00015-VND-RNKG-CDE     PIC X(6).                     
330900         10 DS008-SUT00015-PKGNG-TYP-CDE    PIC X(2).                     
331000         10 DS008-SUT00015-EFF-BEG-TMST     PIC X(26).                    
331100         10 DS008-SUT00015-ENT-ID           PIC  S9(9) COMP.              
331200         10 DS008-SUT00015-DEPT-NBR         PIC  S9(4)V COMP-3.           
331300         10 DS008-SUT00015-AUD-STAT-RSN-CD  PIC X(1).                     
331400         10 DS008-SUT00015-MOD-QTY-IND      PIC  X(1).                    
331500         10 DS008-SUT00015-RWK-AUD-CTL-NBR                                
331600                                            PIC S9(9) COMP.               
331700     05  DS008-SUT00015-NULL.                                             
331800         10  DS008-SUT00015-NULLS OCCURS 24 TIMES                         
331900                                      PIC S9(4) COMP.                     
332000 01  DS008-SUT00015-KEYS COMP.                                            
332100     05  DS008K-SUT00015-PO-NBR       PIC  S9(08).                        
332200     05  DS008K-SUT00015-PO-LNE-NBR   PIC  S9(08).                        
332300     05  DS008K-SUT00015-PO-PREPK-ID  PIC  S9(04).                        
332400     05  DS008K-SUT00015-OPER-UNT-ID  PIC  S9(04).                        
332500     05  DS008K-SUT00015-INBND-TRIP-ID  PIC  S9(08).                      
332600     05  DS008K-SUT00015-RCVR-SEQ-NBR  PIC  S9(08).                       
332700/                                                                         
332800 01  DS008-DCLSUT00024.                                                   
332900     05  DS008-SUT00024-DATA.                                             
333000         10 DS008-SUT00024-SHIPT-UNT-ID     PIC S9(18)V COMP-3.           
333100         10 DS008-SUT00024-ORGN-LOC-NBR     PIC S9(4) COMP.               
333200         10 DS008-SUT00024-DEST-LOC-NBR     PIC S9(4) COMP.               
333300         10 DS008-SUT00024-CART-SRC-CDE     PIC  X(3).                    
333400         10 DS008-SUT00024-CRE-DTE          PIC  X(10).                   
333500         10 DS008-SUT00024-CRE-TM           PIC  X(8).                    
333600         10 DS008-SUT00024-CRE-USR-ID       PIC  X(8).                    
333700         10 DS008-SUT00024-CRE-PGM-NM       PIC  X(8).                    
333800         10 DS008-SUT00024-MSTR-CART-IND    PIC  X(1).                    
333900         10 DS008-SUT00024-PRNT-CART-ID     PIC S9(18)V COMP-3.           
334000         10 DS008-SUT00024-ORIG-CART-ID     PIC S9(18)V COMP-3.           
334100         10 DS008-SUT00024-CART-TYP-CDE     PIC  X(1).                    
334200         10 DS008-SUT00024-LBL-PRT-SEQ-NBR  PIC S9(4) COMP.               
334300         10 DS008-SUT00024-CART-RVSN-NBR    PIC S9(4) COMP.               
334400         10 DS008-SUT00024-OTBND-TRIP-ID    PIC S9(9) COMP.               
334500         10 DS008-SUT00024-ACTV-IND         PIC  X(1).                    
334600         10 DS008-SUT00024-ODD-UNT-IND      PIC  X(1).                    
334700     05  DS008-SUT00024-NULL.                                             
334800         10  DS008-SUT00024-NULLS OCCURS 17 TIMES                         
334900                                      PIC S9(4) COMP.                     
335000 01  DS008-SUT00024-KEYS COMP.                                            
335100     05  DS008K-SUT00024-SHIPT-UNT-ID PIC  S9(08).                        
335200     05  DS008K-SUT00024-OTBND-TRIP-ID PIC  S9(08).                       
335300 01  DS008-RCT00013-KEYS COMP.                                            
335400     05  DS008K-RCT00013-ORD-NBR      PIC  S9(08).                        
335500     05  DS008K-RCT00013-ORD-LNE-NBR  PIC  S9(08).                        
335600     05  DS008K-RCT00013-REC-SEQ-NBR  PIC  S9(04).                        
335700     05  DS008K-RCT00013-OPER-UNT-ID  PIC  S9(04).                        
335800     05  DS008K-RCT00013-FCLTY-ID     PIC  S9(04).                        
335900     05  DS008K-RCT00013-STR-NBR      PIC  S9(04).                        
336000     05  DS008K-RCT00013-STR-FCLTY-ID PIC  S9(04).                        
336100                                                                          
336200 01  DS008-TSUQADJ-NULL.                                                  
336300     05  DS008-TSUQADJ-NULLS OCCURS 11 TIMES                              
336400                                      PIC S9(4) COMP.                     
336500                                                                          
336600*    SUT_OTBND_PK (THERE ARE NO NULLABLE COLUMNS)                         
336700 01  DS008-DCLSUT00041.                                                   
336800     05  DS008-SUT00041-DATA.                                             
336900         10  DS008-SUT00041-SHIPT-UNT-ID    PIC  S9(18)V COMP-3.          
337000         10  DS008-SUT00041-TRN-NBR         PIC  S9(9) COMP.              
337100         10  DS008-SUT00041-RCVR-SEQ-NBR    PIC  S9(9) COMP.              
337200         10  DS008-SUT00041-TRN-TYP-CDE     PIC   X(2).                   
337300         10  DS008-SUT00041-PK-SKU-NBR      PIC  S9(8)V COMP-3.           
337400         10  DS008-SUT00041-SHPD-PK-QTY     PIC  S9(9) COMP.              
337500     05  DS008K-SUT00041-KEYS.                                            
337600         10  DS008K-SUT00041-SHIPT-UNT-ID    PIC  S9(18)V COMP-3.         
337700         10  DS008K-SUT00041-TRN-NBR         PIC  S9(9) COMP.             
337800         10  DS008K-SUT00041-RCVR-SEQ-NBR    PIC  S9(9) COMP.             
337900         10  DS008K-SUT00041-TRN-TYP-CDE     PIC   X(2).                  
338000         10  DS008K-SUT00041-PK-SKU-NBR      PIC  S9(8)V COMP-3.          
338100/                                                                         
338200*****************************************************************         
338300* COBOL DECLARATION FOR TABLE TVSCHVL                                     
338400*****************************************************************         
338500 01  WS-VSCHVL.                                                           
338600     10 WS-VSCHVL-CHARTC-CDE          PIC  S9(4) COMP.                    
338700     10 WS-VSCHVL-CHARTC-SEQ-NBR      PIC  S9(4) COMP.                    
338800     10 WS-VSCHVL-CHARTC-VAL-DESC     PIC   X(20).                        
338900     10 WS-VSCHVL-STAT-CDE            PIC   X(1).                         
339000 01  WS-VSCHVL-KEYS.                                                      
339100     10 DS-VSCHVL-CHARTC-CDE          PIC  S9(4) COMP.                    
339200     10 DS-VSCHVL-CHARTC-SEQ-NBR      PIC  S9(4) COMP.                    
339300/                                                                         
339400 01  DS008-XLT00007-KEYS.                                                 
339500     05  DS008K-XLT00007-PK-SKU-NBR   PIC  S9(08) COMP-3.                 
339600 01  DS008-XLT00008-KEYS.                                                 
339700     05  DS008K-XLT00008-PK-SKU-NBR   PIC  S9(08) COMP-3.                 
339800     05  DS008K-XLT00008-CPT-SKU-NBR  PIC  S9(08) COMP-3.                 
339900 01  DS008-XLT00009-KEYS.                                                 
340000     05  DS008K-XLT00009-PK-SKU-NBR   PIC  S9(08) COMP-3.                 
340100     05  DS008K-XLT00009-UPC-NBR      PIC  S9(15) COMP-3.                 
340200                                                                          
340300 01  DS008-RCT00017-KEYS.                                                 
340400     05  DS008K-RCT00017-PO-NBR       PIC  S9(08) COMP.                   
340500     05  DS008K-RCT00017-RCVR-SEQ-NBR PIC  S9(09) COMP.                   
340600     05  DS008K-RCT00017-CRE-BY-USR-ID PIC  X(08).                        
340700     05  DS008K-RCT00017-CRE-TMST     PIC   X(26).                        
340800/                                                                         
340900*    TRT_RUL TABLE                                                        
341000 01  DS008-TRT00014-KEYS.                                                 
341100     05  DS008K-TRT00014-RUL-ID       PIC  S9(09) COMP.                   
341200*    TRT_RULCNSTR TABLE                                                   
341300 01  DS008-TRT00015-KEYS.                                                 
341400     05  DS008K-TRT00015-RUL-ID       PIC  S9(09) COMP.                   
341500     05  DS008K-TRT00015-CNSTR-CDE    PIC  S9(04) COMP.                   
341600     05  DS008K-TRT00015-CNSTR-TYP-CDE PIC  X(08).                        
341700/                                                                         
341800*****************************************************************         
341900* COBOL DECLARATION FOR TABLE IMT_STYL_PRTNR                              
342000*****************************************************************         
342100 01  DS008-DCLIMT00016.                                                   
342200     05  DS008-IMT00016-DATA.                                             
342300         10 DS008-IMT16-SUB-CL-MDSEAR-ID  PIC  S9(6)V COMP-3.             
342400         10 DS008-IMT16-VS-ID             PIC  S9(9) COMP.                
342500         10 DS008-IMT16-BUS-PRTNR-ROL-CDE PIC   X(2).                     
342600         10 DS008-IMT16-ENT-ID            PIC  S9(9) COMP.                
342700 01  DS008-IMT00016-KEYS.                                                 
342800     05 DS008K-IMT16-SUB-CL-MDSEAR-ID     PIC  S9(6)V COMP-3.             
342900     05 DS008K-IMT16-VS-ID                PIC  S9(9) COMP.                
343000     05 DS008K-IMT16-BUS-PRTNR-ROL-CDE    PIC   X(2).                     
343100******************************************************************        
343200* COBOL DECLARATION FOR TABLE TRT_RUL                                     
343300******************************************************************        
343400 01  DS008-DCLTRT00014.                                                   
343500     10 WS-TRT00014-RUL-ID               PIC  S9(9) COMP.                 
343600   05 WS-TRT-RUL.                                                         
343700     10 WS-TRT00014-RUL-CDE              PIC   X(4).                      
343800     10 WS-TRT00014-RUL-TYP-CDE          PIC   X(3).                      
343900     10 WS-TRT00014-RUL-BEG-DTE          PIC   X(10).                     
344000     10 WS-TRT00014-RUL-END-DTE          PIC   X(10).                     
344100     10 WS-TRT00014-CRE-TMST             PIC   X(26).                     
344200     10 WS-TRT00014-CRE-BY-USR-ID        PIC   X(8).                      
344300 01  DS008-TRT00014-KEY.                                                  
344400     10 WSK-TRT00014-RUL-ID              PIC  S9(9) COMP.                 
344500                                                                          
344600******************************************************************        
344700* COBOL DECLARATION FOR TABLE TRT_RUL_CNSTR                               
344800******************************************************************        
344900 01  DS008-DCLTRT00015.                                                   
345000     10 WS-TRT00015-RUL-ID               PIC  S9(9) COMP.                 
345100   05 WS-TRT-RUL-CNSTR.                                                   
345200     10 WS-TRT00015-RUL-CNSTR-CDE        PIC  S9(4) COMP.                 
345300     10 WS-TRT00015-RUL-CNSTR-TYP-CDE    PIC   X(8).                      
345400     10 WS-TRT00015-RUL-CNSTR-VAL-TXT    PIC   X(30).                     
345500     10 WS-TRT00015-CRE-TMST             PIC   X(26).                     
345600     10 WS-TRT00015-CRE-BY-USR-ID        PIC   X(8).                      
345700 01  DS008-TRT00015-KEY.                                                  
345800     10 WSK-TRT00015-RUL-ID              PIC  S9(9) COMP.                 
345900     10 WSK-TRT00015-RUL-CNSTR-CDE       PIC  S9(4) COMP.                 
346000     10 WSK-TRT00015-RUL-CNSTR-TYP-CDE   PIC   X(8).                      
346100                                                                          
346200*    KEYS FOR TIMCNRL                                                     
346300 01  DS008-TIMCNRL-KEY.                                                   
346400     05  DS008K-IMCNRL-CONTNR-ID       PIC   X(12).                       
346500     05  DS008K-IMCNRL-CONTNR-SEQ-NBR  PIC  S9(4) COMP.                   
346600     05  DS008K-IMCNRL-PO-NBR          PIC  S9(9) COMP.                   
346700                                                                          
346800*    KEYS FOR TRT_AUD_RUL_CNSTR                                           
346900 01  DS008-TRT00018-KEY.                                                  
347000     05  DS008K-TRT00018-RUL-ID       PIC  S9(9) COMP.            04850001
347100     05  DS008K-TRT00018-CNSTR-CDE    PIC  S9(4) COMP.            04850001
347200     05  DS008K-TRT00018-CNSTR-TYP-CDE PIC   X(8).                04850001
347300     05  DS008K-TRT00018-CRE-TMST      PIC   X(26).                       
347400                                                                          
347500*    KEYS FOR TRT_AUD_RUL                                                 
347600 01  DS008-TRT00017-KEY.                                                  
347700     05  DS008K-TRT00017-AUD-CRE-TMST      PIC   X(26).                   
347800                                                                          
347900*****************************************************************         
348000* COBOL DECLARATION FOR TABLE IMT_LBL                                     
348100*****************************************************************         
348200 01  DS008-DCLIMT00000.                                                   
348300     05  DS008-IMT00000-DATA.                                             
348400         10 DS008-IMT00-LBL-SEQ-NBR       PIC  S9(4) COMP.                
348500         10 DS008-IMT00-LBL-TYP-CDE       PIC   X(1).                     
348600         10 DS008-IMT00-LBL-ABBR-NM       PIC   X(5).                     
348700         10 DS008-IMT00-PRIC-TIER-SEQ-NBR PIC  S9(4) COMP.                
348800         10 DS008-IMT00-LFSTYL-SEQ-NBR    PIC  S9(4) COMP.                
348900 01  DS008-IMT00000-KEYS.                                                 
349000     05 DS008K-IMT00-LBL-SEQ-NBR          PIC  S9(4) COMP.                
349100                                                                          
349200 01  DS008-WST00002-KEYS.                                                 
349300     05  DS008K-WST00002-EXT-SHP-ID           PIC   X(20).                
349400     05  DS008K-WST00002-PO-NBR               PIC  S9(9) COMP.            
349500     05  DS008K-WST00002-PO-LNE-NBR           PIC  S9(9) COMP.            
349600     05  DS008K-WST00002-RCVR-SEQ-NBR         PIC  S9(9) COMP.            
349700     05  DS008K-WST00002-PREPK-ID             PIC  S9(4) COMP.            
349800                                                                          
349900 01  DS008-DCLWST00001.                                                   
350000     05  DS008-DCLWST00001-DATA.                                          
350100         10 DS008-EXT-SHP-ID          PIC   X(20).                        
350200         10 DS008-INTR-TRIP-ID        PIC  S9(9) COMP.                    
350300         10 DS008-SOR-CDE             PIC   X(2).                         
350400         10 DS008-DMY-SEQ-NBR         PIC  S9(4) COMP.                    
350500         10 DS008-DEST-LOC-NBR        PIC  S9(4) COMP.                    
350600         10 DS008-DWNLD-CDE           PIC   X(1).                         
350700         10 DS008-RCPT-TMST           PIC   X(26).                        
350800         10 DS008-CRE-USR-ID          PIC   X(8).                         
350900         10 DS008-CRE-TMST            PIC   X(26).                        
351000         10 DS008-DWNLD-TMST          PIC   X(26).                        
351100         10 DS008-LAST-PRCG-TMST      PIC   X(26).                        
351200         10 DS008-PRC-CDE             PIC   X(1).                         
351300         10 DS008-VER-NBR             PIC  S9(4) COMP.                    
351400         10 DS008-CRE-PGM-CDE         PIC   X(8).                         
351500     05  DS008-DST00001-NULL.                                             
351600         10 DS008-DST00001-NULLS                                          
351700                              OCCURS 14 TIMES PIC S9(4) COMP.             
351800 01  DS008-WST00001-KEYS.                                                 
351900     05  DS008K-WST00001-EXT-SHP-ID   PIC X(20).                          
343100******************************************************************        
343200* COBOL DECLARATION FOR TABLE TRT_WHSE_RPLNT_INBND_PO                     
343300******************************************************************        
343400*01  DS008-DCLTRT00057.                                                   
343500*    10 WS-TRT57-WHSE-RPLNT-INBND-ID   PIC  S9(9) COMP.                   
343500*    10 WS-TRT57-PO-NBR                PIC  S9(9) COMP.                   
343500*    10 WS-TRT57-EXTL-REF-NBR          PIC   X(15).                       
343700*    10 WS-TRT57-DCONSLR-VEH-DPRTR-IND PIC   X(1).                        
343800*    10 WS-TRT57-WHSE-ARRVL-IND        PIC   X(1).                        
343900*    10 WS-TRT57-WHSE-AUD-CMPLT-IND    PIC   X(1).                        
344000*    10 WS-TRT57-CRE-USR-ID            PIC   X(8).                        
344100*    10 WS-TRT57-CRE-TMST              PIC   X(26).                       
344200*    10 WS-TRT57-LAST-UPD-USR-ID       PIC   X(8).                        
344200*    10 WS-TRT57-LAST-UPD-TMST         PIC   X(26).                       
344300*01  DS008-TRT00057-KEYS.                                                 
343500*    10 WSK-TRT57-WHSE-RPLNT-INBND-ID  PIC  S9(9) COMP.                   
343500*    10 WSK-TRT57-PO-NBR               PIC  S9(9) COMP.                   
343500*    10 WSK-TRT57-EXTL-REF-NBR         PIC   X(15).                       
343100******************************************************************        
343200* COBOL DECLARATION FOR TABLE TRT_WHSE_RPLNT_INBND_CART                   
343300******************************************************************        
343400*01  DS008-DCLTRT00058.                                                   
343500*    10 WS-TRT58-WHSE-RPLNT-INBND-ID   PIC  S9(9) COMP.                   
343500*    10 WS-TRT58-PO-NBR                PIC  S9(9) COMP.                   
343500*    10 WS-TRT58-EXTL-REF-NBR          PIC   X(15).                       
343500*    10 WS-TRT58-SSCC-ID               PIC   X(48).                       
343700*    10 WS-TRT58-DCONSLR-DPRTR-IND     PIC   X(1).                        
343800*    10 WS-TRT58-WHSE-ARRVL-SSCC-IND   PIC   X(1).                        
343900*    10 WS-TRT58-WHSE-AUD-CMPLT-IND    PIC   X(1).                        
344000*    10 WS-TRT58-WHSE-AUD-UNT-QTY      PIC   S9(9) COMP.                  
344000*    10 WS-TRT58-CRE-USR-ID            PIC   X(8).                        
344100*    10 WS-TRT58-CRE-TMST              PIC   X(26).                       
344200*    10 WS-TRT58-LAST-UPD-USR-ID       PIC   X(8).                        
344200*    10 WS-TRT58-LAST-UPD-TMST         PIC   X(26).                       
344300*01  DS008-TRT00058-KEYS.                                                 
343500*    10 WSK-TRT58-WHSE-RPLNT-INBND-ID  PIC  S9(9) COMP.                   
343500*    10 WSK-TRT58-PO-NBR               PIC  S9(9) COMP.                   
343500*    10 WSK-TRT58-EXTL-REF-NBR         PIC   X(15).                       
343500*    10 WSK-TRT58-SSCC-ID              PIC   X(48).                       
343100******************************************************************        
343200* COBOL DECLARATION FOR TABLE TRT_WHSE_RPLNT_INBND                        
343300******************************************************************        
343400*01  DS008-DCLTRT00056.                                                   
343500*    10 WS-TRT56-WHSE-RPLNT-INBND-ID   PIC  S9(9) COMP.                   
343500*    10 WS-TRT56-OWNER-SCAC-ID         PIC   X(4).                        
343500*    10 WS-TRT56-VEH-NBR               PIC   X(10).                       
343700*    10 WS-TRT56-DCONSLR-DPRTR-TMST    PIC   X(26).                       
343800*    10 WS-TRT56-DCONSLR-TRP-ID        PIC   X(20).                       
343900*    10 WS-TRT56-WHSE-LOC-ID           PIC  S9(4) COMP.                   
344000*    10 WS-TRT56-DCONSLR-SCAC-CDE      PIC   X(4).                        
344000*    10 WS-TRT56-WHSE-ARRVL-TMST       PIC   X(26).                       
344000*    10 WS-TRT56-WHSE-AUD-CMPLT-TMST   PIC   X(26).                       
344000*    10 WS-TRT56-POE-STD-EDI-CDE       PIC   X(4).                        
344000*    10 WS-TRT56-CRE-USR-ID            PIC   X(8).                        
344100*    10 WS-TRT56-CRE-TMST              PIC   X(26).                       
344200*    10 WS-TRT56-LAST-UPD-USR-ID       PIC   X(8).                        
344200*    10 WS-TRT56-LAST-UPD-TMST         PIC   X(26).                       
344300*01  DS008-TRT00056-KEYS.                                                 
343500*    10 WSK-TRT56-WHSE-RPLNT-INBND-ID  PIC  S9(9) COMP.                   
343100******************************************************************        
343200* COBOL DECLARATION FOR TABLE TRT_WHSE_RPLNT_INBND_PO_AUD                 
343300******************************************************************        
343400*01  DS008-DCLTRT00060.                                                   
343500*    10 WS-TRT60-WHSE-RPLNT-INBND-ID   PIC  S9(9) COMP.                   
343500*    10 WS-TRT60-PO-NBR                PIC  S9(9) COMP.                   
343500*    10 WS-TRT60-EXTL-REF-NBR          PIC   X(15).                       
343700*    10 WS-TRT60-DCONSLR-VEH-DPRTR-IND PIC   X(1).                        
343800*    10 WS-TRT60-WHSE-ARRVL-IND        PIC   X(1).                        
343900*    10 WS-TRT60-WHSE-AUD-CMPLT-IND    PIC   X(1).                        
344000*    10 WS-TRT60-CRE-USR-ID            PIC   X(8).                        
344100*    10 WS-TRT60-CRE-TMST              PIC   X(26).                       
344200*    10 WS-TRT60-LAST-UPD-USR-ID       PIC   X(8).                        
344200*    10 WS-TRT60-LAST-UPD-TMST         PIC   X(26).                       
344200*    10 WS-TRT60-AUD-FUNC-CDE          PIC   X(1).                        
344200*    10 WS-TRT60-AUD-TMST              PIC   X(26).                       
344300*01  DS008-TRT00060-KEYS.                                                 
343500*    10 WSK-TRT60-WHSE-RPLNT-INBND-ID  PIC  S9(9) COMP.                   
343500*    10 WSK-TRT60-PO-NBR               PIC  S9(9) COMP.                   
343500*    10 WSK-TRT60-EXTL-REF-NBR         PIC   X(15).                       
344200*    10 WSK-TRT60-LAST-UPD-TMST        PIC   X(26).                       
343100******************************************************************        
343200* COBOL DECLARATION FOR TABLE TRT_WHSE_RPLNT_INBND_CART_AUD               
343300******************************************************************        
343400*01  DS008-DCLTRT00061.                                                   
343500*    10 WS-TRT61-WHSE-RPLNT-INBND-ID   PIC  S9(9) COMP.                   
343500*    10 WS-TRT61-PO-NBR                PIC  S9(9) COMP.                   
343500*    10 WS-TRT61-EXTL-REF-NBR          PIC   X(15).                       
343500*    10 WS-TRT61-SSCC-ID               PIC   X(48).                       
343700*    10 WS-TRT61-DCONSLR-DPRTR-IND     PIC   X(1).                        
343800*    10 WS-TRT61-WHSE-ARRVL-SSCC-IND   PIC   X(1).                        
343900*    10 WS-TRT61-WHSE-AUD-CMPLT-IND    PIC   X(1).                        
344000*    10 WS-TRT61-WHSE-AUD-UNT-QTY      PIC   S9(9) COMP.                  
344000*    10 WS-TRT61-CRE-USR-ID            PIC   X(8).                        
344100*    10 WS-TRT61-CRE-TMST              PIC   X(26).                       
344200*    10 WS-TRT61-LAST-UPD-USR-ID       PIC   X(8).                        
344200*    10 WS-TRT61-LAST-UPD-TMST         PIC   X(26).                       
344200*    10 WS-TRT61-AUD-FUNC-CDE          PIC   X(1).                        
344200*    10 WS-TRT61-AUD-TMST              PIC   X(26).                       
344300*01  DS008-TRT00061-KEYS.                                                 
343500*    10 WSK-TRT61-WHSE-RPLNT-INBND-ID  PIC  S9(9) COMP.                   
343500*    10 WSK-TRT61-PO-NBR               PIC  S9(9) COMP.                   
343500*    10 WSK-TRT61-EXTL-REF-NBR         PIC   X(15).                       
343500*    10 WSK-TRT16-SSCC-ID              PIC   X(48).                       
344200*    10 WSK-TRT61-LAST-UPD-TMST        PIC   X(26).                       
343100******************************************************************        
343200* COBOL DECLARATION FOR TABLE TRT_WHSE_RPLNT_INBND_AUD                    
343300******************************************************************        
343400*01  DS008-DCLTRT00059.                                                   
343500*    10 WS-TRT59-WHSE-RPLNT-INBND-ID   PIC  S9(9) COMP.                   
343500*    10 WS-TRT59-OWNER-SCAC-ID         PIC   X(4).                        
343500*    10 WS-TRT59-VEH-NBR               PIC   X(10).                       
343700*    10 WS-TRT59-DCONSLR-DPRTR-TMST    PIC   X(26).                       
343800*    10 WS-TRT59-DCONSLR-TRP-ID        PIC   X(20).                       
343900*    10 WS-TRT59-WHSE-LOC-ID           PIC  S9(4) COMP.                   
344000*    10 WS-TRT59-DCONSLR-SCAC-CDE      PIC   X(4).                        
344000*    10 WS-TRT59-WHSE-ARRVL-TMST       PIC   X(26).                       
344000*    10 WS-TRT59-WHSE-AUD-CMPLT-TMST   PIC   X(26).                       
344000*    10 WS-TRT59-POE-STD-EDI-CDE       PIC   X(4).                        
344000*    10 WS-TRT59-CRE-USR-ID            PIC   X(8).                        
344100*    10 WS-TRT59-CRE-TMST              PIC   X(26).                       
344200*    10 WS-TRT59-LAST-UPD-USR-ID       PIC   X(8).                        
344200*    10 WS-TRT59-LAST-UPD-TMST         PIC   X(26).                       
344200*    10 WS-TRT59-AUD-FUNC-CDE          PIC   X(1).                        
344200*    10 WS-TRT59-AUD-TMST              PIC   X(26).                       
344300*01  DS008-TRT00059-KEYS.                                                 
343500*    10 WSK-TRT59-WHSE-RPLNT-INBND-ID  PIC  S9(9) COMP.                   
344200*    10 WSK-TRT59-LAST-UPD-TMST        PIC   X(26).                       
239500******************************************************************        
239600* COBOL DECLARATION FOR TABLE TASDTPL                                     
239700******************************************************************        
239800 01  WS-ASDTPL.                                                           
239900     05  WS-ASDTPL-DATA.                                                  
240000         10 WS-ASDTPL-ASNHDR-ID     PIC S9(9) COMP.                       
240100         10 WS-ASDTPL-ASNDTL-NBR    PIC S9(7)V COMP-3.                    
240200         10 WS-ASDTPL-PO-LN-NBR     PIC S9(3)V COMP-3.                    
240300         10 WS-ASDTPL-ASSOC-QTY     PIC S9(7)V COMP-3.                    
240400         10 WS-ASDTPL-ASDTPL-ALLOC-IND PIC X(1).                          
240500         10 WS-ASDTPL-SHIPT-VAR-QTY PIC S9(7)V COMP-3.                    
240600         10 WS-ASDTPL-PR-CHG-EFF-DAY-NBR PIC S9(2)V COMP-3.               
240700         10 WS-ASDTPL-PR-VAR-IND    PIC X(1).                             
240800         10 WS-ASDTPL-PR-DISC-IND   PIC X(1).                             
240900         10 WS-ASDTPL-PO-NBR        PIC X(22).                            
243200     05  WS-ASDTPL-NULL.                                                  
243300         10 WS-ASDTPL-NULLS OCCURS 10 TIMES PIC S9(4) COMP.               
243400 01  WS-ASDTPL-KEYS.                                                      
243500     10 DS-ASDTPL-ASNHDR-ID           PIC  S9(9) COMP.                    
243600     10 DS-ASDTPL-ASNDTL-NBR          PIC  S9(7)V COMP-3.                 
243600     10 DS-ASDTPL-PO-LN-NBR           PIC S9(3)V COMP-3.                  
239500******************************************************************        
239600* COBOL DECLARATION FOR TABLE TTRDPRT                                     
239700******************************************************************        
239800 01  WS-TRDPRT.                                                           
239900     05  WS-TRDPRT-DATA.                                                  
243500         10 WS-TRDPRT-TP-DKEY       PIC  S9(9) COMP.                      
243600         10 WS-TRDPRT-ENT-ID        PIC  S9(9) COMP.                      
240000         10 WS-TRDPRT-VEND-INCHG-ID PIC X(15).                            
240000         10 WS-TRDPRT-VEND-INCHG-ID-DESC PIC X(2).                        
240000         10 WS-TRDPRT-NETWK-ID      PIC X(1).                             
240000         10 WS-TRDPRT-KOHL-INCHG-ID PIC X(15).                            
240000         10 WS-TRDPRT-KOHL-INCHG-ID-DESC PIC X(2).                        
240000         10 WS-TRDPRT-SEND-FMT-VER-CDE PIC X(5).                          
240000         10 WS-TRDPRT-SEND-FMT-NME  PIC X(1).                             
240000         10 WS-TRDPRT-LAST-SEND-CNTL-NBR  PIC S9(9)V COMP-3.              
240000         10 WS-TRDPRT-SEND-CNTL-NBR-CDE  PIC X(1).                        
240000         10 WS-TRDPRT-OVRRD-SND-CNTL-NBR  PIC S9(9)V COMP-3.              
240000         10 WS-TRDPRT-OVRRD-SND-CNTL-ID PIC X(1).                         
240000         10 WS-TRDPRT-RECV-FMT-VER-CDE  PIC X(5).                         
240000         10 WS-TRDPRT-RECV-FMT-NME      PIC X(1).                         
240000         10 WS-TRDPRT-LAST-RECV-CNTL-NBR  PIC S9(9)V COMP-3.              
240000         10 WS-TRDPRT-RECV-CNTL-NBR-CDE PIC X(1).                         
240000         10 WS-TRDPRT-OVRRD-RCV-CNTL-NBR  PIC S9(9)V COMP-3.              
240000         10 WS-TRDPRT-OVRRD-RCV-CNTL-ID PIC X(1).                         
240000         10 WS-TRDPRT-SETUP-DTE         PIC X(10).                        
240000         10 WS-TRDPRT-LAST-CHG-DTE      PIC X(10).                        
240000         10 WS-TRDPRT-LAST-CHG-UID      PIC X(8).                         
240000         10 WS-TRDPRT-ACTV-DTE          PIC X(10).                        
240000         10 WS-TRDPRT-INACTV-DTE        PIC X(10).                        
240000         10 WS-TRDPRT-SER-LVL-CDE       PIC X(3).                         
240000         10 WS-TRDPRT-NOTES-TXT         PIC X(80).                        
240000         10 WS-TRDPRT-LAST-CALL-DTE     PIC X(10).                        
240000         10 WS-TRDPRT-NEXT-CALL-DTE     PIC X(10).                        
240000         10 WS-TRDPRT-SEND-AUTH-INFO-ID PIC X(10).                        
240000         10 WS-TRDPRT-SEND-AUTH-INF-DESC PIC X(2).                        
240000         10 WS-TRDPRT-SEND-SEC-INFO-ID  PIC X(10).                        
240000         10 WS-TRDPRT-SEND-SEC-INFO-DESC PIC X(2).                        
240000         10 WS-TRDPRT-SEND-DATA-ELEM-IND PIC X(2).                        
240000         10 WS-TRDPRT-SEND-SEG-TERM-IND  PIC X(2).                        
240000         10 WS-TRDPRT-SEND-SUB-ELEM-IND  PIC X(2).                        
240000         10 WS-TRDPRT-SEND-ACK-REQD-IND  PIC X(1).                        
240000         10 WS-TRDPRT-INTRCONN-NETWK-IND PIC X(1).                        
240000         10 WS-TRDPRT-FA-COM-MTHD-CDE    PIC X(1).                        
243400 01  WS-TRDPRT-KEYS.                                                      
243500     10 DS-TRDPRT-TP-DKEY             PIC  S9(9) COMP.                    
243600     10 DS-TRDPRT-ENT-ID              PIC  S9(9) COMP.                    
239500******************************************************************        
239600* COBOL DECLARATION FOR TABLE TFGTRST                                     
239700******************************************************************        
239800 01  WS-FGTRST.                                                           
239900     05  WS-FGTRST-DATA.                                                  
243500         10 WS-FGTRST-TP-DKEY                PIC  S9(9) COMP.             
243600         10 WS-FGTRST-TP-DKEY-TMST           PIC   X(26).                 
240000         10 WS-FGTRST-FUNC-CDE-SEQ-NBR       PIC  S9(9) COMP.             
240000         10 WS-FGTRST-TRN-SET-SEQ-NBR        PIC  S9(9) COMP.             
240000         10 WS-FGTRST-TRN-SET-CDE            PIC   X(3).                  
240000         10 WS-FGTRST-FUNC-CDE-CNTL-NBR      PIC  S9(9)V COMP-3.          
240000         10 WS-FGTRST-VEND-ACK-IND           PIC   X(1).                  
240000         10 WS-FGTRST-TRN-SET-CNTL-NBR       PIC   X(9).                  
240000         10 WS-FGTRST-TRN-DTL-TXT            PIC   X(30).                 
240000         10 WS-FGTRST-CHARS-XMIT-NBR         PIC  S9(9) COMP.             
240000         10 WS-FGTRST-RTE-IND                PIC   X(1).                  
240000         10 WS-FGTRST-TRANSL-ERR-IND         PIC   X(1).                  
240000         10 WS-FGTRST-TRN-RLSE-TMST          PIC   X(26).                 
240000         10 WS-FGTRST-PO-ACKNL-STAT-CDE      PIC   X(1).                  
243400 01  WS-FGTRST-KEYS.                                                      
243500     10 DS-FGTRST-TP-DKEY             PIC  S9(9) COMP.                    
243500     10 DS-FGTRST-TP-DKEY-TMST        PIC   X(26).                        
243500     10 DS-FGTRST-FUNC-CDE-SEQ-NBR    PIC  S9(9) COMP.                    
243500     10 DS-FGTRST-TRN-SET-SEQ-NBR     PIC  S9(9) COMP.                    
239500******************************************************************        
239600* COBOL DECLARATION FOR TABLE TINTTRN                                     
239700******************************************************************        
239800 01  WS-INTTRN.                                                           
239900     05  WS-INTTRN-DATA.                                                  
243500         10 WS-INTTRN-TP-DKEY                PIC  S9(9) COMP.             
243600         10 WS-INTTRN-TP-DKEY-TMST           PIC   X(26).                 
240000         10 WS-INTTRN-DIR-IND                PIC   X(1).                  
240000         10 WS-INTTRN-INCHG-CNTL-NBR         PIC  S9(9)V COMP-3.          
240000         10 WS-INTTRN-CRE-DTE                PIC   X(10).                 
240000         10 WS-INTTRN-CRE-TME                PIC   X(8).                  
240000         10 WS-INTTRN-MAILBOX-REC-DTE        PIC   X(10).                 
240000         10 WS-INTTRN-MAILBOX-REC-TME        PIC   X(8).                  
240000         10 WS-INTTRN-MAILBOX-PU-DTE         PIC   X(10).                 
240000         10 WS-INTTRN-MAILBOX-PU-TME         PIC   X(8).                  
240000         10 WS-INTTRN-ERR-IND                PIC   X(1).                  
240000         10 WS-INTTRN-PROD-TEST-IND          PIC   X(1).                  
240000         10 WS-INTTRN-TRANSL-SESS-ID         PIC  S9(9) COMP.             
240000         10 WS-INTTRN-TRN-MANL-FRCD-IND      PIC   X(1).                  
243400 01  WS-INTTRN-KEYS.                                                      
243500     10 DS-INTTRN-TP-DKEY             PIC  S9(9) COMP.                    
243500     10 DS-INTTRN-TP-DKEY-TMST        PIC   X(26).                        
