000100*************************************************************             
000200*    DSWS009 WORKING STORAGE FOR PROD-TO-TEST UTILITIES     *             
000300*************************************************************             
000400                                                                          
000500 01  DS009-VARIABLES.                                                     
000600     05  DS009-RECORD-FILLER    PIC 9(09) VALUE 75.                       
000700     05  DS009X-RECORD-FILLER   PIC 9(09) VALUE 84.                       
000800     05  DS009-UPDATE-COUNT     PIC 9(09) VALUE 0.                        
000900     05  DS009-TUPDATE-COUNT    PIC 9(09) VALUE 0.                        
001000     05  DS009-DISP-NBR         PIC ZZ,ZZZ,ZZ9.                           
001000     05  DS009-DISP-PO          PIC ZZZZZZZ9.                             
001100     05  DS009-COMMIT-COUNT     PIC 9(09) VALUE 025.                      
001100*    05  DS009-COMMIT-COUNT     PIC 9(09) VALUE 005.                      
001200     05  DS009-RECORD-SIZE      PIC 9(09) VALUE 0.                        
001300     05  DS009-TBLE-DATA-SIZE   PIC 9(09) VALUE 0.                        
001400     05  DS009-TABLE-LRECL      PIC S9(09) COMP-3.                        
001500     05  DS009-PKYS             PIC X(50).                                
001600     05  DS009-CNTL-J           PIC S9(04) COMP.                          
001700     05  DS009-LAST-COMMIT-TIME PIC X(08).                                
001800     05  DS009-ELAPSED-TIME     PIC S9(06) COMP-3 VALUE ZERO.             
001900                                                                          
002000 01  DS009-TIME-IN            PIC X(08).                                  
002100 01  DS009-DATE-IN            PIC X(10).                                  
002200                                                                          
002300 01  DS009-JULIAN-DATE           PIC 9(05)  VALUE ZEROS.                  
002400                                                                          
002500 01  DS009-PRDTOTST-SWITCHES.                                             
002600     05  DS009-CURRENT-DATA-SW PIC X(03) VALUE 'NO '.                     
002700         88  DS009-MORE-DATA          VALUE 'YES'.                        
002800         88  DS009-NO-MORE-DATA       VALUE 'NO '.                        
002900     05  DS009-SAVE-DATA-SW    PIC X(03) VALUE 'NO '.                     
003000     05  DS009-END-OF-POS-SW   PIC X(03) VALUE 'NO '.                     
003100         88  DS009-PO-NBR-EOF         VALUE 'YES'.                        
003200     05  DS009-END-OF-JOB-SW   PIC X(03) VALUE 'NO '.                     
003300         88  DS009-END-OF-DATA        VALUE 'YES'.                        
003400         88  DS009-NOT-END-OF-DATA    VALUE 'NO '.                        
003500     05  DS009-RETRY-COUNTER   PIC S9(04) COMP VALUE ZERO.                
003600     05  DS009-END-OF-CTL-SW     PIC X(03) VALUE 'NO '.                   
003700         88 DS009-CNTL-EOF            VALUE 'YES'.                        
003800         88 DS009-NOT-CNTL-EOF        VALUE 'NO '.                        
003900     05  DS009-PROCESS-SW           PIC X(01).                            
004000         88  DS009-D-PGM              VALUE 'D'.                          
004100         88  DS009-I-PGM              VALUE 'I'.                          
004200         88  DS009-S-PGM              VALUE 'S'.                          
004300     05  DS009-PROCESS-TABLE        PIC X(18).                            
004400     05  DS009-PROCESS-TABLE-SW     PIC X(03) VALUE 'NO '.                
004500         88  DS009-DO-PROCESS         VALUE 'YES'.                        
004600         88  DS009-DO-NOT-PROCESS     VALUE 'NO '.                        
004700         88  DS009-BYPASS-TABLE       VALUE 'BYP'.                        
004800                                                                          
004900 01  DS009-ABEND-FIELDS.                                                  
005000     05  DS009-PROGRAM                PIC X(8)  VALUE SPACES.             
005100     05  DS009-PARAGRAPH              PIC X(50) VALUE SPACES.             
005200     05  DS009-OPERATION              PIC X(50) VALUE SPACES.             
005300     05  DS009-STRUCTURE-1            PIC X(18) VALUE SPACES.             
005400     05  DS009-STRUCTURE-2            PIC X(18) VALUE SPACES.             
005500     05  DS009-STRUCTURE-3            PIC X(18) VALUE SPACES.             
005600     05  DS009-STATUS                 PIC XX    VALUE SPACES.             
005700                                                                          
005800 01  DS009-ABEND-CODE              PIC S9(4) COMP SYNC                    
005900                                             VALUE ZEROS.                 
006000                                                                          
006100 01  DS009-PO-NBR-REC.                                                    
006200     05 PO-NBR-IN           PIC 9(09) VALUE ZEROS.                        
006300     05 PO-COPY-COMMENTS    PIC X(71) VALUE SPACES.                       
006400                                                                          
006500 01  DS009-PO-NBRS-TO-EXTRACT.                                            
006600     05 DS009-PO-TABLE OCCURS 1000 TIMES                                  
006700             INDEXED BY DS009-PO-IDX.                                     
006800         10 DS009-PO-NBR          PIC 9(09).                              
006900                                                                          
007000 01  DS009-PO-NBRS-VARIABLES.                                             
007100     05 DS009-PO-SUB          PIC 9(04) VALUE ZEROS.                      
007200     05 DS009-PO-SUB-MAX      PIC 9(04) VALUE ZEROS.                      
007300     05 DS009-PO-SUB-LIMIT    PIC 9(04) VALUE 1000.                       
007400                                                                          
007500 01  DS009-CNTL-REC.                                                      
007600     05 DS009-CNTL-TABLE-IN  PIC X(18) VALUE SPACES.                      
007700     05 DS009-CNTL-SEL-IN    PIC X(01) VALUE SPACES.                      
007800     05 DS009-CNTL-DEL-IN    PIC X(01) VALUE SPACES.                      
007900     05 DS009-CNTL-INS-IN    PIC X(01) VALUE SPACES.                      
008000     05 FILLER               PIC X(08).                                   
008100     05 DS009-CNTL-SEQ-IN    PIC X(04).                                   
008200     05 FILLER               PIC X(01).                                   
008300     05 DS009-DELETE-RULE-IND PIC X(01).                                  
008400         88  DS009-DELETE-CASCADE  VALUE 'C'.                             
008500         88  DS009-DELETE-RESTRICT VALUE 'R'.                             
008600     05 FILLER               PIC X(01).                                   
008700     05 DS009-CNTL-GROUP-NBR PIC X(01).                                   
008800     05 FILLER               PIC X(43).                                   
008900                                                                          
009000 01  DS009-CNTL-TABLE.                                                    
009100     05 DS009-CNTL-RECORDS                                                
009200         OCCURS 200 TIMES                                                 
009300         INDEXED BY CNTL-I                                                
009400                    DS009-SRCH-IDX.                                       
009500         10 CNTL-TABLE           PIC X(18).                               
009600         10 CNTL-SEL             PIC X(01).                               
009700         10 CNTL-DEL             PIC X(01).                               
009800         10 CNTL-INS             PIC X(01).                               
009900         10 DS009-READ-COUNT     PIC S9(07) COMP-3.                       
010000         10 DS009-WRITE-COUNT    PIC S9(07) COMP-3.                       
010100         10 DS009-CNTL-SEQ       PIC X(04).                               
010200         10 DS009-GROUP-NBR      PIC X(01).                               
010300                                                                          
010400 01  CNTL-SUB-LIMIT          PIC 9(04) VALUE 200.                         
010500 01  CNTL-SUB-MAX            PIC 9(04) VALUE ZEROS.                       
010600                                                                          
