      ******************************************************************        
      * TIME DIMENSION LAYOUT FOR TERADATA                                      
      * LENGTH: 345                                                             
      ******************************************************************        
       01  EI002-TM-DIM-RECORD.                                                 
           05  EI002-TM-DIM-KY-DTE          PIC X(10).                          
           05  EI002-JLN-DTE                PIC 9(7).                           
           05  FILLER REDEFINES EI002-JLN-DTE.                                  
               10  EI002-JLN-DTE-CCYY       PIC 9(4).                           
               10  EI002-JLN-DTE-DDD        PIC 9(3).                           
           05  EI002-DAY-NBR                PIC X(01).                          
           05  EI002-DAY-NM                 PIC X(09).                          
           05  EI002-BEG-DAY-IN-WK-IND      PIC X(1).                           
           05  EI002-LAST-DAY-IN-WK-IND     PIC X(1).                           
           05  EI002-BEG-DAY-IN-MN-IND      PIC X(1).                           
           05  EI002-LAST-DAY-IN-MN-IND     PIC X(1).                           
           05  EI002-BEG-DAY-IN-QTR-IND     PIC X(1).                           
           05  EI002-BEG-DAY-IN-YR-IND      PIC X(1).                           
           05  EI002-TDA-NWK-DTE            PIC X(10).                          
           05  EI002-TDA-PWK-DTE            PIC X(10).                          
           05  EI002-TDA-PWK2-DTE           PIC X(10).                          
           05  EI002-TDA-PWK3-DTE           PIC X(10).                          
           05  EI002-TDA-PWK4-DTE           PIC X(10).                          
           05  EI002-FSCL-WK-OF-MN-NBR      PIC X(01).                          
           05  EI002-FSCL-WK-ID             PIC 9(6).                           
           05  FILLER REDEFINES EI002-FSCL-WK-ID.                               
               10  EI002-FSCL-WK-ID-CCYY    PIC 9(4).                           
               10  EI002-FSCL-WK-ID-WK      PIC 9(2).                           
           05  EI002-FSCL-WK-NBR            PIC X(2).                           
           05  EI002-FSCL-MN-ID             PIC 9(6).                           
           05  FILLER REDEFINES EI002-FSCL-MN-ID.                               
               10  EI002-FSCL-MN-ID-CCYY    PIC 9(4).                           
               10  EI002-FSCL-MN-ID-MN      PIC 9(2).                           
           05  EI002-FSCL-MN-NBR            PIC X(2).                           
           05  EI002-FSCL-MN-NM             PIC X(9).                           
           05  EI002-PREV-FSCL-MN-ID        PIC 9(9).                           
           05  FILLER REDEFINES EI002-PREV-FSCL-MN-ID.                          
               10  FILLER                     PIC   9(03).                      
               10  EI002-PREV-FSCL-MN-CCYY    PIC   9(04).                      
               10  EI002-PREV-FSCL-MN         PIC   9(02).                      
           05  EI002-FSCL-QTR-ID            PIC 9(6).                           
           05  FILLER REDEFINES EI002-FSCL-QTR-ID.                              
               10  EI002-FSCL-QTR-ID-CCYY   PIC 9(4).                           
               10  EI002-FSCL-QTR-ID-QTR    PIC 9(2).                           
           05  EI002-FSCL-QTR-NBR           PIC X(1).                           
           05  EI002-BEGG-FSCL-MTD-DTE      PIC X(10).                          
           05  EI002-BEGG-FSCL-QTD-DTE      PIC X(10).                          
           05  EI002-BEGG-FSCL-YTD-DTE      PIC X(10).                          
           05  EI002-PREV-FSCL-QTR-ID       PIC 9(9).                           
           05  FILLER REDEFINES EI002-PREV-FSCL-QTR-ID.                         
               10  FILLER                     PIC   9(03).                      
               10  EI002-PREV-FSCL-QTR-CCYY   PIC   9(04).                      
               10  EI002-PREV-FSCL-QTR        PIC   9(02).                      
           05  EI002-LY-FSCL-QTR-ID         PIC 9(9).                           
           05  FILLER REDEFINES EI002-LY-FSCL-QTR-ID.                           
               10  FILLER                      PIC   9(03).                     
               10  EI002-LY-FSCL-QTR-CCYY PIC        9(04).                     
               10  EI002-LY-FSCL-QTR           PIC   9(02).                     
           05  EI002-FSCL-YR-NBR            PIC X(4).                           
           05  EI002-LY-FSCL-YR-NBR         PIC X(04).                          
           05  EI002-LY-LAST-EOW-DTE        PIC X(10).                          
           05  EI002-FSCL-YR-AND-DAY-NBR    PIC 9(7).                           
           05  FILLER REDEFINES EI002-FSCL-YR-AND-DAY-NBR.                      
               10  EI002-FSCL-YR-DAY-CCYY   PIC 9(4).                           
               10  EI002-FSCL-YR-DAY-DDD    PIC 9(3).                           
           05  EI002-FSCL-MN-LST-BOW-IND    PIC X(1).                           
           05  EI002-LAST-YR-FSCL-MN-ID     PIC 9(6).                           
           05  FILLER REDEFINES EI002-LAST-YR-FSCL-MN-ID.                       
               10  EI002-LAST-YR-FSCL-MN-CCYY PIC 9(04).                        
               10  EI002-LAST-YR-FSCL-MN      PIC   9(02).                      
           05  EI002-SEA-ID                 PIC X(5).                           
           05  FILLER REDEFINES EI002-SEA-ID.                                   
               10  EI002-SEA-ID-CCYY        PIC 9(4).                           
               10  EI002-SEA-S-F            PIC X(1).                           
           05  EI002-SEA-DESC               PIC X(6).                           
           05  EI002-BEG-SEA-IND            PIC X(1).                           
           05  EI002-END-SEA-IND            PIC X(1).                           
           05  EI002-BEGG-FSCL-STD-DTE      PIC X(10).                          
           05  EI002-PREV-SEA-ID            PIC X(05).                          
           05  FILLER REDEFINES EI002-PREV-SEA-ID.                              
               10  EI002-PREV-SEA-CCYY      PIC X(04).                          
               10  EI002-PREV-SEA-S-F       PIC X(01).                          
           05  EI002-LAST-SEA-EOW-DTE       PIC X(10).                          
           05  EI002-LY-SEA-ID              PIC X(05).                          
           05  FILLER REDEFINES EI002-LY-SEA-ID.                                
               10  EI002-LY-SEA-ID-CCYY     PIC X(04).                          
               10  EI002-LY-SEA-S-F         PIC X(01).                          
           05  EI002-LAST-SEA-LAST-BOW-DTE  PIC X(10).                          
           05  EI002-PRIM-HOL-NM            PIC X(25).                          
           05  EI002-CAL-DAY-OF-MN-NBR      PIC X(2).                           
           05  EI002-CAL-MN-NBR             PIC X(2).                           
           05  EI002-CAL-MN-NM              PIC X(9).                           
           05  EI002-CAL-QTR-NBR            PIC X(1).                           
           05  EI002-CAL-YR-NBR             PIC X(4).                           
           05  EI002-CAL-BOM-IND            PIC X(1).                           
           05  EI002-CAL-EOM-IND            PIC X(1).                           
           05  EI002-WKDA-IND               PIC X(1).                           
           05  EI002-HOL-IND                PIC X(1).                           
           05  EI002-LY-LAST-BOW-DTE        PIC X(10).                          
           05  EI002-LY-TDA-DTE             PIC X(10).                          
           05  EI002-BEGG-FSCL-WTD-DTE      PIC X(10).                          
           05  EI002-ENDG-FSCL-WTD-DTE      PIC X(10).                          
