000100 IDENTIFICATION DIVISION.                                         00010004
000200                                                                  00020004
000300 PROGRAM-ID.      EPKUP060.                                       00030004
000400 AUTHOR.          STEVEN NOWAK.                                   00040004
000500 INSTALLATION.    KOHLS DEPARTMENT STORES.                        00050004
000600 DATE-WRITTEN.    04/20/10.                                       00060004
000700 DATE-COMPILED.                                                   00070004
000800                                                                  00080004
000900******************************************************************00090004
001000*  MODULE TYPE:   COBOL2 DB2 BATCH.                               00100004
001100*                                                                 00110004
001200*  UPDATE OF THE EPT_CUST_MDSE_SCNR TABLE                         00120004
001300*                                                                 00130004
001400*========================== CHANGE LOG ===========================00140004
003100*  AUTH          BY         DATE       DESCRIPTION                00171005
003200*=================================================================00172005
003300* WR37120     S. NOWAK    04-20-10     CREATE PROGRAM             00173005
003400*                                                                 00174005
260107* CHG0260107  JIM HUNTER  08-13-2021   ADD COPYBOOK DPWS991 TO    00175005
260107*             CHANGE CALL TO DPKUT901 FROM STATIC TO DYNAMIC.     00176005
001800*                                                                 00180004
001900******************************************************************00190004
002000                                                                  00200004
002100 ENVIRONMENT DIVISION.                                            00210004
002200 CONFIGURATION SECTION.                                           00220004
002300                                                                  00230004
002400 SOURCE-COMPUTER.    IBM-3090.                                    00240004
002500 OBJECT-COMPUTER.    IBM-3090.                                    00250004
002600                                                                  00260004
002700 INPUT-OUTPUT SECTION.                                            00270004
002800 FILE-CONTROL.                                                    00280004
002900                                                                  00290004
003000 DATA DIVISION.                                                   00300004
003100 FILE SECTION.                                                    00310004
003200                                                                  00320004
003300                                                                  00330004
003400***************************************************************** 00340004
003500*                       WORKING STORAGE                           00350004
003600***************************************************************** 00360004
003700 WORKING-STORAGE SECTION.                                         00370004
003800                                                                  00380004
003900 01  W-START                          PIC  X(40)                  00390004
004000     VALUE 'EPKUP060 - WORKING STORAGE BEGINS HERE'.              00400004
004100                                                                  00410004
004200                                                                  00420004
004300***************************************************************** 00430004
004400*                         SWITCHES                                00440004
004500***************************************************************** 00450004
004600 01  PROGRAM-SWITCHES.                                            00460004
004700     05  PS-RESTART-REQUIRED-SW       PIC  X(01) VALUE 'N'.       00470004
004800         88  PS-RESTART-REQUIRED                 VALUE 'Y'.       00480004
004900         88  PS-RESTART-NOT-REQUIRED             VALUE 'N'.       00490004
005000                                                                  00500004
005100******************************************************************00510004
005200*                       ACCUMULATORS                              00520004
005300******************************************************************00530004
005400 01  PROGRAM-ACCUM.                                               00540004
005500     05  PA-READ                      PIC  9(11) VALUE ZEROS.     00550004
005600     05  PA-CKPT                      PIC  9(11) VALUE ZEROS.     00560004
005700                                                                  00570004
005800******************************************************************00580004
005900*                           CONSTANTS                             00590004
006000******************************************************************00600004
006100 01  PROGRAM-CONSTANTS.                                           00610004
006200     05  PC-MAX-RETRIES               PIC S9(04) VALUE +3         00620004
006300                                                 COMP SYNC.       00630004
006400     05  PC-MAX-DEADLOCKS             PIC S9(04) VALUE +3         00640004
006500                                                 COMP SYNC.       00650004
006600                                                                  00660004
006700     05  PC-CKPT-JOB-NAME             PIC  X(08) VALUE 'EPK380  '.00670004
006800     05  PC-CKPT-PLAN-NAME            PIC  X(08) VALUE 'EPKUP060'.00680004
006900     05  PC-PROGRAM-NAME              PIC  X(08) VALUE 'EPKUP060'.00690004
007000                                                                  00700004
007100     05  PC-TRAN-PRES-FUNC-CODES.                                 00710004
007200         10  PC-TRAN-PRES-FUNC-OPEN   PIC  X(05) VALUE 'OPEN '.   00720004
007300         10  PC-TRAN-PRES-FUNC-TRANS  PIC  X(05) VALUE 'TRANS'.   00730004
007400         10  PC-TRAN-PRES-FUNC-RSTRT  PIC  X(05) VALUE 'RSTRT'.   00740004
007500         10  PC-TRAN-PRES-FUNC-CLOSE  PIC  X(05) VALUE 'CLOSE'.   00750004
007600                                                                  00760004
007700     05  PC-MINUS-ONE                 PIC S9(01) VALUE -1.        00770004
007800     05  PC-SYSTEM                    PIC  X(08) VALUE 'SYSTEM  '.00780004
007900                                                                  00790004
008000******************************************************************00800004
008100*                          VARIABLES                              00810004
008200******************************************************************00820004
008300 01  PROGRAM-VARIABLES.                                           00830004
008400     05  PV-SQL-SUB                   PIC  9(03) VALUE ZERO.      00840004
008500     05  PV-DEADLOCK-COUNTER          PIC  9(03) VALUE ZERO.      00850004
008600     05  PV-RETRY-CNT                 PIC  9(03) VALUE ZERO.      00860004
008700     05  PV-PARAGRAPH-NAME            PIC  X(30) VALUE SPACE.     00870004
008800     05  PV-DB2-OPER-ATTEMPTED        PIC  X(30) VALUE SPACE.     00880004
008900     05  PV-OPERATION-MSG             PIC  X(35) VALUE SPACE.     00890004
009000     05  PV-RET-CODE                  PIC  9(04) VALUE ZEROS.     00900004
009100                                                                  00910004
009200******************************************************************00920004
009300*               SYSTEM TIME AND DATE VARIABLES                    00930004
009400******************************************************************00940004
009500 01  SYS-DATE-TIME.                                               00950004
009600     05  SYS-DATE                     PIC  X(08) VALUE SPACES.    00960004
009700     05  SYS-TIME                     PIC  X(08) VALUE SPACES.    00970004
009800                                                                  00980004
009900 01  ST-BEG-TIME.                                                 00990004
010000     05  ST-BEG-HR                    PIC  9(02) VALUE ZEROS.     01000004
010100     05  FILLER                       PIC  X(01) VALUE ':'.       01010004
010200     05  ST-BEG-MN                    PIC  9(02) VALUE ZEROS.     01020004
010300                                                                  01030004
010400 01  ST-END-TIME.                                                 01040004
010500     05  ST-END-HR                    PIC  9(02) VALUE ZEROS.     01050004
010600     05  FILLER                       PIC  X(01) VALUE ':'.       01060004
010700     05  ST-END-MN                    PIC  9(02) VALUE ZEROS.     01070004
010800                                                                  01080004
010900 01  SD-EDIT-DATE.                                                01090004
011000     05  SD-MONTH                     PIC  9(02) VALUE ZEROS.     01100004
011100     05  FILLER                       PIC  X(01) VALUE '-'.       01110004
011200     05  SD-DAY                       PIC  9(02) VALUE ZEROS.     01120004
011300     05  FILLER                       PIC  X(01) VALUE '-'.       01130004
011400     05  SD-CENT                      PIC  9(02) VALUE ZEROS.     01140004
011500     05  SD-YEAR                      PIC  9(02) VALUE ZEROS.     01150004
011600                                                                  01160004
011700******************************************************************01170004
011800*                        ERROR HANDLING                           01180004
011900******************************************************************01190004
012000 01  ABEND-CODE                       PIC S9(04) VALUE ZEROS      01200004
012100                                                 COMP SYNC.       01210004
012200     88  ABEND-4013-DB2-ERROR                    VALUE +4013.     01220004
012300     88  ABEND-4444-FORCED-ABEND                 VALUE +4444.     01230004
012400                                                                  01240004
012500                                                                  01250004
012600******************************************************************01260004
012700*  UPDATE RECORD                                                  01270004
012800******************************************************************01280004
012900     COPY EPRD018.                                                01290004
013000                                                                  01300004
013100******************************************************************01310004
013200*  DB2 FORMATTED ERROR MESSAGE                                    01320004
013300******************************************************************01330004
013400     COPY DPWS004.                                                01340004
013500                                                                  01350004
013600******************************************************************01360004
013700*  SQL COMMUNICATIONS WORK AREA                                   01370004
013800******************************************************************01380004
013900     COPY SQLCA2.                                                 01390004
014000                                                                  01400004
014100******************************************************************01410004
014200*  COMMUNICATIONS AREA FOR DB2                                    01420004
014300******************************************************************01430004
014400     EXEC SQL                                                     01440004
014500         INCLUDE SQLCA                                            01450004
014600     END-EXEC.                                                    01460004
014700                                                                  01470004
014800******************************************************************01480004
014900* DB2 TABLE DB2PDBA.EPT_CUST_MDSE_SCNR - PRICE VERIFIER TABLE     01490004
015000******************************************************************01500004
015100     EXEC SQL                                                     01510004
015200          INCLUDE EPT00021                                        01520004
015300     END-EXEC.                                                    01530004
015400                                                                  01540004
015500                                                                  01550004
015600******************************************************************01560004
015700*  TRANSACTION PREPARATION MODULE COMMUNICATIONS AREA             01570004
015800******************************************************************01580004
260107     COPY DPWS991.                                                01581005
016100                                                                  01582005
015900     COPY DPLS001.                                                01590004
016000     05  WORK-STORAGE-PASSED.                                     01600004
016100******************************************************************01610004
016200*PA - PROGRAM ACCUMULATORS                                        01620004
016300******************************************************************01630004
016400         10  PROGRAM-ACCUMULATORS.                                01640004
016500             15  PA-ROWS-INSERT   PIC S9(11)           VALUE ZERO 01650004
016600                                                       COMP-3.    01660004
016700                                                                  01670004
016800 01  FILLER                          PIC X(4096)  VALUE SPACE.    01680004
016900                                                                  01690004
017000                                                                  01700004
017100                                                                  01710004
017200 PROCEDURE DIVISION.                                              01720004
017300******************************************************************01730004
017400* MAINLINE-PROCESSING                                             01740004
017500******************************************************************01750004
017600                                                                  01760004
017700     PERFORM A100-INITIALIZE.                                     01770004
017800                                                                  01780004
017900     PERFORM B100-PROCESS-RECORDS                                 01790004
018000       UNTIL DP001-PREP-TRANS-EOF.                                01800004
018100                                                                  01810004
018200     PERFORM Z990-EOJ-ROUTINE.                                    01820004
018300                                                                  01830004
018400     GOBACK.                                                      01840004
018500                                                                  01850004
018600                                                                  01860004
018700******************************************************************01870004
018800* PREFORMS TASK INITIATION                                        01880004
018900******************************************************************01890004
019000 A100-INITIALIZE.                                                 01900004
019100                                                                  01910004
019200     MOVE FUNCTION CURRENT-DATE TO SYS-DATE-TIME.                 01920004
019300                                                                  01930004
019400     MOVE SYS-TIME (1:2) TO ST-BEG-HR.                            01940004
019500     MOVE SYS-TIME (3:2) TO ST-BEG-MN.                            01950004
019600                                                                  01960004
019700     MOVE SYS-DATE (1:2) TO SD-CENT.                              01970004
019800     MOVE SYS-DATE (3:2) TO SD-YEAR.                              01980004
019900     MOVE SYS-DATE (5:2) TO SD-MONTH.                             01990004
020000     MOVE SYS-DATE (7:2) TO SD-DAY.                               02000004
020100                                                                  02010004
020200     MOVE PC-TRAN-PRES-FUNC-OPEN TO DP001-FUNC-CODE.              02020004
020300                                                                  02030004
020400     PERFORM X100-BUILD-COMM-AREA-TRAN-PRES.                      02040004
020500                                                                  02050004
020600                                                                  02060004
020700******************************************************************02070004
020800* PROCESS RECORDS                                                 02080004
020900******************************************************************02090004
021000 B100-PROCESS-RECORDS.                                            02100004
021100                                                                  02110004
021200     SET PS-RESTART-NOT-REQUIRED TO TRUE.                         02120004
021300                                                                  02130004
021400     PERFORM C100-INSERT-RECS.                                    02140004
021500                                                                  02150004
021600*----------------------------------------------------------------*02160004
021700*  IF A RESTART IS REQUIRED, ISSUE A RESTART CALL RATHER THAN A  *02170004
021800*  TRANS CALL.  THIS WILL ALLOW PROCESSING TO RESUME WITH THE    *02180004
021900*  FIRST TRANSACTION AFTER THE LAST COMMIT.                      *02190004
022000*----------------------------------------------------------------*02200004
022100     IF  PS-RESTART-REQUIRED                                      02210004
022200         MOVE PC-TRAN-PRES-FUNC-RSTRT TO DP001-FUNC-CODE          02220004
022300     ELSE                                                         02230004
022400         MOVE PC-TRAN-PRES-FUNC-TRANS TO DP001-FUNC-CODE          02240004
022500     END-IF.                                                      02250004
022600                                                                  02260004
022700     PERFORM X100-BUILD-COMM-AREA-TRAN-PRES.                      02270004
022800                                                                  02280004
022900     ADD 1 TO PA-READ.                                            02290004
023000                                                                  02300004
023100                                                                  02310004
023200******************************************************************02320004
023300* INSERT PROCESS                                                  02330004
023400******************************************************************02340004
023500 C100-INSERT-RECS.                                                02350004
023600                                                                  02360004
023700     PERFORM C200-POPULATE-DCLGEN.                                02370004
023800                                                                  02380004
023900     PERFORM C300-INSERT-DATA.                                    02390004
024000                                                                  02400004
024100                                                                  02410004
024200******************************************************************02420004
024300* POPULATE THE DCLGEN                                             02430004
024400******************************************************************02440004
024500 C200-POPULATE-DCLGEN.                                            02450004
024600                                                                  02460004
024700     MOVE EP018-SCN-DTE            TO EPT00021-SCN-DTE.           02470004
024800     MOVE EP018-LOC-NBR            TO EPT00021-LOC-NBR.           02480004
024900     MOVE EP018-SCN-TM             TO EPT00021-SCN-TM.            02490004
025000     MOVE EP018-IP-ADDR            TO EPT00021-IP-ADDR.           02500004
025100     MOVE EP018-LOC-SRVR-NM        TO EPT00021-LOC-SRVR-NM.       02510004
025200     MOVE EP018-SCNR-MKR-NM        TO EPT00021-SCNR-MKR-NM.       02520004
025300     MOVE EP018-UPC-NBR            TO EPT00021-UPC-NBR.           02530004
025400     MOVE EP018-LOC-SKU-STAT-CDE   TO EPT00021-LOC-SKU-STAT-CDE.  02540004
025500                                                                  02550004
025600                                                                  02560004
025700******************************************************************02570004
025800* INSERT EPT_CUST_MDSE_SCNR TABLE                                 02580004
025900******************************************************************02590004
026000 C300-INSERT-DATA.                                                02600004
026100                                                                  02610004
026200     EXEC SQL                                                     02620004
026300       INSERT INTO EPT_CUST_MDSE_SCNR                             02630004
026400               (SCN_DTE                                           02640004
026500               ,LOC_NBR                                           02650004
026600               ,SCN_TM                                            02660004
026700               ,IP_ADDR                                           02670004
026800               ,LOC_SRVR_NM                                       02680004
026900               ,SCNR_MKR_NM                                       02690004
027000               ,UPC_NBR                                           02700004
027100               ,LOC_SKU_STAT_CDE )                                02710004
027200     VALUES                                                       02720004
027300             (:EPT00021-SCN-DTE                                   02730004
027400             ,:EPT00021-LOC-NBR                                   02740004
027500             ,:EPT00021-SCN-TM                                    02750004
027600             ,:EPT00021-IP-ADDR                                   02760004
027700             ,:EPT00021-LOC-SRVR-NM                               02770004
027800             ,:EPT00021-SCNR-MKR-NM                               02780004
027900             ,:EPT00021-UPC-NBR                                   02790004
028000             ,:EPT00021-LOC-SKU-STAT-CDE )                        02800004
028100     END-EXEC.                                                    02810004
028200                                                                  02820004
028300                                                                  02830004
028400     EVALUATE TRUE                                                02840004
028500        WHEN SQLCODE = ZERO                                       02850004
028600        WHEN SQLCODE = -803                                       02860004
028700            ADD 1 TO PA-ROWS-INSERT                               02870004
028800                                                                  02880004
028900        WHEN OTHER                                                02890004
029000            DISPLAY '          '                                  02900004
029100            DISPLAY 'SCN-DTE = ' EPT00021-SCN-DTE                 02910004
029200            DISPLAY 'LOC-NBR = ' EPT00021-LOC-NBR                 02920004
029300            DISPLAY 'SCN-TM  = ' EPT00021-SCN-TM                  02930004
029400            DISPLAY 'IP-ADDR = ' EPT00021-IP-ADDR                 02940004
029500            DISPLAY 'SRVR-NM = ' EPT00021-LOC-SRVR-NM             02950004
029600            DISPLAY 'MKR-NM  = ' EPT00021-SCNR-MKR-NM             02960004
029700            DISPLAY 'UPC-NBR = ' EPT00021-UPC-NBR                 02970004
029800            DISPLAY 'STAT-CDE= ' EPT00021-LOC-SKU-STAT-CDE        02980004
029900                                                                  02990004
030000            MOVE 'C300-INSERT-DATA'       TO PV-PARAGRAPH-NAME    03000004
030100            MOVE 'EPT_CUST_MDSE_SCNR INSERT'                      03010004
030200                                          TO PV-DB2-OPER-ATTEMPTED03020004
030300                                                                  03030004
030400            PERFORM Z200-SQL-ABEND                                03040004
030500     END-EVALUATE.                                                03050004
030600                                                                  03060004
030700                                                                  03070004
030800******************************************************************03080004
030900* BUILD THE COMMUNICATION AREA FOR A CALL TO THE TRANSACTION      03090004
031000* PRESENTATION MODULE                                             03100004
031100******************************************************************03110004
031200 X100-BUILD-COMM-AREA-TRAN-PRES.                                  03120004
031300                                                                  03130004
031400     MOVE LENGTH OF                                               03140004
031500          WORK-STORAGE-PASSED TO DP001-WORK-STRG-LENGTH.          03150004
031600     MOVE PC-CKPT-JOB-NAME    TO DP001-JOB-NAME.                  03160004
031700     MOVE PC-CKPT-PLAN-NAME   TO DP001-PLAN-NAME.                 03170004
031800                                                                  03180004
031900     PERFORM X200-CALL-TRANS-PRES-MODULE.                         03190004
032000                                                                  03200004
032100     MOVE DP001-TRANS-RECORD  TO EP018-UPDT-REC.                  03210004
032200                                                                  03220004
032300     IF  DP001-CKPT-TAKEN                                         03230004
032400         ADD 1 TO PA-CKPT                                         03240004
032500                                                                  03250004
032600         INITIALIZE PV-DEADLOCK-COUNTER                           03260004
032700     END-IF.                                                      03270004
032800                                                                  03280004
032900                                                                  03290004
033000******************************************************************03300004
033100* VERIFY THE RETURN CODE ON THE CALLED MODULE                     03310004
033200******************************************************************03320004
033300 X200-CALL-TRANS-PRES-MODULE.                                     03330004
033400                                                                  03340004
033500     PERFORM Z900-CALL-TRANS-PRES-MODULE.                         03350004
033600                                                                  03360004
033700     IF  DP001-GOOD-RET-CODE                                      03370004
033800     OR  DP001-CKPT-TAKEN                                         03380004
033900     OR  DP001-RESTART                                            03390004
034000         CONTINUE                                                 03400004
034100                                                                  03410004
034200     ELSE                                                         03420004
034300         MOVE 'X200-CALL-TRANS-PRES-MODULE' TO PV-PARAGRAPH-NAME  03430004
034400         MOVE '** BAD CALL TO TRANS PREP MODULE **'               03440004
034500                                            TO PV-OPERATION-MSG   03450004
034600         MOVE DP001-RET-CODE                TO PV-RET-CODE        03460004
034700                                                                  03470004
034800         SET ABEND-4444-FORCED-ABEND TO TRUE                      03480004
034900                                                                  03490004
035000         PERFORM Z100-ABEND                                       03500004
035100     END-IF.                                                      03510004
035200                                                                  03520004
035300                                                                  03530004
035400******************************************************************03540004
035500* NON-DB2 ABEND                                                   03550004
035600******************************************************************03560004
035700 Z100-ABEND.                                                      03570004
035800                                                                  03580004
035900     PERFORM Z999-CONTROLS.                                       03590004
036000                                                                  03600004
036100     DISPLAY '                     '.                             03610004
036200     DISPLAY '** ABEND           **'.                             03620004
036300     DISPLAY '** PROGRAM         ** = ' PC-PROGRAM-NAME.          03630004
036400     DISPLAY '** PARAGRAPH       ** = ' PV-PARAGRAPH-NAME.        03640004
036500     DISPLAY '** OPERATION       ** = ' PV-OPERATION-MSG.         03650004
036600     DISPLAY '** RETURN CODE     ** = ' PV-RET-CODE.              03660004
036700                                                                  03670004
036800     CALL 'ILBOABN0' USING ABEND-CODE.                            03680004
036900                                                                  03690004
037000                                                                  03700004
037100******************************************************************03710004
037200* ABEND THE PROGRAM IN THE EVENT THAT A SQL ERROR OR WARNING      03720004
037300* CODE OCCURS.                                                    03730004
037400******************************************************************03740004
037500 Z200-SQL-ABEND.                                                  03750004
037600                                                                  03760004
037700     PERFORM Z999-CONTROLS.                                       03770004
037800                                                                  03780004
037900     DISPLAY '** ABEND     **'.                                   03790004
038000     DISPLAY '** PROGRAM   ** = ' PC-PROGRAM-NAME.                03800004
038100     DISPLAY '** PARAGRAPH ** = ' PV-PARAGRAPH-NAME.              03810004
038200     DISPLAY '** OPERATION ** = ' PV-DB2-OPER-ATTEMPTED.          03820004
038300                                                                  03830004
038400******************************************************************03840004
038500* THIS COPY BOOK MEMBER CONTAINS THE PROCEDURE DIVISION STATE-    03850004
038600* MENTS THAT ARE REQUIRED TO UTILIZE THE DB2 ABEND MODULE         03860004
038700* 'DSNTIAR' AND CONVERT THE SQLCA INFORMATION INTO A READABLE     03870004
038800* FORMAT.                                                         03880004
038900******************************************************************03890004
039000     COPY DPPD004.                                                03900004
039100                                                                  03910004
039200     SET ABEND-4013-DB2-ERROR TO TRUE.                            03920004
039300                                                                  03930004
039400     CALL 'ILBOABN0' USING ABEND-CODE.                            03940004
039500                                                                  03950004
039600                                                                  03960004
039700******************************************************************03970004
039800* PREFORMS TASK TERMINATION PROCESSING                            03980004
039900******************************************************************03990004
040000 Z990-EOJ-ROUTINE.                                                04000004
040100                                                                  04010004
040200     MOVE PC-TRAN-PRES-FUNC-CLOSE TO DP001-FUNC-CODE.             04020004
040300                                                                  04030004
040400     PERFORM X100-BUILD-COMM-AREA-TRAN-PRES.                      04040004
040500                                                                  04050004
040600     PERFORM Z999-CONTROLS.                                       04060004
040700                                                                  04070004
040800                                                                  04080004
040900******************************************************************04090004
041000* DISPLAY CONTROLS FROM THE PROGRAM                               04100004
041100******************************************************************04110004
041200 Z999-CONTROLS.                                                   04120004
041300                                                                  04130004
041400     MOVE FUNCTION CURRENT-DATE TO SYS-DATE-TIME.                 04140004
041500                                                                  04150004
041600     MOVE SYS-TIME (1:2) TO ST-END-HR.                            04160004
041700     MOVE SYS-TIME (3:2) TO ST-END-MN.                            04170004
041800                                                                  04180004
041900     DISPLAY '                    '.                              04190004
042000     DISPLAY '**********************'.                            04200004
042100     DISPLAY '   EPKUP060 CONTROLS  '.                            04210004
042200     DISPLAY '**********************'.                            04220004
042300     DISPLAY 'RUN DATE  = ' SD-EDIT-DATE.                         04230004
042400     DISPLAY 'BEG TIME  = ' ST-BEG-TIME.                          04240004
042500     DISPLAY 'END TIME  = ' ST-END-TIME.                          04250004
042600     DISPLAY '======================'.                            04260004
042700     DISPLAY 'RECORDS READ   = ' PA-READ.                         04270004
042800     DISPLAY 'CHECKPOINTS    = ' PA-CKPT.                         04280004
042900     DISPLAY '                '.                                  04290004
043000     DISPLAY 'ROWS UPDATE  = ' PA-ROWS-INSERT.                    04300004
043100     DISPLAY '                '.                                  04310004
043200                                                                  04320004
043300******************************************************************04330004
043400* THIS COPY BOOK MEMBER CONTAINS THE PROCEDURE DIVISION STATE-    04340004
043500* MENTS THAT ARE REQUIRED TO INVOKE THE TRANSACTION PRESENTATION  04350004
043600* MODULE (DPKUT901) OF THE DB2 CHECKPOINT RESTART SYSTEM.         04360004
043700******************************************************************04370004
043800     COPY DPPD001.                                                04380004
043900                                                                  04390004
044000                                                                  04400004
