      ***********************************************************       00010000
      **                      EPRD139                          **       00020000
      **                     LRECL=198 + 4 BYTES               **       00030008
      **                                                       **       00040000
      **  THIS IS THE LAYOUT RECORD USED BY THE BOUNCEBACK     **       00050000
      **         REWARDS EXTRACT PROGRAM AUKUT015.             **       00060008
      ***********************************************************       00070000
       01  EP139-RWD-ISUD-EXTRCT-REC.                                   00080000
           05  EP139-RWD-ISUD-EXTR-FIXED.                               00090000
               10  EP139-RWD-ISUD-STR-LOC        PIC  9(004).           00100000
               10  FILLER                        PIC  X(001)  VALUE ','.00110000
               10  EP139-RWD-ISUD-EVNT-ID        PIC  X(005).           00120000
               10  FILLER                        PIC  X(001)  VALUE ','.00130000
               10  EP139-RWD-ISUD-BEG-DTE        PIC  X(008).           00140000
               10  FILLER                        PIC  X(001)  VALUE ','.00150000
               10  EP139-RWD-ISUD-END-DTE        PIC  X(008).           00160000
               10  FILLER                        PIC  X(001)  VALUE ','.00170000
               10  EP139-RWD-ISUD-TNDR-TYP-CDE   PIC  9(003).           00180007
               10  FILLER                        PIC  X(001)  VALUE ','.00190000
               10  EP139-RWD-ISUD-QUALD-PRCH-AMT PIC  9(3)V9(02).       00200000
               10  FILLER                        PIC  X(001)  VALUE ','.00210000
               10  EP139-RWD-ISUD-QUALD-TOL-AMT  PIC  9(2)V9(02).       00220000
               10  FILLER                        PIC  X(001)  VALUE ','.00230000
               10  EP139-RWD-ISUD-MAX-RWD-QTY    PIC  9(003).           00240000
               10  FILLER                        PIC  X(001)  VALUE ','.00250000
               10  EP139-RWD-ISUD-VALUE-AMT      PIC  9(3)V9(02).       00260001
               10  FILLER                        PIC  X(001)  VALUE ','.00270001
           05  EP139-RWD-ISUD-EXTR-VAR.                                 00280001
               10  EP139-RWD-ISUD-EXTR-VAR-TABLE PIC  X(1)  VALUE SPACES00290001
                                               OCCURS 144 TIMES         00300003
                                               INDEXED BY EP139-VAR-IDX.00310001
