000100***********************************************************       00010000
000200**                      EPRD122                          **       00020001
000300**                     LRECL=50                          **       00030003
000500**  RCP OVERRIDE DRIVER.                                 **       00030103
000400**  THIS IS THE RECORD LAYOUT USED BY THE PLU EXTRACT    **       00031003
000400**  PROCESS.  IT IDENTIFIES A SKU (INTERNAL UPC CODE)    **       00040003
000500**  FOR WHICH CORPORATE PRICING AND/OR PROMPT FOR PRICE  **       00050003
000500**  HAS BEEN UPDATED AND WHICH HAS REGIONAL CLEARANCE    **       00051003
000500**  PRICING.  IT DRIVES THE RCP OVERRIDE PROCESS.        **       00052003
000100***********************************************************       00060002
000800 01  EP122-RCP-DRIVE-RECORD.                                      00120002
001100     05  EP122-INTERNAL-UPC-ID     PIC 9(10) VALUE 0.             00140003
001000     05  EP122-OVERRIDE-TYPE-IND   PIC X(01).                     00141003
000851         88 EP122-SKU-LOC-OVERRIDE           VALUE 'S'.           00142003
000851         88 EP122-ATTR-OVERRIDE              VALUE 'A'.           00143003
000851         88 EP122-BOTH-OVERRIDE              VALUE 'B'.           00144003
001200     05  FILLER                    PIC X(39) VALUE SPACES.        00150003
