000100**************************************************************    00010000
000200*  THIS COPYBOOK WILL DEFINE THE EXCEPTION STORE LIST RECORD *    00020001
000300*                  NEXT GEN PROJECT                          *    00030000
000400**************************************************************    00040000
000500 01  EP207-EXCEPTION-STORES.                                      00050001
000600     05  EP207-STORE-GROUP-TYPE-CDE       PIC X(05) VALUE SPACES. 00060001
000700     05  EP207-EXCP-INDICATOR             PIC X(05) VALUE SPACES. 00070001
000800     05  EP207-STORE-GROUP-ID             PIC X(05) VALUE SPACES. 00080001
000900     05  EP207-FILLER-1                   PIC X(01) VALUE SPACES. 00090001
001000     05  EP207-STORE-NUMBER               PIC X(05) VALUE SPACES. 00100001
