000100**************************************************************    00010000
000200*                     COPYBOOK EPRD216                       *    00020001
000300*   DEF. OF THE CUSTOMER INCENTIVE FILE CREATED FOR PROMOS   *    00030001
000310*     IN PROGRAM EPKUT111                                    *    00031001
000400*          POS 2009 INFRASTRUCTURE PROJECT WR#35484          *    00040002
000500**************************************************************    00050000
000600 01  EP216-CUST-INCTV-RECORD.                                     00060003
000700   05 EP216-CUST-INCTV-HEADER.                                    00070003
000800      10 EP216-FILE-ACT-TYP        PIC X(03) VALUE SPACES.        00080003
000900         88 EP216-FILE-CHANGE          VALUE 'CHG'.               00090003
001000         88 EP216-FILE-FULL            VALUE 'FUL'.               00100003
001100      10 EP216-STR-HIER-CDE        PIC 9(02) VALUE 0.             00110004
001110      10 EP216-SOR-LAST-UPD-TMST   PIC X(20) VALUE SPACES.        00111004
001120      10 EP216-STR-GRP-TYP-CDE     PIC 9(05) VALUE 0.             00112004
001200      10 EP216-STR-GRP-ID          PIC 9(10) VALUE 0.             00120003
001300      10 EP216-STR-FILE-LIST-DTE   PIC X(08) VALUE SPACES.        00130007
001400      10 EP216-APPLY-IND           PIC X(01) VALUE SPACES.        00140003
001500         88 EP216-APPLY-NIGHTLY        VALUE 'N'.                 00150003
001600         88 EP216-APPLY-CORRECTION     VALUE 'C'.                 00160003
001610      10 EP216-BUSINESS-EVENT-ID   PIC 9(03) VALUE ZERO.          00161006
001700   05 EP216-CUST-INCTV-DATA.                                      00170003
001800      10 EP216-RECORD-ACTION       PIC X(01) VALUE SPACES.        00180004
001900         88 EP216-RECORD-ADD           VALUE 'A'.                 00190004
002000         88 EP216-RECORD-UPDATE        VALUE 'U'.                 00200004
002100         88 EP216-RECORD-DELETE        VALUE 'D'.                 00210004
002110*** XST_CUST_INCTV                                                00211004
002200      10 EP216-SYS-OF-REC-ID       PIC 9(10) VALUE ZERO.          00220004
002300      10 EP216-SYS-IDENTIFIER      PIC X(02) VALUE SPACES.        00230004
002400      10 EP216-PROMO-SCHEME-CDE    PIC X(04) VALUE SPACES.        00240004
002500      10 EP216-INCTV-TYP-CDE       PIC X(03) VALUE SPACES.        00250004
002600      10 EP216-INCTV-NM            PIC X(50) VALUE SPACES.        00260004
002700      10 EP216-INCTV-TRGR-TYP-CDE  PIC X(03) VALUE SPACES.        00270004
002800      10 EP216-SYS-OF-REC-GP-ID    PIC 9(10) VALUE ZERO.          00280004
002810*** XST_CUST_INCTV_SECT                                           00281004
002900      10 EP216-INCTV-SECT-TYP-CDE  PIC X(01) VALUE SPACES.        00290004
003000      10 EP216-INCTV-BEG-TMST      PIC X(19) VALUE SPACES.        00300004
003100      10 EP216-INCTV-END-TMST      PIC X(19) VALUE SPACES.        00310004
003200      10 EP216-BUY-CNCTR-CDE       PIC X(03) VALUE SPACES.        00320004
003300      10 EP216-GET-CNCTR-CDE       PIC X(03) VALUE SPACES.        00330004
003400      10 EP216-CUST-SHRT-DESC      PIC X(20) VALUE SPACES.        00340004
003500      10 EP216-LMT-PER-TRN-QTY     PIC 9(05) VALUE ZERO.          00350004
003510*** XST_CUST_INCTV_PARM                                           00351004
003600      10 EP216-SYS-REC-SUB-ID      PIC 9(10) VALUE ZERO.          00360004
003700      10 EP216-SELN-TYP-CDE        PIC X(03) VALUE SPACES.        00370004
003800      10 EP216-TIER-LVL-NBR        PIC 9(05) VALUE ZERO.          00380004
003900      10 EP216-INCTV-BUY-QTY       PIC 9(05) VALUE ZERO.          00390004
004000      10 EP216-INCTV-BUY-QTY-NL    REDEFINES                      00400004
004100         EP216-INCTV-BUY-QTY       PIC X(05).                     00410004
004200      10 EP216-INCTV-BUY-AMT       PIC 9(07)V99 VALUE ZERO.       00420004
004300      10 EP216-INCTV-BUY-AMT-NL    REDEFINES                      00430004
004400         EP216-INCTV-BUY-AMT       PIC X(09).                     00440004
004500      10 EP216-INCTV-BUY-TOL-AMT   PIC 9(07)V99 VALUE ZERO.       00450004
004600      10 EP216-INCTV-BUY-TOL-AMT-NL    REDEFINES                  00460004
004700         EP216-INCTV-BUY-TOL-AMT   PIC X(09).                     00470004
004800      10 EP216-INCTV-GET-QTY       PIC 9(05) VALUE ZERO.          00480004
004900      10 EP216-INCTV-GET-QTY-NL    REDEFINES                      00490004
005000         EP216-INCTV-GET-QTY       PIC X(05).                     00500004
005100      10 EP216-INCTV-PCT-OFF       PIC 9(03) VALUE ZERO.          00510004
005200      10 EP216-INCTV-PCT-OFF-NL    REDEFINES                      00520004
005300         EP216-INCTV-PCT-OFF       PIC X(03).                     00530004
005400      10 EP216-INCTV-DOL-OFF-AMT   PIC 9(07)V99 VALUE ZERO.       00540004
005500      10 EP216-INCTV-DOL-OFF-AMT-NL   REDEFINES                   00550004
005600         EP216-INCTV-DOL-OFF-AMT   PIC X(09).                     00560004
005700      10 EP216-INCTV-PRC-PNT-AMT   PIC 9(07)V99 VALUE ZERO.       00570004
005800      10 EP216-INCTV-PRC-PNT-AMT-NL   REDEFINES                   00580004
005900         EP216-INCTV-PRC-PNT-AMT   PIC X(09).                     00590004
006000*** XST_CUST_INCTV_MDSE_SET                                       00600004
006100      10 EP216-INCTV-MDSE-SET-ID   PIC 9(10) VALUE ZERO.          00610004
006200      10 EP216-MDSE-HIER-CDE       PIC X(03) VALUE SPACES.        00620004
006300      10 EP216-DEPT-NBR            PIC 9(04) VALUE ZERO.          00630004
006400      10 EP216-DEPT-NBR-NL   REDEFINES                            00640004
006500         EP216-DEPT-NBR            PIC X(04).                     00650004
006600      10 EP216-MAJ-CL-NBR          PIC 9(04) VALUE ZERO.          00660004
006700      10 EP216-MAJ-CL-NBR-NL REDEFINES                            00670004
006800         EP216-MAJ-CL-NBR          PIC X(04).                     00680004
006810      10 EP216-SUB-CL-NBR          PIC 9(04) VALUE ZERO.          00681004
006900      10 EP216-SUB-CL-NBR-NL REDEFINES                            00690004
007000         EP216-SUB-CL-NBR          PIC X(04).                     00700004
007100      10 EP216-STYLE-ID            PIC 9(08) VALUE ZERO.          00710004
007200      10 EP216-STYLE-ID-NL REDEFINES                              00720004
007300         EP216-STYLE-ID            PIC X(08).                     00730004
007400      10 EP216-SKU-NBR             PIC 9(08) VALUE ZERO.          00740004
007500      10 EP216-SKU-NBR-NL  REDEFINES                              00750004
007600         EP216-SKU-NBR             PIC X(08).                     00760004
007700      10 EP216-MDSE-IE-IND         PIC X(01) VALUE SPACES.        00770004
007800      10 EP216-TKT-CLOR-CDE        PIC X(02) VALUE SPACES.        00780004
007900      10 EP216-ELECT-SLF-TOPR-CD   PIC X(03) VALUE SPACES.        00790004
008000   05 EP216-CUST-INCTV-FILLER      PIC X(31) VALUE SPACES.        00800008
