000100***********************************************************       00010001
000200**                      EPRD101                          **       00020008
000300**                     LRECL=80                          **       00030007
000310**  THIS IS THE LAYOUT FOR THE CONTROL CARD WHICH HAS    **       00031008
000320**  THE LAST BATCH OFFSET NUMBER AND THE LAST BATCH      **       00032008
000330**  OFFSET DATE.                                         **       00033008
000700***********************************************************       00070001
000800 01  EP101-CC-CONTROL-CARD.                                       00080008
000810   05 EP101-CC-CONTROL-CARD-DISPLY.                               00081008
000811      10 EP101-CC-LAST-NBR-NAME      PIC X(29) VALUE SPACES.      00081108
000812         88 EP101-CC-VALID-LAST-NBR-NM         VALUE              00081208
000820                 'LAST BATCH OFFSET NUMBER WAS:'.                 00082003
000830      10 EP101-CC-LAST-NBR           PIC X(02) VALUE SPACES.      00083008
000840      10 FILLER                      PIC X(01) VALUE SPACES.      00084003
000850      10 EP101-CC-LAST-DTE-NAME      PIC X(27) VALUE SPACES.      00085008
000851         88 EP101-CC-VALID-LATE-DTE-NM         VALUE              00085108
000860                 'LAST BATCH FUTURE DATE WAS:'.                   00086003
000870      10 EP101-CC-LAST-DTE           PIC X(10) VALUE SPACES.      00087009
001300   05 FILLER                         PIC X(11) VALUE SPACES.      00130009
