      ****************************************************************  00010000
      *                     COPYBOOK EPRD232                         *  00020000
      *     LAST TIME OF INCENTIVE HEADER                            *  00030000
      ****************************************************************  00040300
      ****************************************************************  00041200
       01  EP232-TIME-RECORD.                                           00041300
           05  EP232-HEADER-TIME               PIC X(06) VALUE SPACE.   00041400
           05  FILLER                          PIC X(74) VALUE SPACE.   00041500
