      **************************************************************    00010001
      *                     COPYBOOK EPRD274                       *    00020001
      *   RECORD DEFINITION FOR MERCHANDISE SET RECORD FOR OFFERS  *    00030001
      *  WR34297 - DAVE WELLER - 05/2010                                00040002
      **************************************************************    00050001
       01  EP274-OFFER-XST-OFR-MDSE-SET.                                00060001
           05  EP274-TRIGGER-TYPE             PIC X(01) VALUE SPACES.   00070001
           05  EP274-FILE-TYPE                PIC X(03) VALUE SPACES.   00080001
           05  EP274-STR-NBR                  PIC 9(05) VALUE ZERO.     00090001
           05  EP274-EVENT-ID                 PIC 9(10) VALUE ZERO.     00100001
           05  EP274-OFFER-ID                 PIC 9(10) VALUE ZERO.     00110001
           05  EP274-OFR-SECT-TYP-CDE         PIC X(01) VALUE SPACES.   00120001
           05  EP274-OFR-SECT-BWP-ID          PIC 9(10) VALUE ZERO.     00130001
           05  EP274-MDSE-SET-ID              PIC 9(10) VALUE ZERO.     00140001
           05  EP274-MDSE-HIER-CDE            PIC X(03) VALUE SPACES.   00150001
           05  EP274-DEPT-NBR                 PIC 9(04) VALUE ZERO.     00160001
           05  EP274-DEPT-NBR-X      REDEFINES                          00170001
               EP274-DEPT-NBR                 PIC X(04).                00180001
           05  EP274-MAJ-CL-NBR               PIC 9(04) VALUE ZERO.     00190001
           05  EP274-MAJ-CL-NBR-X    REDEFINES                          00200001
               EP274-MAJ-CL-NBR               PIC X(04).                00210001
           05  EP274-SUB-CL-NBR               PIC 9(04) VALUE ZERO.     00220001
           05  EP274-SUB-CL-NBR-X    REDEFINES                          00230001
               EP274-SUB-CL-NBR               PIC X(04).                00240001
           05  EP274-STYL-ID                  PIC 9(08) VALUE ZERO.     00250001
           05  EP274-STYL-ID-X       REDEFINES                          00260001
               EP274-STYL-ID                  PIC X(08).                00270001
           05  EP274-SKU-NBR                  PIC 9(08) VALUE ZERO.     00280001
           05  EP274-SKU-NBR-X       REDEFINES                          00290001
               EP274-SKU-NBR                  PIC X(08).                00300001
           05  EP274-IE-IND                   PIC X(01) VALUE SPACES.   00310001
           05  EP274-EMP-DISC-CDE             PIC X(01) VALUE SPACES.   00320001
           05  EP274-DISC-ELIG-IND            PIC X(01) VALUE SPACES.   00330001
           05  EP274-TKT-CLOR-CDE             PIC X(01) VALUE SPACES.   00340001
           05  EP274-STR-GRP-TYP-CDE          PIC 9(05) VALUE ZERO.     00341000
           05  EP274-STR-GRP-ID               PIC 9(05) VALUE ZERO.     00342000
           05  EP274-SG-IE-IND                PIC X(01) VALUE SPACES.   00343000
               88  EP274-STR-GP-INCLUDED                VALUE 'Y'.      00344000
               88  EP274-STR-GP-EXCLUDED                VALUE 'N'.      00345000
