      **************************************************************    00010000
      *                     COPYBOOK EPRD273                       *    00020000
      *      RECORD DEFINITION FOR THE BWP RECORD FOR OFFERS       *    00030000
      * WR34297 - DAVE WELLER - 05/2010                                 00040001
      **************************************************************    00050000
       01  EP273-OFFER-XST-BWP-RECORD.                                  00060000
           05  EP273-TRIGGER-TYPE             PIC X(01) VALUE SPACES.   00070000
           05  EP273-FILE-TYPE                PIC X(03) VALUE SPACES.   00080000
           05  EP273-STR-NBR                  PIC 9(05) VALUE ZERO.     00090000
           05  EP273-EVENT-ID                 PIC 9(10) VALUE ZERO.     00100000
           05  EP273-OFFER-ID                 PIC 9(10) VALUE ZERO.     00110000
           05  EP273-OFR-SECT-TYP-CDE         PIC X(01) VALUE SPACES.   00120000
           05  EP273-OFR-SECT-BWP-ID          PIC 9(10) VALUE ZERO.     00130000
           05  EP273-TIER-LVL-NBR             PIC 9(05) VALUE ZERO.     00140000
           05  EP273-TIER-LVL-NBR-X REDEFINES                           00150000
               EP273-TIER-LVL-NBR             PIC X(05).                00160000
           05  EP273-BWP-SELN-TYP-CDE         PIC X(03) VALUE SPACES.   00170000
           05  EP273-BWP-BUY-QTY              PIC 9(05) VALUE ZERO.     00180000
           05  EP273-BWP-BUY-QTY-X REDEFINES                            00190000
               EP273-BWP-BUY-QTY              PIC X(05).                00200000
           05  EP273-BWP-BUY-AMT              PIC 9(07)V99 VALUE ZERO.  00210000
           05  EP273-BWP-BUY-AMT-X REDEFINES                            00220000
               EP273-BWP-BUY-AMT              PIC X(09).                00230000
           05  EP273-BWP-BUY-TOL-AMT          PIC 9(07)V99 VALUE ZERO.  00240000
           05  EP273-BWP-BUY-TOL-AMT-X REDEFINES                        00250000
               EP273-BWP-BUY-TOL-AMT          PIC X(09).                00260000
           05  EP273-BWP-GET-QTY              PIC 9(05) VALUE ZERO.     00270000
           05  EP273-BWP-GET-QTY-X REDEFINES                            00280000
               EP273-BWP-GET-QTY              PIC X(05).                00290000
           05  EP273-BWP-GET-PCT-OFF-PCT      PIC 9(03) VALUE ZERO.     00300000
           05  EP273-BWP-GET-PCT-OFF-PCT-X REDEFINES                    00310000
               EP273-BWP-GET-PCT-OFF-PCT      PIC X(03).                00320000
           05  EP273-BWP-GET-DOL-OFF-AMT      PIC 9(07)V99 VALUE ZERO.  00330000
           05  EP273-BWP-GET-DOL-OFF-AMT-X REDEFINES                    00340000
               EP273-BWP-GET-DOL-OFF-AMT      PIC X(09).                00350000
           05  EP273-BWP-GET-PRPT-AMT         PIC 9(07)V99 VALUE ZERO.  00360000
           05  EP273-BWP-GET-PRPT-AMT-X REDEFINES                       00370000
               EP273-BWP-GET-PRPT-AMT         PIC X(09).                00380000
           05  EP273-STR-GRP-TYP-CDE          PIC 9(05) VALUE ZERO.     00381000
           05  EP273-STR-GRP-ID               PIC 9(05) VALUE ZERO.     00382000
           05  EP273-SG-IE-IND                PIC X(01) VALUE SPACES.   00383000
               88  EP273-STR-GP-INCLUDED                VALUE 'Y'.      00384000
               88  EP273-STR-GP-EXCLUDED                VALUE 'N'.      00385000
           05  EP273-FILLER                   PIC X(02) VALUE SPACES.   00390000
