000100***********************************************************       00010008
000200**                      EPRD118                          **       00020021
000300**                     LRECL=80                          **       00030013
000400**  THIS COPYBOOK WILL DEFINE THE FIELDS AND LAYOUT OF   **       00040012
000500**  THE CONTROL CARD FILE USED BY EPKUT125 FOR THE       **       00050021
000510**  SIMPLE PRICING CHANGES TIMESTAMP CUTOFF.             **       00051021
000700***********************************************************       00070008
000800 01 EP118-CC-CONTROL-CARD.                                        00080021
000801    05 EP118-CC-CONTROL-CARD-DISPLY.                              00080121
000802       10 EP118-CC-CUTOFF-TMST-NAME   PIC X(42) VALUE SPACES.     00080221
000803          88 EP118-CC-VALID-CUTOFF-TMST-NM     VALUE              00080321
000804             'SIMPLE PRICING CHANGE TIMESTAMP CUTOFF IS:'.        00080421
000810       10 EP118-CC-SIMPLE-CUTOFF-TMST PIC X(26) VALUE SPACES.     00081021
000820       10 FILLER                      PIC X(12) VALUE SPACES.     00082021
