000100****************************************************************          
000200**                      EPRD425                               **          
000300**                     LRECL=080                              **          
000400**                                                            **          
000500**   RECORD IS CREATED FOR EACH STORE THAT IS ON THE NEW      **          
000510**   FPLU FILE.                                               **          
000600**   RECORD LAYOUT FOR THE DETAIL RECORDS WHICH ARE           **          
000700**   WRITTEN TO THE STORE-GROUP-FILE.  USED IN CONJUCTION     **          
000800**   WITH EPRD427                                             **          
001000**                                                            **          
001100****************************************************************          
001300 01  EP425-STORE-PROMO-RECORD.                                            
001400     05  EP425-STORE-GROUP-TYPE   PIC X(05).                              
001500     05  EP425-STORE-GROUP-ID     PIC X(10).                              
001600     05  EP425-FILLER1            PIC X(01).                              
001700     05  EP425-STORE-NUMBER       PIC X(05).                              
001800     05  EP425-TERMINATION-CHAR   PIC X(01).                              
001900     05  EP425-FILLER2            PIC X(58).                              
