      ***********************************************************       00010000
      **                      EPRD140                          **       00020000
      **                     LRECL=66                          **       00030001
      **                                                       **       00031000
      **        REWARDS REDEMPTION PARAMETER FILE FORMAT       **       00032000
      ***********************************************************       00034000
       01  EP140-RWD-REDM-EXTRCT-REC.                                   00035000
           05  EP140-RWD-REDM-EXTR-FIXED.                               00036000
               10  EP140-RWD-REDM-STR-LOC        PIC  9(004).           00037000
               10  FILLER                        PIC  X(001)  VALUE ','.00038000
               10  EP140-RWD-REDM-EVNT-ID        PIC  X(005).           00039000
               10  FILLER                        PIC  X(001)  VALUE ','.00040000
               10  EP140-RWD-REDM-BEG-DTE        PIC  X(008).           00050000
               10  FILLER                        PIC  X(001)  VALUE ','.00060000
               10  EP140-RWD-REDM-END-DTE        PIC  X(008).           00070000
               10  FILLER                        PIC  X(001)  VALUE ','.00080000
               10  EP140-RWD-REDM-AUTH-TYP-CDE   PIC  9(001).           00090000
               10  FILLER                        PIC  X(001)  VALUE ','.00091000
               10  EP140-RWD-REDM-DISC-TYP-CDE   PIC  X(001).           00091100
               10  FILLER                        PIC  X(001)  VALUE ','.00091200
               10  EP140-RWD-REDM-DISC-AMT       PIC  9(005).           00092002
               10  FILLER                        PIC  X(001)  VALUE ','.00093000
               10  EP140-RWD-REDM-I-E-TYP-CDE    PIC  9(001).           00094000
               10  FILLER                        PIC  X(001)  VALUE ','.00094300
           05  EP140-RWD-REDM-EXTR-VAR.                                 00094400
               10  EP140-RWD-REDM-EXTR-VAR-TABLE PIC  X(1)  VALUE SPACES00094500
                                               OCCURS 25 TIMES          00094601
                                               INDEXED BY EP140-VAR-IDX.00094700
