      ***************************************************************** 00010000
      *    EPRD801 - PARAMETER IN CARD                                  00020002
      *    RECORD LENGTH - 80 BYTES                                     00030000
      *                                                                 00040000
      *CHANGE HISTORY:                                                  00050000
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES           00060000
      * ------- ---------- ----------- -------------------------------- 00070000
      ***************************************************************** 00080000
       01  EP801-PARAMETER-RECORD.                                      00090001
           05  EP801-CTG-CDE                      PIC  X(03) VALUE      00091001
                                                             SPACES.    00092000
           05  FILLER                             PIC  X(01) VALUE      00093000
                                                             SPACES.    00094000
           05  EP801-TYP-CDE                      PIC  X(03) VALUE      00094101
                                                             SPACES.    00094200
           05  FILLER                             PIC  X(73) VALUE      00094300
                                                             SPACES.    00094400
