000100***************************************************************** 00010005
000200* THIS COPYBOOK WILL DEFINE THE HEADER RECORD                   * 00020005
000300*           NEXT GEN PROJECT   WR#33714                         * 00030006
000400***************************************************************** 00040005
000500 01  EP255-CC-CONTROL-CARD.                                       00050005
000600     05  EP255-CC-CONTROL-CARD-DISPLY.                            00060005
000700         10  EP255-CC-CONTROL-NAME       PIC X(38) VALUE SPACES.  00070005
000800             88  EP255-CC-VALID-CONTROL-NAME                      00080005
000900                 VALUE 'EP OFFER CURRENT SYSTEM BATCH DATE IS:'.  00090007
001000         10  EP255-CC-CRNT-DTE          PIC X(10) VALUE SPACES.   00100005
001100     05  EP255-CC-FILLER-1              PIC X(32) VALUE SPACES.   00110005
