000100****************************************************************        29
000200**                      EPRD426                               **        29
000300**                     LRECL=080                              **        29
000400**                                                            **        29
000500**  FILE CONTAINS ALL OF THOSE STORES THAT HAVE BEEN          **        29
000600**  CONVERTED TO THE NEW PROMO SYSTEM OR STORES THAT AREN'T   **        29
000700**  OPEN YET, BUT WHEN OPEN WILL HAVE THE NEW PROMO SYSTEM.   **        29
000800**                                                            **        29
000900****************************************************************        29
001000                                                                        29
001100 01  EP426-NEW-PROMO-RECORD.                                            29
001200     05  EP426-NEW-PROMO-STORE-NUMBER  PIC X(05).                       29
001300     05  EP426-RECORD-TERMINATION-CHAR PIC X(01).                       29
001400     05  EP426-FILLER                  PIC X(74).                       29
