000100***********************************************************       00010008
000200**                      EPRD115                          **       00020017
000300**                     LRECL=80                          **       00030013
000400**  THIS COPYBOOK WILL DEFINE THE FIELDS AND LAYOUT OF   **       00040012
000500**  THE CONTROL CARD FILE USED BY EPKUT122 FOR THE       **       00050017
000600**  TIER PRICING LEVEL CHANGES TIMESTAMP CUTOFF.         **       00060017
000700***********************************************************       00070008
000800 01 EP115-CC-CONTROL-CARD.                                        00080017
000801    05 EP115-CC-CONTROL-CARD-DISPLY.                              00080117
000802       10 EP115-CC-CUTOFF-TMST-NAME  PIC X(46) VALUE SPACES.      00080217
000803          88 EP115-CC-VALID-CUTOFF-TMST-NM     VALUE              00080317
000804             'TIER PRICING LEVEL CHANGE TIMESTAMP CUTOFF IS:'.    00080517
000810       10 EP115-CC-TIER-CUTOFF-TMST  PIC X(26) VALUE SPACES.      00081018
000820       10 FILLER                     PIC X(08) VALUE SPACES.      00082018
