000100**************************************************************    00010000
000200*                     COPYBOOK EPRD218                       *    00020000
000300*   DEFINITION OF THE UPC/SKU CROSS REFERENCE FILE CREATED   *    00030001
000400*     FOR CURRENT PRICING IN VARIOUS EXTRACT PROGRAMS        *    00040001
000500* POS 2009 FALL - PRICING INFRASTRUCTURE PROJECT - WR# 35484 *    00050001
000600*   THIS FILE IS SENT INTO A FORMATTER PROGRAM FOR XST_XREF  *    00060002
000700**************************************************************    00070000
000800 01  EP218-UPC-SKU-XREF-RECORD.                                   00080002
000900   05 EP218-UPC-SKU-XREF-HDR.                                     00090002
001000      10 EP218-FILE-ACT-TYP        PIC X(03) VALUE SPACES.        00100002
001100         88 EP218-FILE-CHANGE          VALUE 'CHG'.               00110002
001200         88 EP218-FILE-FULL            VALUE 'FUL'.               00120002
001300      10 EP218-STR-GRP-TYP-CDE     PIC 9(05) VALUE 0.             00130002
001400      10 EP218-STR-GRP-ID          PIC 9(10) VALUE 0.             00140002
001500      10 EP218-XREF-EFFECT-DTE     PIC X(10) VALUE SPACES.        00150006
001600      10 EP218-APPLY-IND           PIC X(01) VALUE SPACES.        00160002
001700         88 EP218-APPLY-NIGHTLY        VALUE 'N'.                 00170002
001800         88 EP218-APPLY-CORRECTION     VALUE 'C'.                 00180002
001900   05 EP218-UPC-SKU-XREF-DTL.                                     00190002
002000      10 EP218-RECORD-ACTION       PIC X(01) VALUE SPACES.        00200002
002100         88 EP218-RECORD-ADD           VALUE 'A'.                 00210002
002300         88 EP218-RECORD-DELETE        VALUE 'D'.                 00230002
002700      10 EP218-UPC-NBR             PIC 9(15) VALUE 0.             00270002
003100      10 EP218-SKU-NBR             PIC 9(08) VALUE 0.             00310002
003200   05 EP218-FILLER                 PIC X(27) VALUE SPACES.        00320004
