000100******************************************************************        
000200*                      EPRD018  LRECL=63                                  
000300*          RECORD LAYOUT FOR EPT_CUST_MDSE_SCNR UPDATES                   
000400******************************************************************        
000500 01  EP018-UPDT-REC.                                                      
000600     05  EP018-SCN-DTE                 PIC  X(10) VALUE SPACE.    001-010 
000700     05  EP018-LOC-NBR                 PIC S9(04) COMP.           011-012 
000800     05  EP018-SCN-TM                  PIC  X(08) VALUE SPACE.    013-020 
000900     05  EP018-IP-ADDR                 PIC  X(15) VALUE SPACE.    021-035 
001000     05  EP018-LOC-SRVR-NM             PIC  X(08) VALUE SPACE.    036-043 
001100     05  EP018-SCNR-MKR-NM             PIC  X(10) VALUE SPACE.    044-053 
001200     05  EP018-UPC-NBR                 PIC S9(15)V COMP-3.        054-061 
001300     05  EP018-LOC-SKU-STAT-CDE        PIC  X(02) VALUE SPACE.    062-063 
001400                                                                          
