000100**************************************************************    00010000
000200*                     COPYBOOK EPRD212                       *    00020000
000300*      RECORD DEFINITION FOR THE CUSTOMER INCENTIVE TABLE    *    00030002
000400*          POS 2009 INFRASTRUCTURE PROJECT WR# 35484         *    00040002
000500**************************************************************    00050000
000600 01  EP212-XST-CUST-INCTV.                                        00060002
000610     05  EP212-XST-CINCTV-HDR.                                    00061002
000620         10 EP212-FILE-ACT-TYP            PIC  X(03) VALUE SPACES.00062005
000630            88 EP212-FILE-CHANGE               VALUE 'CHG'.       00063002
000640            88 EP212-FILE-FULL                 VALUE 'FUL'.       00064002
000641         10 EP212-STR-HIER-CDE            PIC  9(02) VALUE 0.     00064104
000650         10 EP212-STR-GRP-TYP-CDE         PIC  9(05) VALUE 0.     00065002
000660         10 EP212-STR-GRP-ID              PIC  9(10) VALUE 0.     00066002
000670         10 EP212-STR-FILE-LIST-DTE       PIC  X(08) VALUE SPACES.00067008
000680         10 EP212-APPLY-IND               PIC  X(01) VALUE SPACES.00068005
000690            88 EP212-APPLY-NIGHTLY             VALUE 'N'.         00069002
000691            88 EP212-APPLY-CORRECTION          VALUE 'C'.         00069102
001310     05  EP212-XST-CINCTV-DTL.                                    00131002
001320         10 EP212-RECORD-ACTION           PIC  X(01) VALUE SPACES.00132005
001330            88 EP212-RECORD-ADD                VALUE 'A'.         00133002
001350            88 EP212-RECORD-DELETE             VALUE 'D'.         00135002
001400         10  EP212-SYS-OF-REC-ID           PIC 9(10) VALUE ZERO.  00140003
001500         10  EP212-SYS-IDENTIFIER          PIC X(02) VALUE SPACES.00150003
001600         10  EP212-PROMO-SCHEME-CDE        PIC X(04) VALUE SPACES.00160003
001700         10  EP212-INCTV-TYP-CDE           PIC X(03) VALUE SPACES.00170003
001800         10  EP212-INCTV-NM                PIC X(50) VALUE SPACES.00180003
001900         10  EP212-INCTV-TRGR-TYP-CDE      PIC X(03) VALUE SPACES.00190003
002000         10  EP212-SYS-OF-REC-GP-ID        PIC 9(10) VALUE ZERO.  00200003
002100     05  EP212-FILLER                      PIC X(18) VALUE SPACES.00210008
