000010******************************************************************00001000
000020*  FIFTH THIRD BIN FILE RECORD LAYOUT.               LRECL=80    *00002000
000030******************************************************************00003000
000100 01  EP036-BIN-FILE-RCD           PIC X(80).                      00004000
000200 01  EP036-HEADER-RCD REDEFINES EP036-BIN-FILE-RCD.               00005000
000300     05  EP036-HDR-RCD-TYPE       PIC X(13).                      00006000
000400         88  EP036-HDR-HEADER          VALUE 'HEADER RECORD'.     00007000
000500     05  EP036-HDR-FILE-TYPE      PIC X(10).                      00008000
000600         88  EP036-HDR-BINDISTR        VALUE 'BIN IDENT'.         00009000
000600         88  EP036-HDR-BINVGIFT        VALUE 'BIN VGIFT'.         00009100
000800     05  EP036-HDR-DATE           PIC X(08).                      00010000
001600     05  FILLER                   PIC X(49).                      00020000
001700 01  EP036-DATA-RCD REDEFINES EP036-BIN-FILE-RCD.                 00030000
001800     05  EP036-DTL-SEQ-NBR        PIC 9(06).                      00040000
001900     05  EP036-DTL-BIN-LENGTH     PIC 9(02).                      00050000
002000     05  EP036-DTL-ACCT-LENGTH    PIC 9(02).                      00060000
002200     05  EP036-DTL-BIN            PIC X(12).                      00070000
002300     05  EP036-DTL-NETWORK-ID     PIC X(04).                      00080000
002400     05  FILLER                   PIC X(54).                      00090000
002900 01  EP036-TRAILER-RCD REDEFINES EP036-BIN-FILE-RCD.              00100000
003000     05  EP036-TRL-RCD-TYPE       PIC X(13).                      00110000
003100         88  EP036-TRL-TRAILER         VALUE 'TRAILR RECORD'.     00120000
003400     05  EP036-TRL-DETAIL-RCD-CNT PIC 9(06).                      00130003
003800     05  FILLER                   PIC X(60).                      00140000
