000100************************************************************      00010003
000200*   COPYBOOK  EPRD250                                      *      00020009
000300* THIS COPYBOOK LAYOUT WILL BE USED TO WRITE FULL FILE     *      00030006
000400*    OFFERS STORE GROUPS CONTROL CARD FILE  WR#33714       *      00040010
000500************************************************************      00050003
000600 01  EP250-CC-CONTROL-CARD.                                       00060006
000700     05  EP250-CC-CONTROL-CARD-DISPLY.                            00070006
000800         10  EP250-CC-STORE-NAME      PIC  X(12)                  00080006
000900                                           VALUE ' STORE NBR: '.  00090006
001000         10  EP250-CC-STR-NBR         PIC  9(05) VALUE ZEROES.    00100006
001100         10  EP250-CC-STORE-GRP-TYP   PIC  X(16) VALUE            00110006
001200                                           ' STR GP TYP CD: '.    00120006
001300         10  EP250-CC-STR-GP-TYP-CDE  PIC  9(05) VALUE ZEROES.    00130006
001400         10  EP250-CC-STORE-GRP-ID    PIC  X(12)                  00140006
001500                                           VALUE ' STR GP ID: '.  00150006
001600         10  EP250-CC-STR-GRP-ID      PIC  9(05) VALUE ZEROES.    00160007
001700     05  FILLER                       PIC  X(25) VALUE SPACES.    00170008
001800********************  END COPYBOOK  ************************      00180006
