000100**************************************************************    00010001
000200*                     COPYBOOK EPRD202                       *    00020009
000300*   RECORD DEFINITION FOR OFFER SECTION RECORD FOR OFFERS    *    00030009
000400*                  NEXT GEN PROJECT  WR33714                 *    00040008
000500**************************************************************    00050001
000600 01  EP202-OFFER-XST-OFR-SECT-RCD.                                00060003
000700     05  EP202-TRIGGER-TYPE           PIC X(01) VALUE SPACES.     00070002
000800     05  EP202-FILE-TYPE              PIC X(03) VALUE SPACES.     00080002
000900     05  EP202-STR-NBR                PIC 9(05) VALUE ZERO.       00090007
001000     05  EP202-EVENT-ID               PIC 9(10) VALUE ZERO.       00100002
001100     05  EP202-OFFER-ID               PIC 9(10) VALUE ZERO.       00110002
001200     05  EP202-OFR-SECT-TYP-CDE       PIC X(01) VALUE SPACES.     00120002
001300     05  EP202-EFF-BEG-DTE            PIC X(08) VALUE SPACES.     00130002
001400     05  EP202-EFF-END-DTE            PIC X(08) VALUE SPACES.     00140002
001500     05  EP202-REDMN-SUPVR-OVRRID-DTE PIC X(08) VALUE SPACES.     00150002
001600     05  EP202-BWP-GET-CNCTR-CDE      PIC X(03) VALUE SPACES.     00160002
001700     05  EP202-BWP-BUY-CNCTR-CDE      PIC X(03) VALUE SPACES.     00170002
001800     05  EP202-CUSTFACG-SHRT-DESC     PIC X(16) VALUE SPACES.     00180002
001900     05  EP202-POS-BTN-TXT            PIC X(08) VALUE SPACES.     00190002
002000     05  EP202-VLD-POS-TNDR-CMP-TYP-CDE                           00200002
002100                                         PIC X(03) VALUE SPACES.  00210001
002200     05  EP202-POS-BTN-RLTV-SEQ-NBR   PIC 9(10) VALUE ZERO.       00220002
002300     05  EP202-POS-BTN-RLTV-SEQ-NBR-X REDEFINES                   00230005
002400         EP202-POS-BTN-RLTV-SEQ-NBR   PIC X(10).                  00240006
002500     05  EP202-LMT-PER-TRN-QTY        PIC 9(05) VALUE ZERO.       00250002
002600     05  EP202-LMT-PER-TRN-QTY-X REDEFINES                        00260006
002700         EP202-LMT-PER-TRN-QTY        PIC X(05).                  00270006
002800     05  EP202-FILLER                 PIC X(18) VALUE SPACES.     00280006
