      ***********************************************************       00010000
      **                      EPRD142                          **       00020001
      **                     LRECL=72                          **       00030000
      **                                                       **       00040000
      **        REWARDS REDEMPTION PARAMETER FILE FORMAT       **       00050000
      **           FORMAT FOR E-COMM RECORDS                   **       00051000
      ***********************************************************       00060000
       01  EP142-RWD-REDM-EXTRCT-REC.                                   00070001
           05  EP142-RWD-REDM-EXTR-FIXED.                               00080001
               10  EP142-RWD-REDM-STR-LOC        PIC  9(004).           00090001
               10  FILLER                        PIC  X(001)  VALUE ','.00100000
               10  EP142-RWD-REDM-EVNT-ID        PIC  X(005).           00110001
               10  FILLER                        PIC  X(001)  VALUE ','.00120000
               10  EP142-RWD-REDM-BEG-DTE        PIC  X(008).           00130001
               10  FILLER                        PIC  X(001)  VALUE ','.00140000
               10  EP142-RWD-REDM-END-DTE        PIC  X(008).           00150001
               10  FILLER                        PIC  X(001)  VALUE ','.00160000
               10  EP142-RWD-REDM-AUTH-TYP-CDE   PIC  9(001).           00170001
               10  FILLER                        PIC  X(001)  VALUE ','.00180000
               10  EP142-RWD-REDM-DISC-TYP-CDE   PIC  X(001).           00190001
               10  FILLER                        PIC  X(001)  VALUE ','.00200000
               10  EP142-RWD-REDM-DISC-AMT       PIC  9(005).           00210001
               10  FILLER                        PIC  X(001)  VALUE ','.00220000
               10  EP142-RWD-REDM-I-E-TYP-CDE    PIC  9(001).           00230001
               10  FILLER                        PIC  X(001)  VALUE ','.00240000
               10  EP142-RWD-REDM-PRE-DAYS-QTY   PIC  9(002).           00241004
               10  FILLER                        PIC  X(001)  VALUE ','.00242004
               10  EP142-RWD-REDM-POST-DAYS-QTY  PIC  9(002).           00243004
               10  FILLER                        PIC  X(001)  VALUE ','.00244004
           05  EP142-RWD-REDM-EXTR-VAR.                                 00250001
               10  EP142-RWD-REDM-EXTR-VAR-TABLE PIC  X(1)  VALUE SPACES00260001
                                               OCCURS 25 TIMES          00270000
                                               INDEXED BY EP142-VAR-IDX.00280001
