000100************************************************************      00010003
000200*   COPYBOOK EPRD252 - LRECL = 80                          *      00011006
000300* THIS COPYBOOK WILL DEFINE THE RECORD LAYOUT FOR THE      *      00020005
000400*   NEXT FUTURE DATE CONTROL CARD                          *      00030005
000500*      NEXT GEN PROJECT    WR#33714                        *      00031007
000600************************************************************      00040003
000700 01  EP252-CC-CONTROL-CARD.                                       00050003
000800     05  EP252-CC-CONTROL-CARD-DISPLY.                            00060003
000900         10  EP252-CC-FILLER-4      PIC X(11)                     00061004
001000                                      VALUE 'OFFSET NBR:'.        00062004
001100         10  EP252-CC-OFFSET-NBR    PIC X(02) VALUE SPACES.       00070003
001200         10  EP252-CC-FILLER-1      PIC X(11)                     00080003
001300                                      VALUE ' FUTURE DT:'.        00090003
001400         10  EP252-CC-FUTURE-DATE   PIC X(10) VALUE SPACES.       00100003
001500         10  EP252-CC-FILLER-2      PIC X(16)                     00110003
001600                                      VALUE ' PREV FUTURE DT:'.   00120003
001700         10  EP252-CC-PREVIOUS-FUTURE-DATE                        00130003
001800                                    PIC X(10) VALUE SPACES.       00140003
001900         10  EP252-CC-FILLER-3      PIC X(10)                     00150003
002000                                      VALUE ' BATCH DT:'.         00160003
002100         10  EP252-CC-CURRENT-BATCH-DATE                          00170003
002200                                    PIC X(10) VALUE SPACES.       00180003
002300                                                                  00200003
