000100***********************************************************       00010008
000200**                      EPRD123                          **       00020023
000300**                     LRECL=80                          **       00030013
000400**  THIS COPYBOOK WILL DEFINE THE FIELDS AND LAYOUT OF   **       00040012
000500**  THE CONTROL CARD FILE USED BY EPKUT117 FOR THE       **       00050023
000510**  ADHOC STORE MOVEMENT CHANGES TIMSTAMP CUTOFF.        **       00051023
000700***********************************************************       00070008
000800 01 EP123-CC-CONTROL-CARD.                                        00080023
000801    05 EP123-CC-CONTROL-CARD-DISPLY.                              00080123
000802       10 EP123-CC-CUTOFF-TMST-NAME   PIC X(42) VALUE SPACES.     00080223
000803          88 EP123-CC-VALID-CUTOFF-TMST-NM     VALUE              00080323
000804             'ADHOC MOVEMENT CHANGE TIMESTAMP CUTOFF IS:'.        00080423
000810       10 EP123-CC-ADHOC-CUTOFF-TMST  PIC X(26) VALUE SPACES.     00081023
000820       10 FILLER                      PIC X(12) VALUE SPACES.     00082023
