000010******************************************************************00001001
000020*  DISCOVER BIN FILE RECORD LAYOUT.               LRECL=80       *00002008
000030******************************************************************00003001
000100 01  EP037-BIN-FILE-RCD           PIC X(80).                      00010008
000200 01  EP037-HEADER-RCD REDEFINES EP037-BIN-FILE-RCD.               00020008
000300     05  EP037-HDR-RCD-TYPE       PIC X(03).                      00030008
000400         88  EP037-HDR-TYPE            VALUE 'HDR'.               00040009
000300     05  EP037-HDR-ISS-NAME       PIC X(16).                      00041008
000400         88  EP037-HDR-ISSNAME         VALUE 'DISCOVER NETWORK'.  00042008
000500     05  EP037-HDR-FILE-TYPE      PIC X(23).                      00050008
000600         88  EP037-HDR-BINDISTR        VALUE                      00060008
                                              'ACTIVE IIN ROUTING FILE'.00070008
000800     05  EP037-HDR-DATE           PIC 9(08).                      00080008
000800     05  EP037-HDR-TIME           PIC 9(04).                      00090008
001600     05  FILLER                   PIC X(26).                      00160008
001700 01  EP037-DATA-RCD REDEFINES EP037-BIN-FILE-RCD.                 00170008
001800     05  EP037-DTL-RCD-TYPE       PIC X(03).                      00180008
000400         88  EP037-DTL-TYPE            VALUE 'RCD'.               00180108
001800     05  EP037-DTL-SEQ-NBR        PIC 9(06).                      00181008
001900     05  EP037-DTL-BIN-LENGTH     PIC 9(02).                      00190008
001900     05  EP037-DTL-BIN-NBR        PIC 9(19).                      00191008
002000     05  EP037-DTL-MIN-PAN-LENGTH PIC 9(02).                      00200008
002000     05  EP037-DTL-MAX-PAN-LENGTH PIC 9(02).                      00210008
002000     05  EP037-DTL-PROD-TYPE      PIC 9(03).                      00220008
002000     05  EP037-DTL-ATM-IND        PIC 9(01).                      00230008
002000     05  EP037-DTL-STAND-IN-IND   PIC 9(01).                      00231008
002400     05  FILLER                   PIC X(41).                      00240008
002900 01  EP037-TRAILER-RCD REDEFINES EP037-BIN-FILE-RCD.              00290008
000300     05  EP037-TRL-RCD-TYPE       PIC X(03).                      00291008
000400         88  EP037-TRL-TYPE            VALUE 'TRL'.               00292008
003400     05  EP037-TRL-DETAIL-RCD-CNT PIC 9(10).                      00340008
003800     05  FILLER                   PIC X(67).                      00380008
