000010***********************************************************       00001010
000020**                      EPRD107                          **       00002010
000030**                     LRECL=80                          **       00003010
000031**  THIS IS THE LAYOUT OF THE CONTROL CARD WHICH HAS THE **       00003110
000032**  CURRENT BATCH OFFSET NUMBER AND THE CURRENT BATCH    **       00003210
000033**  DATE.                                                **       00003310
000070***********************************************************       00007010
000080 01  EP107-CC-CONTROL-CARD.                                       00008010
000090   05 EP107-CC-CONTROL-CARD-DISPLY.                               00009010
000091      10 EP107-CC-CRNT-NBR-NAME      PIC X(31) VALUE SPACES.      00009110
000092         88 EP107-CC-VALID-CRNT-NBR-NM         VALUE              00009210
000093                 'CURRENT BATCH OFFSET NUMBER IS:'.               00009310
000094      10 EP107-CC-CRNT-NBR           PIC X(02) VALUE SPACES.      00009410
000095      10 FILLER                      PIC X(01) VALUE SPACES.      00009510
000096      10 EP107-CC-CRNT-DTE-NAME      PIC X(29) VALUE SPACES.      00009610
000097         88 EP107-CC-VALID-CRNT-DTE-NM         VALUE              00009710
000098                 'CURRENT BATCH FUTURE DATE IS:'.                 00009810
000099      10 EP107-CC-CRNT-DTE           PIC X(10) VALUE SPACES.      00009911
000100   05 FILLER                         PIC X(07) VALUE SPACES.      00010011
