000100**************************************************************    00010000
000200*                     COPYBOOK EPRD213                       *    00020000
000300*   RECORD DEFINITION OF CUSTOMER INCENTIVE SECTION TABLE    *    00030002
000400*          POS 2009 INFRASTRUCTURE PROJECT WR# 35484         *    00040002
000500**************************************************************    00050000
000600 01  EP213-XST-CUST-INCTV-SECT-RCD.                               00060002
000700     05  EP213-XST-CINC-SECT-HDR.                                 00070002
000800         10 EP213-FILE-ACT-TYP            PIC  X(03) VALUE SPACES.00080003
000900            88 EP213-FILE-CHANGE               VALUE 'CHG'.       00090002
001000            88 EP213-FILE-FULL                 VALUE 'FUL'.       00100002
001010         10 EP213-STR-HIER-CDE            PIC 9(02) VALUE 0.      00101002
001100         10 EP213-STR-GRP-TYP-CDE         PIC  9(05) VALUE 0.     00110002
001200         10 EP213-STR-GRP-ID              PIC  9(10) VALUE 0.     00120002
001300         10 EP213-STR-FILE-LIST-DTE       PIC  X(08) VALUE SPACES.00130005
001400         10 EP213-APPLY-IND               PIC  X(01) VALUE SPACES.00140003
001500            88 EP213-APPLY-NIGHTLY             VALUE 'N'.         00150002
001600            88 EP213-APPLY-CORRECTION          VALUE 'C'.         00160002
001700     05  EP213-XST-CINC-SECT-DTL.                                 00170002
001800         10 EP213-RECORD-ACTION           PIC  X(01) VALUE SPACES.00180003
001900            88 EP213-RECORD-ADD                VALUE 'A'.         00190002
002000            88 EP213-RECORD-DELETE             VALUE 'D'.         00200002
002100         10  EP213-SYS-OF-REC-ID           PIC 9(10) VALUE ZERO.  00210002
002200         10  EP213-SYS-IDENTIFIER          PIC X(02) VALUE SPACES.00220002
002300         10  EP213-INCTV-SECT-TYP-CDE      PIC X(01) VALUE SPACES.00230002
002400         10  EP213-INCTV-BEG-TMST          PIC X(19) VALUE SPACES.00240002
002500         10  EP213-INCTV-END-TMST          PIC X(19) VALUE SPACES.00250002
002600         10  EP213-BUY-CNCTR-CDE           PIC X(03) VALUE SPACES.00260002
002700         10  EP213-GET-CNCTR-CDE           PIC X(03) VALUE SPACES.00270002
002800         10  EP213-CUST-SHRT-DESC          PIC X(20) VALUE SPACES.00280002
002900         10  EP213-LMT-PER-TRN-QTY         PIC 9(05) VALUE ZERO.  00290002
003000     05  EP213-FILLER                      PIC X(18) VALUE SPACES.00300005
