000100***************************************************************** 00010000
000200*                     COPYBOOK EPRD229                          * 00020001
000300*   RECORD DEFINITION OF THE XST_VND   TABLE AT THE STORE   *     00030001
000310*     SERVER SIDE.                                              * 00031000
000400*          POS 2009 INFRASTRUCTURE PROJECT WR#35484             * 00040000
000500***************************************************************** 00050000
000600 01  EP229-MH-VND-RECORD.                                         00060001
000700   05 EP229-MH-VND-HEADER.                                        00070001
000800      10 EP229-FILE-ACT-TYP        PIC X(03) VALUE SPACES.        00080001
000900         88 EP229-FILE-CHANGE          VALUE 'CHG'.               00090001
001000         88 EP229-FILE-FULL            VALUE 'FUL'.               00100001
001010      10 EP229-RECORD-ACTION       PIC X(01) VALUE 'A'.           00101004
001100   05 EP229-MH-VND-DATA.                                          00110001
001200      10 EP229-VENDOR-ID           PIC 9(10) VALUE ZEROES.        00120005
001300      10 EP229-VENDOR-NAME         PIC X(30) VALUE SPACES.        00130001
001400   05 EP229-MH-VND-FILLER          PIC X(16) VALUE SPACES.        00140005
