000100***********************************************************               
000200**                      EPRD135                          **               
000300**                     LRECL=60                          **               
000400**  THIS IS THE RECORD LAYOUT USED BY EP FUTURE PERM.    **               
000500**  HAS HIERARCHY FIELDS WILL DRIVE EXTRACT PROCESS.     **               
000700***********************************************************               
000800 01  EP135-FPLU-HIER-RECORD.                                              
004220      10 EP135-DEPT-NBR            PIC 9(04) VALUE 0.                     
004260      10 EP135-MAJ-CLASS           PIC 9(04) VALUE 0.                     
004300      10 EP135-SUB-CLASS           PIC 9(04) VALUE 0.                     
004700      10 EP135-VENDOR-STYLE        PIC 9(08) VALUE 0.                     
001507      10 EP135-SKU-NBR             PIC 9(08) VALUE 0.                     
001503      10 EP135-INTR-UPC-ID         PIC 9(12) VALUE 0.                     
001503      10 EP135-MDSE-HIER-CDE       PIC X(03) VALUE SPACES.                
014900   05 FILLER                       PIC X(17) VALUE SPACES.                
