000100***************************************************************** 00010001
000200*                     COPYBOOK EPRD227                          * 00020001
000300*   RECORD DEFINITION OF THE XST_SUB_CLASS TABLE AT THE STORE   * 00030001
000310*     SERVER SIDE.                                              * 00031001
000400*          POS 2009 INFRASTRUCTURE PROJECT WR#35484             * 00040001
000500***************************************************************** 00050001
000600 01  EP227-MH-SUB-CL-RECORD.                                      00060001
000700   05 EP227-MH-SUB-CL-HEADER.                                     00070001
000800      10 EP227-FILE-ACT-TYP        PIC X(03) VALUE SPACES.        00080001
000900         88 EP227-FILE-CHANGE          VALUE 'CHG'.               00090001
001000         88 EP227-FILE-FULL            VALUE 'FUL'.               00100001
001010      10 EP227-RECORD-ACTION       PIC X(01) VALUE 'A'.           00101004
001100   05 EP227-MH-SUB-CL-DATA.                                       00110001
001200      10 EP227-DPT-NBR             PIC 9(04) VALUE ZEROES.        00120001
001210      10 EP227-MAJ-CL-NBR          PIC 9(04) VALUE ZEROES.        00121001
001220      10 EP227-SUB-CL-NBR          PIC 9(04) VALUE ZEROES.        00122001
001300      10 EP227-SUB-CL-NAME         PIC X(20) VALUE ZERO.          00130001
001400      10 EP227-POS-DESC            PIC X(30) VALUE ZERO.          00140001
001500      10 EP227-DISC-ELIG-IND       PIC X(01) VALUE ZERO.          00150001
001510   05 EP227-MH-SUB-CL-FILLER       PIC X(18) VALUE SPACES.        00151005
