000100**************************************************************    00010000
000200*                     COPYBOOK EPRD215                       *    00020000
000300*   RECORD DEFINITION OF CUSTOMER INCENTIVE MERCHANDISE REC  *    00030001
000400*          POS 2009 INFRASTRUCTURE PROJECT WR# 35484         *    00040001
000500**************************************************************    00050000
000600 01  EP215-XST-CUST-INCTV-MDSE-RCD.                               00060003
000700     05  EP215-XST-CINC-MDSE-HDR.                                 00070001
000800         10 EP215-FILE-ACT-TYP            PIC  X(03) VALUE SPACES.00080002
000900            88 EP215-FILE-CHANGE               VALUE 'CHG'.       00090001
001000            88 EP215-FILE-FULL                 VALUE 'FUL'.       00100001
001100         10 EP215-STR-HIER-CDE            PIC  9(02) VALUE 0.     00110001
001200         10 EP215-STR-GRP-TYP-CDE         PIC  9(05) VALUE 0.     00120001
001300         10 EP215-STR-GRP-ID              PIC  9(10) VALUE 0.     00130001
001400         10 EP215-STR-FILE-LIST-DTE       PIC  X(08) VALUE SPACES.00140005
001500         10 EP215-APPLY-IND               PIC  X(01) VALUE SPACES.00150002
001600            88 EP215-APPLY-NIGHTLY             VALUE 'N'.         00160001
001700            88 EP215-APPLY-CORRECTION          VALUE 'C'.         00170001
001800     05  EP215-XST-CINC-MDSE-DTL.                                 00180001
001900         10 EP215-RECORD-ACTION           PIC  X(01) VALUE SPACES.00190002
002000            88 EP215-RECORD-ADD                VALUE 'A'.         00200001
002100            88 EP215-RECORD-DELETE             VALUE 'D'.         00210001
002200         10  EP215-INCTV-MDSE-SET-ID      PIC 9(10) VALUE ZERO.   00220001
002210         10  EP215-SYS-OF-REC-ID          PIC 9(10) VALUE ZERO.   00221001
002300         10  EP215-SYS-IDENTIFIER         PIC X(02) VALUE SPACES. 00230001
002400         10  EP215-INCTV-SECT-TYP-CDE     PIC X(01) VALUE SPACES. 00240001
002500         10  EP215-SYS-REC-SUB-ID         PIC 9(10) VALUE ZERO.   00250001
002600         10  EP215-MDSE-HIER-CDE          PIC X(03) VALUE SPACES. 00260001
002700         10  EP215-DEPT-NBR               PIC 9(04) VALUE ZERO.   00270001
002800         10  EP215-DEPT-NBR-NL            REDEFINES               00280001
002900             EP215-DEPT-NBR               PIC X(04).              00290001
003000         10  EP215-MAJ-CL-NBR             PIC 9(04) VALUE ZERO.   00300001
003100         10  EP215-MAJ-CL-NBR-NL          REDEFINES               00310001
003200             EP215-MAJ-CL-NBR             PIC X(04).              00320001
003300         10  EP215-SUB-CL-NBR             PIC 9(04) VALUE ZERO.   00330001
003400         10  EP215-SUB-CL-NBR-NL          REDEFINES               00340001
003500             EP215-SUB-CL-NBR             PIC X(04).              00350001
003600         10  EP215-STYLE-ID               PIC 9(08) VALUE ZERO.   00360001
003700         10  EP215-STYLE-ID-NL            REDEFINES               00370001
003800             EP215-STYLE-ID               PIC X(08).              00380001
003900         10  EP215-SKU-NBR                PIC 9(08) VALUE ZERO.   00390001
004000         10  EP215-SKU-NBR-NL             REDEFINES               00400001
004100             EP215-SKU-NBR                PIC X(08).              00410001
004200         10  EP215-MDSE-IE-IND            PIC X(01) VALUE SPACES. 00420001
004300         10  EP215-TKT-CLOR-CDE           PIC X(02) VALUE SPACES. 00430001
004400         10  EP215-ELECT-SLF-TOPR-CD      PIC X(03) VALUE SPACES. 00440001
004500     05  EP215-FILLER                     PIC X(20) VALUE SPACES. 00450005
