000100***********************************************************       00010010
000200**                      EPRD045                          **       00020027
000300**                     LRECL=80                          **       00030027
000400**  THIS IS THE RECORD LAYOUT FOR THE ADVANCE NUMBER OF  **       00040027
000500**  DAYS FOR WHICH 'EP' AND 'SV' FILES ARE SENT TO THE   **       00050027
000600**  CORPORATE SERVER.                                    **       00060027
000700***********************************************************       00070001
000800 01  EP045-ADVDAYS-TO-SND-RECORD.                                 00080027
000810   05 EP045-DAYS-TILL-STORE-OPN    PIC 9(03) VALUE ZEROES.        00081027
000820   05 FILLER                       PIC X(01) VALUE SPACES.        00082027
000900   05 EP045-DAYS-TO-INCR-METRO     PIC 9(03) VALUE ZEROES.        00090027
006400   05 FILLER                       PIC X(73) VALUE SPACES.        00640027
