000100***********************************************************       00010000
000200**                      EPRD075                          **       00020000
000300**                     LRECL=50                          **       00030000
000400**  THIS IS THE RECORD LAYOUT USED BY PERM.  THESE       **       00040000
000500**  FIELDS ARE USED FOR THE XREF SKU CHANGED FILE.       **       00050001
000600***********************************************************       00060000
000700 01  EP075-XREF-SKU-CHG-REC.                                      00070001
000900     05  EP075-INTERNAL-UPC-ID     PIC 9(10) VALUE 0.             00090001
001000     05  FILLER                    PIC X(40) VALUE SPACES.        00100000
