000100**************************************************************    00010001
000200*                     COPYBOOK EPRD204                       *    00020010
000300*   RECORD DEFINITION FOR MERCHANDISE SET RECORD FOR OFFERS  *    00030010
000400*                 NEXT GEN PROJECT  WR33714                  *    00040010
000500**************************************************************    00050001
000600 01  EP204-OFFER-XST-OFR-MDSE-SET.                                00060001
000700     05  EP204-TRIGGER-TYPE             PIC X(01) VALUE SPACES.   00070001
000800     05  EP204-FILE-TYPE                PIC X(03) VALUE SPACES.   00080001
000900     05  EP204-STR-NBR                  PIC 9(05) VALUE ZERO.     00090008
001000     05  EP204-EVENT-ID                 PIC 9(10) VALUE ZERO.     00100001
001100     05  EP204-OFFER-ID                 PIC 9(10) VALUE ZERO.     00110001
001200     05  EP204-OFR-SECT-TYP-CDE         PIC X(01) VALUE SPACES.   00120001
001300     05  EP204-OFR-SECT-BWP-ID          PIC 9(10) VALUE ZERO.     00130001
001400     05  EP204-MDSE-SET-ID              PIC 9(10) VALUE ZERO.     00140002
001500     05  EP204-MDSE-HIER-CDE            PIC X(03) VALUE SPACES.   00150001
001600     05  EP204-DEPT-NBR                 PIC 9(04) VALUE ZERO.     00160001
001700     05  EP204-DEPT-NBR-X      REDEFINES                          00170006
001800         EP204-DEPT-NBR                 PIC X(04).                00180006
001900     05  EP204-MAJ-CL-NBR               PIC 9(04) VALUE ZERO.     00190001
002000     05  EP204-MAJ-CL-NBR-X    REDEFINES                          00200006
002100         EP204-MAJ-CL-NBR               PIC X(04).                00210006
002200     05  EP204-SUB-CL-NBR               PIC 9(04) VALUE ZERO.     00220001
002300     05  EP204-SUB-CL-NBR-X    REDEFINES                          00230006
002400         EP204-SUB-CL-NBR               PIC X(04).                00240006
002500     05  EP204-STYL-ID                  PIC 9(08) VALUE ZERO.     00250001
002600     05  EP204-STYL-ID-X       REDEFINES                          00260006
002700         EP204-STYL-ID                  PIC X(08).                00270006
002800     05  EP204-SKU-NBR                  PIC 9(08) VALUE ZERO.     00280001
002900     05  EP204-SKU-NBR-X       REDEFINES                          00290006
003000         EP204-SKU-NBR                  PIC X(08).                00300006
003100     05  EP204-IE-IND                   PIC X(01) VALUE SPACES.   00310001
003200     05  EP204-EMP-DISC-CDE             PIC X(01) VALUE SPACES.   00320001
003300     05  EP204-DISC-ELIG-IND            PIC X(01) VALUE SPACES.   00330001
003400     05  EP204-TKT-CLOR-CDE             PIC X(01) VALUE SPACES.   00340001
003500     05  EP204-FILLER                   PIC X(05) VALUE SPACES.   00350006
