000100**************************************************************    00010000
000200*                     COPYBOOK EPRD226                       *    00020001
000300*   RECORD DEFINITION OF THE MAJOR CLASS TABLE AT THE STORE  *    00030006
000310*     SERVER SIDE.                                           *    00031006
000400*          POS 2009 INFRASTRUCTURE PROJECT WR#35484          *    00040000
000500**************************************************************    00050000
000600 01  EP226-MH-MAJ-CL-RECORD.                                      00060001
000700   05 EP226-MH-MAJ-CL-HEADER.                                     00070001
000800      10 EP226-FILE-ACT-TYP        PIC X(03) VALUE SPACES.        00080001
000900         88 EP226-FILE-CHANGE          VALUE 'CHG'.               00090001
001000         88 EP226-FILE-FULL            VALUE 'FUL'.               00100001
001010      10 EP226-RECORD-ACTION       PIC X(01) VALUE 'A'.           00101004
001100   05 EP226-MH-MAJ-CL-DATA.                                       00110001
001200      10 EP226-DPT-NBR             PIC 9(04) VALUE ZEROES.        00120001
001210      10 EP226-MAJ-CL-NBR          PIC 9(04) VALUE ZEROES.        00121001
001300      10 EP226-MAJ-CL-NAME         PIC X(20) VALUE ZERO.          00130002
001400   05 EP226-MH-MAJ-CL-FILLER       PIC X(18) VALUE SPACES.        00140005
