000100*---------------------------------------------------------*       00010000
000200*                         EPRD225                         *       00020002
000300*  THIS IS THE CONTROL CARD LAYOUT FOR PRICING FORMATTER  *       00030002
000400*   THE CONTROL CARD CONTAINS THE EXTRACT FILE TYPE       *       00040000
000600*---------------------------------------------------------*       00060000
000700 01  CC-EPCC225-CONTROL-CARD.                                     00070001
000800   05 CC-EPCC225-CONTROL-CARD-DISPLY.                             00080001
000900      10 CC-EPCC225-CONTROL-NM               PIC X(12)            00090001
001000                                              VALUE SPACES.       00100000
001100         88 CC-EPCC225-VALID-NM          VALUE 'FILE TYPE = '.    00110002
001200                                                                  00120000
001300      10 CC-EPCC225-FILE-TYPE           PIC X(04)  VALUE SPACES.  00130001
001400                                                                  00140000
001500   05 FILLER                                 PIC X(64)            00150001
001600                                              VALUE SPACES.       00160000
