000100***********************************************************       00010000
000200**                      EPRD258                          **       00020000
000300**                     LRECL=80        WR#33714          **       00030003
000400**  RECORD LAYOUT FOR THE ADVANCE NUMBER OF DAYS FOR     **       00040002
000500**  WHICH OFFERS FULL FILES ARE SENT TO THE MID-TIER     **       00050002
000600**  CORPORATE SERVER, FOR DISTRIBUTION TO NEW STORES.    **       00060000
000700***********************************************************       00070000
000800 01  EP258-ADVDAYS-TO-SND-RECORD.                                 00080000
000900   05 EP258-CONTROL-CARD-NAME      PIC X(43) VALUE                00090001
001000             'OFFERS ADVANCED DAYS FOR NEW STORE OPENING:'.       00100001
001100   05 FILLER                       PIC X(01) VALUE SPACES.        00110000
001200   05 EP258-DAYS-TILL-STORE-OPN    PIC 9(03) VALUE ZEROES.        00120000
001300   05 FILLER                       PIC X(33) VALUE SPACES.        00130001
