000100**************************************************************    00010000
000200*                     COPYBOOK EPRD224                       *    00020001
000300*   RECORD DEFINITION OF THE DEPARTMENT TABLE AT THE STORE   *    00030002
000310*     SERVER SIDE.                                                00031002
000400*          POS 2009 INFRASTRUCTURE PROJECT WR#35484          *    00040000
000500**************************************************************    00050000
000600 01  EP224-MH-DEPT-RECORD.                                        00060002
000700   05 EP224-MH-DEPT-HEADER.                                       00070002
000800      10 EP224-FILE-ACT-TYP        PIC X(03) VALUE SPACES.        00080002
000900         88 EP224-FILE-CHANGE          VALUE 'CHG'.               00090002
001000         88 EP224-FILE-FULL            VALUE 'FUL'.               00100002
001010      10 EP224-RECORD-ACTION       PIC X(01) VALUE 'A'.           00101011
001100   05 EP224-MH-DEPT-DATA.                                         00110002
001200      10 EP224-DPT-NBR             PIC 9(04) VALUE ZEROES.        00120007
001300      10 EP224-BUS-GP-NBR          PIC 9(03) VALUE ZERO.          00130002
001400      10 EP224-DPT-NAME            PIC X(20) VALUE SPACES.        00140002
001500      10 EP224-MDSE-LNE-CDE        PIC X(01) VALUE SPACES.        00150002
001600      10 EP224-DMA-NBR             PIC 9(04) VALUE ZEROES.        00160002
001700      10 EP224-STR-ZONE-CDE        PIC X(05) VALUE SPACES.        00170002
001800      10 EP224-BUYER-NBR           PIC 9(04) VALUE ZEROES.        00180002
001900      10 EP224-CONT-CLR-EXCL-IND   PIC X(01) VALUE SPACES.        00190002
002000      10 EP224-LAST-UPD-TMST       PIC X(26) VALUE SPACES.        00200008
002100      10 EP224-SOR-LAST-UPD-TMST   PIC X(26) VALUE SPACES.        00210008
002200   05 EP224-MH-DEPT-FILLER         PIC X(22) VALUE SPACES.        00220012
