      ***************************************************************** 00010000
      *    EPRD800 - PARAMETER CARD                                     00020002
      *    RECORD LENGTH - 80 BYTES                                     00030000
      *                                                                 00040000
      *CHANGE HISTORY:                                                  00050000
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES           00060000
      * ------- ---------- ----------- -------------------------------- 00070000
      ***************************************************************** 00080000
       01  EP800-PARAMETER-RECORD.                                      00090001
           05  EP800-DAYS-FR-EVNT-NBR             PIC  +999.            00091001
           05  EP800-DAYS-FR-EVNT-NBR-R REDEFINES                       00092001
                   EP800-DAYS-FR-EVNT-NBR.                              00093001
               10  EP800-SIGN                     PIC  X(1).            00094001
               10  EP800-DAYS                     PIC  9(3).            00095001
           05  FILLER                             PIC  X(76) VALUE      00095100
                                                             SPACES.    00095200
