      ******************************************************************00001000
      *                         EPWS024                                 00002002
      ******************************************************************00009000
       01  ADDRESS-CHANGE-REC.                                          00009103
           03  ACCOUNT-NUMBER.                                          00009204
               05  ACCOUNT-NUMBER-1      PIC 9(10).                     00009304
               05  ACCOUNT-NUMBER-2      PIC 9(2).                      00009404
           03  ACCOUNT-ADDRESS-1         PIC X(30).                     00009504
           03  ACCOUNT-ADDRESS-2         PIC X(30).                     00009604
           03  ACCOUNT-CITY              PIC X(30).                     00009704
           03  ACCOUNT-STATE             PIC X(3).                      00009804
           03  ACCOUNT-COUNTRY           PIC X(3).                      00009904
           03  ACCOUNT-POSTCODE          PIC X(9).                      00010004
           03  ACCOUNT-US-POSTCODE REDEFINES ACCOUNT-POSTCODE.          00010104
               05  ACCOUNT-US-ZIP1       PIC X(5).                      00010204
               05  ACCOUNT-US-ZIP2       PIC X(4).                      00010304
           03  ACCOUNT-CANADIAN-POSTCODE REDEFINES ACCOUNT-POSTCODE.    00010404
               05  ACCOUNT-CAN-ZIP       PIC X(6).                      00010504
               05  ACCOUNT-CAN-FILL      PIC X(3).                      00010604
           03  ACCOUNT-ZIP-3             PIC XX.                        00010704
           03  ACCOUNT-HOME-PHONE.                                      00010804
               05  ACCOUNT-HOME-AREA-CODE                               00010904
                                         PIC X(6).                      00011004
               05  ACCOUNT-HOME-EXCHANGE PIC X(3).                      00011104
               05  ACCOUNT-HOME-NUMBER   PIC X(4).                      00011204
           03  ACCOUNT-WORK-PHONE.                                      00011304
               05  ACCOUNT-WORK-AREA-CODE                               00011404
                                         PIC X(6).                      00011504
               05  ACCOUNT-WORK-EXCHANGE PIC X(3).                      00011604
               05  ACCOUNT-WORK-NUMBER   PIC X(4).                      00011704
           03  ACCOUNT-ADRS-CHG-SOURCE   PIC X(4).                      00011804
           03  ACCOUNT-VALID-DATE.                                      00011904
               05  ACCOUNT-VALID-MM      PIC 9(2).                      00012004
               05  FILLER                PIC X.                         00012104
               05  ACCOUNT-VALID-DD      PIC 9(2).                      00012204
               05  FILLER                PIC X.                         00012304
               05  ACCOUNT-VALID-CCYY    PIC 9(4).                      00012404
      * USED TO DETERMINE (P)RIMARY VS (S)ECONDARY APPLICANTS           00012505
           03  ACCOUNT-ROLE-CDE          PIC X.                         00012605
           03  ACCOUNT-STORE             PIC 9(4).                      00012705
           03  ACCOUNT-RGST-ID           PIC 9(4).                      00012805
           03  ACCOUNT-TRN-NBR           PIC 9(4).                      00012905
           03  ACCOUNT-FILLER            PIC X(20).                     00013005
