000110*---------------------------------------------------------*       00010000
000120*                         EPWS140                         *       00020001
000140*   THIS IS THE CONTROL CARD LAYOUT FOR MEMBER EPCC140.   *       00030000
000150*   THE CONTROL CARD CONTAINS THE BATCH RUN DATE (TODAY)  *       00040000
000151*   OF THE POS PLU DATA EXTRACT.                          *       00050000
000170*---------------------------------------------------------*       00060000
000200 01  CC-EPCC140-CONTROL-CARD.                                     00070000
000300   05 CC-EPCC140-CONTROL-CARD-DISPLY.                             00080000
000400      10 CC-EPCC140-CONTROL-NM               PIC X(27)            00090000
000410                                              VALUE SPACES.       00100000
000500         88 CC-EPCC140-VALID-NM                                   00110000
000600           VALUE 'TODAY (JOB SCHEDULED DATE):'.                   00120000
000700      10 CC-EPCC140-TODAY-DATE               PIC X(10)            00130002
000710                                              VALUE SPACES.       00140000
000800   05 FILLER                                 PIC X(43)            00150000
000900                                              VALUE SPACES.       00160000
