000110*---------------------------------------------------------*       00010000
000120*                         EPWS001                         *       00011000
000140*   THIS IS THE CONTROL CARD LAYOUT FOR MEMBER EPCC009.   *       00012000
000150*   THE CONTROL CARD CONTAINS THE BATCH RUN TIMESTAMP     *       00013000
000151*   FROM THE PREVIOUS RUN OF THE PLU AND XREF EXTRACT.    *       00014000
000170*---------------------------------------------------------*       00014200
000200 01  CC-EPCC009-CONTROL-CARD.                                     00014300
000300   05 CC-EPCC009-CONTROL-CARD-DISPLY.                             00014400
000400      10 CC-EPCC009-CONTROL-FIRST       PIC X(01)  VALUE SPACES.  00014502
000700      10 CC-EPCC009-PREV-TIMESTAMP      PIC X(26)  VALUE SPACES.  00014900
000400      10 CC-EPCC009-CONTROL-LAST        PIC X(01)  VALUE SPACES.  00015002
000400      10 FILLER                         PIC X(52)  VALUE SPACES.  00016000
