000100************************************************************      00010000
000200*  EPWS208                                                        00011009
000200*  COPYBOOK USED TO DEFINE FIELDS USED IN GENERATING              00020009
000300*  NETCOOL ALERT MESSAGES.  NEXT GEN OFFERS WR#33714              00030013
000400************************************************************      00040001
000500*----------------------------------------------------------       00050002
000600* NETCOOL ERROR MESSAGES                                          00060002
000700*----------------------------------------------------------       00070002
000800 01  EPWS208-NETCOOL-VARIABLES.                                   00080004
000900     05  EPWS208-NETCOOL-TABLE        OCCURS 10 TIMES             00090004
001000                        INDEXED BY EPWS208-NETC-INDX.             00100004
001100         10 EPWS208-ERR-OFFER-ID      PIC S9(10) VALUE ZERO.      00110009
001200         10 EPWS208-ERR-EVENT-ID      PIC S9(10) VALUE ZERO.      00120009
001300         10 EPWS208-ERR-MDSE-ID       PIC S9(10) VALUE ZERO.      00130009
001400         10 EPWS208-ERR-TIER-LVL-N    PIC S9(10) VALUE ZERO.      00140009
001500         10 EPWS208-ERR-LMT-PER-TRN   PIC S9(18) VALUE ZERO.      00150009
001600         10 EPWS208-ERR-POS-BTN-SNM   PIC S9(10) VALUE ZERO.      00160009
001700* OVERFLOW FLAGS (NETCOOL)                                        00170006
001900         10 EPWS208-OFFER-OVRFL-FL    PIC  X(01) VALUE 'N'.       00190006
002200         10 EPWS208-EVENT-OVRFL-FL    PIC  X(01) VALUE 'N'.       00220006
002500         10 EPWS208-LPTQT-OVRFL-FL    PIC  X(01) VALUE 'N'.       00250006
002800         10 EPWS208-TIERN-OVRFL-FL    PIC  X(01) VALUE 'N'.       00280006
003100         10 EPWS208-MDSES-OVRFL-FL    PIC  X(01) VALUE 'N'.       00310006
003400         10 EPWS208-RLTVN-OVRFL-FL    PIC  X(01) VALUE 'N'.       00340006
003700         10 EPWS208-RECORD-IN-ERROR   PIC  X(01) VALUE SPACE.     00370009
004400         10 EPWS208-STRING1           PIC  X(50) VALUE SPACES.    00371009
004500         10 EPWS208-STRING2           PIC  X(50) VALUE SPACES.    00372009
004600         10 EPWS208-STRING3           PIC  X(50) VALUE SPACES.    00373009
004700         10 EPWS208-STRING4           PIC  X(50) VALUE SPACES.    00374009
004800         10 EPWS208-STRING5           PIC  X(50) VALUE SPACES.    00375009
004900         10 EPWS208-STRING6           PIC  X(50) VALUE SPACES.    00376009
003600*                                                                 00376109
003600*  SWITCHES OUTSIDE THE TABLE                                     00377009
003600*                                                                 00378009
003800     05  EPWS208-OFFER-OVFL-SW        PIC  X(01) VALUE 'N'.       00380009
003900         88 EPWS208-OFFER-DATA-IN-RANGE          VALUE 'Y'.       00390009
004000         88 EPWS208-OFR-DATA-NOT-IN-RANGE        VALUE 'N'.       00400009
004100     05  EPWS208-NETCOOL-ALRT-CRT     PIC  X(01) VALUE 'N'.       00410009
004200         88 EPWS208-NETCOOL-ALERT                VALUE 'Y'.       00420009
004300         88 EPWS208-NO-ALERT                     VALUE 'N'.       00430009
005000                                                                  00500002
028900*----------------------------------------------------------------*00501010
029000* COUNTERS                                                       *00502010
029100*----------------------------------------------------------------*00503010
029200 01  EP208-PROGRAM-COUNTERS.                                      00504010
029300     05  EP208-ALERT-RECS-OUT         PIC  9(09) VALUE 0.         00505010
029300     05  EP208-ERROR-RCD-COUNT        PIC  9(09) VALUE 0.         00505111
                                                                        00506010
005100*-----------------------------------------------------------------00510007
005200*  ABEND VARIABLES                                                00520007
005300*-----------------------------------------------------------------00530007
005400 01  EPWS208-AC-ABEND-CODE            PIC S9(04) VALUE +0         00540008
005500                                                 COMP SYNC.       00550007
005600     88  EPWS208-AC-4004-TBL-OVRFLW-ERR          VALUE +4004.     00560007
005700                                                                  00570007
022797**********************  END COPYBOOK  ****************************00580009
