      ******************************************************************00010001
      ** THIS IS THE WORKING STORAGE COPY MEMBER THAT DEFINES THE       00020001
      ** LOAD CONSTANTS TO USE WHEN ACQUIRING ADDRESSABILITY TO THE     00030001
      ** KOHL'S INTERNAL STORE TABLE.                                   00040001
      **                                                                00050001
      ** THE COPY MEMBER ALSO DEFINES STANDARD CONSTANTS AND            00060001
      ** WORK AREAS REQUIRED FOR P.O.S.-RELATED ACTIVITY.               00070001
      ******************************************************************00080001
031504**DATE:03/15/2004 CHANGED BY:JULIE TEWES ADD CIT2, CIP8, CIP9     00090002
031504******************************************************************00100001
042104**DATE:04/15/2004 CHANGED BY:JULIE TEWES CHANGE REIGIONS TO BE    00110002
042104**                DYNAMIC INSTEAD OF TO A SPECIFIC REGION         00120002
050404******************************************************************00130004
050404**DATE:05/04/2004 CHANGED BY:JULIE TEWES ADD SPACE AFTER REGION   00140004
050404******************************************************************00150004
       01  EP000-POS-STORE-TBL-CONSTANTS.                               00160001
           05  EP000-POS-STORE-TBL-PGM-NAME                             00170001
                                       PIC X(8)     VALUE 'CRKCS030'.   00180001
           05  EP000-POS-STORE-TBL-PGM-LENGTH                           00190001
                                       PIC S9(9)    VALUE +300074       00200001
                                       COMP SYNC.                       00210001
           05  EP000-POS-STR-TBL-STR-ENTRIES                            00220001
                                       PIC S9(5)    VALUE +1500         00230001
                                       COMP-3.                          00240001
           05  EP000-POS-CAP-LVL.                                       00250001
               10  EP000-PC-SUPPORTS-VISA-ISO                           00260001
                                       PIC S9(4)    VALUE +1.           00270001
               10  EP000-PC-SUPPORTS-PS2000                             00280001
                                       PIC S9(4)    VALUE +2.           00290001
               10  EP000-PC-SUPPORTS-PHASE-1                            00300001
                                       PIC S9(4)    VALUE +3.           00310001
      *                                                                 00320001
       01  EP000-PV-PROGRAM-VARIABLES.                                  00330001
           05  EP000-PV-CURRENT-SYSID.                                  00340005
050404         10  EP000-PV-CURR-SYSID PIC X(3).                        00350005
050404             88  EP000-PV-KOHLS-TEST-SYSTEM   VALUE 'CIT'.        00360005
050404             88  EP000-PV-KOHLS-ACC-TEST-SYSTEM                   00370005
050404                                              VALUE 'CIQ',        00380005
050404                                                    'CIL'.        00390005
050404             88  EP000-PV-KOHLS-QA-SYSTEM     VALUE 'CIQ'.        00400005
050404             88  EP000-PV-KOHLS-LEARNING-SYSTEM                   00410005
050404                                              VALUE 'CIL'.        00420005
050404             88  EP000-PV-KOHLS-PROD-SYSTEM   VALUE 'CIP'.        00430005
050404         10  FILLER              PIC X(1)     VALUE SPACES.       00440005
           05  EP000-PV-CURRENT-NETNAME                                 00450001
                                       PIC X(8)     VALUE SPACES.       00460001
           05  EP000-PV-CURRENT-STORE-NMBR-X                            00470001
                                       PIC X(4)     VALUE SPACES.       00480001
           05  EP000-PV-CURRENT-STORE-NUMBER                            00490001
                                       REDEFINES                        00500001
                                           EP000-PV-CURRENT-STORE-NMBR-X00510001
                                       PIC 9(4).                        00520001
           05  EP000-PV-MAX-CIRCULAR-COUNTER                            00530001
                                       PIC S9(4)    VALUE +99           00540001
                                                    COMP SYNC.          00550001
      *                                                                 00560001
       01  EP000-DT-DATE-TIME-AREA.                                     00570001
           05  EP000-DT-CURRENT-ABSTIME                                 00580001
                                       PIC S9(15)   VALUE ZERO          00590001
                                       COMP-3.                          00600001
           05  EP000-DT-CURRENT-DATE-YYYYMMDD.                          00610001
               10  EP000-DT-CURRENT-YEAR                                00620001
                                       PIC X(4)     VALUE ZEROS.        00630001
               10  FILLER              PIC X(1)     VALUE SPACE.        00640001
               10  EP000-DT-CURRENT-MONTH                               00650001
                                       PIC X(2)     VALUE ZEROS.        00660001
               10  FILLER              PIC X(1)     VALUE SPACE.        00670001
               10  EP000-DT-CURRENT-DAY                                 00680001
                                       PIC X(2)     VALUE ZEROS.        00690001
           05  EP000-DT-CURR-DATE-YYYYMMDD.                             00700001
               10  EP000-DT-CURR-YEAR                                   00710001
                                       PIC X(4)     VALUE ZEROS.        00720001
               10  EP000-DT-CURR-MONTH                                  00730001
                                       PIC X(2)     VALUE ZEROS.        00740001
               10  EP000-DT-CURR-DAY                                    00750001
                                       PIC X(2)     VALUE ZEROS.        00760001
           05  EP000-DT-FORMAT-DATE-MMDDYY.                             00770001
               10  EP000-DT-FORMAT-MONTH                                00780001
                                       PIC X(2)     VALUE ZEROS.        00790001
               10  FILLER              PIC X(1)     VALUE SPACE.        00800001
               10  EP000-DT-FORMAT-DAY                                  00810001
                                       PIC X(2)     VALUE ZEROS.        00820001
               10  FILLER              PIC X(1)     VALUE SPACE.        00830001
               10  EP000-DT-FORMAT-YEAR                                 00840001
                                       PIC X(2)     VALUE ZEROS.        00850001
           05  EP000-DT-CURRENT-EDITED-TIME                             00860001
                                       PIC X(8)     VALUE SPACES.       00870001
           05  EP000-DT-CURRENT-TIME-X PIC X(8)     VALUE SPACES.       00880001
           05  FILLER                  REDEFINES                        00890001
                                           EP000-DT-CURRENT-TIME-X.     00900001
               10  EP000-DT-CURRENT-TIME                                00910001
                                       PIC 9(6).                        00920001
               10  FILLER              PIC X(2).                        00930001
      *                                                                 00940001
       01  EP000-SL-SYSTEM-LOG-MSG-AREA.                                00950001
           05  EP000-SL-SYS-LOG-QUEUE-NAME                              00960001
                                           PIC X(4)     VALUE 'EPCL'.   00970001
           05  EP000-SL-SYS-LOG-MSG-LENGTH                              00980001
                                           PIC S9(4)    VALUE +128      00990001
                                           COMP SYNC.                   01000001
           05  EP000-SL-SYS-LOG-Q-NAME-LENGTH                           01010001
                                           PIC S9(4)    VALUE +4        01020001
                                           COMP SYNC.                   01030001
           05  EP000-SL-VISANET-ERROR-ID   PIC X(2)     VALUE 'VN'.     01040001
           05  EP000-SL-VISANET-LINE-FAIL.                              01050001
               10  FILLER                  PIC X(33)    VALUE           01060001
                           'VISANET COMMUNICATION FAILURE ON '.         01070001
               10  EP000-SL-VN-FAILED-TERMID                            01080001
                                           PIC X(04)    VALUE SPACES.   01090001
               10  FILLER                  PIC X(03)    VALUE '.  '.    01100001
           05  EP000-SL-VISANET-COMM-FAIL.                              01110001
               10  FILLER                  PIC X(37)    VALUE           01120001
                       ' TOTAL VISANET COMMUNICATION FAILURE.'.         01130001
                                                                        01140001
           05  EP000-SL-COMM-FAIL-MSG-LEN  PIC S9(8)    VALUE +37       01150001
                                                        COMP.           01160001
           05  EP000-SL-PROGRAM-NAME.                                   01170001
               10  EP000-SL-PN-SYSID       PIC X(2)     VALUE SPACES.   01180001
               10  FILLER                  PIC X(1)     VALUE SPACE.    01190001
               10  EP000-SL-PN-PGM-TYPE    PIC X(2)     VALUE SPACES.   01200001
                   88  EP000-SL-PGM-TYPE-CICS           VALUE 'CS'.     01210001
                   88  EP000-SL-PGM-TYPE-UTIL           VALUE 'UT'.     01220001
                   88  EP000-SL-PGM-TYPE-UPDATE         VALUE 'UP'.     01230001
                   88  EP000-SL-PGM-TYPE-REPORT         VALUE 'RP'.     01240001
               10  EP000-SL-PN-PGM-NUMBER  PIC X(3)     VALUE SPACES.   01250001
           05  EP000-SL-SYS-LOG-QUEUING-IND                             01260001
                                           PIC X(1)     VALUE 'D'.      01270001
               88  EP000-SL-SYSTEM-LOG-ENQUEUED         VALUE 'E'.      01280001
               88  EP000-SL-SYSTEM-LOG-DEQUEUED         VALUE 'D'.      01290001
           05  EP000-SL-CICS-RESPONSE-DISPLAY                           01300001
                                           PIC ZZZ9.                    01310001
           05  EP000-SL-SYSTEM-LOG-MESSAGE.                             01320001
               10  EP000-SL-MESSAGE-DATE   PIC X(6)     VALUE SPACES.   01330001
               10  FILLER                  PIC X(1)     VALUE '.'.      01340001
               10  EP000-SL-MESSAGE-TIME   PIC X(6)     VALUE SPACES.   01350001
               10  FILLER                  PIC X(1)     VALUE ' '.      01360001
               10  EP000-SL-PROGRAM-ID.                                 01370001
                   15  EP000-SL-PI-SYSID   PIC X(2)     VALUE SPACES.   01380001
                   15  EP000-SL-PI-PGM-TYPE                             01390001
                                           PIC X(1)     VALUE SPACE.    01400001
                       88 EP000-SL-PTYP-CICS            VALUE 'C'.      01410001
                       88 EP000-SL-PTYP-UTIL            VALUE 'U'.      01420001
                       88 EP000-SL-PTYP-UPDATE          VALUE 'P'.      01430001
                       88 EP000-SL-PTYP-REPORT          VALUE 'R'.      01440001
                   15  EP000-SL-PI-PGM-NUMBER                           01450001
                                           PIC X(3)     VALUE SPACES.   01460001
                   15  EP000-SL-PI-MESSAGE-NUMBER                       01470001
                                           PIC 9(2)     VALUE ZEROS.    01480001
               10  EP000-SL-MESSAGE-TYPE   PIC X(1)     VALUE SPACE.    01490001
                   88  EP000-SL-ERROR                   VALUE 'E'.      01500001
                   88  EP000-SL-WARNING                 VALUE 'W'.      01510001
                   88  EP000-SL-INFORMATION             VALUE 'I'.      01520001
               10  FILLER                  PIC X(1)     VALUE SPACE.    01530001
               10  EP000-SL-SYS-LOG-MESSAGE-DTL                         01540001
                                           PIC X(108)   VALUE SPACES.   01550001
           05  EP000-MAX-MESSAGE-LINES     PIC 9(02)    VALUE 10.       01560001
           05  EP000-MESSAGE-LINE-COUNTER  PIC 9(02)    VALUE ZEROS.    01570001
           05  EP000-MESSAGE-LINE-TABLE.                                01580001
               10  EP000-MESSAGE-DETAIL  OCCURS 10 TIMES                01590001
                                         INDEXED BY EP000-MD-INDEX.     01600001
                   15  EP000-MD-SYSTEM-LOG-MESSAGE                      01610001
                                           PIC X(108).                  01620001
