000110*---------------------------------------------------------*       00010000
000120*                         EPWS159                         *       00020000
000140*   THIS IS THE CONTROL CARD LAYOUT FOR MEMBERS EPCC159   *       00030001
000120*   AND EPCC160.                                          *       00031001
000150*   THE CONTROL CARD CONTAINS THE NUMBER OF DAYS IN       *       00040000
000151*   ADVANCE FUTURE PRICING DATA MUST BE AVAILABLE AT THE  *       00050003
000120*   STORE.  IT IS USED FOR BOTH PERM AND RED TICKET.      *       00051001
000170*---------------------------------------------------------*       00060000
000200 01  CC-EPCC159-CONTROL-CARD.                                     00070000
000300   05 CC-EPCC159-CONTROL-CARD-DISPLY.                             00080000
000400      10 CC-EPCC159-CONTROL-NM            PIC X(37) VALUE SPACES. 00090002
000500         88 CC-EPCC159-VALID-NM-PERM                              00110001
000600           VALUE 'FUTURE   PERM     # DAYS IN ADVANCE: '.         00120002
000500         88 CC-EPCC159-VALID-NM-RED-TKT                           00121002
000600           VALUE 'FUTURE RED TICKET # DAYS IN ADVANCE: '.         00122002
                                                                        00123002
000700      10 CC-EPCC159-ADVANCE-DAYS          PIC 9(03) VALUE ZERO.   00130004
000800   05 FILLER                              PIC X(40) VALUE SPACES. 00150002
