000100******************************************************************00001001
000200*                         EPWS021                                 00002001
000700******************************************************************00003001
000100 01  ADDRESS-CHANGE-FILE.                                         00010000
000100       05 ACCT-MSG-TYPE-CODE    PIC X(01).                        00020000
000100                                                                  00021001
000100       05 ACCT-NUMBER.                                            00030000
000100         10 ACCT-NUMBER-1       PIC 9(10).                        00040000
000100         10 ACCT-NUMBER-2       PIC 9(02).                        00050000
000100                                                                  00051001
000100       05 ACCT-ADDRESS-1        PIC X(30).                        00060000
000100       05 ACCT-ADDRESS-2        PIC X(30).                        00070000
000100       05 ACCT-CITY             PIC X(30).                        00080000
000100       05 ACCT-STATE            PIC X(03).                        00090000
000100       05 ACCT-COUNTRY          PIC X(03).                        00100000
000100                                                                  00101001
000100       05 ACCT-POSTCODE.                                          00110000
000100         10 ACCT-ZIP-1          PIC X(05).                        00120000
000100         10 ACCT-ZIP-2          PIC X(04).                        00130000
000100                                                                  00131001
000100       05 ACCT-ZIP-3            PIC X(02).                        00140000
000100       05 ACCT-HOME-PHONE       PIC X(13).                        00150000
000100       05 ACCT-WORK-PHONE       PIC X(13).                        00160000
000100       05 ACCT-ADRS-CHG-SOURCE  PIC X(04).                        00170000
000100                                                                  00171001
000100       05 ACCT-VALID-DATE.                                        00180000
000100         10 ACCT-VALID-MM       PIC 9(02).                        00190000
000100         10 FILLER              PIC X(01).                        00200000
000100         10 ACCT-VALID-DD       PIC 9(02).                        00210000
000100         10 FILLER              PIC X(01).                        00220000
000100         10 ACCT-VALID-CCYY     PIC 9(04).                        00230000
000100                                                                  00230101
N2I206                                                                  00231408
N2I206       05 ACCT-ADDR-CHG-IND     PIC X(01).                        00231508
N2I206       05 ACCT-STORE            PIC 9(04).                        00231608
N2I206       05 ACCT-RGST-ID          PIC 9(04).                        00231708
N2I206       05 ACCT-TRN-NBR          PIC 9(04).                        00231808
N2I206                                                                  00231908
