000110*---------------------------------------------------------*       00010000
000120*                         EPWS151                         *       00020001
000140*   THIS IS THE CONTROL CARD LAYOUT FOR MEMBER EPCC171.   *       00030002
000150*   THE CONTROL CARD CONTAINS THE NUMBER OF DAYS THAT     *       00040001
000151*   PROMO TABLES SHOULD BE RETAINED.  THIS IS USED FOR    *       00050001
000151*   THE PROMO PURGE PROCESS.                              *       00060001
000170*---------------------------------------------------------*       00070000
000200 01  CC-EPCC171-CONTROL-CARD.                                     00080002
000300   05 CC-EPCC171-CONTROL-CARD-DISPLY.                             00090002
000400      10 CC-EPCC171-CONTROL-NM               PIC X(41)            00100002
000410                                              VALUE SPACES.       00110000
000500         88 CC-EPCC171-VALID-NM                                   00120002
000600           VALUE 'NUMBER OF DAYS TO RETAIN ON PROMO TABLES:'.     00130001
000700      10 CC-EPCC171-PURGE-RETAIN-DAYS        PIC 9999             00140002
000710                                              VALUE ZEROES.       00150001
000800   05 FILLER                                 PIC X(35)            00160001
000900                                              VALUE SPACES.       00170000
