  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  ETKM352                                            *   00005   
*        MAP     ET352A                                             *   00006   
*        PROGRAM ETKCS352 (SIZE ADD/UPD/DEL SCREEN)                 *   00007   
*        TRANSID E352                                               *   00008   
*        SYSTEM  CICS ARCHITECTURE                                  *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
ETKM352 DFHMSD TYPE=DSECT,                                             C00006   
               LANG=COBOL,                                             C00009   
               MODE=INOUT,                                             C00010   
               STORAGE=AUTO,                                           C00012   
               TERM=3270-2,                                            C00008   
               TIOAPFX=YES                                              00011   
ET352A  DFHMDI LINE=2,                                                 C00013   
               COLUMN=1,                                               C00014   
               SIZE=(19,80),                                           C00015   
               CTRL=(FREEKB),                                          C00007   
               MAPATTS=(COLOR,HILIGHT),                                C00016   
               DSATTS=(COLOR,HILIGHT)                                   00017   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00018   
*  SCREEN LINE 04                                                       00019   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00020   
        DFHMDF ATTRB=(ASKIP,NORM),                                     C00021   
               INITIAL='SIZE GROUP...............:',                   C00022   
               COLOR=NEUTRAL,                                          C00023   
               LENGTH=26,                                              C00024   
               POS=(03,06)                                              00025   
ASZGPCD DFHMDF ATTRB=(ASKIP,NORM),                                     C00026   
               COLOR=BLUE,                                             C00027   
               LENGTH=2,                                               C00029   
               POS=(03,33)                                              00030   
ASZGPDS DFHMDF ATTRB=(ASKIP,NORM),                                     C00032   
               COLOR=BLUE,                                             C00035   
               LENGTH=30,                                              C00033   
               POS=(03,36)                                              00032   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00035   
*  SCREEN LINE 06                                                       00036   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00037   
        DFHMDF ATTRB=(ASKIP,NORM),                                     C00038   
               INITIAL='NRF SIZE CODE............:',                   C00039   
               COLOR=NEUTRAL,                                          C00040   
               LENGTH=26,                                              C00041   
               POS=(05,06)                                              00042   
ANRFCD  DFHMDF ATTRB=(UNPROT,NORM),                                    C00043   
               COLOR=GREEN,                                            C00044   
               HILIGHT=UNDERLINE,                                      C00045   
               LENGTH=5,                                               C00046   
               POS=(05,33)                                              00047   
        DFHMDF ATTRB=(ASKIP,DRK),                                      C00048**2
               INITIAL=' ',                                            C00049**2
               LENGTH=1,                                               C00050**2
               POS=(05,39)                                              00051**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00052   
*  SCREEN LINE 08                                                       00053   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00054   
        DFHMDF ATTRB=(ASKIP,NORM),                                     C00055   
               INITIAL='KOHLS DESCRIPTION........:',                   C00056   
               COLOR=NEUTRAL,                                          C00057   
               LENGTH=26,                                              C00058   
               POS=(07,6)                                               00059   
AKDESC  DFHMDF ATTRB=(UNPROT,NORM),                                    C00060   
               COLOR=GREEN,                                            C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=10,                                              C00063**3
               POS=(07,33)                                              00064   
        DFHMDF ATTRB=(ASKIP,DRK),                                      C00048**2
               INITIAL=' ',                                            C00049**2
               LENGTH=1,                                               C00050**2
               POS=(07,44)                                              00051**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00052   
*  SCREEN LINE 10                                                       00053   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00054   
        DFHMDF ATTRB=(ASKIP,NORM),                                     C00055   
               INITIAL='EXTENDED SIZE DESCRIPTION:',                   C00056   
               COLOR=NEUTRAL,                                          C00057   
               LENGTH=26,                                              C00058   
               POS=(09,6)                                               00059   
AESZDS  DFHMDF ATTRB=(UNPROT,NORM),                                    C00043   
               COLOR=GREEN,                                            C00044   
               HILIGHT=UNDERLINE,                                      C00045   
               LENGTH=20,                                              C00063**3
               POS=(09,33)                                              00064   
        DFHMDF ATTRB=(ASKIP,DRK),                                      C00048**2
               INITIAL=' ',                                            C00049**2
               LENGTH=1,                                               C00050**2
               POS=(09,54)                                              00051**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00052   
*  SCREEN LINE 12                                                       00053   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00054   
        DFHMDF ATTRB=(ASKIP,NORM),                                     C00055   
               INITIAL='PRIMARY DESCRIPTION......:',                   C00056   
               COLOR=NEUTRAL,                                          C00057   
               LENGTH=26,                                              C00058   
               POS=(11,6)                                               00059   
APDESC  DFHMDF ATTRB=(UNPROT,NORM),                                    C00060   
               COLOR=GREEN,                                            C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=40,                                              C00063**3
               POS=(11,33)                                              00064   
        DFHMDF ATTRB=(ASKIP,DRK),                                      C00048**2
               INITIAL=' ',                                            C00049**2
               LENGTH=1,                                               C00050**2
               POS=(11,74)                                              00051**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00052   
*  SCREEN LINE 14                                                       00053   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00054   
        DFHMDF ATTRB=(ASKIP,NORM),                                     C00055   
               INITIAL='SECONDARY DESCRIPTION....:',                   C00056   
               COLOR=NEUTRAL,                                          C00057   
               LENGTH=26,                                              C00058   
               POS=(13,6)                                               00059   
ASDESC  DFHMDF ATTRB=(UNPROT,NORM),                                    C00060   
               COLOR=GREEN,                                            C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=40,                                              C00063**3
               POS=(13,33)                                              00064   
        DFHMDF ATTRB=(ASKIP,DRK),                                      C00048**2
               INITIAL=' ',                                            C00049**2
               LENGTH=1,                                               C00050**2
               POS=(13,74)                                              00051**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00035   
*  SCREEN LINE 16                                                       00036   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00037   
        DFHMDF ATTRB=(ASKIP,NORM),                                     C00038   
               INITIAL='STANDARD SIZE CODE.......:',                   C00039   
               COLOR=NEUTRAL,                                          C00040   
               LENGTH=26,                                              C00041   
               POS=(15,06)                                              00042   
ASTNDSC DFHMDF ATTRB=(UNPROT,NORM),                                    C00043   
               COLOR=GREEN,                                            C00044   
               HILIGHT=UNDERLINE,                                      C00045   
               LENGTH=9,                                               C00046   
               POS=(15,33)                                              00047   
        DFHMDF ATTRB=(ASKIP,DRK),                                      C00048**2
               INITIAL=' ',                                            C00049**2
               LENGTH=1,                                               C00050**2
               POS=(15,43)                                              00051**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00052   
*  SCREEN LINE 18                                                       00053   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00054   
        DFHMDF ATTRB=(ASKIP,NORM),                                     C00055   
               INITIAL='STANDARD DESCRIPTION.....:',                   C00056   
               COLOR=NEUTRAL,                                          C00057   
               LENGTH=26,                                              C00058   
               POS=(17,6)                                               00059   
ASTNDDE DFHMDF ATTRB=(UNPROT,NORM),                                    C00060   
               COLOR=GREEN,                                            C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=10,                                              C00063**3
               POS=(17,33)                                              00064   
        DFHMDF ATTRB=(ASKIP,DRK),                                      C00048**2
               INITIAL=' ',                                            C00049**2
               LENGTH=1,                                               C00050**2
               POS=(17,44)                                              00051**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00018   
*  SCREEN LINE 20                                                       00019   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00020   
ASTNMSG DFHMDF ATTRB=(ASKIP,BRT),                                      C00021   
               COLOR=YELLOW,                                           C00023   
               LENGTH=70,                                              C00024   
               POS=(19,6)                                               00025   
**************                                                                  
        DFHMSD TYPE=FINAL                                               00248   
**************                                                                  
        END                                                             00249   
