  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  ETKM356                                            *   00005   
*        MAP     ET356A                                             *   00006   
*        PROGRAM ETKCS356 (EXTENDED SIZE LIST SCREEN)               *   00007   
*        TRANSID E356                                               *   00008   
*        SYSTEM  CICS ARCHITECTURE                                  *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
ETKM356 DFHMSD TYPE=DSECT,                                             C00006   
               LANG=COBOL,                                             C00009   
               MODE=INOUT,                                             C00010   
               STORAGE=AUTO,                                           C00012   
               TERM=3270-2,                                            C00008   
               TIOAPFX=YES                                              00011   
ET356A  DFHMDI LINE=2,                                                 C00013   
               COLUMN=1,                                               C00014   
               SIZE=(19,80),                                           C00015   
               CTRL=(FREEKB),                                          C00007   
               MAPATTS=(COLOR,HILIGHT),                                C00016   
               DSATTS=(COLOR,HILIGHT)                                   00017   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00018   
*  SCREEN LINE 03                                                       00019   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00020   
        DFHMDF POS=(02,49),LENGTH=05,ATTRB=(ASKIP,BRT),                C00029**1
               INITIAL='ITEMS'                                          00030**1
ASTRTIT DFHMDF POS=(02,55),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00031**3
               HILIGHT=UNDERLINE,COLOR=GREEN,PICOUT='ZZZZ9'             00032**1
        DFHMDF POS=(02,61),LENGTH=02,ATTRB=(ASKIP,NORM),               C00033**1
               INITIAL='TO',COLOR=NEUTRAL                               00034**1
AENDIT  DFHMDF POS=(02,64),LENGTH=05,ATTRB=(ASKIP,NORM),               C00035**6
               COLOR=BLUE,PICOUT='ZZZZ9'                                00035**6
        DFHMDF POS=(02,70),LENGTH=02,ATTRB=(ASKIP,NORM),               C00036**1
               INITIAL='OF',COLOR=NEUTRAL                               00037**1
ATOTIT  DFHMDF POS=(02,73),LENGTH=05,ATTRB=(ASKIP,NORM),               C00038**6
               COLOR=BLUE,PICOUT='ZZZZ9'                                00035**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                   00035   
*  SCREEN LINE 05 - EXTENDED SIZE LIST COLUMN TITLE                     00036   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                   00037   
        DFHMDF POS=(04,01),LENGTH=03,ATTRB=(ASKIP,BRT),                C00029**1
               INITIAL='SEL'                                            00030**1
        DFHMDF POS=(04,06),LENGTH=25,ATTRB=(ASKIP,BRT),                C00029**1
               INITIAL='EXTENDED SIZE DESCRIPTION'                      00030**1
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                   00035   
*  SCREEN LINE 06 - START OF EXTENDED SIZE LIST LINE                    00036   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                   00037   
ASEL01  DFHMDF POS=(05,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00051**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00052**1
        DFHMDF POS=(05,04),LENGTH=01,ATTRB=(ASKIP)                      00053**4
AEXT01  DFHMDF POS=(05,06),LENGTH=20,ATTRB=(ASKIP,NORM),COLOR=BLUE      00054**6
*                                                                       00037   
ASEL02  DFHMDF POS=(06,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00051**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00052**1
        DFHMDF POS=(06,04),LENGTH=01,ATTRB=(ASKIP)                      00053**4
AEXT02  DFHMDF POS=(06,06),LENGTH=20,ATTRB=(ASKIP,NORM),COLOR=BLUE      00054**6
*                                                                       00037   
ASEL03  DFHMDF POS=(07,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00051**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00052**1
        DFHMDF POS=(07,04),LENGTH=01,ATTRB=(ASKIP)                      00053**4
AEXT03  DFHMDF POS=(07,06),LENGTH=20,ATTRB=(ASKIP,NORM),COLOR=BLUE      00054**6
*                                                                       00037   
ASEL04  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00051**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00052**1
        DFHMDF POS=(08,04),LENGTH=01,ATTRB=(ASKIP)                      00053**4
AEXT04  DFHMDF POS=(08,06),LENGTH=20,ATTRB=(ASKIP,NORM),COLOR=BLUE      00054**6
*                                                                       00037   
ASEL05  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00051**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00052**1
        DFHMDF POS=(09,04),LENGTH=01,ATTRB=(ASKIP)                      00053**4
AEXT05  DFHMDF POS=(09,06),LENGTH=20,ATTRB=(ASKIP,NORM),COLOR=BLUE      00054**6
*                                                                       00037   
ASEL06  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00051**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00052**1
        DFHMDF POS=(10,04),LENGTH=01,ATTRB=(ASKIP)                      00053**4
AEXT06  DFHMDF POS=(10,06),LENGTH=20,ATTRB=(ASKIP,NORM),COLOR=BLUE      00054**6
*                                                                       00037   
ASEL07  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00051**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00052**1
        DFHMDF POS=(11,04),LENGTH=01,ATTRB=(ASKIP)                      00053**4
AEXT07  DFHMDF POS=(11,06),LENGTH=20,ATTRB=(ASKIP,NORM),COLOR=BLUE      00054**6
*                                                                       00037   
ASEL08  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00051**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00052**1
        DFHMDF POS=(12,04),LENGTH=01,ATTRB=(ASKIP)                      00053**4
AEXT08  DFHMDF POS=(12,06),LENGTH=20,ATTRB=(ASKIP,NORM),COLOR=BLUE      00054**6
*                                                                       00037   
ASEL09  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00051**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00052**1
        DFHMDF POS=(13,04),LENGTH=01,ATTRB=(ASKIP)                      00053**4
AEXT09  DFHMDF POS=(13,06),LENGTH=20,ATTRB=(ASKIP,NORM),COLOR=BLUE      00054**6
*                                                                       00037   
ASEL10  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00051**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00052**1
        DFHMDF POS=(14,04),LENGTH=01,ATTRB=(ASKIP)                      00053**4
AEXT10  DFHMDF POS=(14,06),LENGTH=20,ATTRB=(ASKIP,NORM),COLOR=BLUE      00054**6
*                                                                       00037   
ASEL11  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00051**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00052**1
        DFHMDF POS=(15,04),LENGTH=01,ATTRB=(ASKIP)                      00053**4
AEXT11  DFHMDF POS=(15,06),LENGTH=20,ATTRB=(ASKIP,NORM),COLOR=BLUE      00054**6
*                                                                       00037   
ASEL12  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00051**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00052**1
        DFHMDF POS=(16,04),LENGTH=01,ATTRB=(ASKIP)                      00053**4
AEXT12  DFHMDF POS=(16,06),LENGTH=20,ATTRB=(ASKIP,NORM),COLOR=BLUE      00054**6
*                                                                       00037   
ASEL13  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00051**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00052**1
        DFHMDF POS=(17,04),LENGTH=01,ATTRB=(ASKIP)                      00053**4
AEXT13  DFHMDF POS=(17,06),LENGTH=20,ATTRB=(ASKIP,NORM),COLOR=BLUE      00054**6
*                                                                       00037   
ASEL14  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00051**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00052**1
        DFHMDF POS=(18,04),LENGTH=01,ATTRB=(ASKIP)                      00053**4
AEXT14  DFHMDF POS=(18,06),LENGTH=20,ATTRB=(ASKIP,NORM),COLOR=BLUE      00054**6
*                                                                       00037   
**************                                                                  
        DFHMSD TYPE=FINAL                                               00248   
**************                                                                  
        END                                                             00249   
