*          DATA SET ETKM330    AT LEVEL 002 AS OF 03/02/94                      
  PRINT  NOGEN                                                          00001   
***************************************************************         00002   
*  BMS MAPSET :  ETKM330 - FUNCTION GROUP/TRANSACTION SET LIST          00003   
*      MAP    :  ET330A                                                 00004   
***************************************************************         00005   
ETKM330  DFHMSD TYPE=DSECT,                                            X00006   
               CTRL=(FREEKB),                                          X00007   
               TERM=3270-2,                                            X00008   
               LANG=COBOL,                                             X00009   
               MODE=INOUT,                                             X00010   
               TIOAPFX=YES,                                            X00011   
               STORAGE=AUTO                                             00012   
ET330A   DFHMDI LINE=2,                                                X00013   
               COLUMN=1,                                               X00014   
               SIZE=(19,80),                                           X00015   
               MAPATTS=(COLOR,HILIGHT),                                X00016   
               DSATTS=(COLOR,HILIGHT)                                   00017   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00018   
*  SCREEN LINE 03                                                       00019   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00020   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00021   
               INITIAL='ITEMS',                                        X00022   
               COLOR=NEUTRAL,                                          X00023   
               LENGTH=5,                                               X00024   
               POS=(02,44)                                              00025   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00026   
               JUSTIFY=(LEFT,BLANK),                                   X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICOUT='ZZZ,ZZ9',                                       X00030   
               LENGTH=7,                                               X00031   
               POS=(02,50)                                              00032   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00033   
               INITIAL='TO',                                           X00034   
               COLOR=NEUTRAL,                                          X00035   
               LENGTH=2,                                               X00036   
               POS=(02,58)                                              00037   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00038   
               JUSTIFY=(LEFT,BLANK),                                   X00039   
               COLOR=BLUE,                                             X00040   
               PICOUT='ZZZ,ZZ9',                                       X00041   
               LENGTH=7,                                               X00042   
               POS=(02,61)                                              00043   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00044   
               INITIAL='OF',                                           X00045   
               COLOR=NEUTRAL,                                          X00046   
               LENGTH=2,                                               X00047   
               POS=(02,69)                                              00048   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00049   
               JUSTIFY=(LEFT,BLANK),                                   X00050   
               COLOR=BLUE,                                             X00051   
               PICOUT='ZZZ,ZZ9',                                       X00052   
               LENGTH=7,                                               X00053   
               POS=(02,72)                                              00054   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00055   
*  SCREEN LINE 05                                                       00056   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00057   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00058   
               INITIAL='FUNCTIONAL',                                   X00059   
               COLOR=NEUTRAL,                                          X00060   
               LENGTH=10,                                              X00061   
               POS=(04,01)                                              00062   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00063   
               INITIAL='NAME',                                         X00064   
               COLOR=NEUTRAL,                                          X00065   
               LENGTH=4,                                               X00066   
               POS=(04,13)                                              00067   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00068   
               INITIAL='TRANSACTION',                                  X00069   
               COLOR=NEUTRAL,                                          X00070   
               LENGTH=11,                                              X00071   
               POS=(04,34)                                              00072   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00073   
               INITIAL='NAME',                                         X00074   
               COLOR=NEUTRAL,                                          X00075   
               LENGTH=4,                                               X00076   
               POS=(04,47)                                              00077   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00078   
               INITIAL='ABBREVIATION',                                 X00079   
               COLOR=NEUTRAL,                                          X00080   
               LENGTH=12,                                              X00081   
               POS=(04,68)                                              00082   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00083   
*  SCREEN LINE 06                                                       00084   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00085   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00086   
               INITIAL='GROUP',                                        X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=5,                                               X00089   
               POS=(05,3)                                               00090   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00091   
               INITIAL='SET',                                          X00092   
               COLOR=NEUTRAL,                                          X00093   
               LENGTH=3,                                               X00094   
               POS=(05,39)                                              00095   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00096   
*  SCREEN LINE 08                                                       00097   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00098   
AFGRP01  DFHMDF ATTRB=(ASKIP),                                         X00099   
               COLOR=BLUE,                                             X00100   
               LENGTH=2,                                               X00101   
               POS=(07,4)                                               00102   
AFGNM01  DFHMDF ATTRB=(ASKIP),                                         X00103   
               JUSTIFY=(LEFT,BLANK),                                   X00104   
               COLOR=BLUE,                                             X00105   
               LENGTH=25,                                              X00106   
               POS=(07,13)                                              00107   
ATSET01  DFHMDF ATTRB=(ASKIP),                                         X00108   
               JUSTIFY=(LEFT,BLANK),                                   X00109   
               COLOR=BLUE,                                             X00110   
               LENGTH=3,                                               X00111   
               POS=(07,39)                                              00112   
ATSNM01  DFHMDF ATTRB=(ASKIP),                                         X00113   
               JUSTIFY=(LEFT,BLANK),                                   X00114   
               COLOR=BLUE,                                             X00115   
               LENGTH=25,                                              X00116   
               POS=(07,47)                                              00117   
AABBR01  DFHMDF ATTRB=(ASKIP),                                         X00118   
               JUSTIFY=(LEFT,BLANK),                                   X00119   
               COLOR=BLUE,                                             X00120   
               LENGTH=3,                                               X00121   
               POS=(07,73)                                              00122   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00123**2
*  SCREEN LINE 09                                                       00124**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00125**2
AFGRP02  DFHMDF ATTRB=(ASKIP),                                         X00126**2
               COLOR=BLUE,                                             X00127**2
               LENGTH=2,                                               X00128**2
               POS=(08,4)                                               00129**2
AFGNM02  DFHMDF ATTRB=(ASKIP),                                         X00130**2
               JUSTIFY=(LEFT,BLANK),                                   X00131**2
               COLOR=BLUE,                                             X00132**2
               LENGTH=25,                                              X00133**2
               POS=(08,13)                                              00134**2
ATSET02  DFHMDF ATTRB=(ASKIP),                                         X00135**2
               JUSTIFY=(LEFT,BLANK),                                   X00136**2
               COLOR=BLUE,                                             X00137**2
               LENGTH=3,                                               X00138**2
               POS=(08,39)                                              00139**2
ATSNM02  DFHMDF ATTRB=(ASKIP),                                         X00140**2
               JUSTIFY=(LEFT,BLANK),                                   X00141**2
               COLOR=BLUE,                                             X00142**2
               LENGTH=25,                                              X00143**2
               POS=(08,47)                                              00144**2
AABBR02  DFHMDF ATTRB=(ASKIP),                                         X00145**2
               JUSTIFY=(LEFT,BLANK),                                   X00146**2
               COLOR=BLUE,                                             X00147**2
               LENGTH=3,                                               X00148**2
               POS=(08,73)                                              00149**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00150**2
*  SCREEN LINE 10                                                       00151**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00152**2
AFGRP03  DFHMDF ATTRB=(ASKIP),                                         X00153**2
               COLOR=BLUE,                                             X00154**2
               LENGTH=2,                                               X00155**2
               POS=(09,4)                                               00156**2
AFGNM03  DFHMDF ATTRB=(ASKIP),                                         X00157**2
               JUSTIFY=(LEFT,BLANK),                                   X00158**2
               COLOR=BLUE,                                             X00159**2
               LENGTH=25,                                              X00160**2
               POS=(09,13)                                              00161**2
ATSET03  DFHMDF ATTRB=(ASKIP),                                         X00162**2
               JUSTIFY=(LEFT,BLANK),                                   X00163**2
               COLOR=BLUE,                                             X00164**2
               LENGTH=3,                                               X00165**2
               POS=(09,39)                                              00166**2
ATSNM03  DFHMDF ATTRB=(ASKIP),                                         X00167**2
               JUSTIFY=(LEFT,BLANK),                                   X00168**2
               COLOR=BLUE,                                             X00169**2
               LENGTH=25,                                              X00170**2
               POS=(09,47)                                              00171**2
AABBR03  DFHMDF ATTRB=(ASKIP),                                         X00172**2
               JUSTIFY=(LEFT,BLANK),                                   X00173**2
               COLOR=BLUE,                                             X00174**2
               LENGTH=3,                                               X00175**2
               POS=(09,73)                                              00176**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00177**2
*  SCREEN LINE 11                                                       00178**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00179**2
AFGRP04  DFHMDF ATTRB=(ASKIP),                                         X00180**2
               COLOR=BLUE,                                             X00181**2
               LENGTH=2,                                               X00182**2
               POS=(10,4)                                               00183**2
AFGNM04  DFHMDF ATTRB=(ASKIP),                                         X00184**2
               JUSTIFY=(LEFT,BLANK),                                   X00185**2
               COLOR=BLUE,                                             X00186**2
               LENGTH=25,                                              X00187**2
               POS=(10,13)                                              00188**2
ATSET04  DFHMDF ATTRB=(ASKIP),                                         X00189**2
               JUSTIFY=(LEFT,BLANK),                                   X00190**2
               COLOR=BLUE,                                             X00191**2
               LENGTH=3,                                               X00192**2
               POS=(10,39)                                              00193**2
ATSNM04  DFHMDF ATTRB=(ASKIP),                                         X00194**2
               JUSTIFY=(LEFT,BLANK),                                   X00195**2
               COLOR=BLUE,                                             X00196**2
               LENGTH=25,                                              X00197**2
               POS=(10,47)                                              00198**2
AABBR04  DFHMDF ATTRB=(ASKIP),                                         X00199**2
               JUSTIFY=(LEFT,BLANK),                                   X00200**2
               COLOR=BLUE,                                             X00201**2
               LENGTH=3,                                               X00202**2
               POS=(10,73)                                              00203**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00204**2
*  SCREEN LINE 12                                                       00205**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00206**2
AFGRP05  DFHMDF ATTRB=(ASKIP),                                         X00207**2
               COLOR=BLUE,                                             X00208**2
               LENGTH=2,                                               X00209**2
               POS=(11,4)                                               00210**2
AFGNM05  DFHMDF ATTRB=(ASKIP),                                         X00211**2
               JUSTIFY=(LEFT,BLANK),                                   X00212**2
               COLOR=BLUE,                                             X00213**2
               LENGTH=25,                                              X00214**2
               POS=(11,13)                                              00215**2
ATSET05  DFHMDF ATTRB=(ASKIP),                                         X00216**2
               JUSTIFY=(LEFT,BLANK),                                   X00217**2
               COLOR=BLUE,                                             X00218**2
               LENGTH=3,                                               X00219**2
               POS=(11,39)                                              00220**2
ATSNM05  DFHMDF ATTRB=(ASKIP),                                         X00221**2
               JUSTIFY=(LEFT,BLANK),                                   X00222**2
               COLOR=BLUE,                                             X00223**2
               LENGTH=25,                                              X00224**2
               POS=(11,47)                                              00225**2
AABBR05  DFHMDF ATTRB=(ASKIP),                                         X00226**2
               JUSTIFY=(LEFT,BLANK),                                   X00227**2
               COLOR=BLUE,                                             X00228**2
               LENGTH=3,                                               X00229**2
               POS=(11,73)                                              00230**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00231**2
*  SCREEN LINE 13                                                       00232**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00233**2
AFGRP06  DFHMDF ATTRB=(ASKIP),                                         X00234**2
               COLOR=BLUE,                                             X00235**2
               LENGTH=2,                                               X00236**2
               POS=(12,4)                                               00237**2
AFGNM06  DFHMDF ATTRB=(ASKIP),                                         X00238**2
               JUSTIFY=(LEFT,BLANK),                                   X00239**2
               COLOR=BLUE,                                             X00240**2
               LENGTH=25,                                              X00241**2
               POS=(12,13)                                              00242**2
ATSET06  DFHMDF ATTRB=(ASKIP),                                         X00243**2
               JUSTIFY=(LEFT,BLANK),                                   X00244**2
               COLOR=BLUE,                                             X00245**2
               LENGTH=3,                                               X00246**2
               POS=(12,39)                                              00247**2
ATSNM06  DFHMDF ATTRB=(ASKIP),                                         X00248**2
               JUSTIFY=(LEFT,BLANK),                                   X00249**2
               COLOR=BLUE,                                             X00250**2
               LENGTH=25,                                              X00251**2
               POS=(12,47)                                              00252**2
AABBR06  DFHMDF ATTRB=(ASKIP),                                         X00253**2
               JUSTIFY=(LEFT,BLANK),                                   X00254**2
               COLOR=BLUE,                                             X00255**2
               LENGTH=3,                                               X00256**2
               POS=(12,73)                                              00257**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00258**2
*  SCREEN LINE 14                                                       00259**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00260**2
AFGRP07  DFHMDF ATTRB=(ASKIP),                                         X00261**2
               COLOR=BLUE,                                             X00262**2
               LENGTH=2,                                               X00263**2
               POS=(13,4)                                               00264**2
AFGNM07  DFHMDF ATTRB=(ASKIP),                                         X00265**2
               JUSTIFY=(LEFT,BLANK),                                   X00266**2
               COLOR=BLUE,                                             X00267**2
               LENGTH=25,                                              X00268**2
               POS=(13,13)                                              00269**2
ATSET07  DFHMDF ATTRB=(ASKIP),                                         X00270**2
               JUSTIFY=(LEFT,BLANK),                                   X00271**2
               COLOR=BLUE,                                             X00272**2
               LENGTH=3,                                               X00273**2
               POS=(13,39)                                              00274**2
ATSNM07  DFHMDF ATTRB=(ASKIP),                                         X00275**2
               JUSTIFY=(LEFT,BLANK),                                   X00276**2
               COLOR=BLUE,                                             X00277**2
               LENGTH=25,                                              X00278**2
               POS=(13,47)                                              00279**2
AABBR07  DFHMDF ATTRB=(ASKIP),                                         X00280**2
               JUSTIFY=(LEFT,BLANK),                                   X00281**2
               COLOR=BLUE,                                             X00282**2
               LENGTH=3,                                               X00283**2
               POS=(13,73)                                              00284**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00285**2
*  SCREEN LINE 15                                                       00286**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00287**2
AFGRP08  DFHMDF ATTRB=(ASKIP),                                         X00288**2
               COLOR=BLUE,                                             X00289**2
               LENGTH=2,                                               X00290**2
               POS=(14,4)                                               00291**2
AFGNM08  DFHMDF ATTRB=(ASKIP),                                         X00292**2
               JUSTIFY=(LEFT,BLANK),                                   X00293**2
               COLOR=BLUE,                                             X00294**2
               LENGTH=25,                                              X00295**2
               POS=(14,13)                                              00296**2
ATSET08  DFHMDF ATTRB=(ASKIP),                                         X00297**2
               JUSTIFY=(LEFT,BLANK),                                   X00298**2
               COLOR=BLUE,                                             X00299**2
               LENGTH=3,                                               X00300**2
               POS=(14,39)                                              00301**2
ATSNM08  DFHMDF ATTRB=(ASKIP),                                         X00302**2
               JUSTIFY=(LEFT,BLANK),                                   X00303**2
               COLOR=BLUE,                                             X00304**2
               LENGTH=25,                                              X00305**2
               POS=(14,47)                                              00306**2
AABBR08  DFHMDF ATTRB=(ASKIP),                                         X00307**2
               JUSTIFY=(LEFT,BLANK),                                   X00308**2
               COLOR=BLUE,                                             X00309**2
               LENGTH=3,                                               X00310**2
               POS=(14,73)                                              00311**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00312**2
*  SCREEN LINE 16                                                       00313**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00314**2
AFGRP09  DFHMDF ATTRB=(ASKIP),                                         X00315**2
               COLOR=BLUE,                                             X00316**2
               LENGTH=2,                                               X00317**2
               POS=(15,4)                                               00318**2
AFGNM09  DFHMDF ATTRB=(ASKIP),                                         X00319**2
               JUSTIFY=(LEFT,BLANK),                                   X00320**2
               COLOR=BLUE,                                             X00321**2
               LENGTH=25,                                              X00322**2
               POS=(15,13)                                              00323**2
ATSET09  DFHMDF ATTRB=(ASKIP),                                         X00324**2
               JUSTIFY=(LEFT,BLANK),                                   X00325**2
               COLOR=BLUE,                                             X00326**2
               LENGTH=3,                                               X00327**2
               POS=(15,39)                                              00328**2
ATSNM09  DFHMDF ATTRB=(ASKIP),                                         X00329**2
               JUSTIFY=(LEFT,BLANK),                                   X00330**2
               COLOR=BLUE,                                             X00331**2
               LENGTH=25,                                              X00332**2
               POS=(15,47)                                              00333**2
AABBR09  DFHMDF ATTRB=(ASKIP),                                         X00334**2
               JUSTIFY=(LEFT,BLANK),                                   X00335**2
               COLOR=BLUE,                                             X00336**2
               LENGTH=3,                                               X00337**2
               POS=(15,73)                                              00338**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00339**2
*  SCREEN LINE 17                                                       00340**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00341**2
AFGRP10  DFHMDF ATTRB=(ASKIP),                                         X00342**2
               COLOR=BLUE,                                             X00343**2
               LENGTH=2,                                               X00344**2
               POS=(16,4)                                               00345**2
AFGNM10  DFHMDF ATTRB=(ASKIP),                                         X00346**2
               JUSTIFY=(LEFT,BLANK),                                   X00347**2
               COLOR=BLUE,                                             X00348**2
               LENGTH=25,                                              X00349**2
               POS=(16,13)                                              00350**2
ATSET10  DFHMDF ATTRB=(ASKIP),                                         X00351**2
               JUSTIFY=(LEFT,BLANK),                                   X00352**2
               COLOR=BLUE,                                             X00353**2
               LENGTH=3,                                               X00354**2
               POS=(16,39)                                              00355**2
ATSNM10  DFHMDF ATTRB=(ASKIP),                                         X00356**2
               JUSTIFY=(LEFT,BLANK),                                   X00357**2
               COLOR=BLUE,                                             X00358**2
               LENGTH=25,                                              X00359**2
               POS=(16,47)                                              00360**2
AABBR10  DFHMDF ATTRB=(ASKIP),                                         X00361**2
               JUSTIFY=(LEFT,BLANK),                                   X00362**2
               COLOR=BLUE,                                             X00363**2
               LENGTH=3,                                               X00364**2
               POS=(16,73)                                              00365**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00366**2
*  SCREEN LINE 18                                                       00367**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00368**2
AFGRP11  DFHMDF ATTRB=(ASKIP),                                         X00369**2
               COLOR=BLUE,                                             X00370**2
               LENGTH=2,                                               X00371**2
               POS=(17,4)                                               00372**2
AFGNM11  DFHMDF ATTRB=(ASKIP),                                         X00373**2
               JUSTIFY=(LEFT,BLANK),                                   X00374**2
               COLOR=BLUE,                                             X00375**2
               LENGTH=25,                                              X00376**2
               POS=(17,13)                                              00377**2
ATSET11  DFHMDF ATTRB=(ASKIP),                                         X00378**2
               JUSTIFY=(LEFT,BLANK),                                   X00379**2
               COLOR=BLUE,                                             X00380**2
               LENGTH=3,                                               X00381**2
               POS=(17,39)                                              00382**2
ATSNM11  DFHMDF ATTRB=(ASKIP),                                         X00383**2
               JUSTIFY=(LEFT,BLANK),                                   X00384**2
               COLOR=BLUE,                                             X00385**2
               LENGTH=25,                                              X00386**2
               POS=(17,47)                                              00387**2
AABBR11  DFHMDF ATTRB=(ASKIP),                                         X00388**2
               JUSTIFY=(LEFT,BLANK),                                   X00389**2
               COLOR=BLUE,                                             X00390**2
               LENGTH=3,                                               X00391**2
               POS=(17,73)                                              00392**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00393**2
*  SCREEN LINE 19                                                       00394**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00395**2
AFGRP12  DFHMDF ATTRB=(ASKIP),                                         X00396**2
               COLOR=BLUE,                                             X00397**2
               LENGTH=2,                                               X00398**2
               POS=(18,4)                                               00399**2
AFGNM12  DFHMDF ATTRB=(ASKIP),                                         X00400**2
               JUSTIFY=(LEFT,BLANK),                                   X00401**2
               COLOR=BLUE,                                             X00402**2
               LENGTH=25,                                              X00403**2
               POS=(18,13)                                              00404**2
ATSET12  DFHMDF ATTRB=(ASKIP),                                         X00405**2
               JUSTIFY=(LEFT,BLANK),                                   X00406**2
               COLOR=BLUE,                                             X00407**2
               LENGTH=3,                                               X00408**2
               POS=(18,39)                                              00409**2
ATSNM12  DFHMDF ATTRB=(ASKIP),                                         X00410**2
               JUSTIFY=(LEFT,BLANK),                                   X00411**2
               COLOR=BLUE,                                             X00412**2
               LENGTH=25,                                              X00413**2
               POS=(18,47)                                              00414**2
AABBR12  DFHMDF ATTRB=(ASKIP),                                         X00415**2
               JUSTIFY=(LEFT,BLANK),                                   X00416**2
               COLOR=BLUE,                                             X00417**2
               LENGTH=3,                                               X00418**2
               POS=(18,73)                                              00419**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00420   
*  SCREEN LINE 20                                                       00421   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00422   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00423   
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00424   
               COLOR=NEUTRAL,                                          X00425   
               LENGTH=25,                                              X00426   
               POS=(19,45)                                              00427   
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00428   
               JUSTIFY=(LEFT,BLANK),                                   X00429   
               COLOR=BLUE,                                             X00430   
               PICOUT='ZZZ,ZZ9',                                       X00431   
               LENGTH=7,                                               X00432   
               POS=(19,72)                                              00433   
         DFHMSD TYPE=FINAL                                              00434   
         END                                                            00435   
