*          DATA SET ETKM337    AT LEVEL 015 AS OF 02/09/94                      
  PRINT  NOGEN                                                          00001   
************************************************************            00002   
*  BMS MAPSET :  ETKM337 - EDI NETWORK ADD/UPDATE/DELETE                00003**6
*      MAP    :  ET337A                                                 00004   
************************************************************            00005   
ETKM337  DFHMSD TYPE=DSECT,                                            X00006   
               CTRL=(FREEKB),                                          X00007   
               TERM=3270-2,                                            X00008   
               LANG=COBOL,                                             X00009   
               MODE=INOUT,                                             X00010   
               TIOAPFX=YES,                                            X00011   
               STORAGE=AUTO                                             00012   
ET337A   DFHMDI LINE=2,                                                X00013   
               COLUMN=1,                                               X00014   
               SIZE=(19,80),                                           X00015   
               MAPATTS=(COLOR,HILIGHT),                                X00016   
               DSATTS=(COLOR,HILIGHT)                                   00017   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00018   
*  SCREEN LINE 03                                                       00019   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00020   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00021   
               INITIAL='NETWORK ID..:',                                X00022   
               COLOR=NEUTRAL,                                          X00023   
               LENGTH=13,                                              X00024   
               POS=(02,1)                                               00025   
ANTID    DFHMDF ATTRB=(UNPROT),                                        X00026   
               COLOR=GREEN,                                            X00027   
               HILIGHT=UNDERLINE,                                      X00028   
               LENGTH=1,                                               X00029   
               POS=(02,15)                                              00030   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00031**2
               INITIAL=' ',                                            X00032**2
               LENGTH=1,                                               X00033**2
               POS=(02,17)                                              00034**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00035   
*  SCREEN LINE 04                                                       00036   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00037   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00038   
               INITIAL='NETWORK NAME:',                                X00039   
               COLOR=NEUTRAL,                                          X00040   
               LENGTH=13,                                              X00041   
               POS=(03,1)                                               00042   
ANAME    DFHMDF ATTRB=(UNPROT),                                        X00043   
               COLOR=GREEN,                                            X00044   
               HILIGHT=UNDERLINE,                                      X00045   
               LENGTH=15,                                              X00046   
               POS=(03,15)                                              00047   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00048**2
               INITIAL=' ',                                            X00049**2
               LENGTH=1,                                               X00050**2
               POS=(03,31)                                              00051**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00052   
*  SCREEN LINE 06                                                       00053   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00054   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00055   
               INITIAL='TYPE...........:',                             X00056   
               COLOR=NEUTRAL,                                          X00057   
               LENGTH=16,                                              X00058   
               POS=(05,1)                                               00059   
ATYPE    DFHMDF ATTRB=(UNPROT),                                        X00060   
               COLOR=GREEN,                                            X00061   
               HILIGHT=UNDERLINE,                                      X00062   
               LENGTH=1,                                               X00063**3
               POS=(05,18)                                              00064   
ATYPDSC  DFHMDF ATTRB=(ASKIP),                                         X00065**6
               COLOR=BLUE,                                             X00066**3
               LENGTH=12,                                              X00067**3
               POS=(05,20)                                              00068**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00069   
*  SCREEN LINE 07                                                       00070   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00071   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00072   
               INITIAL='LINE SPEED.....:',                             X00073   
               COLOR=NEUTRAL,                                          X00074   
               LENGTH=16,                                              X00075   
               POS=(06,1)                                               00076   
ALSPEED  DFHMDF ATTRB=(UNPROT),                                        X00077**8
               COLOR=GREEN,                                            X00078   
               HILIGHT=UNDERLINE,                                      X00079   
               LENGTH=7,                                               X00080   
               POS=(06,18)                                              00081   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00082**2
               INITIAL=' ',                                            X00083**2
               LENGTH=1,                                               X00084**2
               POS=(06,26)                                              00085**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00086   
*  SCREEN LINE 09                                                       00087   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00088   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00089   
               INITIAL='USER ID........:',                             X00090   
               COLOR=NEUTRAL,                                          X00091   
               LENGTH=16,                                              X00092   
               POS=(08,1)                                               00093   
AUSERID  DFHMDF ATTRB=(UNPROT),                                        X00094   
               COLOR=GREEN,                                            X00095   
               HILIGHT=UNDERLINE,                                      X00096   
               LENGTH=8,                                               X00097   
               POS=(08,18)                                              00098   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00099**2
               INITIAL=' ',                                            X00100**2
               LENGTH=1,                                               X00101**2
               POS=(08,27)                                              00102**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00103   
*  SCREEN LINE 10                                                       00104   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00105   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00106   
               INITIAL='PASSWORD.......:',                             X00107   
               COLOR=NEUTRAL,                                          X00108   
               LENGTH=16,                                              X00109   
               POS=(09,1)                                               00110   
APASSWD  DFHMDF ATTRB=(UNPROT),                                        X00111   
               COLOR=GREEN,                                            X00112   
               HILIGHT=UNDERLINE,                                      X00113   
               LENGTH=8,                                               X00114   
               POS=(09,18)                                              00115   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00116**2
               INITIAL=' ',                                            X00117**2
               LENGTH=1,                                               X00118**2
               POS=(09,27)                                              00119**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00120   
*  SCREEN LINE 12                                                       00121   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00122   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00123   
               INITIAL='DIALUP PHONE #.:',                             X00124   
               COLOR=NEUTRAL,                                          X00125   
               LENGTH=16,                                              X00126   
               POS=(11,1)                                               00127   
ADIAL1   DFHMDF ATTRB=(UNPROT),                                        X00128*13
               COLOR=GREEN,                                            X00129   
               HILIGHT=UNDERLINE,                                      X00130   
               LENGTH=1,                                               X00131*13
               POS=(11,18)                                              00132   
         DFHMDF ATTRB=(ASKIP),                                         X00133*13
               INITIAL='-',                                            X00134*14
               COLOR=BLUE,                                             X00135*13
               LENGTH=1,                                               X00136*13
               POS=(11,20)                                              00137*13
ADIAL2   DFHMDF ATTRB=(UNPROT),                                        X00138*13
               COLOR=GREEN,                                            X00139*13
               HILIGHT=UNDERLINE,                                      X00140*13
               LENGTH=3,                                               X00141*13
               POS=(11,22)                                              00142*13
         DFHMDF ATTRB=(ASKIP),                                         X00143*13
               INITIAL='-',                                            X00144*14
               COLOR=BLUE,                                             X00145*13
               LENGTH=1,                                               X00146*13
               POS=(11,26)                                              00147*13
ADIAL3   DFHMDF ATTRB=(UNPROT),                                        X00148*13
               COLOR=GREEN,                                            X00149*13
               HILIGHT=UNDERLINE,                                      X00150*13
               LENGTH=3,                                               X00151*13
               POS=(11,28)                                              00152*13
         DFHMDF ATTRB=(ASKIP),                                         X00153*13
               INITIAL='-',                                            X00154*14
               COLOR=BLUE,                                             X00155*13
               LENGTH=1,                                               X00156*13
               POS=(11,32)                                              00157*13
ADIAL4   DFHMDF ATTRB=(UNPROT),                                        X00158*13
               COLOR=GREEN,                                            X00159*13
               HILIGHT=UNDERLINE,                                      X00160*13
               LENGTH=4,                                               X00161*15
               POS=(11,34)                                              00162*13
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00163**2
               INITIAL=' ',                                            X00164**2
               LENGTH=1,                                               X00165**2
               POS=(11,39)                                              00166*13
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00167   
*  SCREEN LINE 13                                                       00168   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00169   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00170   
               INITIAL='CONTACT PHONE #:',                             X00171   
               COLOR=NEUTRAL,                                          X00172   
               LENGTH=16,                                              X00173   
               POS=(12,1)                                               00174   
ACNTCT1  DFHMDF ATTRB=(UNPROT),                                        X00175*13
               COLOR=GREEN,                                            X00176   
               HILIGHT=UNDERLINE,                                      X00177   
               LENGTH=1,                                               X00178*13
               POS=(12,18)                                              00179   
         DFHMDF ATTRB=(ASKIP),                                         X00180*13
               INITIAL='-',                                            X00181*14
               COLOR=BLUE,                                             X00182*13
               LENGTH=1,                                               X00183*13
               POS=(12,20)                                              00184*13
ACNTCT2  DFHMDF ATTRB=(UNPROT),                                        X00185*13
               COLOR=GREEN,                                            X00186*13
               HILIGHT=UNDERLINE,                                      X00187*13
               LENGTH=3,                                               X00188*13
               POS=(12,22)                                              00189*13
         DFHMDF ATTRB=(ASKIP),                                         X00190*13
               INITIAL='-',                                            X00191*14
               COLOR=BLUE,                                             X00192*13
               LENGTH=1,                                               X00193*13
               POS=(12,26)                                              00194*13
ACNTCT3  DFHMDF ATTRB=(UNPROT),                                        X00195*13
               COLOR=GREEN,                                            X00196*13
               HILIGHT=UNDERLINE,                                      X00197*13
               LENGTH=3,                                               X00198*13
               POS=(12,28)                                              00199*13
         DFHMDF ATTRB=(ASKIP),                                         X00200*13
               INITIAL='-',                                            X00201*14
               COLOR=BLUE,                                             X00202*13
               LENGTH=1,                                               X00203*13
               POS=(12,32)                                              00204*13
ACNTCT4  DFHMDF ATTRB=(UNPROT),                                        X00205*13
               COLOR=GREEN,                                            X00206*13
               HILIGHT=UNDERLINE,                                      X00207*13
               LENGTH=4,                                               X00208*15
               POS=(12,34)                                              00209*13
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00210*13
               INITIAL=' ',                                            X00211*13
               LENGTH=1,                                               X00212*13
               POS=(12,39)                                              00213*13
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00214   
*  SCREEN LINE 15                                                       00215   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00216   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00217   
               INITIAL='DEFAULT INTERCHANGE ID QUALIF:',               X00218   
               COLOR=NEUTRAL,                                          X00219   
               LENGTH=30,                                              X00220   
               POS=(14,1)                                               00221   
AINTIDQ  DFHMDF ATTRB=(UNPROT),                                        X00222   
               COLOR=GREEN,                                            X00223   
               HILIGHT=UNDERLINE,                                      X00224   
               LENGTH=2,                                               X00225   
               POS=(14,32)                                              00226   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00227**2
               INITIAL=' ',                                            X00228**2
               LENGTH=1,                                               X00229**2
               POS=(14,35)                                              00230**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00231   
*  SCREEN LINE 16                                                       00232   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00233   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00234   
               INITIAL='DEFAULT INTERCHANGE ID.......:',               X00235   
               COLOR=NEUTRAL,                                          X00236   
               LENGTH=30,                                              X00237   
               POS=(15,1)                                               00238   
AINTID   DFHMDF ATTRB=(UNPROT),                                        X00239   
               COLOR=GREEN,                                            X00240   
               HILIGHT=UNDERLINE,                                      X00241   
               LENGTH=11,                                              X00242   
               POS=(15,32)                                              00243   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00244**2
               INITIAL=' ',                                            X00245**2
               LENGTH=1,                                               X00246**2
               POS=(15,44)                                              00247**2
         DFHMSD TYPE=FINAL                                              00248   
         END                                                            00249   
