*          DATA SET ETKM326    AT LEVEL 005 AS OF 08/10/94                      
  PRINT  NOGEN                                                          00001   
************************************************************            00002   
*                                                                       00003   
*  ETC26 - ETKCS326_-_REJECTED_DOC_LIST                                 00004   
*                                                                       00005   
*     GENERATED          : 07/01/94 AT 01:38:36 PM                      00006   
*     VERSION            : 2.7.01                                       00007   
*     CSD LEVEL          : 2.7.01                                       00008   
*     AUTHOR             : NEWUSER.                                     00009   
*     INSTALLATION       : KNOWLEDGEWARE, INC.                          00010   
*     ENCYCLOPEDIA       : TPENC                                        00011   
*     ENCYCLOPEDIA PATH  : C:\ADW_ENC\TPENC\                            00012   
*     MAP DETAILS                                                       00013   
*     LAST UPDATED 07/01/1994 AT 12:58:05 BY TKMA086                    00014   
*-----------------------------------------------------------            00015   
*                                                                       00016   
*  BMS MAPSET :  ETKM326                                                00017   
*      MAP    :  ET326A                                                 00018   
************************************************************            00019   
ETKM326  DFHMSD TYPE=&SYSPARM,                                         X00020   
               CTRL=(FREEKB),                                          X00021   
               TERM=3270-2,                                            X00022   
               EXTATT=YES,                                             X00023   
               LANG=COBOL,                                             X00024   
               MODE=INOUT,                                             X00025   
               TIOAPFX=YES,                                            X00026   
               STORAGE=AUTO                                             00027   
ET326A   DFHMDI LINE=2,                                                X00028**2
               COLUMN=1,                                               X00029   
               SIZE=(19,80),                                           X00030**2
               MAPATTS=(COLOR,HILIGHT),                                X00031**2
               DSATTS=(COLOR,HILIGHT)                                   00032**5
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00033   
*                                                                       00034   
*  SCREEN LINE 01                                                       00035**2
*                                                                       00036   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00037   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00038   
               POS=(01,1),                                             X00039**2
               INITIAL=' ',                                            X00040   
               LENGTH=1                                                 00041   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00042   
*                                                                       00043   
*  SCREEN LINE 02                                                       00044**2
*                                                                       00045   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
         DFHMDF ATTRB=(ASKIP),                                         X00047   
               POS=(02,1),                                             X00048**2
               INITIAL=' ',                                            X00049   
               LENGTH=1                                                 00050   
         DFHMDF ATTRB=(PROT),                                          X00051   
               INITIAL='ITEMS',                                        X00052   
               COLOR=NEUTRAL,                                          X00053   
               LENGTH=5,                                               X00054   
               POS=(02,36)                                              00055**2
         DFHMDF ATTRB=(ASKIP),                                         X00056   
               POS=(02,42),                                            X00057**2
               INITIAL=' ',                                            X00058   
               LENGTH=1                                                 00059   
****************************************                                00060   
*  VARIABLE = ITEMS      N005                                           00061   
****************************************                                00062   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00063   
               JUSTIFY=(LEFT,BLANK),                                   X00064   
               COLOR=GREEN,                                            X00065   
               HILIGHT=UNDERLINE,                                      X00066   
               PICOUT='ZZZZZ',                                         X00067   
               LENGTH=5,                                               X00068   
               POS=(02,44)                                              00069**2
         DFHMDF ATTRB=(ASKIP),                                         X00070   
               POS=(02,50),                                            X00071**2
               INITIAL=' ',                                            X00072   
               LENGTH=1                                                 00073   
         DFHMDF ATTRB=(PROT),                                          X00074   
               INITIAL='TO',                                           X00075   
               COLOR=NEUTRAL,                                          X00076   
               LENGTH=2,                                               X00077   
               POS=(02,52)                                              00078**2
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               POS=(02,55),                                            X00080**2
               INITIAL=' ',                                            X00081   
               LENGTH=1                                                 00082   
****************************************                                00083   
*  VARIABLE = TO      N005                                              00084   
****************************************                                00085   
AENDIT   DFHMDF ATTRB=(UNPROT,NUM),                                    X00086   
               JUSTIFY=(LEFT,BLANK),                                   X00087   
               COLOR=BLUE,                                             X00088   
               PICOUT='ZZZZZ',                                         X00089   
               LENGTH=5,                                               X00090   
               POS=(02,57)                                              00091**2
         DFHMDF ATTRB=(ASKIP),                                         X00092   
               POS=(02,63),                                            X00093**2
               INITIAL=' ',                                            X00094   
               LENGTH=1                                                 00095   
         DFHMDF ATTRB=(PROT),                                          X00096   
               INITIAL='OF',                                           X00097   
               COLOR=NEUTRAL,                                          X00098   
               LENGTH=2,                                               X00099   
               POS=(02,65)                                              00100**2
         DFHMDF ATTRB=(ASKIP),                                         X00101   
               POS=(02,68),                                            X00102**2
               INITIAL=' ',                                            X00103   
               LENGTH=1                                                 00104   
****************************************                                00105   
*  VARIABLE = OF      N005                                              00106   
****************************************                                00107   
ATOTIT   DFHMDF ATTRB=(UNPROT,NUM),                                    X00108   
               JUSTIFY=(LEFT,BLANK),                                   X00109   
               COLOR=BLUE,                                             X00110   
               PICOUT='ZZZZZ',                                         X00111   
               LENGTH=5,                                               X00112   
               POS=(02,70)                                              00113**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00114   
               INITIAL=' ',                                            X00115   
               LENGTH=1,                                               X00116   
               POS=(02,76)                                              00117**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00118   
*                                                                       00119   
*  SCREEN LINE 03                                                       00120**2
*                                                                       00121   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00122   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00123   
               POS=(03,1),                                             X00124**2
               INITIAL=' ',                                            X00125   
               LENGTH=1                                                 00126   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00127   
*                                                                       00128   
*  SCREEN LINE 04                                                       00129**2
*                                                                       00130   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00131   
         DFHMDF ATTRB=(PROT),                                          X00132   
               INITIAL='VENDOR',                                       X00133   
               COLOR=NEUTRAL,                                          X00134   
               LENGTH=6,                                               X00135   
               POS=(04,2)                                               00136**3
         DFHMDF ATTRB=(PROT),                                          X00137   
               INITIAL='NAME........:',                                X00138   
               COLOR=NEUTRAL,                                          X00139   
               LENGTH=13,                                              X00140   
               POS=(04,9)                                               00141**3
         DFHMDF ATTRB=(ASKIP),                                         X00142   
               POS=(04,23),                                            X00143**3
               INITIAL=' ',                                            X00144   
               LENGTH=1                                                 00145   
****************************************                                00146   
*  VARIABLE = VENDOR-NAME      X030                                     00147   
****************************************                                00148   
AVENDNM  DFHMDF ATTRB=(PROT),                                          X00149   
               COLOR=BLUE,                                             X00150   
               LENGTH=30,                                              X00151   
               POS=(04,25)                                              00152**3
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00153   
               INITIAL=' ',                                            X00154   
               LENGTH=1,                                               X00155   
               POS=(04,56)                                              00156**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00157   
*                                                                       00158   
*  SCREEN LINE 05                                                       00159**2
*                                                                       00160   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00161   
         DFHMDF ATTRB=(PROT),                                          X00162   
               INITIAL='INT.',                                         X00163   
               COLOR=NEUTRAL,                                          X00164   
               LENGTH=4,                                               X00165   
               POS=(05,2)                                               00166**3
         DFHMDF ATTRB=(PROT),                                          X00167   
               INITIAL='CONTROL',                                      X00168   
               COLOR=NEUTRAL,                                          X00169   
               LENGTH=7,                                               X00170   
               POS=(05,7)                                               00171**3
         DFHMDF ATTRB=(PROT),                                          X00172   
               INITIAL='NUMBER:',                                      X00173   
               COLOR=NEUTRAL,                                          X00174   
               LENGTH=7,                                               X00175   
               POS=(05,15)                                              00176**3
         DFHMDF ATTRB=(ASKIP),                                         X00177   
               POS=(05,23),                                            X00178**3
               INITIAL=' ',                                            X00179   
               LENGTH=1                                                 00180   
****************************************                                00181   
*  VARIABLE = INTERCHANGE-CONTROL      N009                             00182   
****************************************                                00183   
AINTCTL  DFHMDF ATTRB=(PROT),                                          X00184**2
               JUSTIFY=(LEFT,BLANK),                                   X00185   
               COLOR=BLUE,                                             X00186   
               PICOUT='ZZZZZZZZZ',                                     X00187   
               LENGTH=9,                                               X00188   
               POS=(05,25)                                              00189**3
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00190   
               INITIAL=' ',                                            X00191   
               LENGTH=1,                                               X00192   
               POS=(05,35)                                              00193**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00194   
*                                                                       00195   
*  SCREEN LINE 06                                                       00196**2
*                                                                       00197   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00198   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00199   
               POS=(06,1),                                             X00200**2
               INITIAL=' ',                                            X00201   
               LENGTH=1                                                 00202   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00203   
*                                                                       00204   
*  SCREEN LINE 07                                                       00205**2
*                                                                       00206   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00207   
         DFHMDF ATTRB=(PROT),                                          X00208   
               INITIAL='ERROR',                                        X00209   
               COLOR=NEUTRAL,                                          X00210   
               LENGTH=5,                                               X00211   
               POS=(07,2)                                               00212**3
         DFHMDF ATTRB=(PROT),                                          X00213   
               INITIAL='MESSAGE(S)',                                   X00214   
               COLOR=NEUTRAL,                                          X00215   
               LENGTH=10,                                              X00216   
               POS=(07,8)                                               00217**3
         DFHMDF ATTRB=(ASKIP),                                         X00218   
               POS=(07,19),                                            X00219**4
               INITIAL=' ',                                            X00220   
               LENGTH=1                                                 00221   
         DFHMDF ATTRB=(PROT),                                          X00222   
               INITIAL='SEG',                                          X00223   
               COLOR=NEUTRAL,                                          X00224   
               LENGTH=3,                                               X00225   
               POS=(07,58)                                              00226**2
         DFHMDF ATTRB=(PROT),                                          X00227   
               INITIAL='ID.',                                          X00228   
               COLOR=NEUTRAL,                                          X00229   
               LENGTH=3,                                               X00230   
               POS=(07,62)                                              00231**2
         DFHMDF ATTRB=(PROT),                                          X00232   
               INITIAL='SEQUENCE',                                     X00233   
               COLOR=NEUTRAL,                                          X00234   
               LENGTH=8,                                               X00235   
               POS=(07,67)                                              00236**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00237   
*                                                                       00238   
*  SCREEN LINE 08                                                       00239**2
*                                                                       00240   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00241   
****************************************                                00242   
*  VARIABLE = ERROR-MESSAGE      X054                                   00243   
****************************************                                00244   
AERR01   DFHMDF ATTRB=(PROT),                                          X00245**2
               COLOR=BLUE,                                             X00246   
               LENGTH=54,                                              X00247   
               POS=(08,2)                                               00248**2
         DFHMDF ATTRB=(ASKIP),                                         X00249   
               POS=(08,57),                                            X00250**2
               INITIAL=' ',                                            X00251   
               LENGTH=1                                                 00252   
****************************************                                00253   
*  VARIABLE = SEGMENT-ID      X003                                      00254   
****************************************                                00255   
ASEG01 DFHMDF ATTRB=(PROT),                                            X00256**2
               COLOR=BLUE,                                             X00257   
               LENGTH=3,                                               X00258   
               POS=(08,59)                                              00259**2
         DFHMDF ATTRB=(ASKIP),                                         X00260   
               POS=(08,63),                                            X00261**2
               INITIAL=' ',                                            X00262   
               LENGTH=1                                                 00263   
****************************************                                00264   
*  VARIABLE = SEGMENT-SEQUENCE-NU      N005                             00265   
****************************************                                00266   
ASEQ01   DFHMDF ATTRB=(PROT),                                          X00267**2
               JUSTIFY=(LEFT,BLANK),                                   X00268   
               COLOR=BLUE,                                             X00269   
               PICOUT='ZZZZZ',                                         X00270   
               LENGTH=5,                                               X00271   
               POS=(08,69)                                              00272**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00273   
               INITIAL=' ',                                            X00274   
               LENGTH=1,                                               X00275   
               POS=(08,75)                                              00276**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00277   
*                                                                       00278   
*  SCREEN LINE 09                                                       00279**2
*                                                                       00280   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00281   
****************************************                                00282   
*  VARIABLE = ERROR-MESSAGE      X054                                   00283   
****************************************                                00284   
AERR02   DFHMDF ATTRB=(PROT),                                          X00285**2
               COLOR=BLUE,                                             X00286   
               LENGTH=54,                                              X00287   
               POS=(09,2)                                               00288**2
         DFHMDF ATTRB=(ASKIP),                                         X00289   
               POS=(09,57),                                            X00290**2
               INITIAL=' ',                                            X00291   
               LENGTH=1                                                 00292   
****************************************                                00293   
*  VARIABLE = SEGMENT-ID      X003                                      00294   
****************************************                                00295   
ASEG02 DFHMDF ATTRB=(PROT),                                            X00296**2
               COLOR=BLUE,                                             X00297   
               LENGTH=3,                                               X00298   
               POS=(09,59)                                              00299**2
         DFHMDF ATTRB=(ASKIP),                                         X00300   
               POS=(09,63),                                            X00301**2
               INITIAL=' ',                                            X00302   
               LENGTH=1                                                 00303   
****************************************                                00304   
*  VARIABLE = SEGMENT-SEQUENCE-NU      N005                             00305   
****************************************                                00306   
ASEQ02   DFHMDF ATTRB=(PROT),                                          X00307**2
               JUSTIFY=(LEFT,BLANK),                                   X00308   
               COLOR=BLUE,                                             X00309   
               PICOUT='ZZZZZ',                                         X00310   
               LENGTH=5,                                               X00311   
               POS=(09,69)                                              00312**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00313   
               INITIAL=' ',                                            X00314   
               LENGTH=1,                                               X00315   
               POS=(09,75)                                              00316**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00317   
*                                                                       00318   
*  SCREEN LINE 10                                                       00319**2
*                                                                       00320   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00321   
****************************************                                00322   
*  VARIABLE = ERROR-MESSAGE      X054                                   00323   
****************************************                                00324   
AERR03   DFHMDF ATTRB=(PROT),                                          X00325**2
               COLOR=BLUE,                                             X00326   
               LENGTH=54,                                              X00327   
               POS=(10,2)                                               00328**2
         DFHMDF ATTRB=(ASKIP),                                         X00329   
               POS=(10,57),                                            X00330**2
               INITIAL=' ',                                            X00331   
               LENGTH=1                                                 00332   
****************************************                                00333   
*  VARIABLE = SEGMENT-ID      X003                                      00334   
****************************************                                00335   
ASEG03 DFHMDF ATTRB=(PROT),                                            X00336**2
               COLOR=BLUE,                                             X00337   
               LENGTH=3,                                               X00338   
               POS=(10,59)                                              00339**2
         DFHMDF ATTRB=(ASKIP),                                         X00340   
               POS=(10,63),                                            X00341**2
               INITIAL=' ',                                            X00342   
               LENGTH=1                                                 00343   
****************************************                                00344   
*  VARIABLE = SEGMENT-SEQUENCE-NU      N005                             00345   
****************************************                                00346   
ASEQ03   DFHMDF ATTRB=(PROT),                                          X00347**2
               JUSTIFY=(LEFT,BLANK),                                   X00348   
               COLOR=BLUE,                                             X00349   
               PICOUT='ZZZZZ',                                         X00350   
               LENGTH=5,                                               X00351   
               POS=(10,69)                                              00352**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00353   
               INITIAL=' ',                                            X00354   
               LENGTH=1,                                               X00355   
               POS=(10,75)                                              00356**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00357   
*                                                                       00358   
*  SCREEN LINE 11                                                       00359**2
*                                                                       00360   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00361   
****************************************                                00362   
*  VARIABLE = ERROR-MESSAGE      X054                                   00363   
****************************************                                00364   
AERR04   DFHMDF ATTRB=(PROT),                                          X00365**2
               COLOR=BLUE,                                             X00366   
               LENGTH=54,                                              X00367   
               POS=(11,2)                                               00368**2
         DFHMDF ATTRB=(ASKIP),                                         X00369   
               POS=(11,57),                                            X00370**2
               INITIAL=' ',                                            X00371   
               LENGTH=1                                                 00372   
****************************************                                00373   
*  VARIABLE = SEGMENT-ID      X003                                      00374   
****************************************                                00375   
ASEG04 DFHMDF ATTRB=(PROT),                                            X00376**2
               COLOR=BLUE,                                             X00377   
               LENGTH=3,                                               X00378   
               POS=(11,59)                                              00379**2
         DFHMDF ATTRB=(ASKIP),                                         X00380   
               POS=(11,63),                                            X00381**2
               INITIAL=' ',                                            X00382   
               LENGTH=1                                                 00383   
****************************************                                00384   
*  VARIABLE = SEGMENT-SEQUENCE-NU      N005                             00385   
****************************************                                00386   
ASEQ04   DFHMDF ATTRB=(PROT),                                          X00387**2
               JUSTIFY=(LEFT,BLANK),                                   X00388   
               COLOR=BLUE,                                             X00389   
               PICOUT='ZZZZZ',                                         X00390   
               LENGTH=5,                                               X00391   
               POS=(11,69)                                              00392**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00393   
               INITIAL=' ',                                            X00394   
               LENGTH=1,                                               X00395   
               POS=(11,75)                                              00396**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00397   
*                                                                       00398   
*  SCREEN LINE 12                                                       00399**2
*                                                                       00400   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00401   
****************************************                                00402   
*  VARIABLE = ERROR-MESSAGE      X054                                   00403   
****************************************                                00404   
AERR05   DFHMDF ATTRB=(PROT),                                          X00405**2
               COLOR=BLUE,                                             X00406   
               LENGTH=54,                                              X00407   
               POS=(12,2)                                               00408**2
         DFHMDF ATTRB=(ASKIP),                                         X00409   
               POS=(12,57),                                            X00410**2
               INITIAL=' ',                                            X00411   
               LENGTH=1                                                 00412   
****************************************                                00413   
*  VARIABLE = SEGMENT-ID      X003                                      00414   
****************************************                                00415   
ASEG05 DFHMDF ATTRB=(PROT),                                            X00416**2
               COLOR=BLUE,                                             X00417   
               LENGTH=3,                                               X00418   
               POS=(12,59)                                              00419**2
         DFHMDF ATTRB=(ASKIP),                                         X00420   
               POS=(12,63),                                            X00421**2
               INITIAL=' ',                                            X00422   
               LENGTH=1                                                 00423   
****************************************                                00424   
*  VARIABLE = SEGMENT-SEQUENCE-NU      N005                             00425   
****************************************                                00426   
ASEQ05   DFHMDF ATTRB=(PROT),                                          X00427**2
               JUSTIFY=(LEFT,BLANK),                                   X00428   
               COLOR=BLUE,                                             X00429   
               PICOUT='ZZZZZ',                                         X00430   
               LENGTH=5,                                               X00431   
               POS=(12,69)                                              00432**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00433   
               INITIAL=' ',                                            X00434   
               LENGTH=1,                                               X00435   
               POS=(12,75)                                              00436**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00437   
*                                                                       00438   
*  SCREEN LINE 13                                                       00439**2
*                                                                       00440   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00441   
****************************************                                00442   
*  VARIABLE = ERROR-MESSAGE      X054                                   00443   
****************************************                                00444   
AERR06   DFHMDF ATTRB=(PROT),                                          X00445**2
               COLOR=BLUE,                                             X00446   
               LENGTH=54,                                              X00447   
               POS=(13,2)                                               00448**2
         DFHMDF ATTRB=(ASKIP),                                         X00449   
               POS=(13,57),                                            X00450**2
               INITIAL=' ',                                            X00451   
               LENGTH=1                                                 00452   
****************************************                                00453   
*  VARIABLE = SEGMENT-ID      X003                                      00454   
****************************************                                00455   
ASEG06 DFHMDF ATTRB=(PROT),                                            X00456**2
               COLOR=BLUE,                                             X00457   
               LENGTH=3,                                               X00458   
               POS=(13,59)                                              00459**2
         DFHMDF ATTRB=(ASKIP),                                         X00460   
               POS=(13,63),                                            X00461**2
               INITIAL=' ',                                            X00462   
               LENGTH=1                                                 00463   
****************************************                                00464   
*  VARIABLE = SEGMENT-SEQUENCE-NU      N005                             00465   
****************************************                                00466   
ASEQ06   DFHMDF ATTRB=(PROT),                                          X00467**2
               JUSTIFY=(LEFT,BLANK),                                   X00468   
               COLOR=BLUE,                                             X00469   
               PICOUT='ZZZZZ',                                         X00470   
               LENGTH=5,                                               X00471   
               POS=(13,69)                                              00472**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00473   
               INITIAL=' ',                                            X00474   
               LENGTH=1,                                               X00475   
               POS=(13,75)                                              00476**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00477   
*                                                                       00478   
*  SCREEN LINE 14                                                       00479**2
*                                                                       00480   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00481   
****************************************                                00482   
*  VARIABLE = ERROR-MESSAGE      X054                                   00483   
****************************************                                00484   
AERR07   DFHMDF ATTRB=(PROT),                                          X00485**2
               COLOR=BLUE,                                             X00486   
               LENGTH=54,                                              X00487   
               POS=(14,2)                                               00488**2
         DFHMDF ATTRB=(ASKIP),                                         X00489   
               POS=(14,57),                                            X00490**2
               INITIAL=' ',                                            X00491   
               LENGTH=1                                                 00492   
****************************************                                00493   
*  VARIABLE = SEGMENT-ID      X003                                      00494   
****************************************                                00495   
ASEG07 DFHMDF ATTRB=(PROT),                                            X00496**2
               COLOR=BLUE,                                             X00497   
               LENGTH=3,                                               X00498   
               POS=(14,59)                                              00499**2
         DFHMDF ATTRB=(ASKIP),                                         X00500   
               POS=(14,63),                                            X00501**2
               INITIAL=' ',                                            X00502   
               LENGTH=1                                                 00503   
****************************************                                00504   
*  VARIABLE = SEGMENT-SEQUENCE-NU      N005                             00505   
****************************************                                00506   
ASEQ07   DFHMDF ATTRB=(PROT),                                          X00507**2
               JUSTIFY=(LEFT,BLANK),                                   X00508   
               COLOR=BLUE,                                             X00509   
               PICOUT='ZZZZZ',                                         X00510   
               LENGTH=5,                                               X00511   
               POS=(14,69)                                              00512**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00513   
               INITIAL=' ',                                            X00514   
               LENGTH=1,                                               X00515   
               POS=(14,75)                                              00516**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00517   
*                                                                       00518   
*  SCREEN LINE 15                                                       00519**2
*                                                                       00520   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00521   
****************************************                                00522   
*  VARIABLE = ERROR-MESSAGE      X054                                   00523   
****************************************                                00524   
AERR08   DFHMDF ATTRB=(PROT),                                          X00525**2
               COLOR=BLUE,                                             X00526   
               LENGTH=54,                                              X00527   
               POS=(15,2)                                               00528**2
         DFHMDF ATTRB=(ASKIP),                                         X00529   
               POS=(15,57),                                            X00530**2
               INITIAL=' ',                                            X00531   
               LENGTH=1                                                 00532   
****************************************                                00533   
*  VARIABLE = SEGMENT-ID      X003                                      00534   
****************************************                                00535   
ASEG08 DFHMDF ATTRB=(PROT),                                            X00536**2
               COLOR=BLUE,                                             X00537   
               LENGTH=3,                                               X00538   
               POS=(15,59)                                              00539**2
         DFHMDF ATTRB=(ASKIP),                                         X00540   
               POS=(15,63),                                            X00541**2
               INITIAL=' ',                                            X00542   
               LENGTH=1                                                 00543   
****************************************                                00544   
*  VARIABLE = SEGMENT-SEQUENCE-NU      N005                             00545   
****************************************                                00546   
ASEQ08   DFHMDF ATTRB=(PROT),                                          X00547**2
               JUSTIFY=(LEFT,BLANK),                                   X00548   
               COLOR=BLUE,                                             X00549   
               PICOUT='ZZZZZ',                                         X00550   
               LENGTH=5,                                               X00551   
               POS=(15,69)                                              00552**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00553   
               INITIAL=' ',                                            X00554   
               LENGTH=1,                                               X00555   
               POS=(15,75)                                              00556**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00557   
*                                                                       00558   
*  SCREEN LINE 16                                                       00559**2
*                                                                       00560   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00561   
****************************************                                00562   
*  VARIABLE = ERROR-MESSAGE      X054                                   00563   
****************************************                                00564   
AERR09   DFHMDF ATTRB=(PROT),                                          X00565**2
               COLOR=BLUE,                                             X00566   
               LENGTH=54,                                              X00567   
               POS=(16,2)                                               00568**2
         DFHMDF ATTRB=(ASKIP),                                         X00569   
               POS=(16,57),                                            X00570**2
               INITIAL=' ',                                            X00571   
               LENGTH=1                                                 00572   
****************************************                                00573   
*  VARIABLE = SEGMENT-ID      X003                                      00574   
****************************************                                00575   
ASEG09 DFHMDF ATTRB=(PROT),                                            X00576**2
               COLOR=BLUE,                                             X00577   
               LENGTH=3,                                               X00578   
               POS=(16,59)                                              00579**2
         DFHMDF ATTRB=(ASKIP),                                         X00580   
               POS=(16,63),                                            X00581**2
               INITIAL=' ',                                            X00582   
               LENGTH=1                                                 00583   
****************************************                                00584   
*  VARIABLE = SEGMENT-SEQUENCE-NU      N005                             00585   
****************************************                                00586   
ASEQ09   DFHMDF ATTRB=(PROT),                                          X00587**2
               JUSTIFY=(LEFT,BLANK),                                   X00588   
               COLOR=BLUE,                                             X00589   
               PICOUT='ZZZZZ',                                         X00590   
               LENGTH=5,                                               X00591   
               POS=(16,69)                                              00592**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00593   
               INITIAL=' ',                                            X00594   
               LENGTH=1,                                               X00595   
               POS=(16,75)                                              00596**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00597   
*                                                                       00598   
*  SCREEN LINE 17                                                       00599**2
*                                                                       00600   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00601   
****************************************                                00602   
*  VARIABLE = ERROR-MESSAGE      X054                                   00603   
****************************************                                00604   
AERR10   DFHMDF ATTRB=(PROT),                                          X00605**2
               COLOR=BLUE,                                             X00606   
               LENGTH=54,                                              X00607   
               POS=(17,2)                                               00608**2
         DFHMDF ATTRB=(ASKIP),                                         X00609   
               POS=(17,57),                                            X00610**2
               INITIAL=' ',                                            X00611   
               LENGTH=1                                                 00612   
****************************************                                00613   
*  VARIABLE = SEGMENT-ID      X003                                      00614   
****************************************                                00615   
ASEG10 DFHMDF ATTRB=(PROT),                                            X00616**2
               COLOR=BLUE,                                             X00617   
               LENGTH=3,                                               X00618   
               POS=(17,59)                                              00619**2
         DFHMDF ATTRB=(ASKIP),                                         X00620   
               POS=(17,63),                                            X00621**2
               INITIAL=' ',                                            X00622   
               LENGTH=1                                                 00623   
****************************************                                00624   
*  VARIABLE = SEGMENT-SEQUENCE-NU      N005                             00625   
****************************************                                00626   
ASEQ10   DFHMDF ATTRB=(PROT),                                          X00627**2
               JUSTIFY=(LEFT,BLANK),                                   X00628   
               COLOR=BLUE,                                             X00629   
               PICOUT='ZZZZZ',                                         X00630   
               LENGTH=5,                                               X00631   
               POS=(17,69)                                              00632**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00633   
               INITIAL=' ',                                            X00634   
               LENGTH=1,                                               X00635   
               POS=(17,75)                                              00636**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00637   
*                                                                       00638   
*  SCREEN LINE 18                                                       00639**2
*                                                                       00640   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00641   
****************************************                                00642   
*  VARIABLE = ERROR-MESSAGE      X054                                   00643   
****************************************                                00644   
AERR11   DFHMDF ATTRB=(PROT),                                          X00645**2
               COLOR=BLUE,                                             X00646   
               LENGTH=54,                                              X00647   
               POS=(18,2)                                               00648**2
         DFHMDF ATTRB=(ASKIP),                                         X00649   
               POS=(18,57),                                            X00650**2
               INITIAL=' ',                                            X00651   
               LENGTH=1                                                 00652   
****************************************                                00653   
*  VARIABLE = SEGMENT-ID      X003                                      00654   
****************************************                                00655   
ASEG11 DFHMDF ATTRB=(PROT),                                            X00656**2
               COLOR=BLUE,                                             X00657   
               LENGTH=3,                                               X00658   
               POS=(18,59)                                              00659**2
         DFHMDF ATTRB=(ASKIP),                                         X00660   
               POS=(18,63),                                            X00661**2
               INITIAL=' ',                                            X00662   
               LENGTH=1                                                 00663   
****************************************                                00664   
*  VARIABLE = SEGMENT-SEQUENCE-NU      N005                             00665   
****************************************                                00666   
ASEQ11   DFHMDF ATTRB=(PROT),                                          X00667**2
               JUSTIFY=(LEFT,BLANK),                                   X00668   
               COLOR=BLUE,                                             X00669   
               PICOUT='ZZZZZ',                                         X00670   
               LENGTH=5,                                               X00671   
               POS=(18,69)                                              00672**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00673   
               INITIAL=' ',                                            X00674   
               LENGTH=1,                                               X00675   
               POS=(18,75)                                              00676**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00677   
*                                                                       00678   
*  SCREEN LINE 19                                                       00679**2
*                                                                       00680   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00681   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00682   
               POS=(19,1),                                             X00683**2
               INITIAL=' ',                                            X00684   
               LENGTH=1                                                 00685   
         DFHMSD TYPE=FINAL                                              00686   
         END                                                            00687   
