  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  ETKM351                                            *   00005   
*        MAP     ET351A                                             *   00006   
*        PROGRAM ETKCS351 (SIZE MAINTENANCE CRITERIA)               *   00007   
*        TRANSID E351                                               *   00008   
*        SYSTEM  CICS ARCHITECTURE                                  *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
ETKM351 DFHMSD TYPE=MAP,                                               C00006   
               MODE=INOUT,                                             C00010   
               LANG=COBOL,                                             C00009   
               TIOAPFX=YES,                                            C00011   
               CTRL=(FREEKB)                                            00007   
ET351A  DFHMDI LINE=2,                                                 C00013   
               COLUMN=1,                                               C00014   
               SIZE=(19,80),                                           C00015   
               MAPATTS=(COLOR,HILIGHT),                                C00016   
               DSATTS=(COLOR,HILIGHT)                                   00017   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00018   
*  SCREEN LINE 03                                                       00019   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      C00021   
               INITIAL='ENTER SIZE GROUP NUMBER AND OTHER SIZE INFORMATC00022   
               ION BEFORE SELECTING',                                  C00022   
               COLOR=YELLOW,                                           C00023   
               LENGTH=67,                                              C00024   
               POS=(02,06)                                              00025   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00018   
*  SCREEN LINE 04                                                       00019   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      C00021   
               INITIAL='THE FUNCTION.  ONLY THE SIZE GROUP NUMBER IS NEC00022   
               CESSARY FOR A SIZE LIST.',                              C00022   
               COLOR=YELLOW,                                           C00023   
               LENGTH=71,                                              C00024   
               POS=(03,06)                                              00025   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00018   
*  SCREEN LINE 06                                                       00019   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      C00021   
               INITIAL='SIZE GROUP...........:',                       C00022   
               COLOR=NEUTRAL,                                          C00023   
               LENGTH=22,                                              C00024   
               POS=(05,06)                                              00025   
ASZGPCD DFHMDF ATTRB=(UNPROT,NORM),                                    C00026   
               COLOR=GREEN,                                            C00027   
               HILIGHT=UNDERLINE,                                      C00028   
               LENGTH=2,                                               C00029   
               POS=(05,29)                                              00030   
ASZGPDS DFHMDF ATTRB=(ASKIP,NORM),                                     C00032   
               COLOR=BLUE,                                             C00035   
               LENGTH=30,                                              C00033   
               POS=(05,32)                                              00032   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00035   
*  SCREEN LINE 08                                                       00036   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00037   
        DFHMDF ATTRB=(ASKIP,BRT),                                      C00038   
               INITIAL='NRF SIZE CODE........:',                       C00039   
               COLOR=NEUTRAL,                                          C00040   
               LENGTH=22,                                              C00041   
               POS=(07,06)                                              00042   
ANRFCD  DFHMDF ATTRB=(UNPROT,NORM),                                    C00043   
               COLOR=GREEN,                                            C00044   
               HILIGHT=UNDERLINE,                                      C00045   
               LENGTH=5,                                               C00046   
               POS=(07,29)                                              00047   
        DFHMDF ATTRB=(ASKIP,DRK),                                      C00048**2
               INITIAL=' ',                                            C00049**2
               LENGTH=1,                                               C00050**2
               POS=(07,35)                                              00051**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00052   
*  SCREEN LINE 10                                                       00053   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00054   
        DFHMDF ATTRB=(ASKIP,BRT),                                      C00055   
               INITIAL='KOHLS DESCRIPTION....:',                       C00056   
               COLOR=NEUTRAL,                                          C00057   
               LENGTH=22,                                              C00058   
               POS=(09,6)                                               00059   
AKDESC  DFHMDF ATTRB=(UNPROT,NORM),                                    C00060   
               COLOR=GREEN,                                            C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=10,                                              C00063**3
               POS=(09,29)                                              00064   
        DFHMDF ATTRB=(ASKIP,DRK),                                      C00048**2
               INITIAL=' ',                                            C00049**2
               LENGTH=1,                                               C00050**2
               POS=(09,40)                                              00051**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00069   
*  SCREEN LINE 12                                                       00070   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00071   
        DFHMDF ATTRB=(ASKIP,BRT),                                      C00072   
               INITIAL='INCLUDE EXPIRED SIZES:',                       C00073   
               COLOR=NEUTRAL,                                          C00074   
               LENGTH=22,                                              C00075   
               POS=(11,6)                                               00076   
AEXPIND DFHMDF ATTRB=(UNPROT,NORM),                                    C00077**8
               COLOR=GREEN,                                            C00078   
               HILIGHT=UNDERLINE,                                      C00079   
               LENGTH=1,                                               C00080   
               POS=(11,29)                                              00081   
        DFHMDF ATTRB=(ASKIP,DRK),                                      C00082**2
               INITIAL=' ',                                            C00083**2
               LENGTH=1,                                               C00084**2
               POS=(11,31)                                              00085**2
**************                                                                  
        DFHMSD TYPE=FINAL                                               00248   
**************                                                                  
        END                                                             00249   
