*          DATA SET ETKM301    AT LEVEL 008 AS OF 03/07/94                      
  PRINT  NOGEN                                                          00001**2
************************************************************            00002**2
*                                                                       00003**2
*  ETCVL - ETKM301_-_VENDOR_LIST                                        00004**2
*                                                                       00005**2
*     GENERATED          : 01/25/94 AT 04:47:47 PM                      00006**3
*     VERSION            : 2.7.01                                       00007**2
*     CSD LEVEL          : 2.7.01                                       00008**2
*     AUTHOR             : JOANN SCHMIDT.                               00009**2
*     INSTALLATION       : KOHLS DEPARTMENT STORES.                     00010**2
*     ENCYCLOPEDIA       : NEW EDI SYSTEM                               00011**2
*     ENCYCLOPEDIA PATH  : C:\ADW_ENC\NWEDI\                            00012**2
*     MAP DETAILS                                                       00013**2
*     LAST UPDATED 12/07/1993 AT 16:10:00 BY TKMA088                    00014**3
*-----------------------------------------------------------            00015**2
*                                                                       00016**2
*  BMS MAPSET :  ETKM301                                                00017**2
*      MAP    :  ET301A                                                 00018**2
************************************************************            00019**2
ETKM301  DFHMSD TYPE=DSECT,                                            X00020**2
               CTRL=(FREEKB),                                          X00021**2
               TERM=3270-2,                                            X00022**2
               LANG=COBOL,                                             X00023**2
               MODE=INOUT,                                             X00024**2
               TIOAPFX=YES,                                            X00025**2
               STORAGE=AUTO                                             00026**2
ET301A   DFHMDI LINE=2,                                                X00027**2
               COLUMN=1,                                               X00028**2
               SIZE=(19,80),                                           X00029**2
               MAPATTS=(COLOR,HILIGHT),                                X00030**2
               DSATTS=(COLOR,HILIGHT)                                   00031**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00032**2
               POS=(01,1),                                             X00033**2
               INITIAL=' ',                                            X00034**2
               LENGTH=1                                                 00035**2
         DFHMDF ATTRB=(ASKIP),                                         X00036**2
               POS=(02,1),                                             X00037**2
               INITIAL=' ',                                            X00038**2
               LENGTH=1                                                 00039**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00040**8
               INITIAL='ITEMS',                                        X00041**8
               COLOR=NEUTRAL,                                          X00042**8
               LENGTH=5,                                               X00043**8
               POS=(02,44)                                              00044**8
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00045**8
               JUSTIFY=(LEFT,BLANK),                                   X00046**8
               COLOR=GREEN,                                            X00047**8
               HILIGHT=UNDERLINE,                                      X00048**8
               PICOUT='ZZZ,ZZ9',                                       X00049**8
               LENGTH=7,                                               X00050**8
               POS=(02,50)                                              00051**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00052**8
               INITIAL='TO',                                           X00053**8
               COLOR=NEUTRAL,                                          X00054**8
               LENGTH=2,                                               X00055**8
               POS=(02,58)                                              00056**8
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00057**8
               JUSTIFY=(LEFT,BLANK),                                   X00058**8
               COLOR=BLUE,                                             X00059**8
               PICOUT='ZZZ,ZZ9',                                       X00060**8
               LENGTH=7,                                               X00061**8
               POS=(02,61)                                              00062**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00063**8
               INITIAL='OF',                                           X00064**8
               COLOR=NEUTRAL,                                          X00065**8
               LENGTH=2,                                               X00066**8
               POS=(02,69)                                              00067**8
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00068**8
               JUSTIFY=(LEFT,BLANK),                                   X00069**8
               COLOR=BLUE,                                             X00070**8
               PICOUT='ZZZ,ZZ9',                                       X00071**8
               LENGTH=7,                                               X00072**8
               POS=(02,72)                                              00073**8
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00074**2
               POS=(03,1),                                             X00075**2
               INITIAL=' ',                                            X00076**2
               LENGTH=1                                                 00077**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00078**2
               INITIAL='SEL',                                          X00079**2
               COLOR=NEUTRAL,                                          X00080**2
               LENGTH=3,                                               X00081**2
               POS=(04,1)                                               00082**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00083**2
               INITIAL='ACT',                                          X00084**2
               COLOR=NEUTRAL,                                          X00085**2
               LENGTH=3,                                               X00086**2
               POS=(04,5)                                               00087**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00088**2
               INITIAL='VENDOR',                                       X00089**2
               COLOR=NEUTRAL,                                          X00090**2
               LENGTH=6,                                               X00091**2
               POS=(04,10)                                              00092**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00093**2
               INITIAL='NAME',                                         X00094**2
               COLOR=NEUTRAL,                                          X00095**2
               LENGTH=4,                                               X00096**2
               POS=(04,17)                                              00097**2
ASEL01   DFHMDF ATTRB=(UNPROT,NORM,IC),                                X00098**4
               COLOR=GREEN,                                            X00099**2
               HILIGHT=UNDERLINE,                                      X00100**2
               LENGTH=1,                                               X00101**2
               POS=(05,2)                                               00102**2
         DFHMDF ATTRB=(ASKIP),                                         X00103**4
               POS=(05,4),                                             X00104**5
               LENGTH=001                                               00105**4
AACT01   DFHMDF ATTRB=(ASKIP),                                         X00106**2
               JUSTIFY=(LEFT,BLANK),                                   X00107**4
               COLOR=BLUE,                                             X00108**4
               LENGTH=3,                                               X00109**2
               POS=(05,5)                                               00110**2
         DFHMDF ATTRB=(ASKIP),                                         X00111**2
               POS=(05,9),                                             X00112**2
               INITIAL=' ',                                            X00113**2
               LENGTH=1                                                 00114**2
AVNDR01  DFHMDF ATTRB=(ASKIP),                                         X00115**2
               JUSTIFY=(LEFT,BLANK),                                   X00116**4
               COLOR=BLUE,                                             X00117**4
               LENGTH=30,                                              X00118**3
               POS=(05,10)                                              00119**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00120**2
               INITIAL=' ',                                            X00121**2
               LENGTH=1,                                               X00122**2
               POS=(05,41)                                              00123**3
ASEL02   DFHMDF ATTRB=(UNPROT,NORM),                                   X00124**4
               COLOR=GREEN,                                            X00125**2
               HILIGHT=UNDERLINE,                                      X00126**2
               LENGTH=1,                                               X00127**2
               POS=(06,2)                                               00128**2
         DFHMDF ATTRB=(ASKIP),                                         X00129**4
               POS=(06,4),                                             X00130**5
               LENGTH=001                                               00131**4
AACT02   DFHMDF ATTRB=(ASKIP),                                         X00132**2
               JUSTIFY=(LEFT,BLANK),                                   X00133**4
               COLOR=BLUE,                                             X00134**4
               LENGTH=3,                                               X00135**2
               POS=(06,5)                                               00136**2
         DFHMDF ATTRB=(ASKIP),                                         X00137**2
               POS=(06,9),                                             X00138**2
               INITIAL=' ',                                            X00139**2
               LENGTH=1                                                 00140**2
AVNDR02  DFHMDF ATTRB=(ASKIP),                                         X00141**2
               JUSTIFY=(LEFT,BLANK),                                   X00142**4
               COLOR=BLUE,                                             X00143**4
               LENGTH=30,                                              X00144**3
               POS=(06,10)                                              00145**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00146**2
               INITIAL=' ',                                            X00147**2
               LENGTH=1,                                               X00148**2
               POS=(06,41)                                              00149**3
ASEL03   DFHMDF ATTRB=(UNPROT,NORM),                                   X00150**4
               COLOR=GREEN,                                            X00151**2
               HILIGHT=UNDERLINE,                                      X00152**2
               LENGTH=1,                                               X00153**2
               POS=(07,2)                                               00154**2
         DFHMDF ATTRB=(ASKIP),                                         X00155**4
               POS=(07,4),                                             X00156**5
               LENGTH=001                                               00157**4
AACT03   DFHMDF ATTRB=(ASKIP),                                         X00158**2
               JUSTIFY=(LEFT,BLANK),                                   X00159**4
               COLOR=BLUE,                                             X00160**4
               LENGTH=3,                                               X00161**2
               POS=(07,5)                                               00162**2
         DFHMDF ATTRB=(ASKIP),                                         X00163**2
               POS=(07,9),                                             X00164**2
               INITIAL=' ',                                            X00165**2
               LENGTH=1                                                 00166**2
AVNDR03  DFHMDF ATTRB=(ASKIP),                                         X00167**2
               JUSTIFY=(LEFT,BLANK),                                   X00168**4
               COLOR=BLUE,                                             X00169**4
               LENGTH=30,                                              X00170**3
               POS=(07,10)                                              00171**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00172**2
               INITIAL=' ',                                            X00173**2
               LENGTH=1,                                               X00174**2
               POS=(07,41)                                              00175**3
ASEL04   DFHMDF ATTRB=(UNPROT,NORM),                                   X00176**4
               COLOR=GREEN,                                            X00177**2
               HILIGHT=UNDERLINE,                                      X00178**2
               LENGTH=1,                                               X00179**2
               POS=(08,2)                                               00180**2
         DFHMDF ATTRB=(ASKIP),                                         X00181**4
               POS=(08,4),                                             X00182**5
               LENGTH=001                                               00183**4
AACT04   DFHMDF ATTRB=(ASKIP),                                         X00184**2
               JUSTIFY=(LEFT,BLANK),                                   X00185**4
               COLOR=BLUE,                                             X00186**4
               LENGTH=3,                                               X00187**2
               POS=(08,5)                                               00188**2
         DFHMDF ATTRB=(ASKIP),                                         X00189**2
               POS=(08,9),                                             X00190**2
               INITIAL=' ',                                            X00191**2
               LENGTH=1                                                 00192**2
AVNDR04  DFHMDF ATTRB=(ASKIP),                                         X00193**2
               JUSTIFY=(LEFT,BLANK),                                   X00194**4
               COLOR=BLUE,                                             X00195**4
               LENGTH=30,                                              X00196**3
               POS=(08,10)                                              00197**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00198**2
               INITIAL=' ',                                            X00199**2
               LENGTH=1,                                               X00200**2
               POS=(08,41)                                              00201**3
ASEL05   DFHMDF ATTRB=(UNPROT,NORM),                                   X00202**4
               COLOR=GREEN,                                            X00203**2
               HILIGHT=UNDERLINE,                                      X00204**2
               LENGTH=1,                                               X00205**2
               POS=(09,2)                                               00206**2
         DFHMDF ATTRB=(ASKIP),                                         X00207**4
               POS=(09,4),                                             X00208**5
               LENGTH=001                                               00209**4
AACT05   DFHMDF ATTRB=(ASKIP),                                         X00210**2
               JUSTIFY=(LEFT,BLANK),                                   X00211**4
               COLOR=BLUE,                                             X00212**4
               LENGTH=3,                                               X00213**2
               POS=(09,5)                                               00214**2
         DFHMDF ATTRB=(ASKIP),                                         X00215**2
               POS=(09,9),                                             X00216**2
               INITIAL=' ',                                            X00217**2
               LENGTH=1                                                 00218**2
AVNDR05  DFHMDF ATTRB=(ASKIP),                                         X00219**2
               JUSTIFY=(LEFT,BLANK),                                   X00220**4
               COLOR=BLUE,                                             X00221**4
               LENGTH=30,                                              X00222**3
               POS=(09,10)                                              00223**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00224**2
               INITIAL=' ',                                            X00225**2
               LENGTH=1,                                               X00226**2
               POS=(09,41)                                              00227**3
ASEL06   DFHMDF ATTRB=(UNPROT,NORM),                                   X00228**4
               COLOR=GREEN,                                            X00229**2
               HILIGHT=UNDERLINE,                                      X00230**2
               LENGTH=1,                                               X00231**2
               POS=(10,2)                                               00232**2
         DFHMDF ATTRB=(ASKIP),                                         X00233**4
               POS=(10,4),                                             X00234**5
               LENGTH=001                                               00235**4
AACT06   DFHMDF ATTRB=(ASKIP),                                         X00236**2
               JUSTIFY=(LEFT,BLANK),                                   X00237**4
               COLOR=BLUE,                                             X00238**4
               LENGTH=3,                                               X00239**2
               POS=(10,5)                                               00240**2
         DFHMDF ATTRB=(ASKIP),                                         X00241**2
               POS=(10,9),                                             X00242**2
               INITIAL=' ',                                            X00243**2
               LENGTH=1                                                 00244**2
AVNDR06  DFHMDF ATTRB=(ASKIP),                                         X00245**2
               JUSTIFY=(LEFT,BLANK),                                   X00246**4
               COLOR=BLUE,                                             X00247**4
               LENGTH=30,                                              X00248**3
               POS=(10,10)                                              00249**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00250**2
               INITIAL=' ',                                            X00251**2
               LENGTH=1,                                               X00252**2
               POS=(10,41)                                              00253**3
ASEL07   DFHMDF ATTRB=(UNPROT,NORM),                                   X00254**4
               COLOR=GREEN,                                            X00255**2
               HILIGHT=UNDERLINE,                                      X00256**2
               LENGTH=1,                                               X00257**2
               POS=(11,2)                                               00258**2
         DFHMDF ATTRB=(ASKIP),                                         X00259**4
               POS=(11,4),                                             X00260**5
               LENGTH=001                                               00261**4
AACT07   DFHMDF ATTRB=(ASKIP),                                         X00262**2
               JUSTIFY=(LEFT,BLANK),                                   X00263**4
               COLOR=BLUE,                                             X00264**4
               LENGTH=3,                                               X00265**2
               POS=(11,5)                                               00266**2
         DFHMDF ATTRB=(ASKIP),                                         X00267**2
               POS=(11,9),                                             X00268**2
               INITIAL=' ',                                            X00269**2
               LENGTH=1                                                 00270**2
AVNDR07  DFHMDF ATTRB=(ASKIP),                                         X00271**2
               JUSTIFY=(LEFT,BLANK),                                   X00272**4
               COLOR=BLUE,                                             X00273**4
               LENGTH=30,                                              X00274**3
               POS=(11,10)                                              00275**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00276**2
               INITIAL=' ',                                            X00277**2
               LENGTH=1,                                               X00278**2
               POS=(11,41)                                              00279**3
ASEL08   DFHMDF ATTRB=(UNPROT,NORM),                                   X00280**4
               COLOR=GREEN,                                            X00281**2
               HILIGHT=UNDERLINE,                                      X00282**2
               LENGTH=1,                                               X00283**2
               POS=(12,2)                                               00284**2
         DFHMDF ATTRB=(ASKIP),                                         X00285**4
               POS=(12,4),                                             X00286**5
               LENGTH=001                                               00287**4
AACT08   DFHMDF ATTRB=(ASKIP),                                         X00288**2
               JUSTIFY=(LEFT,BLANK),                                   X00289**4
               COLOR=BLUE,                                             X00290**4
               LENGTH=3,                                               X00291**2
               POS=(12,5)                                               00292**2
         DFHMDF ATTRB=(ASKIP),                                         X00293**2
               POS=(12,9),                                             X00294**2
               INITIAL=' ',                                            X00295**2
               LENGTH=1                                                 00296**2
AVNDR08  DFHMDF ATTRB=(ASKIP),                                         X00297**2
               JUSTIFY=(LEFT,BLANK),                                   X00298**4
               COLOR=BLUE,                                             X00299**4
               LENGTH=30,                                              X00300**3
               POS=(12,10)                                              00301**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00302**2
               INITIAL=' ',                                            X00303**2
               LENGTH=1,                                               X00304**2
               POS=(12,41)                                              00305**3
ASEL09   DFHMDF ATTRB=(UNPROT,NORM),                                   X00306**4
               COLOR=GREEN,                                            X00307**2
               HILIGHT=UNDERLINE,                                      X00308**2
               LENGTH=1,                                               X00309**2
               POS=(13,2)                                               00310**2
         DFHMDF ATTRB=(ASKIP),                                         X00311**4
               POS=(13,4),                                             X00312**5
               LENGTH=001                                               00313**4
AACT09   DFHMDF ATTRB=(ASKIP),                                         X00314**2
               JUSTIFY=(LEFT,BLANK),                                   X00315**4
               COLOR=BLUE,                                             X00316**4
               LENGTH=3,                                               X00317**2
               POS=(13,5)                                               00318**2
         DFHMDF ATTRB=(ASKIP),                                         X00319**2
               POS=(13,9),                                             X00320**2
               INITIAL=' ',                                            X00321**2
               LENGTH=1                                                 00322**2
AVNDR09  DFHMDF ATTRB=(ASKIP),                                         X00323**2
               JUSTIFY=(LEFT,BLANK),                                   X00324**4
               COLOR=BLUE,                                             X00325**4
               LENGTH=30,                                              X00326**3
               POS=(13,10)                                              00327**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00328**2
               INITIAL=' ',                                            X00329**2
               LENGTH=1,                                               X00330**2
               POS=(13,41)                                              00331**3
ASEL10   DFHMDF ATTRB=(UNPROT,NORM),                                   X00332**4
               COLOR=GREEN,                                            X00333**2
               HILIGHT=UNDERLINE,                                      X00334**2
               LENGTH=1,                                               X00335**2
               POS=(14,2)                                               00336**2
         DFHMDF ATTRB=(ASKIP),                                         X00337**4
               POS=(14,4),                                             X00338**5
               LENGTH=001                                               00339**4
AACT10   DFHMDF ATTRB=(ASKIP),                                         X00340**2
               JUSTIFY=(LEFT,BLANK),                                   X00341**4
               COLOR=BLUE,                                             X00342**4
               LENGTH=3,                                               X00343**2
               POS=(14,5)                                               00344**2
         DFHMDF ATTRB=(ASKIP),                                         X00345**2
               POS=(14,9),                                             X00346**2
               INITIAL=' ',                                            X00347**2
               LENGTH=1                                                 00348**2
AVNDR10  DFHMDF ATTRB=(ASKIP),                                         X00349**2
               JUSTIFY=(LEFT,BLANK),                                   X00350**4
               COLOR=BLUE,                                             X00351**4
               LENGTH=30,                                              X00352**3
               POS=(14,10)                                              00353**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00354**2
               INITIAL=' ',                                            X00355**2
               LENGTH=1,                                               X00356**2
               POS=(14,41)                                              00357**3
ASEL11   DFHMDF ATTRB=(UNPROT,NORM),                                   X00358**4
               COLOR=GREEN,                                            X00359**2
               HILIGHT=UNDERLINE,                                      X00360**2
               LENGTH=1,                                               X00361**2
               POS=(15,2)                                               00362**2
         DFHMDF ATTRB=(ASKIP),                                         X00363**4
               POS=(15,4),                                             X00364**5
               LENGTH=001                                               00365**4
AACT11   DFHMDF ATTRB=(ASKIP),                                         X00366**2
               JUSTIFY=(LEFT,BLANK),                                   X00367**4
               COLOR=BLUE,                                             X00368**4
               LENGTH=3,                                               X00369**2
               POS=(15,5)                                               00370**2
         DFHMDF ATTRB=(ASKIP),                                         X00371**2
               POS=(15,9),                                             X00372**2
               INITIAL=' ',                                            X00373**2
               LENGTH=1                                                 00374**2
AVNDR11  DFHMDF ATTRB=(ASKIP),                                         X00375**2
               JUSTIFY=(LEFT,BLANK),                                   X00376**4
               COLOR=BLUE,                                             X00377**4
               LENGTH=30,                                              X00378**3
               POS=(15,10)                                              00379**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00380**2
               INITIAL=' ',                                            X00381**2
               LENGTH=1,                                               X00382**2
               POS=(15,41)                                              00383**3
ASEL12   DFHMDF ATTRB=(UNPROT,NORM),                                   X00384**4
               COLOR=GREEN,                                            X00385**2
               HILIGHT=UNDERLINE,                                      X00386**2
               LENGTH=1,                                               X00387**2
               POS=(16,2)                                               00388**2
         DFHMDF ATTRB=(ASKIP),                                         X00389**4
               POS=(16,4),                                             X00390**5
               LENGTH=001                                               00391**4
AACT12   DFHMDF ATTRB=(ASKIP),                                         X00392**2
               JUSTIFY=(LEFT,BLANK),                                   X00393**4
               COLOR=BLUE,                                             X00394**4
               LENGTH=3,                                               X00395**2
               POS=(16,5)                                               00396**2
         DFHMDF ATTRB=(ASKIP),                                         X00397**2
               POS=(16,9),                                             X00398**2
               INITIAL=' ',                                            X00399**2
               LENGTH=1                                                 00400**2
AVNDR12  DFHMDF ATTRB=(ASKIP),                                         X00401**2
               JUSTIFY=(LEFT,BLANK),                                   X00402**4
               COLOR=BLUE,                                             X00403**4
               LENGTH=30,                                              X00404**3
               POS=(16,10)                                              00405**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00406**2
               INITIAL=' ',                                            X00407**2
               LENGTH=1,                                               X00408**2
               POS=(16,41)                                              00409**3
ASEL13   DFHMDF ATTRB=(UNPROT,NORM),                                   X00410**4
               COLOR=GREEN,                                            X00411**2
               HILIGHT=UNDERLINE,                                      X00412**2
               LENGTH=1,                                               X00413**2
               POS=(17,2)                                               00414**2
         DFHMDF ATTRB=(ASKIP),                                         X00415**4
               POS=(17,4),                                             X00416**5
               LENGTH=001                                               00417**4
AACT13   DFHMDF ATTRB=(ASKIP),                                         X00418**2
               JUSTIFY=(LEFT,BLANK),                                   X00419**4
               COLOR=BLUE,                                             X00420**4
               LENGTH=3,                                               X00421**2
               POS=(17,5)                                               00422**2
         DFHMDF ATTRB=(ASKIP),                                         X00423**2
               POS=(17,9),                                             X00424**2
               INITIAL=' ',                                            X00425**2
               LENGTH=1                                                 00426**2
AVNDR13  DFHMDF ATTRB=(ASKIP),                                         X00427**2
               JUSTIFY=(LEFT,BLANK),                                   X00428**4
               COLOR=BLUE,                                             X00429**4
               LENGTH=30,                                              X00430**3
               POS=(17,10)                                              00431**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00432**2
               INITIAL=' ',                                            X00433**2
               LENGTH=1,                                               X00434**2
               POS=(17,41)                                              00435**3
ASEL14   DFHMDF ATTRB=(UNPROT,NORM),                                   X00436**4
               COLOR=GREEN,                                            X00437**2
               HILIGHT=UNDERLINE,                                      X00438**2
               LENGTH=1,                                               X00439**2
               POS=(18,2)                                               00440**2
         DFHMDF ATTRB=(ASKIP),                                         X00441**4
               POS=(18,4),                                             X00442**5
               LENGTH=001                                               00443**4
AACT14   DFHMDF ATTRB=(ASKIP),                                         X00444**2
               JUSTIFY=(LEFT,BLANK),                                   X00445**4
               COLOR=BLUE,                                             X00446**4
               LENGTH=3,                                               X00447**2
               POS=(18,5)                                               00448**2
         DFHMDF ATTRB=(ASKIP),                                         X00449**2
               POS=(18,9),                                             X00450**2
               INITIAL=' ',                                            X00451**2
               LENGTH=1                                                 00452**2
AVNDR14  DFHMDF ATTRB=(ASKIP),                                         X00453**2
               JUSTIFY=(LEFT,BLANK),                                   X00454**4
               COLOR=BLUE,                                             X00455**4
               LENGTH=30,                                              X00456**3
               POS=(18,10)                                              00457**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00458**2
               INITIAL=' ',                                            X00459**2
               LENGTH=1,                                               X00460**2
               POS=(18,41)                                              00461**3
         DFHMDF ATTRB=(ASKIP),                                         X00462**2
               POS=(19,1),                                             X00463**2
               INITIAL=' ',                                            X00464**2
               LENGTH=1                                                 00465**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00466**2
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00467**2
               COLOR=NEUTRAL,                                          X00468**2
               LENGTH=25,                                              X00469**2
               POS=(19,40)                                              00470**2
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00471**2
               JUSTIFY=(LEFT,BLANK),                                   X00472**2
               COLOR=BLUE,                                             X00473**2
               PICOUT='ZZZZZZZ',                                       X00474**2
               LENGTH=7,                                               X00475**2
               POS=(19,67)                                              00476**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00477**2
               INITIAL=' ',                                            X00478**2
               LENGTH=1,                                               X00479**2
               POS=(19,75)                                              00480**2
         DFHMSD TYPE=FINAL                                              00481**2
         END                                                            00482**2
