*          DATA SET ETKM348    AT LEVEL 001 AS OF 06/06/95                      
*          DATA SET ETKM348    AT LEVEL 002 AS OF 04/04/95              00001   
*          DATA SET ETKM348A1  AT LEVEL 013 AS OF 03/29/95              00002   
  PRINT  NOGEN                                                          00003   
************************************************************            00004   
*  BMS MAPSET :  ETKM348                                                00005   
*      MAP    :  ET348A                                                 00006   
************************************************************            00007   
ETKM348  DFHMSD TYPE=DSECT,                                            X00008   
               CTRL=(FREEKB),                                          X00009   
               TERM=3270-2,                                            X00010   
               LANG=COBOL,                                             X00011   
               MODE=INOUT,                                             X00012   
               TIOAPFX=YES,                                            X00013   
               STORAGE=AUTO                                             00014   
ET348A   DFHMDI LINE=2,                                                X00015   
               COLUMN=1,                                               X00016   
               SIZE=(19,80),                                           X00017   
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00020   
*                                                                       00021   
*  SCREEN LINE 03                                                       00022   
*                                                                       00023   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00024   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00025   
               INITIAL='ITEMS',                                        X00026   
               COLOR=NEUTRAL,                                          X00027   
               LENGTH=5,                                               X00028   
               POS=(02,44)                                              00029   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00030   
               JUSTIFY=(LEFT,BLANK),                                   X00031   
               COLOR=GREEN,                                            X00032   
               HILIGHT=UNDERLINE,                                      X00033   
               PICOUT='ZZZZ9',                                         X00034   
               LENGTH=5,                                               X00035   
               POS=(02,50)                                              00036   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00037   
               INITIAL='TO',                                           X00038   
               COLOR=NEUTRAL,                                          X00039   
               LENGTH=2,                                               X00040   
               POS=(02,56)                                              00041   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00042   
               JUSTIFY=(LEFT,BLANK),                                   X00043   
               COLOR=BLUE,                                             X00044   
               PICOUT='ZZZZ9',                                         X00045   
               LENGTH=5,                                               X00046   
               POS=(02,59)                                              00047   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00048   
               INITIAL='OF',                                           X00049   
               COLOR=NEUTRAL,                                          X00050   
               LENGTH=2,                                               X00051   
               POS=(02,65)                                              00052   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00053   
               JUSTIFY=(LEFT,BLANK),                                   X00054   
               COLOR=BLUE,                                             X00055   
               PICOUT='ZZZZ9',                                         X00056   
               LENGTH=5,                                               X00057   
               POS=(02,68)                                              00058   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00059   
*                                                                       00060   
*  SCREEN LINE 05                                                       00061   
*                                                                       00062   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00063   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00064   
               INITIAL='SEL',                                          X00065   
               COLOR=NEUTRAL,                                          X00066   
               LENGTH=3,                                               X00067   
               POS=(04,1)                                               00068   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00069   
               INITIAL='ACT',                                          X00070   
               COLOR=NEUTRAL,                                          X00071   
               LENGTH=3,                                               X00072   
               POS=(04,6)                                               00073   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00074   
               INITIAL='P.O. #',                                       X00075   
               COLOR=NEUTRAL,                                          X00076   
               LENGTH=6,                                               X00077   
               POS=(04,12)                                              00078   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00079   
               INITIAL='VENDOR',                                       X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=6,                                               X00082   
               POS=(04,39)                                              00083   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00084   
               INITIAL='EDI',                                          X00085   
               COLOR=NEUTRAL,                                          X00086   
               LENGTH=3,                                               X00087   
               POS=(04,53)                                              00088   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00089   
               INITIAL='HOLD',                                         X00090   
               COLOR=NEUTRAL,                                          X00091   
               LENGTH=4,                                               X00092   
               POS=(04,62)                                              00093   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00094   
               INITIAL='RELEASE',                                      X00095   
               COLOR=NEUTRAL,                                          X00096   
               LENGTH=7,                                               X00097   
               POS=(04,71)                                              00098   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00099   
*                                                                       00100   
*  SCREEN LINE 06                                                       00101   
*                                                                       00102   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00103   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00104   
               INITIAL='DOCUMENT',                                     X00105   
               COLOR=NEUTRAL,                                          X00106   
               LENGTH=8,                                               X00107   
               POS=(05,51)                                              00108   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00109   
               INITIAL='DATE',                                         X00110   
               COLOR=NEUTRAL,                                          X00111   
               LENGTH=4,                                               X00112   
               POS=(05,62)                                              00113   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00114   
               INITIAL='DATE',                                         X00115   
               COLOR=NEUTRAL,                                          X00116   
               LENGTH=4,                                               X00117   
               POS=(05,71)                                              00118   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00119   
*                                                                       00120   
*  SCREEN LINE 07                                                       00121   
*                                                                       00122   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00123   
ASEL01   DFHMDF ATTRB=(UNPROT,IC),                                     X00124   
               COLOR=GREEN,                                            X00125   
               HILIGHT=UNDERLINE,                                      X00126   
               LENGTH=1,                                               X00127   
               POS=(06,2)                                               00128   
         DFHMDF ATTRB=(ASKIP),                                         X00129   
               POS=(06,4),                                             X00130   
               INITIAL=' ',                                            X00131   
               LENGTH=1                                                 00132   
AACT01   DFHMDF ATTRB=(ASKIP),                                         X00133   
               COLOR=BLUE,                                             X00134   
               LENGTH=3,                                               X00135   
               POS=(06,6)                                               00136   
APO01    DFHMDF ATTRB=(ASKIP),                                         X00137   
               COLOR=BLUE,                                             X00138   
               LENGTH=22,                                              X00139   
               POS=(06,12)                                              00140   
AVND01   DFHMDF ATTRB=(ASKIP),                                         X00141   
               COLOR=BLUE,                                             X00142   
               LENGTH=10,                                              X00143   
               POS=(06,39)                                              00144   
AEDOC01  DFHMDF ATTRB=(ASKIP),                                         X00145   
               COLOR=BLUE,                                             X00146   
               LENGTH=3,                                               X00147   
               POS=(06,53)                                              00148   
AHDT01   DFHMDF ATTRB=(ASKIP),                                         X00149   
               COLOR=BLUE,                                             X00150   
               LENGTH=8,                                               X00151   
               POS=(06,61)                                              00152   
ARDT01   DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=8,                                               X00155   
               POS=(06,71)                                              00156   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00157   
*                                                                       00158   
*  SCREEN LINE 08                                                       00159   
*                                                                       00160   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00161   
ASEL02   DFHMDF ATTRB=(UNPROT,IC),                                     X00162   
               COLOR=GREEN,                                            X00163   
               HILIGHT=UNDERLINE,                                      X00164   
               LENGTH=1,                                               X00165   
               POS=(07,2)                                               00166   
         DFHMDF ATTRB=(ASKIP),                                         X00167   
               POS=(07,4),                                             X00168   
               INITIAL=' ',                                            X00169   
               LENGTH=1                                                 00170   
AACT02   DFHMDF ATTRB=(ASKIP),                                         X00171   
               COLOR=BLUE,                                             X00172   
               LENGTH=3,                                               X00173   
               POS=(07,6)                                               00174   
APO02    DFHMDF ATTRB=(ASKIP),                                         X00175   
               COLOR=BLUE,                                             X00176   
               LENGTH=22,                                              X00177   
               POS=(07,12)                                              00178   
AVND02   DFHMDF ATTRB=(ASKIP),                                         X00179   
               COLOR=BLUE,                                             X00180   
               LENGTH=10,                                              X00181   
               POS=(07,39)                                              00182   
AEDOC02  DFHMDF ATTRB=(ASKIP),                                         X00183   
               COLOR=BLUE,                                             X00184   
               LENGTH=3,                                               X00185   
               POS=(07,53)                                              00186   
AHDT02   DFHMDF ATTRB=(ASKIP),                                         X00187   
               COLOR=BLUE,                                             X00188   
               LENGTH=8,                                               X00189   
               POS=(07,61)                                              00190   
ARDT02   DFHMDF ATTRB=(ASKIP),                                         X00191   
               COLOR=BLUE,                                             X00192   
               LENGTH=8,                                               X00193   
               POS=(07,71)                                              00194   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00195   
*                                                                       00196   
*  SCREEN LINE 09                                                       00197   
*                                                                       00198   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00199   
ASEL03   DFHMDF ATTRB=(UNPROT,IC),                                     X00200   
               COLOR=GREEN,                                            X00201   
               HILIGHT=UNDERLINE,                                      X00202   
               LENGTH=1,                                               X00203   
               POS=(08,2)                                               00204   
         DFHMDF ATTRB=(ASKIP),                                         X00205   
               POS=(08,4),                                             X00206   
               INITIAL=' ',                                            X00207   
               LENGTH=1                                                 00208   
AACT03   DFHMDF ATTRB=(ASKIP),                                         X00209   
               COLOR=BLUE,                                             X00210   
               LENGTH=3,                                               X00211   
               POS=(08,6)                                               00212   
APO03    DFHMDF ATTRB=(ASKIP),                                         X00213   
               COLOR=BLUE,                                             X00214   
               LENGTH=22,                                              X00215   
               POS=(08,12)                                              00216   
AVND03   DFHMDF ATTRB=(ASKIP),                                         X00217   
               COLOR=BLUE,                                             X00218   
               LENGTH=10,                                              X00219   
               POS=(08,39)                                              00220   
AEDOC03  DFHMDF ATTRB=(ASKIP),                                         X00221   
               COLOR=BLUE,                                             X00222   
               LENGTH=3,                                               X00223   
               POS=(08,53)                                              00224   
AHDT03   DFHMDF ATTRB=(ASKIP),                                         X00225   
               COLOR=BLUE,                                             X00226   
               LENGTH=8,                                               X00227   
               POS=(08,61)                                              00228   
ARDT03   DFHMDF ATTRB=(ASKIP),                                         X00229   
               COLOR=BLUE,                                             X00230   
               LENGTH=8,                                               X00231   
               POS=(08,71)                                              00232   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00233   
*                                                                       00234   
*  SCREEN LINE 10                                                       00235   
*                                                                       00236   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00237   
ASEL04   DFHMDF ATTRB=(UNPROT,IC),                                     X00238   
               COLOR=GREEN,                                            X00239   
               HILIGHT=UNDERLINE,                                      X00240   
               LENGTH=1,                                               X00241   
               POS=(09,2)                                               00242   
         DFHMDF ATTRB=(ASKIP),                                         X00243   
               POS=(09,4),                                             X00244   
               INITIAL=' ',                                            X00245   
               LENGTH=1                                                 00246   
AACT04   DFHMDF ATTRB=(ASKIP),                                         X00247   
               COLOR=BLUE,                                             X00248   
               LENGTH=3,                                               X00249   
               POS=(09,6)                                               00250   
APO04    DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=22,                                              X00253   
               POS=(09,12)                                              00254   
AVND04   DFHMDF ATTRB=(ASKIP),                                         X00255   
               COLOR=BLUE,                                             X00256   
               LENGTH=10,                                              X00257   
               POS=(09,39)                                              00258   
AEDOC04  DFHMDF ATTRB=(ASKIP),                                         X00259   
               COLOR=BLUE,                                             X00260   
               LENGTH=3,                                               X00261   
               POS=(09,53)                                              00262   
AHDT04   DFHMDF ATTRB=(ASKIP),                                         X00263   
               COLOR=BLUE,                                             X00264   
               LENGTH=8,                                               X00265   
               POS=(09,61)                                              00266   
ARDT04   DFHMDF ATTRB=(ASKIP),                                         X00267   
               COLOR=BLUE,                                             X00268   
               LENGTH=8,                                               X00269   
               POS=(09,71)                                              00270   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00271   
*                                                                       00272   
*  SCREEN LINE 11                                                       00273   
*                                                                       00274   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00275   
ASEL05   DFHMDF ATTRB=(UNPROT,IC),                                     X00276   
               COLOR=GREEN,                                            X00277   
               HILIGHT=UNDERLINE,                                      X00278   
               LENGTH=1,                                               X00279   
               POS=(10,2)                                               00280   
         DFHMDF ATTRB=(ASKIP),                                         X00281   
               POS=(10,4),                                             X00282   
               INITIAL=' ',                                            X00283   
               LENGTH=1                                                 00284   
AACT05   DFHMDF ATTRB=(ASKIP),                                         X00285   
               COLOR=BLUE,                                             X00286   
               LENGTH=3,                                               X00287   
               POS=(10,6)                                               00288   
APO05    DFHMDF ATTRB=(ASKIP),                                         X00289   
               COLOR=BLUE,                                             X00290   
               LENGTH=22,                                              X00291   
               POS=(10,12)                                              00292   
AVND05   DFHMDF ATTRB=(ASKIP),                                         X00293   
               COLOR=BLUE,                                             X00294   
               LENGTH=10,                                              X00295   
               POS=(10,39)                                              00296   
AEDOC05  DFHMDF ATTRB=(ASKIP),                                         X00297   
               COLOR=BLUE,                                             X00298   
               LENGTH=3,                                               X00299   
               POS=(10,53)                                              00300   
AHDT05   DFHMDF ATTRB=(ASKIP),                                         X00301   
               COLOR=BLUE,                                             X00302   
               LENGTH=8,                                               X00303   
               POS=(10,61)                                              00304   
ARDT05   DFHMDF ATTRB=(ASKIP),                                         X00305   
               COLOR=BLUE,                                             X00306   
               LENGTH=8,                                               X00307   
               POS=(10,71)                                              00308   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00309   
*                                                                       00310   
*  SCREEN LINE 12                                                       00311   
*                                                                       00312   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00313   
ASEL06   DFHMDF ATTRB=(UNPROT,IC),                                     X00314   
               COLOR=GREEN,                                            X00315   
               HILIGHT=UNDERLINE,                                      X00316   
               LENGTH=1,                                               X00317   
               POS=(11,2)                                               00318   
         DFHMDF ATTRB=(ASKIP),                                         X00319   
               POS=(11,4),                                             X00320   
               INITIAL=' ',                                            X00321   
               LENGTH=1                                                 00322   
AACT06   DFHMDF ATTRB=(ASKIP),                                         X00323   
               COLOR=BLUE,                                             X00324   
               LENGTH=3,                                               X00325   
               POS=(11,6)                                               00326   
APO06    DFHMDF ATTRB=(ASKIP),                                         X00327   
               COLOR=BLUE,                                             X00328   
               LENGTH=22,                                              X00329   
               POS=(11,12)                                              00330   
AVND06   DFHMDF ATTRB=(ASKIP),                                         X00331   
               COLOR=BLUE,                                             X00332   
               LENGTH=10,                                              X00333   
               POS=(11,39)                                              00334   
AEDOC06  DFHMDF ATTRB=(ASKIP),                                         X00335   
               COLOR=BLUE,                                             X00336   
               LENGTH=3,                                               X00337   
               POS=(11,53)                                              00338   
AHDT06   DFHMDF ATTRB=(ASKIP),                                         X00339   
               COLOR=BLUE,                                             X00340   
               LENGTH=8,                                               X00341   
               POS=(11,61)                                              00342   
ARDT06   DFHMDF ATTRB=(ASKIP),                                         X00343   
               COLOR=BLUE,                                             X00344   
               LENGTH=8,                                               X00345   
               POS=(11,71)                                              00346   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00347   
*                                                                       00348   
*  SCREEN LINE 13                                                       00349   
*                                                                       00350   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00351   
ASEL07   DFHMDF ATTRB=(UNPROT,IC),                                     X00352   
               COLOR=GREEN,                                            X00353   
               HILIGHT=UNDERLINE,                                      X00354   
               LENGTH=1,                                               X00355   
               POS=(12,2)                                               00356   
         DFHMDF ATTRB=(ASKIP),                                         X00357   
               POS=(12,4),                                             X00358   
               INITIAL=' ',                                            X00359   
               LENGTH=1                                                 00360   
AACT07   DFHMDF ATTRB=(ASKIP),                                         X00361   
               COLOR=BLUE,                                             X00362   
               LENGTH=3,                                               X00363   
               POS=(12,6)                                               00364   
APO07    DFHMDF ATTRB=(ASKIP),                                         X00365   
               COLOR=BLUE,                                             X00366   
               LENGTH=22,                                              X00367   
               POS=(12,12)                                              00368   
AVND07   DFHMDF ATTRB=(ASKIP),                                         X00369   
               COLOR=BLUE,                                             X00370   
               LENGTH=10,                                              X00371   
               POS=(12,39)                                              00372   
AEDOC07  DFHMDF ATTRB=(ASKIP),                                         X00373   
               COLOR=BLUE,                                             X00374   
               LENGTH=3,                                               X00375   
               POS=(12,53)                                              00376   
AHDT07   DFHMDF ATTRB=(ASKIP),                                         X00377   
               COLOR=BLUE,                                             X00378   
               LENGTH=8,                                               X00379   
               POS=(12,61)                                              00380   
ARDT07   DFHMDF ATTRB=(ASKIP),                                         X00381   
               COLOR=BLUE,                                             X00382   
               LENGTH=8,                                               X00383   
               POS=(12,71)                                              00384   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00385   
*                                                                       00386   
*  SCREEN LINE 14                                                       00387   
*                                                                       00388   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00389   
ASEL08   DFHMDF ATTRB=(UNPROT,IC),                                     X00390   
               COLOR=GREEN,                                            X00391   
               HILIGHT=UNDERLINE,                                      X00392   
               LENGTH=1,                                               X00393   
               POS=(13,2)                                               00394   
         DFHMDF ATTRB=(ASKIP),                                         X00395   
               POS=(13,4),                                             X00396   
               INITIAL=' ',                                            X00397   
               LENGTH=1                                                 00398   
AACT08   DFHMDF ATTRB=(ASKIP),                                         X00399   
               COLOR=BLUE,                                             X00400   
               LENGTH=3,                                               X00401   
               POS=(13,6)                                               00402   
APO08    DFHMDF ATTRB=(ASKIP),                                         X00403   
               COLOR=BLUE,                                             X00404   
               LENGTH=22,                                              X00405   
               POS=(13,12)                                              00406   
AVND08   DFHMDF ATTRB=(ASKIP),                                         X00407   
               COLOR=BLUE,                                             X00408   
               LENGTH=10,                                              X00409   
               POS=(13,39)                                              00410   
AEDOC08  DFHMDF ATTRB=(ASKIP),                                         X00411   
               COLOR=BLUE,                                             X00412   
               LENGTH=3,                                               X00413   
               POS=(13,53)                                              00414   
AHDT08   DFHMDF ATTRB=(ASKIP),                                         X00415   
               COLOR=BLUE,                                             X00416   
               LENGTH=8,                                               X00417   
               POS=(13,61)                                              00418   
ARDT08   DFHMDF ATTRB=(ASKIP),                                         X00419   
               COLOR=BLUE,                                             X00420   
               LENGTH=8,                                               X00421   
               POS=(13,71)                                              00422   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00423   
*                                                                       00424   
*  SCREEN LINE 15                                                       00425   
*                                                                       00426   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00427   
ASEL09   DFHMDF ATTRB=(UNPROT,IC),                                     X00428   
               COLOR=GREEN,                                            X00429   
               HILIGHT=UNDERLINE,                                      X00430   
               LENGTH=1,                                               X00431   
               POS=(14,2)                                               00432   
         DFHMDF ATTRB=(ASKIP),                                         X00433   
               POS=(14,4),                                             X00434   
               INITIAL=' ',                                            X00435   
               LENGTH=1                                                 00436   
AACT09   DFHMDF ATTRB=(ASKIP),                                         X00437   
               COLOR=BLUE,                                             X00438   
               LENGTH=3,                                               X00439   
               POS=(14,6)                                               00440   
APO09    DFHMDF ATTRB=(ASKIP),                                         X00441   
               COLOR=BLUE,                                             X00442   
               LENGTH=22,                                              X00443   
               POS=(14,12)                                              00444   
AVND09   DFHMDF ATTRB=(ASKIP),                                         X00445   
               COLOR=BLUE,                                             X00446   
               LENGTH=10,                                              X00447   
               POS=(14,39)                                              00448   
AEDOC09  DFHMDF ATTRB=(ASKIP),                                         X00449   
               COLOR=BLUE,                                             X00450   
               LENGTH=3,                                               X00451   
               POS=(14,53)                                              00452   
AHDT09   DFHMDF ATTRB=(ASKIP),                                         X00453   
               COLOR=BLUE,                                             X00454   
               LENGTH=8,                                               X00455   
               POS=(14,61)                                              00456   
ARDT09   DFHMDF ATTRB=(ASKIP),                                         X00457   
               COLOR=BLUE,                                             X00458   
               LENGTH=8,                                               X00459   
               POS=(14,71)                                              00460   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00461   
*                                                                       00462   
*  SCREEN LINE 16                                                       00463   
*                                                                       00464   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00465   
ASEL10   DFHMDF ATTRB=(UNPROT,IC),                                     X00466   
               COLOR=GREEN,                                            X00467   
               HILIGHT=UNDERLINE,                                      X00468   
               LENGTH=1,                                               X00469   
               POS=(15,2)                                               00470   
         DFHMDF ATTRB=(ASKIP),                                         X00471   
               POS=(15,4),                                             X00472   
               INITIAL=' ',                                            X00473   
               LENGTH=1                                                 00474   
AACT10   DFHMDF ATTRB=(ASKIP),                                         X00475   
               COLOR=BLUE,                                             X00476   
               LENGTH=3,                                               X00477   
               POS=(15,6)                                               00478   
APO10    DFHMDF ATTRB=(ASKIP),                                         X00479   
               COLOR=BLUE,                                             X00480   
               LENGTH=22,                                              X00481   
               POS=(15,12)                                              00482   
AVND10   DFHMDF ATTRB=(ASKIP),                                         X00483   
               COLOR=BLUE,                                             X00484   
               LENGTH=10,                                              X00485   
               POS=(15,39)                                              00486   
AEDOC10  DFHMDF ATTRB=(ASKIP),                                         X00487   
               COLOR=BLUE,                                             X00488   
               LENGTH=3,                                               X00489   
               POS=(15,53)                                              00490   
AHDT10   DFHMDF ATTRB=(ASKIP),                                         X00491   
               COLOR=BLUE,                                             X00492   
               LENGTH=8,                                               X00493   
               POS=(15,61)                                              00494   
ARDT10   DFHMDF ATTRB=(ASKIP),                                         X00495   
               COLOR=BLUE,                                             X00496   
               LENGTH=8,                                               X00497   
               POS=(15,71)                                              00498   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00499   
*                                                                       00500   
*  SCREEN LINE 17                                                       00501   
*                                                                       00502   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00503   
ASEL11   DFHMDF ATTRB=(UNPROT,IC),                                     X00504   
               COLOR=GREEN,                                            X00505   
               HILIGHT=UNDERLINE,                                      X00506   
               LENGTH=1,                                               X00507   
               POS=(16,2)                                               00508   
         DFHMDF ATTRB=(ASKIP),                                         X00509   
               POS=(16,4),                                             X00510   
               INITIAL=' ',                                            X00511   
               LENGTH=1                                                 00512   
AACT11   DFHMDF ATTRB=(ASKIP),                                         X00513   
               COLOR=BLUE,                                             X00514   
               LENGTH=3,                                               X00515   
               POS=(16,6)                                               00516   
APO11    DFHMDF ATTRB=(ASKIP),                                         X00517   
               COLOR=BLUE,                                             X00518   
               LENGTH=22,                                              X00519   
               POS=(16,12)                                              00520   
AVND11   DFHMDF ATTRB=(ASKIP),                                         X00521   
               COLOR=BLUE,                                             X00522   
               LENGTH=10,                                              X00523   
               POS=(16,39)                                              00524   
AEDOC11  DFHMDF ATTRB=(ASKIP),                                         X00525   
               COLOR=BLUE,                                             X00526   
               LENGTH=3,                                               X00527   
               POS=(16,53)                                              00528   
AHDT11   DFHMDF ATTRB=(ASKIP),                                         X00529   
               COLOR=BLUE,                                             X00530   
               LENGTH=8,                                               X00531   
               POS=(16,61)                                              00532   
ARDT11   DFHMDF ATTRB=(ASKIP),                                         X00533   
               COLOR=BLUE,                                             X00534   
               LENGTH=8,                                               X00535   
               POS=(16,71)                                              00536   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00537   
*                                                                       00538   
*  SCREEN LINE 18                                                       00539   
*                                                                       00540   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00541   
ASEL12   DFHMDF ATTRB=(UNPROT,IC),                                     X00542   
               COLOR=GREEN,                                            X00543   
               HILIGHT=UNDERLINE,                                      X00544   
               LENGTH=1,                                               X00545   
               POS=(17,2)                                               00546   
         DFHMDF ATTRB=(ASKIP),                                         X00547   
               POS=(17,4),                                             X00548   
               INITIAL=' ',                                            X00549   
               LENGTH=1                                                 00550   
AACT12   DFHMDF ATTRB=(ASKIP),                                         X00551   
               COLOR=BLUE,                                             X00552   
               LENGTH=3,                                               X00553   
               POS=(17,6)                                               00554   
APO12    DFHMDF ATTRB=(ASKIP),                                         X00555   
               COLOR=BLUE,                                             X00556   
               LENGTH=22,                                              X00557   
               POS=(17,12)                                              00558   
AVND12   DFHMDF ATTRB=(ASKIP),                                         X00559   
               COLOR=BLUE,                                             X00560   
               LENGTH=10,                                              X00561   
               POS=(17,39)                                              00562   
AEDOC12  DFHMDF ATTRB=(ASKIP),                                         X00563   
               COLOR=BLUE,                                             X00564   
               LENGTH=3,                                               X00565   
               POS=(17,53)                                              00566   
AHDT12   DFHMDF ATTRB=(ASKIP),                                         X00567   
               COLOR=BLUE,                                             X00568   
               LENGTH=8,                                               X00569   
               POS=(17,61)                                              00570   
ARDT12   DFHMDF ATTRB=(ASKIP),                                         X00571   
               COLOR=BLUE,                                             X00572   
               LENGTH=8,                                               X00573   
               POS=(17,71)                                              00574   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00575   
*                                                                       00576   
*  SCREEN LINE 20                                                       00577   
*                                                                       00578   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00579   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00580   
               INITIAL='NUMBER',                                       X00581   
               COLOR=NEUTRAL,                                          X00582   
               LENGTH=6,                                               X00583   
               POS=(19,39)                                              00584   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00585   
               INITIAL='OF',                                           X00586   
               COLOR=NEUTRAL,                                          X00587   
               LENGTH=2,                                               X00588   
               POS=(19,46)                                              00589   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00590   
               INITIAL='SELECTED',                                     X00591   
               COLOR=NEUTRAL,                                          X00592   
               LENGTH=8,                                               X00593   
               POS=(19,49)                                              00594   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00595   
               INITIAL='ITEMS:',                                       X00596   
               COLOR=NEUTRAL,                                          X00597   
               LENGTH=6,                                               X00598   
               POS=(19,58)                                              00599   
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00600   
               JUSTIFY=(LEFT,BLANK),                                   X00601   
               COLOR=BLUE,                                             X00602   
               PICOUT='ZZZZZZ9',                                       X00603   
               LENGTH=7,                                               X00604   
               POS=(19,67)                                              00605   
         DFHMSD TYPE=FINAL                                              00606   
         END                                                            00607   
