*          DATA SET ETKM343    AT LEVEL 001 AS OF 06/06/95                      
*          DATA SET ETKM343    AT LEVEL 006 AS OF 03/20/95              00001   
*          DATA SET ETKM343    AT LEVEL 004 AS OF 02/08/94              00002   
  PRINT  NOGEN                                                          00003   
*********************************************************************** 00004   
*  BMS MAPSET :  ETKM343 - UPC CATALOG VENDOR ID ADD/UPDATE/DELETE      00005   
*      MAP    :  ET343A                                                 00006   
*********************************************************************** 00007   
ETKM343  DFHMSD TYPE=DSECT,                                            X00008   
               CTRL=(FREEKB),                                          X00009   
               TERM=3270-2,                                            X00010   
               LANG=COBOL,                                             X00011   
               MODE=INOUT,                                             X00012   
               TIOAPFX=YES,                                            X00013   
               STORAGE=AUTO                                             00014   
ET343A   DFHMDI LINE=2,                                                X00015   
               COLUMN=1,                                               X00016   
               SIZE=(19,80),                                           X00017   
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00020   
*  SCREEN LINE 08                                                       00021   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00022   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00023   
               INITIAL='(LAST NAME, FIRST NAME)',                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               LENGTH=23,                                              X00026   
               POS=(07,1)                                               00027   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00028   
               INITIAL='BUYER NAME:',                                  X00029   
               COLOR=NEUTRAL,                                          X00030   
               LENGTH=11,                                              X00031   
               POS=(07,26)                                              00032   
ABYRLNM  DFHMDF ATTRB=(UNPROT),                                        X00033   
               COLOR=GREEN,                                            X00034   
               HILIGHT=UNDERLINE,                                      X00035   
               LENGTH=18,                                              X00036   
               POS=(07,38)                                              00037   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00038   
               INITIAL=' ',                                            X00039   
               LENGTH=1,                                               X00040   
               POS=(07,57)                                              00041   
ABYRFNM  DFHMDF ATTRB=(UNPROT),                                        X00042   
               COLOR=GREEN,                                            X00043   
               HILIGHT=UNDERLINE,                                      X00044   
               LENGTH=12,                                              X00045   
               POS=(07,59)                                              00046   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00047   
               INITIAL=' ',                                            X00048   
               LENGTH=1,                                               X00049   
               POS=(07,72)                                              00050   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00051   
*  SCREEN LINE 09                                                       00052   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00053   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00054   
               INITIAL='DEPT NBR..:',                                  X00055   
               COLOR=NEUTRAL,                                          X00056   
               LENGTH=11,                                              X00057   
               POS=(08,26)                                              00058   
ADPTNBR  DFHMDF ATTRB=(UNPROT),                                        X00059   
               COLOR=GREEN,                                            X00060   
               HILIGHT=UNDERLINE,                                      X00061   
               LENGTH=3,                                               X00062   
               POS=(08,38)                                              00063   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00064   
               INITIAL=' ',                                            X00065   
               LENGTH=1,                                               X00066   
               POS=(08,42)                                              00067   
         DFHMSD TYPE=FINAL                                              00068   
         END                                                            00069   
