*          DATA SET ETKM315    AT LEVEL 004 AS OF 02/28/94                      
*          DATA SET ETKM315A1  AT LEVEL 012 AS OF 02/23/94              00001**3
*          DATA SET ETKM315A1  AT LEVEL 015 AS OF 02/11/94              00002**3
ETKM315  DFHMSD TYPE=&&SYSPARM,                                        X00003**3
               LANG=COBOL,                                             X00004   
               MODE=INOUT,                                             X00005   
               TIOAPFX=YES                                              00006   
ET315A   DFHMDI SIZE=(19,080),                                         X00007**3
               MAPATTS=(COLOR,HILIGHT),                                X00008   
               DSATTS=(COLOR,HILIGHT),                                 X00009   
               LINE=02,                                                X00010   
               COLUMN=01,                                              X00011   
               CTRL=(FREEKB,FRSET)                                      00012   
*********************************************************************** 00013   
        DFHMDF POS=(01,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00014   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00015   
ASTRTIT DFHMDF POS=(01,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00016   
               COLOR=GREEN,                                            X00017   
               HILIGHT=UNDERLINE,                                      X00018   
               PICOUT='ZZZZ9'                                           00019   
        DFHMDF POS=(01,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00020   
               COLOR=NEUTRAL,                                          X00021   
               INITIAL='TO'                                             00022   
AENDIT  DFHMDF POS=(01,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00023   
               COLOR=BLUE,                                             X00024   
               PICOUT='ZZZZ9'                                           00025   
        DFHMDF POS=(01,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00026   
               COLOR=NEUTRAL,                                          X00027   
               INITIAL='OF'                                             00028   
ATOTIT  DFHMDF POS=(01,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00029   
               COLOR=BLUE,                                             X00030   
               PICOUT='ZZZZ9'                                           00031   
*********************************************************************** 00032   
         DFHMDF POS=(03,035),                                          X00033   
               COLOR=NEUTRAL,                                          X00034   
               ATTRB=(ASKIP,NORM),                                     X00035   
               LENGTH=005,                                             X00036   
               INITIAL='TP ID'                                          00037   
         DFHMDF POS=(04,001),                                          X00038   
               COLOR=NEUTRAL,                                          X00039   
               ATTRB=(ASKIP,NORM),                                     X00040   
               LENGTH=040,                                             X00041   
               INITIAL='SEL  ACT VENDOR NAME              QUALIF'       00042   
         DFHMDF POS=(04,042),                                          X00043   
               COLOR=NEUTRAL,                                          X00044   
               ATTRB=(ASKIP,NORM),                                     X00045   
               LENGTH=038,                                             X00046**2
               INITIAL='TP ID           NETWORK    SET P/T DIR'         00047**4
************************----5----0----5----0----5----0----5----0******* 00048   
ASEL01   DFHMDF POS=(06,002),                                          X00049   
               COLOR=GREEN,                                            X00050   
               ATTRB=(UNPROT,NORM),                                    X00051   
               HILIGHT=UNDERLINE,                                      X00052   
               LENGTH=001                                               00053   
         DFHMDF POS=(06,004),                                          X00054   
               ATTRB=(ASKIP),                                          X00055   
               LENGTH=001                                               00056   
AACT01   DFHMDF POS=(06,006),                                          X00057   
               COLOR=BLUE,                                             X00058   
               ATTRB=(ASKIP,NORM),                                     X00059   
               LENGTH=003                                               00060   
VDNME01  DFHMDF POS=(06,010),                                          X00061   
               COLOR=BLUE,                                             X00062   
               ATTRB=(ASKIP,NORM),                                     X00063   
               LENGTH=025                                               00064   
TPIDQ01  DFHMDF POS=(06,037),                                          X00065   
               COLOR=BLUE,                                             X00066   
               ATTRB=(ASKIP,NORM),                                     X00067   
               LENGTH=02                                                00068   
TPID01   DFHMDF POS=(06,042),                                          X00069   
               COLOR=BLUE,                                             X00070   
               ATTRB=(ASKIP,NORM),                                     X00071   
               LENGTH=015                                               00072   
NTWK01   DFHMDF POS=(06,058),                                          X00073**4
               COLOR=BLUE,                                             X00074   
               ATTRB=(ASKIP,NORM),                                     X00075   
               LENGTH=010                                               00076   
TSET01   DFHMDF POS=(06,069),                                          X00077**4
               COLOR=BLUE,                                             X00078   
               ATTRB=(ASKIP,NORM),                                     X00079   
               LENGTH=003                                               00080   
PT01     DFHMDF POS=(06,074),                                          X00081**4
               COLOR=BLUE,                                             X00082   
               ATTRB=(ASKIP,NORM),                                     X00083   
               LENGTH=001                                               00084   
DIR01    DFHMDF POS=(06,078),                                          X00085   
               COLOR=BLUE,                                             X00086   
               ATTRB=(ASKIP,NORM),                                     X00087   
               LENGTH=001                                               00088   
*********************************************************************** 00089   
ASEL02   DFHMDF POS=(07,002),                                          X00090   
               COLOR=GREEN,                                            X00091   
               ATTRB=(UNPROT,NORM),                                    X00092   
               HILIGHT=UNDERLINE,                                      X00093   
               LENGTH=001                                               00094   
         DFHMDF POS=(07,004),                                          X00095   
               ATTRB=(ASKIP),                                          X00096   
               LENGTH=001                                               00097   
AACT02   DFHMDF POS=(07,006),                                          X00098   
               COLOR=BLUE,                                             X00099   
               ATTRB=(ASKIP,NORM),                                     X00100   
               LENGTH=003                                               00101   
VDNME02  DFHMDF POS=(07,010),                                          X00102   
               COLOR=BLUE,                                             X00103   
               ATTRB=(ASKIP,NORM),                                     X00104   
               LENGTH=025                                               00105   
TPIDQ02  DFHMDF POS=(07,037),                                          X00106   
               COLOR=BLUE,                                             X00107   
               ATTRB=(ASKIP,NORM),                                     X00108   
               LENGTH=02                                                00109   
TPID02   DFHMDF POS=(07,042),                                          X00110   
               COLOR=BLUE,                                             X00111   
               ATTRB=(ASKIP,NORM),                                     X00112   
               LENGTH=015                                               00113   
NTWK02   DFHMDF POS=(07,058),                                          X00114**4
               COLOR=BLUE,                                             X00115   
               ATTRB=(ASKIP,NORM),                                     X00116   
               LENGTH=010                                               00117   
TSET02   DFHMDF POS=(07,069),                                          X00118**4
               COLOR=BLUE,                                             X00119   
               ATTRB=(ASKIP,NORM),                                     X00120   
               LENGTH=003                                               00121   
PT02     DFHMDF POS=(07,074),                                          X00122**4
               COLOR=BLUE,                                             X00123   
               ATTRB=(ASKIP,NORM),                                     X00124   
               LENGTH=001                                               00125   
DIR02    DFHMDF POS=(07,078),                                          X00126   
               COLOR=BLUE,                                             X00127   
               ATTRB=(ASKIP,NORM),                                     X00128   
               LENGTH=001                                               00129   
*********************************************************************** 00130   
ASEL03   DFHMDF POS=(08,002),                                          X00131   
               COLOR=GREEN,                                            X00132   
               ATTRB=(UNPROT,NORM),                                    X00133   
               HILIGHT=UNDERLINE,                                      X00134   
               LENGTH=001                                               00135   
         DFHMDF POS=(08,004),                                          X00136   
               ATTRB=(ASKIP),                                          X00137   
               LENGTH=001                                               00138   
AACT03   DFHMDF POS=(08,006),                                          X00139   
               COLOR=BLUE,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00141   
               LENGTH=003                                               00142   
VDNME03  DFHMDF POS=(08,010),                                          X00143   
               COLOR=BLUE,                                             X00144   
               ATTRB=(ASKIP,NORM),                                     X00145   
               LENGTH=025                                               00146   
TPIDQ03  DFHMDF POS=(08,037),                                          X00147   
               COLOR=BLUE,                                             X00148   
               ATTRB=(ASKIP,NORM),                                     X00149   
               LENGTH=02                                                00150   
TPID03   DFHMDF POS=(08,042),                                          X00151   
               COLOR=BLUE,                                             X00152   
               ATTRB=(ASKIP,NORM),                                     X00153   
               LENGTH=015                                               00154   
NTWK03   DFHMDF POS=(08,058),                                          X00155**4
               COLOR=BLUE,                                             X00156   
               ATTRB=(ASKIP,NORM),                                     X00157   
               LENGTH=010                                               00158   
TSET03   DFHMDF POS=(08,069),                                          X00159**4
               COLOR=BLUE,                                             X00160   
               ATTRB=(ASKIP,NORM),                                     X00161   
               LENGTH=003                                               00162   
PT03     DFHMDF POS=(08,074),                                          X00163**4
               COLOR=BLUE,                                             X00164   
               ATTRB=(ASKIP,NORM),                                     X00165   
               LENGTH=001                                               00166   
DIR03    DFHMDF POS=(08,078),                                          X00167   
               COLOR=BLUE,                                             X00168   
               ATTRB=(ASKIP,NORM),                                     X00169   
               LENGTH=001                                               00170   
*********************************************************************** 00171   
ASEL04   DFHMDF POS=(09,002),                                          X00172   
               COLOR=GREEN,                                            X00173   
               ATTRB=(UNPROT,NORM),                                    X00174   
               HILIGHT=UNDERLINE,                                      X00175   
               LENGTH=001                                               00176   
         DFHMDF POS=(09,004),                                          X00177   
               ATTRB=(ASKIP),                                          X00178   
               LENGTH=001                                               00179   
AACT04   DFHMDF POS=(09,006),                                          X00180   
               COLOR=BLUE,                                             X00181   
               ATTRB=(ASKIP,NORM),                                     X00182   
               LENGTH=003                                               00183   
VDNME04  DFHMDF POS=(09,010),                                          X00184   
               COLOR=BLUE,                                             X00185   
               ATTRB=(ASKIP,NORM),                                     X00186   
               LENGTH=025                                               00187   
TPIDQ04  DFHMDF POS=(09,037),                                          X00188   
               COLOR=BLUE,                                             X00189   
               ATTRB=(ASKIP,NORM),                                     X00190   
               LENGTH=02                                                00191   
TPID04   DFHMDF POS=(09,042),                                          X00192   
               COLOR=BLUE,                                             X00193   
               ATTRB=(ASKIP,NORM),                                     X00194   
               LENGTH=015                                               00195   
NTWK04   DFHMDF POS=(09,058),                                          X00196**4
               COLOR=BLUE,                                             X00197   
               ATTRB=(ASKIP,NORM),                                     X00198   
               LENGTH=010                                               00199   
TSET04   DFHMDF POS=(09,069),                                          X00200**4
               COLOR=BLUE,                                             X00201   
               ATTRB=(ASKIP,NORM),                                     X00202   
               LENGTH=003                                               00203   
PT04     DFHMDF POS=(09,074),                                          X00204**4
               COLOR=BLUE,                                             X00205   
               ATTRB=(ASKIP,NORM),                                     X00206   
               LENGTH=001                                               00207   
DIR04    DFHMDF POS=(09,078),                                          X00208   
               COLOR=BLUE,                                             X00209   
               ATTRB=(ASKIP,NORM),                                     X00210   
               LENGTH=001                                               00211   
*********************************************************************** 00212   
ASEL05   DFHMDF POS=(10,002),                                          X00213   
               COLOR=GREEN,                                            X00214   
               ATTRB=(UNPROT,NORM),                                    X00215   
               HILIGHT=UNDERLINE,                                      X00216   
               LENGTH=001                                               00217   
         DFHMDF POS=(10,004),                                          X00218   
               ATTRB=(ASKIP),                                          X00219   
               LENGTH=001                                               00220   
AACT05   DFHMDF POS=(10,006),                                          X00221   
               COLOR=BLUE,                                             X00222   
               ATTRB=(ASKIP,NORM),                                     X00223   
               LENGTH=003                                               00224   
VDNME05  DFHMDF POS=(10,010),                                          X00225   
               COLOR=BLUE,                                             X00226   
               ATTRB=(ASKIP,NORM),                                     X00227   
               LENGTH=025                                               00228   
TPIDQ05  DFHMDF POS=(10,037),                                          X00229   
               COLOR=BLUE,                                             X00230   
               ATTRB=(ASKIP,NORM),                                     X00231   
               LENGTH=02                                                00232   
TPID05   DFHMDF POS=(10,042),                                          X00233   
               COLOR=BLUE,                                             X00234   
               ATTRB=(ASKIP,NORM),                                     X00235   
               LENGTH=015                                               00236   
NTWK05   DFHMDF POS=(10,058),                                          X00237**4
               COLOR=BLUE,                                             X00238   
               ATTRB=(ASKIP,NORM),                                     X00239   
               LENGTH=010                                               00240   
TSET05   DFHMDF POS=(10,069),                                          X00241**4
               COLOR=BLUE,                                             X00242   
               ATTRB=(ASKIP,NORM),                                     X00243   
               LENGTH=003                                               00244   
PT05     DFHMDF POS=(10,074),                                          X00245**4
               COLOR=BLUE,                                             X00246   
               ATTRB=(ASKIP,NORM),                                     X00247   
               LENGTH=001                                               00248   
DIR05    DFHMDF POS=(10,078),                                          X00249   
               COLOR=BLUE,                                             X00250   
               ATTRB=(ASKIP,NORM),                                     X00251   
               LENGTH=001                                               00252   
*********************************************************************** 00253   
ASEL06   DFHMDF POS=(11,002),                                          X00254   
               COLOR=GREEN,                                            X00255   
               ATTRB=(UNPROT,NORM),                                    X00256   
               HILIGHT=UNDERLINE,                                      X00257   
               LENGTH=001                                               00258   
         DFHMDF POS=(11,004),                                          X00259   
               ATTRB=(ASKIP),                                          X00260   
               LENGTH=001                                               00261   
AACT06   DFHMDF POS=(11,006),                                          X00262   
               COLOR=BLUE,                                             X00263   
               ATTRB=(ASKIP,NORM),                                     X00264   
               LENGTH=003                                               00265   
VDNME06  DFHMDF POS=(11,010),                                          X00266   
               COLOR=BLUE,                                             X00267   
               ATTRB=(ASKIP,NORM),                                     X00268   
               LENGTH=025                                               00269   
TPIDQ06  DFHMDF POS=(11,037),                                          X00270   
               COLOR=BLUE,                                             X00271   
               ATTRB=(ASKIP,NORM),                                     X00272   
               LENGTH=02                                                00273   
TPID06   DFHMDF POS=(11,042),                                          X00274   
               COLOR=BLUE,                                             X00275   
               ATTRB=(ASKIP,NORM),                                     X00276   
               LENGTH=015                                               00277   
NTWK06   DFHMDF POS=(11,058),                                          X00278**4
               COLOR=BLUE,                                             X00279   
               ATTRB=(ASKIP,NORM),                                     X00280   
               LENGTH=010                                               00281   
TSET06   DFHMDF POS=(11,069),                                          X00282**4
               COLOR=BLUE,                                             X00283   
               ATTRB=(ASKIP,NORM),                                     X00284   
               LENGTH=003                                               00285   
PT06     DFHMDF POS=(11,074),                                          X00286**4
               COLOR=BLUE,                                             X00287   
               ATTRB=(ASKIP,NORM),                                     X00288   
               LENGTH=001                                               00289   
DIR06    DFHMDF POS=(11,078),                                          X00290   
               COLOR=BLUE,                                             X00291   
               ATTRB=(ASKIP,NORM),                                     X00292   
               LENGTH=001                                               00293   
*********************************************************************** 00294   
ASEL07   DFHMDF POS=(12,002),                                          X00295   
               COLOR=GREEN,                                            X00296   
               ATTRB=(UNPROT,NORM),                                    X00297   
               HILIGHT=UNDERLINE,                                      X00298   
               LENGTH=001                                               00299   
         DFHMDF POS=(12,004),                                          X00300   
               ATTRB=(ASKIP),                                          X00301   
               LENGTH=001                                               00302   
AACT07   DFHMDF POS=(12,006),                                          X00303   
               COLOR=BLUE,                                             X00304   
               ATTRB=(ASKIP,NORM),                                     X00305   
               LENGTH=003                                               00306   
VDNME07  DFHMDF POS=(12,010),                                          X00307   
               COLOR=BLUE,                                             X00308   
               ATTRB=(ASKIP,NORM),                                     X00309   
               LENGTH=025                                               00310**3
TPIDQ07  DFHMDF POS=(12,037),                                          X00311   
               COLOR=BLUE,                                             X00312   
               ATTRB=(ASKIP,NORM),                                     X00313   
               LENGTH=02                                                00314   
TPID07   DFHMDF POS=(12,042),                                          X00315   
               COLOR=BLUE,                                             X00316   
               ATTRB=(ASKIP,NORM),                                     X00317   
               LENGTH=015                                               00318   
NTWK07   DFHMDF POS=(12,058),                                          X00319**4
               COLOR=BLUE,                                             X00320   
               ATTRB=(ASKIP,NORM),                                     X00321   
               LENGTH=010                                               00322   
TSET07   DFHMDF POS=(12,069),                                          X00323**4
               COLOR=BLUE,                                             X00324   
               ATTRB=(ASKIP,NORM),                                     X00325   
               LENGTH=003                                               00326   
PT07     DFHMDF POS=(12,074),                                          X00327**4
               COLOR=BLUE,                                             X00328   
               ATTRB=(ASKIP,NORM),                                     X00329   
               LENGTH=001                                               00330   
DIR07    DFHMDF POS=(12,078),                                          X00331   
               COLOR=BLUE,                                             X00332   
               ATTRB=(ASKIP,NORM),                                     X00333   
               LENGTH=001                                               00334   
*********************************************************************** 00335   
ASEL08   DFHMDF POS=(13,002),                                          X00336   
               COLOR=GREEN,                                            X00337   
               ATTRB=(UNPROT,NORM),                                    X00338   
               HILIGHT=UNDERLINE,                                      X00339   
               LENGTH=001                                               00340   
         DFHMDF POS=(13,004),                                          X00341   
               ATTRB=(ASKIP),                                          X00342   
               LENGTH=001                                               00343   
AACT08   DFHMDF POS=(13,006),                                          X00344   
               COLOR=BLUE,                                             X00345   
               ATTRB=(ASKIP,NORM),                                     X00346   
               LENGTH=003                                               00347   
VDNME08  DFHMDF POS=(13,010),                                          X00348   
               COLOR=BLUE,                                             X00349   
               ATTRB=(ASKIP,NORM),                                     X00350   
               LENGTH=025                                               00351   
TPIDQ08  DFHMDF POS=(13,037),                                          X00352   
               COLOR=BLUE,                                             X00353   
               ATTRB=(ASKIP,NORM),                                     X00354   
               LENGTH=02                                                00355   
TPID08   DFHMDF POS=(13,042),                                          X00356   
               COLOR=BLUE,                                             X00357   
               ATTRB=(ASKIP,NORM),                                     X00358   
               LENGTH=015                                               00359   
NTWK08   DFHMDF POS=(13,058),                                          X00360**4
               COLOR=BLUE,                                             X00361   
               ATTRB=(ASKIP,NORM),                                     X00362   
               LENGTH=010                                               00363   
TSET08   DFHMDF POS=(13,069),                                          X00364**4
               COLOR=BLUE,                                             X00365   
               ATTRB=(ASKIP,NORM),                                     X00366   
               LENGTH=003                                               00367   
PT08     DFHMDF POS=(13,074),                                          X00368**4
               COLOR=BLUE,                                             X00369   
               ATTRB=(ASKIP,NORM),                                     X00370   
               LENGTH=001                                               00371   
DIR08    DFHMDF POS=(13,078),                                          X00372   
               COLOR=BLUE,                                             X00373   
               ATTRB=(ASKIP,NORM),                                     X00374   
               LENGTH=001                                               00375   
*********************************************************************** 00376   
ASEL09   DFHMDF POS=(14,002),                                          X00377   
               COLOR=GREEN,                                            X00378   
               ATTRB=(UNPROT,NORM),                                    X00379   
               HILIGHT=UNDERLINE,                                      X00380   
               LENGTH=001                                               00381   
         DFHMDF POS=(14,004),                                          X00382   
               ATTRB=(ASKIP),                                          X00383   
               LENGTH=001                                               00384   
AACT09   DFHMDF POS=(14,006),                                          X00385   
               COLOR=BLUE,                                             X00386   
               ATTRB=(ASKIP,NORM),                                     X00387   
               LENGTH=003                                               00388   
VDNME09  DFHMDF POS=(14,010),                                          X00389   
               COLOR=BLUE,                                             X00390   
               ATTRB=(ASKIP,NORM),                                     X00391   
               LENGTH=025                                               00392   
TPIDQ09  DFHMDF POS=(14,037),                                          X00393   
               COLOR=BLUE,                                             X00394   
               ATTRB=(ASKIP,NORM),                                     X00395   
               LENGTH=02                                                00396   
TPID09   DFHMDF POS=(14,042),                                          X00397   
               COLOR=BLUE,                                             X00398   
               ATTRB=(ASKIP,NORM),                                     X00399   
               LENGTH=015                                               00400   
NTWK09   DFHMDF POS=(14,058),                                          X00401**4
               COLOR=BLUE,                                             X00402   
               ATTRB=(ASKIP,NORM),                                     X00403   
               LENGTH=010                                               00404   
TSET09   DFHMDF POS=(14,069),                                          X00405**4
               COLOR=BLUE,                                             X00406   
               ATTRB=(ASKIP,NORM),                                     X00407   
               LENGTH=003                                               00408   
PT09     DFHMDF POS=(14,074),                                          X00409**4
               COLOR=BLUE,                                             X00410   
               ATTRB=(ASKIP,NORM),                                     X00411   
               LENGTH=001                                               00412   
DIR09    DFHMDF POS=(14,078),                                          X00413   
               COLOR=BLUE,                                             X00414   
               ATTRB=(ASKIP,NORM),                                     X00415   
               LENGTH=001                                               00416   
*********************************************************************** 00417   
ASEL10   DFHMDF POS=(15,002),                                          X00418   
               COLOR=GREEN,                                            X00419   
               ATTRB=(UNPROT,NORM),                                    X00420   
               HILIGHT=UNDERLINE,                                      X00421   
               LENGTH=001                                               00422   
         DFHMDF POS=(15,004),                                          X00423   
               ATTRB=(ASKIP),                                          X00424   
               LENGTH=001                                               00425   
AACT10   DFHMDF POS=(15,006),                                          X00426   
               COLOR=BLUE,                                             X00427   
               ATTRB=(ASKIP,NORM),                                     X00428   
               LENGTH=003                                               00429   
VDNME10  DFHMDF POS=(15,010),                                          X00430   
               COLOR=BLUE,                                             X00431   
               ATTRB=(ASKIP,NORM),                                     X00432   
               LENGTH=025                                               00433   
TPIDQ10  DFHMDF POS=(15,037),                                          X00434   
               COLOR=BLUE,                                             X00435   
               ATTRB=(ASKIP,NORM),                                     X00436   
               LENGTH=02                                                00437   
TPID10   DFHMDF POS=(15,042),                                          X00438   
               COLOR=BLUE,                                             X00439   
               ATTRB=(ASKIP,NORM),                                     X00440   
               LENGTH=015                                               00441   
NTWK10   DFHMDF POS=(15,058),                                          X00442**4
               COLOR=BLUE,                                             X00443   
               ATTRB=(ASKIP,NORM),                                     X00444   
               LENGTH=010                                               00445   
TSET10   DFHMDF POS=(15,069),                                          X00446**4
               COLOR=BLUE,                                             X00447   
               ATTRB=(ASKIP,NORM),                                     X00448   
               LENGTH=003                                               00449   
PT10     DFHMDF POS=(15,074),                                          X00450**4
               COLOR=BLUE,                                             X00451   
               ATTRB=(ASKIP,NORM),                                     X00452   
               LENGTH=001                                               00453   
DIR10    DFHMDF POS=(15,078),                                          X00454   
               COLOR=BLUE,                                             X00455   
               ATTRB=(ASKIP,NORM),                                     X00456   
               LENGTH=001                                               00457   
*********************************************************************** 00458   
ASEL11   DFHMDF POS=(16,002),                                          X00459   
               COLOR=GREEN,                                            X00460   
               ATTRB=(UNPROT,NORM),                                    X00461   
               HILIGHT=UNDERLINE,                                      X00462   
               LENGTH=001                                               00463   
         DFHMDF POS=(16,004),                                          X00464   
               ATTRB=(ASKIP),                                          X00465   
               LENGTH=001                                               00466   
AACT11   DFHMDF POS=(16,006),                                          X00467   
               COLOR=BLUE,                                             X00468   
               ATTRB=(ASKIP,NORM),                                     X00469   
               LENGTH=003                                               00470   
VDNME11  DFHMDF POS=(16,010),                                          X00471   
               COLOR=BLUE,                                             X00472   
               ATTRB=(ASKIP,NORM),                                     X00473   
               LENGTH=025                                               00474   
TPIDQ11  DFHMDF POS=(16,037),                                          X00475   
               COLOR=BLUE,                                             X00476   
               ATTRB=(ASKIP,NORM),                                     X00477   
               LENGTH=02                                                00478   
TPID11   DFHMDF POS=(16,042),                                          X00479   
               COLOR=BLUE,                                             X00480   
               ATTRB=(ASKIP,NORM),                                     X00481   
               LENGTH=015                                               00482   
NTWK11   DFHMDF POS=(16,058),                                          X00483**4
               COLOR=BLUE,                                             X00484   
               ATTRB=(ASKIP,NORM),                                     X00485   
               LENGTH=010                                               00486   
TSET11   DFHMDF POS=(16,069),                                          X00487**4
               COLOR=BLUE,                                             X00488   
               ATTRB=(ASKIP,NORM),                                     X00489   
               LENGTH=003                                               00490   
PT11     DFHMDF POS=(16,074),                                          X00491**4
               COLOR=BLUE,                                             X00492   
               ATTRB=(ASKIP,NORM),                                     X00493   
               LENGTH=001                                               00494   
DIR11    DFHMDF POS=(16,078),                                          X00495   
               COLOR=BLUE,                                             X00496   
               ATTRB=(ASKIP,NORM),                                     X00497   
               LENGTH=001                                               00498   
*********************************************************************** 00499   
ASEL12   DFHMDF POS=(17,002),                                          X00500   
               COLOR=GREEN,                                            X00501   
               ATTRB=(UNPROT,NORM),                                    X00502   
               HILIGHT=UNDERLINE,                                      X00503   
               LENGTH=001                                               00504   
         DFHMDF POS=(17,004),                                          X00505   
               ATTRB=(ASKIP),                                          X00506   
               LENGTH=001                                               00507   
AACT12   DFHMDF POS=(17,006),                                          X00508   
               COLOR=BLUE,                                             X00509   
               ATTRB=(ASKIP,NORM),                                     X00510   
               LENGTH=003                                               00511   
VDNME12  DFHMDF POS=(17,010),                                          X00512   
               COLOR=BLUE,                                             X00513   
               ATTRB=(ASKIP,NORM),                                     X00514   
               LENGTH=025                                               00515   
TPIDQ12  DFHMDF POS=(17,037),                                          X00516   
               COLOR=BLUE,                                             X00517   
               ATTRB=(ASKIP,NORM),                                     X00518   
               LENGTH=02                                                00519   
TPID12   DFHMDF POS=(17,042),                                          X00520   
               COLOR=BLUE,                                             X00521   
               ATTRB=(ASKIP,NORM),                                     X00522   
               LENGTH=015                                               00523   
NTWK12   DFHMDF POS=(17,058),                                          X00524**4
               COLOR=BLUE,                                             X00525   
               ATTRB=(ASKIP,NORM),                                     X00526   
               LENGTH=010                                               00527   
TSET12   DFHMDF POS=(17,069),                                          X00528**4
               COLOR=BLUE,                                             X00529   
               ATTRB=(ASKIP,NORM),                                     X00530   
               LENGTH=003                                               00531   
PT12     DFHMDF POS=(17,074),                                          X00532**4
               COLOR=BLUE,                                             X00533   
               ATTRB=(ASKIP,NORM),                                     X00534   
               LENGTH=001                                               00535   
DIR12    DFHMDF POS=(17,078),                                          X00536   
               COLOR=BLUE,                                             X00537   
               ATTRB=(ASKIP,NORM),                                     X00538   
               LENGTH=001                                               00539   
*********************************************************************** 00540   
NBRSEL   DFHMDF POS=(19,040),                                          X00541   
               COLOR=NEUTRAL,                                          X00542   
               ATTRB=(ASKIP,NORM),                                     X00543   
               LENGTH=025,                                             X00544   
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00545   
ASELIT   DFHMDF POS=(19,067),                                          X00546   
               COLOR=BLUE,                                             X00547   
               ATTRB=(ASKIP,NORM),                                     X00548   
               LENGTH=007,                                             X00549   
               PICOUT='ZZZ,ZZ9',                                       X00550   
               INITIAL='              '                                 00551   
         DFHMSD TYPE=FINAL                                              00552   
         END                                                            00553   
