*          DATA SET ETKM325    AT LEVEL 006 AS OF 08/03/94                      
  PRINT  NOGEN                                                          00001   
************************************************************            00002   
*                                                                       00003   
*  ETC25 - ETKCS325_-_DOCS_NOT_ACKNOW._LI                               00004   
*                                                                       00005   
*     GENERATED          : 07/01/94 AT 01:00:44 PM                      00006   
*     VERSION            : 2.7.01                                       00007   
*     CSD LEVEL          : 2.7.01                                       00008   
*     AUTHOR             : NEWUSER.                                     00009   
*     INSTALLATION       : KNOWLEDGEWARE, INC.                          00010   
*     ENCYCLOPEDIA       : TPENC                                        00011   
*     ENCYCLOPEDIA PATH  : C:\ADW_ENC\TPENC\                            00012   
*     MAP DETAILS                                                       00013   
*     LAST UPDATED 07/01/1994 AT 12:57:49 BY TKMA086                    00014   
*-----------------------------------------------------------            00015   
*                                                                       00016   
*  BMS MAPSET :  ETKM325                                                00017   
*      MAP    :  ET325A                                                 00018   
************************************************************            00019   
ETKM325  DFHMSD TYPE=&SYSPARM,                                         X00020**5
               CTRL=(FREEKB),                                          X00021   
               TERM=3270-2,                                            X00022   
               LANG=COBOL,                                             X00023   
               MODE=INOUT,                                             X00024   
               TIOAPFX=YES,                                            X00025   
               STORAGE=AUTO                                             00026   
ET325A   DFHMDI LINE=2,                                                X00027**2
               COLUMN=1,                                               X00028   
               SIZE=(19,80),                                           X00029**2
               MAPATTS=(COLOR,HILIGHT),                                X00030**2
               DSATTS=(COLOR,HILIGHT)                                   00031**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 01                                                       00034**2
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
         DFHMDF ATTRB=(ASKIP),                                         X00037   
               POS=(01,1),                                             X00038**2
               INITIAL=' ',                                            X00039   
               LENGTH=1                                                 00040   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00041   
               INITIAL='ITEMS',                                        X00042   
               COLOR=NEUTRAL,                                          X00043   
               LENGTH=5,                                               X00044   
               POS=(01,37)                                              00045**2
         DFHMDF ATTRB=(ASKIP),                                         X00046   
               POS=(01,43),                                            X00047**2
               INITIAL=' ',                                            X00048   
               LENGTH=1                                                 00049   
****************************************                                00050   
*  VARIABLE = ASTRTIT      N005                                         00051   
****************************************                                00052   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00053   
               JUSTIFY=(LEFT,BLANK),                                   X00054   
               COLOR=GREEN,                                            X00055   
               HILIGHT=UNDERLINE,                                      X00056   
               PICOUT='ZZZZZ',                                         X00057   
               LENGTH=5,                                               X00058   
               POS=(01,45)                                              00059**2
         DFHMDF ATTRB=(ASKIP),                                         X00060   
               POS=(01,51),                                            X00061**2
               INITIAL=' ',                                            X00062   
               LENGTH=1                                                 00063   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00064   
               INITIAL='TO',                                           X00065   
               COLOR=NEUTRAL,                                          X00066   
               LENGTH=2,                                               X00067   
               POS=(01,53)                                              00068**2
         DFHMDF ATTRB=(ASKIP),                                         X00069   
               POS=(01,56),                                            X00070**2
               INITIAL=' ',                                            X00071   
               LENGTH=1                                                 00072   
****************************************                                00073   
*  VARIABLE = AENDIT      N005                                          00074   
****************************************                                00075   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00076   
               JUSTIFY=(LEFT,BLANK),                                   X00077   
               COLOR=BLUE,                                             X00078   
               PICOUT='ZZZZZ',                                         X00079   
               LENGTH=5,                                               X00080   
               POS=(01,58)                                              00081**2
         DFHMDF ATTRB=(ASKIP),                                         X00082   
               POS=(01,64),                                            X00083**2
               INITIAL=' ',                                            X00084   
               LENGTH=1                                                 00085   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00086   
               INITIAL='OF',                                           X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=2,                                               X00089   
               POS=(01,66)                                              00090**2
****************************************                                00091   
*  VARIABLE = ATOTIT      N005                                          00092   
****************************************                                00093   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00094   
               JUSTIFY=(LEFT,BLANK),                                   X00095   
               COLOR=BLUE,                                             X00096   
               PICOUT='ZZZZZ',                                         X00097   
               LENGTH=5,                                               X00098   
               POS=(01,70)                                              00099**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00100   
               INITIAL=' ',                                            X00101   
               LENGTH=1,                                               X00102   
               POS=(01,76)                                              00103**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00104   
*                                                                       00105   
*  SCREEN LINE 02                                                       00106**2
*                                                                       00107   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00108   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00109   
               POS=(02,1),                                             X00110**2
               INITIAL=' ',                                            X00111   
               LENGTH=1                                                 00112   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00113   
*                                                                       00114   
*  SCREEN LINE 03                                                       00115**2
*                                                                       00116   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00117   
         DFHMDF ATTRB=(ASKIP),                                         X00118   
               POS=(03,1),                                             X00119**2
               INITIAL=' ',                                            X00120   
               LENGTH=1                                                 00121   
         DFHMDF ATTRB=(PROT),                                          X00122   
               INITIAL='FG',                                           X00123   
               COLOR=NEUTRAL,                                          X00124   
               LENGTH=2,                                               X00125   
               POS=(03,43)                                              00126**2
         DFHMDF ATTRB=(ASKIP),                                         X00127   
               POS=(03,46),                                            X00128**2
               INITIAL=' ',                                            X00129   
               LENGTH=1                                                 00130   
         DFHMDF ATTRB=(PROT),                                          X00131   
               INITIAL='DAYS',                                         X00132   
               COLOR=NEUTRAL,                                          X00133   
               LENGTH=4,                                               X00134   
               POS=(03,61)                                              00135**2
         DFHMDF ATTRB=(PROT),                                          X00131   
               INITIAL='ACK',                                          X00132   
               COLOR=NEUTRAL,                                          X00133   
               LENGTH=3,                                               X00134   
               POS=(03,68)                                              00135**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00136   
*                                                                       00137   
*  SCREEN LINE 04                                                       00138**2
*                                                                       00139   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00140   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00141   
               INITIAL='SEL',                                          X00142   
               COLOR=NEUTRAL,                                          X00143   
               LENGTH=3,                                               X00144   
               POS=(04,1)                                               00145**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00146   
               INITIAL='ACT',                                          X00147   
               COLOR=NEUTRAL,                                          X00148   
               LENGTH=3,                                               X00149   
               POS=(04,6)                                               00150**2
         DFHMDF ATTRB=(ASKIP),                                         X00151   
               POS=(04,10),                                            X00152**2
               INITIAL=' ',                                            X00153   
               LENGTH=1                                                 00154   
         DFHMDF ATTRB=(PROT),                                          X00155   
               INITIAL='VENDOR',                                       X00156   
               COLOR=NEUTRAL,                                          X00157   
               LENGTH=6,                                               X00158   
               POS=(04,12)                                              00159**2
         DFHMDF ATTRB=(PROT),                                          X00160   
               INITIAL='NAME',                                         X00161   
               COLOR=NEUTRAL,                                          X00162   
               LENGTH=4,                                               X00163   
               POS=(04,19)                                              00164**2
         DFHMDF ATTRB=(ASKIP),                                         X00165   
               POS=(04,24),                                            X00166**2
               INITIAL=' ',                                            X00167   
               LENGTH=1                                                 00168   
         DFHMDF ATTRB=(PROT),                                          X00169   
               INITIAL='CONTROL',                                      X00170   
               COLOR=NEUTRAL,                                          X00171   
               LENGTH=7,                                               X00172   
               POS=(04,43)                                              00173**2
         DFHMDF ATTRB=(PROT),                                          X00174   
               INITIAL='#',                                            X00175   
               COLOR=NEUTRAL,                                          X00176   
               LENGTH=1,                                               X00177   
               POS=(04,51)                                              00178**2
         DFHMDF ATTRB=(ASKIP),                                         X00179   
               POS=(04,53),                                            X00180**2
               INITIAL=' ',                                            X00181   
               LENGTH=1                                                 00182   
         DFHMDF ATTRB=(PROT),                                          X00183   
               INITIAL='TSET',                                         X00184   
               COLOR=NEUTRAL,                                          X00185   
               LENGTH=4,                                               X00186   
               POS=(04,55)                                              00187**2
         DFHMDF ATTRB=(PROT),                                          X00188   
               INITIAL='UNACK',                                        X00189   
               COLOR=NEUTRAL,                                          X00190   
               LENGTH=5,                                               X00191   
               POS=(04,61)                                              00192**2
         DFHMDF ATTRB=(PROT),                                          X00131   
               INITIAL='STATUS',                                       X00132   
               COLOR=NEUTRAL,                                          X00133   
               LENGTH=6,                                               X00134   
               POS=(04,68)                                              00135**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00193   
*                                                                       00194   
*  SCREEN LINE 05                                                       00195**2
*                                                                       00196   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00197   
****************************************                                00198   
*  VARIABLE = ASEL01      X001                                          00199   
****************************************                                00200   
ASEL01   DFHMDF ATTRB=(UNPROT,NORM,IC),                                X00201**3
               COLOR=GREEN,                                            X00202   
               HILIGHT=UNDERLINE,                                      X00203   
               LENGTH=1,                                               X00204   
               POS=(05,2)                                               00205**2
         DFHMDF ATTRB=(ASKIP),                                         X00206   
               POS=(05,4),                                             X00207**2
               INITIAL=' ',                                            X00208   
               LENGTH=1                                                 00209   
****************************************                                00210   
*  VARIABLE = AACT01      X003                                          00211   
****************************************                                00212   
AACT01   DFHMDF ATTRB=(ASKIP),                                         X00213   
               LENGTH=3,                                               X00214   
               POS=(05,6)                                               00215**2
         DFHMDF ATTRB=(ASKIP),                                         X00216   
               POS=(05,10),                                            X00217**2
               INITIAL=' ',                                            X00218   
               LENGTH=1                                                 00219   
****************************************                                00220   
*  VARIABLE = VENDOR-NAME      X030                                     00221   
****************************************                                00222   
AVEND01  DFHMDF ATTRB=(PROT),                                          X00223**2
               LENGTH=30,                                              X00224   
               POS=(05,12)                                              00225**2
****************************************                                00226   
*  VARIABLE = FUNCTIONAL-GROUP-CO      N009                             00227   
****************************************                                00228   
AFGCN01  DFHMDF ATTRB=(PROT),                                          X00229**2
               JUSTIFY=(LEFT,BLANK),                                   X00230   
               PICOUT='ZZZZZZZZZ',                                     X00231   
               LENGTH=9,                                               X00232   
               POS=(05,43)                                              00233**2
         DFHMDF ATTRB=(ASKIP),                                         X00234   
               POS=(05,53),                                            X00235**2
               INITIAL=' ',                                            X00236   
               LENGTH=1                                                 00237   
****************************************                                00238   
*  VARIABLE = CODE      X003                                            00239   
****************************************                                00240   
ATSET01  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=3,                                               X00242   
               POS=(05,55)                                              00243**2
         DFHMDF ATTRB=(ASKIP),                                         X00244   
               POS=(05,59),                                            X00245**2
               INITIAL=' ',                                            X00246   
               LENGTH=1                                                 00247   
****************************************                                00248   
*  VARIABLE = DAYS-UNACKNOWLEDGED      X003                             00249   
****************************************                                00250   
ADAYS01  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=3,                                               X00252   
               POS=(05,62)                                              00253**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00254   
               INITIAL=' ',                                            X00255   
               LENGTH=1,                                               X00256   
               POS=(05,66)                                              00257**2
****************************************                                00248   
*  VARIABLE = PO ACKNOWLEDGED STATUS CDE X001                           00249   
****************************************                                00250   
ASCDE01  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=1,                                               X00252   
               POS=(05,70)                                              00253**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00254   
               INITIAL=' ',                                            X00255   
               LENGTH=1,                                               X00256   
               POS=(05,72)                                              00257**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00258   
*                                                                       00259   
*  SCREEN LINE 06                                                       00260**2
*                                                                       00261   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00262   
****************************************                                00263   
*  VARIABLE = ASEL02      X001                                          00264**2
****************************************                                00265   
ASEL02   DFHMDF ATTRB=(UNPROT,IC),                                     X00266**2
               COLOR=GREEN,                                            X00267   
               HILIGHT=UNDERLINE,                                      X00268   
               LENGTH=1,                                               X00269   
               POS=(06,2)                                               00270**2
         DFHMDF ATTRB=(ASKIP),                                         X00271   
               POS=(06,4),                                             X00272**2
               INITIAL=' ',                                            X00273   
               LENGTH=1                                                 00274   
****************************************                                00275   
*  VARIABLE = AACT02      X003                                          00276**2
****************************************                                00277   
AACT02   DFHMDF ATTRB=(ASKIP),                                         X00278**2
               LENGTH=3,                                               X00279   
               POS=(06,6)                                               00280**2
         DFHMDF ATTRB=(ASKIP),                                         X00281   
               POS=(06,10),                                            X00282**2
               INITIAL=' ',                                            X00283   
               LENGTH=1                                                 00284   
****************************************                                00285   
*  VARIABLE = VENDOR-NAME      X030                                     00286   
****************************************                                00287   
AVEND02  DFHMDF ATTRB=(PROT),                                          X00288**2
               LENGTH=30,                                              X00289   
               POS=(06,12)                                              00290**2
****************************************                                00291   
*  VARIABLE = FUNCTIONAL-GROUP-CO      N009                             00292   
****************************************                                00293   
AFGCN02  DFHMDF ATTRB=(PROT),                                          X00294**2
               JUSTIFY=(LEFT,BLANK),                                   X00295   
               PICOUT='ZZZZZZZZZ',                                     X00296   
               LENGTH=9,                                               X00297   
               POS=(06,43)                                              00298**2
         DFHMDF ATTRB=(ASKIP),                                         X00299   
               POS=(06,53),                                            X00300**2
               INITIAL=' ',                                            X00301   
               LENGTH=1                                                 00302   
****************************************                                00303   
*  VARIABLE = CODE      X003                                            00304   
****************************************                                00305   
ATSET02  DFHMDF ATTRB=(PROT),                                          X00306**2
               LENGTH=3,                                               X00307   
               POS=(06,55)                                              00308**2
         DFHMDF ATTRB=(ASKIP),                                         X00309   
               POS=(06,59),                                            X00310**2
               INITIAL=' ',                                            X00311   
               LENGTH=1                                                 00312   
****************************************                                00313   
*  VARIABLE = DAYS-UNACKNOWLEDGED      X003                             00314   
****************************************                                00315   
ADAYS02  DFHMDF ATTRB=(PROT),                                          X00316**2
               LENGTH=3,                                               X00317   
               POS=(06,62)                                              00318**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00319   
               INITIAL=' ',                                            X00320   
               LENGTH=1,                                               X00321   
               POS=(06,66)                                              00322**2
****************************************                                00248   
*  VARIABLE = PO ACKNOWLEDGED STATUS CDE X001                           00249   
****************************************                                00250   
ASCDE02  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=1,                                               X00252   
               POS=(06,70)                                              00253**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00254   
               INITIAL=' ',                                            X00255   
               LENGTH=1,                                               X00256   
               POS=(06,72)                                              00257**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00323   
*                                                                       00324   
*  SCREEN LINE 07                                                       00325**2
*                                                                       00326   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00327   
****************************************                                00328   
*  VARIABLE = ASEL03      X001                                          00329**2
****************************************                                00330   
ASEL03   DFHMDF ATTRB=(UNPROT,IC),                                     X00331**2
               COLOR=GREEN,                                            X00332   
               HILIGHT=UNDERLINE,                                      X00333   
               LENGTH=1,                                               X00334   
               POS=(07,2)                                               00335**2
         DFHMDF ATTRB=(ASKIP),                                         X00336   
               POS=(07,4),                                             X00337**2
               INITIAL=' ',                                            X00338   
               LENGTH=1                                                 00339   
****************************************                                00340   
*  VARIABLE = AACT03      X003                                          00341**2
****************************************                                00342   
AACT03   DFHMDF ATTRB=(ASKIP),                                         X00343**2
               LENGTH=3,                                               X00344   
               POS=(07,6)                                               00345**2
         DFHMDF ATTRB=(ASKIP),                                         X00346   
               POS=(07,10),                                            X00347**2
               INITIAL=' ',                                            X00348   
               LENGTH=1                                                 00349   
****************************************                                00350   
*  VARIABLE = VENDOR-NAME      X030                                     00351   
****************************************                                00352   
AVEND03  DFHMDF ATTRB=(PROT),                                          X00353**2
               LENGTH=30,                                              X00354   
               POS=(07,12)                                              00355**2
****************************************                                00356   
*  VARIABLE = FUNCTIONAL-GROUP-CO      N009                             00357   
****************************************                                00358   
AFGCN03  DFHMDF ATTRB=(PROT),                                          X00359**2
               JUSTIFY=(LEFT,BLANK),                                   X00360   
               PICOUT='ZZZZZZZZZ',                                     X00361   
               LENGTH=9,                                               X00362   
               POS=(07,43)                                              00363**2
         DFHMDF ATTRB=(ASKIP),                                         X00364   
               POS=(07,53),                                            X00365**2
               INITIAL=' ',                                            X00366   
               LENGTH=1                                                 00367   
****************************************                                00368   
*  VARIABLE = CODE      X003                                            00369   
****************************************                                00370   
ATSET03  DFHMDF ATTRB=(PROT),                                          X00371**2
               LENGTH=3,                                               X00372   
               POS=(07,55)                                              00373**2
         DFHMDF ATTRB=(ASKIP),                                         X00374   
               POS=(07,59),                                            X00375**2
               INITIAL=' ',                                            X00376   
               LENGTH=1                                                 00377   
****************************************                                00378   
*  VARIABLE = DAYS-UNACKNOWLEDGED      X003                             00379   
****************************************                                00380   
ADAYS03  DFHMDF ATTRB=(PROT),                                          X00381**2
               LENGTH=3,                                               X00382   
               POS=(07,62)                                              00383**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00384   
               INITIAL=' ',                                            X00385   
               LENGTH=1,                                               X00386   
               POS=(07,66)                                              00387**2
****************************************                                00248   
*  VARIABLE = PO ACKNOWLEDGED STATUS CDE X001                           00249   
****************************************                                00250   
ASCDE03  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=1,                                               X00252   
               POS=(07,70)                                              00253**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00254   
               INITIAL=' ',                                            X00255   
               LENGTH=1,                                               X00256   
               POS=(07,72)                                              00257**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00388   
*                                                                       00389   
*  SCREEN LINE 08                                                       00390**2
*                                                                       00391   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00392   
****************************************                                00393   
*  VARIABLE = ASEL04      X001                                          00394**2
****************************************                                00395   
ASEL04   DFHMDF ATTRB=(UNPROT,IC),                                     X00396**2
               COLOR=GREEN,                                            X00397   
               HILIGHT=UNDERLINE,                                      X00398   
               LENGTH=1,                                               X00399   
               POS=(08,2)                                               00400**2
         DFHMDF ATTRB=(ASKIP),                                         X00401   
               POS=(08,4),                                             X00402**2
               INITIAL=' ',                                            X00403   
               LENGTH=1                                                 00404   
****************************************                                00405   
*  VARIABLE = AACT04      X003                                          00406**2
****************************************                                00407   
AACT04   DFHMDF ATTRB=(ASKIP),                                         X00408**2
               LENGTH=3,                                               X00409   
               POS=(08,6)                                               00410**2
         DFHMDF ATTRB=(ASKIP),                                         X00411   
               POS=(08,10),                                            X00412**2
               INITIAL=' ',                                            X00413   
               LENGTH=1                                                 00414   
****************************************                                00415   
*  VARIABLE = VENDOR-NAME      X030                                     00416   
****************************************                                00417   
AVEND04  DFHMDF ATTRB=(PROT),                                          X00418**2
               LENGTH=30,                                              X00419   
               POS=(08,12)                                              00420**2
****************************************                                00421   
*  VARIABLE = FUNCTIONAL-GROUP-CO      N009                             00422   
****************************************                                00423   
AFGCN04  DFHMDF ATTRB=(PROT),                                          X00424**2
               JUSTIFY=(LEFT,BLANK),                                   X00425   
               PICOUT='ZZZZZZZZZ',                                     X00426   
               LENGTH=9,                                               X00427   
               POS=(08,43)                                              00428**2
         DFHMDF ATTRB=(ASKIP),                                         X00429   
               POS=(08,53),                                            X00430**2
               INITIAL=' ',                                            X00431   
               LENGTH=1                                                 00432   
****************************************                                00433   
*  VARIABLE = CODE      X003                                            00434   
****************************************                                00435   
ATSET04  DFHMDF ATTRB=(PROT),                                          X00436**2
               LENGTH=3,                                               X00437   
               POS=(08,55)                                              00438**2
         DFHMDF ATTRB=(ASKIP),                                         X00439   
               POS=(08,59),                                            X00440**2
               INITIAL=' ',                                            X00441   
               LENGTH=1                                                 00442   
****************************************                                00443   
*  VARIABLE = DAYS-UNACKNOWLEDGED      X003                             00444   
****************************************                                00445   
ADAYS04  DFHMDF ATTRB=(PROT),                                          X00446**2
               LENGTH=3,                                               X00447   
               POS=(08,62)                                              00448**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00449   
               INITIAL=' ',                                            X00450   
               LENGTH=1,                                               X00451   
               POS=(08,66)                                              00452**2
****************************************                                00248   
*  VARIABLE = PO ACKNOWLEDGED STATUS CDE X001                           00249   
****************************************                                00250   
ASCDE04  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=1,                                               X00252   
               POS=(08,70)                                              00253**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00254   
               INITIAL=' ',                                            X00255   
               LENGTH=1,                                               X00256   
               POS=(08,72)                                              00257**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00453   
*                                                                       00454   
*  SCREEN LINE 09                                                       00455**2
*                                                                       00456   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00457   
****************************************                                00458   
*  VARIABLE = ASEL05      X001                                          00459**2
****************************************                                00460   
ASEL05   DFHMDF ATTRB=(UNPROT,IC),                                     X00461**2
               COLOR=GREEN,                                            X00462   
               HILIGHT=UNDERLINE,                                      X00463   
               LENGTH=1,                                               X00464   
               POS=(09,2)                                               00465**2
         DFHMDF ATTRB=(ASKIP),                                         X00466   
               POS=(09,4),                                             X00467**2
               INITIAL=' ',                                            X00468   
               LENGTH=1                                                 00469   
****************************************                                00470   
*  VARIABLE = AACT05      X003                                          00471**2
****************************************                                00472   
AACT05   DFHMDF ATTRB=(ASKIP),                                         X00473**2
               LENGTH=3,                                               X00474   
               POS=(09,6)                                               00475**2
         DFHMDF ATTRB=(ASKIP),                                         X00476   
               POS=(09,10),                                            X00477**2
               INITIAL=' ',                                            X00478   
               LENGTH=1                                                 00479   
****************************************                                00480   
*  VARIABLE = VENDOR-NAME      X030                                     00481   
****************************************                                00482   
AVEND05  DFHMDF ATTRB=(PROT),                                          X00483**2
               LENGTH=30,                                              X00484   
               POS=(09,12)                                              00485**2
****************************************                                00486   
*  VARIABLE = FUNCTIONAL-GROUP-CO      N009                             00487   
****************************************                                00488   
AFGCN05  DFHMDF ATTRB=(PROT),                                          X00489**2
               JUSTIFY=(LEFT,BLANK),                                   X00490   
               PICOUT='ZZZZZZZZZ',                                     X00491   
               LENGTH=9,                                               X00492   
               POS=(09,43)                                              00493**2
         DFHMDF ATTRB=(ASKIP),                                         X00494   
               POS=(09,53),                                            X00495**2
               INITIAL=' ',                                            X00496   
               LENGTH=1                                                 00497   
****************************************                                00498   
*  VARIABLE = CODE      X003                                            00499   
****************************************                                00500   
ATSET05  DFHMDF ATTRB=(PROT),                                          X00501**2
               LENGTH=3,                                               X00502   
               POS=(09,55)                                              00503**2
         DFHMDF ATTRB=(ASKIP),                                         X00504   
               POS=(09,59),                                            X00505**2
               INITIAL=' ',                                            X00506   
               LENGTH=1                                                 00507   
****************************************                                00508   
*  VARIABLE = DAYS-UNACKNOWLEDGED      X003                             00509   
****************************************                                00510   
ADAYS05  DFHMDF ATTRB=(PROT),                                          X00511**2
               LENGTH=3,                                               X00512   
               POS=(09,62)                                              00513**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00514   
               INITIAL=' ',                                            X00515   
               LENGTH=1,                                               X00516   
               POS=(09,66)                                              00517**2
****************************************                                00248   
*  VARIABLE = PO ACKNOWLEDGED STATUS CDE X001                           00249   
****************************************                                00250   
ASCDE05  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=1,                                               X00252   
               POS=(09,70)                                              00253**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00254   
               INITIAL=' ',                                            X00255   
               LENGTH=1,                                               X00256   
               POS=(09,72)                                              00257**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00518   
*                                                                       00519   
*  SCREEN LINE 10                                                       00520**2
*                                                                       00521   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00522   
****************************************                                00523   
*  VARIABLE = ASEL06      X001                                          00524**2
****************************************                                00525   
ASEL06   DFHMDF ATTRB=(UNPROT,IC),                                     X00526**2
               COLOR=GREEN,                                            X00527   
               HILIGHT=UNDERLINE,                                      X00528   
               LENGTH=1,                                               X00529   
               POS=(10,2)                                               00530**2
         DFHMDF ATTRB=(ASKIP),                                         X00531   
               POS=(10,4),                                             X00532**2
               INITIAL=' ',                                            X00533   
               LENGTH=1                                                 00534   
****************************************                                00535   
*  VARIABLE = AACT06      X003                                          00536**2
****************************************                                00537   
AACT06   DFHMDF ATTRB=(ASKIP),                                         X00538**2
               LENGTH=3,                                               X00539   
               POS=(10,6)                                               00540**2
         DFHMDF ATTRB=(ASKIP),                                         X00541   
               POS=(10,10),                                            X00542**2
               INITIAL=' ',                                            X00543   
               LENGTH=1                                                 00544   
****************************************                                00545   
*  VARIABLE = VENDOR-NAME      X030                                     00546   
****************************************                                00547   
AVEND06  DFHMDF ATTRB=(PROT),                                          X00548**2
               LENGTH=30,                                              X00549   
               POS=(10,12)                                              00550**2
****************************************                                00551   
*  VARIABLE = FUNCTIONAL-GROUP-CO      N009                             00552   
****************************************                                00553   
AFGCN06  DFHMDF ATTRB=(PROT),                                          X00554**2
               JUSTIFY=(LEFT,BLANK),                                   X00555   
               PICOUT='ZZZZZZZZZ',                                     X00556   
               LENGTH=9,                                               X00557   
               POS=(10,43)                                              00558**2
         DFHMDF ATTRB=(ASKIP),                                         X00559   
               POS=(10,53),                                            X00560**2
               INITIAL=' ',                                            X00561   
               LENGTH=1                                                 00562   
****************************************                                00563   
*  VARIABLE = CODE      X003                                            00564   
****************************************                                00565   
ATSET06  DFHMDF ATTRB=(PROT),                                          X00566**2
               LENGTH=3,                                               X00567   
               POS=(10,55)                                              00568**2
         DFHMDF ATTRB=(ASKIP),                                         X00569   
               POS=(10,59),                                            X00570**2
               INITIAL=' ',                                            X00571   
               LENGTH=1                                                 00572   
****************************************                                00573   
*  VARIABLE = DAYS-UNACKNOWLEDGED      X003                             00574   
****************************************                                00575   
ADAYS06  DFHMDF ATTRB=(PROT),                                          X00576**2
               LENGTH=3,                                               X00577   
               POS=(10,62)                                              00578**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00579   
               INITIAL=' ',                                            X00580   
               LENGTH=1,                                               X00581   
               POS=(10,66)                                              00582**2
****************************************                                00248   
*  VARIABLE = PO ACKNOWLEDGED STATUS CDE X001                           00249   
****************************************                                00250   
ASCDE06  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=1,                                               X00252   
               POS=(10,70)                                              00253**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00254   
               INITIAL=' ',                                            X00255   
               LENGTH=1,                                               X00256   
               POS=(10,72)                                              00257**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00583   
*                                                                       00584   
*  SCREEN LINE 11                                                       00585**2
*                                                                       00586   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00587   
****************************************                                00588   
*  VARIABLE = ASEL07      X001                                          00589**2
****************************************                                00590   
ASEL07   DFHMDF ATTRB=(UNPROT,IC),                                     X00591**2
               COLOR=GREEN,                                            X00592   
               HILIGHT=UNDERLINE,                                      X00593   
               LENGTH=1,                                               X00594   
               POS=(11,2)                                               00595**2
         DFHMDF ATTRB=(ASKIP),                                         X00596   
               POS=(11,4),                                             X00597**2
               INITIAL=' ',                                            X00598   
               LENGTH=1                                                 00599   
****************************************                                00600   
*  VARIABLE = AACT07      X003                                          00601**2
****************************************                                00602   
AACT07   DFHMDF ATTRB=(ASKIP),                                         X00603**2
               LENGTH=3,                                               X00604   
               POS=(11,6)                                               00605**2
         DFHMDF ATTRB=(ASKIP),                                         X00606   
               POS=(11,10),                                            X00607**2
               INITIAL=' ',                                            X00608   
               LENGTH=1                                                 00609   
****************************************                                00610   
*  VARIABLE = VENDOR-NAME      X030                                     00611   
****************************************                                00612   
AVEND07  DFHMDF ATTRB=(PROT),                                          X00613**2
               LENGTH=30,                                              X00614   
               POS=(11,12)                                              00615**2
****************************************                                00616   
*  VARIABLE = FUNCTIONAL-GROUP-CO      N009                             00617   
****************************************                                00618   
AFGCN07  DFHMDF ATTRB=(PROT),                                          X00619**2
               JUSTIFY=(LEFT,BLANK),                                   X00620   
               PICOUT='ZZZZZZZZZ',                                     X00621   
               LENGTH=9,                                               X00622   
               POS=(11,43)                                              00623**2
         DFHMDF ATTRB=(ASKIP),                                         X00624   
               POS=(11,53),                                            X00625**2
               INITIAL=' ',                                            X00626   
               LENGTH=1                                                 00627   
****************************************                                00628   
*  VARIABLE = CODE      X003                                            00629   
****************************************                                00630   
ATSET07  DFHMDF ATTRB=(PROT),                                          X00631**2
               LENGTH=3,                                               X00632   
               POS=(11,55)                                              00633**2
         DFHMDF ATTRB=(ASKIP),                                         X00634   
               POS=(11,59),                                            X00635**2
               INITIAL=' ',                                            X00636   
               LENGTH=1                                                 00637   
****************************************                                00638   
*  VARIABLE = DAYS-UNACKNOWLEDGED      X003                             00639   
****************************************                                00640   
ADAYS07  DFHMDF ATTRB=(PROT),                                          X00641**2
               LENGTH=3,                                               X00642   
               POS=(11,62)                                              00643**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00644   
               INITIAL=' ',                                            X00645   
               LENGTH=1,                                               X00646   
               POS=(11,66)                                              00647**2
****************************************                                00248   
*  VARIABLE = PO ACKNOWLEDGED STATUS CDE X001                           00249   
****************************************                                00250   
ASCDE07  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=1,                                               X00252   
               POS=(11,70)                                              00253**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00254   
               INITIAL=' ',                                            X00255   
               LENGTH=1,                                               X00256   
               POS=(11,72)                                              00257**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00648   
*                                                                       00649   
*  SCREEN LINE 12                                                       00650**2
*                                                                       00651   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00652   
****************************************                                00653   
*  VARIABLE = ASEL08      X001                                          00654**2
****************************************                                00655   
ASEL08   DFHMDF ATTRB=(UNPROT,IC),                                     X00656**2
               COLOR=GREEN,                                            X00657   
               HILIGHT=UNDERLINE,                                      X00658   
               LENGTH=1,                                               X00659   
               POS=(12,2)                                               00660**2
         DFHMDF ATTRB=(ASKIP),                                         X00661   
               POS=(12,4),                                             X00662**2
               INITIAL=' ',                                            X00663   
               LENGTH=1                                                 00664   
****************************************                                00665   
*  VARIABLE = AACT08      X003                                          00666**2
****************************************                                00667   
AACT08   DFHMDF ATTRB=(ASKIP),                                         X00668**2
               LENGTH=3,                                               X00669   
               POS=(12,6)                                               00670**2
         DFHMDF ATTRB=(ASKIP),                                         X00671   
               POS=(12,10),                                            X00672**2
               INITIAL=' ',                                            X00673   
               LENGTH=1                                                 00674   
****************************************                                00675   
*  VARIABLE = VENDOR-NAME      X030                                     00676   
****************************************                                00677   
AVEND08  DFHMDF ATTRB=(PROT),                                          X00678**2
               LENGTH=30,                                              X00679   
               POS=(12,12)                                              00680**2
****************************************                                00681   
*  VARIABLE = FUNCTIONAL-GROUP-CO      N009                             00682   
****************************************                                00683   
AFGCN08  DFHMDF ATTRB=(PROT),                                          X00684**2
               JUSTIFY=(LEFT,BLANK),                                   X00685   
               PICOUT='ZZZZZZZZZ',                                     X00686   
               LENGTH=9,                                               X00687   
               POS=(12,43)                                              00688**2
         DFHMDF ATTRB=(ASKIP),                                         X00689   
               POS=(12,53),                                            X00690**2
               INITIAL=' ',                                            X00691   
               LENGTH=1                                                 00692   
****************************************                                00693   
*  VARIABLE = CODE      X003                                            00694   
****************************************                                00695   
ATSET08  DFHMDF ATTRB=(PROT),                                          X00696**2
               LENGTH=3,                                               X00697   
               POS=(12,55)                                              00698**2
         DFHMDF ATTRB=(ASKIP),                                         X00699   
               POS=(12,59),                                            X00700**2
               INITIAL=' ',                                            X00701   
               LENGTH=1                                                 00702   
****************************************                                00703   
*  VARIABLE = DAYS-UNACKNOWLEDGED      X003                             00704   
****************************************                                00705   
ADAYS08  DFHMDF ATTRB=(PROT),                                          X00706**2
               LENGTH=3,                                               X00707   
               POS=(12,62)                                              00708**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00709   
               INITIAL=' ',                                            X00710   
               LENGTH=1,                                               X00711   
               POS=(12,66)                                              00712**2
****************************************                                00248   
*  VARIABLE = PO ACKNOWLEDGED STATUS CDE X001                           00249   
****************************************                                00250   
ASCDE08  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=1,                                               X00252   
               POS=(12,70)                                              00253**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00254   
               INITIAL=' ',                                            X00255   
               LENGTH=1,                                               X00256   
               POS=(12,72)                                              00257**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00713   
*                                                                       00714   
*  SCREEN LINE 13                                                       00715**2
*                                                                       00716   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00717   
****************************************                                00718   
*  VARIABLE = ASEL09      X001                                          00719**2
****************************************                                00720   
ASEL09   DFHMDF ATTRB=(UNPROT,IC),                                     X00721**2
               COLOR=GREEN,                                            X00722   
               HILIGHT=UNDERLINE,                                      X00723   
               LENGTH=1,                                               X00724   
               POS=(13,2)                                               00725**2
         DFHMDF ATTRB=(ASKIP),                                         X00726   
               POS=(13,4),                                             X00727**2
               INITIAL=' ',                                            X00728   
               LENGTH=1                                                 00729   
****************************************                                00730   
*  VARIABLE = AACT09      X003                                          00731**2
****************************************                                00732   
AACT09   DFHMDF ATTRB=(ASKIP),                                         X00733**2
               LENGTH=3,                                               X00734   
               POS=(13,6)                                               00735**2
         DFHMDF ATTRB=(ASKIP),                                         X00736   
               POS=(13,10),                                            X00737**2
               INITIAL=' ',                                            X00738   
               LENGTH=1                                                 00739   
****************************************                                00740   
*  VARIABLE = VENDOR-NAME      X030                                     00741   
****************************************                                00742   
AVEND09  DFHMDF ATTRB=(PROT),                                          X00743**2
               LENGTH=30,                                              X00744   
               POS=(13,12)                                              00745**2
****************************************                                00746   
*  VARIABLE = FUNCTIONAL-GROUP-CO      N009                             00747   
****************************************                                00748   
AFGCN09  DFHMDF ATTRB=(PROT),                                          X00749**2
               JUSTIFY=(LEFT,BLANK),                                   X00750   
               PICOUT='ZZZZZZZZZ',                                     X00751   
               LENGTH=9,                                               X00752   
               POS=(13,43)                                              00753**2
         DFHMDF ATTRB=(ASKIP),                                         X00754   
               POS=(13,53),                                            X00755**2
               INITIAL=' ',                                            X00756   
               LENGTH=1                                                 00757   
****************************************                                00758   
*  VARIABLE = CODE      X003                                            00759   
****************************************                                00760   
ATSET09  DFHMDF ATTRB=(PROT),                                          X00761**2
               LENGTH=3,                                               X00762   
               POS=(13,55)                                              00763**2
         DFHMDF ATTRB=(ASKIP),                                         X00764   
               POS=(13,59),                                            X00765**2
               INITIAL=' ',                                            X00766   
               LENGTH=1                                                 00767   
****************************************                                00768   
*  VARIABLE = DAYS-UNACKNOWLEDGED      X003                             00769   
****************************************                                00770   
ADAYS09  DFHMDF ATTRB=(PROT),                                          X00771**2
               LENGTH=3,                                               X00772   
               POS=(13,62)                                              00773**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00774   
               INITIAL=' ',                                            X00775   
               LENGTH=1,                                               X00776   
               POS=(13,66)                                              00777**2
****************************************                                00248   
*  VARIABLE = PO ACKNOWLEDGED STATUS CDE X001                           00249   
****************************************                                00250   
ASCDE09  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=1,                                               X00252   
               POS=(13,70)                                              00253**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00254   
               INITIAL=' ',                                            X00255   
               LENGTH=1,                                               X00256   
               POS=(13,72)                                              00257**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00778   
*                                                                       00779   
*  SCREEN LINE 14                                                       00780**2
*                                                                       00781   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00782   
****************************************                                00783   
*  VARIABLE = ASEL10      X001                                          00784**2
****************************************                                00785   
ASEL10   DFHMDF ATTRB=(UNPROT,IC),                                     X00786**2
               COLOR=GREEN,                                            X00787   
               HILIGHT=UNDERLINE,                                      X00788   
               LENGTH=1,                                               X00789   
               POS=(14,2)                                               00790**2
         DFHMDF ATTRB=(ASKIP),                                         X00791   
               POS=(14,4),                                             X00792**2
               INITIAL=' ',                                            X00793   
               LENGTH=1                                                 00794   
****************************************                                00795   
*  VARIABLE = AACT10      X003                                          00796**2
****************************************                                00797   
AACT10   DFHMDF ATTRB=(ASKIP),                                         X00798**2
               LENGTH=3,                                               X00799   
               POS=(14,6)                                               00800**2
         DFHMDF ATTRB=(ASKIP),                                         X00801   
               POS=(14,10),                                            X00802**2
               INITIAL=' ',                                            X00803   
               LENGTH=1                                                 00804   
****************************************                                00805   
*  VARIABLE = VENDOR-NAME      X030                                     00806   
****************************************                                00807   
AVEND10  DFHMDF ATTRB=(PROT),                                          X00808**2
               LENGTH=30,                                              X00809   
               POS=(14,12)                                              00810**2
****************************************                                00811   
*  VARIABLE = FUNCTIONAL-GROUP-CO      N009                             00812   
****************************************                                00813   
AFGCN10  DFHMDF ATTRB=(PROT),                                          X00814**2
               JUSTIFY=(LEFT,BLANK),                                   X00815   
               PICOUT='ZZZZZZZZZ',                                     X00816   
               LENGTH=9,                                               X00817   
               POS=(14,43)                                              00818**2
         DFHMDF ATTRB=(ASKIP),                                         X00819   
               POS=(14,53),                                            X00820**2
               INITIAL=' ',                                            X00821   
               LENGTH=1                                                 00822   
****************************************                                00823   
*  VARIABLE = CODE      X003                                            00824   
****************************************                                00825   
ATSET10  DFHMDF ATTRB=(PROT),                                          X00826**2
               LENGTH=3,                                               X00827   
               POS=(14,55)                                              00828**2
         DFHMDF ATTRB=(ASKIP),                                         X00829   
               POS=(14,59),                                            X00830**2
               INITIAL=' ',                                            X00831   
               LENGTH=1                                                 00832   
****************************************                                00833   
*  VARIABLE = DAYS-UNACKNOWLEDGED      X003                             00834   
****************************************                                00835   
ADAYS10  DFHMDF ATTRB=(PROT),                                          X00836**2
               LENGTH=3,                                               X00837   
               POS=(14,62)                                              00838**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00839   
               INITIAL=' ',                                            X00840   
               LENGTH=1,                                               X00841   
               POS=(14,66)                                              00842**2
****************************************                                00248   
*  VARIABLE = PO ACKNOWLEDGED STATUS CDE X001                           00249   
****************************************                                00250   
ASCDE10  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=1,                                               X00252   
               POS=(14,70)                                              00253**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00254   
               INITIAL=' ',                                            X00255   
               LENGTH=1,                                               X00256   
               POS=(14,72)                                              00257**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00843   
*                                                                       00844   
*  SCREEN LINE 15                                                       00845**2
*                                                                       00846   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00847   
****************************************                                00848   
*  VARIABLE = ASEL11      X001                                          00849**2
****************************************                                00850   
ASEL11   DFHMDF ATTRB=(UNPROT,IC),                                     X00851**2
               COLOR=GREEN,                                            X00852   
               HILIGHT=UNDERLINE,                                      X00853   
               LENGTH=1,                                               X00854   
               POS=(15,2)                                               00855**2
         DFHMDF ATTRB=(ASKIP),                                         X00856   
               POS=(15,4),                                             X00857**2
               INITIAL=' ',                                            X00858   
               LENGTH=1                                                 00859   
****************************************                                00860   
*  VARIABLE = AACT11      X003                                          00861**2
****************************************                                00862   
AACT11   DFHMDF ATTRB=(ASKIP),                                         X00863**2
               LENGTH=3,                                               X00864   
               POS=(15,6)                                               00865**2
         DFHMDF ATTRB=(ASKIP),                                         X00866   
               POS=(15,10),                                            X00867**2
               INITIAL=' ',                                            X00868   
               LENGTH=1                                                 00869   
****************************************                                00870   
*  VARIABLE = VENDOR-NAME      X030                                     00871   
****************************************                                00872   
AVEND11  DFHMDF ATTRB=(PROT),                                          X00873**2
               LENGTH=30,                                              X00874   
               POS=(15,12)                                              00875**2
****************************************                                00876   
*  VARIABLE = FUNCTIONAL-GROUP-CO      N009                             00877   
****************************************                                00878   
AFGCN11  DFHMDF ATTRB=(PROT),                                          X00879**2
               JUSTIFY=(LEFT,BLANK),                                   X00880   
               PICOUT='ZZZZZZZZZ',                                     X00881   
               LENGTH=9,                                               X00882   
               POS=(15,43)                                              00883**2
         DFHMDF ATTRB=(ASKIP),                                         X00884   
               POS=(15,53),                                            X00885**2
               INITIAL=' ',                                            X00886   
               LENGTH=1                                                 00887   
****************************************                                00888   
*  VARIABLE = CODE      X003                                            00889   
****************************************                                00890   
ATSET11  DFHMDF ATTRB=(PROT),                                          X00891**2
               LENGTH=3,                                               X00892   
               POS=(15,55)                                              00893**2
         DFHMDF ATTRB=(ASKIP),                                         X00894   
               POS=(15,59),                                            X00895**2
               INITIAL=' ',                                            X00896   
               LENGTH=1                                                 00897   
****************************************                                00898   
*  VARIABLE = DAYS-UNACKNOWLEDGED      X003                             00899   
****************************************                                00900   
ADAYS11  DFHMDF ATTRB=(PROT),                                          X00901**2
               LENGTH=3,                                               X00902   
               POS=(15,62)                                              00903**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00904   
               INITIAL=' ',                                            X00905   
               LENGTH=1,                                               X00906   
               POS=(15,66)                                              00907**2
****************************************                                00248   
*  VARIABLE = PO ACKNOWLEDGED STATUS CDE X001                           00249   
****************************************                                00250   
ASCDE11  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=1,                                               X00252   
               POS=(15,70)                                              00253**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00254   
               INITIAL=' ',                                            X00255   
               LENGTH=1,                                               X00256   
               POS=(15,72)                                              00257**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00908   
*                                                                       00909   
*  SCREEN LINE 16                                                       00910**2
*                                                                       00911   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00912   
****************************************                                00913   
*  VARIABLE = ASEL12      X001                                          00914**2
****************************************                                00915   
ASEL12   DFHMDF ATTRB=(UNPROT,IC),                                     X00916**2
               COLOR=GREEN,                                            X00917   
               HILIGHT=UNDERLINE,                                      X00918   
               LENGTH=1,                                               X00919   
               POS=(16,2)                                               00920**2
         DFHMDF ATTRB=(ASKIP),                                         X00921   
               POS=(16,4),                                             X00922**2
               INITIAL=' ',                                            X00923   
               LENGTH=1                                                 00924   
****************************************                                00925   
*  VARIABLE = AACT12      X003                                          00926**2
****************************************                                00927   
AACT12   DFHMDF ATTRB=(ASKIP),                                         X00928**2
               LENGTH=3,                                               X00929   
               POS=(16,6)                                               00930**2
         DFHMDF ATTRB=(ASKIP),                                         X00931   
               POS=(16,10),                                            X00932**2
               INITIAL=' ',                                            X00933   
               LENGTH=1                                                 00934   
****************************************                                00935   
*  VARIABLE = VENDOR-NAME      X030                                     00936   
****************************************                                00937   
AVEND12  DFHMDF ATTRB=(PROT),                                          X00938**2
               LENGTH=30,                                              X00939   
               POS=(16,12)                                              00940**2
****************************************                                00941   
*  VARIABLE = FUNCTIONAL-GROUP-CO      N009                             00942   
****************************************                                00943   
AFGCN12  DFHMDF ATTRB=(PROT),                                          X00944**2
               JUSTIFY=(LEFT,BLANK),                                   X00945   
               PICOUT='ZZZZZZZZZ',                                     X00946   
               LENGTH=9,                                               X00947   
               POS=(16,43)                                              00948**2
         DFHMDF ATTRB=(ASKIP),                                         X00949   
               POS=(16,53),                                            X00950**2
               INITIAL=' ',                                            X00951   
               LENGTH=1                                                 00952   
****************************************                                00953   
*  VARIABLE = CODE      X003                                            00954   
****************************************                                00955   
ATSET12  DFHMDF ATTRB=(PROT),                                          X00956**2
               LENGTH=3,                                               X00957   
               POS=(16,55)                                              00958**2
         DFHMDF ATTRB=(ASKIP),                                         X00959   
               POS=(16,59),                                            X00960**2
               INITIAL=' ',                                            X00961   
               LENGTH=1                                                 00962   
****************************************                                00963   
*  VARIABLE = DAYS-UNACKNOWLEDGED      X003                             00964   
****************************************                                00965   
ADAYS12  DFHMDF ATTRB=(PROT),                                          X00966**2
               LENGTH=3,                                               X00967   
               POS=(16,62)                                              00968**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00969   
               INITIAL=' ',                                            X00970   
               LENGTH=1,                                               X00971   
               POS=(16,66)                                              00972**2
****************************************                                00248   
*  VARIABLE = PO ACKNOWLEDGED STATUS CDE X001                           00249   
****************************************                                00250   
ASCDE12  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=1,                                               X00252   
               POS=(16,70)                                              00253**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00254   
               INITIAL=' ',                                            X00255   
               LENGTH=1,                                               X00256   
               POS=(16,72)                                              00257**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00973   
*                                                                       00974   
*  SCREEN LINE 17                                                       00975**2
*                                                                       00976   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00977   
****************************************                                00978   
*  VARIABLE = ASEL13      X001                                          00979**2
****************************************                                00980   
ASEL13   DFHMDF ATTRB=(UNPROT,IC),                                     X00981**2
               COLOR=GREEN,                                            X00982   
               HILIGHT=UNDERLINE,                                      X00983   
               LENGTH=1,                                               X00984   
               POS=(17,2)                                               00985**2
         DFHMDF ATTRB=(ASKIP),                                         X00986   
               POS=(17,4),                                             X00987**2
               INITIAL=' ',                                            X00988   
               LENGTH=1                                                 00989   
****************************************                                00990   
*  VARIABLE = AACT13      X003                                          00991**2
****************************************                                00992   
AACT13   DFHMDF ATTRB=(ASKIP),                                         X00993**2
               LENGTH=3,                                               X00994   
               POS=(17,6)                                               00995**2
         DFHMDF ATTRB=(ASKIP),                                         X00996   
               POS=(17,10),                                            X00997**2
               INITIAL=' ',                                            X00998   
               LENGTH=1                                                 00999   
****************************************                                01000   
*  VARIABLE = VENDOR-NAME      X030                                     01001   
****************************************                                01002   
AVEND13  DFHMDF ATTRB=(PROT),                                          X01003**2
               LENGTH=30,                                              X01004   
               POS=(17,12)                                              01005**2
****************************************                                01006   
*  VARIABLE = FUNCTIONAL-GROUP-CO      N009                             01007   
****************************************                                01008   
AFGCN13  DFHMDF ATTRB=(PROT),                                          X01009**2
               JUSTIFY=(LEFT,BLANK),                                   X01010   
               PICOUT='ZZZZZZZZZ',                                     X01011   
               LENGTH=9,                                               X01012   
               POS=(17,43)                                              01013**2
         DFHMDF ATTRB=(ASKIP),                                         X01014   
               POS=(17,53),                                            X01015**2
               INITIAL=' ',                                            X01016   
               LENGTH=1                                                 01017   
****************************************                                01018   
*  VARIABLE = CODE      X003                                            01019   
****************************************                                01020   
ATSET13  DFHMDF ATTRB=(PROT),                                          X01021**2
               LENGTH=3,                                               X01022   
               POS=(17,55)                                              01023**2
         DFHMDF ATTRB=(ASKIP),                                         X01024   
               POS=(17,59),                                            X01025**2
               INITIAL=' ',                                            X01026   
               LENGTH=1                                                 01027   
****************************************                                01028   
*  VARIABLE = DAYS-UNACKNOWLEDGED      X003                             01029   
****************************************                                01030   
ADAYS13  DFHMDF ATTRB=(PROT),                                          X01031**2
               LENGTH=3,                                               X01032   
               POS=(17,62)                                              01033**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X01034   
               INITIAL=' ',                                            X01035   
               LENGTH=1,                                               X01036   
               POS=(17,66)                                              01037**2
****************************************                                00248   
*  VARIABLE = PO ACKNOWLEDGED STATUS CDE X001                           00249   
****************************************                                00250   
ASCDE13  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=1,                                               X00252   
               POS=(17,70)                                              00253**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00254   
               INITIAL=' ',                                            X00255   
               LENGTH=1,                                               X00256   
               POS=(17,72)                                              00257**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 01038   
*                                                                       01039   
*  SCREEN LINE 18                                                       01040**2
*                                                                       01041   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 01042   
****************************************                                01043   
*  VARIABLE = ASEL14      X001                                          01044**2
****************************************                                01045   
ASEL14   DFHMDF ATTRB=(UNPROT,IC),                                     X01046**2
               COLOR=GREEN,                                            X01047   
               HILIGHT=UNDERLINE,                                      X01048   
               LENGTH=1,                                               X01049   
               POS=(18,2)                                               01050**2
         DFHMDF ATTRB=(ASKIP),                                         X01051   
               POS=(18,4),                                             X01052**2
               INITIAL=' ',                                            X01053   
               LENGTH=1                                                 01054   
****************************************                                01055   
*  VARIABLE = AACT14      X003                                          01056**2
****************************************                                01057   
AACT14   DFHMDF ATTRB=(ASKIP),                                         X01058**2
               LENGTH=3,                                               X01059   
               POS=(18,6)                                               01060**2
         DFHMDF ATTRB=(ASKIP),                                         X01061   
               POS=(18,10),                                            X01062**2
               INITIAL=' ',                                            X01063   
               LENGTH=1                                                 01064   
****************************************                                01065   
*  VARIABLE = VENDOR-NAME      X030                                     01066   
****************************************                                01067   
AVEND14  DFHMDF ATTRB=(PROT),                                          X01068**2
               LENGTH=30,                                              X01069   
               POS=(18,12)                                              01070**2
****************************************                                01071   
*  VARIABLE = FUNCTIONAL-GROUP-CO      N009                             01072   
****************************************                                01073   
AFGCN14  DFHMDF ATTRB=(PROT),                                          X01074**2
               JUSTIFY=(LEFT,BLANK),                                   X01075   
               PICOUT='ZZZZZZZZZ',                                     X01076   
               LENGTH=9,                                               X01077   
               POS=(18,43)                                              01078**2
         DFHMDF ATTRB=(ASKIP),                                         X01079   
               POS=(18,53),                                            X01080**2
               INITIAL=' ',                                            X01081   
               LENGTH=1                                                 01082   
****************************************                                01083   
*  VARIABLE = CODE      X003                                            01084   
****************************************                                01085   
ATSET14  DFHMDF ATTRB=(PROT),                                          X01086**2
               LENGTH=3,                                               X01087   
               POS=(18,55)                                              01088**2
         DFHMDF ATTRB=(ASKIP),                                         X01089   
               POS=(18,59),                                            X01090**2
               INITIAL=' ',                                            X01091   
               LENGTH=1                                                 01092   
****************************************                                01093   
*  VARIABLE = DAYS-UNACKNOWLEDGED      X003                             01094   
****************************************                                01095   
ADAYS14  DFHMDF ATTRB=(PROT),                                          X01096**2
               LENGTH=3,                                               X01097   
               POS=(18,62)                                              01098**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X01099   
               INITIAL=' ',                                            X01100   
               LENGTH=1,                                               X01101   
               POS=(18,66)                                              01102**2
****************************************                                00248   
*  VARIABLE = PO ACKNOWLEDGED STATUS CDE X001                           00249   
****************************************                                00250   
ASCDE14  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=1,                                               X00252   
               POS=(18,70)                                              00253**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00254   
               INITIAL=' ',                                            X00255   
               LENGTH=1,                                               X00256   
               POS=(18,72)                                              00257**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 01103   
*                                                                       01104   
*  SCREEN LINE 19                                                       01105**2
*                                                                       01106   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 01107   
         DFHMDF ATTRB=(ASKIP),                                         X01108   
               POS=(19,1),                                             X01109**2
               INITIAL=' ',                                            X01110   
               LENGTH=1                                                 01111   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X01112   
               INITIAL='NUMBER',                                       X01113   
               COLOR=NEUTRAL,                                          X01114   
               LENGTH=6,                                               X01115   
               POS=(19,39)                                              01116**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X01117   
               INITIAL='OF',                                           X01118   
               COLOR=NEUTRAL,                                          X01119   
               LENGTH=2,                                               X01120   
               POS=(19,46)                                              01121**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X01122   
               INITIAL='SELECTED',                                     X01123   
               COLOR=NEUTRAL,                                          X01124   
               LENGTH=8,                                               X01125   
               POS=(19,49)                                              01126**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X01127   
               INITIAL='ITEMS:',                                       X01128   
               COLOR=NEUTRAL,                                          X01129   
               LENGTH=6,                                               X01130   
               POS=(19,58)                                              01131**2
         DFHMDF ATTRB=(ASKIP),                                         X01132   
               POS=(19,65),                                            X01133**2
               INITIAL=' ',                                            X01134   
               LENGTH=1                                                 01135   
****************************************                                01136   
*  VARIABLE = ASELIT      N007                                          01137   
****************************************                                01138   
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X01139   
               JUSTIFY=(LEFT,BLANK),                                   X01140   
               COLOR=BLUE,                                             X01141   
               PICOUT='ZZZZZZZ',                                       X01142   
               LENGTH=7,                                               X01143   
               POS=(19,67)                                              01144**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X01145   
               INITIAL=' ',                                            X01146   
               LENGTH=1,                                               X01147   
               POS=(19,75)                                              01148**2
         DFHMSD TYPE=FINAL                                              01149   
         END                                                            01150   
