*          DATA SET ETKM338    AT LEVEL 009 AS OF 03/01/94                      
  PRINT  NOGEN                                                          00001   
************************************************************            00002   
*  BMS MAPSET :  ETKM338 - UPC CATALOG VENDOR ID LIST                   00003   
*      MAP    :  ET338A                                                 00004   
************************************************************            00005   
ETKM338  DFHMSD TYPE=DSECT,                                            X00006   
               CTRL=(FREEKB),                                          X00007   
               TERM=3270-2,                                            X00008   
               LANG=COBOL,                                             X00009   
               MODE=INOUT,                                             X00010   
               TIOAPFX=YES,                                            X00011   
               STORAGE=AUTO                                             00012   
ET338A   DFHMDI LINE=2,                                                X00013   
               COLUMN=1,                                               X00014   
               SIZE=(19,80),                                           X00015   
               MAPATTS=(COLOR,HILIGHT),                                X00016   
               DSATTS=(COLOR,HILIGHT)                                   00017   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00018   
*  SCREEN LINE 03                                                       00019   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00020   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00021   
               INITIAL='ITEMS',                                        X00022   
               COLOR=NEUTRAL,                                          X00023   
               LENGTH=5,                                               X00024   
               POS=(02,44)                                              00025   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00026   
               JUSTIFY=(LEFT,BLANK),                                   X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICOUT='ZZZ,ZZ9',                                       X00030   
               LENGTH=7,                                               X00031   
               POS=(02,50)                                              00032   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00033   
               INITIAL='TO',                                           X00034   
               COLOR=NEUTRAL,                                          X00035   
               LENGTH=2,                                               X00036   
               POS=(02,58)                                              00037   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00038   
               JUSTIFY=(LEFT,BLANK),                                   X00039   
               COLOR=BLUE,                                             X00040   
               PICOUT='ZZZ,ZZ9',                                       X00041   
               LENGTH=7,                                               X00042   
               POS=(02,61)                                              00043   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00044   
               INITIAL='OF',                                           X00045   
               COLOR=NEUTRAL,                                          X00046   
               LENGTH=2,                                               X00047   
               POS=(02,69)                                              00048   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00049   
               JUSTIFY=(LEFT,BLANK),                                   X00050   
               COLOR=BLUE,                                             X00051   
               PICOUT='ZZZ,ZZ9',                                       X00052   
               LENGTH=7,                                               X00053   
               POS=(02,72)                                              00054   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00055   
*  SCREEN LINE 05                                                       00056   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00057   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00058   
               INITIAL='UPC CATALOG',                                  X00059   
               COLOR=NEUTRAL,                                          X00060   
               LENGTH=11,                                              X00061   
               POS=(04,41)                                              00062   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00058   
               INITIAL='NRF',                                          X00059   
               COLOR=NEUTRAL,                                          X00060   
               LENGTH=3,                                               X00061   
               POS=(04,76)                                              00062   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00063   
*  SCREEN LINE 06                                                       00064   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00065   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00066**4
               INITIAL='SEL',                                          X00067**4
               COLOR=NEUTRAL,                                          X00068**4
               LENGTH=3,                                               X00069**4
               POS=(05,1)                                               00070**4
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00071**4
               INITIAL='ACT',                                          X00072**4
               COLOR=NEUTRAL,                                          X00073**4
               LENGTH=3,                                               X00074**4
               POS=(05,5)                                               00075**4
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00076   
               INITIAL='VENDOR NAME',                                  X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=11,                                              X00079   
               POS=(05,10)                                              00080**4
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00081   
               INITIAL='VENDOR ID',                                    X00082   
               COLOR=NEUTRAL,                                          X00083   
               LENGTH=9,                                               X00084   
               POS=(05,41)                                              00085   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00086   
               INITIAL='NETWORK',                                      X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=7,                                               X00089   
               POS=(05,54)                                              00090   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00091   
               INITIAL='PREF',                                         X00092   
               COLOR=NEUTRAL,                                          X00093   
               LENGTH=4,                                               X00094   
               POS=(05,70)                                              00095   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00091   
               INITIAL='COMP',                                         X00092   
               COLOR=NEUTRAL,                                          X00093   
               LENGTH=4,                                               X00094   
               POS=(05,75)                                              00095   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00096   
*  SCREEN LINE 08                                                       00097   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00098   
ASEL01   DFHMDF ATTRB=(UNPROT,IC),                                     X00099   
               COLOR=GREEN,                                            X00100   
               HILIGHT=UNDERLINE,                                      X00101   
               LENGTH=1,                                               X00102   
               POS=(07,2)                                               00103   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00104**5
               INITIAL=' ',                                            X00105**5
               LENGTH=1,                                               X00106**5
               POS=(07,4)                                               00107**5
AACT01   DFHMDF ATTRB=(ASKIP),                                         X00108   
               COLOR=BLUE,                                             X00109   
               LENGTH=3,                                               X00110   
               POS=(07,6)                                               00111**5
AVNME01  DFHMDF ATTRB=(ASKIP),                                         X00112   
               JUSTIFY=(LEFT,BLANK),                                   X00113   
               COLOR=BLUE,                                             X00114   
               LENGTH=26,                                              X00115**8
               POS=(07,11)                                              00116**6
AVNID01  DFHMDF ATTRB=(ASKIP),                                         X00117   
               JUSTIFY=(LEFT,BLANK),                                   X00118   
               COLOR=BLUE,                                             X00119   
               LENGTH=15,                                              X00120   
               POS=(07,38)                                              00121**6
ANTWK01  DFHMDF ATTRB=(ASKIP),                                         X00122   
               JUSTIFY=(LEFT,BLANK),                                   X00123   
               COLOR=BLUE,                                             X00124   
               LENGTH=15,                                              X00125   
               POS=(07,54)                                              00126   
APREF01  DFHMDF ATTRB=(ASKIP),                                         X00127   
               JUSTIFY=(LEFT,BLANK),                                   X00128   
               COLOR=BLUE,                                             X00129   
               LENGTH=1,                                               X00130   
               POS=(07,71)                                              00131   
ANRFC01  DFHMDF ATTRB=(ASKIP),                                         X00127   
               JUSTIFY=(LEFT,BLANK),                                   X00128   
               COLOR=BLUE,                                             X00129   
               LENGTH=1,                                               X00130   
               POS=(07,76)                                              00131   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00132   
*  SCREEN LINE 09                                                       00133   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00134   
ASEL02   DFHMDF ATTRB=(UNPROT,IC),                                     X00135   
               COLOR=GREEN,                                            X00136   
               HILIGHT=UNDERLINE,                                      X00137   
               LENGTH=1,                                               X00138   
               POS=(08,2)                                               00139   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00140**5
               INITIAL=' ',                                            X00141**5
               LENGTH=1,                                               X00142**5
               POS=(08,4)                                               00143**5
AACT02   DFHMDF ATTRB=(ASKIP),                                         X00144   
               COLOR=BLUE,                                             X00145   
               LENGTH=3,                                               X00146   
               POS=(08,6)                                               00147**5
AVNME02  DFHMDF ATTRB=(ASKIP),                                         X00148   
               JUSTIFY=(LEFT,BLANK),                                   X00149   
               COLOR=BLUE,                                             X00150   
               LENGTH=26,                                              X00151**8
               POS=(08,11)                                              00152**6
AVNID02  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=15,                                              X00156   
               POS=(08,38)                                              00157**6
ANTWK02  DFHMDF ATTRB=(ASKIP),                                         X00158   
               JUSTIFY=(LEFT,BLANK),                                   X00159   
               COLOR=BLUE,                                             X00160   
               LENGTH=15,                                              X00161   
               POS=(08,54)                                              00162   
APREF02  DFHMDF ATTRB=(ASKIP),                                         X00163   
               JUSTIFY=(LEFT,BLANK),                                   X00164   
               COLOR=BLUE,                                             X00165   
               LENGTH=1,                                               X00166   
               POS=(08,71)                                              00167   
ANRFC02  DFHMDF ATTRB=(ASKIP),                                         X00163   
               JUSTIFY=(LEFT,BLANK),                                   X00164   
               COLOR=BLUE,                                             X00165   
               LENGTH=1,                                               X00166   
               POS=(08,76)                                              00167   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00168   
*  SCREEN LINE 10                                                       00169   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00170   
ASEL03   DFHMDF ATTRB=(UNPROT,IC),                                     X00171   
               COLOR=GREEN,                                            X00172   
               HILIGHT=UNDERLINE,                                      X00173   
               LENGTH=1,                                               X00174   
               POS=(09,2)                                               00175   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00176**5
               INITIAL=' ',                                            X00177**5
               LENGTH=1,                                               X00178**5
               POS=(09,4)                                               00179**5
AACT03   DFHMDF ATTRB=(ASKIP),                                         X00180   
               COLOR=BLUE,                                             X00181   
               LENGTH=3,                                               X00182   
               POS=(09,6)                                               00183**5
AVNME03  DFHMDF ATTRB=(ASKIP),                                         X00184   
               JUSTIFY=(LEFT,BLANK),                                   X00185   
               COLOR=BLUE,                                             X00186   
               LENGTH=26,                                              X00187**8
               POS=(09,11)                                              00188**6
AVNID03  DFHMDF ATTRB=(ASKIP),                                         X00189   
               JUSTIFY=(LEFT,BLANK),                                   X00190   
               COLOR=BLUE,                                             X00191   
               LENGTH=15,                                              X00192   
               POS=(09,38)                                              00193**6
ANTWK03  DFHMDF ATTRB=(ASKIP),                                         X00194   
               JUSTIFY=(LEFT,BLANK),                                   X00195   
               COLOR=BLUE,                                             X00196   
               LENGTH=15,                                              X00197   
               POS=(09,54)                                              00198   
APREF03  DFHMDF ATTRB=(ASKIP),                                         X00199   
               JUSTIFY=(LEFT,BLANK),                                   X00200   
               COLOR=BLUE,                                             X00201   
               LENGTH=1,                                               X00202   
               POS=(09,71)                                              00203   
ANRFC03  DFHMDF ATTRB=(ASKIP),                                         X00199   
               JUSTIFY=(LEFT,BLANK),                                   X00200   
               COLOR=BLUE,                                             X00201   
               LENGTH=1,                                               X00202   
               POS=(09,76)                                              00203   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00204   
*  SCREEN LINE 11                                                       00205   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00206   
ASEL04   DFHMDF ATTRB=(UNPROT,IC),                                     X00207   
               COLOR=GREEN,                                            X00208   
               HILIGHT=UNDERLINE,                                      X00209   
               LENGTH=1,                                               X00210   
               POS=(10,2)                                               00211   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00212**5
               INITIAL=' ',                                            X00213**5
               LENGTH=1,                                               X00214**5
               POS=(10,4)                                               00215**5
AACT04   DFHMDF ATTRB=(ASKIP),                                         X00216   
               COLOR=BLUE,                                             X00217   
               LENGTH=3,                                               X00218   
               POS=(10,6)                                               00219**5
AVNME04  DFHMDF ATTRB=(ASKIP),                                         X00220   
               JUSTIFY=(LEFT,BLANK),                                   X00221   
               COLOR=BLUE,                                             X00222   
               LENGTH=26,                                              X00223**8
               POS=(10,11)                                              00224**6
AVNID04  DFHMDF ATTRB=(ASKIP),                                         X00225   
               JUSTIFY=(LEFT,BLANK),                                   X00226   
               COLOR=BLUE,                                             X00227   
               LENGTH=15,                                              X00228   
               POS=(10,38)                                              00229**6
ANTWK04  DFHMDF ATTRB=(ASKIP),                                         X00230   
               JUSTIFY=(LEFT,BLANK),                                   X00231   
               COLOR=BLUE,                                             X00232   
               LENGTH=15,                                              X00233   
               POS=(10,54)                                              00234   
APREF04  DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=1,                                               X00238   
               POS=(10,71)                                              00239   
ANRFC04  DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=1,                                               X00238   
               POS=(10,76)                                              00239   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00240   
*  SCREEN LINE 12                                                       00241   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00242   
ASEL05   DFHMDF ATTRB=(UNPROT,IC),                                     X00243   
               COLOR=GREEN,                                            X00244   
               HILIGHT=UNDERLINE,                                      X00245   
               LENGTH=1,                                               X00246   
               POS=(11,2)                                               00247   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00248**5
               INITIAL=' ',                                            X00249**5
               LENGTH=1,                                               X00250**5
               POS=(11,4)                                               00251**5
AACT05   DFHMDF ATTRB=(ASKIP),                                         X00252   
               COLOR=BLUE,                                             X00253   
               LENGTH=3,                                               X00254   
               POS=(11,6)                                               00255**5
AVNME05  DFHMDF ATTRB=(ASKIP),                                         X00256   
               JUSTIFY=(LEFT,BLANK),                                   X00257   
               COLOR=BLUE,                                             X00258   
               LENGTH=26,                                              X00259**8
               POS=(11,11)                                              00260**6
AVNID05  DFHMDF ATTRB=(ASKIP),                                         X00261   
               JUSTIFY=(LEFT,BLANK),                                   X00262   
               COLOR=BLUE,                                             X00263   
               LENGTH=15,                                              X00264   
               POS=(11,38)                                              00265**6
ANTWK05  DFHMDF ATTRB=(ASKIP),                                         X00266   
               JUSTIFY=(LEFT,BLANK),                                   X00267   
               COLOR=BLUE,                                             X00268   
               LENGTH=15,                                              X00269   
               POS=(11,54)                                              00270   
APREF05  DFHMDF ATTRB=(ASKIP),                                         X00271   
               JUSTIFY=(LEFT,BLANK),                                   X00272   
               COLOR=BLUE,                                             X00273   
               LENGTH=1,                                               X00274   
               POS=(11,71)                                              00275   
ANRFC05  DFHMDF ATTRB=(ASKIP),                                         X00271   
               JUSTIFY=(LEFT,BLANK),                                   X00272   
               COLOR=BLUE,                                             X00273   
               LENGTH=1,                                               X00274   
               POS=(11,76)                                              00275   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00276   
*  SCREEN LINE 13                                                       00277   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00278   
ASEL06   DFHMDF ATTRB=(UNPROT,IC),                                     X00279   
               COLOR=GREEN,                                            X00280   
               HILIGHT=UNDERLINE,                                      X00281   
               LENGTH=1,                                               X00282   
               POS=(12,2)                                               00283   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00284**5
               INITIAL=' ',                                            X00285**5
               LENGTH=1,                                               X00286**5
               POS=(12,4)                                               00287**5
AACT06   DFHMDF ATTRB=(ASKIP),                                         X00288   
               COLOR=BLUE,                                             X00289   
               LENGTH=3,                                               X00290   
               POS=(12,6)                                               00291**5
AVNME06  DFHMDF ATTRB=(ASKIP),                                         X00292   
               JUSTIFY=(LEFT,BLANK),                                   X00293   
               COLOR=BLUE,                                             X00294   
               LENGTH=26,                                              X00295**8
               POS=(12,11)                                              00296**6
AVNID06  DFHMDF ATTRB=(ASKIP),                                         X00297   
               JUSTIFY=(LEFT,BLANK),                                   X00298   
               COLOR=BLUE,                                             X00299   
               LENGTH=15,                                              X00300   
               POS=(12,38)                                              00301**6
ANTWK06  DFHMDF ATTRB=(ASKIP),                                         X00302   
               JUSTIFY=(LEFT,BLANK),                                   X00303   
               COLOR=BLUE,                                             X00304   
               LENGTH=15,                                              X00305   
               POS=(12,54)                                              00306   
APREF06  DFHMDF ATTRB=(ASKIP),                                         X00307   
               JUSTIFY=(LEFT,BLANK),                                   X00308   
               COLOR=BLUE,                                             X00309   
               LENGTH=1,                                               X00310   
               POS=(12,71)                                              00311   
ANRFC06  DFHMDF ATTRB=(ASKIP),                                         X00307   
               JUSTIFY=(LEFT,BLANK),                                   X00308   
               COLOR=BLUE,                                             X00309   
               LENGTH=1,                                               X00310   
               POS=(12,76)                                              00311   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00312   
*  SCREEN LINE 14                                                       00313   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00314   
ASEL07   DFHMDF ATTRB=(UNPROT,IC),                                     X00315   
               COLOR=GREEN,                                            X00316   
               HILIGHT=UNDERLINE,                                      X00317   
               LENGTH=1,                                               X00318   
               POS=(13,2)                                               00319   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00320**5
               INITIAL=' ',                                            X00321**5
               LENGTH=1,                                               X00322**5
               POS=(13,4)                                               00323**5
AACT07   DFHMDF ATTRB=(ASKIP),                                         X00324   
               COLOR=BLUE,                                             X00325   
               LENGTH=3,                                               X00326   
               POS=(13,6)                                               00327**5
AVNME07  DFHMDF ATTRB=(ASKIP),                                         X00328   
               JUSTIFY=(LEFT,BLANK),                                   X00329   
               COLOR=BLUE,                                             X00330   
               LENGTH=26,                                              X00331**8
               POS=(13,11)                                              00332**6
AVNID07  DFHMDF ATTRB=(ASKIP),                                         X00333   
               JUSTIFY=(LEFT,BLANK),                                   X00334   
               COLOR=BLUE,                                             X00335   
               LENGTH=15,                                              X00336   
               POS=(13,38)                                              00337**6
ANTWK07  DFHMDF ATTRB=(ASKIP),                                         X00338   
               JUSTIFY=(LEFT,BLANK),                                   X00339   
               COLOR=BLUE,                                             X00340   
               LENGTH=15,                                              X00341   
               POS=(13,54)                                              00342   
APREF07  DFHMDF ATTRB=(ASKIP),                                         X00343   
               JUSTIFY=(LEFT,BLANK),                                   X00344   
               COLOR=BLUE,                                             X00345   
               LENGTH=1,                                               X00346   
               POS=(13,71)                                              00347   
ANRFC07  DFHMDF ATTRB=(ASKIP),                                         X00343   
               JUSTIFY=(LEFT,BLANK),                                   X00344   
               COLOR=BLUE,                                             X00345   
               LENGTH=1,                                               X00346   
               POS=(13,76)                                              00347   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00348   
*  SCREEN LINE 15                                                       00349   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00350   
ASEL08   DFHMDF ATTRB=(UNPROT,IC),                                     X00351   
               COLOR=GREEN,                                            X00352   
               HILIGHT=UNDERLINE,                                      X00353   
               LENGTH=1,                                               X00354   
               POS=(14,2)                                               00355   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00356**5
               INITIAL=' ',                                            X00357**5
               LENGTH=1,                                               X00358**5
               POS=(14,4)                                               00359**5
AACT08   DFHMDF ATTRB=(ASKIP),                                         X00360   
               COLOR=BLUE,                                             X00361   
               LENGTH=3,                                               X00362   
               POS=(14,6)                                               00363**5
AVNME08  DFHMDF ATTRB=(ASKIP),                                         X00364   
               JUSTIFY=(LEFT,BLANK),                                   X00365   
               COLOR=BLUE,                                             X00366   
               LENGTH=26,                                              X00367**8
               POS=(14,11)                                              00368**6
AVNID08  DFHMDF ATTRB=(ASKIP),                                         X00369   
               JUSTIFY=(LEFT,BLANK),                                   X00370   
               COLOR=BLUE,                                             X00371   
               LENGTH=15,                                              X00372   
               POS=(14,38)                                              00373**6
ANTWK08  DFHMDF ATTRB=(ASKIP),                                         X00374   
               JUSTIFY=(LEFT,BLANK),                                   X00375   
               COLOR=BLUE,                                             X00376   
               LENGTH=15,                                              X00377   
               POS=(14,54)                                              00378   
APREF08  DFHMDF ATTRB=(ASKIP),                                         X00379   
               JUSTIFY=(LEFT,BLANK),                                   X00380   
               COLOR=BLUE,                                             X00381   
               LENGTH=1,                                               X00382   
               POS=(14,71)                                              00383   
ANRFC08  DFHMDF ATTRB=(ASKIP),                                         X00379   
               JUSTIFY=(LEFT,BLANK),                                   X00380   
               COLOR=BLUE,                                             X00381   
               LENGTH=1,                                               X00382   
               POS=(14,76)                                              00383   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00384   
*  SCREEN LINE 16                                                       00385   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00386   
ASEL09   DFHMDF ATTRB=(UNPROT,IC),                                     X00387   
               COLOR=GREEN,                                            X00388   
               HILIGHT=UNDERLINE,                                      X00389   
               LENGTH=1,                                               X00390   
               POS=(15,2)                                               00391   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00392**5
               INITIAL=' ',                                            X00393**5
               LENGTH=1,                                               X00394**5
               POS=(15,4)                                               00395**5
AACT09   DFHMDF ATTRB=(ASKIP),                                         X00396   
               COLOR=BLUE,                                             X00397   
               LENGTH=3,                                               X00398   
               POS=(15,6)                                               00399**5
AVNME09  DFHMDF ATTRB=(ASKIP),                                         X00400   
               JUSTIFY=(LEFT,BLANK),                                   X00401   
               COLOR=BLUE,                                             X00402   
               LENGTH=26,                                              X00403**8
               POS=(15,11)                                              00404**6
AVNID09  DFHMDF ATTRB=(ASKIP),                                         X00405   
               JUSTIFY=(LEFT,BLANK),                                   X00406   
               COLOR=BLUE,                                             X00407   
               LENGTH=15,                                              X00408   
               POS=(15,38)                                              00409**6
ANTWK09  DFHMDF ATTRB=(ASKIP),                                         X00410   
               JUSTIFY=(LEFT,BLANK),                                   X00411   
               COLOR=BLUE,                                             X00412   
               LENGTH=15,                                              X00413   
               POS=(15,54)                                              00414   
APREF09  DFHMDF ATTRB=(ASKIP),                                         X00415   
               JUSTIFY=(LEFT,BLANK),                                   X00416   
               COLOR=BLUE,                                             X00417   
               LENGTH=1,                                               X00418   
               POS=(15,71)                                              00419   
ANRFC09  DFHMDF ATTRB=(ASKIP),                                         X00415   
               JUSTIFY=(LEFT,BLANK),                                   X00416   
               COLOR=BLUE,                                             X00417   
               LENGTH=1,                                               X00418   
               POS=(15,76)                                              00419   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00420   
*  SCREEN LINE 17                                                       00421   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00422   
ASEL10   DFHMDF ATTRB=(UNPROT,IC),                                     X00423   
               COLOR=GREEN,                                            X00424   
               HILIGHT=UNDERLINE,                                      X00425   
               LENGTH=1,                                               X00426   
               POS=(16,2)                                               00427   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00428**5
               INITIAL=' ',                                            X00429**5
               LENGTH=1,                                               X00430**5
               POS=(16,4)                                               00431**5
AACT10   DFHMDF ATTRB=(ASKIP),                                         X00432   
               COLOR=BLUE,                                             X00433   
               LENGTH=3,                                               X00434   
               POS=(16,6)                                               00435**5
AVNME10  DFHMDF ATTRB=(ASKIP),                                         X00436   
               JUSTIFY=(LEFT,BLANK),                                   X00437   
               COLOR=BLUE,                                             X00438   
               LENGTH=26,                                              X00439**8
               POS=(16,11)                                              00440**6
AVNID10  DFHMDF ATTRB=(ASKIP),                                         X00441   
               JUSTIFY=(LEFT,BLANK),                                   X00442   
               COLOR=BLUE,                                             X00443   
               LENGTH=15,                                              X00444   
               POS=(16,38)                                              00445**6
ANTWK10  DFHMDF ATTRB=(ASKIP),                                         X00446   
               JUSTIFY=(LEFT,BLANK),                                   X00447   
               COLOR=BLUE,                                             X00448   
               LENGTH=15,                                              X00449   
               POS=(16,54)                                              00450   
APREF10  DFHMDF ATTRB=(ASKIP),                                         X00451   
               JUSTIFY=(LEFT,BLANK),                                   X00452   
               COLOR=BLUE,                                             X00453   
               LENGTH=1,                                               X00454   
               POS=(16,71)                                              00455   
ANRFC10  DFHMDF ATTRB=(ASKIP),                                         X00451   
               JUSTIFY=(LEFT,BLANK),                                   X00452   
               COLOR=BLUE,                                             X00453   
               LENGTH=1,                                               X00454   
               POS=(16,76)                                              00455   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00456   
*  SCREEN LINE 18                                                       00457   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00458   
ASEL11   DFHMDF ATTRB=(UNPROT,IC),                                     X00459   
               COLOR=GREEN,                                            X00460   
               HILIGHT=UNDERLINE,                                      X00461   
               LENGTH=1,                                               X00462   
               POS=(17,2)                                               00463   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00464**5
               INITIAL=' ',                                            X00465**5
               LENGTH=1,                                               X00466**5
               POS=(17,4)                                               00467**5
AACT11   DFHMDF ATTRB=(ASKIP),                                         X00468   
               COLOR=BLUE,                                             X00469   
               LENGTH=3,                                               X00470   
               POS=(17,6)                                               00471**5
AVNME11  DFHMDF ATTRB=(ASKIP),                                         X00472   
               JUSTIFY=(LEFT,BLANK),                                   X00473   
               COLOR=BLUE,                                             X00474   
               LENGTH=26,                                              X00475**8
               POS=(17,11)                                              00476**6
AVNID11  DFHMDF ATTRB=(ASKIP),                                         X00477   
               JUSTIFY=(LEFT,BLANK),                                   X00478   
               COLOR=BLUE,                                             X00479   
               LENGTH=15,                                              X00480   
               POS=(17,38)                                              00481**6
ANTWK11  DFHMDF ATTRB=(ASKIP),                                         X00482   
               JUSTIFY=(LEFT,BLANK),                                   X00483   
               COLOR=BLUE,                                             X00484   
               LENGTH=15,                                              X00485   
               POS=(17,54)                                              00486   
APREF11  DFHMDF ATTRB=(ASKIP),                                         X00487   
               JUSTIFY=(LEFT,BLANK),                                   X00488   
               COLOR=BLUE,                                             X00489   
               LENGTH=1,                                               X00490   
               POS=(17,71)                                              00491   
ANRFC11  DFHMDF ATTRB=(ASKIP),                                         X00487   
               JUSTIFY=(LEFT,BLANK),                                   X00488   
               COLOR=BLUE,                                             X00489   
               LENGTH=1,                                               X00490   
               POS=(17,76)                                              00491   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00492   
*  SCREEN LINE 19                                                       00493   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00494   
ASEL12   DFHMDF ATTRB=(UNPROT,IC),                                     X00495   
               COLOR=GREEN,                                            X00496   
               HILIGHT=UNDERLINE,                                      X00497   
               LENGTH=1,                                               X00498   
               POS=(18,2)                                               00499   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00500**5
               INITIAL=' ',                                            X00501**5
               LENGTH=1,                                               X00502**5
               POS=(18,4)                                               00503**5
AACT12   DFHMDF ATTRB=(ASKIP),                                         X00504   
               COLOR=BLUE,                                             X00505   
               LENGTH=3,                                               X00506   
               POS=(18,6)                                               00507**9
AVNME12  DFHMDF ATTRB=(ASKIP),                                         X00508   
               JUSTIFY=(LEFT,BLANK),                                   X00509   
               COLOR=BLUE,                                             X00510   
               LENGTH=26,                                              X00511**8
               POS=(18,11)                                              00512**6
AVNID12  DFHMDF ATTRB=(ASKIP),                                         X00513   
               JUSTIFY=(LEFT,BLANK),                                   X00514   
               COLOR=BLUE,                                             X00515   
               LENGTH=15,                                              X00516   
               POS=(18,38)                                              00517**6
ANTWK12  DFHMDF ATTRB=(ASKIP),                                         X00518   
               JUSTIFY=(LEFT,BLANK),                                   X00519   
               COLOR=BLUE,                                             X00520   
               LENGTH=15,                                              X00521   
               POS=(18,54)                                              00522   
APREF12  DFHMDF ATTRB=(ASKIP),                                         X00523   
               JUSTIFY=(LEFT,BLANK),                                   X00524   
               COLOR=BLUE,                                             X00525   
               LENGTH=1,                                               X00526   
               POS=(18,71)                                              00527   
ANRFC12  DFHMDF ATTRB=(ASKIP),                                         X00523   
               JUSTIFY=(LEFT,BLANK),                                   X00524   
               COLOR=BLUE,                                             X00525   
               LENGTH=1,                                               X00526   
               POS=(18,76)                                              00527   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00528   
*  SCREEN LINE 20                                                       00529   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00530   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00531   
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00532   
               COLOR=NEUTRAL,                                          X00533   
               LENGTH=25,                                              X00534   
               POS=(19,45)                                              00535   
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00536   
               JUSTIFY=(LEFT,BLANK),                                   X00537   
               COLOR=BLUE,                                             X00538   
               PICOUT='ZZZ,ZZ9',                                       X00539   
               LENGTH=7,                                               X00540   
               POS=(19,72)                                              00541   
         DFHMSD TYPE=FINAL                                              00542   
         END                                                            00543   
