*          DATA SET ETKM322    AT LEVEL 011 AS OF 08/10/94                      
  PRINT  NOGEN                                                          00001**3
************************************************************            00002**3
*                                                                       00003**3
*  ETC22 - ETKCS322_-_TRANSMIT_DOC_SELECT                               00004**3
*                                                                       00005**3
*     GENERATED          : 06/15/94 AT 08:25:25 AM                      00006**3
*     VERSION            : 2.7.01                                       00007**3
*     CSD LEVEL          : 2.7.01                                       00008**3
*     AUTHOR             : NEWUSER.                                     00009**3
*     INSTALLATION       : KNOWLEDGEWARE, INC.                          00010**3
*     ENCYCLOPEDIA       : TPENC                                        00011**3
*     ENCYCLOPEDIA PATH  : \ADW_ENC\TPENC\                              00012**3
*     MAP DETAILS                                                       00013**3
*     LAST UPDATED 06/15/1994 AT 08:16:51 BY TKMA086                    00014**3
*-----------------------------------------------------------            00015**3
*                                                                       00016**3
*  BMS MAPSET :  ETKM322                                                00017**3
*      MAP    :  ET322A                                                 00018**3
************************************************************            00019**3
ETKM322  DFHMSD TYPE=DSECT,                                            X00020**7
               CTRL=(FREEKB),                                          X00021**3
               TERM=3270-2,                                            X00022**3
               EXTATT=YES,                                             X00023**3
               LANG=COBOL,                                             X00024**3
               MODE=INOUT,                                             X00025**3
               TIOAPFX=YES,                                            X00026**3
               STORAGE=AUTO                                             00027**3
ET322A   DFHMDI LINE=2,                                                X00028**4
               COLUMN=1,                                               X00029**3
               SIZE=(19,80),                                           X00030**4
               MAPATTS=(COLOR,HILIGHT),                                X00031**4
               DSATTS=(COLOR,HILIGHT)                                   00032*11
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00033**3
*                                                                       00034**3
*  SCREEN LINE 01                                                       00035**4
*                                                                       00036**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00037**3
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00038**3
               POS=(01,1),                                             X00039**4
               INITIAL=' ',                                            X00040**3
               LENGTH=1                                                 00041**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00042**3
*                                                                       00043**3
*  SCREEN LINE 07                                                       00044**3
*                                                                       00045**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046**3
         DFHMDF ATTRB=(ASKIP),                                         X00047**3
               POS=(07,1),                                             X00048**3
               INITIAL=' ',                                            X00049**3
               LENGTH=1                                                 00050**3
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00051**5
               INITIAL='DOCUMENT',                                     X00052**3
               LENGTH=8,                                               X00053**3
               POS=(07,17)                                              00054**3
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00055**5
               INITIAL='DETAIL:',                                      X00056**3
               LENGTH=7,                                               X00057**3
               POS=(07,26)                                              00058**3
****************************************                                00059**3
*  VARIABLE = TRANSACTION      X030                                     00060**3
****************************************                                00061**3
ADOCDTL  DFHMDF ATTRB=(UNPROT,IC),                                     X00062**3
               LENGTH=30,                                              X00063**3
               HILIGHT=UNDERLINE,                                      X00064**5
               POS=(07,35)                                              00065**3
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00066**3
               INITIAL=' ',                                            X00067**3
               LENGTH=1,                                               X00068**3
               POS=(07,66)                                              00069**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00070**3
*                                                                       00071**3
*  SCREEN LINE 08                                                       00072**3
*                                                                       00073**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00074**3
         DFHMDF ATTRB=(ASKIP),                                         X00075**3
               POS=(08,1),                                             X00076**3
               INITIAL=' ',                                            X00077**3
               LENGTH=1                                                 00078**3
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00079**5
               INITIAL='TRANSACTION',                                  X00080**3
               LENGTH=11,                                              X00081**3
               POS=(08,17)                                              00082**3
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00083**5
               INITIAL='SET:',                                         X00084**3
               LENGTH=4,                                               X00085**3
               POS=(08,29)                                              00086**3
****************************************                                00087**3
*  VARIABLE = CODE      X003                                            00088**3
****************************************                                00089**3
ATSET    DFHMDF ATTRB=(UNPROT),                                        X00090**3
               LENGTH=3,                                               X00091**3
               HILIGHT=UNDERLINE,                                      X00092**5
               POS=(08,35)                                              00093**3
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00094**3
               INITIAL=' ',                                            X00095**3
               LENGTH=1,                                               X00096**3
               POS=(08,39)                                              00097**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00098**8
*                                                                       00099**8
*  SCREEN LINE 09                                                       00100**8
*                                                                       00101**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00102**8
         DFHMDF ATTRB=(ASKIP),                                         X00103**8
               POS=(09,1),                                             X00104**8
               INITIAL=' ',                                            X00105**8
               LENGTH=1                                                 00106**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00107**8
               INITIAL='DIRECTION......:',                             X00108*10
               LENGTH=16,                                              X00109*10
               POS=(09,17)                                              00110**8
****************************************                                00111**8
*  VARIABLE = CODE      X003                                            00112**8
****************************************                                00113**8
ADIR     DFHMDF ATTRB=(UNPROT),                                        X00114**8
               LENGTH=1,                                               X00115**8
               HILIGHT=UNDERLINE,                                      X00116**8
               POS=(09,35)                                              00117**8
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00118**8
               INITIAL=' ',                                            X00119**8
               LENGTH=1,                                               X00120**8
               POS=(09,37)                                              00121**9
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00122**3
*                                                                       00123**3
*  SCREEN LINE 10                                                       00124**8
*                                                                       00125**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00126**3
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00127**3
               POS=(10,1),                                             X00128**8
               INITIAL=' ',                                            X00129**3
               LENGTH=1                                                 00130**3
         DFHMSD TYPE=FINAL                                              00131**3
         END                                                            00132**3
