*          DATA SET ETKM344    AT LEVEL 001 AS OF 06/06/95                      
*          DATA SET ETKM344    AT LEVEL 013 AS OF 03/29/95              00001   
  PRINT  NOGEN                                                          00002   
************************************************************            00003   
*  BMS MAPSET :  ETKM344                                                00004   
*      MAP    :  ET344A                                                 00005   
************************************************************            00006   
ETKM344  DFHMSD TYPE=DSECT,                                            X00007   
               CTRL=(FREEKB),                                          X00008   
               TERM=3270-2,                                            X00009   
               LANG=COBOL,                                             X00010   
               MODE=INOUT,                                             X00011   
               TIOAPFX=YES,                                            X00012   
               STORAGE=AUTO                                             00013   
ET344A   DFHMDI LINE=2,                                                X00014   
               COLUMN=1,                                               X00015   
               SIZE=(19,80),                                           X00016   
               MAPATTS=(COLOR,HILIGHT),                                X00017   
               DSATTS=(COLOR,HILIGHT)                                   00018   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00019   
*                                                                       00020   
*  SCREEN LINE 03                                                       00021   
*                                                                       00022   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00023   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00024   
               INITIAL='ITEMS',                                        X00025   
               COLOR=NEUTRAL,                                          X00026   
               LENGTH=5,                                               X00027   
               POS=(02,44)                                              00028   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00029   
               JUSTIFY=(LEFT,BLANK),                                   X00030   
               COLOR=GREEN,                                            X00031   
               HILIGHT=UNDERLINE,                                      X00032   
               PICOUT='ZZZZ9',                                         X00033   
               LENGTH=5,                                               X00034   
               POS=(02,50)                                              00035   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00036   
               INITIAL='TO',                                           X00037   
               COLOR=NEUTRAL,                                          X00038   
               LENGTH=2,                                               X00039   
               POS=(02,56)                                              00040   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00041   
               JUSTIFY=(LEFT,BLANK),                                   X00042   
               COLOR=BLUE,                                             X00043   
               PICOUT='ZZZZ9',                                         X00044   
               LENGTH=5,                                               X00045   
               POS=(02,59)                                              00046   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00047   
               INITIAL='OF',                                           X00048   
               COLOR=NEUTRAL,                                          X00049   
               LENGTH=2,                                               X00050   
               POS=(02,65)                                              00051   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00052   
               JUSTIFY=(LEFT,BLANK),                                   X00053   
               COLOR=BLUE,                                             X00054   
               PICOUT='ZZZZ9',                                         X00055   
               LENGTH=5,                                               X00056   
               POS=(02,68)                                              00057   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00058   
*                                                                       00059   
*  SCREEN LINE 05                                                       00060   
*                                                                       00061   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00062   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00063   
               INITIAL='SEL',                                          X00064   
               COLOR=NEUTRAL,                                          X00065   
               LENGTH=3,                                               X00066   
               POS=(04,1)                                               00067   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00068   
               INITIAL='ACT',                                          X00069   
               COLOR=NEUTRAL,                                          X00070   
               LENGTH=3,                                               X00071   
               POS=(04,6)                                               00072   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00073   
               INITIAL='DOCUMENT',                                     X00074   
               COLOR=NEUTRAL,                                          X00075   
               LENGTH=8,                                               X00076   
               POS=(04,12)                                              00077   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00078   
               INITIAL='VENDOR',                                       X00079   
               COLOR=NEUTRAL,                                          X00080   
               LENGTH=6,                                               X00081   
               POS=(04,39)                                              00082   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00083   
               INITIAL='EDI',                                          X00084   
               COLOR=NEUTRAL,                                          X00085   
               LENGTH=3,                                               X00086   
               POS=(04,53)                                              00087   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00088   
               INITIAL='HOLD',                                         X00089   
               COLOR=NEUTRAL,                                          X00090   
               LENGTH=4,                                               X00091   
               POS=(04,62)                                              00092   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00093   
               INITIAL='RELEASE',                                      X00094   
               COLOR=NEUTRAL,                                          X00095   
               LENGTH=7,                                               X00096   
               POS=(04,71)                                              00097   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00098   
*                                                                       00099   
*  SCREEN LINE 06                                                       00100   
*                                                                       00101   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00102   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00103   
               INITIAL='DOCUMENT',                                     X00104   
               COLOR=NEUTRAL,                                          X00105   
               LENGTH=8,                                               X00106   
               POS=(05,51)                                              00107   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00108   
               INITIAL='DATE',                                         X00109   
               COLOR=NEUTRAL,                                          X00110   
               LENGTH=4,                                               X00111   
               POS=(05,62)                                              00112   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00113   
               INITIAL='DATE',                                         X00114   
               COLOR=NEUTRAL,                                          X00115   
               LENGTH=4,                                               X00116   
               POS=(05,71)                                              00117   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00118   
*                                                                       00119   
*  SCREEN LINE 07                                                       00120   
*                                                                       00121   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00122   
ASEL01   DFHMDF ATTRB=(UNPROT,IC),                                     X00123   
               COLOR=GREEN,                                            X00124   
               HILIGHT=UNDERLINE,                                      X00125   
               LENGTH=1,                                               X00126   
               POS=(06,2)                                               00127   
         DFHMDF ATTRB=(ASKIP),                                         X00128   
               POS=(06,4),                                             X00129   
               INITIAL=' ',                                            X00130   
               LENGTH=1                                                 00131   
AACT01   DFHMDF ATTRB=(ASKIP),                                         X00132   
               COLOR=BLUE,                                             X00133   
               LENGTH=3,                                               X00134   
               POS=(06,6)                                               00135   
ADOC01   DFHMDF ATTRB=(ASKIP),                                         X00136   
               COLOR=BLUE,                                             X00137   
               LENGTH=25,                                              X00138   
               POS=(06,12)                                              00139   
AVND01   DFHMDF ATTRB=(ASKIP),                                         X00140   
               COLOR=BLUE,                                             X00141   
               LENGTH=10,                                              X00142   
               POS=(06,39)                                              00143   
AEDOC01  DFHMDF ATTRB=(ASKIP),                                         X00144   
               COLOR=BLUE,                                             X00145   
               LENGTH=3,                                               X00146   
               POS=(06,53)                                              00147   
AHDT01   DFHMDF ATTRB=(ASKIP),                                         X00148   
               COLOR=BLUE,                                             X00149   
               LENGTH=8,                                               X00150   
               POS=(06,61)                                              00151   
ARDT01   DFHMDF ATTRB=(ASKIP),                                         X00152   
               COLOR=BLUE,                                             X00153   
               LENGTH=8,                                               X00154   
               POS=(06,71)                                              00155   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00156   
*                                                                       00157   
*  SCREEN LINE 08                                                       00158   
*                                                                       00159   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00160   
ASEL02   DFHMDF ATTRB=(UNPROT,IC),                                     X00161   
               COLOR=GREEN,                                            X00162   
               HILIGHT=UNDERLINE,                                      X00163   
               LENGTH=1,                                               X00164   
               POS=(07,2)                                               00165   
         DFHMDF ATTRB=(ASKIP),                                         X00166   
               POS=(07,4),                                             X00167   
               INITIAL=' ',                                            X00168   
               LENGTH=1                                                 00169   
AACT02   DFHMDF ATTRB=(ASKIP),                                         X00170   
               COLOR=BLUE,                                             X00171   
               LENGTH=3,                                               X00172   
               POS=(07,6)                                               00173   
ADOC02   DFHMDF ATTRB=(ASKIP),                                         X00174   
               COLOR=BLUE,                                             X00175   
               LENGTH=25,                                              X00176   
               POS=(07,12)                                              00177   
AVND02   DFHMDF ATTRB=(ASKIP),                                         X00178   
               COLOR=BLUE,                                             X00179   
               LENGTH=10,                                              X00180   
               POS=(07,39)                                              00181   
AEDOC02  DFHMDF ATTRB=(ASKIP),                                         X00182   
               COLOR=BLUE,                                             X00183   
               LENGTH=3,                                               X00184   
               POS=(07,53)                                              00185   
AHDT02   DFHMDF ATTRB=(ASKIP),                                         X00186   
               COLOR=BLUE,                                             X00187   
               LENGTH=8,                                               X00188   
               POS=(07,61)                                              00189   
ARDT02   DFHMDF ATTRB=(ASKIP),                                         X00190   
               COLOR=BLUE,                                             X00191   
               LENGTH=8,                                               X00192   
               POS=(07,71)                                              00193   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00194   
*                                                                       00195   
*  SCREEN LINE 09                                                       00196   
*                                                                       00197   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00198   
ASEL03   DFHMDF ATTRB=(UNPROT,IC),                                     X00199   
               COLOR=GREEN,                                            X00200   
               HILIGHT=UNDERLINE,                                      X00201   
               LENGTH=1,                                               X00202   
               POS=(08,2)                                               00203   
         DFHMDF ATTRB=(ASKIP),                                         X00204   
               POS=(08,4),                                             X00205   
               INITIAL=' ',                                            X00206   
               LENGTH=1                                                 00207   
AACT03   DFHMDF ATTRB=(ASKIP),                                         X00208   
               COLOR=BLUE,                                             X00209   
               LENGTH=3,                                               X00210   
               POS=(08,6)                                               00211   
ADOC03   DFHMDF ATTRB=(ASKIP),                                         X00212   
               COLOR=BLUE,                                             X00213   
               LENGTH=25,                                              X00214   
               POS=(08,12)                                              00215   
AVND03   DFHMDF ATTRB=(ASKIP),                                         X00216   
               COLOR=BLUE,                                             X00217   
               LENGTH=10,                                              X00218   
               POS=(08,39)                                              00219   
AEDOC03  DFHMDF ATTRB=(ASKIP),                                         X00220   
               COLOR=BLUE,                                             X00221   
               LENGTH=3,                                               X00222   
               POS=(08,53)                                              00223   
AHDT03   DFHMDF ATTRB=(ASKIP),                                         X00224   
               COLOR=BLUE,                                             X00225   
               LENGTH=8,                                               X00226   
               POS=(08,61)                                              00227   
ARDT03   DFHMDF ATTRB=(ASKIP),                                         X00228   
               COLOR=BLUE,                                             X00229   
               LENGTH=8,                                               X00230   
               POS=(08,71)                                              00231   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00232   
*                                                                       00233   
*  SCREEN LINE 10                                                       00234   
*                                                                       00235   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00236   
ASEL04   DFHMDF ATTRB=(UNPROT,IC),                                     X00237   
               COLOR=GREEN,                                            X00238   
               HILIGHT=UNDERLINE,                                      X00239   
               LENGTH=1,                                               X00240   
               POS=(09,2)                                               00241   
         DFHMDF ATTRB=(ASKIP),                                         X00242   
               POS=(09,4),                                             X00243   
               INITIAL=' ',                                            X00244   
               LENGTH=1                                                 00245   
AACT04   DFHMDF ATTRB=(ASKIP),                                         X00246   
               COLOR=BLUE,                                             X00247   
               LENGTH=3,                                               X00248   
               POS=(09,6)                                               00249   
ADOC04   DFHMDF ATTRB=(ASKIP),                                         X00250   
               COLOR=BLUE,                                             X00251   
               LENGTH=25,                                              X00252   
               POS=(09,12)                                              00253   
AVND04   DFHMDF ATTRB=(ASKIP),                                         X00254   
               COLOR=BLUE,                                             X00255   
               LENGTH=10,                                              X00256   
               POS=(09,39)                                              00257   
AEDOC04  DFHMDF ATTRB=(ASKIP),                                         X00258   
               COLOR=BLUE,                                             X00259   
               LENGTH=3,                                               X00260   
               POS=(09,53)                                              00261   
AHDT04   DFHMDF ATTRB=(ASKIP),                                         X00262   
               COLOR=BLUE,                                             X00263   
               LENGTH=8,                                               X00264   
               POS=(09,61)                                              00265   
ARDT04   DFHMDF ATTRB=(ASKIP),                                         X00266   
               COLOR=BLUE,                                             X00267   
               LENGTH=8,                                               X00268   
               POS=(09,71)                                              00269   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00270   
*                                                                       00271   
*  SCREEN LINE 11                                                       00272   
*                                                                       00273   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00274   
ASEL05   DFHMDF ATTRB=(UNPROT,IC),                                     X00275   
               COLOR=GREEN,                                            X00276   
               HILIGHT=UNDERLINE,                                      X00277   
               LENGTH=1,                                               X00278   
               POS=(10,2)                                               00279   
         DFHMDF ATTRB=(ASKIP),                                         X00280   
               POS=(10,4),                                             X00281   
               INITIAL=' ',                                            X00282   
               LENGTH=1                                                 00283   
AACT05   DFHMDF ATTRB=(ASKIP),                                         X00284   
               COLOR=BLUE,                                             X00285   
               LENGTH=3,                                               X00286   
               POS=(10,6)                                               00287   
ADOC05   DFHMDF ATTRB=(ASKIP),                                         X00288   
               COLOR=BLUE,                                             X00289   
               LENGTH=25,                                              X00290   
               POS=(10,12)                                              00291   
AVND05   DFHMDF ATTRB=(ASKIP),                                         X00292   
               COLOR=BLUE,                                             X00293   
               LENGTH=10,                                              X00294   
               POS=(10,39)                                              00295   
AEDOC05  DFHMDF ATTRB=(ASKIP),                                         X00296   
               COLOR=BLUE,                                             X00297   
               LENGTH=3,                                               X00298   
               POS=(10,53)                                              00299   
AHDT05   DFHMDF ATTRB=(ASKIP),                                         X00300   
               COLOR=BLUE,                                             X00301   
               LENGTH=8,                                               X00302   
               POS=(10,61)                                              00303   
ARDT05   DFHMDF ATTRB=(ASKIP),                                         X00304   
               COLOR=BLUE,                                             X00305   
               LENGTH=8,                                               X00306   
               POS=(10,71)                                              00307   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00308   
*                                                                       00309   
*  SCREEN LINE 12                                                       00310   
*                                                                       00311   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00312   
ASEL06   DFHMDF ATTRB=(UNPROT,IC),                                     X00313   
               COLOR=GREEN,                                            X00314   
               HILIGHT=UNDERLINE,                                      X00315   
               LENGTH=1,                                               X00316   
               POS=(11,2)                                               00317   
         DFHMDF ATTRB=(ASKIP),                                         X00318   
               POS=(11,4),                                             X00319   
               INITIAL=' ',                                            X00320   
               LENGTH=1                                                 00321   
AACT06   DFHMDF ATTRB=(ASKIP),                                         X00322   
               COLOR=BLUE,                                             X00323   
               LENGTH=3,                                               X00324   
               POS=(11,6)                                               00325   
ADOC06   DFHMDF ATTRB=(ASKIP),                                         X00326   
               COLOR=BLUE,                                             X00327   
               LENGTH=25,                                              X00328   
               POS=(11,12)                                              00329   
AVND06   DFHMDF ATTRB=(ASKIP),                                         X00330   
               COLOR=BLUE,                                             X00331   
               LENGTH=10,                                              X00332   
               POS=(11,39)                                              00333   
AEDOC06  DFHMDF ATTRB=(ASKIP),                                         X00334   
               COLOR=BLUE,                                             X00335   
               LENGTH=3,                                               X00336   
               POS=(11,53)                                              00337   
AHDT06   DFHMDF ATTRB=(ASKIP),                                         X00338   
               COLOR=BLUE,                                             X00339   
               LENGTH=8,                                               X00340   
               POS=(11,61)                                              00341   
ARDT06   DFHMDF ATTRB=(ASKIP),                                         X00342   
               COLOR=BLUE,                                             X00343   
               LENGTH=8,                                               X00344   
               POS=(11,71)                                              00345   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00346   
*                                                                       00347   
*  SCREEN LINE 13                                                       00348   
*                                                                       00349   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00350   
ASEL07   DFHMDF ATTRB=(UNPROT,IC),                                     X00351   
               COLOR=GREEN,                                            X00352   
               HILIGHT=UNDERLINE,                                      X00353   
               LENGTH=1,                                               X00354   
               POS=(12,2)                                               00355   
         DFHMDF ATTRB=(ASKIP),                                         X00356   
               POS=(12,4),                                             X00357   
               INITIAL=' ',                                            X00358   
               LENGTH=1                                                 00359   
AACT07   DFHMDF ATTRB=(ASKIP),                                         X00360   
               COLOR=BLUE,                                             X00361   
               LENGTH=3,                                               X00362   
               POS=(12,6)                                               00363   
ADOC07   DFHMDF ATTRB=(ASKIP),                                         X00364   
               COLOR=BLUE,                                             X00365   
               LENGTH=25,                                              X00366   
               POS=(12,12)                                              00367   
AVND07   DFHMDF ATTRB=(ASKIP),                                         X00368   
               COLOR=BLUE,                                             X00369   
               LENGTH=10,                                              X00370   
               POS=(12,39)                                              00371   
AEDOC07  DFHMDF ATTRB=(ASKIP),                                         X00372   
               COLOR=BLUE,                                             X00373   
               LENGTH=3,                                               X00374   
               POS=(12,53)                                              00375   
AHDT07   DFHMDF ATTRB=(ASKIP),                                         X00376   
               COLOR=BLUE,                                             X00377   
               LENGTH=8,                                               X00378   
               POS=(12,61)                                              00379   
ARDT07   DFHMDF ATTRB=(ASKIP),                                         X00380   
               COLOR=BLUE,                                             X00381   
               LENGTH=8,                                               X00382   
               POS=(12,71)                                              00383   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00384   
*                                                                       00385   
*  SCREEN LINE 14                                                       00386   
*                                                                       00387   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00388   
ASEL08   DFHMDF ATTRB=(UNPROT,IC),                                     X00389   
               COLOR=GREEN,                                            X00390   
               HILIGHT=UNDERLINE,                                      X00391   
               LENGTH=1,                                               X00392   
               POS=(13,2)                                               00393   
         DFHMDF ATTRB=(ASKIP),                                         X00394   
               POS=(13,4),                                             X00395   
               INITIAL=' ',                                            X00396   
               LENGTH=1                                                 00397   
AACT08   DFHMDF ATTRB=(ASKIP),                                         X00398   
               COLOR=BLUE,                                             X00399   
               LENGTH=3,                                               X00400   
               POS=(13,6)                                               00401   
ADOC08   DFHMDF ATTRB=(ASKIP),                                         X00402   
               COLOR=BLUE,                                             X00403   
               LENGTH=25,                                              X00404   
               POS=(13,12)                                              00405   
AVND08   DFHMDF ATTRB=(ASKIP),                                         X00406   
               COLOR=BLUE,                                             X00407   
               LENGTH=10,                                              X00408   
               POS=(13,39)                                              00409   
AEDOC08  DFHMDF ATTRB=(ASKIP),                                         X00410   
               COLOR=BLUE,                                             X00411   
               LENGTH=3,                                               X00412   
               POS=(13,53)                                              00413   
AHDT08   DFHMDF ATTRB=(ASKIP),                                         X00414   
               COLOR=BLUE,                                             X00415   
               LENGTH=8,                                               X00416   
               POS=(13,61)                                              00417   
ARDT08   DFHMDF ATTRB=(ASKIP),                                         X00418   
               COLOR=BLUE,                                             X00419   
               LENGTH=8,                                               X00420   
               POS=(13,71)                                              00421   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00422   
*                                                                       00423   
*  SCREEN LINE 15                                                       00424   
*                                                                       00425   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00426   
ASEL09   DFHMDF ATTRB=(UNPROT,IC),                                     X00427   
               COLOR=GREEN,                                            X00428   
               HILIGHT=UNDERLINE,                                      X00429   
               LENGTH=1,                                               X00430   
               POS=(14,2)                                               00431   
         DFHMDF ATTRB=(ASKIP),                                         X00432   
               POS=(14,4),                                             X00433   
               INITIAL=' ',                                            X00434   
               LENGTH=1                                                 00435   
AACT09   DFHMDF ATTRB=(ASKIP),                                         X00436   
               COLOR=BLUE,                                             X00437   
               LENGTH=3,                                               X00438   
               POS=(14,6)                                               00439   
ADOC09   DFHMDF ATTRB=(ASKIP),                                         X00440   
               COLOR=BLUE,                                             X00441   
               LENGTH=25,                                              X00442   
               POS=(14,12)                                              00443   
AVND09   DFHMDF ATTRB=(ASKIP),                                         X00444   
               COLOR=BLUE,                                             X00445   
               LENGTH=10,                                              X00446   
               POS=(14,39)                                              00447   
AEDOC09  DFHMDF ATTRB=(ASKIP),                                         X00448   
               COLOR=BLUE,                                             X00449   
               LENGTH=3,                                               X00450   
               POS=(14,53)                                              00451   
AHDT09   DFHMDF ATTRB=(ASKIP),                                         X00452   
               COLOR=BLUE,                                             X00453   
               LENGTH=8,                                               X00454   
               POS=(14,61)                                              00455   
ARDT09   DFHMDF ATTRB=(ASKIP),                                         X00456   
               COLOR=BLUE,                                             X00457   
               LENGTH=8,                                               X00458   
               POS=(14,71)                                              00459   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00460   
*                                                                       00461   
*  SCREEN LINE 16                                                       00462   
*                                                                       00463   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00464   
ASEL10   DFHMDF ATTRB=(UNPROT,IC),                                     X00465   
               COLOR=GREEN,                                            X00466   
               HILIGHT=UNDERLINE,                                      X00467   
               LENGTH=1,                                               X00468   
               POS=(15,2)                                               00469   
         DFHMDF ATTRB=(ASKIP),                                         X00470   
               POS=(15,4),                                             X00471   
               INITIAL=' ',                                            X00472   
               LENGTH=1                                                 00473   
AACT10   DFHMDF ATTRB=(ASKIP),                                         X00474   
               COLOR=BLUE,                                             X00475   
               LENGTH=3,                                               X00476   
               POS=(15,6)                                               00477   
ADOC10   DFHMDF ATTRB=(ASKIP),                                         X00478   
               COLOR=BLUE,                                             X00479   
               LENGTH=25,                                              X00480   
               POS=(15,12)                                              00481   
AVND10   DFHMDF ATTRB=(ASKIP),                                         X00482   
               COLOR=BLUE,                                             X00483   
               LENGTH=10,                                              X00484   
               POS=(15,39)                                              00485   
AEDOC10  DFHMDF ATTRB=(ASKIP),                                         X00486   
               COLOR=BLUE,                                             X00487   
               LENGTH=3,                                               X00488   
               POS=(15,53)                                              00489   
AHDT10   DFHMDF ATTRB=(ASKIP),                                         X00490   
               COLOR=BLUE,                                             X00491   
               LENGTH=8,                                               X00492   
               POS=(15,61)                                              00493   
ARDT10   DFHMDF ATTRB=(ASKIP),                                         X00494   
               COLOR=BLUE,                                             X00495   
               LENGTH=8,                                               X00496   
               POS=(15,71)                                              00497   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00498   
*                                                                       00499   
*  SCREEN LINE 17                                                       00500   
*                                                                       00501   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00502   
ASEL11   DFHMDF ATTRB=(UNPROT,IC),                                     X00503   
               COLOR=GREEN,                                            X00504   
               HILIGHT=UNDERLINE,                                      X00505   
               LENGTH=1,                                               X00506   
               POS=(16,2)                                               00507   
         DFHMDF ATTRB=(ASKIP),                                         X00508   
               POS=(16,4),                                             X00509   
               INITIAL=' ',                                            X00510   
               LENGTH=1                                                 00511   
AACT11   DFHMDF ATTRB=(ASKIP),                                         X00512   
               COLOR=BLUE,                                             X00513   
               LENGTH=3,                                               X00514   
               POS=(16,6)                                               00515   
ADOC11   DFHMDF ATTRB=(ASKIP),                                         X00516   
               COLOR=BLUE,                                             X00517   
               LENGTH=25,                                              X00518   
               POS=(16,12)                                              00519   
AVND11   DFHMDF ATTRB=(ASKIP),                                         X00520   
               COLOR=BLUE,                                             X00521   
               LENGTH=10,                                              X00522   
               POS=(16,39)                                              00523   
AEDOC11  DFHMDF ATTRB=(ASKIP),                                         X00524   
               COLOR=BLUE,                                             X00525   
               LENGTH=3,                                               X00526   
               POS=(16,53)                                              00527   
AHDT11   DFHMDF ATTRB=(ASKIP),                                         X00528   
               COLOR=BLUE,                                             X00529   
               LENGTH=8,                                               X00530   
               POS=(16,61)                                              00531   
ARDT11   DFHMDF ATTRB=(ASKIP),                                         X00532   
               COLOR=BLUE,                                             X00533   
               LENGTH=8,                                               X00534   
               POS=(16,71)                                              00535   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00536   
*                                                                       00537   
*  SCREEN LINE 18                                                       00538   
*                                                                       00539   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00540   
ASEL12   DFHMDF ATTRB=(UNPROT,IC),                                     X00541   
               COLOR=GREEN,                                            X00542   
               HILIGHT=UNDERLINE,                                      X00543   
               LENGTH=1,                                               X00544   
               POS=(17,2)                                               00545   
         DFHMDF ATTRB=(ASKIP),                                         X00546   
               POS=(17,4),                                             X00547   
               INITIAL=' ',                                            X00548   
               LENGTH=1                                                 00549   
AACT12   DFHMDF ATTRB=(ASKIP),                                         X00550   
               COLOR=BLUE,                                             X00551   
               LENGTH=3,                                               X00552   
               POS=(17,6)                                               00553   
ADOC12   DFHMDF ATTRB=(ASKIP),                                         X00554   
               COLOR=BLUE,                                             X00555   
               LENGTH=25,                                              X00556   
               POS=(17,12)                                              00557   
AVND12   DFHMDF ATTRB=(ASKIP),                                         X00558   
               COLOR=BLUE,                                             X00559   
               LENGTH=10,                                              X00560   
               POS=(17,39)                                              00561   
AEDOC12  DFHMDF ATTRB=(ASKIP),                                         X00562   
               COLOR=BLUE,                                             X00563   
               LENGTH=3,                                               X00564   
               POS=(17,53)                                              00565   
AHDT12   DFHMDF ATTRB=(ASKIP),                                         X00566   
               COLOR=BLUE,                                             X00567   
               LENGTH=8,                                               X00568   
               POS=(17,61)                                              00569   
ARDT12   DFHMDF ATTRB=(ASKIP),                                         X00570   
               COLOR=BLUE,                                             X00571   
               LENGTH=8,                                               X00572   
               POS=(17,71)                                              00573   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00574   
*                                                                       00575   
*  SCREEN LINE 20                                                       00576   
*                                                                       00577   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00578   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00579   
               INITIAL='NUMBER',                                       X00580   
               COLOR=NEUTRAL,                                          X00581   
               LENGTH=6,                                               X00582   
               POS=(19,39)                                              00583   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00584   
               INITIAL='OF',                                           X00585   
               COLOR=NEUTRAL,                                          X00586   
               LENGTH=2,                                               X00587   
               POS=(19,46)                                              00588   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00589   
               INITIAL='SELECTED',                                     X00590   
               COLOR=NEUTRAL,                                          X00591   
               LENGTH=8,                                               X00592   
               POS=(19,49)                                              00593   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00594   
               INITIAL='ITEMS:',                                       X00595   
               COLOR=NEUTRAL,                                          X00596   
               LENGTH=6,                                               X00597   
               POS=(19,58)                                              00598   
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00599   
               JUSTIFY=(LEFT,BLANK),                                   X00600   
               COLOR=BLUE,                                             X00601   
               PICOUT='ZZZZZZ9',                                       X00602   
               LENGTH=7,                                               X00603   
               POS=(19,67)                                              00604   
         DFHMSD TYPE=FINAL                                              00605   
         END                                                            00606   
