*          DATA SET ETKM307    AT LEVEL 007 AS OF 03/03/94                      
  PRINT  NOGEN                                                          00001   
************************************************************            00002   
*                                                                       00003   
*  ETCTI - ETKM307_-_TRADING_PARTNER_INQ                                00004   
*                                                                       00005   
*     GENERATED          : 01/25/94 AT 04:49:08 PM                      00006**2
*     VERSION            : 2.7.01                                       00007   
*     CSD LEVEL          : 2.7.01                                       00008   
*     AUTHOR             : JOANN SCHMIDT.                               00009   
*     INSTALLATION       : KOHLS DEPARTMENT STORES.                     00010   
*     ENCYCLOPEDIA       : NEW EDI SYSTEM                               00011   
*     ENCYCLOPEDIA PATH  : C:\ADW_ENC\NWEDI\                            00012   
*     MAP DETAILS                                                       00013   
*     LAST UPDATED 12/09/1993 AT 09:07:07 BY TKMA088                    00014**2
*-----------------------------------------------------------            00015   
*                                                                       00016   
*  BMS MAPSET :  ETKM307                                                00017   
*      MAP    :  ET307A                                                 00018   
************************************************************            00019   
ETKM307  DFHMSD TYPE=DSECT,                                            X00020   
               CTRL=(FREEKB),                                          X00021   
               TERM=3270-2,                                            X00022   
               LANG=COBOL,                                             X00023   
               MODE=INOUT,                                             X00024   
               TIOAPFX=YES,                                            X00025   
               STORAGE=AUTO                                             00026   
ET307A   DFHMDI LINE=2,                                                X00027   
               COLUMN=1,                                               X00028   
               SIZE=(19,80),                                           X00029   
               MAPATTS=(COLOR,HILIGHT),                                X00030   
               DSATTS=(COLOR,HILIGHT)                                   00031   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00032   
               POS=(01,1),                                             X00033   
               INITIAL=' ',                                            X00034   
               LENGTH=1                                                 00035   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00036   
               INITIAL='VENDOR NAME :',                                X00037**2
               COLOR=NEUTRAL,                                          X00038**5
               LENGTH=13,                                              X00039**2
               POS=(02,1)                                               00040   
VNDRNME  DFHMDF ATTRB=(ASKIP),                                         X00041**5
               JUSTIFY=(LEFT,BLANK),                                   X00042**5
               COLOR=BLUE,                                             X00043**5
               LENGTH=30,                                              X00044**2
               POS=(02,16)                                              00045   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00046   
               INITIAL=' ',                                            X00047   
               LENGTH=1,                                               X00048   
               POS=(02,47)                                              00049**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00054   
               INITIAL='SVC LEVEL.:',                                  X00055**2
               COLOR=NEUTRAL,                                          X00056**5
               LENGTH=11,                                              X00057**2
               POS=(02,51)                                              00058**7
SVCLVL   DFHMDF ATTRB=(ASKIP),                                         X00059**5
               JUSTIFY=(LEFT,BLANK),                                   X00060**5
               COLOR=BLUE,                                             X00061**5
               LENGTH=3,                                               X00062   
               POS=(02,63)                                              00063**7
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00064   
               INITIAL=' ',                                            X00065   
               LENGTH=1,                                               X00066   
               POS=(02,67)                                              00067**7
         DFHMDF ATTRB=(ASKIP),                                         X00050   
               POS=(03,1),                                             X00051   
               INITIAL=' ',                                            X00052   
               LENGTH=1                                                 00053   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00092   
               INITIAL='NETWORK...:',                                  X00093   
               COLOR=NEUTRAL,                                          X00094**5
               LENGTH=11,                                              X00095   
               POS=(03,51)                                              00096**7
NTWKCDE  DFHMDF ATTRB=(ASKIP),                                         X00097**5
               JUSTIFY=(LEFT,BLANK),                                   X00098**5
               COLOR=BLUE,                                             X00099**5
               LENGTH=1,                                               X00100   
               POS=(03,63)                                              00101**7
NETWORK  DFHMDF ATTRB=(ASKIP),                                         X00102**5
               JUSTIFY=(LEFT,BLANK),                                   X00103**5
               COLOR=BLUE,                                             X00104**5
               LENGTH=15,                                              X00105   
               POS=(03,65)                                              00106**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00068   
               INITIAL='VENDOR TP ID QUALIF:',                         X00069**2
               COLOR=NEUTRAL,                                          X00070**5
               LENGTH=20,                                              X00071**2
               POS=(04,1)                                               00072   
VTPIDQ   DFHMDF ATTRB=(ASKIP),                                         X00073**5
               JUSTIFY=(LEFT,BLANK),                                   X00074**5
               COLOR=BLUE,                                             X00075**5
               LENGTH=2,                                               X00076   
               POS=(04,22)                                              00077   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00078   
               INITIAL='TP ID :',                                      X00079**6
               COLOR=NEUTRAL,                                          X00080**5
               LENGTH=7,                                               X00081**6
               POS=(04,25)                                              00082   
VTPID    DFHMDF ATTRB=(ASKIP),                                         X00083**5
               JUSTIFY=(LEFT,BLANK),                                   X00084**5
               COLOR=BLUE,                                             X00085**5
               LENGTH=15,                                              X00086   
               POS=(04,33)                                              00087**6
         DFHMDF ATTRB=(ASKIP),                                         X00088   
               POS=(04,49),                                            X00089   
               INITIAL=' ',                                            X00090   
               LENGTH=1                                                 00091   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00146   
               INITIAL='INTERCNCT.:',                                  X00147   
               COLOR=NEUTRAL,                                          X00148**5
               LENGTH=11,                                              X00149   
               POS=(04,51)                                              00150**7
ICNTCDE  DFHMDF ATTRB=(ASKIP),                                         X00151**5
               JUSTIFY=(LEFT,BLANK),                                   X00152**5
               COLOR=BLUE,                                             X00153**5
               LENGTH=1,                                               X00154   
               POS=(04,63)                                              00155**7
INTRCNT  DFHMDF ATTRB=(ASKIP),                                         X00156**5
               JUSTIFY=(LEFT,BLANK),                                   X00157**5
               COLOR=BLUE,                                             X00158**5
               LENGTH=15,                                              X00159   
               POS=(04,65)                                              00160**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00107   
               INITIAL='KOHLS',                                        X00108   
               COLOR=NEUTRAL,                                          X00109**5
               LENGTH=5,                                               X00110   
               POS=(05,2)                                               00111   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00112   
               INITIAL='TP',                                           X00113   
               COLOR=NEUTRAL,                                          X00114**5
               LENGTH=2,                                               X00115   
               POS=(05,8)                                               00116   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00117   
               INITIAL='ID',                                           X00118   
               COLOR=NEUTRAL,                                          X00119**5
               LENGTH=2,                                               X00120   
               POS=(05,11)                                              00121   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00122   
               INITIAL='QUALIF:',                                      X00123   
               COLOR=NEUTRAL,                                          X00124**5
               LENGTH=7,                                               X00125   
               POS=(05,14)                                              00126   
KTPIDQ   DFHMDF ATTRB=(ASKIP),                                         X00127**5
               JUSTIFY=(LEFT,BLANK),                                   X00128**5
               COLOR=BLUE,                                             X00129**5
               LENGTH=2,                                               X00130   
               POS=(05,22)                                              00131   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00132   
               INITIAL='TP ID :',                                      X00133**6
               COLOR=NEUTRAL,                                          X00134**5
               LENGTH=7,                                               X00135**6
               POS=(05,25)                                              00136   
KTPID    DFHMDF ATTRB=(ASKIP),                                         X00137**5
               JUSTIFY=(LEFT,BLANK),                                   X00138**5
               COLOR=BLUE,                                             X00139**5
               LENGTH=15,                                              X00140   
               POS=(05,33)                                              00141**6
         DFHMDF ATTRB=(ASKIP),                                         X00142   
               POS=(05,49),                                            X00143   
               INITIAL=' ',                                            X00144   
               LENGTH=1                                                 00145   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00146   
               INITIAL='FA COM MTH:',                                  X00147   
               COLOR=NEUTRAL,                                          X00148**5
               LENGTH=11,                                              X00149   
               POS=(05,51)                                              00150**7
FACMTH   DFHMDF ATTRB=(ASKIP),                                         X00151**5
               JUSTIFY=(LEFT,BLANK),                                   X00152**5
               COLOR=BLUE,                                             X00153**5
               LENGTH=1,                                               X00154   
               POS=(05,63)                                              00155**7
FACNME   DFHMDF ATTRB=(ASKIP),                                         X00156**5
               JUSTIFY=(LEFT,BLANK),                                   X00157**5
               COLOR=BLUE,                                             X00158**5
               LENGTH=5,                                               X00159   
               POS=(05,65)                                              00160**7
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00161   
               POS=(06,1),                                             X00162   
               INITIAL=' ',                                            X00163   
               LENGTH=1                                                 00164   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00165   
               INITIAL='LAST',                                         X00166   
               COLOR=NEUTRAL,                                          X00167**5
               LENGTH=4,                                               X00168   
               POS=(07,1)                                               00169   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00170   
               INITIAL='SENT',                                         X00171   
               COLOR=NEUTRAL,                                          X00172**5
               LENGTH=4,                                               X00173   
               POS=(07,6)                                               00174   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00175   
               INITIAL='CONTROL',                                      X00176   
               COLOR=NEUTRAL,                                          X00177**5
               LENGTH=7,                                               X00178   
               POS=(07,11)                                              00179   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00180   
               INITIAL='#:',                                           X00181   
               COLOR=NEUTRAL,                                          X00182**5
               LENGTH=2,                                               X00183   
               POS=(07,19)                                              00184   
SCTLNBR  DFHMDF ATTRB=(ASKIP),                                         X00185**5
               JUSTIFY=(LEFT,BLANK),                                   X00186**5
               COLOR=BLUE,                                             X00187**5
               PICOUT='999999999',                                     X00188**4
               LENGTH=9,                                               X00189   
               POS=(07,22)                                              00190   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00191   
               INITIAL='METHOD:',                                      X00192   
               COLOR=NEUTRAL,                                          X00193**5
               LENGTH=7,                                               X00194   
               POS=(07,32)                                              00195   
SCTLMTH  DFHMDF ATTRB=(ASKIP),                                         X00196**5
               JUSTIFY=(LEFT,BLANK),                                   X00197**5
               COLOR=BLUE,                                             X00198**5
               LENGTH=1,                                               X00199   
               POS=(07,40)                                              00200   
SNDMTHD  DFHMDF ATTRB=(ASKIP),                                         X00201**5
               JUSTIFY=(LEFT,BLANK),                                   X00202**5
               COLOR=BLUE,                                             X00203**5
               LENGTH=8,                                               X00204   
               POS=(07,42)                                              00205   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00206   
               INITIAL='INTERCHG',                                     X00207   
               COLOR=NEUTRAL,                                          X00208**5
               LENGTH=8,                                               X00209   
               POS=(07,51)                                              00210**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00211   
               INITIAL='VERSION:',                                     X00212   
               COLOR=NEUTRAL,                                          X00213**5
               LENGTH=8,                                               X00214   
               POS=(07,60)                                              00215**7
SFMTNME  DFHMDF ATTRB=(ASKIP),                                         X00216**5
               JUSTIFY=(LEFT,BLANK),                                   X00217**5
               COLOR=BLUE,                                             X00218**5
               LENGTH=1,                                               X00219   
               POS=(07,69)                                              00220**7
SFMTVER  DFHMDF ATTRB=(ASKIP),                                         X00221**5
               JUSTIFY=(LEFT,BLANK),                                   X00222**5
               COLOR=BLUE,                                             X00223**5
               LENGTH=5,                                               X00224   
               POS=(07,72)                                              00225**7
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00226   
               INITIAL=' ',                                            X00227   
               LENGTH=1,                                               X00228   
               POS=(07,78)                                              00229**7
         DFHMDF ATTRB=(ASKIP),                                         X00230   
               POS=(08,1),                                             X00231   
               INITIAL=' ',                                            X00232   
               LENGTH=1                                                 00233   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00234   
               INITIAL='OVERRIDE.:',                                   X00235   
               COLOR=NEUTRAL,                                          X00236**5
               LENGTH=10,                                              X00237   
               POS=(08,11)                                              00238   
SOVRDN   DFHMDF ATTRB=(ASKIP),                                         X00239**5
               JUSTIFY=(LEFT,BLANK),                                   X00240**5
               COLOR=BLUE,                                             X00241**5
               PICOUT='999999999',                                     X00242**4
               LENGTH=9,                                               X00243   
               POS=(08,22)                                              00244   
SNDOVRD  DFHMDF ATTRB=(ASKIP),                                         X00245**5
               JUSTIFY=(LEFT,BLANK),                                   X00246**5
               COLOR=BLUE,                                             X00247**5
               LENGTH=1,                                               X00248   
               POS=(08,34)                                              00249**6
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00250   
               INITIAL=' ',                                            X00251   
               LENGTH=1,                                               X00252   
               POS=(08,36)                                              00253**6
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00254   
               INITIAL='LAST',                                         X00255   
               COLOR=NEUTRAL,                                          X00256**5
               LENGTH=4,                                               X00257   
               POS=(09,1)                                               00258   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00259   
               INITIAL='RECV',                                         X00260   
               COLOR=NEUTRAL,                                          X00261**5
               LENGTH=4,                                               X00262   
               POS=(09,6)                                               00263   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00264   
               INITIAL='CONTROL',                                      X00265   
               COLOR=NEUTRAL,                                          X00266**5
               LENGTH=7,                                               X00267   
               POS=(09,11)                                              00268   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00269   
               INITIAL='#:',                                           X00270   
               COLOR=NEUTRAL,                                          X00271**5
               LENGTH=2,                                               X00272   
               POS=(09,19)                                              00273   
RCTLNBR  DFHMDF ATTRB=(ASKIP),                                         X00274**5
               JUSTIFY=(LEFT,BLANK),                                   X00275**5
               COLOR=BLUE,                                             X00276**5
               PICOUT='999999999',                                     X00277**4
               LENGTH=9,                                               X00278   
               POS=(09,22)                                              00279   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00280   
               INITIAL='METHOD:',                                      X00281   
               COLOR=NEUTRAL,                                          X00282**5
               LENGTH=7,                                               X00283   
               POS=(09,32)                                              00284   
RCTLMTH  DFHMDF ATTRB=(ASKIP),                                         X00285**5
               JUSTIFY=(LEFT,BLANK),                                   X00286**5
               COLOR=BLUE,                                             X00287**5
               LENGTH=1,                                               X00288   
               POS=(09,40)                                              00289   
RCVMTHD  DFHMDF ATTRB=(ASKIP),                                         X00290**5
               JUSTIFY=(LEFT,BLANK),                                   X00291**5
               COLOR=BLUE,                                             X00292**5
               LENGTH=8,                                               X00293   
               POS=(09,42)                                              00294   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00295   
               INITIAL='INTERCHG',                                     X00296   
               COLOR=NEUTRAL,                                          X00297**5
               LENGTH=8,                                               X00298   
               POS=(09,51)                                              00299**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00300   
               INITIAL='VERSION:',                                     X00301   
               COLOR=NEUTRAL,                                          X00302**5
               LENGTH=8,                                               X00303   
               POS=(09,60)                                              00304**7
RFMTNME  DFHMDF ATTRB=(ASKIP),                                         X00305**5
               JUSTIFY=(LEFT,BLANK),                                   X00306**5
               COLOR=BLUE,                                             X00307**5
               LENGTH=1,                                               X00308   
               POS=(09,69)                                              00309**7
RFMTVER  DFHMDF ATTRB=(ASKIP),                                         X00310**5
               JUSTIFY=(LEFT,BLANK),                                   X00311**5
               COLOR=BLUE,                                             X00312**5
               LENGTH=5,                                               X00313   
               POS=(09,72)                                              00314**7
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00315   
               INITIAL=' ',                                            X00316   
               LENGTH=1,                                               X00317   
               POS=(09,78)                                              00318**7
         DFHMDF ATTRB=(ASKIP),                                         X00319   
               POS=(10,1),                                             X00320   
               INITIAL=' ',                                            X00321   
               LENGTH=1                                                 00322   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00323   
               INITIAL='OVERRIDE.:',                                   X00324   
               COLOR=NEUTRAL,                                          X00325**5
               LENGTH=10,                                              X00326   
               POS=(10,11)                                              00327   
ROVRDN   DFHMDF ATTRB=(ASKIP),                                         X00328**5
               JUSTIFY=(LEFT,BLANK),                                   X00329**5
               COLOR=BLUE,                                             X00330**5
               PICOUT='999999999',                                     X00331**4
               LENGTH=9,                                               X00332   
               POS=(10,22)                                              00333   
RCVOVRD  DFHMDF ATTRB=(ASKIP),                                         X00334**5
               JUSTIFY=(LEFT,BLANK),                                   X00335**5
               COLOR=BLUE,                                             X00336**5
               LENGTH=1,                                               X00337   
               POS=(10,34)                                              00338**6
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00339   
               INITIAL=' ',                                            X00340   
               LENGTH=1,                                               X00341   
               POS=(10,36)                                              00342**6
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00343   
               POS=(11,1),                                             X00344   
               INITIAL=' ',                                            X00345   
               LENGTH=1                                                 00346   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00347   
               INITIAL='SETUP',                                        X00348   
               COLOR=NEUTRAL,                                          X00349**5
               LENGTH=5,                                               X00350   
               POS=(12,1)                                               00351**6
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00352   
               INITIAL='DATE....:',                                    X00353   
               COLOR=NEUTRAL,                                          X00354**5
               LENGTH=9,                                               X00355   
               POS=(12,7)                                               00356**6
STUPDTE  DFHMDF ATTRB=(ASKIP),                                         X00357**5
               JUSTIFY=(LEFT,BLANK),                                   X00358**5
               COLOR=BLUE,                                             X00359**5
               LENGTH=10,                                              X00360   
               POS=(12,17)                                              00361**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00362   
               INITIAL='LAST',                                         X00363   
               COLOR=NEUTRAL,                                          X00364**5
               LENGTH=4,                                               X00365   
               POS=(12,32)                                              00366**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00367   
               INITIAL='CHGD',                                         X00368   
               COLOR=NEUTRAL,                                          X00369**5
               LENGTH=4,                                               X00370   
               POS=(12,37)                                              00371**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00372   
               INITIAL='DATE:',                                        X00373   
               COLOR=NEUTRAL,                                          X00374**5
               LENGTH=5,                                               X00375   
               POS=(12,42)                                              00376**7
LCHGDTE  DFHMDF ATTRB=(ASKIP),                                         X00377**5
               JUSTIFY=(LEFT,BLANK),                                   X00378**5
               COLOR=BLUE,                                             X00379**5
               LENGTH=10,                                              X00380   
               POS=(12,48)                                              00381**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00382   
               INITIAL='USERID:',                                      X00383**6
               COLOR=NEUTRAL,                                          X00384**5
               LENGTH=7,                                               X00385**7
               POS=(12,60)                                              00386**7
USERID   DFHMDF ATTRB=(ASKIP),                                         X00387**5
               JUSTIFY=(LEFT,BLANK),                                   X00388**5
               COLOR=BLUE,                                             X00389**5
               LENGTH=8,                                               X00390   
               POS=(12,68)                                              00391**7
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00392   
               INITIAL=' ',                                            X00393   
               LENGTH=1,                                               X00394   
               POS=(12,77)                                              00395**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00396   
               INITIAL='ACTIVE',                                       X00397   
               COLOR=NEUTRAL,                                          X00398**5
               LENGTH=6,                                               X00399   
               POS=(13,1)                                               00400**6
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00401   
               INITIAL='DATE...:',                                     X00402   
               COLOR=NEUTRAL,                                          X00403**5
               LENGTH=8,                                               X00404   
               POS=(13,8)                                               00405**6
ACTVDTE  DFHMDF ATTRB=(ASKIP),                                         X00406**5
               JUSTIFY=(LEFT,BLANK),                                   X00407**5
               COLOR=BLUE,                                             X00408**5
               LENGTH=10,                                              X00409   
               POS=(13,17)                                              00410**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00411   
               INITIAL='INACTIVE',                                     X00412   
               COLOR=NEUTRAL,                                          X00413**5
               LENGTH=8,                                               X00414   
               POS=(13,32)                                              00415**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00416   
               INITIAL='DATE.:',                                       X00417   
               COLOR=NEUTRAL,                                          X00418**5
               LENGTH=6,                                               X00419   
               POS=(13,41)                                              00420**7
INACTVD  DFHMDF ATTRB=(ASKIP),                                         X00421**5
               JUSTIFY=(LEFT,BLANK),                                   X00422**5
               COLOR=BLUE,                                             X00423**5
               LENGTH=10,                                              X00424   
               POS=(13,48)                                              00425**7
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00426   
               INITIAL=' ',                                            X00427   
               LENGTH=1,                                               X00428   
               POS=(13,59)                                              00429**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00430   
               INITIAL='LAST',                                         X00431   
               COLOR=NEUTRAL,                                          X00432**5
               LENGTH=4,                                               X00433   
               POS=(14,1)                                               00434**6
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00435   
               INITIAL='CALL',                                         X00436   
               COLOR=NEUTRAL,                                          X00437**5
               LENGTH=4,                                               X00438   
               POS=(14,6)                                               00439**6
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00440   
               INITIAL='DATE:',                                        X00441   
               COLOR=NEUTRAL,                                          X00442**5
               LENGTH=5,                                               X00443   
               POS=(14,11)                                              00444**6
LCNTDTE  DFHMDF ATTRB=(ASKIP),                                         X00445**5
               JUSTIFY=(LEFT,BLANK),                                   X00446**5
               COLOR=BLUE,                                             X00447**5
               LENGTH=10,                                              X00448   
               POS=(14,17)                                              00449**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00450   
               INITIAL='NEXT',                                         X00451   
               COLOR=NEUTRAL,                                          X00452**5
               LENGTH=4,                                               X00453   
               POS=(14,32)                                              00454**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00455   
               INITIAL='CALL',                                         X00456   
               COLOR=NEUTRAL,                                          X00457**5
               LENGTH=4,                                               X00458   
               POS=(14,37)                                              00459**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00460   
               INITIAL='DATE:',                                        X00461   
               COLOR=NEUTRAL,                                          X00462**5
               LENGTH=5,                                               X00463   
               POS=(14,42)                                              00464**7
NCNTDTE  DFHMDF ATTRB=(ASKIP),                                         X00465**5
               JUSTIFY=(LEFT,BLANK),                                   X00466**5
               COLOR=BLUE,                                             X00467**5
               LENGTH=10,                                              X00468   
               POS=(14,48)                                              00469**7
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00470   
               INITIAL=' ',                                            X00471   
               LENGTH=1,                                               X00472   
               POS=(14,59)                                              00473**7
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00474   
               POS=(15,1),                                             X00475   
               INITIAL=' ',                                            X00476   
               LENGTH=1                                                 00477   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00478   
               INITIAL='SEND',                                         X00479   
               COLOR=NEUTRAL,                                          X00480**5
               LENGTH=4,                                               X00481   
               POS=(16,1)                                               00482   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00483   
               INITIAL='DATA',                                         X00484   
               COLOR=NEUTRAL,                                          X00485**5
               LENGTH=4,                                               X00486   
               POS=(16,6)                                               00487   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00488   
               INITIAL='ELEMENT',                                      X00489   
               COLOR=NEUTRAL,                                          X00490**5
               LENGTH=7,                                               X00491   
               POS=(16,11)                                              00492   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00493   
               INITIAL='SEP:',                                         X00494   
               COLOR=NEUTRAL,                                          X00495**5
               LENGTH=4,                                               X00496   
               POS=(16,19)                                              00497   
SNDDESP  DFHMDF ATTRB=(ASKIP),                                         X00498**5
               JUSTIFY=(LEFT,BLANK),                                   X00499**5
               COLOR=BLUE,                                             X00500**5
               LENGTH=2,                                               X00501   
               POS=(16,24)                                              00502   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00503   
               INITIAL='=',                                            X00504   
               COLOR=NEUTRAL,                                          X00505**5
               LENGTH=1,                                               X00506   
               POS=(16,27)                                              00507   
SNDDEX   DFHMDF ATTRB=(ASKIP),                                         X00508**5
               JUSTIFY=(LEFT,BLANK),                                   X00509**5
               COLOR=BLUE,                                             X00510**5
               LENGTH=1,                                               X00511   
               POS=(16,29)                                              00512   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00513   
               INITIAL='SEGMENT',                                      X00514   
               COLOR=NEUTRAL,                                          X00515**5
               LENGTH=7,                                               X00516   
               POS=(16,32)                                              00517   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00518   
               INITIAL='TERM:',                                        X00519   
               COLOR=NEUTRAL,                                          X00520**5
               LENGTH=5,                                               X00521   
               POS=(16,40)                                              00522   
SEGTERM  DFHMDF ATTRB=(ASKIP),                                         X00523**5
               JUSTIFY=(LEFT,BLANK),                                   X00524**5
               COLOR=BLUE,                                             X00525**5
               LENGTH=2,                                               X00526   
               POS=(16,46)                                              00527   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00528   
               INITIAL='=',                                            X00529   
               COLOR=NEUTRAL,                                          X00530**5
               LENGTH=1,                                               X00531   
               POS=(16,49)                                              00532   
SEGTRMX  DFHMDF ATTRB=(ASKIP),                                         X00533**5
               JUSTIFY=(LEFT,BLANK),                                   X00534**5
               COLOR=BLUE,                                             X00535**5
               LENGTH=1,                                               X00536   
               POS=(16,51)                                              00537   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00538   
               INITIAL='SUB',                                          X00539   
               COLOR=NEUTRAL,                                          X00540**5
               LENGTH=3,                                               X00541   
               POS=(16,54)                                              00542   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00543   
               INITIAL='ELEMENT',                                      X00544   
               COLOR=NEUTRAL,                                          X00545**5
               LENGTH=7,                                               X00546   
               POS=(16,58)                                              00547   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00548   
               INITIAL='SEP:',                                         X00549   
               COLOR=NEUTRAL,                                          X00550**5
               LENGTH=4,                                               X00551   
               POS=(16,66)                                              00552   
SUBESEP  DFHMDF ATTRB=(ASKIP),                                         X00553**5
               JUSTIFY=(LEFT,BLANK),                                   X00554**5
               COLOR=BLUE,                                             X00555**5
               LENGTH=2,                                               X00556   
               POS=(16,71)                                              00557   
         DFHMDF ATTRB=(ASKIP),                                         X00558**5
               INITIAL='=',                                            X00559   
               COLOR=NEUTRAL,                                          X00560**5
               LENGTH=1,                                               X00561   
               POS=(16,74)                                              00562   
SUBESPX  DFHMDF ATTRB=(ASKIP),                                         X00563**5
               JUSTIFY=(LEFT,BLANK),                                   X00564**5
               COLOR=BLUE,                                             X00565**5
               LENGTH=1,                                               X00566   
               POS=(16,76)                                              00567   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00568   
               INITIAL=' ',                                            X00569   
               LENGTH=1,                                               X00570   
               POS=(16,78)                                              00571   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00572   
               POS=(17,1),                                             X00573   
               INITIAL=' ',                                            X00574   
               LENGTH=1                                                 00575   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00576   
               INITIAL='MISCELLANEOUS',                                X00577   
               COLOR=NEUTRAL,                                          X00578**5
               LENGTH=13,                                              X00579   
               POS=(18,1)                                               00580   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00581   
               INITIAL='NOTES',                                        X00582   
               COLOR=NEUTRAL,                                          X00583**5
               LENGTH=5,                                               X00584   
               POS=(18,15)                                              00585   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00586   
               INITIAL=':',                                            X00587   
               COLOR=NEUTRAL,                                          X00588**5
               LENGTH=1,                                               X00589   
               POS=(18,21)                                              00590   
NOTES1   DFHMDF ATTRB=(ASKIP),                                         X00591**5
               JUSTIFY=(LEFT,BLANK),                                   X00592**5
               COLOR=BLUE,                                             X00593**5
               HILIGHT=UNDERLINE,                                      X00594   
               LENGTH=40,                                              X00595   
               POS=(18,24)                                              00596**7
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00597   
               INITIAL=' ',                                            X00598   
               LENGTH=1,                                               X00599   
               POS=(18,65)                                              00600**7
         DFHMDF ATTRB=(ASKIP),                                         X00601   
               POS=(19,1),                                             X00602   
               INITIAL=' ',                                            X00603   
               LENGTH=1                                                 00604   
NOTES2   DFHMDF ATTRB=(ASKIP),                                         X00605**5
               JUSTIFY=(LEFT,BLANK),                                   X00606**5
               COLOR=BLUE,                                             X00607**5
               HILIGHT=UNDERLINE,                                      X00608   
               LENGTH=40,                                              X00609   
               POS=(19,24)                                              00610**7
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00611   
               INITIAL=' ',                                            X00612   
               LENGTH=1,                                               X00613   
               POS=(19,65)                                              00614**7
         DFHMSD TYPE=FINAL                                              00615   
         END                                                            00616   
