*          DATA SET ETKM335    AT LEVEL 012 AS OF 02/02/94                      
  PRINT  NOGEN                                                          00001   
************************************************************            00002   
*  BMS MAPSET :  ETKM335 - EDI NETWORK LIST                             00003*11
*      MAP    :  ET335A                                                 00004   
************************************************************            00005   
ETKM335  DFHMSD TYPE=DSECT,                                            X00006   
               CTRL=(FREEKB),                                          X00007   
               TERM=3270-2,                                            X00008   
               LANG=COBOL,                                             X00009   
               MODE=INOUT,                                             X00010   
               TIOAPFX=YES,                                            X00011   
               STORAGE=AUTO                                             00012   
ET335A   DFHMDI LINE=2,                                                X00013   
               COLUMN=1,                                               X00014   
               SIZE=(19,80),                                           X00015   
               MAPATTS=(COLOR,HILIGHT),                                X00016   
               DSATTS=(COLOR,HILIGHT)                                   00017   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00018   
*  SCREEN LINE 03                                                       00019   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00020   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00021   
               INITIAL='ITEMS',                                        X00022   
               COLOR=NEUTRAL,                                          X00023   
               LENGTH=5,                                               X00024   
               POS=(02,44)                                              00025   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00026   
               JUSTIFY=(LEFT,BLANK),                                   X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICOUT='ZZZ,ZZ9',                                       X00030**2
               LENGTH=7,                                               X00031**2
               POS=(02,50)                                              00032   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00033   
               INITIAL='TO',                                           X00034   
               COLOR=NEUTRAL,                                          X00035   
               LENGTH=2,                                               X00036   
               POS=(02,58)                                              00037**2
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00038   
               JUSTIFY=(LEFT,BLANK),                                   X00039   
               COLOR=BLUE,                                             X00040*10
               PICOUT='ZZZ,ZZ9',                                       X00041**2
               LENGTH=7,                                               X00042**2
               POS=(02,61)                                              00043**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00044   
               INITIAL='OF',                                           X00045   
               COLOR=NEUTRAL,                                          X00046   
               LENGTH=2,                                               X00047   
               POS=(02,69)                                              00048**5
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00049   
               JUSTIFY=(LEFT,BLANK),                                   X00050   
               COLOR=BLUE,                                             X00051*10
               PICOUT='ZZZ,ZZ9',                                       X00052**2
               LENGTH=7,                                               X00053**2
               POS=(02,72)                                              00054**5
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00055   
*  SCREEN LINE 05                                                       00056   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00057   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00058   
               INITIAL='SEL',                                          X00059   
               COLOR=NEUTRAL,                                          X00060   
               LENGTH=3,                                               X00061   
               POS=(04,1)                                               00062   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00063   
               INITIAL='ACT',                                          X00064   
               COLOR=NEUTRAL,                                          X00065   
               LENGTH=3,                                               X00066   
               POS=(04,6)                                               00067**6
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00068   
               INITIAL='NETWORK ID',                                   X00069   
               COLOR=NEUTRAL,                                          X00070   
               LENGTH=10,                                              X00071   
               POS=(04,11)                                              00072**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00073   
               INITIAL='NETWORK NAME',                                 X00074   
               COLOR=NEUTRAL,                                          X00075   
               LENGTH=12,                                              X00076   
               POS=(04,23)                                              00077**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00078   
               INITIAL='TYPE',                                         X00079   
               COLOR=NEUTRAL,                                          X00080   
               LENGTH=4,                                               X00081   
               POS=(04,39)                                              00082**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00083   
*  SCREEN LINE 07                                                       00084   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00085   
ASEL01   DFHMDF ATTRB=(UNPROT,IC),                                     X00086   
               COLOR=GREEN,                                            X00087   
               HILIGHT=UNDERLINE,                                      X00088   
               LENGTH=1,                                               X00089   
               POS=(06,2)                                               00090   
         DFHMDF ATTRB=(ASKIP),                                         X00091   
               POS=(06,4),                                             X00092   
               INITIAL=' ',                                            X00093   
               LENGTH=1                                                 00094   
AACT01   DFHMDF ATTRB=(ASKIP),                                         X00095   
               COLOR=BLUE,                                             X00096*10
               LENGTH=3,                                               X00097   
               POS=(06,6)                                               00098**6
ANTID01  DFHMDF ATTRB=(ASKIP),                                         X00099   
               JUSTIFY=(LEFT,BLANK),                                   X00100   
               COLOR=BLUE,                                             X00101*10
               LENGTH=1,                                               X00102   
               POS=(06,15)                                              00103**8
ANAME01  DFHMDF ATTRB=(ASKIP),                                         X00104   
               JUSTIFY=(LEFT,BLANK),                                   X00105   
               COLOR=BLUE,                                             X00106*10
               LENGTH=15,                                              X00107   
               POS=(06,23)                                              00108**8
ATYPE01  DFHMDF ATTRB=(ASKIP),                                         X00109   
               JUSTIFY=(LEFT,BLANK),                                   X00110   
               COLOR=BLUE,                                             X00111*10
               LENGTH=12,                                              X00112   
               POS=(06,39)                                              00113**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00114**2
*  SCREEN LINE 08                                                       00115**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00116**2
ASEL02   DFHMDF ATTRB=(UNPROT,IC),                                     X00117**4
               COLOR=GREEN,                                            X00118**2
               HILIGHT=UNDERLINE,                                      X00119**2
               LENGTH=1,                                               X00120**2
               POS=(07,2)                                               00121**4
         DFHMDF ATTRB=(ASKIP),                                         X00122**2
               POS=(07,4),                                             X00123**4
               INITIAL=' ',                                            X00124**2
               LENGTH=1                                                 00125**2
AACT02   DFHMDF ATTRB=(ASKIP),                                         X00126**4
               COLOR=BLUE,                                             X00127*10
               LENGTH=3,                                               X00128**2
               POS=(07,6)                                               00129**6
ANTID02  DFHMDF ATTRB=(ASKIP),                                         X00130**4
               JUSTIFY=(LEFT,BLANK),                                   X00131**2
               COLOR=BLUE,                                             X00132*10
               LENGTH=1,                                               X00133**2
               POS=(07,15)                                              00134**8
ANAME02  DFHMDF ATTRB=(ASKIP),                                         X00135**4
               JUSTIFY=(LEFT,BLANK),                                   X00136**2
               COLOR=BLUE,                                             X00137*10
               LENGTH=15,                                              X00138**2
               POS=(07,23)                                              00139**8
ATYPE02  DFHMDF ATTRB=(ASKIP),                                         X00140**4
               JUSTIFY=(LEFT,BLANK),                                   X00141**2
               COLOR=BLUE,                                             X00142*10
               LENGTH=12,                                              X00143**2
               POS=(07,39)                                              00144**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00145**2
*  SCREEN LINE 09                                                       00146**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00147**2
ASEL03   DFHMDF ATTRB=(UNPROT,IC),                                     X00148**4
               COLOR=GREEN,                                            X00149**2
               HILIGHT=UNDERLINE,                                      X00150**2
               LENGTH=1,                                               X00151**2
               POS=(08,2)                                               00152**4
         DFHMDF ATTRB=(ASKIP),                                         X00153**2
               POS=(08,4),                                             X00154**4
               INITIAL=' ',                                            X00155**2
               LENGTH=1                                                 00156**2
AACT03   DFHMDF ATTRB=(ASKIP),                                         X00157**4
               COLOR=BLUE,                                             X00158*10
               LENGTH=3,                                               X00159**2
               POS=(08,6)                                               00160**6
ANTID03  DFHMDF ATTRB=(ASKIP),                                         X00161**4
               JUSTIFY=(LEFT,BLANK),                                   X00162**2
               COLOR=BLUE,                                             X00163*10
               LENGTH=1,                                               X00164**2
               POS=(08,15)                                              00165**8
ANAME03  DFHMDF ATTRB=(ASKIP),                                         X00166**4
               JUSTIFY=(LEFT,BLANK),                                   X00167**2
               COLOR=BLUE,                                             X00168*10
               LENGTH=15,                                              X00169**2
               POS=(08,23)                                              00170**8
ATYPE03  DFHMDF ATTRB=(ASKIP),                                         X00171**4
               JUSTIFY=(LEFT,BLANK),                                   X00172**2
               COLOR=BLUE,                                             X00173*10
               LENGTH=12,                                              X00174**2
               POS=(08,39)                                              00175**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00176**2
*  SCREEN LINE 10                                                       00177**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00178**2
ASEL04   DFHMDF ATTRB=(UNPROT,IC),                                     X00179**4
               COLOR=GREEN,                                            X00180**2
               HILIGHT=UNDERLINE,                                      X00181**2
               LENGTH=1,                                               X00182**2
               POS=(09,2)                                               00183**4
         DFHMDF ATTRB=(ASKIP),                                         X00184**2
               POS=(09,4),                                             X00185**4
               INITIAL=' ',                                            X00186**2
               LENGTH=1                                                 00187**2
AACT04   DFHMDF ATTRB=(ASKIP),                                         X00188**4
               COLOR=BLUE,                                             X00189*10
               LENGTH=3,                                               X00190**2
               POS=(09,6)                                               00191**6
ANTID04  DFHMDF ATTRB=(ASKIP),                                         X00192**4
               JUSTIFY=(LEFT,BLANK),                                   X00193**2
               COLOR=BLUE,                                             X00194*10
               LENGTH=1,                                               X00195**2
               POS=(09,15)                                              00196**8
ANAME04  DFHMDF ATTRB=(ASKIP),                                         X00197**4
               JUSTIFY=(LEFT,BLANK),                                   X00198**2
               COLOR=BLUE,                                             X00199*10
               LENGTH=15,                                              X00200**2
               POS=(09,23)                                              00201**8
ATYPE04  DFHMDF ATTRB=(ASKIP),                                         X00202**4
               JUSTIFY=(LEFT,BLANK),                                   X00203**2
               COLOR=BLUE,                                             X00204*10
               LENGTH=12,                                              X00205**2
               POS=(09,39)                                              00206**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00207**2
*  SCREEN LINE 11                                                       00208**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00209**2
ASEL05   DFHMDF ATTRB=(UNPROT,IC),                                     X00210**4
               COLOR=GREEN,                                            X00211**2
               HILIGHT=UNDERLINE,                                      X00212**2
               LENGTH=1,                                               X00213**2
               POS=(10,2)                                               00214**4
         DFHMDF ATTRB=(ASKIP),                                         X00215**2
               POS=(10,4),                                             X00216**4
               INITIAL=' ',                                            X00217**2
               LENGTH=1                                                 00218**2
AACT05   DFHMDF ATTRB=(ASKIP),                                         X00219**4
               COLOR=BLUE,                                             X00220*10
               LENGTH=3,                                               X00221**2
               POS=(10,6)                                               00222**6
ANTID05  DFHMDF ATTRB=(ASKIP),                                         X00223**4
               JUSTIFY=(LEFT,BLANK),                                   X00224**2
               COLOR=BLUE,                                             X00225*10
               LENGTH=1,                                               X00226**2
               POS=(10,15)                                              00227**8
ANAME05  DFHMDF ATTRB=(ASKIP),                                         X00228**4
               JUSTIFY=(LEFT,BLANK),                                   X00229**2
               COLOR=BLUE,                                             X00230*10
               LENGTH=15,                                              X00231**2
               POS=(10,23)                                              00232**8
ATYPE05  DFHMDF ATTRB=(ASKIP),                                         X00233**4
               JUSTIFY=(LEFT,BLANK),                                   X00234**2
               COLOR=BLUE,                                             X00235*10
               LENGTH=12,                                              X00236**2
               POS=(10,39)                                              00237**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00238**2
*  SCREEN LINE 12                                                       00239**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00240**2
ASEL06   DFHMDF ATTRB=(UNPROT,IC),                                     X00241**4
               COLOR=GREEN,                                            X00242**2
               HILIGHT=UNDERLINE,                                      X00243**2
               LENGTH=1,                                               X00244**2
               POS=(11,2)                                               00245**4
         DFHMDF ATTRB=(ASKIP),                                         X00246**2
               POS=(11,4),                                             X00247**4
               INITIAL=' ',                                            X00248**2
               LENGTH=1                                                 00249**2
AACT06   DFHMDF ATTRB=(ASKIP),                                         X00250**4
               COLOR=BLUE,                                             X00251*10
               LENGTH=3,                                               X00252**2
               POS=(11,6)                                               00253**6
ANTID06  DFHMDF ATTRB=(ASKIP),                                         X00254**4
               JUSTIFY=(LEFT,BLANK),                                   X00255**2
               COLOR=BLUE,                                             X00256*10
               LENGTH=1,                                               X00257**2
               POS=(11,15)                                              00258**8
ANAME06  DFHMDF ATTRB=(ASKIP),                                         X00259**4
               JUSTIFY=(LEFT,BLANK),                                   X00260**2
               COLOR=BLUE,                                             X00261*10
               LENGTH=15,                                              X00262**2
               POS=(11,23)                                              00263**8
ATYPE06  DFHMDF ATTRB=(ASKIP),                                         X00264**4
               JUSTIFY=(LEFT,BLANK),                                   X00265**2
               COLOR=BLUE,                                             X00266*10
               LENGTH=12,                                              X00267**2
               POS=(11,39)                                              00268**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00269**2
*  SCREEN LINE 13                                                       00270**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00271**2
ASEL07   DFHMDF ATTRB=(UNPROT,IC),                                     X00272**4
               COLOR=GREEN,                                            X00273**2
               HILIGHT=UNDERLINE,                                      X00274**2
               LENGTH=1,                                               X00275**2
               POS=(12,2)                                               00276**4
         DFHMDF ATTRB=(ASKIP),                                         X00277**2
               POS=(12,4),                                             X00278**4
               INITIAL=' ',                                            X00279**2
               LENGTH=1                                                 00280**2
AACT07   DFHMDF ATTRB=(ASKIP),                                         X00281**4
               COLOR=BLUE,                                             X00282*10
               LENGTH=3,                                               X00283**2
               POS=(12,6)                                               00284**6
ANTID07  DFHMDF ATTRB=(ASKIP),                                         X00285**4
               JUSTIFY=(LEFT,BLANK),                                   X00286**2
               COLOR=BLUE,                                             X00287*10
               LENGTH=1,                                               X00288**2
               POS=(12,15)                                              00289**8
ANAME07  DFHMDF ATTRB=(ASKIP),                                         X00290**4
               JUSTIFY=(LEFT,BLANK),                                   X00291**2
               COLOR=BLUE,                                             X00292*10
               LENGTH=15,                                              X00293**2
               POS=(12,23)                                              00294**8
ATYPE07  DFHMDF ATTRB=(ASKIP),                                         X00295**4
               JUSTIFY=(LEFT,BLANK),                                   X00296**2
               COLOR=BLUE,                                             X00297*10
               LENGTH=12,                                              X00298**2
               POS=(12,39)                                              00299**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00300**2
*  SCREEN LINE 14                                                       00301**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00302**2
ASEL08   DFHMDF ATTRB=(UNPROT,IC),                                     X00303**4
               COLOR=GREEN,                                            X00304**2
               HILIGHT=UNDERLINE,                                      X00305**2
               LENGTH=1,                                               X00306**2
               POS=(13,2)                                               00307**4
         DFHMDF ATTRB=(ASKIP),                                         X00308**2
               POS=(13,4),                                             X00309**4
               INITIAL=' ',                                            X00310**2
               LENGTH=1                                                 00311**2
AACT08   DFHMDF ATTRB=(ASKIP),                                         X00312**4
               COLOR=BLUE,                                             X00313*10
               LENGTH=3,                                               X00314**2
               POS=(13,6)                                               00315**6
ANTID08  DFHMDF ATTRB=(ASKIP),                                         X00316**4
               JUSTIFY=(LEFT,BLANK),                                   X00317**2
               COLOR=BLUE,                                             X00318*10
               LENGTH=1,                                               X00319**2
               POS=(13,15)                                              00320**8
ANAME08  DFHMDF ATTRB=(ASKIP),                                         X00321**4
               JUSTIFY=(LEFT,BLANK),                                   X00322**2
               COLOR=BLUE,                                             X00323*10
               LENGTH=15,                                              X00324**2
               POS=(13,23)                                              00325**8
ATYPE08  DFHMDF ATTRB=(ASKIP),                                         X00326**4
               JUSTIFY=(LEFT,BLANK),                                   X00327**2
               COLOR=BLUE,                                             X00328*10
               LENGTH=12,                                              X00329**2
               POS=(13,39)                                              00330**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00331**2
*  SCREEN LINE 15                                                       00332**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00333**2
ASEL09   DFHMDF ATTRB=(UNPROT,IC),                                     X00334**4
               COLOR=GREEN,                                            X00335**2
               HILIGHT=UNDERLINE,                                      X00336**2
               LENGTH=1,                                               X00337**2
               POS=(14,2)                                               00338**4
         DFHMDF ATTRB=(ASKIP),                                         X00339**2
               POS=(14,4),                                             X00340**4
               INITIAL=' ',                                            X00341**2
               LENGTH=1                                                 00342**2
AACT09   DFHMDF ATTRB=(ASKIP),                                         X00343**4
               COLOR=BLUE,                                             X00344*10
               LENGTH=3,                                               X00345**2
               POS=(14,6)                                               00346**6
ANTID09  DFHMDF ATTRB=(ASKIP),                                         X00347**4
               JUSTIFY=(LEFT,BLANK),                                   X00348**2
               COLOR=BLUE,                                             X00349*10
               LENGTH=1,                                               X00350**2
               POS=(14,15)                                              00351**8
ANAME09  DFHMDF ATTRB=(ASKIP),                                         X00352**4
               JUSTIFY=(LEFT,BLANK),                                   X00353**2
               COLOR=BLUE,                                             X00354*10
               LENGTH=15,                                              X00355**2
               POS=(14,23)                                              00356**8
ATYPE09  DFHMDF ATTRB=(ASKIP),                                         X00357**4
               JUSTIFY=(LEFT,BLANK),                                   X00358**2
               COLOR=BLUE,                                             X00359*10
               LENGTH=12,                                              X00360**2
               POS=(14,39)                                              00361**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00362**2
*  SCREEN LINE 16                                                       00363**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00364**2
ASEL10   DFHMDF ATTRB=(UNPROT,IC),                                     X00365**4
               COLOR=GREEN,                                            X00366**2
               HILIGHT=UNDERLINE,                                      X00367**2
               LENGTH=1,                                               X00368**2
               POS=(15,2)                                               00369**4
         DFHMDF ATTRB=(ASKIP),                                         X00370**2
               POS=(15,4),                                             X00371**4
               INITIAL=' ',                                            X00372**2
               LENGTH=1                                                 00373**2
AACT10   DFHMDF ATTRB=(ASKIP),                                         X00374**4
               COLOR=BLUE,                                             X00375*10
               LENGTH=3,                                               X00376**2
               POS=(15,6)                                               00377**6
ANTID10  DFHMDF ATTRB=(ASKIP),                                         X00378**4
               JUSTIFY=(LEFT,BLANK),                                   X00379**2
               COLOR=BLUE,                                             X00380*10
               LENGTH=1,                                               X00381**2
               POS=(15,15)                                              00382**8
ANAME10  DFHMDF ATTRB=(ASKIP),                                         X00383**4
               JUSTIFY=(LEFT,BLANK),                                   X00384**2
               COLOR=BLUE,                                             X00385*10
               LENGTH=15,                                              X00386**2
               POS=(15,23)                                              00387**8
ATYPE10  DFHMDF ATTRB=(ASKIP),                                         X00388**4
               JUSTIFY=(LEFT,BLANK),                                   X00389**2
               COLOR=BLUE,                                             X00390*10
               LENGTH=12,                                              X00391**2
               POS=(15,39)                                              00392**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00393**2
*  SCREEN LINE 17                                                       00394**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00395**2
ASEL11   DFHMDF ATTRB=(UNPROT,IC),                                     X00396**4
               COLOR=GREEN,                                            X00397**2
               HILIGHT=UNDERLINE,                                      X00398**2
               LENGTH=1,                                               X00399**2
               POS=(16,2)                                               00400**4
         DFHMDF ATTRB=(ASKIP),                                         X00401**2
               POS=(16,4),                                             X00402**4
               INITIAL=' ',                                            X00403**2
               LENGTH=1                                                 00404**2
AACT11   DFHMDF ATTRB=(ASKIP),                                         X00405**4
               COLOR=BLUE,                                             X00406*10
               LENGTH=3,                                               X00407**2
               POS=(16,6)                                               00408**6
ANTID11  DFHMDF ATTRB=(ASKIP),                                         X00409**4
               JUSTIFY=(LEFT,BLANK),                                   X00410**2
               COLOR=BLUE,                                             X00411*10
               LENGTH=1,                                               X00412**2
               POS=(16,15)                                              00413**8
ANAME11  DFHMDF ATTRB=(ASKIP),                                         X00414**4
               JUSTIFY=(LEFT,BLANK),                                   X00415**2
               COLOR=BLUE,                                             X00416*10
               LENGTH=15,                                              X00417**2
               POS=(16,23)                                              00418**8
ATYPE11  DFHMDF ATTRB=(ASKIP),                                         X00419**4
               JUSTIFY=(LEFT,BLANK),                                   X00420**2
               COLOR=BLUE,                                             X00421*10
               LENGTH=12,                                              X00422**2
               POS=(16,39)                                              00423**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00424**2
*  SCREEN LINE 18                                                       00425**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00426**2
ASEL12   DFHMDF ATTRB=(UNPROT,IC),                                     X00427**4
               COLOR=GREEN,                                            X00428**2
               HILIGHT=UNDERLINE,                                      X00429**2
               LENGTH=1,                                               X00430**2
               POS=(17,2)                                               00431**4
         DFHMDF ATTRB=(ASKIP),                                         X00432**2
               POS=(17,4),                                             X00433**4
               INITIAL=' ',                                            X00434**2
               LENGTH=1                                                 00435**2
AACT12   DFHMDF ATTRB=(ASKIP),                                         X00436**4
               COLOR=BLUE,                                             X00437*10
               LENGTH=3,                                               X00438**2
               POS=(17,6)                                               00439**6
ANTID12  DFHMDF ATTRB=(ASKIP),                                         X00440**4
               JUSTIFY=(LEFT,BLANK),                                   X00441**2
               COLOR=BLUE,                                             X00442*10
               LENGTH=1,                                               X00443**2
               POS=(17,15)                                              00444**8
ANAME12  DFHMDF ATTRB=(ASKIP),                                         X00445**4
               JUSTIFY=(LEFT,BLANK),                                   X00446**2
               COLOR=BLUE,                                             X00447*10
               LENGTH=15,                                              X00448**2
               POS=(17,23)                                              00449**8
ATYPE12  DFHMDF ATTRB=(ASKIP),                                         X00450**4
               JUSTIFY=(LEFT,BLANK),                                   X00451**2
               COLOR=BLUE,                                             X00452*10
               LENGTH=12,                                              X00453**2
               POS=(17,39)                                              00454**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00455   
*  SCREEN LINE 20                                                       00456   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00457   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00458   
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00459**2
               COLOR=NEUTRAL,                                          X00460   
               LENGTH=25,                                              X00461**2
               POS=(19,45)                                              00462**2
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00463   
               JUSTIFY=(LEFT,BLANK),                                   X00464   
               COLOR=BLUE,                                             X00465*10
               PICOUT='ZZZ,ZZ9',                                       X00466**2
               LENGTH=7,                                               X00467**2
               POS=(19,72)                                              00468**2
         DFHMSD TYPE=FINAL                                              00469   
         END                                                            00470   
