*          DATA SET ETKM310    AT LEVEL 012 AS OF 02/23/94                      
*          DATA SET ETKM310A1  AT LEVEL 015 AS OF 02/11/94              00001   
ETKM310  DFHMSD TYPE=&&SYSPARM,                                        X00002   
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES                                              00005   
ET310A   DFHMDI SIZE=(19,080),                                         X00006   
               MAPATTS=(COLOR,HILIGHT),                                X00007   
               DSATTS=(COLOR,HILIGHT),                                 X00008   
               LINE=02,                                                X00009   
               COLUMN=01,                                              X00010   
               CTRL=(FREEKB,FRSET)                                      00011   
*********************************************************************** 00012**4
        DFHMDF POS=(01,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00013**2
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00014   
ASTRTIT DFHMDF POS=(01,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00015**2
               COLOR=GREEN,                                            X00016**2
               HILIGHT=UNDERLINE,                                      X00017**2
               PICOUT='ZZZZ9'                                           00018   
        DFHMDF POS=(01,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00019**2
               COLOR=NEUTRAL,                                          X00020**2
               INITIAL='TO'                                             00021   
AENDIT  DFHMDF POS=(01,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00022**2
               COLOR=BLUE,                                             X00023**2
               PICOUT='ZZZZ9'                                           00024   
        DFHMDF POS=(01,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00025**2
               COLOR=NEUTRAL,                                          X00026**2
               INITIAL='OF'                                             00027   
ATOTIT  DFHMDF POS=(01,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00028**2
               COLOR=BLUE,                                             X00029**2
               PICOUT='ZZZZ9'                                           00030   
*********************************************************************** 00031**4
         DFHMDF POS=(03,035),                                          X00032*10
               COLOR=NEUTRAL,                                          X00033   
               ATTRB=(ASKIP,NORM),                                     X00034   
               LENGTH=005,                                             X00035   
               INITIAL='TP ID'                                          00036**4
         DFHMDF POS=(04,001),                                          X00037   
               COLOR=NEUTRAL,                                          X00038   
               ATTRB=(ASKIP,NORM),                                     X00039   
               LENGTH=040,                                             X00040**7
               INITIAL='SEL  ACT VENDOR NAME              QUALIF'       00041**8
         DFHMDF POS=(04,042),                                          X00042**7
               COLOR=NEUTRAL,                                          X00043**2
               ATTRB=(ASKIP,NORM),                                     X00044**2
               LENGTH=035,                                             X00045*10
               INITIAL='TP ID            NETWORK    FG  DIR'            00046*10
************************----5----0----5----0----5----0----5----0******* 00047**7
ASEL01   DFHMDF POS=(06,002),                                          X00048   
               COLOR=GREEN,                                            X00049   
               ATTRB=(UNPROT,NORM),                                    X00050   
               HILIGHT=UNDERLINE,                                      X00051   
               LENGTH=001                                               00052**3
         DFHMDF POS=(06,004),                                          X00053   
               ATTRB=(ASKIP),                                          X00054   
               LENGTH=001                                               00055**3
AACT01   DFHMDF POS=(06,006),                                          X00056**7
               COLOR=BLUE,                                             X00057   
               ATTRB=(ASKIP,NORM),                                     X00058   
               LENGTH=003                                               00059**7
VDNME01  DFHMDF POS=(06,010),                                          X00060**7
               COLOR=BLUE,                                             X00061**7
               ATTRB=(ASKIP,NORM),                                     X00062**7
               LENGTH=025                                               00063**7
TPIDQ01  DFHMDF POS=(06,037),                                          X00064**8
               COLOR=BLUE,                                             X00065   
               ATTRB=(ASKIP,NORM),                                     X00066   
               LENGTH=02                                                00067   
TPID01   DFHMDF POS=(06,042),                                          X00068*10
               COLOR=BLUE,                                             X00069   
               ATTRB=(ASKIP,NORM),                                     X00070   
               LENGTH=015                                               00071   
NTWK01   DFHMDF POS=(06,059),                                          X00072**9
               COLOR=BLUE,                                             X00073   
               ATTRB=(ASKIP,NORM),                                     X00074   
               LENGTH=010                                               00075   
FNCDE01  DFHMDF POS=(06,070),                                          X00076**9
               COLOR=BLUE,                                             X00077   
               ATTRB=(ASKIP,NORM),                                     X00078   
               LENGTH=002                                               00079   
DIR01    DFHMDF POS=(06,075),                                          X00080*11
               COLOR=BLUE,                                             X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               LENGTH=001                                               00083   
*********************************************************************** 00084   
ASEL02   DFHMDF POS=(07,002),                                          X00085*11
               COLOR=GREEN,                                            X00086*11
               ATTRB=(UNPROT,NORM),                                    X00087*11
               HILIGHT=UNDERLINE,                                      X00088*11
               LENGTH=001                                               00089*11
         DFHMDF POS=(07,004),                                          X00090*11
               ATTRB=(ASKIP),                                          X00091*11
               LENGTH=001                                               00092*11
AACT02   DFHMDF POS=(07,006),                                          X00093*11
               COLOR=BLUE,                                             X00094*11
               ATTRB=(ASKIP,NORM),                                     X00095*11
               LENGTH=003                                               00096*11
VDNME02  DFHMDF POS=(07,010),                                          X00097*11
               COLOR=BLUE,                                             X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               LENGTH=025                                               00100*11
TPIDQ02  DFHMDF POS=(07,037),                                          X00101*11
               COLOR=BLUE,                                             X00102*11
               ATTRB=(ASKIP,NORM),                                     X00103*11
               LENGTH=02                                                00104*11
TPID02   DFHMDF POS=(07,042),                                          X00105*11
               COLOR=BLUE,                                             X00106*11
               ATTRB=(ASKIP,NORM),                                     X00107*11
               LENGTH=015                                               00108*11
NTWK02   DFHMDF POS=(07,059),                                          X00109*11
               COLOR=BLUE,                                             X00110*11
               ATTRB=(ASKIP,NORM),                                     X00111*11
               LENGTH=010                                               00112*11
FNCDE02  DFHMDF POS=(07,070),                                          X00113*11
               COLOR=BLUE,                                             X00114*11
               ATTRB=(ASKIP,NORM),                                     X00115*11
               LENGTH=002                                               00116*11
DIR02    DFHMDF POS=(07,075),                                          X00117*11
               COLOR=BLUE,                                             X00118*11
               ATTRB=(ASKIP,NORM),                                     X00119*11
               LENGTH=001                                               00120*11
*********************************************************************** 00121*11
ASEL03   DFHMDF POS=(08,002),                                          X00122*11
               COLOR=GREEN,                                            X00123*11
               ATTRB=(UNPROT,NORM),                                    X00124*11
               HILIGHT=UNDERLINE,                                      X00125*11
               LENGTH=001                                               00126*11
         DFHMDF POS=(08,004),                                          X00127*11
               ATTRB=(ASKIP),                                          X00128*11
               LENGTH=001                                               00129*11
AACT03   DFHMDF POS=(08,006),                                          X00130*11
               COLOR=BLUE,                                             X00131*11
               ATTRB=(ASKIP,NORM),                                     X00132*11
               LENGTH=003                                               00133*11
VDNME03  DFHMDF POS=(08,010),                                          X00134*11
               COLOR=BLUE,                                             X00135*11
               ATTRB=(ASKIP,NORM),                                     X00136*11
               LENGTH=025                                               00137*11
TPIDQ03  DFHMDF POS=(08,037),                                          X00138*11
               COLOR=BLUE,                                             X00139*11
               ATTRB=(ASKIP,NORM),                                     X00140*11
               LENGTH=02                                                00141*11
TPID03   DFHMDF POS=(08,042),                                          X00142*11
               COLOR=BLUE,                                             X00143*11
               ATTRB=(ASKIP,NORM),                                     X00144*11
               LENGTH=015                                               00145*11
NTWK03   DFHMDF POS=(08,059),                                          X00146*11
               COLOR=BLUE,                                             X00147*11
               ATTRB=(ASKIP,NORM),                                     X00148*11
               LENGTH=010                                               00149*11
FNCDE03  DFHMDF POS=(08,070),                                          X00150*11
               COLOR=BLUE,                                             X00151*11
               ATTRB=(ASKIP,NORM),                                     X00152*11
               LENGTH=002                                               00153*11
DIR03    DFHMDF POS=(08,075),                                          X00154*11
               COLOR=BLUE,                                             X00155*11
               ATTRB=(ASKIP,NORM),                                     X00156*11
               LENGTH=001                                               00157*11
*********************************************************************** 00158*11
ASEL04   DFHMDF POS=(09,002),                                          X00159*11
               COLOR=GREEN,                                            X00160*11
               ATTRB=(UNPROT,NORM),                                    X00161*11
               HILIGHT=UNDERLINE,                                      X00162*11
               LENGTH=001                                               00163*11
         DFHMDF POS=(09,004),                                          X00164*11
               ATTRB=(ASKIP),                                          X00165*11
               LENGTH=001                                               00166*11
AACT04   DFHMDF POS=(09,006),                                          X00167*11
               COLOR=BLUE,                                             X00168*11
               ATTRB=(ASKIP,NORM),                                     X00169*11
               LENGTH=003                                               00170*11
VDNME04  DFHMDF POS=(09,010),                                          X00171*11
               COLOR=BLUE,                                             X00172*11
               ATTRB=(ASKIP,NORM),                                     X00173*11
               LENGTH=025                                               00174*11
TPIDQ04  DFHMDF POS=(09,037),                                          X00175*11
               COLOR=BLUE,                                             X00176*11
               ATTRB=(ASKIP,NORM),                                     X00177*11
               LENGTH=02                                                00178*11
TPID04   DFHMDF POS=(09,042),                                          X00179*11
               COLOR=BLUE,                                             X00180*11
               ATTRB=(ASKIP,NORM),                                     X00181*11
               LENGTH=015                                               00182*11
NTWK04   DFHMDF POS=(09,059),                                          X00183*11
               COLOR=BLUE,                                             X00184*11
               ATTRB=(ASKIP,NORM),                                     X00185*11
               LENGTH=010                                               00186*11
FNCDE04  DFHMDF POS=(09,070),                                          X00187*11
               COLOR=BLUE,                                             X00188*11
               ATTRB=(ASKIP,NORM),                                     X00189*11
               LENGTH=002                                               00190*11
DIR04    DFHMDF POS=(09,075),                                          X00191*11
               COLOR=BLUE,                                             X00192*11
               ATTRB=(ASKIP,NORM),                                     X00193*11
               LENGTH=001                                               00194*11
*********************************************************************** 00195*11
ASEL05   DFHMDF POS=(10,002),                                          X00196*11
               COLOR=GREEN,                                            X00197*11
               ATTRB=(UNPROT,NORM),                                    X00198*11
               HILIGHT=UNDERLINE,                                      X00199*11
               LENGTH=001                                               00200*11
         DFHMDF POS=(10,004),                                          X00201*11
               ATTRB=(ASKIP),                                          X00202*11
               LENGTH=001                                               00203*11
AACT05   DFHMDF POS=(10,006),                                          X00204*11
               COLOR=BLUE,                                             X00205*11
               ATTRB=(ASKIP,NORM),                                     X00206*11
               LENGTH=003                                               00207*11
VDNME05  DFHMDF POS=(10,010),                                          X00208*11
               COLOR=BLUE,                                             X00209*11
               ATTRB=(ASKIP,NORM),                                     X00210*11
               LENGTH=025                                               00211*11
TPIDQ05  DFHMDF POS=(10,037),                                          X00212*11
               COLOR=BLUE,                                             X00213*11
               ATTRB=(ASKIP,NORM),                                     X00214*11
               LENGTH=02                                                00215*11
TPID05   DFHMDF POS=(10,042),                                          X00216*11
               COLOR=BLUE,                                             X00217*11
               ATTRB=(ASKIP,NORM),                                     X00218*11
               LENGTH=015                                               00219*11
NTWK05   DFHMDF POS=(10,059),                                          X00220*11
               COLOR=BLUE,                                             X00221*11
               ATTRB=(ASKIP,NORM),                                     X00222*11
               LENGTH=010                                               00223*11
FNCDE05  DFHMDF POS=(10,070),                                          X00224*11
               COLOR=BLUE,                                             X00225*11
               ATTRB=(ASKIP,NORM),                                     X00226*11
               LENGTH=002                                               00227*11
DIR05    DFHMDF POS=(10,075),                                          X00228*11
               COLOR=BLUE,                                             X00229*11
               ATTRB=(ASKIP,NORM),                                     X00230*11
               LENGTH=001                                               00231*11
*********************************************************************** 00232*11
ASEL06   DFHMDF POS=(11,002),                                          X00233*11
               COLOR=GREEN,                                            X00234*11
               ATTRB=(UNPROT,NORM),                                    X00235*11
               HILIGHT=UNDERLINE,                                      X00236*11
               LENGTH=001                                               00237*11
         DFHMDF POS=(11,004),                                          X00238*11
               ATTRB=(ASKIP),                                          X00239*11
               LENGTH=001                                               00240*11
AACT06   DFHMDF POS=(11,006),                                          X00241*11
               COLOR=BLUE,                                             X00242*11
               ATTRB=(ASKIP,NORM),                                     X00243*11
               LENGTH=003                                               00244*11
VDNME06  DFHMDF POS=(11,010),                                          X00245*11
               COLOR=BLUE,                                             X00246*11
               ATTRB=(ASKIP,NORM),                                     X00247*11
               LENGTH=025                                               00248*11
TPIDQ06  DFHMDF POS=(11,037),                                          X00249*11
               COLOR=BLUE,                                             X00250*11
               ATTRB=(ASKIP,NORM),                                     X00251*11
               LENGTH=02                                                00252*11
TPID06   DFHMDF POS=(11,042),                                          X00253*11
               COLOR=BLUE,                                             X00254*11
               ATTRB=(ASKIP,NORM),                                     X00255*11
               LENGTH=015                                               00256*11
NTWK06   DFHMDF POS=(11,059),                                          X00257*11
               COLOR=BLUE,                                             X00258*11
               ATTRB=(ASKIP,NORM),                                     X00259*11
               LENGTH=010                                               00260*11
FNCDE06  DFHMDF POS=(11,070),                                          X00261*11
               COLOR=BLUE,                                             X00262*11
               ATTRB=(ASKIP,NORM),                                     X00263*11
               LENGTH=002                                               00264*11
DIR06    DFHMDF POS=(11,075),                                          X00265*11
               COLOR=BLUE,                                             X00266*11
               ATTRB=(ASKIP,NORM),                                     X00267*11
               LENGTH=001                                               00268*11
*********************************************************************** 00269*11
ASEL07   DFHMDF POS=(12,002),                                          X00270*11
               COLOR=GREEN,                                            X00271*11
               ATTRB=(UNPROT,NORM),                                    X00272*11
               HILIGHT=UNDERLINE,                                      X00273*11
               LENGTH=001                                               00274*11
         DFHMDF POS=(12,004),                                          X00275*11
               ATTRB=(ASKIP),                                          X00276*11
               LENGTH=001                                               00277*11
AACT07   DFHMDF POS=(12,006),                                          X00278*11
               COLOR=BLUE,                                             X00279*11
               ATTRB=(ASKIP,NORM),                                     X00280*11
               LENGTH=003                                               00281*11
VDNME07  DFHMDF POS=(12,010),                                          X00282*11
               COLOR=BLUE,                                             X00283*11
               ATTRB=(ASKIP,NORM),                                     X00284*11
               LENGTH=025                                               00285*11
TPIDQ07  DFHMDF POS=(12,037),                                          X00286*11
               COLOR=BLUE,                                             X00287*11
               ATTRB=(ASKIP,NORM),                                     X00288*11
               LENGTH=02                                                00289*11
TPID07   DFHMDF POS=(12,042),                                          X00290*11
               COLOR=BLUE,                                             X00291*11
               ATTRB=(ASKIP,NORM),                                     X00292*11
               LENGTH=015                                               00293*11
NTWK07   DFHMDF POS=(12,059),                                          X00294*11
               COLOR=BLUE,                                             X00295*11
               ATTRB=(ASKIP,NORM),                                     X00296*11
               LENGTH=010                                               00297*11
FNCDE07  DFHMDF POS=(12,070),                                          X00298*11
               COLOR=BLUE,                                             X00299*11
               ATTRB=(ASKIP,NORM),                                     X00300*11
               LENGTH=002                                               00301*11
DIR07    DFHMDF POS=(12,075),                                          X00302*11
               COLOR=BLUE,                                             X00303*11
               ATTRB=(ASKIP,NORM),                                     X00304*11
               LENGTH=001                                               00305*11
*********************************************************************** 00306*11
ASEL08   DFHMDF POS=(13,002),                                          X00307*11
               COLOR=GREEN,                                            X00308*11
               ATTRB=(UNPROT,NORM),                                    X00309*11
               HILIGHT=UNDERLINE,                                      X00310*11
               LENGTH=001                                               00311*11
         DFHMDF POS=(13,004),                                          X00312*11
               ATTRB=(ASKIP),                                          X00313*11
               LENGTH=001                                               00314*11
AACT08   DFHMDF POS=(13,006),                                          X00315*11
               COLOR=BLUE,                                             X00316*11
               ATTRB=(ASKIP,NORM),                                     X00317*11
               LENGTH=003                                               00318*11
VDNME08  DFHMDF POS=(13,010),                                          X00319*11
               COLOR=BLUE,                                             X00320*11
               ATTRB=(ASKIP,NORM),                                     X00321*11
               LENGTH=025                                               00322*11
TPIDQ08  DFHMDF POS=(13,037),                                          X00323*11
               COLOR=BLUE,                                             X00324*11
               ATTRB=(ASKIP,NORM),                                     X00325*11
               LENGTH=02                                                00326*11
TPID08   DFHMDF POS=(13,042),                                          X00327*11
               COLOR=BLUE,                                             X00328*11
               ATTRB=(ASKIP,NORM),                                     X00329*11
               LENGTH=015                                               00330*11
NTWK08   DFHMDF POS=(13,059),                                          X00331*11
               COLOR=BLUE,                                             X00332*11
               ATTRB=(ASKIP,NORM),                                     X00333*11
               LENGTH=010                                               00334*11
FNCDE08  DFHMDF POS=(13,070),                                          X00335*11
               COLOR=BLUE,                                             X00336*11
               ATTRB=(ASKIP,NORM),                                     X00337*11
               LENGTH=002                                               00338*11
DIR08    DFHMDF POS=(13,075),                                          X00339*11
               COLOR=BLUE,                                             X00340*11
               ATTRB=(ASKIP,NORM),                                     X00341*11
               LENGTH=001                                               00342*11
*********************************************************************** 00343*11
ASEL09   DFHMDF POS=(14,002),                                          X00344*11
               COLOR=GREEN,                                            X00345*11
               ATTRB=(UNPROT,NORM),                                    X00346*11
               HILIGHT=UNDERLINE,                                      X00347*11
               LENGTH=001                                               00348*11
         DFHMDF POS=(14,004),                                          X00349*11
               ATTRB=(ASKIP),                                          X00350*11
               LENGTH=001                                               00351*11
AACT09   DFHMDF POS=(14,006),                                          X00352*11
               COLOR=BLUE,                                             X00353*11
               ATTRB=(ASKIP,NORM),                                     X00354*11
               LENGTH=003                                               00355*11
VDNME09  DFHMDF POS=(14,010),                                          X00356*11
               COLOR=BLUE,                                             X00357*11
               ATTRB=(ASKIP,NORM),                                     X00358*11
               LENGTH=025                                               00359*11
TPIDQ09  DFHMDF POS=(14,037),                                          X00360*11
               COLOR=BLUE,                                             X00361*11
               ATTRB=(ASKIP,NORM),                                     X00362*11
               LENGTH=02                                                00363*11
TPID09   DFHMDF POS=(14,042),                                          X00364*11
               COLOR=BLUE,                                             X00365*11
               ATTRB=(ASKIP,NORM),                                     X00366*11
               LENGTH=015                                               00367*11
NTWK09   DFHMDF POS=(14,059),                                          X00368*11
               COLOR=BLUE,                                             X00369*11
               ATTRB=(ASKIP,NORM),                                     X00370*11
               LENGTH=010                                               00371*11
FNCDE09  DFHMDF POS=(14,070),                                          X00372*11
               COLOR=BLUE,                                             X00373*11
               ATTRB=(ASKIP,NORM),                                     X00374*11
               LENGTH=002                                               00375*11
DIR09    DFHMDF POS=(14,075),                                          X00376*11
               COLOR=BLUE,                                             X00377*11
               ATTRB=(ASKIP,NORM),                                     X00378*11
               LENGTH=001                                               00379*11
*********************************************************************** 00380*11
ASEL10   DFHMDF POS=(15,002),                                          X00381*11
               COLOR=GREEN,                                            X00382*11
               ATTRB=(UNPROT,NORM),                                    X00383*11
               HILIGHT=UNDERLINE,                                      X00384*11
               LENGTH=001                                               00385*11
         DFHMDF POS=(15,004),                                          X00386*11
               ATTRB=(ASKIP),                                          X00387*11
               LENGTH=001                                               00388*11
AACT10   DFHMDF POS=(15,006),                                          X00389*11
               COLOR=BLUE,                                             X00390*11
               ATTRB=(ASKIP,NORM),                                     X00391*11
               LENGTH=003                                               00392*11
VDNME10  DFHMDF POS=(15,010),                                          X00393*11
               COLOR=BLUE,                                             X00394*11
               ATTRB=(ASKIP,NORM),                                     X00395*11
               LENGTH=025                                               00396*11
TPIDQ10  DFHMDF POS=(15,037),                                          X00397*11
               COLOR=BLUE,                                             X00398*11
               ATTRB=(ASKIP,NORM),                                     X00399*11
               LENGTH=02                                                00400*11
TPID10   DFHMDF POS=(15,042),                                          X00401*11
               COLOR=BLUE,                                             X00402*11
               ATTRB=(ASKIP,NORM),                                     X00403*11
               LENGTH=015                                               00404*11
NTWK10   DFHMDF POS=(15,059),                                          X00405*11
               COLOR=BLUE,                                             X00406*11
               ATTRB=(ASKIP,NORM),                                     X00407*11
               LENGTH=010                                               00408*11
FNCDE10  DFHMDF POS=(15,070),                                          X00409*11
               COLOR=BLUE,                                             X00410*11
               ATTRB=(ASKIP,NORM),                                     X00411*11
               LENGTH=002                                               00412*11
DIR10    DFHMDF POS=(15,075),                                          X00413*11
               COLOR=BLUE,                                             X00414*11
               ATTRB=(ASKIP,NORM),                                     X00415*11
               LENGTH=001                                               00416*11
*********************************************************************** 00417*11
ASEL11   DFHMDF POS=(16,002),                                          X00418*11
               COLOR=GREEN,                                            X00419*11
               ATTRB=(UNPROT,NORM),                                    X00420*11
               HILIGHT=UNDERLINE,                                      X00421*11
               LENGTH=001                                               00422*11
         DFHMDF POS=(16,004),                                          X00423*11
               ATTRB=(ASKIP),                                          X00424*11
               LENGTH=001                                               00425*11
AACT11   DFHMDF POS=(16,006),                                          X00426*11
               COLOR=BLUE,                                             X00427*11
               ATTRB=(ASKIP,NORM),                                     X00428*11
               LENGTH=003                                               00429*11
VDNME11  DFHMDF POS=(16,010),                                          X00430*11
               COLOR=BLUE,                                             X00431*11
               ATTRB=(ASKIP,NORM),                                     X00432*11
               LENGTH=025                                               00433*11
TPIDQ11  DFHMDF POS=(16,037),                                          X00434*11
               COLOR=BLUE,                                             X00435*11
               ATTRB=(ASKIP,NORM),                                     X00436*11
               LENGTH=02                                                00437*11
TPID11   DFHMDF POS=(16,042),                                          X00438*11
               COLOR=BLUE,                                             X00439*11
               ATTRB=(ASKIP,NORM),                                     X00440*11
               LENGTH=015                                               00441*11
NTWK11   DFHMDF POS=(16,059),                                          X00442*11
               COLOR=BLUE,                                             X00443*11
               ATTRB=(ASKIP,NORM),                                     X00444*11
               LENGTH=010                                               00445*11
FNCDE11  DFHMDF POS=(16,070),                                          X00446*11
               COLOR=BLUE,                                             X00447*11
               ATTRB=(ASKIP,NORM),                                     X00448*11
               LENGTH=002                                               00449*11
DIR11    DFHMDF POS=(16,075),                                          X00450*11
               COLOR=BLUE,                                             X00451*11
               ATTRB=(ASKIP,NORM),                                     X00452*11
               LENGTH=001                                               00453*11
*********************************************************************** 00454*11
ASEL12   DFHMDF POS=(17,002),                                          X00455*11
               COLOR=GREEN,                                            X00456*11
               ATTRB=(UNPROT,NORM),                                    X00457*11
               HILIGHT=UNDERLINE,                                      X00458*11
               LENGTH=001                                               00459*11
         DFHMDF POS=(17,004),                                          X00460*11
               ATTRB=(ASKIP),                                          X00461*11
               LENGTH=001                                               00462*11
AACT12   DFHMDF POS=(17,006),                                          X00463*11
               COLOR=BLUE,                                             X00464*11
               ATTRB=(ASKIP,NORM),                                     X00465*11
               LENGTH=003                                               00466*11
VDNME12  DFHMDF POS=(17,010),                                          X00467*11
               COLOR=BLUE,                                             X00468*11
               ATTRB=(ASKIP,NORM),                                     X00469*11
               LENGTH=025                                               00470*11
TPIDQ12  DFHMDF POS=(17,037),                                          X00471*11
               COLOR=BLUE,                                             X00472*11
               ATTRB=(ASKIP,NORM),                                     X00473*11
               LENGTH=02                                                00474*11
TPID12   DFHMDF POS=(17,042),                                          X00475*11
               COLOR=BLUE,                                             X00476*11
               ATTRB=(ASKIP,NORM),                                     X00477*11
               LENGTH=015                                               00478*11
NTWK12   DFHMDF POS=(17,059),                                          X00479*11
               COLOR=BLUE,                                             X00480*11
               ATTRB=(ASKIP,NORM),                                     X00481*11
               LENGTH=010                                               00482*11
FNCDE12  DFHMDF POS=(17,070),                                          X00483*11
               COLOR=BLUE,                                             X00484*11
               ATTRB=(ASKIP,NORM),                                     X00485*11
               LENGTH=002                                               00486*11
DIR12    DFHMDF POS=(17,075),                                          X00487*11
               COLOR=BLUE,                                             X00488*11
               ATTRB=(ASKIP,NORM),                                     X00489*11
               LENGTH=001                                               00490*11
*********************************************************************** 00491*11
NBRSEL   DFHMDF POS=(19,040),                                          X00492   
               COLOR=NEUTRAL,                                          X00493   
               ATTRB=(ASKIP,NORM),                                     X00494   
               LENGTH=025,                                             X00495   
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00496   
ASELIT   DFHMDF POS=(19,067),                                          X00497   
               COLOR=BLUE,                                             X00498   
               ATTRB=(ASKIP,NORM),                                     X00499   
               LENGTH=007,                                             X00500   
               PICOUT='ZZZ,ZZ9',                                       X00501   
               INITIAL='              '                                 00502   
         DFHMSD TYPE=FINAL                                              00503   
         END                                                            00504   
