      ******************************************************************        
      *  ETRD026 - EDI 820 EXTRACT FILE - CONTAINS ALL THE EDI ACCOUNTS         
      *            PAYABLE PAYMENT REMITTANCE ADVICE DATA WHICH WILL            
      *            BE FED INTO THE TRANSLATOR INTERFACE PROGRAM.                
      *                                                                         
      *            THIS FILE IS CREATED IN ETKUT122.                            
      *                                                                         
      *  RECORD LENGTH - 350 BYTES.                                             
      ******************************************************************        
       01  ET026-PAYMENT-REMIT-RECORD.                                          
           05  ET026-RECORD-TYPE-CODE             PIC X(2).                     
               88  ET026-HEADER                       VALUE '01'.               
               88  ET026-REFERENCE                    VALUE '02'.               
               88  ET026-DATES                        VALUE '03'.               
               88  ET026-NAMES                        VALUE '04'.               
               88  ET026-COUNTER                      VALUE '05'.               
               88  ET026-ADJUSTMENTS                  VALUE '06'.               
               88  ET026-ADJ-REFERENCE                VALUE '07'.               
               88  ET026-ADJ-DATES                    VALUE '08'.               
               88  ET026-ADJ-MEMORANDUM               VALUE '09'.               
               88  ET026-PAYMENT                      VALUE '10'.               
               88  ET026-PAY-REFERENCE                VALUE '11'.               
               88  ET026-PAY-DATES                    VALUE '12'.               
               88  ET026-PAY-ADJUSTMENTS              VALUE '13'.               
               88  ET026-PAY-ADJ-NOTES                VALUE '14'.               
           05  ET026-DATA-RECORD                  PIC X(348).                   
                                                                                
      ******************************************************************        
      *  RECORD 01 - HEADER INFORMATION                                         
      ******************************************************************        
           05  ET026-HEADER-REC REDEFINES ET026-DATA-RECORD.                    
               10  ET026-HDR-ENT-ID               PIC X(10).                    
               10  ET026-HDR-TRAN-CDE             PIC X(1).                     
                   88  ET026-PYMT-WITH-REMIT          VALUE 'C'.                
                   88  ET026-PYMT-ONLY                VALUE 'D'.                
                   88  ET026-REMIT-DATA-ONLY          VALUE 'I'.                
                   88  ET026-PRENOTIFY-FUTURE-XFER    VALUE 'P'.                
               10  ET026-HDR-CHECK-AMT            PIC S9(9)V99.                 
               10  ET026-HDR-CR-DR-CDE            PIC X(1).                     
                   88  ET026-CREDIT                   VALUE 'C'.                
               10  ET026-HDR-PYMT-METHOD          PIC X(3).                     
                   88  ET026-PYMT-MTHD-CHECK          VALUE 'CHK'.              
                   88  ET026-PYMT-MTHD-ACH            VALUE 'ACH'.              
               10  ET026-HDR-PYMT-FMT-CDE         PIC X(3).                     
               10  ET026-HDR-ODFI-ID-QUAL         PIC X(2).                     
               10  ET026-HDR-ODFI-ROUTING-NBR     PIC X(12).                    
               10  ET026-HDR-ODFI-ACCT-NBR        PIC X(24).                    
               10  ET026-HDR-ORIG-COMPANY-ID      PIC X(10).                    
               10  ET026-HDR-RDFI-ID-QUAL         PIC X(2).                     
               10  ET026-HDR-RDFI-ROUTING-NBR     PIC X(12).                    
               10  ET026-HDR-RDFI-ACCT-NBR        PIC X(24).                    
               10  ET026-HDR-SETTLEMENT-DTE       PIC X(8).                     
               10  ET026-HDR-TRACE-TYP            PIC X(1).                     
               10  ET026-HDR-CHECK-NBR            PIC X(30).                    
               10  FILLER                         PIC X(194).                   
                                                                                
      ******************************************************************        
      *  RECORD 02 - HEADER REFERENCE INFORMATION                               
      ******************************************************************        
           05  ET026-HDR-REF-REC REDEFINES ET026-DATA-RECORD.                   
               10  ET026-HDR-REF-ID-QUAL          PIC X(02).                    
               10  ET026-HDR-REF-ID               PIC X(10).                    
               10  FILLER                         PIC X(336).                   
                                                                                
      ******************************************************************        
      *  RECORD 03 - HEADER DATE INFORMATION                                    
      ******************************************************************        
           05  ET026-HDR-DATE-REC REDEFINES ET026-DATA-RECORD.                  
               10  ET026-HDR-DATE-ID-QUAL         PIC X(03).                    
               10  ET026-HDR-DATE-ID              PIC X(8).                     
               10  FILLER                         PIC X(337).                   
                                                                                
      ******************************************************************        
      *  RECORD 04 - HEADER NAME INFORMATION                                    
      ******************************************************************        
           05  ET026-HDR-NAME-REC REDEFINES ET026-DATA-RECORD.                  
               10  ET026-ENTITY-ID-CODE           PIC X(02).                    
               10  ET026-NAME                     PIC X(60).                    
               10  ET026-ID-CODE-QUAL             PIC X(01).                    
               10  ET026-ID-CODE                  PIC X(10).                    
               10  FILLER                         PIC X(275).                   
                                                                                
      ******************************************************************        
      *  RECORD 05 - ENT LOOP COUNTER                                           
      ******************************************************************        
           05  ET026-ENT-REC REDEFINES ET026-DATA-RECORD.                       
               10  ET026-ENT-COUNTER              PIC 9(06).                    
               10  FILLER                         PIC X(342).                   
                                                                                
      ******************************************************************        
      *  RECORD 06 - ADJUSTMENT INFORMATION                                     
      ******************************************************************        
           05  ET026-ADJ-REC REDEFINES ET026-DATA-RECORD.                       
               10  ET026-ADJ-NET-AMT              PIC S9(7)V99.                 
               10  ET026-ADJ-REASON-CDE           PIC X(2).                     
               10  ET026-ADJ-REF-ID-QUALIFIER     PIC X(2).                     
               10  ET026-ADJ-DOC-NBR              PIC X(20).                    
               10  FILLER                         PIC X(315).                   
                                                                                
      ******************************************************************        
      *  RECORD 07 - ADJUSTMENT REFERENCE INFORMATION                           
      ******************************************************************        
           05  ET026-ADJ-REF-REC REDEFINES ET026-DATA-RECORD.                   
               10  ET026-ADJ-REF-ID-QUAL          PIC X(2).                     
               10  ET026-ADJ-REF-ID               PIC X(20).                    
               10  ET026-ADJ-REF-NOTES            PIC X(80).                    
               10  FILLER                         PIC X(246).                   
                                                                                
      ******************************************************************        
      *  RECORD 08 - ADJUSTMENT DATE INFORMATION                                
      ******************************************************************        
           05  ET026-ADJ-DATE-REC REDEFINES ET026-DATA-RECORD.                  
               10  ET026-ADJ-DATE-ID-QUAL         PIC X(3).                     
               10  ET026-ADJ-DATE-ID              PIC X(08).                    
               10  FILLER                         PIC X(337).                   
                                                                                
      ******************************************************************        
      *  RECORD 09 - ADJUSTMENT MEMORANDOM                                      
      ******************************************************************        
           05  ET026-ADJ-MEMO-REC REDEFINES ET026-DATA-RECORD.                  
               10  ET026-MEMO-SKU-UPC-NBR         PIC X(15).                    
               10  ET026-MEMO-ITEM-QTY            PIC 9(8).                     
               10  ET026-MEMO-UOM                 PIC X(2).                     
               10  ET026-MEMO-UNIT-COST           PIC S9(7)V99.                 
               10  ET026-MEMO-COST-CDE            PIC X(2).                     
               10  ET026-MEMO-PRODUCT-CDE         PIC X(2).                     
               10  ET026-MEMO-VEND-STYL-NBR       PIC X(20).                    
               10  FILLER                         PIC X(290).                   
                                                                                
      ******************************************************************        
      *  RECORD 10 - PAYMENT INFORMATION                                        
      ******************************************************************        
           05  ET026-PAY-REC REDEFINES ET026-DATA-RECORD.                       
               10  ET026-PAY-DOC-TYP              PIC X(2).                     
               10  ET026-PAY-DOC-NBR              PIC X(20).                    
               10  ET026-PAY-NET-AMT              PIC S9(7)V99.                 
               10  ET026-PAY-GROSS-AMT            PIC S9(7)V99.                 
               10  ET026-PAY-DISCOUNT-AMT         PIC S9(7)V99.                 
               10  FILLER                         PIC X(299).                   
                                                                                
      ******************************************************************        
      *  RECORD 11 - PAYMENT REFERENCE INFORMATION                              
      ******************************************************************        
           05  ET026-PAY-REF-REC REDEFINES ET026-DATA-RECORD.                   
               10  ET026-PAY-REF-ID-QUAL          PIC X(2).                     
               10  ET026-PAY-REF-ID               PIC X(20).                    
               10  ET026-PAY-REF-NOTES            PIC X(80).                    
               10  FILLER                         PIC X(246).                   
                                                                                
      ******************************************************************        
      *  RECORD 12 - PAYMENT DATE INFORMATION                                   
      ******************************************************************        
           05  ET026-PAY-DATE-REC REDEFINES ET026-DATA-RECORD.                  
               10  ET026-PAY-DATE-ID-QUAL         PIC X(3).                     
               10  ET026-PAY-DATE-ID              PIC X(08).                    
               10  FILLER                         PIC X(337).                   
                                                                                
