      ******************************************************************        
      *  ETRD032 - EDI 816 EXTRACT FILE - CONTAINS ALL THE EDI         *        
      *            ORGANIZATIONAL RELATIONSHIP DATA WHICH WILL         *        
      *            BE FED INTO THE TRANSLATOR.                         *        
      *                                                                *        
      *  RECORD LENGTH - 60 BYTES.                                     *        
      ******************************************************************        
                                                                                
       01  ET032-RELATIONSHIP-RECORD.                                           
           05  ET032-RECORD-TYPE-CODE             PIC X(2).                     
               88  ET032-HEADER-RECORD                VALUE '01'.               
               88  ET032-HL-RECORD                    VALUE '02'.               
               88  ET032-N1-RECORD                    VALUE '03'.               
               88  ET032-N3-RECORD                    VALUE '04'.               
               88  ET032-N4-RECORD                    VALUE '05'.               
               88  ET032-DTM-RECORD                   VALUE '06'.               
               88  ET032-ASI-RECORD                   VALUE '07'.               
           05  ET032-DATA-RECORD                  PIC X(58).                    
                                                                                
      ******************************************************************        
      *  RECORD 01 - HEADER INFORMATION (BHT & N1 SEGMENTS)            *        
      ******************************************************************        
           05  ET032-HEADER-RECORD REDEFINES ET032-DATA-RECORD.                 
               10  ET032-HDR-ENT-ID               PIC X(10).                    
               10  ET032-HDR-STRUCTURE-CODE       PIC X(4).                     
               10  ET032-HDR-PURPOSE-CODE         PIC X(2).                     
               10  ET032-HDR-DATE                 PIC X(8).                     
               10  ET032-HDR-ID-CODE              PIC X(2).                     
               10  ET032-HDR-NAME                 PIC X(22).                    
               10  FILLER                         PIC X(10).                    
                                                                                
      ******************************************************************        
      *  RECORD 02 - HIERARCHICAL LEVEL INFORMATION (HL SEGMENT)       *        
      ******************************************************************        
           05  ET032-HL-RECORD REDEFINES ET032-DATA-RECORD.                     
               10  ET032-HL-ID-NUMBER             PIC 9(5).                     
               10  ET032-HL-PARENT-ID             PIC 9(5).                     
               10  ET032-HL-LEVEL-CODE            PIC X(2).                     
               10  FILLER                         PIC X(46).                    
                                                                                
      ******************************************************************        
      *  RECORD 03 - NAME INFORMATION (N1 SEGMENT)                     *        
      ******************************************************************        
           05  ET032-N1-RECORD REDEFINES ET032-DATA-RECORD.                     
               10  ET032-N1-ID-CODE1              PIC X(2).                     
               10  ET032-N1-NAME                  PIC X(25).                    
               10  ET032-N1-ID-QUALIFIER          PIC X(2).                     
               10  ET032-N1-LOCATION              PIC X(5).                     
               10  ET032-N1-ID-CODE2              PIC X(2).                     
               10  FILLER                         PIC X(22).                    
                                                                                
      ******************************************************************        
      *  RECORD 04 - ADDRESS INFORMATION (N3 SEGMENT)                  *        
      ******************************************************************        
           05  ET032-N3-RECORD REDEFINES ET032-DATA-RECORD.                     
               10  ET032-N3-ADDRESS1              PIC X(25).                    
               10  ET032-N3-ADDRESS2              PIC X(25).                    
               10  FILLER                         PIC X(8).                     
                                                                                
      ******************************************************************        
      *  RECORD 05 - ADDRESS INFORMATION (N4 SEGMENT)                  *        
      ******************************************************************        
           05  ET032-N4-RECORD REDEFINES ET032-DATA-RECORD.                     
               10  ET032-N4-CITY                  PIC X(15).                    
               10  ET032-N4-STATE                 PIC X(2).                     
               10  ET032-N4-ZIP                   PIC X(10).                    
               10  FILLER                         PIC X(31).                    
                                                                                
      ******************************************************************        
      *  RECORD 06 - DATE INFORMATION (DTM SEGMENT)                    *        
      ******************************************************************        
           05  ET032-DTM-RECORD REDEFINES ET032-DATA-RECORD.                    
               10  ET032-DTM-QUALIFIER            PIC X(3).                     
               10  ET032-DTM-DATE                 PIC X(8).                     
               10  FILLER                         PIC X(47).                    
                                                                                
      ******************************************************************        
      *  RECORD 07 - ACTION INFORMATION (ASI SEGMENT)                  *        
      ******************************************************************        
           05  ET032-ASI-RECORD REDEFINES ET032-DATA-RECORD.                    
               10  ET032-ASI-ACTION-CODE          PIC X(2).                     
               10  ET032-ASI-TYPE-CODE            PIC X(3).                     
               10  FILLER                         PIC X(53).                    
