      ******************************************************************        
      *  ETRD109 - EDI EXTRACT FILE - CONTAINS ALL THE EDI TEXT MESSAGE         
      *            INFORMATION THAT WILL BE FED INTO THE TRANSLATOR             
      *            INTERFACE PROGRAM.                                           
      *                                                                         
      *  RECORD LENGTH - 250 BYTES.                                             
      ******************************************************************        
                                                                                
       01  ET109-EDI-EXTRACT-RECORD.                                            
           05  ET109-RECORD-TYPE-IND           PIC X(02)  VALUE SPACES.         
               88  ET109-HEADER                           VALUE '01'.           
               88  ET109-MSG-IDENT                        VALUE '02'.           
               88  ET109-MSG-DETAIL                       VALUE '03'.           
           05  ET109-ENT-ID                    PIC X(10).                       
           05  ET109-MSG-TYPE                  PIC X(02).                       
           05  ET109-ID-SEQ-NBR                PIC 9(05).                       
           05  ET109-MSG-SEQ-NBR               PIC 9(05).                       
           05  ET109-DATA-AREA                 PIC X(226) VALUE SPACES.         
                                                                                
           05  ET109-IDENT-DATA REDEFINES ET109-DATA-AREA.                      
               10  ET109-MSG-ID-NBR            PIC X(30).                       
               10  ET109-SUBJECT               PIC X(80).                       
               10  ET109-CONTACT               PIC X(60).                       
               10  ET109-FAX-NUMBER            PIC X(12).                       
               10  ET109-PHONE-NUMBER          PIC X(12).                       
               10  FILLER                      PIC X(32).                       
                                                                                
           05  ET109-DETAIL-DATA REDEFINES ET109-DATA-AREA.                     
               10  ET109-DTL-MSG-TEXT          PIC X(80).                       
               10  FILLER                      PIC X(146).                      
