JF1001******************************************************************00010000
JF1001* THIS IS THE FORMAT LAYOUT FOR THE 856 STATUS CHANGES            00030000
JF1001* REPORT EXTRACT AND COMPARE PROCESSES (ETKUT141 AND ETKUT142).   00040000
JF1001***************************************************************** 00080000
JF1001*01  ET029-ASN-EXTR-REC.                                          00081003
JF1001     05  ET029-ENT-NAME-DESC         PIC X(30).                   00090003
JF1001     05  ET029-ENT-ID                PIC S9(9) COMP.                      
JF1001     05  ET029-VEND-INCHG-ID         PIC X(15).                           
JF1001     05  ET029-VEND-INCHG-ID-DESC    PIC X(02).                           
JF1001     05  ET029-INACTV-DTE            PIC X(10).                           
JF1001     05  ET029-PROD-TEST-IND         PIC X(01).                           
