      ****************************************************************          
      * ETRD018 - SHIPMENT STATUS                                    *          
      * RECORD LENGTH - 400 BYTES                                    *          
      ****************************************************************          
                                                                                
       01  ET214-SHIP-STATUS-RECORD.                                            
           05  ET214-SHIPMENT-ID-NUMBER          PIC X(30).                     
           05  ET214-RECORD-TYPE                 PIC X(2).                      
               88  ET214-HEADER-RECORD           VALUE '01'.                    
               88  ET214-MAN-CAN-RECORD          VALUE '02'.                    
               88  ET214-STATUS-RECORD           VALUE '03'.                    
               88  ET214-SUMMARY-RECORD          VALUE '04'.                    
               88  ET214-PO-RECORD               VALUE '05'.                    
           05  ET214-DATA-AREA                   PIC X(368).                    
                                                                                
           05  ET214-HEADER-REC REDEFINES ET214-DATA-AREA.                      
               10  ET214-ST-CONTROL-NUMBER       PIC X(9).                      
               10  ET214-PRO-NUMBER              PIC X(30).                     
               10  ET214-SCAC-CODE               PIC X(4).                      
               10  ET214-INQ-REQ-NUMBER          PIC 9(3).                      
               10  ET214-N1-HEADER               OCCURS 5 TIMES.                
                   15  ET214-N1-ENTITY-QUAL      PIC X(3).                      
                       88  ET214-CONSOLIDATOR    VALUE 'CS '.                   
                       88  ET214-SHIP-FROM       VALUE 'SH '.                   
                       88  ET214-SHIP-TO         VALUE 'ST '.                   
                   15  ET214-N1-ENTITY-NAME      PIC X(35).                     
                   15  ET214-N1-STORE-DC-NUMBER  PIC X(5).                      
               10  ET214-ISA-CONTROL-NUMBER      PIC 9(9).                      
               10  ET214-GS-CONTROL-NUMBER       PIC 9(9).                      
               10  ET214-TIMESTAMP               PIC X(26).                     
               10  ET214-SESSION-NUMBER          PIC 9(6).                      
               10  ET214-ISA-ID-QUAL             PIC X(2).                      
               10  ET214-ISA-ID                  PIC X(15).                     
               10  FILLER                        PIC X(40).                     
                                                                                
           05  ET214-MAN-CAN-REC REDEFINES ET214-DATA-AREA.                     
               10  ET214-L11-HEADER-REF          PIC X(30).                     
               10  ET214-L11-HEADER-QUAL         PIC X(3).                      
                   88  ET214-MANIFEST            VALUE 'MA '.                   
                   88  ET214-CAN-NUMBER          VALUE '06 '.                   
               10  FILLER                        PIC X(335).                    
                                                                                
           05  ET214-STATUS-REC REDEFINES ET214-DATA-AREA.                      
               10  ET214-STATUS-CODE             PIC X(2).                      
               10  ET214-REASON-CODE             PIC X(2).                      
               10  ET214-APPT-STATUS-CODE        PIC X(2).                      
               10  ET214-APPT-REASON-CODE        PIC X(2).                      
               10  ET214-DATE                    PIC X(8).                      
               10  ET214-TIME                    PIC X(4).                      
               10  ET214-TIME-CODE               PIC X(2).                      
               10  ET214-CITY                    PIC X(30).                     
               10  ET214-STATE                   PIC X(2).                      
               10  ET214-CARRIER-SCAC            PIC X(4).                      
               10  ET214-EQUIPMENT-NUMBER        PIC X(10).                     
               10  FILLER                        PIC X(300).                    
                                                                                
           05  ET214-SUMMARY-REC REDEFINES ET214-DATA-AREA.                     
               10  ET214-STOP-NUMBER             PIC X(30).                     
               10  ET214-SERVICES-CODE           PIC X(3).                      
               10  ET214-WEIGHT                  PIC 9(10).                     
               10  ET214-LADING-QUANTITY         PIC 9(7).                      
               10  ET214-CHARGE-QUALIFIER        PIC X(2).                      
               10  ET214-CHARGE-SIGN             PIC X(1).                      
               10  ET214-CHARGE                  PIC 9(9)V99.                   
               10  FILLER                        PIC X(304).                    
                                                                                
           05  ET214-PO-REC REDEFINES ET214-DATA-AREA.                          
               10  ET214-PO-NUMBER               PIC X(22).                     
               10  ET214-QUANTITY                PIC 9(15).                     
               10  FILLER                        PIC X(331).                    
