00001 ******************************************************************06/22/94
00002 *    EDI SALES EXTRACT RECORD                                     ETRD005 
00003 *                                                                    LV002
00004 *    LENGTH - 350 BYTES                                           ETRD005 
00005 ******************************************************************ETRD005 
00006  01  ET005-EDI-SALES-EXTRACT-REC.                                    CL**2
00007      05  ET005-ENT-ID                     PIC S9(9)  COMP            CL**2
00008                                                      VALUE ZEROES.ETRD005 
00009      05  ET005-TRANSACTION-SET-ID         PIC X(03)  VALUE SPACES.   CL**2
00010      05  ET005-DIV-INTERCHANGE-ID         PIC X(12)  VALUE SPACES.   CL**2
00011      05  ET005-RECORD-TYPE                PIC X(01)  VALUE SPACES.   CL**2
00012          88  ET005-STORE-RECORD                      VALUE '1'.      CL**2
00013          88  ET005-ALL-STORES-RECORD                 VALUE '2'.      CL**2
00014      05  ET005-DEPT                       PIC X(03)  VALUE SPACES.   CL**2
00015      05  FILLER                           PIC X(02)  VALUE SPACES.   CL**2
00016      05  FILLER                           PIC X(03)  VALUE SPACES.   CL**2
00017      05  ET005-UPC-CODE                   PIC 9(15)  VALUE ZEROES.   CL**2
00018      05  ET005-STORE-NUMBER               PIC X(05)  VALUE SPACES.   CL**2
00019      05  ET005-CURRENT-DATE               PIC X(06)  VALUE SPACES.   CL**2
00020      05  ET005-WEEK-START-DATE            PIC X(06)  VALUE SPACES.   CL**2
00021      05  ET005-WEEK-END-DATE              PIC X(06)  VALUE SPACES.   CL**2
00022      05  ET005-DAILY-WEEKLY-IND           PIC X(01)  VALUE SPACES.   CL**2
00023          88  ET005-DAILY-SALES                       VALUE 'D'.      CL**2
00024          88  ET005-WEEKLY-SALES                      VALUE 'W'.      CL**2
00025      05  ET005-TEST-PROD-IND              PIC X(01)  VALUE SPACES.   CL**2
00026          88  ET005-TEST-RUN                          VALUE 'T'.      CL**2
00027          88  ET005-PRODUCTION-RUN                    VALUE 'P'.      CL**2
00028      05  ET005-UNITS-SOLD-RETAIL          PIC S9(05) VALUE +0        CL**2
00029                                                      COMP-3.      ETRD005 
00030      05  ET005-UNITS-SOLD-PROMO           PIC S9(05) VALUE +0        CL**2
00031                                                      COMP-3.      ETRD005 
00032      05  ET005-UNITS-SOLD-CLEAR           PIC S9(05) VALUE +0        CL**2
00033                                                      COMP-3.      ETRD005 
00034      05  ET005-UNITS-SOLD-ALL             PIC S9(07) VALUE +0        CL**2
00035                                                      COMP-3.      ETRD005 
00036      05  ET005-ONHAND-QUANTITY            PIC S9(07) VALUE +0        CL**2
00037                                                      COMP-3.      ETRD005 
00038      05  ET005-UNIT-PRICE-RETAIL          PIC S9(09)V99              CL**2
00039                                                      VALUE +0     ETRD005 
00040                                                      COMP-3.      ETRD005 
00041      05  ET005-UNIT-PRICE-PROMO           PIC S9(09)V99              CL**2
00042                                                      VALUE +0     ETRD005 
00043                                                      COMP-3.      ETRD005 
00044      05  ET005-UNIT-PRICE-CLEAR           PIC S9(09)V99              CL**2
00045                                                      VALUE +0     ETRD005 
00046                                                      COMP-3.      ETRD005 
00047      05  ET005-UNIT-PRICE-ALL             PIC S9(09)V99              CL**2
00048                                                      VALUE +0     ETRD005 
00049                                                      COMP-3.      ETRD005 
00050      05  ET005-SALES-TYPE-LEVEL           PIC X(01)  VALUE SPACES.   CL**2
00051          88  ET005-ALL-SALES                         VALUE '1'.      CL**2
00052          88  ET005-INDIVIDUAL-SALES                  VALUE '2'.      CL**2
00053      05  ET005-ONHAND-IND                 PIC X(01)  VALUE SPACES.   CL**2
00054          88  ET005-ONHAND                            VALUE 'Y'.      CL**2
00055          88  ET005-NO-ONHAND                         VALUE 'N'.      CL**2
00056      05  FILLER                           PIC X(239) VALUE SPACES.ETRD005 
