00001 ***************************************************************** 01/26/95
00002 *    RECORD LENGTH:  350 BYTES                                  * ETRD012 
00003 *    RECORD FORMAT:  SEQUENTIAL                                 *    LV003
00004 ***************************************************************** ETRD012 
00005                                                                   ETRD012 
00006  01  ET012-ADV-SHIP-NOTICE.                                       ETRD012 
00007      05  ET012-HEADER-LEVEL-ID             PIC X(03) VALUE SPACES.ETRD012 
00008      05  ET012-ID-RECORD.                                         ETRD012 
00009          10  ET012-EDI-VENDOR-ID.                                 ETRD012 
00010              15  ET012-INTERCHANGE-ID-QUAL PIC X(02) VALUE SPACES.ETRD012 
00011              15  ET012-INTERCHANGE-ID      PIC X(15) VALUE SPACES.ETRD012 
00012          10  FILLER                        PIC X(02) VALUE SPACES.ETRD012 
00013          10  ET012-ASN-NUMBER              PIC X(30) VALUE SPACES.ETRD012 
00014          10  FILLER                        PIC X(10) VALUE SPACES.   CL**3
00015          10  ET012-RECYCLE-DATE.                                     CL**3
00016              15  ET012-RECYCLE-YY          PIC 9(02) VALUE ZEROES.   CL**3
00017              15  ET012-RECYCLE-MM          PIC 9(02) VALUE ZEROES.   CL**3
00018              15  ET012-RECYCLE-DD          PIC 9(02) VALUE ZEROES.   CL**3
00019      05  ET012-PRF-RECORD REDEFINES ET012-ID-RECORD.              ETRD012 
00020          10  ET012-PO-NUMBER              PIC X(21).                 CL**2
00021          10  FILLER                       PIC X(44).                 CL**3
00022      05  FILLER                           PIC X(282) VALUE SPACES.   CL**3
