00001 *----------------------------------------------------------------*07/07/94
00002 *                         ETWS307                                *ETWS307 
00003 *                                                                *   LV010
00004 *   THIS IS THE INTER-APPLICATION COMMUNICATIONS WORK AREA       *ETWS307 
00005 *   USED IN THE EDI VENDOR DETAILS SUB-SYSTEM.                   *ETWS307 
00006 *                                                                *ETWS307 
00007 *   LENGTH: 200 BYTES                                            *ETWS307 
00008 *----------------------------------------------------------------*ETWS307 
00009                                                                   ETWS307 
00010        10  ET307-INTER-APPL-COMMAREA   REDEFINES                  ETWS307 
00011            INTER-APPL-COMM-AREA.                                  ETWS307 
00012            15  FILLER                      PIC  X(01).               CL**9
00013            15  ET307-ENT-ID                PIC S9(09) COMP.          CL**9
00014            15  ET307-VENDOR-NAME           PIC X(30).             ETWS307 
00015            15  ET307-CONTROL-NUM           PIC 9(09).                CL**5
00016            15  ET307-CONTROL-NUM-X REDEFINES ET307-CONTROL-NUM       CL**5
00017                                            PIC X(09).                CL**5
00018            15  ET307-DIRECTION-IND         PIC X(01).             ETWS307 
00019            15  ET307-ERROR-IND             PIC X(01).             ETWS307 
00020            15  ET307-NUM-XMITS             PIC 9(03).                CL**5
00021            15  ET307-NUM-XMITS-X REDEFINES ET307-NUM-XMITS           CL**5
00022                                            PIC X(03).                CL**5
00023            15  ET307-TRAN-SET              PIC X(03).             ETWS307 
00024            15  ET307-BEGIN-DT.                                    ETWS307 
00025                20  ET307-BEGIN-DT-YYYY     PIC  X(04).            ETWS307 
00026                20  ET307-BEGIN-DT-MM       PIC  X(02).            ETWS307 
00027                20  ET307-BEGIN-DT-DD       PIC  X(02).            ETWS307 
00028            15  ET307-END-DT.                                      ETWS307 
00029                20  ET307-END-DT-YYYY       PIC  X(04).            ETWS307 
00030                20  ET307-END-DT-MM         PIC  X(02).            ETWS307 
00031                20  ET307-END-DT-DD         PIC  X(02).            ETWS307 
00032 ******************************************************************   CL**6
00033            15  ET307-DOC-DTL               PIC X(30).                CL**6
00034                                                                   ETWS307 
00035 ******************************************************************   CL**6
00036                                                                      CL*10
00037              15  ET307-TP-DKEY              PIC  S9(9) COMP.         CL*10
00038              15  ET307-TP-DKEY-TMST         PIC  X(26).              CL*10
00039 ******************************************************************   CL*10
00040            15  ET307-NUMBER-OF-SELECTED-ITEMS PIC S9(09)             CL**4
00041                                             COMP-3.                  CL**4
00042            15  ET307-NUMBER-OF-TS-ITEMS PIC S9(05)                   CL**4
00043                                             COMP-3.                  CL**4
00044            15  ET307-SEL-QUEUE-NAME     PIC X(8).                    CL**4
00045            15  FILLER                   PIC  X(56).                  CL*10
00046                                                                   ETWS307 
