00001  01  ET020-TSET-DETAIL-RECORD.                                    11/18/94
00002      05  ET020-REC-TYPE                   PIC X(1).               ETWS020 
00003          88  ET020-HEADER                     VALUE '1'.             LV001
00004          88  ET020-DETAIL                     VALUE '2'.          ETWS020 
00005          88  ET020-ERROR                      VALUE 'E'.          ETWS020 
00006      05  ET020-DATA                       PIC X(199).             ETWS020 
00007      05  ET020-HEADER-INFO REDEFINES ET020-DATA.                  ETWS020 
00008          10  ET020-TP-DKEY                PIC S9(9)  COMP         ETWS020 
00009              OCCURS 25 TIMES.                                     ETWS020 
00010          10  ET020-VEND-INCHG-ID-QUAL     PIC X(02).              ETWS020 
00011          10  ET020-VEND-INCHG-ID          PIC X(15).              ETWS020 
00012          10  ET020-NETWK-ID               PIC X(01).              ETWS020 
00013          10  ET020-DIR-IND                PIC X(01).              ETWS020 
00014          10  ET020-CRE-DTE                PIC 9(06).              ETWS020 
00015          10  ET020-CRE-TME                PIC 9(06).              ETWS020 
00016          10  ET020-RCPT-DTE               PIC 9(06).              ETWS020 
00017          10  ET020-RCPT-TME               PIC 9(06).              ETWS020 
00018          10  ET020-PKUP-DTE               PIC 9(06).              ETWS020 
00019          10  ET020-PKUP-TME               PIC 9(06).              ETWS020 
00020          10  ET020-INCHG-CTL-NBR          PIC 9(09).              ETWS020 
00021          10  ET020-ERROR-IND              PIC X(01).              ETWS020 
00022          10  ET020-PROD-TEST-IND          PIC X(01).              ETWS020 
00023          10  FILLER                       PIC X(33).              ETWS020 
00024      05  ET020-DETAIL-INFO     REDEFINES  ET020-DATA.             ETWS020 
00025          10  ET020-FG-CTL-NBR             PIC X(09).              ETWS020 
00026          10  ET020-FG-CTL-NBR-9  REDEFINES                        ETWS020 
00027              ET020-FG-CTL-NBR             PIC 9(09).              ETWS020 
00028          10  ET020-TSET-CTL-NBR           PIC X(09).              ETWS020 
00029          10  ET020-TRAN-SET-CDE           PIC X(03).              ETWS020 
00030          10  ET020-TRAN-SET-DTL           PIC X(30).              ETWS020 
00031          10  ET020-ROUTED-IND             PIC X(01).              ETWS020 
00032          10  FILLER                       PIC X(147).             ETWS020 
00033      05  ET020-ERROR-INFO      REDEFINES  ET020-DATA.             ETWS020 
00034          10  ET020-ERR-SEG-ID             PIC X(03).              ETWS020 
00035          10  ET020-ERR-SEQ-NBR.                                   ETWS020 
00036              15  ET020-ERR-SEQ-NBR-9      PIC 9(06).              ETWS020 
00037          10  ET020-ERR-MSG                PIC X(109).             ETWS020 
00038          10  ET020-ERROR-TYPE             PIC X(01).                      
00039              88  ET020-CONTROL-NUM-ERROR      VALUE '1'.                  
00040              88  ET020-MAJOR-ERROR            VALUE '2'.                  
00023          10  FILLER                       PIC X(80).              ETWS020 
