00001 *----------------------------------------------------------------*03/01/94
00002 *                         ETWS301                                *ETWS301 
00003 *                                                                *   LV010
00004 *   THIS IS THE TEMP-STORAGE QUEUE (RECORD LAYOUT) USED BY       *ETWS301 
00005 *   ETKCS301 (VENDOR LIST) TO PASS SELECTED VENDOR NAMES         *ETWS301 
00006 *                                                                *ETWS301 
00007 *----------------------------------------------------------------*ETWS301 
00008                                                                   ETWS301 
00009  01  ET301-SELECTED-VNDRS.                                        ETWS301 
00010        05  ET301-SELECTED-ITEMS         PIC S9(05)  COMP-3        ETWS301 
00011                                                     VALUE ZERO.   ETWS301 
00012        05  ET301-MAX-ITEMS              PIC  9(03)  VALUE 20.     ETWS301 
00013        05  ET301-SELECTED-ITEM-ARRAY.                             ETWS301 
00014            10  FILLER                   OCCURS 20 TIMES           ETWS301 
00015                                         INDEXED BY ET301-IDX.     ETWS301 
00016                15  ET301-ITEM           PIC S9(09)  COMP-3.       ETWS301 
00017                15  ET301-ACTION-SW      PIC  X(01).               ETWS301 
00018                    88  ET301-INQ                    VALUE 'I'.    ETWS301 
00019                    88  ET301-ADD                    VALUE 'A'.       CL**4
00020                    88  ET301-UPD                    VALUE 'U'.       CL**4
00021                    88  ET301-DEL                    VALUE 'D'.    ETWS301 
00022                    88  ET301-ERR                    VALUE 'E'.    ETWS301 
00023                15  ET301-KEY-DATA.                                ETWS301 
00024                    20  ET301-ENT-ID             PIC  S9(9) COMP.     CL**3
00025                    20  ET301-VENDOR-NAME        PIC  X(30).          CL**3
00026                    20  ET301-TP-DKEY            PIC  S9(9) COMP.     CL**3
00027                    20  ET301-VEND-INCHG-QUAL    PIC  X(02).          CL**3
00028                    20  ET301-VEND-INCHG-ID      PIC  X(15).          CL**3
00029                    20  ET301-NETWK-ID           PIC  X(01).          CL**3
00029                    20  ET301-NRFC-ID            PIC  X(01).          CL**3
00030                    20  ET301-NETWK-NAME         PIC  X(15).          CL**3
00031                15  ET301-MISC-FILLER            PIC  X(45).          CL**9
00032                15  ET301-FUNC-GROUP-FIELDS.                          CL**5
00033                    20  ET301-FUNC-CDE           PIC  X(02).          CL**5
00034                    20  ET301-DIR-IND            PIC  X(01).          CL**5
00035                    20  ET301-FG-FILLER          PIC  X(10).          CL**8
00036                15  ET301-TRANSACTION-SET-FIELDS.                     CL**5
00037                    20  ET301-TRAN-SET-CDE       PIC  X(03).          CL**5
00038                    20  ET301-PROD-TEST-IND      PIC  X(01).          CL**5
00039                    20  ET301-TS-FILLER          PIC  X(10).          CL**9
00040                15  ET301-MORE-FILLER            PIC  X(24).          CL*10
