00001 *----------------------------------------------------------------*02/14/94
00002 *                         ETWS335                                *ETWS335 
00003 *                                                                *   LV005
00004 * THIS IS THE SELECTED ITEMS TS QUEUE RECORD LAYOUT USED BY THE      CL**5
00005 * NETWORK LIST TO PASS THE KEYS OF THE SELECTED ITEMS TO THE         CL**5
00006 * INQUIRY AND MAINTENANCE PROGRAMS, WHICH THEN UPDATE THE QUEUE      CL**5
00007 * RECORD TO INDICATE WHAT ACTION WAS TAKEN ON THE SELECTED ITEMS.    CL**5
00008 *----------------------------------------------------------------*ETWS335 
00009                                                                   ETWS335 
00010  01  ET335-NETWORK-ID-REC.                                           CL**3
00011        05  ET335-SELECTED-ITEMS       PIC S9(05)    COMP-3           CL**2
00012                                                     VALUE ZERO.   ETWS335 
00013        05  ET335-MAX-ITEMS            PIC  9(02)    VALUE 50.        CL**2
00014        05  ET335-SELECTED-ITEM-ARRAY.                             ETWS335 
00015            10  FILLER                 OCCURS 50 TIMES                CL**2
00016                                       INDEXED BY ET335-IDX.          CL**2
00017                15  ET335-ITEM         PIC S9(09)    COMP-3.          CL**2
00018                15  ET335-ACTION-SW    PIC  X.                        CL**2
00019                    88  ET335-INQ                    VALUE 'I'.    ETWS335 
00020                    88  ET335-UPD                    VALUE 'U'.    ETWS335 
00021                    88  ET335-DEL                    VALUE 'D'.    ETWS335 
00022                    88  ET335-ERR                    VALUE 'E'.    ETWS335 
00023                15  ET335-KEY-DATA.                                ETWS335 
00024                    20  ET335-NETWORK-ID PIC X.                       CL**3
