00001 *----------------------------------------------------------------*07/27/94
00002 *                         ETWS300                                *ETWS300 
00003 *                                                                *   LV001
00004 *   THIS IS THE INTER-APPLICATION COMMUNICATIONS WORK AREA       *ETWS300 
00005 *   USED IN THE EDI VENDOR DETAILS SUB-SYSTEM.                   *ETWS300 
00006 *                                                                *ETWS300 
00007 *   LENGTH: 200 BYTES                                            *ETWS300 
00008 *----------------------------------------------------------------*ETWS300 
00009                                                                   ETWS300 
00010        10  ET300-INTER-APPL-COMMAREA   REDEFINES                  ETWS300 
00011            INTER-APPL-COMM-AREA.                                  ETWS300 
00012                                                                   ETWS300 
00013            15  ET300-INT-APPL-FORMAT-IND PIC X(01).               ETWS300 
00014                88  ET300-MENU                VALUE ' '.           ETWS300 
00015                88  ET300-LIST                VALUE '2'.           ETWS300 
00016                                                                   ETWS300 
00017            15  ET300-NBR-SELECTED-ITEMS PIC S9(09)                ETWS300 
00018                                             COMP-3.               ETWS300 
00019            15  ET300-NUMBER-OF-TS-ITEMS PIC S9(05)                ETWS300 
00020                                             COMP-3.               ETWS300 
00021            15  ET300-SEL-QUEUE-NAME     PIC X(8).                 ETWS300 
00022                                                                   ETWS300 
00023            15  ET300-ENT-ID             PIC  S9(9) COMP.          ETWS300 
00024            15  ET300-VENDOR-NAME        PIC  X(30).               ETWS300 
00025            15  ET300-TP-DKEY            PIC  S9(9) COMP.          ETWS300 
00026            15  ET300-VEND-INCHG-QUAL    PIC  X(02).               ETWS300 
00027            15  ET300-VEND-INCHG-ID      PIC  X(15).               ETWS300 
00028            15  ET300-NETWK-ID           PIC  X(01).               ETWS300 
00028            15  ET300-NRFCOMP-ID         PIC  X(01).               ETWS300 
00029            15  ET300-NETWORK-NAME       PIC  X(15).               ETWS300 
00030            15  ET300-FUNC-GROUP-FIELDS.                           ETWS300 
00031                20  ET300-FUNC-CDE       PIC  X(02).               ETWS300 
00032                20  ET300-DIR-IND        PIC  X(01).               ETWS300 
00033            15  ET300-ENT-ACTION         PIC  X(03).               ETWS300 
00034                88  ET300-ADD            VALUE 'ADD'.              ETWS300 
00035            15  ET300-TRAN-SET           PIC  X(03).               ETWS300 
00036            15  FILLER                   PIC  X(102).              ETWS300 
00037                                                                   ETWS300 
