*          DATA SET FSKM055    AT LEVEL 003 AS OF 03/05/98                      
*          DATA SET FSKM055    AT LEVEL 002 AS OF 07/10/95                      
*          DATA SET FSKM055    AT LEVEL 001 AS OF 07/30/93              00001   
*********************************************************************** 00002   
*   INCORPORATES API ARCHITECTURE - MJB 8/93 (NEW)                      00003   
*                                                                       00004   
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00005   
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00006   
*********************************************************************** 00007   
        PRINT  NOGEN                                                    00008   
FSKM055 DFHMSD TYPE=DSECT,                                             C00009   
               LANG=COBOL,                                             C00010   
               MODE=INOUT,                                             C00011   
               STORAGE=AUTO,                                           C00012   
               TERM=3270-2,                                            C00013   
               TIOAPFX=YES                                              00014   
**************                                                          00015   
FS055A  DFHMDI LINE=2,COLUMN=1,                                        C00016   
               SIZE=(19,80),                                           C00017   
               CTRL=(FREEKB),                                          C00018   
               MAPATTS=(COLOR,HILIGHT),                                C00019   
               DSATTS=(COLOR,HILIGHT)                                   00020   
**************                                                          00021   
        DFHMDF POS=(01,2),LENGTH=06,ATTRB=(ASKIP,NORM),                C00022   
               COLOR=NEUTRAL,INITIAL='COLOR:'                           00023   
ACOLOR1 DFHMDF POS=(01,9),LENGTH=3,ATTRB=(ASKIP,NORM),                 C00024   
               COLOR=BLUE                                               00025   
        DFHMDF POS=(01,13),LENGTH=1,ATTRB=(ASKIP,NORM),                C00022   
               COLOR=NEUTRAL,INITIAL='-'                                00023   
ACOLOR2 DFHMDF POS=(01,15),LENGTH=3,ATTRB=(ASKIP,NORM),                C00024   
               COLOR=BLUE                                               00025   
ACOLOR  DFHMDF POS=(01,19),LENGTH=10,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=BLUE                                               00025   
        DFHMDF POS=(01,30),LENGTH=05,ATTRB=(ASKIP,NORM),               C00022   
               COLOR=NEUTRAL,INITIAL='SIZE:'                            00023   
ASIZE   DFHMDF POS=(01,36),LENGTH=10,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=BLUE                                               00025   
        DFHMDF POS=(01,47),LENGTH=05,ATTRB=(ASKIP,NORM),               C00022   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00023   
ASTRTIT DFHMDF POS=(01,56),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00024   
               COLOR=GREEN,                                            C00025   
               HILIGHT=UNDERLINE,                                      C00026   
               PICOUT='ZZZZ9'                                           00027   
        DFHMDF POS=(01,62),LENGTH=02,ATTRB=(ASKIP,NORM),               C00028   
               COLOR=NEUTRAL,                                          C00029   
               INITIAL='TO'                                             00030   
AENDIT  DFHMDF POS=(01,65),LENGTH=05,ATTRB=(ASKIP,NORM),               C00031   
               COLOR=BLUE,                                             C00032   
               PICOUT='ZZZZ9'                                           00033   
        DFHMDF POS=(01,71),LENGTH=02,ATTRB=(ASKIP,NORM),               C00034   
               COLOR=NEUTRAL,                                          C00035   
               INITIAL='OF'                                             00036   
ATOTIT  DFHMDF POS=(01,74),LENGTH=05,ATTRB=(ASKIP,NORM),               C00037   
               COLOR=BLUE,                                             C00038   
               PICOUT='ZZZZ9'                                           00039   
*                                                                       00040   
        DFHMDF POS=(02,02),LENGTH=04,ATTRB=(PROT,NORM),                C00041   
               COLOR=NEUTRAL,                                          C00042   
               INITIAL='DPT:'                                           00043   
ADEPT   DFHMDF POS=(02,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C00044   
               COLOR=BLUE                                               00045   
ADPTDSC DFHMDF POS=(02,11),LENGTH=25,ATTRB=(ASKIP,NORM),               C00046   
               COLOR=BLUE                                               00047   
        DFHMDF POS=(02,37),LENGTH=06,ATTRB=(PROT,NORM),                C00048   
               COLOR=NEUTRAL,                                          C00049   
               INITIAL='STORE:'                                         00050   
ASTORE  DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00051   
               COLOR=BLUE                                               00052   
ASTDESC DFHMDF POS=(02,50),LENGTH=25,ATTRB=(ASKIP,NORM),               C00053   
               COLOR=BLUE                                               00054   
*                                                                       00055   
        DFHMDF POS=(03,33),LENGTH=05,ATTRB=(PROT,NORM),                C00056**5
               COLOR=NEUTRAL,                                          C00057   
               INITIAL='CURR '                                          00058**5
AHEADR1 DFHMDF POS=(03,39),LENGTH=41,ATTRB=(PROT,NORM),                C00059**5
               COLOR=NEUTRAL                                            00060   
*                                                                       00077   
        DFHMDF POS=(04,01),LENGTH=01,ATTRB=(PROT,NORM),                C00078   
               COLOR=NEUTRAL,                                          C00079   
               INITIAL='S'                                              00080   
        DFHMDF POS=(04,03),LENGTH=02,ATTRB=(PROT,NORM),                C00081**3
               COLOR=NEUTRAL,                                          C00082   
               INITIAL='SC'                                             00083   
        DFHMDF POS=(04,06),LENGTH=08,ATTRB=(PROT,NORM),                C00084**3
               COLOR=NEUTRAL,                                          C00085   
               INITIAL='SKU'                                            00086   
        DFHMDF POS=(04,15),LENGTH=15,ATTRB=(PROT,NORM),                C00087**3
               COLOR=NEUTRAL,                                          C00088   
               INITIAL='SKU DESCRIPTION'                                00089   
        DFHMDF POS=(04,34),LENGTH=04,ATTRB=(PROT,NORM),                C00090**6
               COLOR=NEUTRAL,                                          C00091   
               INITIAL='RTL.'                                           00092   
AHEADR2 DFHMDF POS=(04,39),LENGTH=41,ATTRB=(PROT,NORM),                C00059**5
               COLOR=NEUTRAL                                            00060   
*                                                                       00119   
ASEL01  DFHMDF POS=(05,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00120   
               HILIGHT=UNDERLINE,                                      C00121   
               COLOR=GREEN                                              00122   
ACL01   DFHMDF POS=(05,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00123**2
               COLOR=BLUE                                               00124   
ASKU01  DFHMDF POS=(05,06),LENGTH=08,ATTRB=(ASKIP,NORM),               C00125**2
               COLOR=BLUE                                               00126   
ASKDS01 DFHMDF POS=(05,15),LENGTH=14,ATTRB=(ASKIP,NORM),               C00127**2
               COLOR=BLUE                                               00128   
ACRTL01 DFHMDF POS=(05,30),LENGTH=08,ATTRB=(ASKIP,NORM),               C00129**2
               COLOR=BLUE                                               00130   
ASCRL01 DFHMDF POS=(05,39),LENGTH=41,ATTRB=(ASKIP,NORM),               C00131**2
               COLOR=BLUE                                               00132   
*                                                                       00143   
ASEL02  DFHMDF POS=(06,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00144   
               HILIGHT=UNDERLINE,                                      C00145   
               COLOR=GREEN                                              00146   
ACL02   DFHMDF POS=(06,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00147**2
               COLOR=BLUE                                               00148   
ASKU02  DFHMDF POS=(06,06),LENGTH=08,ATTRB=(ASKIP,NORM),               C00149**2
               COLOR=BLUE                                               00150   
ASKDS02 DFHMDF POS=(06,15),LENGTH=14,ATTRB=(ASKIP,NORM),               C00151**2
               COLOR=BLUE                                               00152   
ACRTL02 DFHMDF POS=(06,30),LENGTH=08,ATTRB=(ASKIP,NORM),               C00153**2
               COLOR=BLUE                                               00154   
ASCRL02 DFHMDF POS=(06,39),LENGTH=41,ATTRB=(ASKIP,NORM),               C00131**2
               COLOR=BLUE                                               00132   
*                                                                       00167   
ASEL03  DFHMDF POS=(07,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00168   
               HILIGHT=UNDERLINE,                                      C00169   
               COLOR=GREEN                                              00170   
ACL03   DFHMDF POS=(07,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00171**2
               COLOR=BLUE                                               00172   
ASKU03  DFHMDF POS=(07,06),LENGTH=08,ATTRB=(ASKIP,NORM),               C00173**2
               COLOR=BLUE                                               00174   
ASKDS03 DFHMDF POS=(07,15),LENGTH=14,ATTRB=(ASKIP,NORM),               C00175**2
               COLOR=BLUE                                               00176   
ACRTL03 DFHMDF POS=(07,30),LENGTH=08,ATTRB=(ASKIP,NORM),               C00177**2
               COLOR=BLUE                                               00178   
ASCRL03 DFHMDF POS=(07,39),LENGTH=41,ATTRB=(ASKIP,NORM),               C00131**2
               COLOR=BLUE                                               00132   
*                                                                       00191   
ASEL04  DFHMDF POS=(08,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00192   
               HILIGHT=UNDERLINE,                                      C00193   
               COLOR=GREEN                                              00194   
ACL04   DFHMDF POS=(08,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00195**2
               COLOR=BLUE                                               00196   
ASKU04  DFHMDF POS=(08,06),LENGTH=08,ATTRB=(ASKIP,NORM),               C00197**2
               COLOR=BLUE                                               00198   
ASKDS04 DFHMDF POS=(08,15),LENGTH=14,ATTRB=(ASKIP,NORM),               C00199**2
               COLOR=BLUE                                               00200   
ACRTL04 DFHMDF POS=(08,30),LENGTH=08,ATTRB=(ASKIP,NORM),               C00201**2
               COLOR=BLUE                                               00202   
ASCRL04 DFHMDF POS=(08,39),LENGTH=41,ATTRB=(ASKIP,NORM),               C00131**2
               COLOR=BLUE                                               00132   
*                                                                       00215   
ASEL05  DFHMDF POS=(09,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00216   
               HILIGHT=UNDERLINE,                                      C00217   
               COLOR=GREEN                                              00218   
ACL05   DFHMDF POS=(09,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00219**2
               COLOR=BLUE                                               00220   
ASKU05  DFHMDF POS=(09,06),LENGTH=08,ATTRB=(ASKIP,NORM),               C00221**2
               COLOR=BLUE                                               00222   
ASKDS05 DFHMDF POS=(09,15),LENGTH=14,ATTRB=(ASKIP,NORM),               C00223**2
               COLOR=BLUE                                               00224   
ACRTL05 DFHMDF POS=(09,30),LENGTH=08,ATTRB=(ASKIP,NORM),               C00225**2
               COLOR=BLUE                                               00226   
ASCRL05 DFHMDF POS=(09,39),LENGTH=41,ATTRB=(ASKIP,NORM),               C00131**2
               COLOR=BLUE                                               00132   
*                                                                       00239   
ASEL06  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00240   
               HILIGHT=UNDERLINE,                                      C00241   
               COLOR=GREEN                                              00242   
ACL06   DFHMDF POS=(10,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00243**2
               COLOR=BLUE                                               00244   
ASKU06  DFHMDF POS=(10,06),LENGTH=08,ATTRB=(ASKIP,NORM),               C00245**2
               COLOR=BLUE                                               00246   
ASKDS06 DFHMDF POS=(10,15),LENGTH=14,ATTRB=(ASKIP,NORM),               C00247**2
               COLOR=BLUE                                               00248   
ACRTL06 DFHMDF POS=(10,30),LENGTH=08,ATTRB=(ASKIP,NORM),               C00249**2
               COLOR=BLUE                                               00250   
ASCRL06 DFHMDF POS=(10,39),LENGTH=41,ATTRB=(ASKIP,NORM),               C00131**2
               COLOR=BLUE                                               00132   
*                                                                       00263   
ASEL07  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00264   
               HILIGHT=UNDERLINE,                                      C00265   
               COLOR=GREEN                                              00266   
ACL07   DFHMDF POS=(11,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00267**2
               COLOR=BLUE                                               00268   
ASKU07  DFHMDF POS=(11,06),LENGTH=08,ATTRB=(ASKIP,NORM),               C00269**2
               COLOR=BLUE                                               00270   
ASKDS07 DFHMDF POS=(11,15),LENGTH=14,ATTRB=(ASKIP,NORM),               C00271**2
               COLOR=BLUE                                               00272   
ACRTL07 DFHMDF POS=(11,30),LENGTH=08,ATTRB=(ASKIP,NORM),               C00273**2
               COLOR=BLUE                                               00274   
ASCRL07 DFHMDF POS=(11,39),LENGTH=41,ATTRB=(ASKIP,NORM),               C00131**2
               COLOR=BLUE                                               00132   
*                                                                       00287   
ASEL08  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00288   
               HILIGHT=UNDERLINE,                                      C00289   
               COLOR=GREEN                                              00290   
ACL08   DFHMDF POS=(12,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00291**2
               COLOR=BLUE                                               00292   
ASKU08  DFHMDF POS=(12,06),LENGTH=08,ATTRB=(ASKIP,NORM),               C00293**2
               COLOR=BLUE                                               00294   
ASKDS08 DFHMDF POS=(12,15),LENGTH=14,ATTRB=(ASKIP,NORM),               C00295**2
               COLOR=BLUE                                               00296   
ACRTL08 DFHMDF POS=(12,30),LENGTH=08,ATTRB=(ASKIP,NORM),               C00297**2
               COLOR=BLUE                                               00298   
ASCRL08 DFHMDF POS=(12,39),LENGTH=41,ATTRB=(ASKIP,NORM),               C00131**2
               COLOR=BLUE                                               00132   
*                                                                       00311   
ASEL09  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00312   
               HILIGHT=UNDERLINE,                                      C00313   
               COLOR=GREEN                                              00314   
ACL09   DFHMDF POS=(13,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00315**2
               COLOR=BLUE                                               00316   
ASKU09  DFHMDF POS=(13,06),LENGTH=08,ATTRB=(ASKIP,NORM),               C00317**2
               COLOR=BLUE                                               00318   
ASKDS09 DFHMDF POS=(13,15),LENGTH=14,ATTRB=(ASKIP,NORM),               C00319**2
               COLOR=BLUE                                               00320   
ACRTL09 DFHMDF POS=(13,30),LENGTH=08,ATTRB=(ASKIP,NORM),               C00321**2
               COLOR=BLUE                                               00322   
ASCRL09 DFHMDF POS=(13,39),LENGTH=41,ATTRB=(ASKIP,NORM),               C00131**2
               COLOR=BLUE                                               00132   
*                                                                       00335   
ASEL10  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00336   
               HILIGHT=UNDERLINE,                                      C00337   
               COLOR=GREEN                                              00338   
ACL10   DFHMDF POS=(14,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00339**2
               COLOR=BLUE                                               00340   
ASKU10  DFHMDF POS=(14,06),LENGTH=08,ATTRB=(ASKIP,NORM),               C00341**2
               COLOR=BLUE                                               00342   
ASKDS10 DFHMDF POS=(14,15),LENGTH=14,ATTRB=(ASKIP,NORM),               C00343**2
               COLOR=BLUE                                               00344   
ACRTL10 DFHMDF POS=(14,30),LENGTH=08,ATTRB=(ASKIP,NORM),               C00345**2
               COLOR=BLUE                                               00346   
ASCRL10 DFHMDF POS=(14,39),LENGTH=41,ATTRB=(ASKIP,NORM),               C00131**2
               COLOR=BLUE                                               00132   
*                                                                       00359   
ASEL11  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00360   
               HILIGHT=UNDERLINE,                                      C00361   
               COLOR=GREEN                                              00362   
ACL11   DFHMDF POS=(15,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00363**2
               COLOR=BLUE                                               00364   
ASKU11  DFHMDF POS=(15,06),LENGTH=08,ATTRB=(ASKIP,NORM),               C00365**2
               COLOR=BLUE                                               00366   
ASKDS11 DFHMDF POS=(15,15),LENGTH=14,ATTRB=(ASKIP,NORM),               C00367**2
               COLOR=BLUE                                               00368   
ACRTL11 DFHMDF POS=(15,30),LENGTH=08,ATTRB=(ASKIP,NORM),               C00369**2
               COLOR=BLUE                                               00370   
ASCRL11 DFHMDF POS=(15,39),LENGTH=41,ATTRB=(ASKIP,NORM),               C00131**2
               COLOR=BLUE                                               00132   
*                                                                       00383   
ASEL12  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00384   
               HILIGHT=UNDERLINE,                                      C00385   
               COLOR=GREEN                                              00386   
ACL12   DFHMDF POS=(16,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00387**2
               COLOR=BLUE                                               00388   
ASKU12  DFHMDF POS=(16,06),LENGTH=08,ATTRB=(ASKIP,NORM),               C00389**2
               COLOR=BLUE                                               00390   
ASKDS12 DFHMDF POS=(16,15),LENGTH=14,ATTRB=(ASKIP,NORM),               C00391**2
               COLOR=BLUE                                               00392   
ACRTL12 DFHMDF POS=(16,30),LENGTH=08,ATTRB=(ASKIP,NORM),               C00393**2
               COLOR=BLUE                                               00394   
ASCRL12 DFHMDF POS=(16,39),LENGTH=41,ATTRB=(ASKIP,NORM),               C00131**2
               COLOR=BLUE                                               00132   
*                                                                       00407   
ASEL13  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00408   
               HILIGHT=UNDERLINE,                                      C00409   
               COLOR=GREEN                                              00410   
ACL13   DFHMDF POS=(17,03),LENGTH=02,ATTRB=(ASKIP,NORM),               C00411**2
               COLOR=BLUE                                               00412   
ASKU13  DFHMDF POS=(17,06),LENGTH=08,ATTRB=(ASKIP,NORM),               C00413**2
               COLOR=BLUE                                               00414   
ASKDS13 DFHMDF POS=(17,15),LENGTH=14,ATTRB=(ASKIP,NORM),               C00415**2
               COLOR=BLUE                                               00416   
ACRTL13 DFHMDF POS=(17,30),LENGTH=08,ATTRB=(ASKIP,NORM),               C00417**2
               COLOR=BLUE                                               00418   
ASCRL13 DFHMDF POS=(17,39),LENGTH=41,ATTRB=(ASKIP,NORM),               C00131**2
               COLOR=BLUE                                               00132   
*                                                                       00431   
        DFHMDF POS=(18,03),LENGTH=35,ATTRB=(ASKIP,NORM),               C        
               COLOR=YELLOW,INITIAL='TOTALS FOR SELECTION LIST--->'             
ATOTLIN DFHMDF POS=(18,39),LENGTH=41,ATTRB=(ASKIP,NORM),               C        
               COLOR=YELLOW                                                     
*                                                                               
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00456   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00457   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00458   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00459   
**************                                                          00460   
        DFHMSD TYPE=FINAL                                               00461   
**************                                                          00462   
        END                                                             00463   
