*          DATA SET FSKM060    AT LEVEL 001 AS OF 04/26/04                      
*********************************************************************** 00003   
*                                                                       00004   
*  FSKM060  MAPSET    THIS IS THE BMS MAP TO FORCE THE RECEIPT DATE     00005   
*                     IN TSKST TABLE.                                   00006   
*                                                                       00009   
*********************************************************************** 00010   
        PRINT  NOGEN                                                    00002   
FSKM060 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TERM=3270-2,                                            X00015   
               TIOAPFX=YES                                              00016   
FS060A  DFHMDI LINE=2,COLUMN=1,                                        X00017   
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*********************************************************************** 00016**1
*********************************************************************** 00054**1
*********************************************************************** 00032   
*                                                                       00033   
*  SCREEN LINE 08                                                       00034   
*                                                                       00035   
*********************************************************************** 00036   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00037   
               INITIAL='SKU :',                                        X00038   
               COLOR=NEUTRAL,                                          X00039**2
               LENGTH=5,                                               X00040   
               POS=(07,36)                                              00041   
ASKU    DFHMDF POS=(07,42),                                            X00042   
               LENGTH=8,                                               X00043   
               COLOR=GREEN,                                            X00044   
               HILIGHT=UNDERLINE,                                      X00046   
               ATTRB=(NUM,UNPROT,IC)                                    00047   
        DFHMDF POS=(7,51),LENGTH=1,ATTRB=ASKIP                          00025**4
*********************************************************************** 00062   
*                                                                       00063   
*  SCREEN LINE 10                                                       00064   
*                                                                       00065   
*********************************************************************** 00066   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00067   
               INITIAL='RECEIPT DATE :',                               X00068   
               COLOR=NEUTRAL,                                          X00069**2
               LENGTH=14,                                              X00070   
               POS=(09,27)                                              00071   
ARCPTDT  DFHMDF POS=(09,42),                                           X00072**6
               LENGTH=06,                                              X00073**2
               COLOR=BLUE,                                             X00074   
               ATTRB=(PROT)                                             00076   
         DFHMDF POS=(9,49),LENGTH=1,ATTRB=ASKIP                         00025**4
         DFHMSD TYPE=FINAL                                              00126   
         END                                                            00127   
