*          DATA SET FSKM032    AT LEVEL 007 AS OF 03/04/98                      
*          DATA SET FSKM032    AT LEVEL 006 AS OF 10/04/95                      
*          DATA SET FSKM032    AT LEVEL 005 AS OF 07/11/95                      
*          DATA SET FSKM032    AT LEVEL 004 AS OF 04/19/95                      
*          DATA SET FSKM032    AT LEVEL 003 AS OF 01/18/94                      
*          DATA SET FSKM032    AT LEVEL 002 AS OF 11/08/93                      
*          DATA SET FSKM032    AT LEVEL 001 AS OF 08/03/93                      
******************************************************************              
*       THIS IS THE MAPSET FOR THE SALES INQUIRY SELECTION                      
*  SCREEN OF THE FASHION SALES SYSTEM (FSKCS032 - F032)                         
***********************************************************************         
        PRINT NOGEN                                                             
FSKM032 DFHMSD TYPE=MAP,                                               X        
               MODE=INOUT,                                             X        
               LANG=COBOL,                                             X        
               TIOAPFX=YES                                                      
FS032A  DFHMDI SIZE=(19,80),                                           X        
               CTRL=(FREEKB,FRSET),                                    X        
               LINE=2,                                                 X        
               COLUMN=1,                                               X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*************************************************************                   
DEPTT   DFHMDF POS=(1,1),                                              X        
               LENGTH=4,                                               X        
               ATTRB=(ASKIP,BRT),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='DPT:'                                                   
DEPT    DFHMDF POS=(1,6),                                              X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
CLASST  DFHMDF POS=(1,10),                                             X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,BRT),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SC:'                                                    
CLASS   DFHMDF POS=(1,14),                                             X        
               LENGTH=2,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
SKUT    DFHMDF POS=(1,17),                                             X        
               LENGTH=8,                                               X        
               ATTRB=(ASKIP,BRT),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SKU/UPC:'                                               
SKU     DFHMDF POS=(1,26),                                             X        
               LENGTH=14,                                              X        
               ATTRB=(UNPROT,NORM,NUM,IC),                             X00029   
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
STORET  DFHMDF POS=(1,41),                                             X        
               LENGTH=4,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='STR:'                                                   
STORE   DFHMDF POS=(1,46),                                             X        
               LENGTH=5,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
STRDSC  DFHMDF POS=(1,52),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*************************************************************                   
        DFHMDF POS=(2,1),                                              X        
               LENGTH=6,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='DESCR:'                                                 
SKUDSC  DFHMDF POS=(2,8),                                              X        
               LENGTH=20,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
SIZET   DFHMDF POS=(2,29),                                             X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SZ:'                                                    
SIZE    DFHMDF POS=(2,33),                                             X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
COLORT  DFHMDF POS=(2,46),                                             X        
               LENGTH=4,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CLR:'                                                   
COLOR   DFHMDF POS=(2,51),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
CSTOCKC DFHMDF POS=(2,62),                                             X        
               LENGTH=5,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CSTK:'                                                  
CSTOCK  DFHMDF POS=(2,74),                                             X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
*************************************************************                   
ORRTLT  DFHMDF POS=(3,1),                                              X        
               LENGTH=8,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='ORG.RTL:'                                               
ORGRTL  DFHMDF POS=(3,10),                                             X        
               LENGTH=8,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
CRRTLT  DFHMDF POS=(3,19),                                             X        
               LENGTH=8,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CUR.RTL:'                                               
CURRTL  DFHMDF POS=(3,28),                                             X        
               LENGTH=8,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
GPRTL   DFHMDF POS=(3,37),                                             X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ORDRPTC DFHMDF POS=(3,50),                                             X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OP:'                                                    
ORDRPT  DFHMDF POS=(3,54),                                             X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZZ9'                                                 
COSTT   DFHMDF POS=(3,62),                                             X        
               LENGTH=5,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='COST:'                                                  
COST    DFHMDF POS=(3,71),                                             X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*************************************************************                   
STATT   DFHMDF POS=(4,29),                                             X        
               LENGTH=5,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='STAT:'                                                  
STAT1   DFHMDF POS=(4,35),                                             X        
               LENGTH=2,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
STAT2   DFHMDF POS=(4,38),                                             X        
               LENGTH=2,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
STAT3   DFHMDF POS=(4,41),                                             X        
               LENGTH=2,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
STAT4   DFHMDF POS=(4,44),                                             X        
               LENGTH=2,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
STAT5   DFHMDF POS=(4,47),                                             X        
               LENGTH=2,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
OUTLMTC DFHMDF POS=(4,50),                                             X        
               LENGTH=4,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OTL:'                                                   
OUTLMT  DFHMDF POS=(4,55),                                             X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZZ9'                                                 
ONORDT  DFHMDF POS=(4,64),                                             X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OO:'                                                    
ONORDR  DFHMDF POS=(4,69),                                             X        
               LENGTH=11,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*************************************************************                   
VENDRT  DFHMDF POS=(5,1),                                              X        
               LENGTH=5,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='VNDR:'                                                  
VNDRNO  DFHMDF POS=(5,7),                                              X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
VNDDSC  DFHMDF POS=(5,11),                                             X        
               LENGTH=15,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
STYLET  DFHMDF POS=(5,27),                                             X        
               LENGTH=6,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='STYLE:'                                                 
STYLE   DFHMDF POS=(5,34),                                             X        
               LENGTH=20,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
GROUPT  DFHMDF POS=(5,55),                                             X        
               LENGTH=4,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='GRP:'                                                   
GROUP   DFHMDF POS=(5,60),                                             X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*************************************************************                   
INTRAT  DFHMDF POS=(6,06),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='INTRANSIT:'                                             
INTRA   DFHMDF POS=(6,18),                                             X        
               LENGTH=9,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
RPLT    DFHMDF POS=(6,31),                                             X        
               LENGTH=4,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='RPL:'                                                   
RPL     DFHMDF POS=(6,36),                                             X        
               LENGTH=1,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
STROHT  DFHMDF POS=(6,38),                                             X        
               LENGTH=9,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='STORE OH:'                                              
STOREOH DFHMDF POS=(6,48),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ONHANDT DFHMDF POS=(6,59),                                             X        
               LENGTH=8,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CURR OH:'                                               
ONHAND  DFHMDF POS=(6,68),                                             X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*************************************************************                   
SUNT    DFHMDF POS=(7,5),                                              X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SUN'                                                    
MONT    DFHMDF POS=(7,16),                                             X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='MON'                                                    
TUET    DFHMDF POS=(7,27),                                             X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TUE'                                                    
WEDT    DFHMDF POS=(7,38),                                             X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='WED'                                                    
THUT    DFHMDF POS=(7,49),                                             X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='THU'                                                    
FRIT    DFHMDF POS=(7,60),                                             X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='FRI'                                                    
SATT    DFHMDF POS=(7,71),                                             X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SAT'                                                    
*************************************************************                   
SUNUNT  DFHMDF POS=(8,1),                                              X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
MONUNT  DFHMDF POS=(8,13),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
TUEUNT  DFHMDF POS=(8,24),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WEDUNT  DFHMDF POS=(8,35),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
THUUNT  DFHMDF POS=(8,46),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
FRIUNT  DFHMDF POS=(8,57),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
SATUNT  DFHMDF POS=(8,68),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*************************************************************                   
SUNUNTP DFHMDF POS=(9,1),                                              X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
MONUNTP DFHMDF POS=(9,13),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
TUEUNTP DFHMDF POS=(9,24),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WEDUNTP DFHMDF POS=(9,35),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
THUUNTP DFHMDF POS=(9,46),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
FRIUNTP DFHMDF POS=(9,57),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
SATUNTP DFHMDF POS=(9,68),                                             X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*************************************************************                   
WKLYT   DFHMDF POS=(10,1),                                             X        
               LENGTH=13,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='WEEKLY UNITS:'                                          
        DFHMDF POS=(10,17),                                            X        
               LENGTH=5,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TOTAL'                                                  
        DFHMDF POS=(10,28),                                            X        
               LENGTH=7,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='REGULAR'                                                
        DFHMDF POS=(10,37),                                            X        
               LENGTH=11,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='PROMOTIONAL'                                            
        DFHMDF POS=(10,52),                                            X        
               LENGTH=9,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CLEARANCE'                                              
        DFHMDF POS=(10,68),                                            X        
               LENGTH=6,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='  BOH '                                                 
*************************************************************                   
WKDAT1  DFHMDF POS=(11,1),                                             X        
               LENGTH=8,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='  WTD   '                                               
WKTOT1  DFHMDF POS=(11,11),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKREG1  DFHMDF POS=(11,24),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKPRO1  DFHMDF POS=(11,37),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKCLE1  DFHMDF POS=(11,50),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKONH1  DFHMDF POS=(11,63),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*************************************************************                   
WKDAT2  DFHMDF POS=(12,1),                                             X        
               LENGTH=8,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKTOT2  DFHMDF POS=(12,11),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKREG2  DFHMDF POS=(12,24),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKPRO2  DFHMDF POS=(12,37),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKCLE2  DFHMDF POS=(12,50),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKONH2  DFHMDF POS=(12,63),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*************************************************************                   
WKDAT3  DFHMDF POS=(13,1),                                             X        
               LENGTH=8,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKTOT3  DFHMDF POS=(13,11),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKREG3  DFHMDF POS=(13,24),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKPRO3  DFHMDF POS=(13,37),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKCLE3  DFHMDF POS=(13,50),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKONH3  DFHMDF POS=(13,63),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*************************************************************                   
WKDAT4  DFHMDF POS=(14,1),                                             X        
               LENGTH=8,                                               X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKTOT4  DFHMDF POS=(14,11),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKREG4  DFHMDF POS=(14,24),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKPRO4  DFHMDF POS=(14,37),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKCLE4  DFHMDF POS=(14,50),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
WKONH4  DFHMDF POS=(14,63),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*************************************************************                   
*************************************************************                   
        DFHMSD TYPE=FINAL                                                       
        PRINT NOGEN                                                             
        END                                                                     
