*          DATA SET FSKM034    AT LEVEL 001 AS OF 04/17/95                      
*          DATA SET FSKM034    AT LEVEL 005 AS OF 07/29/93              00001   
*  THIS IS THE MAPSET FOR THE SALES INQUIRY SELECTION                   00002   
*  SCREEN OF THE FASHION SALES SYSTEM (FSKCS034 - F034)                 00003   
*                                                                       00004   
*********************************************************************** 00005   
*   MODIFIED TO INCORPORATE API ARCHITECTURE - MJB 8/93                 00006   
*                                                                       00006   
*   09/03/2004                                                          00006   
*     CHANGE MADE: FALL PERFORMANCE TUNING.  REMOVED DISPLAY OF         00007   
*     DISTRICT ON THE MAP TO SUPPORT CHANGE IN TDISTSM TABLE NOT HAVING 00007   
*     DISTRICT DATA.                                                    00007   
*     MADE BY: M JOHNSON                     WR/IR #: WR27494           00007   
*                                                                       00006   
*   01/07/2005                                                          00006   
*     CHANGE MADE: CHANGED STORE NUMBER TO 5 DIGITS. ADD UPC AS AN      00007   
*     ENTERABLE FIELD. REMOVED THE FROM MONTH AND TO MONTH FIEDS.       00007   
*     PART OF STORE NUMBER EXPANSION                                    00007   
*     MADE BY: ANNE KINTOPF                  WR/IR #: WR26354           00007   
*                                                                       00007   
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00008   
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00009   
*********************************************************************** 00010   
        PRINT NOGEN                                                     00011   
FSKM034 DFHMSD TYPE=MAP,                                               X00012   
               MODE=INOUT,                                             X00013   
               LANG=COBOL,                                             X00014   
               TIOAPFX=YES                                              00015   
FS034A  DFHMDI SIZE=(19,80),                                           X00016   
               CTRL=(FREEKB,FRSET),                                    X00017   
               LINE=2,                                                 X00018   
               COLUMN=1,                                               X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                               
        DFHMDF POS=(2,10),                                             X00022   
               LENGTH=04,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='DPT:'                                           00026   
DEPT    DFHMDF POS=(2,15),                                             X00027   
               LENGTH=3,                                               X00028   
               ATTRB=(UNPROT,NORM,NUM,IC),                             X00029   
               HILIGHT=UNDERLINE,                                      X00030   
               COLOR=GREEN                                              00031   
        DFHMDF POS=(2,19),LENGTH=1,ATTRB=ASKIP                          00071   
DPTDSC  DFHMDF POS=(2,26),                                             X00032   
               LENGTH=20,                                              X00033   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(2,47),LENGTH=1,ATTRB=ASKIP                          00071   
***********************************************************************         
        DFHMDF POS=(3,01),LENGTH=1,ATTRB=ASKIP                          00071   
        DFHMDF POS=(3,11),                                             X00036   
               LENGTH=3,                                               X00037   
               ATTRB=(ASKIP,BRT),                                      X00038   
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='SC:'                                                    
CLASS   DFHMDF POS=(3,15),                                             X00041   
               LENGTH=2,                                               X00042   
               ATTRB=(UNPROT,NORM),                                    X00043   
               HILIGHT=UNDERLINE,                                      X00044   
               COLOR=GREEN                                              00045   
        DFHMDF POS=(3,18),LENGTH=1,ATTRB=ASKIP                          00071   
CLSDSC  DFHMDF POS=(3,26),                                             X00032   
               LENGTH=20,                                              X00033   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(3,47),LENGTH=1,ATTRB=ASKIP                          00071   
*********************************************************************           
        DFHMDF POS=(4,01),LENGTH=1,ATTRB=ASKIP                          00071   
        DFHMDF POS=(4,10),                                             X00047   
               LENGTH=4,                                               X00048   
               ATTRB=(ASKIP,BRT),                                      X00049   
               COLOR=NEUTRAL,                                          X00050   
               INITIAL='SKU:'                                           00051   
SKU     DFHMDF POS=(4,15),                                             X00052   
               LENGTH=8,                                               X00053   
               ATTRB=(UNPROT,NORM,NUM,IC),                             X00029   
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(4,24),LENGTH=1,ATTRB=ASKIP                          00071   
SKUDSC  DFHMDF POS=(4,26),                                             X00057   
               LENGTH=20,                                              X00058   
               ATTRB=(ASKIP,NORM),                                     X00059   
               COLOR=BLUE                                               00060   
        DFHMDF POS=(4,47),LENGTH=1,ATTRB=ASKIP                          00071   
*********************************************************************           
        DFHMDF POS=(5,01),LENGTH=1,ATTRB=ASKIP                          00071   
        DFHMDF POS=(5,10),                                             X00047   
               LENGTH=4,                                               X00048   
               ATTRB=(ASKIP,BRT),                                      X00049   
               COLOR=NEUTRAL,                                          X00050   
               INITIAL='UPC:'                                           00051   
UPC     DFHMDF POS=(5,15),                                             X00052   
               LENGTH=14,                                              X00053   
               ATTRB=(UNPROT,NORM,NUM,IC),                             X00029   
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(5,30),LENGTH=1,ATTRB=ASKIP                          00071   
UPCDSC  DFHMDF POS=(5,32),                                             X00057   
               LENGTH=20,                                              X00058   
               ATTRB=(ASKIP,NORM),                                     X00059   
               COLOR=BLUE                                               00060   
        DFHMDF POS=(5,53),LENGTH=1,ATTRB=ASKIP                          00071   
*********************************************************************           
        DFHMDF POS=(6,01),LENGTH=1,ATTRB=ASKIP                          00071   
        DFHMDF POS=(6,3),                                              X00061   
               LENGTH=11,                                              X00062   
               ATTRB=(ASKIP,BRT),                                      X00063   
               COLOR=NEUTRAL,                                          X00064   
               INITIAL='GROUP CODE:'                                    00065   
GROUP   DFHMDF POS=(6,15),                                             X00066   
               LENGTH=3,                                               X00067   
               ATTRB=(UNPROT,NORM),                                    X00068   
               HILIGHT=UNDERLINE,                                      X00069   
               COLOR=GREEN                                              00070   
        DFHMDF POS=(6,19),LENGTH=1,ATTRB=ASKIP                          00071   
*********************************************************************           
        DFHMDF POS=(7,01),LENGTH=1,ATTRB=ASKIP                          00071   
*********************************************************************           
        DFHMDF POS=(8,01),LENGTH=1,ATTRB=ASKIP                          00071   
        DFHMDF POS=(8,05),                                             X00072   
               LENGTH=09,                                              X00073   
               ATTRB=(ASKIP,BRT),                                      X00074   
               COLOR=NEUTRAL,                                          X00075   
               INITIAL='VENDOR #:'                                      00076   
VENNO   DFHMDF POS=(8,15),                                             X00077   
               LENGTH=3,                                               X00078   
               ATTRB=(UNPROT,NORM),                                    X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(8,19),LENGTH=1,ATTRB=ASKIP                          00071   
        DFHMDF POS=(08,53),                                            X00111   
               LENGTH=5,                                               X00112   
               ATTRB=(ASKIP,BRT),                                      X00113   
               COLOR=NEUTRAL,                                          X00114   
               INITIAL='SIZE:'                                          00115   
SIZE    DFHMDF POS=(08,59),                                            X00116   
               LENGTH=10,                                              X00117   
               ATTRB=(UNPROT,NORM),                                    X00118   
               HILIGHT=UNDERLINE,                                      X00119   
               COLOR=GREEN                                              00120   
        DFHMDF POS=(08,70),LENGTH=1,ATTRB=ASKIP                         00145   
********************************************************************            
        DFHMDF POS=(9,02),                                             X00072   
               LENGTH=12,                                              X00073   
               ATTRB=(ASKIP,BRT),                                      X00074   
               COLOR=NEUTRAL,                                          X00075   
               INITIAL='VENDOR NAME:'                                   00076   
VENNM   DFHMDF POS=(9,15),                                             X00082   
               LENGTH=30,                                              X00083   
               ATTRB=(UNPROT,NORM),                                    X00084   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00085   
        DFHMDF POS=(9,46),LENGTH=1,ATTRB=ASKIP                          00071   
        DFHMDF POS=(09,52),                                            X00111   
               LENGTH=06,                                              X00112   
               ATTRB=(ASKIP,BRT),                                      X00113   
               COLOR=NEUTRAL,                                          X00114   
               INITIAL='COLOR:'                                         00115   
COLDSC  DFHMDF POS=(09,59),                                            X00116   
               LENGTH=10,                                              X00117   
               ATTRB=(UNPROT,NORM),                                    X00118   
               HILIGHT=UNDERLINE,                                      X00119   
               COLOR=GREEN                                              00120   
        DFHMDF POS=(09,70),LENGTH=1,ATTRB=ASKIP                         00145   
********************************************************************            
        DFHMDF POS=(10,01),                                            X00086   
               LENGTH=13,                                              X00087   
               ATTRB=(ASKIP,BRT),                                      X00088   
               COLOR=NEUTRAL,                                          X00089   
               INITIAL='VENDOR STYLE:'                                  00090   
STYLE   DFHMDF POS=(10,15),                                            X00091   
               LENGTH=25,                                              X00092   
               ATTRB=(UNPROT,NORM),                                    X00093   
               HILIGHT=UNDERLINE,                                      X00094   
               COLOR=GREEN                                              00095   
        DFHMDF POS=(10,41),LENGTH=1,ATTRB=ASKIP                         00145   
        DFHMDF POS=(10,46),                                            X00111   
               LENGTH=12,                                              X00112   
               ATTRB=(ASKIP,BRT),                                      X00113   
               COLOR=NEUTRAL,                                          X00114   
               INITIAL='COLOR RANGE:'                                   00115   
COLOR1  DFHMDF POS=(10,59),                                            X00116   
               LENGTH=3,                                               X00117   
               ATTRB=(UNPROT,NORM),                                    X00118   
               HILIGHT=UNDERLINE,                                      X00119   
               COLOR=GREEN                                              00120   
        DFHMDF POS=(10,63),                                            X00111   
               LENGTH=1,                                               X00112   
               ATTRB=(ASKIP,BRT),                                      X00113   
               COLOR=NEUTRAL,                                          X00114   
               INITIAL='-'                                              00115   
COLOR2  DFHMDF POS=(10,65),                                            X00116   
               LENGTH=3,                                               X00117   
               ATTRB=(UNPROT,NORM),                                    X00118   
               HILIGHT=UNDERLINE,                                      X00119   
               COLOR=GREEN                                              00120   
COLORD  DFHMDF POS=(10,69),                                            X00116   
               LENGTH=10,                                              X00117   
               ATTRB=(ASKIP,NORM),                                     X00123   
               COLOR=BLUE                                               00124   
********************************************************************            
        DFHMDF POS=(11,01),LENGTH=1,ATTRB=ASKIP                         00071   
********************************************************************            
        DFHMDF POS=(12,01),LENGTH=1,ATTRB=ASKIP                         00096   
        DFHMDF POS=(12,49),                                            X00086   
               LENGTH=9,                                               X00087   
               ATTRB=(ASKIP,BRT),                                      X00088   
               COLOR=NEUTRAL,                                          X00089   
               INITIAL='KEY ITEM:'                                      00090   
KYITM   DFHMDF POS=(12,59),                                            X00091   
               LENGTH=1,                                               X00092   
               ATTRB=(UNPROT,NORM),                                    X00093   
               HILIGHT=UNDERLINE,                                      X00094   
               COLOR=GREEN                                              00095   
        DFHMDF POS=(12,61),LENGTH=1,ATTRB=ASKIP                         00096   
*********************************************************************           
        DFHMDF POS=(13,01),LENGTH=1,ATTRB=ASKIP                         00096   
        DFHMDF POS=(13,48),                                            X00086   
               LENGTH=10,                                              X00087   
               ATTRB=(ASKIP,BRT),                                      X00088   
               COLOR=NEUTRAL,                                          X00089   
               INITIAL='REPLENISH:'                                     00090   
REPLEN  DFHMDF POS=(13,59),                                            X00091   
               LENGTH=1,                                               X00092   
               ATTRB=(UNPROT,NORM),                                    X00093   
               HILIGHT=UNDERLINE,                                      X00094   
               COLOR=GREEN                                              00095   
        DFHMDF POS=(13,61),LENGTH=1,ATTRB=ASKIP                         00096   
********************************************************************            
        DFHMDF POS=(14,08),                                            X00111   
               LENGTH=6,                                               X00112   
               ATTRB=(ASKIP,BRT),                                      X00113   
               COLOR=NEUTRAL,                                          X00114   
               INITIAL='STORE:'                                         00115   
STORE   DFHMDF POS=(14,15),                                            X00116   
               LENGTH=5,                                               X00117   
               ATTRB=(UNPROT,NORM),                                    X00118   
               HILIGHT=UNDERLINE,                                      X00119   
               COLOR=GREEN                                              00120   
STRDSC  DFHMDF POS=(14,21),                                            X00121   
               LENGTH=10,                                              X00122   
               ATTRB=(ASKIP,NORM),                                     X00123   
               COLOR=BLUE                                               00124   
        DFHMDF POS=(14,35),                                            X00111   
               LENGTH=9,                                               X00112   
               ATTRB=(ASKIP,DRK),                                      X00113   
               COLOR=NEUTRAL,                                          X00114   
               INITIAL='DISTRICT:'                                      00115   
DIST    DFHMDF POS=(14,45),                                            X00116   
               LENGTH=2,                                               X00117   
               ATTRB=(ASKIP,DRK),                                      X00118   
               HILIGHT=UNDERLINE,                                      X00119   
               COLOR=GREEN                                              00120   
        DFHMDF POS=(14,48),LENGTH=1,ATTRB=ASKIP                         00096   
*******************************************************************             
        DFHMDF POS=(16,3),                                             X00125   
               LENGTH=11,                                              X00126   
               ATTRB=(ASKIP,DRK),                                      X00127   
               COLOR=NEUTRAL,                                          X00128   
               INITIAL='FROM MONTH:'                                    00129   
MTHFR   DFHMDF POS=(16,16),                                            X00130   
               LENGTH=4,                                               X00131   
               ATTRB=(ASKIP,DRK),                                      X00132   
               HILIGHT=UNDERLINE,                                      X00133   
               COLOR=GREEN                                              00134   
        DFHMDF POS=(16,21),                                            X00135   
               LENGTH=9,                                               X00136   
               ATTRB=(ASKIP,DRK),                                      X00137   
               COLOR=NEUTRAL,                                          X00138   
               INITIAL='TO MONTH:'                                      00139   
MTHTO   DFHMDF POS=(16,31),                                            X00140   
               LENGTH=4,                                               X00141   
               ATTRB=(ASKIP,DRK),                                      X00142   
               HILIGHT=UNDERLINE,                                      X00143   
               COLOR=GREEN                                              00144   
        DFHMDF POS=(16,36),LENGTH=1,ATTRB=ASKIP                         00145   
********************************************************************            
        DFHMDF POS=(17,1),                                             X00146   
               LENGTH=13,                                              X00147   
               ATTRB=(ASKIP,BRT),                                      X00148   
               COLOR=NEUTRAL,                                          X00149   
               INITIAL='STATUS CODES:'                                  00150   
STATA   DFHMDF POS=(17,19),                                            X00151   
               LENGTH=1,                                               X00152   
               ATTRB=(UNPROT,NORM),                                    X00153   
               HILIGHT=UNDERLINE,                                      X00154   
               COLOR=GREEN                                              00155   
        DFHMDF POS=(17,21),                                            X00156   
               LENGTH=6,                                               X00157   
               ATTRB=(ASKIP,BRT),                                      X00158   
               COLOR=NEUTRAL,                                          X00159   
               INITIAL='10 NEW'                                         00160   
STATB   DFHMDF POS=(17,43),                                            X00161   
               LENGTH=1,                                               X00162   
               ATTRB=(UNPROT,NORM),                                    X00163   
               HILIGHT=UNDERLINE,                                      X00164   
               COLOR=GREEN                                              00165   
        DFHMDF POS=(17,45),                                            X00166   
               LENGTH=14,                                              X00167   
               ATTRB=(ASKIP,BRT),                                      X00168   
               COLOR=NEUTRAL,                                          X00169   
               INITIAL='40 PROMOTIONAL'                                 00170   
********************************************************************            
STATC   DFHMDF POS=(18,19),                                            X00171   
               LENGTH=1,                                               X00172   
               ATTRB=(UNPROT,NORM),                                    X00173   
               HILIGHT=UNDERLINE,                                      X00174   
               COLOR=GREEN                                              00175   
        DFHMDF POS=(18,21),                                            X00176   
               LENGTH=9,                                               X00177   
               ATTRB=(ASKIP,BRT),                                      X00178   
               COLOR=NEUTRAL,                                          X00179   
               INITIAL='20 ACTIVE'                                      00180   
STATD   DFHMDF POS=(18,43),                                            X00181   
               LENGTH=1,                                               X00182   
               ATTRB=(UNPROT,NORM),                                    X00183   
               HILIGHT=UNDERLINE,                                      X00184   
               COLOR=GREEN                                              00185   
        DFHMDF POS=(18,45),                                            X00186   
               LENGTH=15,                                              X00187   
               ATTRB=(ASKIP,BRT),                                      X00188   
               COLOR=NEUTRAL,                                          X00189   
               INITIAL='90 DISCONTINUED'                                00190   
*******************************************************************             
STATE   DFHMDF POS=(19,19),                                            X00191   
               LENGTH=1,                                               X00192   
               ATTRB=(UNPROT,NORM),                                    X00193   
               HILIGHT=UNDERLINE,                                      X00194   
               COLOR=GREEN                                              00195   
        DFHMDF POS=(19,21),                                            X00196   
               LENGTH=12,                                              X00197   
               ATTRB=(ASKIP,BRT),                                      X00198   
               COLOR=NEUTRAL,                                          X00199   
               INITIAL='30 CLEARANCE'                                   00200   
*******************************************************************             
STATF   DFHMDF POS=(19,43),                                            X00191   
               LENGTH=1,                                               X00192   
               ATTRB=(UNPROT,NORM),                                    X00193   
               HILIGHT=UNDERLINE,                                      X00194   
               COLOR=GREEN                                              00195   
        DFHMDF POS=(19,45),                                            X00196   
               LENGTH=08,                                              X00197   
               ATTRB=(ASKIP,BRT),                                      X00198   
               COLOR=NEUTRAL,                                          X00199   
               INITIAL='25 MIXED'                                       00200   
*************************************************************           00201   
*  FSX34A IS A SEPERATE MAP TO BE DISPLAYED WHEN AN F901 IS *           00202   
*  BEING INVOKED.                                           *           00203   
*************************************************************           00204   
FSX34A  DFHMDI LINE=1,                                                 C00205   
               COLUMN=1,                                               C00206   
               SIZE=(24,80),                                           C00207   
               MAPATTS=(COLOR,HILIGHT),                                C00208   
               DSATTS=(COLOR,HILIGHT)                                   00209   
WAITMSG DFHMDF POS=(14,17),                                            C00210   
               LENGTH=45,                                              C00211   
               COLOR=YELLOW,                                           C00212   
               HILIGHT=BLINK,                                          C00213   
               ATTRB=(PROT,BRT),                                       C00214   
               INITIAL='YOUR REQUEST IS BEING PROCESSED - PLEASE WAIT'  00215   
        DFHMDF POS=(14,63),                                            C00216   
               LENGTH=01,                                              C00217   
               ATTRB=ASKIP                                              00218   
*************************************************************           00219   
        DFHMSD TYPE=FINAL                                               00220   
        PRINT NOGEN                                                     00221   
        END                                                             00222   
