******************************************************************      00005   
*                                                                       00006   
*   INCORPORATES API ARCHITECTURE - NEW 2/6/97                          00007   
*                                                                       00008   
*   FSKM058                                                             00008   
*   COPY OF FSKM057 (REMOVED STORE PHONE #, ADDED 4 WEEK SALES)         00008   
*                   (ALSO ADDED A TOTAL LINE AND NA/CS/DC/STORES)       00008   
*                                                                       00008   
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00009   
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00010   
******************************************************************      00011   
        PRINT  NOGEN                                                    00012   
FSKM058 DFHMSD TYPE=DSECT,                                             C00013   
               LANG=COBOL,                                             C00014   
               MODE=INOUT,                                             C00015   
               STORAGE=AUTO,                                           C00016   
               TERM=3270-2,                                            C00017   
               TIOAPFX=YES                                              00018   
**************                                                          00019   
FS058A  DFHMDI LINE=2,COLUMN=1,                                        C00020   
               SIZE=(19,80),                                           C00021   
               CTRL=(FREEKB),                                          C00022   
               MAPATTS=(COLOR,HILIGHT),                                C00023   
               DSATTS=(COLOR,HILIGHT)                                   00024   
**************                                                          00025   
        DFHMDF POS=(01,02),LENGTH=04,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=NEUTRAL,INITIAL='DPT:'                             00027   
ADEPT   DFHMDF POS=(01,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C00048   
               COLOR=BLUE                                               00049   
        DFHMDF POS=(01,11),LENGTH=04,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=NEUTRAL,INITIAL='SC:'                              00027   
ACLASS  DFHMDF POS=(01,16),LENGTH=02,ATTRB=(ASKIP,NORM),               C00050   
               COLOR=BLUE                                               00051   
ASTTYP  DFHMDF POS=(01,19),LENGTH=24,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
        DFHMDF POS=(01,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00027   
ASTRTIT DFHMDF POS=(01,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00028   
               COLOR=GREEN,                                            C00029   
               HILIGHT=UNDERLINE,                                      C00030   
               PICOUT='ZZZZ9'                                           00031   
        DFHMDF POS=(01,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00032   
               COLOR=NEUTRAL,                                          C00033   
               INITIAL='TO'                                             00034   
AENDIT  DFHMDF POS=(01,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00035   
               COLOR=BLUE,                                             C00036   
               PICOUT='ZZZZ9'                                           00037   
        DFHMDF POS=(01,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00038   
               COLOR=NEUTRAL,                                          C00039   
               INITIAL='OF'                                             00040   
ATOTIT  DFHMDF POS=(01,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00041   
               COLOR=BLUE,                                             C00042   
               PICOUT='ZZZZ9'                                           00043   
*                                                                       00044   
        DFHMDF POS=(02,02),LENGTH=04,ATTRB=(PROT,NORM),                C00045   
               COLOR=NEUTRAL,                                          C00046   
               INITIAL='SKU:'                                           00047   
ASKU    DFHMDF POS=(02,07),LENGTH=08,ATTRB=(ASKIP,NORM),               C00052   
               COLOR=BLUE                                               00053   
ASKUDSC DFHMDF POS=(02,17),LENGTH=25,ATTRB=(ASKIP,NORM),               C00054   
               COLOR=BLUE                                               00055   
        DFHMDF POS=(02,55),LENGTH=05,ATTRB=(PROT,NORM),                C00056   
               COLOR=NEUTRAL,                                          C00057   
               INITIAL='VNDR:'                                          00058   
AVNDR   DFHMDF POS=(02,61),LENGTH=03,ATTRB=(ASKIP,NORM),               C00059   
               COLOR=BLUE                                               00060   
AVNAM   DFHMDF POS=(02,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00059   
               COLOR=BLUE                                               00060   
*                                                                       00061   
        DFHMDF POS=(03,02),LENGTH=04,ATTRB=(PROT,NORM),                C00062   
               COLOR=NEUTRAL,                                          C00063   
               INITIAL='RTL:'                                           00064   
ACURRTL DFHMDF POS=(03,07),LENGTH=08,ATTRB=(ASKIP,NORM),               C00065   
               COLOR=BLUE                                               00066   
        DFHMDF POS=(03,17),LENGTH=07,ATTRB=(PROT,NORM),                C00067   
               COLOR=NEUTRAL,                                          C00068   
               INITIAL='STATUS:'                                        00069   
ASTAT1  DFHMDF POS=(03,25),LENGTH=03,ATTRB=(ASKIP,NORM),               C00070   
               COLOR=BLUE                                               00071   
ASTAT2  DFHMDF POS=(03,29),LENGTH=03,ATTRB=(ASKIP,NORM),               C00070   
               COLOR=BLUE                                               00071   
ASTAT3  DFHMDF POS=(03,33),LENGTH=03,ATTRB=(ASKIP,NORM),               C00070   
               COLOR=BLUE                                               00071   
ASTAT4  DFHMDF POS=(03,37),LENGTH=03,ATTRB=(ASKIP,NORM),               C00070   
               COLOR=BLUE                                               00071   
ASTAT5  DFHMDF POS=(03,41),LENGTH=03,ATTRB=(ASKIP,NORM),               C00070   
               COLOR=BLUE                                               00071   
        DFHMDF POS=(03,54),LENGTH=06,ATTRB=(PROT,NORM),                C00072   
               COLOR=NEUTRAL,                                          C00073   
               INITIAL='STYLE:'                                         00074   
AVSTY   DFHMDF POS=(03,61),LENGTH=19,ATTRB=(ASKIP,NORM),               C00075   
               COLOR=BLUE                                               00076   
*                                                                       00077   
ACOSTH  DFHMDF POS=(04,01),LENGTH=05,ATTRB=(PROT,NORM),                C00078   
               COLOR=NEUTRAL,                                          C00079   
               INITIAL='COST:'                                          00080   
ACOST   DFHMDF POS=(04,08),LENGTH=08,ATTRB=(ASKIP,NORM),               C00081   
               COLOR=BLUE                                               00082   
        DFHMDF POS=(04,18),LENGTH=06,ATTRB=(PROT,NORM),                C00083   
               COLOR=NEUTRAL,                                          C00084   
               INITIAL='COLOR:'                                         00085   
ACOLOR  DFHMDF POS=(04,25),LENGTH=20,ATTRB=(ASKIP,NORM),               C00086   
               COLOR=BLUE                                               00087   
        DFHMDF POS=(04,47),LENGTH=04,ATTRB=(PROT,NORM),                C00072   
               COLOR=NEUTRAL,                                          C00073   
               INITIAL='RPL:'                                           00074   
ARPL    DFHMDF POS=(04,52),LENGTH=01,ATTRB=(ASKIP,NORM),               C00075   
               COLOR=BLUE                                               00076   
        DFHMDF POS=(04,55),LENGTH=05,ATTRB=(PROT,NORM),                C00088   
               COLOR=NEUTRAL,                                          C00089   
               INITIAL='SIZE:'                                          00090   
ASIZE   DFHMDF POS=(04,61),LENGTH=18,ATTRB=(ASKIP,NORM),               C00091   
               COLOR=BLUE                                               00092   
*                                                                       00093   
        DFHMDF POS=(05,01),LENGTH=15,ATTRB=(PROT,NORM),                C00094   
               COLOR=NEUTRAL,                                          C00095   
               INITIAL='-- S T O R E --'                                00096   
        DFHMDF POS=(05,20),LENGTH=05,ATTRB=(PROT,NORM),                C00097**4
               COLOR=NEUTRAL,                                          C00098   
               INITIAL='CURR '                                          00099   
        DFHMDF POS=(05,28),LENGTH=08,ATTRB=(PROT,NORM),                C00100**5
               COLOR=NEUTRAL,                                          C00101   
               INITIAL=' CURR WK'                                       00102   
        DFHMDF POS=(05,39),LENGTH=06,ATTRB=(PROT,NORM),                C00103**4
               COLOR=NEUTRAL,                                          C00104   
               INITIAL='LST WK'                                         00105   
        DFHMDF POS=(05,51),LENGTH=05,ATTRB=(PROT,NORM),                C00106**5
               COLOR=NEUTRAL,                                          C00107   
               INITIAL='IN-  '                                          00108   
        DFHMDF POS=(05,61),LENGTH=02,ATTRB=(PROT,NORM),                C00109**4
               COLOR=NEUTRAL,                                          C00110   
               INITIAL='ON'                                             00111   
        DFHMDF POS=(05,70),LENGTH=05,ATTRB=(PROT,NORM),                C00112**4
               COLOR=NEUTRAL,                                          C00113   
               INITIAL='STORE'                                          00114   
*                                                                       00115   
        DFHMDF POS=(06,01),LENGTH=14,ATTRB=(PROT,NORM),                C00116   
               COLOR=NEUTRAL,                                          C00117   
               INITIAL='NBR   NAME   '                                  00118   
        DFHMDF POS=(06,19),LENGTH=06,ATTRB=(PROT,NORM),                C00119   
               COLOR=NEUTRAL,                                          C00120   
               INITIAL='ONHAND'                                         00121   
ADOL1   DFHMDF POS=(06,27),LENGTH=01,ATTRB=(PROT,NORM),                C00122   
               COLOR=TURQUOISE,INITIAL='$'                              00123   
        DFHMDF POS=(06,30),LENGTH=05,ATTRB=(PROT,NORM),                C00124**4
               COLOR=NEUTRAL,                                          C00125   
               INITIAL='SALES'                                          00126   
ADOL2   DFHMDF POS=(06,37),LENGTH=01,ATTRB=(PROT,NORM),                C00127**4
               COLOR=TURQUOISE,INITIAL='$'                              00128   
        DFHMDF POS=(06,40),LENGTH=05,ATTRB=(PROT,NORM),                C00129**3
               COLOR=NEUTRAL,                                          C00130   
               INITIAL='SALES'                                          00131   
ADOL4   DFHMDF POS=(06,47),LENGTH=01,ATTRB=(PROT,NORM),                C00137**5
               COLOR=TURQUOISE,INITIAL='$'                              00138   
        DFHMDF POS=(06,49),LENGTH=05,ATTRB=(PROT,NORM),                C00134**5
               COLOR=NEUTRAL,                                          C00135   
               INITIAL='TRNST'                                          00136   
ADOL5   DFHMDF POS=(06,58),LENGTH=01,ATTRB=(PROT,NORM),                C00137**5
               COLOR=TURQUOISE,INITIAL='$'                              00138   
        DFHMDF POS=(06,60),LENGTH=05,ATTRB=(PROT,NORM),                C00139**4
               COLOR=NEUTRAL,                                          C00140   
               INITIAL='ORDER'                                          00141   
ADOL6   DFHMDF POS=(06,68),LENGTH=01,ATTRB=(PROT,NORM),                C00137**5
               COLOR=TURQUOISE,INITIAL='$'                              00138   
        DFHMDF POS=(06,70),LENGTH=06,ATTRB=(PROT,NORM),                C00142**4
               COLOR=NEUTRAL,                                          C00143   
               INITIAL='ONHAND'                                         00144   
        DFHMDF POS=(06,78),LENGTH=02,ATTRB=(PROT,NORM),                C00145**3
               COLOR=NEUTRAL,                                          C00146**3
               INITIAL='DC'                                             00147**3
****************************************************************        00148   
ASTR01  DFHMDF POS=(07,01),LENGTH=05,ATTRB=(ASKIP,NORM),               C00149   
               COLOR=BLUE                                               00150   
ASTNM01 DFHMDF POS=(07,07),LENGTH=10,ATTRB=(ASKIP,NORM),               C00151   
               COLOR=BLUE                                               00152   
ADETL01 DFHMDF POS=(07,18),LENGTH=59,ATTRB=(ASKIP,NORM),               C00155   
               COLOR=BLUE                                               00156   
ADC01   DFHMDF POS=(07,78),LENGTH=02,ATTRB=(ASKIP,NORM),               C00167   
               COLOR=BLUE                                               00168   
****************************************************************        00169   
ASTR02  DFHMDF POS=(08,01),LENGTH=05,ATTRB=(ASKIP,NORM),               C00170   
               COLOR=BLUE                                               00171   
ASTNM02 DFHMDF POS=(08,07),LENGTH=10,ATTRB=(ASKIP,NORM),               C00172   
               COLOR=BLUE                                               00173   
ADETL02 DFHMDF POS=(08,18),LENGTH=59,ATTRB=(ASKIP,NORM),               C00176   
               COLOR=BLUE                                               00177   
ADC02   DFHMDF POS=(08,78),LENGTH=02,ATTRB=(ASKIP,NORM),               C00188**2
               COLOR=BLUE                                               00189**2
****************************************************************        00190   
ASTR03  DFHMDF POS=(09,01),LENGTH=05,ATTRB=(ASKIP,NORM),               C00191   
               COLOR=BLUE                                               00192   
ASTNM03 DFHMDF POS=(09,07),LENGTH=10,ATTRB=(ASKIP,NORM),               C00193   
               COLOR=BLUE                                               00194   
ADETL03 DFHMDF POS=(09,18),LENGTH=59,ATTRB=(ASKIP,NORM),               C00197   
               COLOR=BLUE                                               00198   
ADC03   DFHMDF POS=(09,78),LENGTH=02,ATTRB=(ASKIP,NORM),               C00209**2
               COLOR=BLUE                                               00210**2
****************************************************************        00211   
ASTR04  DFHMDF POS=(10,01),LENGTH=05,ATTRB=(ASKIP,NORM),               C00212   
               COLOR=BLUE                                               00213   
ASTNM04 DFHMDF POS=(10,07),LENGTH=10,ATTRB=(ASKIP,NORM),               C00214   
               COLOR=BLUE                                               00215   
ADETL04 DFHMDF POS=(10,18),LENGTH=59,ATTRB=(ASKIP,NORM),               C00218   
               COLOR=BLUE                                               00219   
ADC04   DFHMDF POS=(10,78),LENGTH=02,ATTRB=(ASKIP,NORM),               C00230**2
               COLOR=BLUE                                               00231**2
****************************************************************        00233   
ASTR05  DFHMDF POS=(11,01),LENGTH=05,ATTRB=(ASKIP,NORM),               C00234   
               COLOR=BLUE                                               00235   
ASTNM05 DFHMDF POS=(11,07),LENGTH=10,ATTRB=(ASKIP,NORM),               C00236   
               COLOR=BLUE                                               00237   
ADETL05 DFHMDF POS=(11,18),LENGTH=59,ATTRB=(ASKIP,NORM),               C00240   
               COLOR=BLUE                                               00241   
ADC05   DFHMDF POS=(11,78),LENGTH=02,ATTRB=(ASKIP,NORM),               C00252**2
               COLOR=BLUE                                               00253**2
****************************************************************        00254   
ASTR06  DFHMDF POS=(12,01),LENGTH=05,ATTRB=(ASKIP,NORM),               C00255   
               COLOR=BLUE                                               00256   
ASTNM06 DFHMDF POS=(12,07),LENGTH=10,ATTRB=(ASKIP,NORM),               C00257   
               COLOR=BLUE                                               00258   
ADETL06 DFHMDF POS=(12,18),LENGTH=59,ATTRB=(ASKIP,NORM),               C00259   
               COLOR=BLUE                                               00262   
ADC06   DFHMDF POS=(12,78),LENGTH=02,ATTRB=(ASKIP,NORM),               C00273**2
               COLOR=BLUE                                               00274**2
****************************************************************        00275   
ASTR07  DFHMDF POS=(13,01),LENGTH=05,ATTRB=(ASKIP,NORM),               C00276   
               COLOR=BLUE                                               00277   
ASTNM07 DFHMDF POS=(13,07),LENGTH=10,ATTRB=(ASKIP,NORM),               C00278   
               COLOR=BLUE                                               00279   
ADETL07 DFHMDF POS=(13,18),LENGTH=59,ATTRB=(ASKIP,NORM),               C00282   
               COLOR=BLUE                                               00283   
ADC07   DFHMDF POS=(13,78),LENGTH=02,ATTRB=(ASKIP,NORM),               C00294**2
               COLOR=BLUE                                               00295**2
****************************************************************        00296   
ASTR08  DFHMDF POS=(14,01),LENGTH=05,ATTRB=(ASKIP,NORM),               C00297   
               COLOR=BLUE                                               00298   
ASTNM08 DFHMDF POS=(14,07),LENGTH=10,ATTRB=(ASKIP,NORM),               C00299   
               COLOR=BLUE                                               00500   
ADETL08 DFHMDF POS=(14,18),LENGTH=59,ATTRB=(ASKIP,NORM),               C00303   
               COLOR=BLUE                                               00304   
ADC08   DFHMDF POS=(14,78),LENGTH=02,ATTRB=(ASKIP,NORM),               C00315**2
               COLOR=BLUE                                               00316**2
****************************************************************        00318   
ASTR09  DFHMDF POS=(15,01),LENGTH=05,ATTRB=(ASKIP,NORM),               C00319   
               COLOR=BLUE                                               00320   
ASTNM09 DFHMDF POS=(15,07),LENGTH=10,ATTRB=(ASKIP,NORM),               C00321   
               COLOR=BLUE                                               00322   
ADETL09 DFHMDF POS=(15,18),LENGTH=59,ATTRB=(ASKIP,NORM),               C00325   
               COLOR=BLUE                                               00326   
ADC09   DFHMDF POS=(15,78),LENGTH=02,ATTRB=(ASKIP,NORM),               C00337**2
               COLOR=BLUE                                               00338**2
****************************************************************        00340   
ASTR10  DFHMDF POS=(16,01),LENGTH=05,ATTRB=(ASKIP,NORM),               C00341   
               COLOR=BLUE                                               00342   
ASTNM10 DFHMDF POS=(16,07),LENGTH=10,ATTRB=(ASKIP,NORM),               C00343   
               COLOR=BLUE                                               00344   
ADETL10 DFHMDF POS=(16,18),LENGTH=59,ATTRB=(ASKIP,NORM),               C00347   
               COLOR=BLUE                                               00348   
ADC10   DFHMDF POS=(16,78),LENGTH=02,ATTRB=(ASKIP,NORM),               C00359**2
               COLOR=BLUE                                               00360**2
****************************************************************        00361   
ASTR11  DFHMDF POS=(17,01),LENGTH=05,ATTRB=(ASKIP,NORM),               C00362   
               COLOR=BLUE                                               00363   
ASTNM11 DFHMDF POS=(17,07),LENGTH=10,ATTRB=(ASKIP,NORM),               C00364   
               COLOR=BLUE                                               00365   
ADETL11 DFHMDF POS=(17,18),LENGTH=59,ATTRB=(ASKIP,NORM),               C00368   
               COLOR=BLUE                                               00369   
ADC11   DFHMDF POS=(17,78),LENGTH=02,ATTRB=(ASKIP,NORM),               C00380**2
               COLOR=BLUE                                               00381**2
****************************************************************        00382   
ASTR12  DFHMDF POS=(18,01),LENGTH=05,ATTRB=(ASKIP,NORM),               C00383   
               COLOR=BLUE                                               00384   
ASTNM12 DFHMDF POS=(18,07),LENGTH=10,ATTRB=(ASKIP,NORM),               C00385   
               COLOR=BLUE                                               00586   
ADETL12 DFHMDF POS=(18,18),LENGTH=59,ATTRB=(ASKIP,NORM),               C00389   
               COLOR=BLUE                                               00390   
ADC12   DFHMDF POS=(18,78),LENGTH=02,ATTRB=(ASKIP,NORM),               C00401**2
               COLOR=BLUE                                               00402**2
****************************************************************        00403   
        DFHMDF POS=(19,08),LENGTH=07,ATTRB=(PROT,NORM),                C00056   
               COLOR=YELLOW,                                           C00057   
               INITIAL='TOTALS:'                                        00058   
ATOTLIN DFHMDF POS=(19,18),LENGTH=59,ATTRB=(ASKIP,NORM),               C00410   
               COLOR=YELLOW                                             00057   
*                                                                       00424   
**************                                                          00425   
        DFHMSD TYPE=FINAL                                               00426   
**************                                                          00427   
        END                                                             00428   
