*          DATA SET FSKM059    AT LEVEL 004 AS OF 06/01/94                      
  PRINT  NOGEN                                                          00001   
*******************************************************************-*   00002   
*                                                                   *   00003   
*        MAPSET  FSKM059                                            *   00004   
*        MAP     FS059A                                             *   00005   
*        PROGRAM FSKCS059                                           *   00006   
*        TRANSID F059 - VENDOR ALPHA LIST                           *   00007   
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*******************************************************************-*   00010   
FSKM059  DFHMSD TYPE=MAP,                                              X00011   
               CTRL=(FREEKB),                                          X00012   
               LANG=COBOL,                                             X00013   
               MODE=INOUT,                                             X00014   
               TIOAPFX=YES                                              00015   
FS059A   DFHMDI SIZE=(19,080),                                         X00016   
               MAPATTS=(COLOR,HILIGHT),                                X00017   
               DSATTS=(COLOR,HILIGHT),                                 X00018   
               LINE=02,                                                X00019   
               COLUMN=01                                                00020   
         DFHMDF POS=(02,044),                                          X00021   
               COLOR=NEUTRAL,                                          X00022   
               ATTRB=(ASKIP,NORM),                                     X00023   
               LENGTH=005,                                             X00024   
               INITIAL='ITEMS'                                          00025   
ASTRTIT  DFHMDF POS=(02,050),                                          X00026   
               COLOR=GREEN,                                            X00027   
               ATTRB=(UNPROT,NUM,NORM),                                X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               LENGTH=007,                                             X00030   
               PICOUT='ZZZ,ZZ9'                                         00031   
         DFHMDF POS=(02,058),                                          X00032   
               COLOR=NEUTRAL,                                          X00033   
               ATTRB=(ASKIP,NORM),                                     X00034   
               LENGTH=002,                                             X00035   
               INITIAL='TO'                                             00036   
AENDIT   DFHMDF POS=(02,061),                                          X00037   
               COLOR=BLUE,                                             X00038   
               ATTRB=(ASKIP,NORM),                                     X00039   
               LENGTH=007,                                             X00040   
               PICOUT='ZZZ,ZZ9'                                         00041   
         DFHMDF POS=(02,069),                                          X00042   
               COLOR=NEUTRAL,                                          X00043   
               ATTRB=(ASKIP,NORM),                                     X00044   
               LENGTH=002,                                             X00045   
               INITIAL='OF'                                             00046   
ATOTIT   DFHMDF POS=(02,072),                                          X00047   
               COLOR=BLUE,                                             X00048   
               ATTRB=(ASKIP,NORM),                                     X00049   
               LENGTH=007,                                             X00050   
               PICOUT='ZZZ,ZZ9'                                         00051   
         DFHMDF POS=(04,001),                                          X00052   
               COLOR=NEUTRAL,                                          X00053   
               ATTRB=(ASKIP,NORM),                                     X00054   
               LENGTH=004,                                             X00055   
               INITIAL='SEL '                                           00056   
         DFHMDF POS=(04,006),                                          X00057   
               COLOR=NEUTRAL,                                          X00058   
               ATTRB=(ASKIP,NORM),                                     X00059   
               LENGTH=003,                                             X00060   
               INITIAL='ACT'                                            00061   
         DFHMDF POS=(04,012),                                          X00067**2
               COLOR=NEUTRAL,                                          X00068**2
               ATTRB=(ASKIP,NORM),                                     X00069**2
               LENGTH=011,                                             X00070**2
               INITIAL='VENDOR NAME'                                    00071**2
         DFHMDF POS=(04,044),                                          X00072**3
               COLOR=NEUTRAL,                                          X00073   
               ATTRB=(ASKIP,NORM),                                     X00074   
               LENGTH=004,                                             X00075**3
               INITIAL='TYPE'                                           00076**3
         DFHMDF POS=(04,056),                                          X00077   
               COLOR=NEUTRAL,                                          X00078   
               ATTRB=(ASKIP,NORM),                                     X00079   
               LENGTH=012,                                             X00080**2
               INITIAL='PRIMARY NAME'                                   00081**2
ASEL01   DFHMDF POS=(05,002),                                          X00082   
               COLOR=GREEN,                                            X00083   
               ATTRB=(UNPROT,NORM),                                    X00084   
               HILIGHT=UNDERLINE,                                      X00085   
               LENGTH=001                                               00086   
         DFHMDF POS=(05,004),                                          X00087   
               ATTRB=(ASKIP),                                          X00088   
               LENGTH=001                                               00089   
AACT01   DFHMDF POS=(05,006),                                          X00090   
               COLOR=BLUE,                                             X00091   
               ATTRB=(ASKIP,NORM),                                     X00092   
               LENGTH=003                                               00093   
AVNME01  DFHMDF POS=(05,012),                                          X00098   
               COLOR=BLUE,                                             X00099   
               ATTRB=(ASKIP,NORM),                                     X00100   
               LENGTH=030                                               00101   
ATYDS01  DFHMDF POS=(05,044),                                          X00102   
               COLOR=BLUE,                                             X00103   
               ATTRB=(ASKIP,NORM),                                     X00104   
               LENGTH=010                                               00105   
APRNM01  DFHMDF POS=(05,056),                                          X00106   
               COLOR=BLUE,                                             X00107   
               ATTRB=(ASKIP,NORM),                                     X00108   
               LENGTH=024                                               00109   
ASEL02   DFHMDF POS=(06,002),                                          X00110   
               COLOR=GREEN,                                            X00111   
               ATTRB=(UNPROT,NORM),                                    X00112   
               HILIGHT=UNDERLINE,                                      X00113   
               LENGTH=001                                               00114   
         DFHMDF POS=(06,004),                                          X00115   
               ATTRB=(ASKIP),                                          X00116   
               LENGTH=001                                               00117   
AACT02   DFHMDF POS=(06,006),                                          X00118   
               COLOR=BLUE,                                             X00119   
               ATTRB=(ASKIP,NORM),                                     X00120   
               LENGTH=003                                               00121   
AVNME02  DFHMDF POS=(06,012),                                          X00126   
               COLOR=BLUE,                                             X00127   
               ATTRB=(ASKIP,NORM),                                     X00128   
               LENGTH=030                                               00129   
ATYDS02  DFHMDF POS=(06,044),                                          X00130   
               COLOR=BLUE,                                             X00131   
               ATTRB=(ASKIP,NORM),                                     X00132   
               LENGTH=010                                               00133   
APRNM02  DFHMDF POS=(06,056),                                          X00134   
               COLOR=BLUE,                                             X00135   
               ATTRB=(ASKIP,NORM),                                     X00136   
               LENGTH=024                                               00137   
ASEL03   DFHMDF POS=(07,002),                                          X00138   
               COLOR=GREEN,                                            X00139   
               ATTRB=(UNPROT,NORM),                                    X00140   
               HILIGHT=UNDERLINE,                                      X00141   
               LENGTH=001                                               00142   
         DFHMDF POS=(07,004),                                          X00143   
               ATTRB=(ASKIP),                                          X00144   
               LENGTH=001                                               00145   
AACT03   DFHMDF POS=(07,006),                                          X00146   
               COLOR=BLUE,                                             X00147   
               ATTRB=(ASKIP,NORM),                                     X00148   
               LENGTH=003                                               00149   
AVNME03  DFHMDF POS=(07,012),                                          X00154   
               COLOR=BLUE,                                             X00155   
               ATTRB=(ASKIP,NORM),                                     X00156   
               LENGTH=030                                               00157   
ATYDS03  DFHMDF POS=(07,044),                                          X00158   
               COLOR=BLUE,                                             X00159   
               ATTRB=(ASKIP,NORM),                                     X00160   
               LENGTH=010                                               00161   
APRNM03  DFHMDF POS=(07,056),                                          X00162   
               COLOR=BLUE,                                             X00163   
               ATTRB=(ASKIP,NORM),                                     X00164   
               LENGTH=024                                               00165   
ASEL04   DFHMDF POS=(08,002),                                          X00166   
               COLOR=GREEN,                                            X00167   
               ATTRB=(UNPROT,NORM),                                    X00168   
               HILIGHT=UNDERLINE,                                      X00169   
               LENGTH=001                                               00170   
         DFHMDF POS=(08,004),                                          X00171   
               ATTRB=(ASKIP),                                          X00172   
               LENGTH=001                                               00173   
AACT04   DFHMDF POS=(08,006),                                          X00174   
               COLOR=BLUE,                                             X00175   
               ATTRB=(ASKIP,NORM),                                     X00176   
               LENGTH=003                                               00177   
AVNME04  DFHMDF POS=(08,012),                                          X00182   
               COLOR=BLUE,                                             X00183   
               ATTRB=(ASKIP,NORM),                                     X00184   
               LENGTH=030                                               00185   
ATYDS04  DFHMDF POS=(08,044),                                          X00186   
               COLOR=BLUE,                                             X00187   
               ATTRB=(ASKIP,NORM),                                     X00188   
               LENGTH=010                                               00189   
APRNM04  DFHMDF POS=(08,056),                                          X00190   
               COLOR=BLUE,                                             X00191   
               ATTRB=(ASKIP,NORM),                                     X00192   
               LENGTH=024                                               00193   
ASEL05   DFHMDF POS=(09,002),                                          X00194   
               COLOR=GREEN,                                            X00195   
               ATTRB=(UNPROT,NORM),                                    X00196   
               HILIGHT=UNDERLINE,                                      X00197   
               LENGTH=001                                               00198   
         DFHMDF POS=(09,004),                                          X00199   
               ATTRB=(ASKIP),                                          X00200   
               LENGTH=001                                               00201   
AACT05   DFHMDF POS=(09,006),                                          X00202   
               COLOR=BLUE,                                             X00203   
               ATTRB=(ASKIP,NORM),                                     X00204   
               LENGTH=003                                               00205   
AVNME05  DFHMDF POS=(09,012),                                          X00210   
               COLOR=BLUE,                                             X00211   
               ATTRB=(ASKIP,NORM),                                     X00212   
               LENGTH=030                                               00213   
ATYDS05  DFHMDF POS=(09,044),                                          X00214   
               COLOR=BLUE,                                             X00215   
               ATTRB=(ASKIP,NORM),                                     X00216   
               LENGTH=010                                               00217   
APRNM05  DFHMDF POS=(09,056),                                          X00218   
               COLOR=BLUE,                                             X00219   
               ATTRB=(ASKIP,NORM),                                     X00220   
               LENGTH=024                                               00221   
ASEL06   DFHMDF POS=(10,002),                                          X00222   
               COLOR=GREEN,                                            X00223   
               ATTRB=(UNPROT,NORM),                                    X00224   
               HILIGHT=UNDERLINE,                                      X00225   
               LENGTH=001                                               00226   
         DFHMDF POS=(10,004),                                          X00227   
               ATTRB=(ASKIP),                                          X00228   
               LENGTH=001                                               00229   
AACT06   DFHMDF POS=(10,006),                                          X00230   
               COLOR=BLUE,                                             X00231   
               ATTRB=(ASKIP,NORM),                                     X00232   
               LENGTH=003                                               00233   
AVNME06  DFHMDF POS=(10,012),                                          X00238   
               COLOR=BLUE,                                             X00239   
               ATTRB=(ASKIP,NORM),                                     X00240   
               LENGTH=030                                               00241   
ATYDS06  DFHMDF POS=(10,044),                                          X00242   
               COLOR=BLUE,                                             X00243   
               ATTRB=(ASKIP,NORM),                                     X00244   
               LENGTH=010                                               00245   
APRNM06  DFHMDF POS=(10,056),                                          X00246   
               COLOR=BLUE,                                             X00247   
               ATTRB=(ASKIP,NORM),                                     X00248   
               LENGTH=024                                               00249   
ASEL07   DFHMDF POS=(11,002),                                          X00250   
               COLOR=GREEN,                                            X00251   
               ATTRB=(UNPROT,NORM),                                    X00252   
               HILIGHT=UNDERLINE,                                      X00253   
               LENGTH=001                                               00254   
         DFHMDF POS=(11,004),                                          X00255   
               ATTRB=(ASKIP),                                          X00256   
               LENGTH=001                                               00257   
AACT07   DFHMDF POS=(11,006),                                          X00258   
               COLOR=BLUE,                                             X00259   
               ATTRB=(ASKIP,NORM),                                     X00260   
               LENGTH=003                                               00261   
AVNME07  DFHMDF POS=(11,012),                                          X00266   
               COLOR=BLUE,                                             X00267   
               ATTRB=(ASKIP,NORM),                                     X00268   
               LENGTH=030                                               00269   
ATYDS07  DFHMDF POS=(11,044),                                          X00270   
               COLOR=BLUE,                                             X00271   
               ATTRB=(ASKIP,NORM),                                     X00272   
               LENGTH=010                                               00273   
APRNM07  DFHMDF POS=(11,056),                                          X00274   
               COLOR=BLUE,                                             X00275   
               ATTRB=(ASKIP,NORM),                                     X00276   
               LENGTH=024                                               00277   
ASEL08   DFHMDF POS=(12,002),                                          X00278   
               COLOR=GREEN,                                            X00279   
               ATTRB=(UNPROT,NORM),                                    X00280   
               HILIGHT=UNDERLINE,                                      X00281   
               LENGTH=001                                               00282   
         DFHMDF POS=(12,004),                                          X00283   
               ATTRB=(ASKIP),                                          X00284   
               LENGTH=001                                               00285   
AACT08   DFHMDF POS=(12,006),                                          X00286   
               COLOR=BLUE,                                             X00287   
               ATTRB=(ASKIP,NORM),                                     X00288   
               LENGTH=003                                               00289   
AVNME08  DFHMDF POS=(12,012),                                          X00294   
               COLOR=BLUE,                                             X00295   
               ATTRB=(ASKIP,NORM),                                     X00296   
               LENGTH=030                                               00297   
ATYDS08  DFHMDF POS=(12,044),                                          X00298   
               COLOR=BLUE,                                             X00299   
               ATTRB=(ASKIP,NORM),                                     X00300   
               LENGTH=010                                               00301   
APRNM08  DFHMDF POS=(12,056),                                          X00302   
               COLOR=BLUE,                                             X00303   
               ATTRB=(ASKIP,NORM),                                     X00304   
               LENGTH=024                                               00305   
ASEL09   DFHMDF POS=(13,002),                                          X00306   
               COLOR=GREEN,                                            X00307   
               ATTRB=(UNPROT,NORM),                                    X00308   
               HILIGHT=UNDERLINE,                                      X00309   
               LENGTH=001                                               00310   
         DFHMDF POS=(13,004),                                          X00311   
               ATTRB=(ASKIP),                                          X00312   
               LENGTH=001                                               00313   
AACT09   DFHMDF POS=(13,006),                                          X00314   
               COLOR=BLUE,                                             X00315   
               ATTRB=(ASKIP,NORM),                                     X00316   
               LENGTH=003                                               00317   
AVNME09  DFHMDF POS=(13,012),                                          X00322   
               COLOR=BLUE,                                             X00323   
               ATTRB=(ASKIP,NORM),                                     X00324   
               LENGTH=030                                               00325   
ATYDS09  DFHMDF POS=(13,044),                                          X00326   
               COLOR=BLUE,                                             X00327   
               ATTRB=(ASKIP,NORM),                                     X00328   
               LENGTH=010                                               00329   
APRNM09  DFHMDF POS=(13,056),                                          X00330   
               COLOR=BLUE,                                             X00331   
               ATTRB=(ASKIP,NORM),                                     X00332   
               LENGTH=024                                               00333   
ASEL10   DFHMDF POS=(14,002),                                          X00334   
               COLOR=GREEN,                                            X00335   
               ATTRB=(UNPROT,NORM),                                    X00336   
               HILIGHT=UNDERLINE,                                      X00337   
               LENGTH=001                                               00338   
         DFHMDF POS=(14,004),                                          X00339   
               ATTRB=(ASKIP),                                          X00340   
               LENGTH=001                                               00341   
AACT10   DFHMDF POS=(14,006),                                          X00342   
               COLOR=BLUE,                                             X00343   
               ATTRB=(ASKIP,NORM),                                     X00344   
               LENGTH=003                                               00345   
AVNME10  DFHMDF POS=(14,012),                                          X00350   
               COLOR=BLUE,                                             X00351   
               ATTRB=(ASKIP,NORM),                                     X00352   
               LENGTH=030                                               00353   
ATYDS10  DFHMDF POS=(14,044),                                          X00354   
               COLOR=BLUE,                                             X00355   
               ATTRB=(ASKIP,NORM),                                     X00356   
               LENGTH=010                                               00357   
APRNM10  DFHMDF POS=(14,056),                                          X00358   
               COLOR=BLUE,                                             X00359   
               ATTRB=(ASKIP,NORM),                                     X00360   
               LENGTH=024                                               00361   
ASEL11   DFHMDF POS=(15,002),                                          X00362   
               COLOR=GREEN,                                            X00363   
               ATTRB=(UNPROT,NORM),                                    X00364   
               HILIGHT=UNDERLINE,                                      X00365   
               LENGTH=001                                               00366   
         DFHMDF POS=(15,004),                                          X00367   
               ATTRB=(ASKIP),                                          X00368   
               LENGTH=001                                               00369   
AACT11   DFHMDF POS=(15,006),                                          X00370   
               COLOR=BLUE,                                             X00371   
               ATTRB=(ASKIP,NORM),                                     X00372   
               LENGTH=003                                               00373   
AVNME11  DFHMDF POS=(15,012),                                          X00378   
               COLOR=BLUE,                                             X00379   
               ATTRB=(ASKIP,NORM),                                     X00380   
               LENGTH=030                                               00381   
ATYDS11  DFHMDF POS=(15,044),                                          X00382   
               COLOR=BLUE,                                             X00383   
               ATTRB=(ASKIP,NORM),                                     X00384   
               LENGTH=010                                               00385   
APRNM11  DFHMDF POS=(15,056),                                          X00386   
               COLOR=BLUE,                                             X00387   
               ATTRB=(ASKIP,NORM),                                     X00388   
               LENGTH=024                                               00389   
ASEL12   DFHMDF POS=(16,002),                                          X00390   
               COLOR=GREEN,                                            X00391   
               ATTRB=(UNPROT,NORM),                                    X00392   
               HILIGHT=UNDERLINE,                                      X00393   
               LENGTH=001                                               00394   
         DFHMDF POS=(16,004),                                          X00395   
               ATTRB=(ASKIP),                                          X00396   
               LENGTH=001                                               00397   
AACT12   DFHMDF POS=(16,006),                                          X00398   
               COLOR=BLUE,                                             X00399   
               ATTRB=(ASKIP,NORM),                                     X00400   
               LENGTH=003                                               00401   
AVNME12  DFHMDF POS=(16,012),                                          X00406   
               COLOR=BLUE,                                             X00407   
               ATTRB=(ASKIP,NORM),                                     X00408   
               LENGTH=030                                               00409   
ATYDS12  DFHMDF POS=(16,044),                                          X00410   
               COLOR=BLUE,                                             X00411   
               ATTRB=(ASKIP,NORM),                                     X00412   
               LENGTH=010                                               00413   
APRNM12  DFHMDF POS=(16,056),                                          X00414   
               COLOR=BLUE,                                             X00415   
               ATTRB=(ASKIP,NORM),                                     X00416   
               LENGTH=024                                               00417   
ASEL13   DFHMDF POS=(17,002),                                          X00418   
               COLOR=GREEN,                                            X00419   
               ATTRB=(UNPROT,NORM),                                    X00420   
               HILIGHT=UNDERLINE,                                      X00421   
               LENGTH=001                                               00422   
         DFHMDF POS=(17,004),                                          X00423   
               ATTRB=(ASKIP),                                          X00424   
               LENGTH=001                                               00425   
AACT13   DFHMDF POS=(17,006),                                          X00426   
               COLOR=BLUE,                                             X00427   
               ATTRB=(ASKIP,NORM),                                     X00428   
               LENGTH=003                                               00429   
AVNME13  DFHMDF POS=(17,012),                                          X00434   
               COLOR=BLUE,                                             X00435   
               ATTRB=(ASKIP,NORM),                                     X00436   
               LENGTH=030                                               00437   
ATYDS13  DFHMDF POS=(17,044),                                          X00438   
               COLOR=BLUE,                                             X00439   
               ATTRB=(ASKIP,NORM),                                     X00440   
               LENGTH=010                                               00441   
APRNM13  DFHMDF POS=(17,056),                                          X00442   
               COLOR=BLUE,                                             X00443   
               ATTRB=(ASKIP,NORM),                                     X00444   
               LENGTH=024                                               00445   
ASEL14   DFHMDF POS=(18,002),                                          X00446   
               COLOR=GREEN,                                            X00447   
               ATTRB=(UNPROT,NORM),                                    X00448   
               HILIGHT=UNDERLINE,                                      X00449   
               LENGTH=001                                               00450   
         DFHMDF POS=(18,004),                                          X00451   
               ATTRB=(ASKIP),                                          X00452   
               LENGTH=001                                               00453   
AACT14   DFHMDF POS=(18,006),                                          X00454   
               COLOR=BLUE,                                             X00455   
               ATTRB=(ASKIP,NORM),                                     X00456   
               LENGTH=003                                               00457   
AVNME14  DFHMDF POS=(18,012),                                          X00462   
               COLOR=BLUE,                                             X00463   
               ATTRB=(ASKIP,NORM),                                     X00464   
               LENGTH=030                                               00465   
ATYDS14  DFHMDF POS=(18,044),                                          X00466   
               COLOR=BLUE,                                             X00467   
               ATTRB=(ASKIP,NORM),                                     X00468   
               LENGTH=010                                               00469   
APRNM14  DFHMDF POS=(18,056),                                          X00470   
               COLOR=BLUE,                                             X00471   
               ATTRB=(ASKIP,NORM),                                     X00472   
               LENGTH=024                                               00473   
         DFHMDF POS=(19,045),                                          X00474   
               COLOR=NEUTRAL,                                          X00475   
               ATTRB=(ASKIP,NORM),                                     X00476   
               LENGTH=026,                                             X00477   
               INITIAL='NUMBER OF SELECTED ITEMS: '                     00478   
ASELIT   DFHMDF POS=(19,072),                                          X00479   
               COLOR=BLUE,                                             X00480   
               ATTRB=(ASKIP,NORM),                                     X00481   
               LENGTH=007,                                             X00482   
               PICOUT='ZZZ,ZZ9'                                         00483   
         DFHMSD TYPE=FINAL                                              00484   
         END                                                            00485   
