      ******************************************************************00010000
      *     FSRD053 - FASHION SALES DAILY SALES EXTRACT RECORD         *00020000
      *               LRECL = 14027 (HEADER 27 AND DETAIL 14000)       *00030000
FL1001*     06/16/10  INCREASING ITEM OCCURS FROM 200 TO 400 FOR       *00040000
FL1001*               POST SALE ADJUSTMENTS                            *00050000
BKPFLC*     10/31/11  REPLACED FILLER WITH F053-DETAIL-ITEM-ENTRY      *00051001
      ******************************************************************00060000
       01  F053-SALES-RECORD.                                           00070000
           05  F053-SALES-HEADER.                                       00080000
              10  F053-STORENO             PIC 9(04).                   00090000
              10  F053-TERMINAL            PIC 9(04)   COMP-3.          00100000
              10  F053-TRANSNO             PIC 9(04)   COMP-3.          00110000
              10  F053-OPERATOR            PIC 9(06)   COMP-3.          00120000
              10  F053-DATE                PIC 9(06).                   00130000
              10  F053-TIME                PIC 9(04)   COMP-3.          00140000
              10  F053-SALE-TYPE           PIC 9(02).                   00150000
              10  F053-SLS-CORR-CDE        PIC X(01).                   00160000
                  88  F053-NORMAL-TRANS                VALUE ' '.       00170000
                  88  F053-SALES-AUDIT-CORR            VALUE 'S'.       00180000
                  88  F053-SYSTEM-LATE-CORR            VALUE 'L'.       00190000
              10  F053-VOID-INDICATOR      PIC X(01).                   00200000
                  88  F053-VOID-AFTER                  VALUE 'Y'.       00210000
                  88  F053-NON-VOID-AFTER              VALUE ' '.       00220000
OCFSFS        10  F053-OMNI-CHNL-FFLMT-TYP-CDE  PIC X(03).              00221004
           05  F053-DETAIL-ITEM-ARRAY.                                  00230000
BKPFLC        10  F053-DETAIL-ITEM-ENTRY OCCURS 400 TIMES               00240001
                                        INDEXED BY F053-IDX.            00250000
                  15  F053-SKU.                                         00260000
                      20  F053-DEPT       PIC 9(03).                    00270000
                      20  F053-CLASS      PIC 9(02).                    00280000
                      20  F053-SEQNO      PIC 9(03).                    00290000
                  15  F053-SALE-TYPE-2    PIC X(01).                    00300000
                  15  F053-SALE-UNITS     PIC S9(05)       COMP-3.      00310000
                  15  F053-SALE-AMT       PIC S9(05)V99    COMP-3.      00320000
                  15  F053-REG-AMT        PIC S9(05)V99    COMP-3.      00330000
                  15  F053-DEPT-NBR       PIC S9(04)       COMP-3.      00340000
                  15  F053-MCL-NBR        PIC S9(04)       COMP-3.      00350000
                  15  F053-SCL-NBR        PIC S9(04)       COMP-3.      00360000
                  15  F053-SALE-RET-CDE   PIC X(01).                    00370000
                      88  F053-SALE-S                  VALUE 'S'.       00380000
                      88  F053-SALE-ADJ-A              VALUE 'A'.       00390000
                      88  F053-SALE-RET-R              VALUE 'R'.       00400000
                      88  F053-SALE-RET-ADJ-B          VALUE 'B'.       00410000
                  15  F053-LIV-RES-IND    PIC X(01).                    00420000
                      88  F053-NON-LINE-ITEM-VOID      VALUE '+'.       00430000
                      88  F053-LINE-ITEM-VOID          VALUE '-'.       00440000
                  15  F053-CUST-CHRGD-AMT PIC S9(05)V99    COMP-3.      00450000
      ******************************************************************00460000
