00001 ***************************************************************** 07/10/95
00002 * FASHION SALES COPY MEMBER   -  FSRD048                        * FSRD048 
00003 * LENGTH = 50                 -  CREATED 6/26/95                *    LV008
00004 * THIS RECORD CONTAINS DAILY TOTAL RECEIPT QUANTITES AND STORE  *    CL**2
00005 * RECEIPT QUANTITES TO KEEP TRACK OF UNITS 'IN TRANSIT'.        *    CL**2
00006 *                                                               * FSRD048 
00007 * CHANGE:    EXPAND THE TOTAL AND STORE RECEIPT QUANTITY FIELDS *    CL**2
00008 *            DATE:  03/04/98  BY: P. KEBER   WR#: 5847          *    CL**2
00009 *                                                               * FSRD048 
00010 ***************************************************************** FSRD048 
00011                                                                   FSRD048 
00012  01  FS048-RECEIPT-ENROUTE-RECORD.                                   CL**3
00013      05  FS048-RECORD-KEY.                                           CL**7
00014          10  FS048-SKU-NUMBER               PIC  X(08).              CL**7
00015          10  FILLER REDEFINES FS048-SKU-NUMBER.                      CL**7
00016              15  FS048-MERCH-DEPT-NMBR      PIC  X(03).              CL**8
00017              15  FS048-MERCH-CLASS-NMBR     PIC  X(02).              CL**7
00018              15  FS048-SEQ-NMBR             PIC  X(03).              CL**7
00019          10  FS048-STORE-NUMBER             PIC  X(03).              CL**7
00020      05  FS048-TOTAL-RECEIPT-QTY            PIC S9(09) COMP-3.       CL**7
00021      05  FS048-STORE-RECEIPT-QTY            PIC S9(09) COMP-3.       CL**7
00022      05  FS048-RECEIPT-DATE                 PIC  9(06).              CL**7
00023      05  FILLER-1                           PIC  X(23).              CL**7
