00001 ******************************************************************01/08/92
00002 *  FSRD001O   RECORD LENGTH = 48                                 *FSRD001O
00003 *                                                                *   LV002
00004 *  THIS FILE CONTAINS THE MERCHANDISE BUSINESS STRUCTURE FOR     *   CL**1
00005 *  THE FASHION SALES SYSTEM AS CREATED IN PROGRAM FSKUT003.      *   CL**1
00006 *  A SORTED VERSION OF THIS FILE IS USED AS THE DRIVER IN        *   CL**1
00007 *  PROGRAM FSKRP032 TO CREATE THE INVENTORY LEVEL REPORTS BY     *   CL**1
00008 *  DEPARTMENT/CLASS.                                             *   CL**1
00009 ******************************************************************   CL**1
00010  01  FS001O-MBS-STRUCTURE-RECORD.                                    CL**1
00011      05  FS001O-GMM                  PIC  X(02)    VALUE SPACES.     CL**1
00012      05  FS001O-DMM                  PIC  X(02)    VALUE SPACES.     CL**1
00013      05  FS001O-BUYER                PIC  X(03)    VALUE SPACES.     CL**1
00014      05  FS001O-DEPT                 PIC  X(03)    VALUE SPACES.     CL**1
00015      05  FS001O-MAJ-CLASS            PIC  X(02)    VALUE SPACES.     CL**1
00016      05  FS001O-SUB-CLASS.                                           CL**1
00017          10  FILLER                  PIC  X(01)    VALUE SPACE.      CL**1
00018          10  FS001O-SUB-CLASS-NMBR   PIC  X(02)    VALUE SPACES.     CL**1
00019      05  FS001O-LEVEL                PIC  X(03)    VALUE SPACES.     CL**1
00020      05  FS001O-DESC                 PIC  X(30)    VALUE SPACES.     CL**1
