00001 *                                                                 06/06/91
00002 *  THIS IS THE RECORD DEFINITION FOR THE MAINTENANCE LOG OF       FSRD500O
00003 *  THE MERCHANDISING SYSTEM.  THE RECORD LENGTH IS 160 BYTES.        LV002
00004 *                                                                 FSRD500O
00005  01  FS500O-MAINTENANCE-LOG-RECORD.                               FSRD500O
00006      05  FS500O-TRANSACTION-DATE    PIC 9(6)       VALUE ZERO.    FSRD500O
00007      05  FILLER                     REDEFINES                     FSRD500O
00008                                         FS500O-TRANSACTION-DATE.  FSRD500O
00009          10  FS500O-TRANSACTION-YEAR                              FSRD500O
00010                                     PIC 9(2).                     FSRD500O
00011          10  FS500O-TRANSACTION-MONTH                             FSRD500O
00012                                     PIC 9(2).                     FSRD500O
00013          10  FS500O-TRANSACTION-DAY PIC 9(2).                     FSRD500O
00014      05  FS500O-TRANSACTION-TIME    PIC 9(6)       VALUE ZERO.    FSRD500O
00015      05  FILLER                     REDEFINES                     FSRD500O
00016                                         FS500O-TRANSACTION-TIME.  FSRD500O
00017          10  FS500O-TRANSACTION-HOUR                              FSRD500O
00018                                     PIC 9(2).                     FSRD500O
00019          10  FS500O-TRANSACTION-MINUTE                            FSRD500O
00020                                     PIC 9(2).                     FSRD500O
00021          10  FS500O-TRANSACTION-SECOND                            FSRD500O
00022                                     PIC 9(2).                     FSRD500O
00023      05  FS500O-PROGRAM-NAME        PIC X(8)       VALUE SPACES.  FSRD500O
00024      05  FS500O-TRANSACTION-ID      PIC X(4)       VALUE SPACES.  FSRD500O
00025      05  FS500O-TABLE-ID            PIC 9(2)       VALUE ZERO.    FSRD500O
00026          88  FS500O-TSK-TABLE                      VALUE 01.      FSRD500O
00027          88  FS500O-TSKST-TABLE                    VALUE 02.      FSRD500O
00028          88  FS500O-TUPCSKU-TABLE                  VALUE 03.         CL**2
00029      05  FS500O-TABLE-KEY-VALUE     PIC X(17)      VALUE SPACES.  FSRD500O
00030      05  FS500O-TSK-KEY-VALUE       REDEFINES                     FSRD500O
00031                                         FS500O-TABLE-KEY-VALUE.   FSRD500O
00032          10  FS500O-TSK-DEPT        PIC 9(3).                     FSRD500O
00033          10  FS500O-TSK-CLASS       PIC 9(2).                     FSRD500O
00034          10  FS500O-TSK-SKU         PIC 9(8).                     FSRD500O
00035          10  FILLER                 PIC X(4).                     FSRD500O
00036      05  FS500O-TSKST-KEY-VALUE     REDEFINES                     FSRD500O
00037                                         FS500O-TABLE-KEY-VALUE.   FSRD500O
00038          10  FS500O-TSKST-SKU       PIC 9(8).                     FSRD500O
00041          10  FS500O-TSKST-STORE     PIC 9(5).                     FSRD500O
00042          10  FILLER                 PIC X(4).                     FSRD500O
00043      05  FS500O-TUPCSKU-KEY-VALUE   REDEFINES                        CL**2
00044                                         FS500O-TABLE-KEY-VALUE.      CL**2
00045          10  FS500O-TUPCSKU-SKU     PIC 9(8).                        CL**2
00048          10  FS500O-TUPCSKU-UPC     PIC S9(15)     COMP-3.           CL**2
00049          10  FILLER                 PIC X(1).                        CL**2
00050      05  FS500O-USER-ID             PIC X(8)       VALUE SPACES.  FSRD500O
00051      05  FS500O-TERMINAL-ID         PIC X(4)       VALUE SPACES.  FSRD500O
00052      05  FS500O-FUNCTION-CODE       PIC X(1)       VALUE SPACES.  FSRD500O
00053          88  FS500O-ADD-CODE                       VALUE 'A'.     FSRD500O
00054          88  FS500O-CHANGE-CODE                    VALUE 'C'.     FSRD500O
00055          88  FS500O-DELETE-CODE                    VALUE 'D'.     FSRD500O
00056      05  FS500O-OUTPUT-MESSAGE-AREA.                              FSRD500O
00057          10  FS500O-OUTPUT-MESSAGE-SEQ                            FSRD500O
00058                                     PIC 9(2)       VALUE ZERO.    FSRD500O
00059          10  FS500O-OUTPUT-MESSAGE  PIC X(102)     VALUE SPACES.  FSRD500O
