      **********************************************************************    
      *    THIS IS THE COPYBOOK FOR THE FASHION SALES ERROR FILE.               
      **********************************************************************    
                                                                                
       01  FS013-FS-ERROR-RECORD.                                               
           05  FS013-FR-DEPT-NBR                  PIC 9(04).                    
           05  FS013-FR-MAJ-CL-NBR                PIC 9(04).                    
           05  FS013-FR-SUB-CL-NBR                PIC 9(04).                    
           05  FS013-FR-SKU-NBR                   PIC 9(08).                    
           05  FS013-STR-NBR                      PIC 9(05).                    
           05  FS013-WHSE-NBR                     PIC 9(05).                    
           05  FS013-MDSE-ADJ-ID                  PIC 9(10).                    
           05  FS013-ADJ-TYP-CDE                  PIC X(02).                    
           05  FS013-ADJ-ACTN-CDE                 PIC X(01).                    
           05  FS013-OH-UNT-ADJ-QTY               PIC 9(10).                    
           05  FS013-ERROR-DESCRIPTION            PIC X(40).                    
           05  FILLER                             PIC X(107).                   
