      ******************************************************************      02
      *     FSRD124 - TSKSTOO EXTRACT LAYOUT                           *      02
      *               LRECL = 20                                       *      02
      ******************************************************************      02
       01  FS124-TSKSTOO-RECORD.                                              02
           05  FS124-ITEM-NMBR             PIC  S9(15)V COMP-3.               02
           05  FS124-LOC-NBR               PIC  S9(4) COMP.                   02
           05  FS124-OTB-PER-NBR           PIC   X(6).                        02
           05  FS124-ONORD-UNT-QTY         PIC  S9(9) COMP.                   02
