      ******************************************************************        
      *  !!!  WARNING  !!  THIS COPYBOOK SHOULD BE KEPT IN SYNC WITH   *        
      *  !!!  WARNING  !!  FSRD126, ALTHOUGH NOT ALL FIELDS ON         *        
      *  !!!  WARNING  !!  FSRD126 ARE CONTAINED ON HERE AND THERE IS  *        
      *  !!!  WARNING  !!  SOME ADDITIONAL DATA IN THIS COPYBOOK THAT  *        
      *  !!!  WARNING  !!  IS NOT ON THE FSRD126 LAYOUT. IF A FIELD IS *        
      *  !!!  WARNING  !!  ADDED OR DELETED FROM THIS LAYOUT, A        *        
      *  !!!  WARNING  !!  CORRESPONDING CHANGE MUST BE MADE TO        *        
      *  !!!  WARNING  !!  COPYBOOK FSRD134 AS THIS CONTAINS HEADER    *        
      *  !!!  WARNING  !!  DATA TO THE DETAIL DATA IN THE FILES        *        
      *  !!!  WARNING  !!  DEFINED BY THIS LAYOUT.                     *        
      ******************************************************************        
      *  FSRD133   FASHION SALES E-COMMERCE WEEKLY SKU CSV REPLACEMENT *        
      *            LRECL = 771                                         *        
      *  THIS FILE CONTAINS THE SKU INFO, INVENTORY, SALES, AND ON     *        
      *  ORDER DATA.                                                   *        
      ******************************************************************        
      *  03/09/11  JACK KRAMER                                                  
      *      NEW COPYBOOK FOR WEEKLY E-COMMERCE CSV                             
      *      THIS IS A COMPLETE FILE CONTAINING ALL DATA FROM THE               
      *      EXISTING DMM FILES, AS WELL AS ADDITIONAL FIELDS                   
      ******************************************************************        
                                                                                
       01  FS133-ECOM-SKU-EXTRACT-RECORD.                                       
           05  FS133-CUR-WK-ENDING-DATE       PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-MERCH-DIV-CODE           PIC X(02).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-GMM-NAME                 PIC X(20).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-GMM-DESC                 PIC X(25).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-DMM-NMBR                 PIC X(02).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-DMM-NAME                 PIC X(20).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-DMM-DESC                 PIC X(25).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-BUYER-NMBR               PIC X(03).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-BUYER-NAME               PIC X(20).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-MERCH-DEPT-NMBR          PIC X(03).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-DEPT-DESC                PIC X(25).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-SUBCLASS                 PIC X(02).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-SUBCLASS-DESC            PIC X(25).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-IN-HSE-VNDR-NAME         PIC X(25).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-GROUP-CODE               PIC X(03).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-LONG-VENDOR-STYLE        PIC X(20).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-SKU                      PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-SKU-DESCRIPTION          PIC X(30).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-KY-ITM-IND               PIC X(01).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-PRD-GP-IND               PIC X(01).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-PRD-GP-NBR               PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-STATUS-CODE              PIC X(02).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-RPLNMT-IND               PIC X(01).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-SEASON-DESC              PIC X(25).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-COLOR-DESC               PIC X(10).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-SIZE-DESC                PIC X(10).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-UNIT-COST-AMT            PIC -9999999.9(02).               
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-MU-PCT                   PIC -999.9.                       
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-CUR-UNIT-RTL-AMT         PIC -999999.9(02).                
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-GP-QTY                   PIC -9999.                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-GP-RTL-AMT               PIC -999999.9(02).                
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-SELL-THRU-PCT            PIC -9999.9.                      
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-CUR-SALES-UNIT-QTY       PIC -999999999.                   
           05  FILLER                          PIC X(01)  VALUE ','.            
           05  FS133-WK1-SALES-UNIT-QTY       PIC -999999999.                   
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-WK2-SALES-UNIT-QTY       PIC -999999999.                   
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-WK3-SALES-UNIT-QTY       PIC -999999999.                   
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-WK4-SALES-UNIT-QTY       PIC -999999999.                   
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-CUR-ONHAND-QTY           PIC -999999999.                   
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-WKS-ONHAND-QTY           PIC -99999999999.                 
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-ON-ORD-QTY               PIC -999999999.                   
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-ORD-BGHT-DATE.                                             
               10  FS133-ORD-BGHT-MM          PIC X(02).                        
               10  FILLER                     PIC X(01)  VALUE '/'.             
               10  FS133-ORD-BGHT-YY          PIC X(02).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-YTD-SALES-UNIT-QTY       PIC -999999999.                   
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-YTD-SELL-THRU-PCT        PIC -9999.9.                      
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-FIRST-SALE-DATE          PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-LAST-SALE-DATE           PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-FIRST-RCVD-DATE          PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-LAST-RCVD-DATE           PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-MDSE-LBL-DESC            PIC X(10).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-STICKER-NBR              PIC -9999.                        
           05  FS133-STICKER-NBR-X REDEFINES FS133-STICKER-NBR                  
                                              PIC X(5).                         
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-ASRT-BEG-DTE             PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-ASRT-END-DTE             PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-DIRECT-SHIP-IND          PIC X(01).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-WEB-EXCLV-IND            PIC X(01).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-EXT-SIZE-CDE             PIC X(02).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-EXT-SIZE-DESC            PIC X(20).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-MAJCLASS                 PIC X(02).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-MAJCLASS-DESC            PIC X(25).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-STYLE-DESC               PIC X(30).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-INTR-UPC-NBR             PIC ZZZZZZZZZZZZZZ9.              
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-VNDR-UPC-1               PIC ZZZZZZZZZZZZZZ9.              
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-VNDR-UPC-2               PIC ZZZZZZZZZZZZZZ9.              
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-ENT-ID                   PIC 999999999.                    
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-DUN-NBR                  PIC X(09).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-SALEABLE-IND             PIC X(01).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-SHIP-SRVC-CDE            PIC ZZZ9.                         
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-SHIP-RSTRCT-NBR          PIC ZZZ9.                         
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-SHIP-GP-SEQ-NBR          PIC ZZZ9.                         
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS133-SHIP-SRCHG-FEE           PIC ZZZ.9(02).                    
           05  FILLER                         PIC X(01)  VALUE ','.             
