00001 * ****************************************************************08/15/95
00002 *             FSRD049   FASHION SALES SKU HISTORY UNITS/SALES    *FSRD049 
00003 *                    RECORD LENGTH = 250                         *   LV011
00004 *                                                                *FSRD049 
00005 *  THIS FILE CONTAINS THE UNIT HISTORICAL DATA BY SKU.  EACH     *   CL**3
00006 *  RECORD CONTAINS ONE YEAR'S WORTH OF DATA.  EACH OCCURANCE     *   CL**3
00007 *  CORRESPONDS TO A WEEK WITHIN THE CALENDAR YEAR.  THIS FILE    *   CL**3
00008 *  LAYOUT IS A THINNER VERSION OF FSRD004 WITH EXPANDED VENDOR   *   CL**5
00009 *  STYLE CODE, ENT-ID, AND OUTER PACK QTY ADDED.                 *   CL*10
00010 * ****************************************************************FSRD049 
00011                                                                   FSRD049 
00012  01  FS049-SKU-HISTORY-RECORD.                                       CL**4
00013      05  FS049-KEY.                                                  CL**4
00014          10  FS049-SKU.                                              CL**4
00015              15  FS049-DEPT-NMBR       PIC 9(3).                     CL**4
00016              15  FS049-CLASS-NMBR      PIC 9(2).                     CL**4
00017              15  FS049-SEQ-NMBR        PIC 9(3).                     CL**4
00018          10  FS049-ACTIVE-DELETE       PIC X.                        CL**4
00019              88  FS049-ACTIVE                       VALUE IS 'A'.    CL**4
00020              88  FS049-DELETE                       VALUE IS 'D'.    CL**4
00021          10  FS049-YEAR                PIC 99.                       CL**4
00022          10  FS049-DELETE-DATE         PIC 9(6).                     CL**4
00023          10  FS049-STORE               PIC X(3).                     CL**4
00024          10  FS049-TYPE                PIC XX.                       CL**4
00025              88  FS049-SKU-HEADER                   VALUE IS '00'.   CL**4
00026              88  FS049-REG-SALES                    VALUE IS '10'.   CL**4
00027              88  FS049-PROMO-SALES                  VALUE IS '20'.   CL**4
00028              88  FS049-CLR-SALES                    VALUE IS '30'.   CL**4
00029              88  FS049-INVENTORY                    VALUE IS '90'.   CL**4
00030 *                                                                    CL**3
00031      05  FS049-SKU-HEADER-RECORD.                                    CL**4
00032          10  FS049-SKU-DESC            PIC X(25).                    CL**4
00033          10  FS049-SIZE-DESC           PIC X(5).                     CL**4
00034          10  FS049-COLOR-DESC          PIC X(4).                     CL**4
00035          10  FS049-VENDOR-STYLE        PIC X(15).                    CL**6
00036          10  FS049-VNDR-INHSE          PIC 9(3)     COMP-3.          CL**4
00037          10  FS049-FORMER-SKU          PIC X(8).                     CL**4
00038          10  FS049-CUM-SALES-UNIT-QTY PIC S9(07)    COMP-3.          CL**4
00039          10  FS049-RTL-UNIT-RCVD-QTY   PIC S9(07)   COMP-3.          CL**4
00040          10  FS049-COST-UNIT-MSRMNT    PIC X(4).                     CL**4
00041          10  FS049-RTL-UNIT-MSRMNT     PIC X(4).                     CL**4
00042          10  FS049-UNIT-COST-AMT       PIC S9(4)V999 COMP-3.         CL**4
00043          10  FS049-CUR-UNIT-RTL-AMT    PIC S9(05)V99 COMP-3.         CL**4
00044          10  FS049-ORIG-UNIT-RTL-AMT   PIC S9(05)V99 COMP-3.         CL**4
00045          10  FS049-VNDR-INNR-PACK-QTY PIC S9(05)     COMP-3.         CL**4
00046          10  FS049-SHPMT-COUNT-QTY     PIC S9(03)    COMP-3.         CL**4
00047          10  FS049-STAT-CHNGD-DATE     PIC S9(07)    COMP-3.         CL**4
00048          10  FS049-STATUS-CODE         PIC S9(03)    COMP-3.         CL**4
00049          10  FS049-AUTO-RORD-MTH-CODE PIC X(1).                      CL**4
00050          10  FS049-RTL-CST-CVRSN-FCTR PIC S9(03)     COMP-3.         CL**4
00051          10  FS049-SETUP-DATE          PIC S9(07)    COMP-3.         CL**4
00052          10  FS049-PRICE-CHNG-DATE     PIC S9(07)    COMP-3.         CL**4
00053          10  FS049-GROUP-CODE          PIC X(3).                     CL**4
00054          10  FS049-REORDER-FRMT-CODE   PIC X(1).                     CL**4
00055          10  FS049-ITEM-NMBR           PIC S9(15)V   COMP-3.         CL**4
00056          10  FS049-ENT-ID              PIC S9(9)    COMP.            CL**4
00057          10  FS049-VNDR-OUTR-PACK-QTY PIC S9(05)     COMP-3.         CL**4
00058          10  FS049-LONG-VENDOR-STYLE   PIC X(20).                    CL**6
00059          10  FS049-LONG-SIZE-DESC      PIC X(20).                    CL**6
00060          10  FS049-LONG-COLOR-DESC     PIC X(20).                    CL**6
00061          10  FS049-FILLER              PIC X(040).                   CL**7
00062 *                                                                    CL**3
00063      05  FS049-SALES-INV-RECORD REDEFINES                            CL**8
00064          FS049-SKU-HEADER-RECORD.                                    CL**8
00065          10  FS049-SALES-INV-UNITS-TABLE.                            CL**8
00066              15  FS049-UNITS-TABLE.                                  CL**8
00067                  20  FS049-UNITS       OCCURS 53 TIMES               CL**8
00068                                        PIC S9(7)    COMP-3.          CL**8
00069                  20  FILLER            PIC X(16).                    CL**8
00070 *                                                                    CL*10
00071      05  FS049-SALES-AMT-RECORD REDEFINES                            CL**9
00072          FS049-SKU-HEADER-RECORD.                                    CL**9
00073          10  FS049-SALES-AMT-TABLE.                                  CL**9
00074              15  FS049-AMOUNTS-TABLE.                                CL**9
00075                  20  FS049-AMOUNT      OCCURS 53 TIMES               CL**9
00076                                        PIC S9(7)    COMP-3.          CL**9
00077                  20  FILLER            PIC X(16).                    CL**9
00078                                                                      CL**9
00079 *                                                                    CL**9
