      ******************************************************************        
      *  !!!  WARNING  !!  THIS COPYBOOK SHOULD BE KEPT IN SYNC WITH   *        
      *  !!!  WARNING  !!  FSRD126, ALTHOUGH NOT ALL FIELDS ON         *        
      *  !!!  WARNING  !!  FSRD126 ARE CONTAINED ON HERE AND THERE IS  *        
      *  !!!  WARNING  !!  SOME ADDITIONAL DATA IN THIS COPYBOOK THAT  *        
      *  !!!  WARNING  !!  IS NOT ON THE FSRD126 LAYOUT. IF A FIELD IS *        
      *  !!!  WARNING  !!  ADDED OR DELETED FROM THIS LAYOUT, A        *        
      *  !!!  WARNING  !!  CORRESPONDING CHANGE MUST BE MADE TO        *        
      *  !!!  WARNING  !!  COPYBOOK FSRD128 AS THIS CONTAINS HEADER    *        
      *  !!!  WARNING  !!  DATA TO THE DETAIL DATA IN THE FILES        *        
      *  !!!  WARNING  !!  DEFINED BY THIS LAYOUT.                     *        
      ******************************************************************        
      *  FSRD127   FASHION SALES E-COMMERCE WEEKLY SKU EXTRACT         *        
      *            LRECL = 546                                         *        
      *  THIS FILE CONTAINS THE SKU INFO, INVENTORY, SALES, AND ON     *        
      *  ORDER DATA.                                                   *        
      ******************************************************************        
      *  08/15/06  RICH KELLEN                                                  
      *          NEW COPYBOOK FOR STYLE SUMMARY; COMMA DELIMITED TO             
      *          ALLOW DATA TO BE BROUGHT INTO EXCEL OR ACCESS.                 
      *  07/03/07  SHARON SZPISZAR - STRATAGEM                                  
      *          ADDED NEW FIELD - DIRECT-SHIP-IND.                             
W34688*  08/06/09  VENKAT MALLANNAGARI - GENESIS10.                             
W34688*          ADDED NEW FIELDS- WEB-EXCLV-IND & EXT-SIZE-DESC.               
      ******************************************************************        
                                                                                
       01  FS127-ECOM-SKU-EXTRACT-RECORD.                                       
           05  FS127-CUR-WK-ENDING-DATE       PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-MERCH-DIV-CODE           PIC X(02).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-GMM-NAME                 PIC X(20).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-DMM-NMBR                 PIC X(02).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-DMM-NAME                 PIC X(20).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-BUYER-NMBR               PIC X(03).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-BUYER-NAME               PIC X(20).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-MERCH-DEPT-NMBR          PIC X(03).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-DEPT-DESC                PIC X(25).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-SUBCLASS                 PIC X(02).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-SUBCLASS-DESC            PIC X(25).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-IN-HSE-VNDR-NAME         PIC X(25).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-GROUP-CODE               PIC X(03).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-LONG-VENDOR-STYLE        PIC X(20).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-SKU                      PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-SKU-DESCRIPTION          PIC X(30).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-KY-ITM-IND               PIC X(01).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-PRD-GP-IND               PIC X(01).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-PRD-GP-NBR               PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-STATUS-CODE              PIC X(02).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-RPLNMT-IND               PIC X(01).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-SEASON-DESC              PIC X(25).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-COLOR-DESC               PIC X(10).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-SIZE-DESC                PIC X(10).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-UNIT-COST-AMT            PIC -$$$$$$$.9(02).               
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-MU-PCT                   PIC -999.9.                       
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-CUR-UNIT-RTL-AMT         PIC -$$$$$$.9(02).                
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-GP-QTY                   PIC -9(04).                       
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-GP-RTL-AMT               PIC -$$$$$$.9(02).                
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-SELL-THRU-PCT            PIC -9999.9.                      
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-CUR-SALES-UNIT-QTY       PIC -9(07).                       
           05  FILLER                          PIC X(01)  VALUE ','.            
           05  FS127-WK1-SALES-UNIT-QTY       PIC -9(07).                       
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-WK2-SALES-UNIT-QTY       PIC -9(07).                       
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-WK3-SALES-UNIT-QTY       PIC -9(07).                       
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-WK4-SALES-UNIT-QTY       PIC -9(07).                       
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-CUR-ONHAND-QTY           PIC -9(07).                       
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-WKS-ONHAND-QTY           PIC -9(09).                       
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-ON-ORD-QTY               PIC -9(07).                       
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-ORD-BGHT-DATE.                                             
               10  FS127-ORD-BGHT-MM          PIC X(02).                        
               10  FILLER                     PIC X(01)  VALUE '/'.             
               10  FS127-ORD-BGHT-YY          PIC X(02).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-YTD-SALES-UNIT-QTY       PIC -9(07).                       
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-YTD-SELL-THRU-PCT        PIC -9999.9.                      
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-FIRST-SALE-DATE          PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-LAST-SALE-DATE           PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-FIRST-RCVD-DATE          PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-LAST-RCVD-DATE           PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-MDSE-LBL-DESC            PIC X(10).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-STICKER-NBR              PIC -9(04).                       
           05  FS127-STICKER-NBR-X REDEFINES FS127-STICKER-NBR                  
                                              PIC X(5).                         
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-ASRT-BEG-DTE             PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-ASRT-END-DTE             PIC X(08).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
           05  FS127-DIRECT-SHIP-IND          PIC X(01).                        
           05  FILLER                         PIC X(01)  VALUE ','.             
W34688     05  FS127-WEB-EXCLV-IND            PIC X(01).                        
W34688     05  FILLER                         PIC X(01)  VALUE ','.             
W34688     05  FS127-EXT-SIZE-DESC            PIC X(20).                        
W34688     05  FILLER                         PIC X(01)  VALUE ','.             
