      ******************************************************************00001000
      *     FSRD120 - MERGED TUPC UNLOAD /SKU-LOC DOMAIN               *00002001
      *               LRECL = 102                                      *00003004
      ******************************************************************00004000
       01  FS120-FS-MERGED-RECORD.                                      00005002
           05  FS120-ITM-NBR               PIC  S9(15)V COMP-3.         00005105
           05  FS120-INTR-UPC-ID           PIC  S9(9) COMP.             00006002
           05  FS120-STR-NBR               PIC  S9(4) COMP.             00007702
           05  FS120-UPC-STAT-CDE          PIC   X(2).                  00007802
           05  FS120-UNT-COST-AMT          PIC  S9(7)V9(3) COMP-3.      00007902
           05  FS120-UNT-RTL-AMT           PIC  S9(7)V9(2) COMP-3.      00008002
           05  FS120-MEITGP-NBR            PIC  S9(9) COMP.             00008102
           05  FS120-STAT-CHG-DTE          PIC   X(10).                 00008202
           05  FS120-SUB-CL-MDSEAR-ID      PIC  S9(6)V COMP-3.          00008302
           05  FS120-VS-ID                 PIC  S9(9) COMP.             00008402
           05  FS120-KOHLS-SIZE-CDE        PIC  S9(9) COMP.             00008602
           05  FS120-CSTM-CLOR-DESC        PIC   X(10).                 00008702
           05  FS120-GP-CDE                PIC   X(3).                  00008802
           05  FS120-RPLNMT-IND            PIC   X(1).                  00008902
           05  FS120-KY-ITM-IND            PIC   X(1).                  00009002
           05  FS120-SEA-SEQ-NBR           PIC  S9(4) COMP.             00009102
           05  FS120-REGN-PRIC-IND         PIC   X(1).                  00009202
           05  FS120-INTR-UPC-DESC         PIC   X(30).                 00010002
