      ******************************************************************        
      *  FSRD036 - RECORD LAYOUT FOR RECEIPTS FILE.                             
      *            RECORD LENGTH - 200 BYTES.                                   
      ******************************************************************        
       01  FS036-RECEIPT-RECORD.                                                
           05  FS036-ITM-NBR              PIC S9(15)V COMP-3.                   
           05  FS036-LOC-NBR              PIC S9(04) COMP.                      
           05  FS036-PO-NBR               PIC S9(09) COMP.                      
           05  FS036-RCVR-NBR             PIC S9(09) COMP.                      
           05  FS036-RCPT-DTE.                                                  
               10  FS036-RCPT-YR          PIC X(04).                            
               10  FILLER                 PIC X(01)   VALUE '-'.                
               10  FS036-RCPT-MN          PIC X(02).                            
               10  FILLER                 PIC X(01)   VALUE '-'.                
               10  FS036-RCPT-DAY         PIC X(02).                            
           05  FS036-VRFD-DTE.                                                  
               10  FS036-VRFD-YR          PIC X(04).                            
               10  FILLER                 PIC X(01)   VALUE '-'.                
               10  FS036-VRFD-MN          PIC X(02).                            
               10  FILLER                 PIC X(01)   VALUE '-'.                
               10  FS036-VRFD-DAY         PIC X(02).                            
           05  FS036-TOT-RCPT-QTY         PIC S9(09) COMP.                      
           05  FS036-LOC-RCPT-QTY         PIC S9(09) COMP.                      
           05  FS036-BTCH-NBR             PIC X(04).                            
           05  FS036-ENRTE-IND            PIC X(01).                            
               88  FS036-INCL-ENRTE                   VALUE 'Y'.                
               88  FS036-NO-INCL-ENROUTE              VALUE 'N'.                
           05  FS036-RCPT-SRC-PGM-NM      PIC X(08).                            
           05  FILLER                     PIC X(141).                           
      ******************************************************************        
