      ******************************************************************        
      *     FSRD131 - MERGED TSKST UNLOAD/TUPC UNLOAD FOR              *        
      *               ZERO SALES REPORTING                             *        
      *               LRECL = 071                                      *        
      ******************************************************************        
       01  FS131-FS-MERGED-RECORD.                                              
           05  FS131-ITEM-NMBR             PIC  S9(15)V    COMP-3.              
           05  FS131-INTR-UPC-ID           PIC  S9(9)      COMP.                
           05  FS131-LOC-NBR               PIC  S9(4)      COMP.                
           05  FS131-UPC-STAT-CDE          PIC   X(2).                          
           05  FS131-VS-ID                 PIC  S9(9)      COMP.                
           05  FS131-INTR-UPC-DESC         PIC   X(30).                         
           05  FS131-LAST-SALE-DATE        PIC  S9(7)V     COMP-3.              
           05  FS131-LAST-RCVD-DATE        PIC  S9(7)V     COMP-3.              
           05  FS131-ONHAND-QTY            PIC  S9(7)V     COMP-3.              
           05  FS131-UNT-RTL-AMT           PIC  S9(7)V9(2) COMP-3.              
           05  FS131-KOHLS-SIZE-CDE        PIC  S9(9)      COMP.                
