      * ****************************************************************        
      *             FSRD066  RCP SKU LIST RECORD                       *        
KP1005*                     LRECL = 71                                 *        
KP1005*                                                                *        
KP1005* NOTE:  THIS FORMAT IS THE SAME AS COPYBOOK IMRD093             *        
KP1005*                                                                *        
KP1005* WR29571 10-31-2005 K PETERSON  CHANGES REQUIRED FOR MARKDOWN   *        
KP1005*                                OTIMIZATION                     *        
      * ****************************************************************        
                                                                                
       01  FS066-RCP-SKU-LIST-REC.                                              
           05  FS066-ITM-NBR                PIC S9(15)V COMP-3.                 
           05  FS066-STR-LVL-STAT-CDE       PIC X(2).                           
           05  FS066-SUM-LVL-CDE            PIC X(1).                           
           05  FS066-SKU                    PIC S9(08)V COMP-3.                 
           05  FS066-INTR-UPC-ID            PIC S9(09) COMP.                    
           05  FS066-UNT-RTL-AMT            PIC S9(07)V9(02) COMP-3.            
           05  FS066-STR-NBR                PIC S9(04) COMP.                    
           05  FS066-TICKET-COLOR           PIC X(1).                           
           05  FS066-SKU-LVL-STAT-CDE       PIC X(2).                           
           05  FS066-UNT-RTL-CHG-DTE        PIC X(10).                          
           05  FS066-STAT-CHG-DTE           PIC X(10).                          
KP1005     05  FS066-ORIG-CLR-DTE           PIC X(10).                          
KP1005     05  FS066-MKDN-CDE               PIC X(01).                          
           05  FILLER                       PIC X(10).                          
