*****************************************************************************   
**********FIRE FIRE FIRE FIRE FIRE FIRE FIRE FIRE FIRE FIRE FIRE FIRE********   
*****************************************************************************   
       01  FSHOT-FIRE-FILE.                                                     
           05  FSHOT-SKU.                                                       
               10  FSHOT-MERCH-DEPT-NMBR  PIC X(03).                            
               10  FSHOT-MERCH-CLASS-NMBR PIC X(02).                            
               10  FSHOT-SEQ-NMBR         PIC X(03).                            
           05  FSHOT-CUR-UNIT-RTL-AMT     PIC S9(5)V9(2) COMP-3.                
           05  FSHOT-UNIT-COST-AMT        PIC S9(4)V9(3) COMP-3.                
           05  FSHOT-STATUS-CODE          PIC S9(3)V COMP-3.                    
           05  FSHOT-ITEM-NMBR            PIC S9(15)V COMP-3.                   
           05  FSHOT-STORE-NMBR           PIC X(3).                             
           05  FSHOT-ONHAND-QTY           PIC S9(7)V COMP-3.                    
           05  FILLER                     PIC X(47).                            
