      ******************************************************************        
      *  !!!  WARNING  !!  THIS COPYBOOK MUST BE KEPT IN SYNC WITH     *        
      *  !!!  WARNING  !!  FSRD125                                     *        
      ******************************************************************        
      *  FSRD126   FASHION SALES E-COMMERCE WEEKLY SKU EXTRACT         *        
      *            LRECL = 300                                         *        
      *  THIS FILE CONTAINS THE SKU INFO, INVENTORY, SALES, AND ON     *        
      *  ORDER DATA USED TO CREATE THE STYLE SUMMARY REPORTS.          *        
      ******************************************************************        
      *  02/15/05  BOB FORD                                                     
      *          NEW COPYBOOK FOR STYLE SUMMARY RE-WRITE; CLONE OF              
      *          FSRD103 WITH ALPHA STORE REMOVED, NBR-STORES MOVED TO          
      *          END OF RECORD, LOC-NBR CHANGED TO PIC 9(5).                    
      *  07/03/07  SHARON SZPISZAR - STRATAGEM                                  
      *          ADDED NEW FIELD - DIRECT-SHIP-IND.                             
W34688*  08/06/09  VENKAT MALLANNAGARI - GENESIS10.                             
W34688*          ADDED NEW FIELDS- WEB-EXCLV-IND & KOHLS-SIZE-CDE.              
      ******************************************************************        
                                                                                
       01  FS126-ECOM-SKU-EXTRACT-RECORD.                                       
           05  FS126-DMM-NMBR                 PIC X(02).                        
           05  FS126-BUYER-NMBR               PIC X(03).                        
           05  FS126-MERCH-DEPT-NMBR          PIC X(03).                        
           05  FS126-SUBCLASS                 PIC X(02).                        
           05  FS126-SKU                      PIC X(08).                        
           05  FS126-MAJOR-CLASS              PIC X(02).                        
           05  FS126-GROUP-CODE               PIC X(03).                        
           05  FS126-LONG-VENDOR-STYLE        PIC X(20).                        
           05  FS126-STATUS-CODE              PIC X(02).                        
           05  FS126-SKU-DESCRIPTION          PIC X(30).                        
           05  FS126-UNIT-COST-AMT            PIC S9(07)V9(03) COMP-3.          
           05  FS126-CUR-UNIT-RTL-AMT         PIC S9(05)V9(02) COMP-3.          
           05  FS126-GP-QTY                   PIC S9(04)       COMP.            
           05  FS126-GP-RTL-AMT               PIC S9(05)V9(02) COMP-3.          
           05  FS126-STICKER-NBR              PIC S9(04)       COMP.            
           05  FS126-IN-HSE-VNDR-NAME         PIC X(25).                        
           05  FS126-COLOR-DESC               PIC X(10).                        
           05  FS126-SIZE-DESC                PIC X(10).                        
           05  FS126-CUR-ONHAND-QTY           PIC S9(07)       COMP-3.          
           05  FS126-LAST-RCVD-DATE           PIC S9(07)       COMP-3.          
           05  FS126-YTD-SALES-UNIT-QTY       PIC S9(07)       COMP-3.          
           05  FS126-WEEKLY-SALES.                                              
               10  FS126-CUR-WK-ENDING-DATE   PIC  9(06).                       
               10  FS126-CUR-SALES-UNIT-QTY   PIC S9(07)       COMP-3.          
               10  FS126-WK1-SALES-UNIT-QTY   PIC S9(07)       COMP-3.          
               10  FS126-WK2-SALES-UNIT-QTY   PIC S9(07)       COMP-3.          
               10  FS126-WK3-SALES-UNIT-QTY   PIC S9(07)       COMP-3.          
               10  FS126-WK4-SALES-UNIT-QTY   PIC S9(07)       COMP-3.          
               10  FS126-WK5-SALES-UNIT-QTY   PIC S9(07)       COMP-3.          
           05  FS126-ONORDER-INFO.                                              
               10  FS126-ON-ORD-QTY           PIC S9(07)       COMP-3.          
               10  FS126-ORD-BGHT-DATE.                                         
                   15  FS126-ORD-BGHT-YY      PIC X(02).                        
                   15  FS126-ORD-BGHT-MM      PIC X(02).                        
           05  FS126-ITEM-NMBR                PIC S9(15)V      COMP-3.          
           05  FS126-RPLNMT-IND               PIC X(01).                        
           05  FS126-FIRST-RCVD-DATE          PIC S9(7)V       COMP-3.          
           05  FS126-FIRST-SALE-DATE          PIC S9(7)V       COMP-3.          
           05  FS126-LAST-SALE-DATE           PIC S9(7)V       COMP-3.          
           05  FILLER                         PIC X(02).                        
           05  FS126-KY-ITM-IND               PIC X(01).                        
           05  FS126-SEA-SEQ-NBR              PIC S9(04)       COMP.            
           05  FS126-HNG-FLD-SEQ-NBR          PIC S9(04)       COMP.            
           05  FS126-LBL-SEQ-NBR              PIC S9(04)       COMP.            
           05  FS126-MERCH-DIV-CODE           PIC X(02).                        
           05  FS126-FS-RPT-IND               PIC X(01).                        
           05  FS126-STAT-CHNGD-DATE          PIC S9(07)V      COMP-3.          
           05  FS126-RECORD-INDICATOR         PIC X(02).                        
           05  FS126-RCP-STATUS-CODE          PIC X(02).                        
           05  FILLER                         PIC X(02).                        
           05  FS126-LOC-NBR                  PIC 9(05).                        
           05  FS126-EBUS-LOC-IND             PIC X(01).                        
           05  FS126-E-COMMERCE-INFO.                                           
               10  FS126-PRD-GP-IND           PIC X(01).                        
               10  FS126-PRD-GP-NBR           PIC X(08).                        
               10  FS126-ASRT-BEG-DTE         PIC X(10).                        
               10  FS126-ASRT-END-DTE         PIC X(10).                        
           05  FS126-NBR-STORES               PIC S9(5)        COMP-3.          
           05  FS126-DIRECT-SHIP-IND          PIC X(01).                        
W34688     05  FS126-WEB-EXCLV-IND            PIC X(01).                        
W34688     05  FS126-KOHLS-SIZE-CDE           PIC S9(09)       COMP.            
W34688     05  FILLER                         PIC X(25).                        
