      ******************************************************************        
      *  FSRD035 - RECORD LAYOUT FOR ADJUSTMENTS FILE.                          
      *            RECORD LENGTH - 200 BYTES.                                   
      ******************************************************************        
       01  FS035-ADJUSTMENT-RECORD.                                             
           05  FS035-ITM-NBR              PIC S9(15)V COMP-3.                   
           05  FS035-LOC-NBR              PIC S9(04) COMP.                      
           05  FS035-ADJ-TYP              PIC X(03).                            
               88  FS035-OH-ADJ                         VALUE IS '121'.         
               88  FS035-RCPT-ADJ                       VALUE IS '123'.         
OCFSFS         88  FS035-SFS-ADJ                        VALUE IS '125'.         
               88  FS035-OH-ADJ-ONLY                    VALUE IS '143'.         
           05  FS035-ACTN-CDE             PIC X(01).                            
               88  FS035-ACTN-PLS                       VALUE IS '+'.           
               88  FS035-ACTN-NEG                       VALUE IS '-'.           
               88  FS035-ACTN-REPL                      VALUE IS 'R'.           
           05  FS035-ADJ-QTY              PIC S9(09) COMP.                      
           05  FS035-BTCH-NBR             PIC X(04).                            
           05  FS035-UNT-BKG-IND          PIC X(01).                            
           05  FS035-ADJ-SRC-PGM-NM       PIC X(08).                            
           05  FILLER                     PIC X(169).                           
      ******************************************************************        
