      * ****************************************************************        
      *             FSRD065   FASHION SALES RCP SKU LIST RECORD        *        
      *                     LRECL = 250                                *        
      * ****************************************************************        
                                                                                
       01  FS065-RCP-SKU-LIST-REC.                                              
           05  FS065-ITM-NBR                PIC  S9(15)V COMP-3.                
           05  FS065-STR-LVL-STAT-CDE       PIC   X(2).                         
           05  FS065-SUM-LVL-CDE            PIC   X(1).                         
           05  FS065-DIST-NBR               PIC   X(2).                         
           05  FS065-OH-QTY                 PIC  S9(9) COMP.                    
           05  FS065-OH-AMT                 PIC  S9(9)V9(2) COMP-3.             
           05  FS065-ONORD-QTY              PIC  S9(9) COMP.                    
           05  FS065-ONORD-AMT              PIC  S9(9)V9(2) COMP-3.             
           05  FS065-ENTRE-QTY              PIC  S9(9) COMP.                    
           05  FS065-ENTRE-AMT              PIC  S9(9)V9(2) COMP-3.             
           05  FS065-SUN-SIS-QTY            PIC  S9(9) COMP.                    
           05  FS065-SUN-SIS-AMT            PIC  S9(9)V9(2) COMP-3.             
           05  FS065-MON-SIS-QTY            PIC  S9(9) COMP.                    
           05  FS065-MON-SIS-AMT            PIC  S9(9)V9(2) COMP-3.             
           05  FS065-TUE-SIS-QTY            PIC  S9(9) COMP.                    
           05  FS065-TUE-SIS-AMT            PIC  S9(9)V9(2) COMP-3.             
           05  FS065-WED-SIS-QTY            PIC  S9(9) COMP.                    
           05  FS065-WED-SIS-AMT            PIC  S9(9)V9(2) COMP-3.             
           05  FS065-THU-SIS-QTY            PIC  S9(9) COMP.                    
           05  FS065-THU-SIS-AMT            PIC  S9(9)V9(2) COMP-3.             
           05  FS065-FRI-SIS-QTY            PIC  S9(9) COMP.                    
           05  FS065-FRI-SIS-AMT            PIC  S9(9)V9(2) COMP-3.             
           05  FS065-SAT-SIS-QTY            PIC  S9(9) COMP.                    
           05  FS065-SAT-SIS-AMT            PIC  S9(9)V9(2) COMP-3.             
           05  FS065-PWK-SUN-SIS-QTY        PIC  S9(9) COMP.                    
           05  FS065-PWK-SUN-SIS-AMT        PIC  S9(9)V9(2) COMP-3.             
           05  FS065-PWK-MON-SIS-QTY        PIC  S9(9) COMP.                    
           05  FS065-PWK-MON-SIS-AMT        PIC  S9(9)V9(2) COMP-3.             
           05  FS065-PWK-TUE-SIS-QTY        PIC  S9(9) COMP.                    
           05  FS065-PWK-TUE-SIS-AMT        PIC  S9(9)V9(2) COMP-3.             
           05  FS065-PWK-WED-SIS-QTY        PIC  S9(9) COMP.                    
           05  FS065-PWK-WED-SIS-AMT        PIC  S9(9)V9(2) COMP-3.             
           05  FS065-PWK-THU-SIS-QTY        PIC  S9(9) COMP.                    
           05  FS065-PWK-THU-SIS-AMT        PIC  S9(9)V9(2) COMP-3.             
           05  FS065-PWK-FRI-SIS-QTY        PIC  S9(9) COMP.                    
           05  FS065-PWK-FRI-SIS-AMT        PIC  S9(9)V9(2) COMP-3.             
           05  FS065-PWK-SAT-SIS-QTY        PIC  S9(9) COMP.                    
           05  FS065-PWK-SAT-SIS-AMT        PIC  S9(9)V9(2) COMP-3.             
           05  FS065-IN-TRNST-QTY           PIC  S9(9) COMP.                    
           05  FS065-IN-TRNST-AMT           PIC  S9(9)V9(2) COMP-3.             
           05  FS065-SKU                    PIC S9(08)V COMP-3.                 
           05  FS065-INTR-UPC-ID            PIC S9(09) COMP.                    
           05  FS065-UNT-RTL-AMT            PIC S9(07)V9(02) COMP-3.            
           05  FS065-STR-NBR                PIC S9(04) COMP.                    
           05  FS065-TICKET-COLOR           PIC X(06).                          
           05  FS065-SKU-LVL-STAT-CDE       PIC   X(2).                         
           05  FS065-UNT-RTL-CHG-DTE        PIC X(10).                          
           05  FS065-STAT-CHG-DTE           PIC X(10).                          
           05  FILLER                       PIC X(13).                          
