      ******************************************************************00001000
      *     FSRD122 - MERGED TSKST UNLOAD/TUPC UNLOAD/SKU-LOC DOMAIN   *00002000
      *               LRECL = 126                                      *00003000
      ******************************************************************00004000
       01  FS122-FS-MERGED-RECORD.                                      00005000
           05  FS122-ITEM-NMBR             PIC  S9(15)V COMP-3.         00005100
           05  FS122-INTR-UPC-ID           PIC  S9(9) COMP.             00005200
           05  FS122-LOC-NBR               PIC  S9(4) COMP.             00005300
           05  FS122-UPC-STAT-CDE          PIC   X(2).                  00005400
           05  FS122-UNT-COST-AMT          PIC  S9(7)V9(3) COMP-3.      00005500
           05  FS122-UNT-RTL-AMT           PIC  S9(7)V9(2) COMP-3.      00005600
           05  FS122-MEITGP-NBR            PIC  S9(9) COMP.             00005700
           05  FS122-STAT-CHG-DTE          PIC   X(10).                 00005800
           05  FS122-SUB-CL-MDSEAR-ID      PIC  S9(6)V COMP-3.          00005900
           05  FS122-VS-ID                 PIC  S9(9) COMP.             00006000
           05  FS122-KOHLS-SIZE-CDE        PIC  S9(9) COMP.             00007000
           05  FS122-CSTM-CLOR-DESC        PIC   X(10).                 00008000
           05  FS122-GP-CDE                PIC   X(3).                  00008100
           05  FS122-RPLNMT-IND            PIC   X(1).                  00008200
           05  FS122-KY-ITM-IND            PIC   X(1).                  00008300
           05  FS122-SEA-SEQ-NBR           PIC  S9(4) COMP.             00008400
           05  FS122-REGN-PRIC-IND         PIC   X(1).                  00008500
           05  FS122-INTR-UPC-DESC         PIC   X(30).                 00008600
           05  FS122-LAST-SALE-DATE        PIC  S9(7)V COMP-3.          00008700
           05  FS122-LAST-RCVD-DATE        PIC  S9(7)V COMP-3.          00008800
           05  FS122-ONHAND-QTY            PIC  S9(7)V COMP-3.          00008900
           05  FS122-FIRST-RCVD-DATE       PIC  S9(7)V COMP-3.          00009000
           05  FS122-FIRST-SALE-DATE       PIC  S9(7)V COMP-3.          00010000
           05  FS122-YTD-SALES-UNIT-QTY    PIC  S9(7)V COMP-3.          00020000
           05  FS122-FOUND-ON-TSKST-IND    PIC   X(1).                  00030000
