00001 *                                                                 06/06/91
00002 *  THIS IS THE RECORD DEFINITION FOR THE MAINTENANCE LOG OF       FSRD500I
00003 *  THE MERCHANDISING SYSTEM.  THE RECORD LENGTH IS 160 BYTES.        LV002
00004 *                                                                 FSRD500I
00005  01  FS500I-MAINTENANCE-LOG-RECORD.                               FSRD500I
00006      05  FS500I-TRANSACTION-DATE    PIC 9(6)       VALUE ZERO.    FSRD500I
00007      05  FILLER                     REDEFINES                     FSRD500I
00008                                         FS500I-TRANSACTION-DATE.  FSRD500I
00009          10  FS500I-TRANSACTION-YEAR                              FSRD500I
00010                                     PIC 9(2).                     FSRD500I
00011          10  FS500I-TRANSACTION-MONTH                             FSRD500I
00012                                     PIC 9(2).                     FSRD500I
00013          10  FS500I-TRANSACTION-DAY PIC 9(2).                     FSRD500I
00014      05  FS500I-TRANSACTION-TIME    PIC 9(6)       VALUE ZERO.    FSRD500I
00015      05  FILLER                     REDEFINES                     FSRD500I
00016                                         FS500I-TRANSACTION-TIME.  FSRD500I
00017          10  FS500I-TRANSACTION-HOUR                              FSRD500I
00018                                     PIC 9(2).                     FSRD500I
00019          10  FS500I-TRANSACTION-MINUTE                            FSRD500I
00020                                     PIC 9(2).                     FSRD500I
00021          10  FS500I-TRANSACTION-SECOND                            FSRD500I
00022                                     PIC 9(2).                     FSRD500I
00023      05  FS500I-PROGRAM-NAME        PIC X(8)       VALUE SPACES.  FSRD500I
00024      05  FS500I-TRANSACTION-ID      PIC X(4)       VALUE SPACES.  FSRD500I
00025      05  FS500I-TABLE-ID            PIC 9(2)       VALUE ZERO.    FSRD500I
00026          88  FS500I-TSK-TABLE                      VALUE 01.      FSRD500I
00027          88  FS500I-TSKST-TABLE                    VALUE 02.      FSRD500I
00028          88  FS500I-TUPCSKU-TABLE                  VALUE 03.         CL**2
00029      05  FS500I-TABLE-KEY-VALUE     PIC X(17)      VALUE SPACES.  FSRD500I
00030      05  FS500I-TSK-KEY-VALUE       REDEFINES                     FSRD500I
00031                                         FS500I-TABLE-KEY-VALUE.   FSRD500I
00032          10  FS500I-TSK-DEPT        PIC 9(3).                     FSRD500I
00033          10  FS500I-TSK-CLASS       PIC 9(2).                     FSRD500I
00034          10  FS500I-TSK-SEQ         PIC 9(3).                     FSRD500I
00035          10  FILLER                 PIC X(9).                     FSRD500I
00036      05  FS500I-TSKST-KEY-VALUE     REDEFINES                     FSRD500I
00037                                         FS500I-TABLE-KEY-VALUE.   FSRD500I
00038          10  FS500I-TSKST-DEPT      PIC 9(3).                     FSRD500I
00039          10  FS500I-TSKST-CLASS     PIC 9(2).                     FSRD500I
00040          10  FS500I-TSKST-SEQ       PIC 9(3).                     FSRD500I
00041          10  FS500I-TSKST-STORE     PIC 9(3).                     FSRD500I
00042          10  FILLER                 PIC X(6).                     FSRD500I
00043      05  FS500I-TUPCSKU-KEY-VALUE   REDEFINES                        CL**2
00044                                         FS500I-TABLE-KEY-VALUE.      CL**2
00045          10  FS500I-TUPCSKU-DEPT    PIC 9(3).                        CL**2
00046          10  FS500I-TUPCSKU-CLASS   PIC 9(2).                        CL**2
00047          10  FS500I-TUPCSKU-SEQ     PIC 9(3).                        CL**2
00048          10  FS500I-TUPCSKU-UPC     PIC S9(15)     COMP-3.           CL**2
00049          10  FILLER                 PIC X(1).                        CL**2
00043      05  FS500I-TSKXREF-KEY-VALUE   REDEFINES                        CL**2
00044                                         FS500I-TABLE-KEY-VALUE.      CL**2
00045          10  FS500I-TSKXREF-DEPT    PIC S9(4)      COMP-3.           CL**2
00046          10  FS500I-TSKXREF-CLASS   PIC S9(4)      COMP-3.           CL**2
00047          10  FS500I-TSKXREF-SUBCLASS                                 CL**2
00047                                     PIC S9(4)      COMP-3.           CL**2
00049          10  FS500I-TSKXREF-ITM-NBR PIC S9(15)     COMP-3.           CL**2
00050      05  FS500I-USER-ID             PIC X(8)       VALUE SPACES.  FSRD500I
00051      05  FS500I-TERMINAL-ID         PIC X(4)       VALUE SPACES.  FSRD500I
00052      05  FS500I-FUNCTION-CODE       PIC X(1)       VALUE SPACES.  FSRD500I
00053          88  FS500I-ADD-CODE                       VALUE 'A'.     FSRD500I
00054          88  FS500I-CHANGE-CODE                    VALUE 'C'.     FSRD500I
00055          88  FS500I-DELETE-CODE                    VALUE 'D'.     FSRD500I
00056      05  FS500I-OUTPUT-MESSAGE-AREA.                              FSRD500I
00057          10  FS500I-OUTPUT-MESSAGE-SEQ                            FSRD500I
00058                                     PIC 9(2)       VALUE ZERO.    FSRD500I
00059          10  FS500I-OUTPUT-MESSAGE  PIC X(102)     VALUE SPACES.  FSRD500I
           05  FS500I-INTR-UPC-ID1        PIC 9(10).                            
           05  FS500I-NI-SKU              PIC 9(8).                             
           05  FS500I-INTR-UPC-ID2        PIC S9(9)      COMP.                  
