00001 *----------------------------------------------------------------*08/17/93
00002 *                         FSWS002                                *FSWS002 
00003 *                                                                *   LV003
00004 *   THIS IS TS QUEUE RECORD LAYOUT USED BY FS LIST PROGRAMS TO   *FSWS002 
00005 *   PASS THE KEYS.                                               *FSWS002 
00006 *   2/02 CHANGE SEQ TO NEW SKU                                   *FSWS002 
00007 *----------------------------------------------------------------*FSWS002 
00008                                                                   FSWS002 
00009  01  FS002-TS-SEL-REC.                                               CL**2
00010        05  FS002-SELECTED-ITEMS       PIC S9(05)  COMP-3             CL**2
00011                                                   VALUE ZERO.     FSWS002 
00012        05  FS002-MAX-ITEMS            PIC  9(02)  VALUE 20.          CL**2
00013        05  FS002-SELECTED-ITEM-ARRAY.                                CL**2
00014            10  FILLER                 OCCURS 20 TIMES             FSWS002 
00015                                       INDEXED BY FS002-IDX.          CL**2
00016                15  FS002-ITEM         PIC S9(09)  COMP-3.            CL**2
00017                15  FS002-ACTION-SW    PIC  X(03).                    CL**2
00018                    88  FS002-INQ                  VALUE 'INQ'.       CL**2
00019                    88  FS002-UPD                  VALUE 'UPD'.       CL**2
00020                    88  FS002-DEL                  VALUE 'DEL'.       CL**2
00021                    88  FS002-ERR                  VALUE 'ERR'.       CL**2
00022                15  FS002-KEY-DATA.                                   CL**2
                         20  FS002-DEPT-NMBR  PIC X(03).                        
                         20  FS002-CLASS-NMBR PIC X(02).                        
                         20  FS002-SKU-NMBR   PIC X(08).                        
00026                    20  FS002-STORE-NMBR PIC X(05).                   CL**2
00026                    20  FS002-STORE-NMBR-9 REDEFINES                  CL**2
00026                        FS002-STORE-NMBR PIC 9(05).                   CL**2
00027                15  FS002-ITEM-NMBR      PIC S9(15) COMP-3.           CL**2
00028                15  FS002-UPC-NMBR       PIC S9(15) COMP-3.           CL**2
