      ******************************************************************        
      **                        FSWS007                               **        
      **                                                              **        
      **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT SELECTION LIST**        
      **  FOR VENDOR NAME AND METRO AREA                              **        
      **  LENGTH:  200 BYTES                                          **        
      ******************************************************************        
               10  FS007-INTER-APPL-COMMAREA  REDEFINES                         
                   CA-FASHION-SALES-COMMAREA.                                   
                   15  FILLER                         PIC X(01).                
                   15  FS007-VENDOR-SELECT.                                     
                       20  FS007-DEPT-NUMBER          PIC X(03).                
                       20  FS007-VENDOR-NUMBER        PIC X(03).                
                       20  FS007-VENDOR-NAME          PIC X(30).                
                       20  FS007-VENDOR-TYPE          PIC X(02).                
                   15  FS007-METRO-SELECT.                                      
                       20  FS007-METRO-NUMBER         PIC X(03).                
                       20  FS007-METRO-NAME           PIC X(25).                
                   15  FS007-VENDOR-SELECT-1.                                   
                       20  FS007-VENDOR-ENT-ID        PIC S9(09)  COMP.         
                   15  FILLER                         PIC X(129).               
