000100******************************************************************        
000200*    COPY MEMBER:  GVRD000                       LRECL = 60      *        
000300*                                                                *        
000400*    THIS MEMBER IS USED AS THE FILE LAYOUT FOR SENDING          *        
000500*    INVENTORY ADJUSTMENTS TO GIV                                *        
000600*                                                                *        
000600*    THIS COPY BOOK IS REPLICA OF OFRD010                        *        
001200******************************************************************        
001300 01  GV000-PCT-INTRANSIT-REC.                                             
001400     05  GV000-INTR-UPC-ID          PIC  S9(9) COMP  VALUE ZEROS.         
002800     05  GV000-STR-NBR              PIC  S9(4) COMP  VALUE ZEROS.         
002900     05  GV000-TRN-TYP-CDE          PIC  X(02)       VALUE SPACES.        
003000         88 GV000-STORE-VRFY-RECEIPT   VALUE 'AR'.                        
003100         88 GV000-CNTL-STOCK-RECEIPT   VALUE 'CS'.                        
003200         88 GV000-STORE-VRFY-ADJ       VALUE 'VA'.                        
003300         88 GV000-SHIPPD-DC            VALUE 'SH'.                        
003400         88 GV000-UNLOAD-ST            VALUE 'UN'.                        
003500     05  GV000-IN-TRNST-QTY         PIC  S9(9) COMP  VALUE ZEROS.         
003700     05  GV000-PO-NBR               PIC  S9(9) COMP  VALUE ZEROS.         
003800     05  GV000-RCVR-SEQ-NBR         PIC  S9(9) COMP  VALUE ZEROS.         
004000     05  GV000-STAT-CDE-DS          PIC  9(01).                           
004100         88  GV000-SHIPPED-FROM-DC           VALUE 1.                     
004200         88  GV000-NOT-SHIPPED-FROM-DC       VALUE 0.                     
004300     05  GV000-STAT-CDE-SU            PIC  9(01).                         
004400         88  GV000-UNLOADED-AT-STORE         VALUE 1.                     
004500         88  GV000-NOT-UNLOADED-AT-STORE     VALUE 0.                     
004600     05  GV000-TRN-CLSN-CDE         PIC  X(02).                           
004700         88  GV000-TRN-IN-TRANSIT            VALUE 'IT'.                  
004800         88  GV000-TRN-STR-EXPECTED          VALUE 'SE'.                  
004900     05  GV000-UPC-NBR              PIC S9(15)V.                          
003800     05  GV000-TRN-LNE-NBR          PIC  S9(9) COMP  VALUE ZEROS.         
003800     05  GV000-OTB-TYP-CDE          PIC  X(2)        VALUE SPACES.        
006500     05  FILLER                     PIC  X(15)       VALUE SPACES.        
