      ***************************************************************** 00010001
      * COPYBOOK FOR MERCHANDISE HIERARCHY DATA INTEGRITY               00020001
      *       RMS COPYBOOK                                              00021007
      ***************************************************************** 00030001
      * CORRESPONDING CHANGES MAY NEED TO BE MADE IN HMRD002 AND        00030101
      * HMRD004.                                                        00030201
      ***************************************************************** 00030301
       01 HM003-MBS-RMS-INTG-REC.                                       00030403
          05  HM003-HIER-LVL        PIC X(03).                          00030603
          05  HM003-GMA-NBR         PIC 9(04).                          00030705
          05  HM003-DMA-NBR         PIC 9(04).                          00030805
          05  HM003-DEPT-NBR        PIC 9(04).                          00031005
          05  HM003-MAJ-CL-NBR      PIC 9(04).                          00031105
          05  HM003-SUB-CL-NBR      PIC 9(04).                          00032005
          05  HM003-DKEY            PIC 9(06).                          00034003
          05  FILLER                PIC X(30).                          00035003
                                                                        00036001
