      ***************************************************************** 00010001
      * COPYBOOK FOR MERCHANDISE HIERARCHY DATA INTEGRITY               00020001
      *      MBS COPYBOOK                                               00021010
      ***************************************************************** 00030001
      * CORRESPONDING CHANGES MAY NEED TO BE MADE IN HMRD003 AND        00030103
      * HMRD004.                                                        00030203
      ***************************************************************** 00030303
       01 HM002-MBS-RMS-INTG-REC.                                       00031005
          05  HM002-HIER-LVL        PIC X(03).                          00033005
          05  HM002-GMA-NBR         PIC 9(04).                          00033108
          05  HM002-DMA-NBR         PIC 9(04).                          00034008
          05  HM002-DEPT-NBR        PIC 9(04).                          00036008
          05  HM002-MAJ-CL-NBR      PIC 9(04).                          00037008
          05  HM002-SUB-CL-NBR      PIC 9(04).                          00038008
          05  HM002-DKEY            PIC 9(06).                          00039105
          05  FILLER                PIC X(30).                          00039205
                                                                        00040001
