000001******************************************************************        
000002*        MERCHANDISE HIERARCHY DATA INTEGRITY                             
000003*                                                                         
000004*TABLE FOR THE MERCHANDISE HIERARCHY DATA INTEGRITY ERROR MESSAGE.        
000005*IT IS INDEXED BY THE MESSAGE NUMBER.                                     
000006*                                                                         
000007* ***NOTE: WHEN ADDING MESSAGES TO THIS TABLE, THE OCCURS CLAUSE          
000008*          MUST ALSO BE INCREMENTED.                                      
000009******************************************************************        
000010 01  EM-ERR-MSG-TBL-VALUES.                                               
000020     05  EM-MSG-NBR-01           PIC 9(03) VALUE 01.                      
000030     05  FILLER                  PIC X(75) VALUE                          
000040     'MISSING GMA ROW.'.                                                  
000050                                                                          
000060     05  EM-MSG-NBR-02           PIC 9(03) VALUE 02.                      
000070     05  FILLER                  PIC X(75) VALUE                          
000071     'MISSING DMA ROW.'.                                                  
000072                                                                          
000073     05  EM-MSG-NBR-03           PIC 9(03) VALUE 03.                      
000074     05  FILLER                  PIC X(75) VALUE                          
000080     'MISSING DPT ROW.'.                                                  
000081                                                                          
000073     05  EM-MSG-NBR-04           PIC 9(03) VALUE 04.                      
000091     05  FILLER                  PIC X(75) VALUE                          
000092     'MISSING MCL ROW.'.                                                  
000093                                                                          
000094     05  EM-MSG-NBR-05           PIC 9(03) VALUE 05.                      
000095     05  FILLER                  PIC X(75) VALUE                          
000096     'MISSING SCL ROW.'.                                                  
000097                                                                          
000098     05  EM-MSG-NBR-06           PIC 9(03) VALUE 06.                      
000099     05  FILLER                  PIC X(75) VALUE                          
000100     'DPT ROW HAS NO MATCHING ROW ON TMDSEDP.'.                           
000101                                                                          
000102     05  EM-MSG-NBR-07           PIC 9(03) VALUE 07.                      
000103     05  FILLER                  PIC X(75) VALUE                          
000104     'DPT ROW HAS NO MATCHING ROW ON TDPTSHK.'.                           
000105                                                                          
000106     05  EM-MSG-NBR-08           PIC 9(03) VALUE 08.                      
000107     05  FILLER                  PIC X(75) VALUE                          
000108     'GMA ROW HAS NO MATCHING ROW ON TMDSECL.'.                           
000109                                                                          
000131     05  EM-MSG-NBR-09           PIC 9(03) VALUE 09.                      
000132     05  FILLER                  PIC X(75) VALUE                          
000133     'GMA ROW HAS NO MATCHING GMM ROW ON TRSPBAR.'.                       
000134                                                                          
000136     05  EM-MSG-NBR-10           PIC 9(03) VALUE 10.                      
000137     05  FILLER                  PIC X(75) VALUE                          
000138     'DMA ROW HAS NO MATCHING DMM ROW ON TRSPBAR.'.                       
000136     05  EM-MSG-NBR-11           PIC 9(03) VALUE 11.                      
000137     05  FILLER                  PIC X(75) VALUE                          
000138     'DPT ROW HAS NO MATCHING BYR ROW ON TRSPBAR.'.                       
000136     05  EM-MSG-NBR-12           PIC 9(03) VALUE 12.                      
000137     05  FILLER                  PIC X(75) VALUE                          
000138     'DEPS ROW HAS NO MATCHING ROW ON K_EMT_DEPS_ATTRIBUTES.'.            
000136     05  EM-MSG-NBR-13           PIC 9(03) VALUE 13.                      
000137     05  FILLER                  PIC X(75) VALUE                          
000138     'CLASS ROW HAS NO MATCHING ROW ON K_EMT_CLASS_ATTRIBUTES.'.          
000136     05  EM-MSG-NBR-14           PIC 9(03) VALUE 14.                      
000137     05  FILLER                  PIC X(75) VALUE                          
000138     'SCLASS HAS NO MATCHING ROW ON K_EMT_SUBCLASS_ATTRIBUTES.'.          
000136     05  EM-MSG-NBR-15           PIC 9(03) VALUE 15.                      
000137     05  FILLER                  PIC X(75) VALUE                          
000138     'MERCHANDISE AREA IS ON MBS ONLY.'.                                  
000136     05  EM-MSG-NBR-16           PIC 9(03) VALUE 16.                      
000137     05  FILLER                  PIC X(75) VALUE                          
000138     'MERCHANDISE AREA IS ON RMS ONLY.'.                                  
000139                                                                          
000175 01  EM-ERR-MSG-TBL              REDEFINES                                
000180     EM-ERR-MSG-TBL-VALUES.                                               
000200     05  EM-ERR-MSG-TBL-ENTRY    OCCURS 15                                
000210                                 INDEXED BY EM-IDX.                       
000300         10  EM-MSG-NBR          PIC 9(03).                               
000400         10  EM-MSG-TEXT         PIC X(75).                               
