      *---------------------------------------------------------------*         
      *                                                               *         
      *    HMRD009 - MERCHANDISE HIERARCHY DOMAIN EXTRACT COPYBOOK    *         
      *              MAJOR CLASS LEVEL DATA                           *         
      *    LENGTH  - 42 BYTES                                         *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   --------     -----------------------------      *         
      *    WR24087    08/23/2002   INITIAL DEVELOPMENT                *         
      *---------------------------------------------------------------*         
       01  HMRD009-RECORD.                                                      
           05  HM009-DEPT-NBR               PIC 9(04).                          
           05  FILLER                       PIC X(02).                          
           05  HM009-MAJ-CL-NBR             PIC 9(04).                          
           05  FILLER                       PIC X(02).                          
           05  HM009-MAJ-CL-NM              PIC X(20).                          
