      *---------------------------------------------------------------*         
      *                                                               *         
      *    HMRD012 - MERCHANDISE HIERARCHY DOMAIN EXTRACT COPYBOOK    *         
      *              BUSINESS GROUP LOCATION LEVEL DATA               *         
      *    LENGTH  - 19 BYTES                                         *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   --------     -----------------------------      *         
      *    WR24087    08/23/2002   INITIAL DEVELOPMENT                *         
      *---------------------------------------------------------------*         
       01  HMRD012-RECORD.                                                      
           05  HM012-BUS-GP-NBR             PIC 9(03).                          
           05  FILLER                       PIC X(02).                          
           05  HM012-LOC-NBR                PIC 9(04).                          
           05  FILLER                       PIC X(02).                          
           05  HM012-SLG-SQ-FTG-QTY         PIC 9(08).                          
