      *---------------------------------------------------------------*         
      *                                                               *         
      *    HMRD007 - MERCHANDISE HIERARCHY DOMAIN EXTRACT COPYBOOK    *         
      *              DMA LEVEL DATA                                   *         
      *    LENGTH  - 52 BYTES                                         *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   --------     -----------------------------      *         
      *    WR24087    08/23/2002   INITIAL DEVELOPMENT                *         
      *---------------------------------------------------------------*         
       01  HMRD007-RECORD.                                                      
           05  HM007-DMA.                                                       
               10  FILLER                   PIC X(02).                          
               10  HM007-DMA-NBR            PIC X(02).                          
           05  FILLER                       PIC X(02).                          
           05  HM007-GMA.                                                       
               10  FILLER                   PIC X(02).                          
               10  HM007-GMA-NBR            PIC X(02).                          
           05  FILLER                       PIC X(02).                          
           05  HM007-DMA-NM                 PIC X(30).                          
           05  FILLER                       PIC X(02).                          
           05  HM007-DMM-USR-ID             PIC X(08).                          
