      *---------------------------------------------------------------*         
      *                                                               *         
      *    HMRD011 - MERCHANDISE HIERARCHY DOMAIN EXTRACT COPYBOOK    *         
      *              BUSINESS GROUP LEVEL DATA                        *         
      *    LENGTH  - 34 BYTES                                         *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   --------     -----------------------------      *         
      *    WR24087    08/23/2002   INITIAL DEVELOPMENT                *         
      *---------------------------------------------------------------*         
       01  HMRD011-RECORD.                                                      
           05  HM011-BUS-GP-NBR             PIC 9(03).                          
           05  FILLER                       PIC X(02).                          
           05  HM011-BUS-AREA-ID            PIC 9(02).                          
           05  FILLER                       PIC X(02).                          
           05  HM011-BUS-GP-DESC            PIC X(25).                          
