      *---------------------------------------------------------------*         
      *                                                               *         
      *    HMRD001 - MERCHANDISE BRIDGING RMS TO MAINFRAME COPYBOOK   *         
      *    LENGTH  - 500 BYTES                                        *         
      *              100 BYTES OF HEADER DATA                         *         
      *              400 BYTES OF DETAIL DATA                         *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   --------     -----------------------------      *         
      *    WR99999    01/10/2001   COMMENTED OUT INV-OH-VAR FIELDS,   *         
      *                            SYSTEMS-OPTIONS-DATA, AND CLASS-   *         
      *                            ATTRIBUTES-DATA.                   *         
      *    WR23585    05/09/2002   ADDED DISC-ELIG-IND TO THE SUBCL-  *         
      *                            ATTRS-DATA.                        *         
0806PK*    WR30627    08/16/2006   ADDED K_EMT_PRVT_BRND_COST_FCTR    *         
0806PK*                            RECORDS DATA.                      *         
0307PK*    WR31557    03/06/2007   ADDED BUS_GP_SHRT_DESC TO THE      *         
0307PK*                            HM001-K-EMT-BUSINESS-GROUP RECORD. *         
      *---------------------------------------------------------------*         
       01  HMRD001-RECORD.                                                      
           05  HM001-RMS-TBL-NAME           PIC X(30).                          
           05  HM001-CRE-TMST               PIC X(10).                          
           05  HM001-ACTN-TYP-CDE           PIC X(01).                          
               88  HM001-ACTN-TYP-INSERT            VALUE 'I'.                  
               88  HM001-ACTN-TYP-UPDATE            VALUE 'U'.                  
               88  HM001-ACTN-TYP-DELETE            VALUE 'D'.                  
           05  HM001-DIVISION-DATA.                                             
               10  HM001-DIV-DIVISION           PIC 9(04).                      
               10  HM001-DIV-DIV-NAME           PIC X(20).                      
               10  HM001-DIV-BUYER              PIC 9(04).                      
               10  HM001-DIV-MERCH              PIC 9(04).                      
               10  HM001-DIV-TOTAL-MARKET-AMT   PIC 9(14).9(4).                 
               10  FILLER                       PIC X(349).                     
           05  HM001-GROUPS-DATA                                                
                     REDEFINES HM001-DIVISION-DATA.                             
               10  HM001-GRPS-GROUP-NO          PIC 9(04).                      
               10  HM001-GRPS-GROUP-NAME        PIC X(20).                      
               10  HM001-GRPS-BUYER             PIC 9(04).                      
               10  HM001-GRPS-MERCH             PIC 9(04).                      
               10  HM001-GRPS-DIVISION          PIC 9(04).                      
               10  FILLER                       PIC X(364).                     
           05  HM001-CODE-DETAIL-DATA                                           
                     REDEFINES HM001-DIVISION-DATA.                             
               10  HM001-CDE-DTL-CODE-TYPE      PIC X(04).                      
               10  HM001-CDE-DTL-CODE           PIC X(06).                      
               10  HM001-CDE-DTL-CODE-DESC      PIC X(40).                      
               10  HM001-CDE-DTL-REQUIRED-IND   PIC X(01).                      
               10  HM001-CDE-DTL-CODE-SEQ       PIC 9(04).                      
               10  FILLER                       PIC X(345).                     
           05  HM001-DEPS-DATA                                                  
                     REDEFINES HM001-DIVISION-DATA.                             
               10  HM001-DEPS-DEPT              PIC 9(04).                      
               10  HM001-DEPS-DEPT-NAME         PIC X(20).                      
               10  HM001-DEPS-BUYER             PIC 9(04).                      
               10  HM001-DEPS-MERCH             PIC 9(04).                      
               10  HM001-DEPS-PROFIT-CALC-TYPE  PIC 9(01).                      
               10  HM001-DEPS-PURCHASE-TYPE     PIC 9(01).                      
               10  HM001-DEPS-GROUP-NO          PIC 9(04).                      
               10  HM001-DEPS-BUD-INT           PIC 9(08).9(4).                 
               10  HM001-DEPS-BUD-MKUP          PIC 9(08).9(4).                 
               10  HM001-DEPS-TOTAL-MARKET-AMT  PIC 9(14).9(4).                 
               10  HM001-DEPS-MARKUP-CALC-TYPE  PIC X(02).                      
               10  HM001-DEPS-OTB-CALC-TYPE     PIC X(01).                      
               10  FILLER                       PIC X(314).                     
           05  HM001-K-EMT-DEPS-ATTRS-DATA                                      
                     REDEFINES HM001-DIVISION-DATA.                             
               10  HM001-DEPATTR-DEPT           PIC 9(04).                      
               10  HM001-DEPATTR-DAYS-AFT-CLR   PIC 9(03).                      
               10  HM001-DEPATTR-DAYS-BEF-SHIP  PIC 9(03).                      
               10  HM001-DEPATTR-MDSE-LNE-CDE   PIC X(01).                      
                   88  HM001-DEPATTR-MLC-MISC           VALUE 'M'.              
                   88  HM001-DEPATTR-MLC-HARDLINES      VALUE 'H'.              
                   88  HM001-DEPATTR-MLC-SOFTLINES      VALUE 'S'.              
               10  HM001-DEPATTR-BUS-GP-NBR     PIC 9(03).                      
               10  HM001-DEPATTR-INV-OH-VAR-PCT PIC 9(03).                      
               10  HM001-DEPATTR-INV-OH-VAR-QTY PIC 9(05).                      
               10  HM001-DEPATTR-STR-ZN-CDE     PIC X(05).                      
               10  HM001-DEPATTR-CONT-CLR-EXCLN PIC X(01).                      
               10  FILLER                       PIC X(372).                     
           05  HM001-CLASS-DATA                                                 
                     REDEFINES HM001-DIVISION-DATA.                             
               10  HM001-CLASS-DEPT             PIC 9(04).                      
               10  HM001-CLASS-CLASS            PIC 9(04).                      
               10  HM001-CLASS-CLASS-NAME       PIC X(20).                      
               10  FILLER                       PIC X(372).                     
0102RM*    05  HM001-K-EMT-CLASS-ATTRS-DATA                                     
0102RM*              REDEFINES HM001-DIVISION-DATA.                             
0102RM*        10  HM001-CLSATTR-DEPT           PIC 9(04).                      
0102RM*        10  HM001-CLSATTR-CLASS          PIC 9(04).                      
0102RM*        10  HM001-CLSATTR-INV-OH-VAR-PCT PIC 9(03).                      
0102RM*        10  HM001-CLSATTR-INV-OH-VAR-QTY PIC 9(05).                      
0102RM*        10  FILLER                       PIC X(384).                     
           05  HM001-SUBCLASS-DATA                                              
                     REDEFINES HM001-DIVISION-DATA.                             
               10  HM001-SUBCL-DEPT             PIC 9(04).                      
               10  HM001-SUBCL-CLASS            PIC 9(04).                      
               10  HM001-SUBCL-SUBCLASS         PIC 9(04).                      
               10  HM001-SUBCL-SUB-NAME         PIC X(20).                      
               10  FILLER                       PIC X(368).                     
           05  HM001-K-EMT-SUBCL-ATTRS-DATA                                     
                     REDEFINES HM001-DIVISION-DATA.                             
               10  HM001-SCLATTR-DEPT           PIC 9(04).                      
               10  HM001-SCLATTR-CLASS          PIC 9(04).                      
               10  HM001-SCLATTR-SUBCLASS       PIC 9(04).                      
               10  HM001-SCLATTR-POS-MDSE-DESC  PIC X(30).                      
               10  HM001-SCLATTR-TX-DFLT-IND    PIC X(01).                      
                   88  HM001-SCLATTR-TX-DFLT-NONTAX     VALUE 'N'.              
                   88  HM001-SCLATTR-TX-DFLT-TAXABLE    VALUE 'Y'.              
               10  HM001-SCLATTR-DISC-ELIG-IND  PIC X(01).                      
                   88  HM001-SCLATTR-DISC-NONELIGBL     VALUE 'N'.              
                   88  HM001-SCLATTR-DSCNT-ELIGIBLE     VALUE 'Y'.              
               10  FILLER                       PIC X(356).                     
           05  HM001-K-EMT-BUSINESS-GROUP                                       
                     REDEFINES HM001-DIVISION-DATA.                             
               10  HM001-BUS-GRP-BUS-GP-NBR     PIC 9(03).                      
               10  HM001-BUS-GRP-BUS-AREA-ID    PIC 9(02).                      
               10  HM001-BUS-GRP-BUS-GP-DESC    PIC X(25).                      
0307PK         10  HM001-BUS-GRP-BUS-GP-SHRT-DESC                               
0307PK                                          PIC X(08).                      
               10  FILLER                       PIC X(362).                     
           05  HM001-K-EMT-BUS-AREA                                             
                     REDEFINES HM001-DIVISION-DATA.                             
               10  HM001-BUS-AREA-ID            PIC 9(02).                      
               10  HM001-BUS-AREA-DESC          PIC X(25).                      
               10  FILLER                       PIC X(373).                     
0806PK     05  HM001-K-EMT-PRVT-BRND-AREA                                       
0806PK               REDEFINES HM001-DIVISION-DATA.                             
0806PK         10  HM001-PRVT-BRND-DEPT         PIC 9(04).                      
0806PK         10  HM001-PRVT-BRND-EFF-BEG-DTE  PIC X(10).                      
0806PK         10  HM001-PRVT-BRND-EFF-END-DTE  PIC X(10).                      
0806PK         10  HM001-PRVT-BRND-LOD-PCT      PIC 9(03).99.                   
0806PK         10  HM001-PRVT-BRND-CHG-USER-ID  PIC X(08).                      
0806PK*            OLD DATA FIELDS FOLLOW FOR UPDATE TRANSACTIONS               
0806PK         10  HM001-PRVT-BRND-EFF-BEG-DTE-O                                
0806PK                                          PIC X(10).                      
0806PK         10  HM001-PRVT-BRND-EFF-END-DTE-O                                
0806PK                                          PIC X(10).                      
0806PK         10  HM001-PRVT-BRND-LOD-PCT-OLD  PIC 9(03).99.                   
0806PK         10  FILLER                       PIC X(336).                     
           05  FILLER                           PIC X(59).                      
