00001 ***************************************************************** 03/02/92
00002 *                       HMWS002                                 * MBWS018 
00007 *                                                               * MBWS018 
00003 *    THIS COPYBOOK IS USED IN THE MERCHANDISE HIERARCHY BRIDGING*    LV003
00004 *    SYSTEM TO END DATE A SUBCLASS THAT WAS DELETED IN RMS.     * MBWS018 
00007 *    IT CONTAINS ELEMENTS USED TO PASS DATA FROM HMKUP001 TO    * MBWS018 
00007 *    SUBROUTINE HMKUP002.                                       * MBWS018 
00008 *    RECORD LENGTH = 100, KEY LENGTH = 30.                      * MBWS018 
00009 *                                                               * MBWS018 
00010 ***************************************************************** MBWS018 
00011                                                                      CL**2
00012  01  HM002-HM-SUBR-RECORD.                                        MBWS018 
00013      05  HM002-HMR-KEY                   PIC X(30)   VALUE SPACE. MBWS018 
00014      05  HM002-HMR-DETAIL.                                           CL**2
00015          10  FILLER                      PIC X(62)   VALUE SPACE.    CL**2
00016          10  HM002-USERID                PIC X(08)   VALUE SPACE.    CL**2
00017                                                                   MBWS018 
00073  01  HM002-HM-SUBR-RECORD-002            REDEFINES                MBWS018 
00074      HM002-HM-SUBR-RECORD.                                        MBWS018 
00075      05  HM002-HMR-KEY-002.                                       MBWS018 
00076          10  HM002-RECORD-ID-002         PIC X(08).               MBWS018 
00077              88  HM002-MBS-DATE-CHANGE               VALUE        MBWS018 
00078                                                      'HMKUP002'.  MBWS018 
00079          10  HM002-OPERATING-CO-002      PIC X(02).               MBWS018 
00080          10  HM002-MERCH-AREA-002.                                MBWS018 
00081              15  HM002-GMA-002           PIC X(02).               MBWS018 
00082              15  HM002-DMA-002           PIC X(02).               MBWS018 
00083              15  HM002-DEPT-002          PIC X(03).               MBWS018 
00084              15  HM002-MAJ-CL-002        PIC X(02).               MBWS018 
00085              15  HM002-SUB-CL-002        PIC X(03).               MBWS018 
00086          10  FILLER                      PIC X(08).               MBWS018 
00087      05  HM002-HMR-DETAIL-002.                                    MBWS018 
00088          10  HM002-NEW-START-DATE-002    PIC X(10).               MBWS018 
00089          10  HM002-NEW-END-DATE-002      PIC X(10).               MBWS018 
               10  HM002-RETURN-CODE           PIC 9(01).               00670004
                   88  HM002-GOOD-CALL                     VALUE 0.     00680004
                   88  HM002-BAD-CALL                      VALUE 1.     00690004
00090          10  FILLER                      PIC X(49).               MBWS018 
