      *---------------------------------------------------------------*         
      *                                                               *         
      *    HORD100 - LOCATION BRIDGING RMS TO MAINFRAME COPYBOOK      *         
      *    LENGTH  - 500 BYTES                                        *         
      *              100 BYTES OF HEADER DATA                         *         
      *              400 BYTES OF DETAIL DATA                         *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   --------     -----------------------------      *         
      *   KOHLSMOD    08/06/2001   COMMENTED THE FOLLOWING FIELD      *         
      *   00019                    HO100-SATTR-EXTL-CLO-DTE           *         
      *                            AND REPLACED IT WITH               *         
      *                            HO100-SATTR-FINCL-CLO-DTE          *         
      *   KOHLSMOD    08/06/2001   COMMENTED THE FOLLOWING FIELD      *         
      *   00020                    HO100-WHATTR-DC-ON-WEB-DTE         *         
      *                            AND REPLACED IT WITH FILLER        *         
      *   KOHLSMOD    08/06/2001   COMMENTED THE FOLLOWING FIELDS     *         
      *   00025                    AND ADDED FILLER:                  *         
      *                            HO100-SATTR-PRE-OPN-PHN-NBR        *         
      *                            HO100-SATTR-PRE-OPN-EXT-NBR        *         
      *   PM00419674  08/29/2001   ADDED MOVE FOR 10 CHAR STORE NAME  *         
      *                            THIS WAS DONE FOR THE MA TEAM BE-  *         
      *                            CAUSE THEY REQUIRE A 10 CHAR NAME  *         
      *                            ON THEIR BRIDGE BACK TO ORACLE FOR *         
      *                            "OUTLOC" TYPE RECORDS (RECORD TYPE *         
      *                            HQ, OP, AL, DA,ND, VN).            *         
      *   KOHLSMOD    09/17/2001   COMMENTED THE SIGN PRINT FIELDS    *         
      *   00020                    FROM THE STORE ATTRIBUTE DATA.     *         
      *   --------    10/08/2001   REDEFINED THE STORE DEFAULT WH     *         
      *                            FIELD (USED IN STORE OPEN DATE     *         
      *                            CHANGE LOGIC IN HOKUP001).         *         
      *   P000458641  03/29/2002   ADDED BACK FILLER IN OUTLOC DATA   *         
      *                            AREA. ADDED NEW FIELD FOR START    *         
      *                            ORDER DAY CHANGE IN STORE DATA AREA*         
      *   KOHLSWRN    05/08/2002   ADDED PRCHG-CRD-IND AND IN-STR-    *         
      *   23443                    PRCHG-CRE-IND TO STORE_ATTRIBUTES  *         
      *                            AND WH_ATTRIBUTES MESSAGES.        *         
      *   KOHLSWRN    05/24/2002   ADDED NEW K_EMT_PRICE_ZONE_DATE    *         
      *   22160                    MESSAGE.                           *         
      *   KOHLSWRN    10/11/2002   ADDED NEW ELEMENTS TO WH_STORE_    *         
      *   23765                    ASSIGN MESSAGE.                    *         
      *   KOHLSWRN    11/14/2002   ADDED NEW MESSAGES AND ADDED USER  *         
      *   24150                    ID TO ALL MESSAGES.                *         
      *   KOHLSWRN    01/08/2003   FLIPPED NAMES IN ZONE_STORE_DATE   *         
      *   24150                    LAYOUT.                            *         
      *   KOHLSWRN    01/28/2003   MODIFIED OUTLOC-ID TO BE NUMERIC   *         
      *   24150                    AND ALSO REDEFINED IT USING THE    *         
      *                            EXISTING FIELDS.                   *         
      *   KOHLSWRN    05/13/2004   ADDED A REDEFINE TO OUTLOC SEGMENT *         
      *   27051                    TO ACCOMODATE 4 DIGIT OUTLOCS.     *         
      *                            CHANGED "MERCH" DATA TO FILLER.    *         
      *   WR28645     04/07/2005   ADDED PLN_CTG_CDE TO STORE_ATTRIB. *         
      *               ADDED 88 LEVELS UNDER HO100-RMS-TBL-NAME.       *         
      *               01/19/2006   ADDED STORE_ATTRIBUTES TO          *         
      *               88 LEVELS UNDER HO100-RMS-TBL-NAME.             *         
      *   WR30047     02/10/2006                                      *         
      *               ADDED 88 LEVEL UNDER HO100-RMS-TBL-NAME.        *         
0407PK*   WR31384     04/20/2007   ADDED OPN_STR_MN AND OPN_STR_YR TO *         
0407PK*               STORE_ATTRIBUTES.                               *         
      *---------------------------------------------------------------*         
       01  HORD100-RECORD.                                                      
           05  HO100-RMS-TBL-NAME               PIC X(30).                      
               88  HO100-AREA-TABLE             VALUE                           
                   'AREA                          '.                            
               88  HO100-REGION-TABLE           VALUE                           
                   'REGION                        '.                            
               88  HO100-DISTRICT-TABLE         VALUE                           
                   'DISTRICT                      '.                            
               88  HO100-STORE-TABLE            VALUE                           
                   'STORE                         '.                            
               88  HO100-STORE-ATTRIBUTES-TABLE VALUE                           
                   'STORE_ATTRIBUTES              '.                            
               88  HO100-K-EMT-ZONE-STORE-DATE  VALUE                           
                   'K_EMT_ZONE_STORE_DATE         '.                            
           05  HO100-CRE-TMST                   PIC X(10).                      
           05  HO100-ACTN-TYP-CDE               PIC X(01).                      
               88  HO100-ACTN-TYP-INSERT            VALUE 'I'.                  
               88  HO100-ACTN-TYP-UPDATE            VALUE 'U'.                  
               88  HO100-ACTN-TYP-DELETE            VALUE 'D'.                  
      *-- USES 'STORE' MESSAGE                                                  
           05  HO100-STORE-DATA.                                                
               10  HO100-STR-NBR                PIC X(04).                      
               10  HO100-STR-NAME               PIC X(20).                      
               10  HO100-STR-NAME10             PIC X(10).                      
               10  HO100-STR-NAME3              PIC X(03).                      
               10  HO100-STR-ADD1.                                              
                   15  HO100-STR-ADD1-1-25      PIC X(25).                      
                   15  FILLER                   PIC X(05).                      
               10  HO100-STR-ADD2.                                              
                   15  HO100-STR-ADD2-1-25      PIC X(25).                      
                   15  FILLER                   PIC X(05).                      
               10  HO100-STR-CITY.                                              
                   15  HO100-STR-CITY-1-15      PIC X(15).                      
                   15  FILLER                   PIC X(05).                      
               10  HO100-STR-STATE.                                             
                   15  HO100-STR-STATE-1-2      PIC X(02).                      
                   15  FILLER                   PIC X(01).                      
               10  HO100-STR-COUNTRY-ID         PIC X(03).                      
               10  HO100-STR-PCODE              PIC X(10).                      
               10  HO100-STR-CLASS              PIC X(01).                      
               10  HO100-STR-MGR-NAME           PIC X(32).                      
               10  HO100-STR-OPEN-DATE          PIC X(10).                      
               10  HO100-STR-CLOSE-DATE         PIC X(10).                      
               10  HO100-STR-ACQUIRD-DATE       PIC X(10).                      
               10  HO100-STR-REMODEL-DATE       PIC X(10).                      
               10  HO100-STR-FAX-NUMBER         PIC X(20).                      
               10  HO100-STR-PHONE-NUMBER       PIC X(20).                      
               10  HO100-STR-TOTAL-SQUARE-FT    PIC 9(08).                      
               10  HO100-STR-SELL-SQ-FT         PIC 9(08).                      
               10  HO100-STR-VAT-REGION         PIC 9(04).                      
               10  HO100-STR-VAT-INCLUDE-IND    PIC X(01).                      
               10  HO100-STR-FORMAT             PIC 9(04).                      
               10  HO100-STR-MALL-NAME          PIC X(20).                      
               10  HO100-STR-PROMO-ZONE         PIC 9(04).                      
               10  HO100-STR-DISTRICT           PIC 9(04).                      
               10  HO100-STR-TRANSFER-ZONE      PIC 9(04).                      
               10  HO100-STR-DEFAULT-WH         PIC 9(04).                      
1001RM         10  HO100-STR-DEFAULT-WH-RDF REDEFINES                           
1001RM             HO100-STR-DEFAULT-WH.                                        
1001RM             15  FILLER                   PIC X(01).                      
1001RM             15  HO100-STR-DEF-WH-CHAR    PIC X(03).                      
               10  HO100-STR-STOP-ORDER-DAYS    PIC 9(03).                      
               10  HO100-STR-START-ORDER-DAYS   PIC 9(03).                      
               10  HO100-STR-CURRENCY-CODE      PIC X(03).                      
               10  HO100-STR-ADDR-CHG           PIC X(01).                      
               10  HO100-STR-LANG               PIC 9(06).                      
               10  HO100-STR-TRAN-NO-GENERD     PIC X(06).                      
               10  HO100-STR-INTGRE-POS-IND     PIC X(01).                      
               10  HO100-STR-ORIG-CURR-CDE      PIC X(03).                      
0801RM         10  HO100-STR-ACTION-TYPE        PIC X(01).                      
0801RM             88  HO100-STR-ACTN-STP-ORD       VALUE 'O'.                  
0302RM         10  HO100-STR-STRT-ORDER-TYP      PIC X(01).                     
0302RM             88  HO100-STRT-ORDER-TYP-CHG     VALUE 'O'.                  
0801RM*        10  FILLER                       PIC X(67).                      
0801RM*        10  FILLER                       PIC X(66).                      
0302RM*        10  FILLER                       PIC X(65).                      
1102RM         10  FILLER                       PIC X(57).                      
1102RM         10  HO100-STR-USR-ID             PIC X(08).                      
      *-- USES 'STORE_ATTRIBUTES' MESSAGE                                       
           05  HO100-STORE-ATTRIBUTES-DATA REDEFINES HO100-STORE-DATA.          
               10  HO100-SATTR-STR-NBR          PIC X(04).                      
               10  HO100-SATTR-STR-NM-5-ABBR    PIC X(05).                      
               10  HO100-SATTR-TM-ZN-CDE        PIC X(03).                      
               10  HO100-SATTR-DST-IND          PIC X(01).                      
               10  HO100-SATTR-E-BUS-LOC-IND    PIC X(01).                      
               10  HO100-SATTR-OCPNC-DTE        PIC X(10).                      
0103RM*        10  HO100-SATTR-REPLT-STR-NBR.                                   
0103RM         10  HO100-SATTR-REPLT-STR-NBR    PIC 9(05).                      
0103RM         10  HO100-SATTR-REPLT-STR-NBR-RDF REDEFINES                      
0103RM             HO100-SATTR-REPLT-STR-NBR.                                   
                   15  FILLER                   PIC X(02).                      
                   15  HO100-SATTR-REPLT-STR-NBR3-5                             
                                                PIC X(03).                      
0904RM* WR27051                                                                 
0904RM*        10  HO100-SATTR-AMEX-MERCH-NBR   PIC 9(10).                      
0904RM         10  FILLER                       PIC X(10).                      
0904RM*        10  HO100-SATTR-BNKCRD-MRCH-NBR  PIC 9(07).                      
0904RM         10  FILLER                       PIC X(07).                      
0904RM*        10  HO100-SATTR-DSCVR-MERCH-NBR  PIC 9(15).                      
0904RM         10  FILLER                       PIC X(15).                      
0904RM*        10  HO100-SATTR-CSH-RFND-GP-NBR  PIC 9(02).                      
0904RM         10  FILLER                       PIC X(02).                      
0904RM*        10  HO100-SATTR-CK-AUTH-GP-NBR   PIC 9(02).                      
0904RM         10  FILLER                       PIC X(02).                      
               10  HO100-SATTR-MEDN-AGE-NBR     PIC X(05).                      
               10  HO100-SATTR-MEDN-AGE-NBR-RDF REDEFINES                       
                   HO100-SATTR-MEDN-AGE-NBR     PIC 9(02).99.                   
               10  HO100-SATTR-EST-HH-INCM-AMT  PIC 9(11).                      
               10  HO100-SATTR-LBR-SFWR-LVL-ID  PIC 9(02).                      
               10  HO100-SATTR-POS-CAP-LVL-ID   PIC 9(02).                      
               10  HO100-SATTR-SLS-INCL-DTE-CDE PIC X(01).                      
               10  HO100-SATTR-MN-SLS-INCL-DTE  PIC X(10).                      
               10  HO100-SATTR-QTR-SLS-INCL-DTE PIC X(10).                      
               10  HO100-SATTR-SEA-SLS-INCL-DTE PIC X(10).                      
               10  HO100-SATTR-YR-SLS-INCL-DTE  PIC X(10).                      
0901RM*        10  HO100-SATTR-SGN-PRT-GP-ID    PIC 9(05).                      
0901RM*        10  HO100-SATTR-SGN-PRT-LOC-ID   PIC 9(05).                      
               10  HO100-SATTR-EXTD-MALL-NM     PIC X(40).                      
               10  HO100-SATTR-GRND-OPN-DTE     PIC X(10).                      
0801RM*        10  HO100-SATTR-EXTL-CLO-DTE     PIC X(10).                      
0801RM         10  HO100-SATTR-FINCL-CLO-DTE    PIC X(10).                      
               10  HO100-SATTR-DIRNS-TXT        PIC X(150).                     
0701RM*        10  HO100-SATTR-PRE-OPN-PHN-NBR  PIC X(20).                      
0701RM*        10  HO100-SATTR-PRE-OPN-EXT-NBR  PIC X(06).                      
0904RM*        10  HO100-SATTR-POS-RGST-BNK-QTY PIC 9(03).                      
0904RM         10  FILLER                       PIC X(03).                      
               10  HO100-SATTR-IN-STR-PRCHG-IND PIC X.                          
               10  HO100-SATTR-PRCHG-IND        PIC X.                          
0701RM*        10  FILLER                       PIC X(25).                      
0701RM*        10  FILLER                       PIC X(59).                      
0405RM* WR28645                                                                 
1102RM*        10  FILLER                       PIC X(51).                      
0405RM         10  HO100-SATTR-PLN-CTG-CDE      PIC X(01).                      
0407PK         10  HO100-SATTR-OPN-STR-MN       PIC 9(02).                      
0407PK         10  HO100-SATTR-OPN-STR-YR       PIC 9(04).                      
0405RM         10  FILLER                       PIC X(44).                      
1102RM         10  HO100-SATTR-USR-ID           PIC X(08).                      
      *-- USES 'OUTLOC' MESSAGE                                                 
           05  HO100-OUTLOC-DATA REDEFINES HO100-STORE-DATA.                    
0103RM*        10  HO100-OTLC-ID.                                               
0103RM         10  HO100-OTLC-ID                PIC 9(05).                      
0103RM         10  HO100-OTLC-ID-RDF REDEFINES HO100-OTLC-ID.                   
                   15  FILLER                   PIC X(02).                      
                   15  HO100-OUTLC-ID-3-5       PIC 9(03).                      
0504RM         10  HO100-OTLC-ID2-RDF REDEFINES HO100-OTLC-ID.                  
0504RM             15  FILLER                   PIC X(01).                      
0504RM             15  HO100-OUTLC-ID-2-5       PIC 9(04).                      
               10  HO100-OTLC-TYPE              PIC X(06).                      
               10  HO100-OTLC-DESC.                                             
0801RM*            15  HO100-OUTLC-DESC-1-25     PIC X(25).                     
0801RM             15  HO100-OUTLC-DESC-1-25.                                   
0801RM                 20  HO100-OUTLOC-DESC1-10 PIC X(10).                     
0801RM                 20  FILLER                PIC X(15).                     
0302RM             15  FILLER                    PIC X(15).                     
               10  HO100-OTLC-CURRENCY          PIC X(03).                      
               10  HO100-OTLC-ADD1.                                             
                   15  HO100-OTLC-ADD1-1-25     PIC X(25).                      
                   15  FILLER                   PIC X(05).                      
               10  HO100-OTLC-ADD2.                                             
                   15  HO100-OTLC-ADD2-1-25     PIC X(25).                      
                   15  FILLER                   PIC X(05).                      
               10  HO100-OTLC-CITY.                                             
                   15  HO100-OTLC-CITY-1-15     PIC X(15).                      
                   15  FILLER                   PIC X(05).                      
               10  HO100-OTLC-STATE.                                            
                   15  HO100-OTLC-STATE-1-2     PIC X(02).                      
                   15  FILLER                   PIC X(01).                      
               10  HO100-OTLC-COUNTRY-ID        PIC X(03).                      
               10  HO100-OTLC-POST              PIC X(10).                      
               10  HO100-OTLC-VAT-REGION        PIC 9(04).                      
               10  HO100-OTLC-CONTACT-NAME      PIC X(30).                      
               10  HO100-OTLC-CONTACT-PHONE     PIC X(20).                      
               10  HO100-OTLC-CONTACT-FAX       PIC X(20).                      
               10  HO100-OTLC-CONTACT-TELEX     PIC X(20).                      
               10  HO100-OTLC-CONTACT-EMAIL     PIC X(100).                     
               10  HO100-OTLC-NM-5-ABBR         PIC X(05).                      
               10  HO100-OTLC-OPN-DTE           PIC X(10).                      
               10  HO100-OTLC-CLO-DTE           PIC X(10).                      
1001RM*        10  FILLER                       PIC X(46).                      
0302RM*        10  FILLER                       PIC X(31).                      
1102RM         10  FILLER                       PIC X(23).                      
1102RM         10  HO100-OTLC-USR-ID            PIC X(08).                      
      *-- USES 'WH' MESSAGE                                                     
           05 HO100-WH-DATA REDEFINES HO100-STORE-DATA.                         
               10  HO100-WH                     PIC X(04).                      
               10  HO100-WH-NAME                PIC X(20).                      
               10  HO100-WH-ADD1.                                               
                   15  HO100-WH-ADD1-1-25       PIC X(25).                      
                   15  FILLER                   PIC X(05).                      
               10  HO100-WH-ADD2.                                               
                   15  HO100-WH-ADD2-1-25       PIC X(25).                      
                   15  FILLER                   PIC X(05).                      
               10  HO100-WH-CITY.                                               
                   15  HO100-WH-CITY-1-15       PIC X(15).                      
                   15  FILLER                   PIC X(05).                      
               10  HO100-WH-STATE.                                              
                   15  HO100-WH-STATE-1-2       PIC X(02).                      
                   15  FILLER                   PIC X(01).                      
               10  HO100-WH-COUNTRY-ID          PIC X(03).                      
               10  HO100-WH-PCODE               PIC X(10).                      
               10  HO100-VAT-REGION             PIC 9(04).                      
               10  HO100-WH-ORG-HIER-TYPE       PIC 9(04).                      
               10  HO100-WH-ORG-HIER-VALUE      PIC 9(04).                      
               10  HO100-WH-CURRENCY-CODE       PIC X(03).                      
               10  HO100-WH-BREAK-PACK-IND      PIC X(01).                      
               10  HO100-WH-ADDR-CHG            PIC X(01).                      
               10  HO100-WH-REDIST-WH-IND       PIC X(01).                      
               10  HO100-WH-DELIVERY-POLICY     PIC X(06).                      
1102RM*        10  FILLER                       PIC X(256).                     
1102RM         10  FILLER                       PIC X(248).                     
1102RM         10  HO100-WH-USR-ID              PIC X(08).                      
      *-- USES 'WH_ATTRIBUTES' MESSAGE                                          
           05 HO100-WH-ATTRIB-DATA REDEFINES HO100-STORE-DATA.                  
               10  HO100-WHATTR-WH              PIC X(04).                      
               10  HO100-WHATTR-LOC-TYP-CDE     PIC X(02).                      
               10  HO100-WHATTR-NM-5-ABBR       PIC X(05).                      
               10  HO100-WHATTR-NM-10-ABBR      PIC X(10).                      
               10  HO100-WHATTR-OPN-DTE         PIC X(10).                      
               10  HO100-WHATTR-CLO-DTE         PIC X(10).                      
               10  HO100-WHATTR-DC-NBR.                                         
                   15  FILLER                   PIC X(01).                      
                   15  HO100-WHATTR-DC-NBR2-4   PIC X(03).                      
               10  HO100-WHATTR-E-BUS-LOC-IND   PIC X(01).                      
0701RM*        10  HO100-WHATTR-DC-ON-WEB-DTE   PIC X(10).                      
               10  HO100-WHATTR-DST-IND         PIC X(01).                      
0302PK         10  HO100-WHATTR-OCPNC-DTE       PIC X(10).                      
               10  HO100-WHATTR-IN-STR-PRCHG-IND                                
                                                PIC X.                          
               10  HO100-WHATTR-PRCHG-IND       PIC X.                          
0302PK*        10  FILLER                       PIC X(341).                     
1102RM         10  FILLER                       PIC X(333).                     
1102RM         10  HO100-WHATTR-USR-ID          PIC X(08).                      
      *-- USES 'WH_STORE_ASSIGN' MESSAGE                                        
           05  HO100-STR-ASSIGN-DATA REDEFINES HO100-STORE-DATA.                
               10  HO100-SA-ASSIGN-DATE         PIC X(10).                      
               10  HO100-SA-STORE-NUMBER        PIC 9(04).                      
               10  HO100-SA-WH                  PIC 9(04).                      
               10  HO100-SA-WH-RDF REDEFINES HO100-SA-WH.                       
                   15  FILLER                   PIC X(01).                      
                   15  HO100-SA-WH-2-4          PIC 9(03).                      
               10  HO100-SA-PROCESSED-IND       PIC X(01).                      
               10  HO100-SA-PO-STRT-DTE         PIC X(10).                      
1002RM         10  HO100-SA-OLD-ASSIGN-DATE     PIC X(10).                      
1002RM         10  HO100-SA-OLD-PO-STRT-DATE    PIC X(10).                      
1002RM         10  HO100-SA-OLD-WH              PIC 9(04).                      
1002RM         10  HO100-SA-OLD-WH-RDF REDEFINES HO100-SA-OLD-WH.               
1002RM             15  FILLER                   PIC X(01).                      
1002RM             15  HO100-SA-OLD-WH-2-4      PIC 9(03).                      
0801RM*        10  FILLER                       PIC X(371).                     
0801RM*        10  FILLER                       PIC X(369).                     
0801RM         10  HO100-SA-REPLACE-DC          PIC X(02).                      
0801RM             88 HO100-REPLACE-DC1         VALUE 'R1'.                     
0801RM             88 HO100-REPLACE-DC2         VALUE 'R2'.                     
1002RM*        10  FILLER                       PIC X(345).                     
1102RM         10  FILLER                       PIC X(337).                     
1102RM         10  HO100-SA-USR-ID              PIC X(08).                      
      *-- USES 'AREA' MESSAGE                                                   
           05  HO100-AREA-DATA REDEFINES HO100-STORE-DATA.                      
               10  HO100-AREA-AREA              PIC X(04).                      
               10  HO100-AREA-CHAIN             PIC X(04).                      
               10  HO100-AREA-NAME              PIC X(20).                      
               10  HO100-AREA-MGR-NAME          PIC X(32).                      
               10  HO100-AREA-CURRENCY-CODE     PIC X(03).                      
1102RM*        10  FILLER                       PIC X(337).                     
1102RM         10  FILLER                       PIC X(329).                     
1102RM         10  HO100-AREA-USR-ID            PIC X(08).                      
      *-- USES 'REGION' MESSAGE                                                 
           05  HO100-REGION-DATA REDEFINES HO100-STORE-DATA.                    
               10  HO100-REGION                 PIC X(04).                      
               10  HO100-REGION-AREA            PIC X(04).                      
               10  HO100-REGION-AREA-NAME       PIC X(20).                      
               10  HO100-REGION-MGR-NAME        PIC X(32).                      
               10  HO100-REGION-CURRENCY-CODE   PIC X(03).                      
1102RM*        10  FILLER                       PIC X(337).                     
1102RM         10  FILLER                       PIC X(329).                     
1102RM         10  HO100-REGION-USR-ID          PIC X(08).                      
      *-- USES 'DISTRICT' MESSAGE                                               
           05  HO100-DISTRICT-DATA REDEFINES HO100-STORE-DATA.                  
               10  HO100-DISTRICT               PIC X(04).                      
               10  HO100-DISTRICT-REGION        PIC X(04).                      
               10  HO100-DISTRICT-AREA-NAME     PIC X(20).                      
               10  HO100-DISTRICT-MGR-NAME      PIC X(32).                      
               10  HO100-DISTRICT-CURRENCY-CODE PIC X(03).                      
1102RM*        10  FILLER                       PIC X(337).                     
1102RM         10  FILLER                       PIC X(329).                     
1102RM         10  HO100-DISTRICT-USR-ID        PIC X(08).                      
      *-- USES 'PRICE_ZONE_GROUP_STORE' MESSAGE                                 
           05  HO100-PRICE-ZNE-GRP-STR-DATA REDEFINES                           
               HO100-STORE-DATA.                                                
               10  HO100-PZG-GROUP-ID           PIC 9(04).                      
                   88  HO100-PZGS-GROUP-ID-METRO     VALUE 2000.                
                   88  HO100-PZGS-GROUP-ID-ADMKT     VALUE 4000.                
               10  HO100-PZG-STORE              PIC 9(04).                      
               10  HO100-PZG-ZONE-ID            PIC 9(04).                      
               10  H0100-PZG-ADMRKT-DESC.                                       
                   15  H0100-PZG-ADMRKT-DESC1-3 PIC X(03).                      
                   15  FILLER                   PIC X(27).                      
1102RM*        10  FILLER                       PIC X(358).                     
1102RM         10  FILLER                       PIC X(350).                     
1102RM         10  HO100-PZGS-USR-ID            PIC X(08).                      
      *-- USES 'K_EMT_METRO_PRICE_ZONE' MESSAGE                                 
           05  HO100-K-EMT-METRO-DATA REDEFINES                                 
               HO100-STORE-DATA.                                                
               10  HO100-METRO-GROUP-ID         PIC 9(04).                      
               10  HO100-METRO-ZONE-ID          PIC 9(04).                      
               10  HO100-METRO-ST-CDE           PIC X(02).                      
               10  HO100-METRO-RPT-FLSH-SLS-IND PIC X(01).                      
               10  HO100-METRO-CLIMAT-ID        PIC 9(04).                      
               10  HO100-METRO-DESCRIPTION.                                     
                   15  HO100-METRO-DESCRIP1-20.                                 
                       20  HO100-METRO-DESCRIP1-3                               
                                                PIC X(03).                      
                       20  FILLER               PIC X(17).                      
                   15  FILLER                   PIC X(10).                      
1102RM*        10  FILLER                       PIC X(355).                     
1102RM         10  FILLER                       PIC X(347).                     
1102RM         10  HO100-METRO-USR-ID           PIC X(08).                      
      *-- USES 'PRICE_ZONE' MESSAGE                                             
           05  HO100-PRICE-ZONE-DATA REDEFINES                                  
               HO100-STORE-DATA.                                                
               10  HO100-PZ-GROUP-ID            PIC 9(04).                      
                   88  HO100-PZ-GROUP-ID-CLIMAT VALUE 3000.                     
                   88  HO100-PZ-GROUP-ID-ADMRKT VALUE 4000.                     
               10  HO100-PZ-ZONE-ID             PIC 9(04).                      
               10  HO100-PZ-BASE-RTL-IND        PIC X(01).                      
               10  HO100-PZ-DESCRIPTION.                                        
                   15  HO100-PZ-DESCRIP1-3      PIC X(03).                      
                   15  FILLER                   PIC X(01).                      
                   15  HO100-PZ-DESCRIP4-18     PIC X(15).                      
                   15  FILLER                   PIC X(11).                      
               10  HO100-PZ-CURRENCY-CDE        PIC X(03).                      
1102RM*        10  FILLER                       PIC X(358).                     
1102RM         10  FILLER                       PIC X(350).                     
1102RM         10  HO100-PZ-USR-ID              PIC X(08).                      
      *-- USES 'K_EMT_PRICE_ZONE_DATE' MESSAGE                                  
           05  HO100-PRICE-ZONE-DATE-DATA REDEFINES                             
               HO100-STORE-DATA.                                                
               10  HO100-PZD-GROUP-ID           PIC 9(04).                      
                   88  HO100-PZD-GROUP-ID-ADMRKT VALUE 4000.                    
               10  HO100-PZD-ZONE-ID            PIC 9(04).                      
               10  HO100-PZD-PZ-DESCRIPTION.                                    
                   15  HO100-PZD-PZ-DESCRIP1-3  PIC X(03).                      
                   15  FILLER                   PIC X(01).                      
                   15  HO100-PZD-PZ-DESCRIP4-18 PIC X(15).                      
                   15  FILLER                   PIC X(11).                      
               10  HO100-PZD-EFF-STRT-DTE-OLD   PIC X(10).                      
               10  HO100-PZD-EFF-STRT-DTE-NEW   PIC X(10).                      
               10  HO100-PZD-EFF-END-DTE        PIC X(10).                      
1102RM         10  HO100-PZD-EFF-STR-GP-ID      PIC X(10).                      
1102RM*        10  FILLER                       PIC X(332).                     
1102RM         10  FILLER                       PIC X(314).                     
1102RM         10  HO100-PZD-USR-ID             PIC X(08).                      
      *-- USES 'K_EMT_ZONE_STORE_DATE' MESSAGE                                  
1102RM     05  HO100-K-EMT-ZNE-STR-DTE-DATA REDEFINES                           
1102RM         HO100-STORE-DATA.                                                
1102RM         10  HO100-ZSD-STR-GP-TYP-CDE      PIC 9(04).                     
1102RM         10  HO100-ZSD-GP-ID               PIC 9(04).                     
1102RM         10  HO100-ZSD-STR-NBR             PIC 9(04).                     
1102RM         10  HO100-ZSD-EFF-BEG-DTE         PIC X(10).                     
1102RM         10  HO100-ZSD-EFF-END-DTE         PIC X(10).                     
1102RM         10  FILLER                        PIC X(360).                    
1102RM         10  HO100-ZSD-USR-ID              PIC X(08).                     
      *-- USES 'PRICE_ZONE_GROUP' MESSAGE                                       
1102RM     05  HO100-PRICE-ZONE-GROUP-DATA REDEFINES                            
1102RM         HO100-STORE-DATA.                                                
1102RM         10  HO100-PZG-STR-GP-TYP-CDE      PIC 9(04).                     
1102RM         10  HO100-PZG-PRICE-LVL           PIC X(01).                     
1102RM         10  HO100-PZG-STR-GP-CTG-NM       PIC X(30).                     
1102RM         10  FILLER                        PIC X(357).                    
1102RM         10  HO100-PZG-USR-ID              PIC X(08).                     
           05  FILLER                            PIC X(59).                     
