      *---------------------------------------------------------------* 00010000
      *    HORD025 - LOCATION DOMAIN COPYBOOK                         * 00020000
      *    REPRESENTS DATA FROM RMS STORE AND STORE_ATTRIBUTE TABLES  * 00030000
      *    LENGTH  - 687 BYTES                                        * 00040000
      *    WR/PITS#     DATE        DESCRIPTION                       * 00050000
      *    --------   --------     -----------------------------      * 00060000
      *    WR25285    08/26/2003   INITIAL INSTALLATION.              * 00070000
      *    WR27051    09/24/2004   COMMENT OUT                        * 00071000
      *                            HO025-LOC-POS-RGST-BNK-QTY FIELD   * 00072000
      *                            AND REPLACE WITH FILLER.           * 00073000
      *    WR28645    04/07/2005   REPLACED FILLER WITH PLN_CTG_CDE.  * 00074000
      *    PM988722   02/28/2007   CORRECTED THE LOC-PRCHG-IND AND    * 00075000
      *                            AND LOC-IN-STR-PRCHG-IND ORDER.    * 00076000
      *---------------------------------------------------------------* 00077000
       01  HO025-LOCATION-DATA.                                         00078000
           05  HO025-LOC-NBR                PIC 9(04).                  00079000
           05  FILLER                       PIC X(01).                  00080000
           05  HO025-LOC-REPLT-STR-NBR      PIC 9(04).                  00090000
           05  FILLER                       PIC X(01).                  00100000
           05  HO025-LOC-DIST-NBR           PIC 9(04).                  00110000
           05  FILLER                       PIC X(01).                  00120000
           05  HO025-LOC-TYP-CDE            PIC X(02).                  00130000
           05  HO025-LOC-NM                 PIC X(40).                  00140000
           05  HO025-LOC-5-ABBR-NM          PIC X(05).                  00150000
           05  HO025-LOC-LNE-1-ADDR         PIC X(30).                  00160000
           05  HO025-LOC-LNE-2-ADDR         PIC X(30).                  00170000
           05  HO025-LOC-CITY               PIC X(20).                  00180000
           05  HO025-LOC-ST-CDE             PIC X(02).                  00190000
           05  HO025-LOC-ZIP-10-CDE         PIC X(10).                  00200000
           05  HO025-LOC-OPEN-DATE          PIC X(10).                  00210000
           05  HO025-LOC-CLOSE-DATE         PIC X(10).                  00220000
           05  HO025-LOC-LOC-10-ABBR-NM     PIC X(10).                  00230000
           05  HO025-LOC-PHONE-NUMBER       PIC X(26).                  00240000
           05  HO025-LOC-MGR-NM             PIC X(32).                  00250000
           05  HO025-LOC-FINCL-CLO-DTE      PIC X(10).                  00260000
           05  HO025-LOC-MN-SLS-INCL-DTE    PIC X(10).                  00270000
           05  HO025-LOC-YR-SLS-INCL-DTE    PIC X(10).                  00280000
           05  HO025-LOC-OCPNC-DTE          PIC X(10).                  00290000
0904RM*    05  HO025-LOC-POS-RGST-BNK-QTY   PIC 9(03).                  00300000
0405RM*WR28645                                                          00310000
0904RM*    05  FILLER                       PIC X(03).                  00320000
0405RM     05  HO025-PLN-CTG-CDE            PIC X(01).                  00330000
0405RM     05  FILLER                       PIC X(03).                  00331000
0405RM*    05  FILLER                       PIC X(01).                  00332000
           05  HO025-LOC-DST-IND            PIC X(01).                  00333000
           05  HO025-LOC-E-BUS-IND          PIC X(01).                  00334000
           05  HO025-LOC-FMT-CDE            PIC 9(04).                  00335000
           05  FILLER                       PIC X(01).                  00336000
           05  HO025-LOC-STD-TM-ZN-CDE      PIC X(03).                  00337000
           05  HO025-LOC-SLS-INCL-DTE-CDE   PIC X(01).                  00338000
           05  HO025-LOC-TOT-SLG-SQ-FTG-QTY PIC 9(08).                  00339000
           05  FILLER                       PIC X(01).                  00340000
           05  HO025-LOC-TOT-SQ-FTG-QTY     PIC 9(08).                  00350000
           05  FILLER                       PIC X(01).                  00360000
           05  HO025-LOC-STP-ORD-DAYS-QTY   PIC 9(03).                  00370000
           05  FILLER                       PIC X(01).                  00380000
           05  HO025-LOC-STRT-ORD-DAYS-QTY  PIC 9(03).                  00390000
           05  HO025-LOC-ACQR-DTE           PIC X(10).                  00400000
           05  HO025-LOC-REMDL-DTE          PIC X(10).                  00410000
           05  HO025-LOC-MEDN-AGE-NBR       PIC X(05).                  00420000
           05  HO025-LOC-MEDN-AGE-NBR-RDF REDEFINES                     00430000
               HO025-LOC-MEDN-AGE-NBR       PIC 9(02).99.               00440000
           05  FILLER                       PIC X(01).                  00450000
           05  HO025-LOC-EST-HH-INCM-AMT    PIC 9(11).                  00460000
           05  FILLER                       PIC X(01).                  00470000
           05  HO025-LOC-QTR-SLS-INCL-DTE   PIC X(10).                  00480000
           05  HO025-LOC-SEA-SLS-INCL-DTE   PIC X(10).                  00490000
           05  HO025-LOC-EXTD-MALL-NM       PIC X(40).                  00500000
           05  HO025-LOC-GRND-OPN-DTE       PIC X(10).                  00510000
           05  HO025-LOC-DIRNS-TXT          PIC X(255).                 00520000
           05  HO025-LOC-PRCHG-IND          PIC X(01).                  00530000
           05  HO025-LOC-IN-STR-PRCHG-IND   PIC X(01).                  00540000
           05  HO025-LOC-OPN-STR-MN         PIC 9(02).                  00550000
           05  FILLER                       PIC X(01).                  00560000
           05  HO025-LOC-OPN-STR-YR         PIC 9(04).                  00570000
           05  FILLER                       PIC X(206).                 00580000
