      *---------------------------------------------------------------* 00010000
      *    HORD013 - LOCATION DOMAIN COPYBOOK                         * 00020000
      *    REPRESENTS DATA FROM RMS STORE AND STORE_ATTRIBUTE TABLES  * 00030001
      *    LENGTH  - 687 BYTES                                        * 00040003
      *    WR/PITS#     DATE        DESCRIPTION                       * 00050000
      *    --------   --------     -----------------------------      * 00060000
      *    WR25285    08/26/2003   INITIAL INSTALLATION.              * 00070000
      *    WR27051    09/24/2004   COMMENT OUT                        * 00071004
      *                            HO013-LOC-POS-RGST-BNK-QTY FIELD   * 00072004
      *                            AND REPLACE WITH FILLER.           * 00073004
      *    WR28645    04/07/2005   REPLACED FILLER WITH PLN_CTG_CDE.  * 00074005
      *    PM988722   02/28/2007   CORRECTED THE LOC-PRCHG-IND AND    * 00075010
      *                            AND LOC-IN-STR-PRCHG-IND ORDER.    * 00076010
      *---------------------------------------------------------------* 00080000
       01  HO013-LOCATION-DATA.                                         00090000
           05  HO013-LOC-NBR                PIC 9(04).                  00100000
           05  FILLER                       PIC X(01).                  00110000
           05  HO013-LOC-REPLT-STR-NBR      PIC 9(04).                  00120000
           05  FILLER                       PIC X(01).                  00130000
           05  HO013-LOC-DIST-NBR           PIC 9(04).                  00140000
           05  FILLER                       PIC X(01).                  00150000
           05  HO013-LOC-TYP-CDE            PIC X(02).                  00160000
           05  HO013-LOC-NM                 PIC X(40).                  00170002
           05  HO013-LOC-5-ABBR-NM          PIC X(05).                  00180000
           05  HO013-LOC-LNE-1-ADDR         PIC X(30).                  00190000
           05  HO013-LOC-LNE-2-ADDR         PIC X(30).                  00200000
           05  HO013-LOC-CITY               PIC X(20).                  00210000
           05  HO013-LOC-ST-CDE             PIC X(02).                  00220002
           05  HO013-LOC-ZIP-10-CDE         PIC X(10).                  00230000
           05  HO013-LOC-OPEN-DATE          PIC X(10).                  00240000
           05  HO013-LOC-CLOSE-DATE         PIC X(10).                  00250000
           05  HO013-LOC-LOC-10-ABBR-NM     PIC X(10).                  00260000
           05  HO013-LOC-PHONE-NUMBER       PIC X(26).                  00270000
           05  HO013-LOC-MGR-NM             PIC X(32).                  00280000
           05  HO013-LOC-FINCL-CLO-DTE      PIC X(10).                  00290000
           05  HO013-LOC-MN-SLS-INCL-DTE    PIC X(10).                  00300000
           05  HO013-LOC-YR-SLS-INCL-DTE    PIC X(10).                  00310000
           05  HO013-LOC-OCPNC-DTE          PIC X(10).                  00320000
0904RM*    05  HO013-LOC-POS-RGST-BNK-QTY   PIC 9(03).                  00330004
0405RM*WR28645                                                          00332005
0904RM*    05  FILLER                       PIC X(03).                  00333006
0405RM     05  HO013-PLN-CTG-CDE            PIC X(01).                  00334006
0405RM     05  FILLER                       PIC X(03).                  00335009
0405RM*    05  FILLER                       PIC X(01).                  00340008
           05  HO013-LOC-DST-IND            PIC X(01).                  00350000
           05  HO013-LOC-E-BUS-IND          PIC X(01).                  00360000
           05  HO013-LOC-FMT-CDE            PIC 9(04).                  00370000
           05  FILLER                       PIC X(01).                  00380000
           05  HO013-LOC-STD-TM-ZN-CDE      PIC X(03).                  00390000
           05  HO013-LOC-SLS-INCL-DTE-CDE   PIC X(01).                  00400000
           05  HO013-LOC-TOT-SLG-SQ-FTG-QTY PIC 9(08).                  00410000
           05  FILLER                       PIC X(01).                  00420000
           05  HO013-LOC-TOT-SQ-FTG-QTY     PIC 9(08).                  00430000
           05  FILLER                       PIC X(01).                  00440000
           05  HO013-LOC-STP-ORD-DAYS-QTY   PIC 9(03).                  00450000
           05  FILLER                       PIC X(01).                  00460000
           05  HO013-LOC-STRT-ORD-DAYS-QTY  PIC 9(03).                  00470000
           05  HO013-LOC-ACQR-DTE           PIC X(10).                  00480000
           05  HO013-LOC-REMDL-DTE          PIC X(10).                  00490000
           05  HO013-LOC-MEDN-AGE-NBR       PIC X(05).                  00500000
           05  HO013-LOC-MEDN-AGE-NBR-RDF REDEFINES                     00510000
               HO013-LOC-MEDN-AGE-NBR       PIC 9(02).99.               00520000
           05  FILLER                       PIC X(01).                  00530000
           05  HO013-LOC-EST-HH-INCM-AMT    PIC 9(11).                  00540000
           05  FILLER                       PIC X(01).                  00550000
           05  HO013-LOC-QTR-SLS-INCL-DTE   PIC X(10).                  00560000
           05  HO013-LOC-SEA-SLS-INCL-DTE   PIC X(10).                  00570000
           05  HO013-LOC-EXTD-MALL-NM       PIC X(40).                  00580000
           05  HO013-LOC-GRND-OPN-DTE       PIC X(10).                  00590000
           05  HO013-LOC-DIRNS-TXT          PIC X(255).                 00600000
           05  HO013-LOC-PRCHG-IND          PIC X(01).                  00620000
           05  HO013-LOC-IN-STR-PRCHG-IND   PIC X(01).                  00630010
