      *---------------------------------------------------------------* 00010001
      *    HORD017 - STORE GROUP TYPE DOMAIN COPYBOOK                 * 00020001
      *              REPRESENTS DATA FROM THE RMS PRICE_ZONE_GROUP    * 00030001
      *              TABLE                                            * 00040001
      *    LENGTH  - 35 BYTES                                         * 00050001
      *    WR/PITS#     DATE        DESCRIPTION                       * 00060001
      *    --------   --------     -----------------------------      * 00070001
      *    WR25285    08/26/2003   INITIAL CREATION                   * 00080001
      *---------------------------------------------------------------* 00090001
       01  HO017-STR-GP-TYPE-DATA.                                      00100000
      *-- REPRESENTS DATA FROM RMS PRICE_ZONE_GROUP TABLE               00110000
           05  HO017-SGT-STR-TYP-CDE        PIC 9(04).                  00120000
           05  FILLER                       PIC X(01).                  00130000
           05  HO017-SGT-STR-GP-CTG-NM      PIC X(30).                  00140000
