      *---------------------------------------------------------------* 00010001
      *                                                               * 00020001
      *    HORD023 - LOCATION DOMAIN COPYBOOK                         * 00030001
      *    REPRESENTS DATA FROM RMS K_EMT_PRICE_ZONE_DATE TABLE       * 00040001
      *    LENGTH  - XXX BYTES                                        * 00050001
      *    WR/PITS#     DATE        DESCRIPTION                       * 00060001
      *    --------   --------     -----------------------------      * 00070001
      *    WR25285    08/26/2003   INITIAL INSTALLATION.              * 00080001
      *---------------------------------------------------------------* 00090001
       01  HO023-PRICE-ZNE-DTE-DATA.                                    00100000
      *-- REPRESENTS DATA FROM RMS K_EMT_PRICE_ZONE_DATE TABLE          00110000
           05  HO023-PZD-GP-ID              PIC 9(04).                  00120000
           05  FILLER                       PIC X(01).                  00130000
           05  HO023-PZD-ZNE-ID             PIC 9(04).                  00140000
           05  FILLER                       PIC X(01).                  00150000
           05  HO023-PZD-EFF-STRT-DTE       PIC X(10).                  00160000
           05  HO023-PZD-STR-GP-ID          PIC 9(10).                  00170000
           05  FILLER                       PIC X(01).                  00180000
           05  HO023-PZD-EFF-END-DTE        PIC X(10).                  00190000
