      *---------------------------------------------------------------* 00010001
      *    HORD018 - STORE GROUP DOMAIN COPYBOOK                      * 00020001
      *              REPRESENTS DATA FROM THE RMS PRICE_ZONE AND      * 00030001
      *              K_EMT_METRO_PRICE_ZONE TABLES                    * 00040001
      *    LENGTH  - 43 BYTES                                         * 00050001
      *    WR/PITS#     DATE        DESCRIPTION                       * 00060001
      *    --------   --------     -----------------------------      * 00070001
      *    WR25285    08/26/2003   INITIAL CREATION                   * 00080001
      *---------------------------------------------------------------* 00090001
       01  HO018-STR-GP-DATA.                                           00100000
           05  HO018-SGD-STR-GP-TYP-CDE     PIC 9(04).                  00110000
           05  FILLER                       PIC X(01).                  00120000
           05  HO018-SGD-STR-GP-ID          PIC 9(04).                  00130000
           05  FILLER                       PIC X(01).                  00140000
           05  HO018-SGD-GP-NM              PIC X(30).                  00150000
           05  HO018-SGD-ST-CDE             PIC X(02).                  00160000
           05  HO018-SGD-RPT-FLSH-SLS-IND   PIC X(01).                  00170000
