      *---------------------------------------------------------------* 00010001
      *    HORD016 - DC LOCATION ASSIGNMENT DOMAIN COPYBOOK           * 00020001
      *              REPRESENTS DATA FROM THE WH_STORE_ASSIGN TABLE   * 00030001
      *    LENGTH  - 30 BYTES                                         * 00040001
      *    WR/PITS#     DATE        DESCRIPTION                       * 00050001
      *    --------   --------     -----------------------------      * 00060001
      *    WR25285    08/26/2003   INITIAL CREATION                   * 00070001
      *---------------------------------------------------------------* 00080001
       01  HO016-DCLOCASG-DATA.                                         00090000
      *-- REPRESENTS DATA FROM RMS WH_STORE_ASSIGN TABLE                00100000
           05  HO016-DCLOC-LOC-NBR          PIC 9(04).                  00110000
           05  FILLER                       PIC X(01).                  00120000
           05  HO016-DCLOC-EFF-BEG-DTE      PIC X(10).                  00130000
           05  HO016-DCLOC-DC-NBR           PIC 9(04).                  00140000
           05  FILLER                       PIC X(01).                  00150000
           05  HO016-DCLOC-PO-STRT-DTE      PIC X(10).                  00160000
