      *---------------------------------------------------------------* 00010001
      *    HORD019 - STORE GROUP MEMBERSHIP DOMAIN COPYBOOK           * 00020001
      *              REPRESENTS DATA FROM THE RMS                     * 00030001
      *              K_EMT_ZONE_STORE_DATE TABLE                      * 00040001
      *    LENGTH  - 35 BYTES                                         * 00050001
      *    WR/PITS#     DATE        DESCRIPTION                       * 00060001
      *    --------   --------     -----------------------------      * 00070001
      *    WR25285    08/26/2003   INITIAL CREATION                   * 00080001
      *---------------------------------------------------------------* 00090001
       01  HO019-STR-GP-MBRSHP-DATA.                                    00100000
      *-- REPRESENTS DATA FROM RMS K_EMT_ZONE_STORE_DATE TABLE          00110000
           05  HO019-STR-NBR                PIC 9(04).                  00120000
           05  FILLER                       PIC X(01).                  00130000
           05  HO019-STR-GP-TYP-CDE         PIC 9(04).                  00140000
           05  FILLER                       PIC X(01).                  00150000
           05  HO019-STR-GP-ID              PIC 9(04).                  00160000
           05  FILLER                       PIC X(01).                  00170000
           05  HO019-STR-EFF-BEG-DTE        PIC X(10).                  00180000
           05  HO019-STR-EFF-END-DTE        PIC X(10).                  00190000
