      ***************************************************************** 00010000
      **ICRD036 - USA COUNTS DATA WAREHOUSE EXTRACTION FILE             00020002
      ***************************************************************** 00030000
       01  ICRD036-IC-COUNTS-FILE.                                      00040000
           05  ICRD036-CNT-STUP-ID           PIC  S9(9) COMP.           00050005
           05  ICRD036-LOC-NBR               PIC  S9(4) COMP.           00050113
           05  ICRD036-SKU-NBR               PIC  S9(8)V COMP-3.        00050213
           05  ICRD036-LAST-UPD-TMST         PIC  X(26).                00050313
           05  ICRD036-CNT-SEQ-NBR           PIC  S9(4) COMP.           00050413
           05  ICRD036-LAST-ACTN-CDE         PIC  X.                    00050513
           05  ICRD036-LAST-UPD-USR-ID       PIC  X(8).                 00050613
           05  ICRD036-LOC-EXPTED-UNT-QTY    PIC  S9(9) COMP.           00060001
           05  ICRD036-UNT-RTL-AMT           PIC  S9(7)V9(2) COMP-3.    00061002
           05  ICRD036-SCND-UNT-QTY          PIC  S9(9) COMP.           00062010
           05  ICRD036-SCND-UNT-QTY-NI       PIC  X.                    00063016
             88 SCND-UNT-QTY-IS-NULL              VALUE '?'.            00066016
             88 SCND-UNT-QTY-NOT-NULL             VALUE ' '.            00067016
           05  ICRD036-IN-TRNST-UNT-QTY      PIC  S9(9) COMP.           00070001
           05  ICRD036-IN-TRNST-UNT-QTY-NI   PIC  X.                    00071016
             88 IN-TRNST-UNT-QTY-IS-NULL          VALUE '?'.            00073116
             88 IN-TRNST-UNT-QTY-NOT-NULL         VALUE ' '.            00073216
           05  ICRD036-ACPTD-TRUK-QTY        PIC  S9(9) COMP.           00080010
           05  ICRD036-ACPTD-TRUK-QTY-NI     PIC  X.                    00081016
             88 ACPTD-TRUK-QTY-IS-NULL            VALUE '?'.            00084016
             88 ACPTD-TRUK-QTY-NOT-NULL           VALUE ' '.            00085016
           05  ICRD036-RTL-SAL-UNT-QTY       PIC  S9(9) COMP.           00090001
           05  ICRD036-RTL-SAL-UNT-QTY-NI    PIC  X.                    00091016
             88 RTL-SAL-UNT-QTY-IS-NULL           VALUE '?'.            00094016
             88 RTL-SAL-UNT-QTY-NOT-NULL          VALUE ' '.            00095016
           05  ICRD036-RTL-RET-UNT-QTY       PIC  S9(9) COMP.           00100001
           05  ICRD036-RTL-RET-UNT-QTY-NI    PIC  X.                    00101016
             88 RTL-RET-UNT-QTY-IS-NULL           VALUE '?'.            00104016
             88 RTL-RET-UNT-QTY-NOT-NULL          VALUE ' '.            00105016
           05  ICRD036-XFER-IN-UNT-QTY       PIC  S9(9) COMP.           00110001
           05  ICRD036-XFER-IN-UNT-QTY-NI    PIC  X.                    00111016
             88 XFER-IN-UNT-QTY-IS-NULL           VALUE '?'.            00114016
             88 XFER-IN-UNT-QTY-NOT-NULL          VALUE ' '.            00115016
           05  ICRD036-XFER-OUT-UNT-QTY      PIC  S9(9) COMP.           00120001
           05  ICRD036-XFER-OUT-UNT-QTY-NI   PIC  X.                    00121016
             88 XFER-OUT-UNT-QTY-IS-NULL          VALUE '?'.            00124016
             88 XFER-OUT-UNT-QTY-NOT-NULL         VALUE ' '.            00125016
           05  ICRD036-EXEC-TMST             PIC  X(26).                00130013
