000100*****************************************************************         
000200* USA INVENTORY CONTROL UPDATED APPROVED, AUTO APPROVED, AND              
000201* REVERSED COUNTS FILE LAYOUT                                             
111890* CHG0111890                                                              
111890* 05/21/2015 - ADDING ICRD061-CNT-TYP-CDE FOR RFID IDENTIFICATION         
000300*****************************************************************         
000400 01  ICRD061-UPDATED-COUNTS-RECORD.                                       
000500     05  ICRD061-CNT-STAT-CDE        PIC X(03)   VALUE SPACES.            
000800     05  ICRD061-LOC-NBR             PIC S9(04)  COMP                     
000900                                                 VALUE ZEROS.             
000911     05  ICRD061-CNT-STUP-ID         PIC S9(09)  COMP                     
000912                                                 VALUE ZEROS.             
000913     05  ICRD061-CNT-SEQ-NBR         PIC S9(04)  COMP                     
000914                                                 VALUE ZEROS.             
000915     05  ICRD061-LAST-UPD-TMST       PIC X(26)   VALUE SPACES.            
000916     05  ICRD061-SKU-NBR             PIC S9(08)V COMP-3                   
000917                                                 VALUE ZEROS.             
000918     05  ICRD061-SALES-QTY           PIC S9(09)  COMP                     
000919                                                 VALUE ZEROS.             
000920     05  ICRD061-RETURNS-QTY         PIC S9(09)  COMP                     
000921                                                 VALUE ZEROS.             
000922     05  ICRD061-TRANS-IN-QTY        PIC S9(09)  COMP                     
000930                                                 VALUE ZEROS.             
000940     05  ICRD061-TRANS-OUT-QTY       PIC S9(09)  COMP                     
000950                                                 VALUE ZEROS.             
000960     05  ICRD061-SCANNED-UNT-QTY     PIC S9(09)  COMP                     
000970                                                 VALUE ZEROS.             
000980     05  ICRD061-START-ONHAND-QTY    PIC S9(09)  COMP                     
000990                                                 VALUE ZEROS.             
111890     05  ICRD061-CNT-TYP-CDE         PIC X(03)   VALUE SPACES.            
111890     05  FILLER                      PIC X(31)   VALUE SPACES.            
