      ***************************************************************** 00010000
      **ICRD037 - USA COUNTS DATA WAREHOUSE EXTRACTION FILE             00020001
      ***************************************************************** 00030000
       01  ICRD037-IC-COUNTS-FILE.                                      00040001
           05  ICRD037-CNT-STUP-ID           PIC  S9(9) COMP.           00050001
           05  ICRD037-LOC-NBR               PIC  S9(4) COMP.           00050102
           05  ICRD037-CNT-SEQ-NBR           PIC  S9(4) COMP.           00050201
           05  ICRD037-SKU-NBR               PIC  S9(8)V COMP-3.        00050402
           05  ICRD037-EXEC-TMST             PIC  X(26).                00050501
