      ***************************************************************** 00010000
      **ICRD057 - USA COUNTS COUNT/LOCATION/SKU EXPLOSION FILE          00020001
      ***************************************************************** 00030000
       01  ICRD057-IC-CNT-QTY-MAINT-FILE.                               00040003
           05  ICRD057-CNT-STUP-ID           PIC  S9(9) COMP            00050003
                                                         VALUE ZEROS.   00060000
           05  ICRD057-LOC-NBR               PIC  S9(4) COMP            00070003
                                                         VALUE ZEROS.   00080000
           05  ICRD057-SKU-NBR               PIC  S9(8)V COMP-3         00090003
                                                         VALUE ZEROS.   00100000
           05  ICRD057-CNT-SEQ-NBR           PIC  S9(4) COMP            00101007
                                                         VALUE ZEROS.   00102007
           05  ICRD057-UNT-RTL-AMT           PIC  S9(7)V9(2) COMP-3     00110003
                                                         VALUE ZEROS.   00120003
           05  ICRD057-LOC-EXPTED-UNT-QTY    PIC  S9(9) COMP            00130003
                                                         VALUE ZEROS.   00140003
           05  ICRD057-ACPTD-TRUK-UNT-QTY    PIC  S9(9) COMP            00150003
                                                         VALUE ZEROS.   00160003
           05  ICRD057-INTRANSIT-QTY         PIC  S9(9) COMP            00161005
                                                         VALUE ZEROS.   00162005
           05  ICRD057-ACTIVE-IND            PIC  X                     00170003
                                                         VALUE SPACE.   00180003
           05  ICRD057-EXEC-LVL-CDE          PIC  X(3)                  00190006
                                                         VALUE SPACE.   00200003
           05  ICRD057-ORIG-CLR-DTE          PIC  X(10)                 00210004
                                                         VALUE SPACE.   00220004
           05  ICRD057-SALES-QTY             PIC  S9(9) COMP            00230008
                                                         VALUE ZEROS.   00240008
           05  ICRD057-RETURN-QTY            PIC  S9(9) COMP            00250008
                                                         VALUE ZEROS.   00260008
           05  ICRD057-XFER-IN-QTY           PIC  S9(9) COMP            00270008
                                                         VALUE ZEROS.   00280008
           05  ICRD057-XFER-OUT-QTY          PIC  S9(9) COMP            00290008
                                                         VALUE ZEROS.   00300008
