000100*****************************************************************         
000200* USA INVENTORY CONTROL APPROVED, AUTO APPROVED, AND REVERSED             
000210* COUNTS FILE LAYOUT                                                      
000300*****************************************************************         
000400 01  ICRD060-APRVD-COUNTS-RECORD.                                         
000500     05  ICRD060-CNT-STAT-CDE        PIC X(03)   VALUE SPACES.            
000800     05  ICRD060-LOC-NBR             PIC S9(04)  COMP                     
000900                                                 VALUE ZEROS.             
000911     05  ICRD060-CNT-STUP-ID         PIC S9(09)  COMP                     
000912                                                 VALUE ZEROS.             
000914     05  ICRD060-CNT-SEQ-NBR         PIC S9(04)  COMP                     
000915                                                 VALUE ZEROS.             
000916     05  ICRD060-LAST-UPD-TMST       PIC X(26)   VALUE SPACES.            
000917     05  ICRD060-SKU-NBR             PIC S9(08)V COMP-3                   
000918                                                 VALUE ZEROS.             
C88463     05  ICRD060-CNT-TYP-CDE         PIC X(03)   VALUE SPACES.            
C88463     05  ICRD060-EXEC-DATE           PIC X(10)   VALUE SPACES.            
C88463     05  FILLER                      PIC X(15)   VALUE SPACES.            
