000100**************************************************************    00010000
000200*                     COPYBOOK ICRD205                       *    00020001
000300*   RECORD DEFINITION OF THE ICT_LOC_CNT_SUM TABLE AT THE    *    00030001
000310*     STORE ON THE SERVER SIDE.                              *    00031000
000400*          POS 2010 INFRASTRUCTURE PROJECT                   *    00040000
000500**************************************************************    00050000
000600 01  IC205-IC-LOC-CNT-SUM-RECORD.                                 00060002
000700   05 IC205-IC-LOC-CNT-SUM-HEADER.                                00070002
000800      10 IC205-FILE-ACT-TYP        PIC X(03) VALUE SPACES.        00080001
000900         88 IC205-FILE-CHANGE          VALUE 'CHG'.               00090001
001000         88 IC205-FILE-FULL            VALUE 'FUL'.               00100001
001010      10 IC205-RECORD-ACTION       PIC X(01) VALUE 'A'.           00101001
001100   05 IC205-IC-LOC-CNT-SUM-DATA.                                  00110002
001200      10 IC205-LOC-NBR             PIC X(05) VALUE ZEROES.        00120001
001300      10 IC205-STUP-ID             PIC X(10) VALUE SPACES.        00130001
001300      10 IC205-SEQ-NBR             PIC X(05) VALUE SPACES.        00130101
001300      10 IC205-LAST-UPD-TMST       PIC X(26) VALUE SPACES.        00131001
001200      10 IC205-EXP-UNT-QTY         PIC X(04) VALUE ZEROES.        00131102
001300      10 IC205-KYD-UNT-QTY         PIC X(02) VALUE SPACES.        00132002
001300      10 IC205-DEPT-NBR            PIC X(04) VALUE SPACES.        00132102
001300      10 IC205-MAJ-CLS-CDE         PIC X(04) VALUE SPACES.        00133002
001300      10 IC205-SUB-CLS-CDE         PIC X(04) VALUE SPACES.        00134002
001300      10 IC205-STYLE-ID            PIC X(08) VALUE SPACES.        00135002
