      ***************************************************************** 00010000
      **ICRD056 - USA COUNTS CANCELLED COUNT FILE                       00020001
      ***************************************************************** 00030000
       01  ICRD056-CANC-IC-COUNTS-FILE.                                 00040001
           05  ICRD056-CNT-STUP-ID            PIC  9(10).               00050001
           05  ICRD056-LOC-NBR                PIC  9(04).               00060001
