      *=================================================================00010009
      *THIS COPYBOOK IS USED BY ICKUP059 FOR MULTI ROW INSERT.          00020011
      *CHG0063538.                                                      00030011
      *=================================================================00040009
       01 ARRAY-ISLC.                                                   00050009
         05 IC054-LOC-NBR                 PIC  S9(4) COMP               00060009
                                                    OCCURS 100 TIMES.   00070009
         05 IC054-SKU-NBR                 PIC  S9(8)V COMP-3            00080009
                                                    OCCURS 100 TIMES.   00090009
         05 IC054-CNT-STUP-ID             PIC  S9(9) COMP               00100009
                                                    OCCURS 100 TIMES.   00110009
         05 IC054-LAST-UPD-TMST           PIC   X(26)                   00120009
                                                    OCCURS 100 TIMES.   00130009
         05 IC054-CNT-SEQ-NBR             PIC  S9(4) COMP               00140009
                                                    OCCURS 100 TIMES.   00150009
         05 IC054-LAST-UPD-USR-ID         PIC   X(8)                    00160009
                                                    OCCURS 100 TIMES.   00170009
         05 IC054-LAST-ACTN-CDE           PIC   X(1)                    00180009
                                                    OCCURS 100 TIMES.   00190009
         05 IC054-UNT-RTL-AMT             PIC  S9(7)V9(2) COMP-3        00200009
                                                    OCCURS 100 TIMES.   00210009
         05 IC054-LOC-EXPTED-UNT-QTY      PIC  S9(9) COMP               00220009
                                                    OCCURS 100 TIMES.   00230009
         05 IC054-IN-TRNST-UNT-QTY        PIC  S9(9) COMP               00240009
                                                    OCCURS 100 TIMES.   00250009
         05 IC054-ACPTD-TRUK-UNT-QTY      PIC  S9(9) COMP               00260009
                                                    OCCURS 100 TIMES.   00270009
         05 IC054-RTL-SAL-UNT-QTY         PIC  S9(9) COMP               00280009
                                                    OCCURS 100 TIMES.   00290009
         05 IC054-RTL-RET-UNT-QTY         PIC  S9(9) COMP               00300009
                                                    OCCURS 100 TIMES.   00310009
         05 IC054-XFER-IN-UNT-QTY         PIC  S9(9) COMP               00320009
                                                    OCCURS 100 TIMES.   00330009
         05 IC054-XFER-OUT-UNT-QTY        PIC  S9(9) COMP               00340009
                                                    OCCURS 100 TIMES.   00350009
         05 IC054-SCND-UPC-NBR            PIC  S9(15)V COMP-3           00360009
                                                    OCCURS 100 TIMES.   00370009
         05 IC054-SCND-UNT-QTY            PIC  S9(9) COMP               00380009
                                                    OCCURS 100 TIMES.   00390009
         05 IC054-CNT-GP-CDE              PIC   X(1)                    00400009
                                                    OCCURS 100 TIMES.   00410009
         05 IC054-EXEC-TMST               PIC   X(26)                   00420009
                                                    OCCURS 100 TIMES.   00430009
         05 IC054-MDSE-EXPRN-DTE          PIC   X(10)                   00440009
                                                    OCCURS 100 TIMES.   00450009
         05 IC054-TRNST-UNT-QTY-NI        PIC S9(04) COMP VALUE ZERO    00460009
                                                    OCCURS 100 TIMES.   00470009
         05 IC054-TRUK-UNT-QTY-NI         PIC S9(4) COMP VALUE ZERO     00480009
                                                    OCCURS 100 TIMES.   00490009
         05 IC054-RTL-SAL-UNT-QTY-NI      PIC S9(4) COMP VALUE ZERO     00500009
                                                    OCCURS 100 TIMES.   00510009
         05 IC054-RTL-RET-UNT-QTY-NI      PIC S9(4) COMP VALUE ZERO     00520009
                                                    OCCURS 100 TIMES.   00530009
         05 IC054-XFER-IN-UNT-QTY-NI      PIC S9(4) COMP VALUE ZERO     00540009
                                                    OCCURS 100 TIMES.   00550009
         05 IC054-XFER-OUT-UNT-QTY-NI     PIC S9(4) COMP VALUE ZERO     00560009
                                                    OCCURS 100 TIMES.   00570009
         05 IC054-SCND-UPC-NBR-NI         PIC S9(4) COMP VALUE ZERO     00580009
                                                    OCCURS 100 TIMES.   00590009
         05 IC054-SCND-UNT-QTY-NI         PIC S9(4) COMP VALUE ZERO     00600009
                                                    OCCURS 100 TIMES.   00610009
         05 IC054-CNT-GP-CDE-NI           PIC S9(4) COMP VALUE ZERO     00620009
                                                    OCCURS 100 TIMES.   00630009
         05 IC054-EXEC-TMST-NI            PIC S9(4) COMP VALUE ZERO     00640010
                                                    OCCURS 100 TIMES.   00650010
         05 IC054-MDSE-EXPRN-DTE-NI       PIC S9(4) COMP VALUE ZERO     00660009
                                                    OCCURS 100 TIMES.   00670009
