      ******************************************************************        
      *    ICRD072 - ICT_LOC_CNT_STAT UNLOAD REFOMAT RECORD LAYOUT              
      *    RECORD LENGTH - 196                                                  
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
      *         12-14-2010 J.HELING    CREATION                                 
      ******************************************************************        
       01  IC072-OUTPUT-RECORD.                                                 
           05  IC072-CNT-STUP-ID             PIC  S9(10) SIGN LEADING           
                                                         SEPARATE.              
           05  IC072-LOC-NBR                 PIC  S9(5)  SIGN LEADING           
                                                         SEPARATE.              
           05  IC072-SKU-NBR                 PIC  S9(8)  SIGN LEADING           
                                                         SEPARATE.              
           05  IC072-LAST-UPD-TMST           PIC  X(26).                        
           05  IC072-CNT-SEQ-NBR             PIC  S9(5)  SIGN LEADING           
                                                         SEPARATE.              
           05  IC072-LAST-ACTN-CDE           PIC  X.                            
           05  IC072-LAST-UPD-USR-ID         PIC  X(8).                         
           05  IC072-LOC-EXPTED-UNT-QTY      PIC  S9(10) SIGN LEADING           
                                                         SEPARATE.              
           05  IC072-UNT-RTL-AMT             PIC  +9(11).99.                    
           05  IC072-SCND-UNT-QTY            PIC  S9(10) SIGN LEADING           
                                                         SEPARATE.              
           05  IC072-IN-TRNST-UNT-QTY        PIC  S9(10) SIGN LEADING           
                                                         SEPARATE.              
           05  IC072-ACPTD-TRUK-QTY          PIC  S9(10) SIGN LEADING           
                                                         SEPARATE.              
           05  IC072-RTL-SAL-UNT-QTY         PIC  S9(10) SIGN LEADING           
                                                         SEPARATE.              
           05  IC072-RTL-RET-UNT-QTY         PIC  S9(10) SIGN LEADING           
                                                         SEPARATE.              
           05  IC072-XFER-IN-UNT-QTY         PIC  S9(10) SIGN LEADING           
                                                         SEPARATE.              
           05  IC072-XFER-OUT-UNT-QTY        PIC  S9(10) SIGN LEADING           
                                                         SEPARATE.              
           05  IC072-EXEC-TMST               PIC  X(26).                        
