000100*****************************************************************         
000200* USA INVENTORY CONTROL DATABASE INSERT LAYOUT                            
000300*****************************************************************         
000400 01  ICRD087-DB-INSERT-RECORD        PIC X(225).                          
000400 01  ICRD087-DB-DETAIL-RECORD                                             
000400                             REDEFINES ICRD087-DB-INSERT-RECORD.          
000500     05  ICRD087-RECORD-COUNT        PIC 9(09).                           
000500     05  ICRD087-TABLE-CDE           PIC X(03).                           
000500         88 ICRD087-LOC-STAT         VALUE 'LCS'.                         
000500         88 ICRD087-SKU-LOC          VALUE 'SLC'.                         
000500         88 ICRD087-CNT-ODR          VALUE 'UCO'.                         
000800     05  ICRD087-LOC-NBR             PIC S9(04) COMP.                     
000911     05  ICRD087-CNT-STUP-ID         PIC S9(09) COMP.                     
000913     05  ICRD087-CNT-SEQ-NBR         PIC S9(04) COMP.                     
000915     05  ICRD087-LAST-UPD-TMST       PIC X(26).                           
000916     05  ICRD087-SKU-NBR             PIC S9(08)V COMP-3.                  
000918     05  ICRD087-UNT-RTL-AMT         PIC S9(07)V99 COMP-3.                
000920     05  ICRD087-LOC-EXP-UNT-QTY     PIC S9(09) COMP.                     
000922     05  ICRD087-IN-TRNST-UNT-QTY    PIC S9(09) COMP.                     
000940     05  ICRD087-ACPTD-TRUK-UNT-QTY  PIC S9(09) COMP.                     
000960     05  ICRD087-RTL-SAL-UNT-QTY     PIC S9(09) COMP.                     
000960     05  ICRD087-RTL-RET-UNT-QTY     PIC S9(09) COMP.                     
000980     05  ICRD087-XFER-IN-UNT-QTY     PIC S9(09) COMP.                     
111890     05  ICRD087-XFER-OUT-UNT-QTY    PIC S9(09) COMP.                     
111890     05  ICRD087-SCND-UPC-NBR-NULL   PIC X(01).                           
111890     05  ICRD087-SCND-UPC-NBR        PIC S9(15)V COMP-3.                  
111890     05  ICRD087-SCND-UNT-QTY-NULL   PIC X(01).                           
111890     05  ICRD087-SCND-UNT-QTY        PIC S9(09) COMP.                     
111890     05  ICRD087-CNT-GP-CDE-NULL     PIC X(01).                           
111890     05  ICRD087-CNT-GP-CDE          PIC X(01).                           
111890     05  ICRD087-EXEC-TMST           PIC X(26).                           
111890     05  ICRD087-MDSE-EXPRN-DTE-NULL PIC X(01).                           
111890     05  ICRD087-MDSE-EXPRN-DTE      PIC X(10).                           
111890     05  FILLER                      PIC X(10).                           
000400 01  ICRD087-DB-UPD-CNT-ODR-REC                                           
000400                             REDEFINES ICRD087-DB-INSERT-RECORD.          
000500     05  ICRD087-ODR-RECORD-CNT      PIC 9(09).                           
000500     05  ICRD087-ODR-TABLE-CDE       PIC X(03).                           
000500     05  ICRD087-UPD-CNT-ODR         PIC X(100).                          
111890     05  FILLER                      PIC X(125).                          
