000100**************************************************************    00010000
000200*                     COPYBOOK ICRD202                       *    00020001
000300*   RECORD DEFINITION OF THE ICT_CNT_STUP TABLE AT THE       *    00030001
000310*     STORE ON THE SERVER SIDE.                              *    00031001
000400*          POS 2010 INFRASTRUCTURE PROJECT                   *    00040000
000500**************************************************************    00050000
000600 01  IC202-IC-CNT-STUP-RECORD.                                    00060001
000700   05 IC202-IC-CNT-STUP-HEADER.                                   00070001
000800      10 IC202-FILE-ACT-TYP        PIC X(03) VALUE SPACES.        00080001
000900         88 IC202-FILE-CHANGE          VALUE 'CHG'.               00090001
001000         88 IC202-FILE-FULL            VALUE 'FUL'.               00100001
001010      10 IC202-RECORD-ACTION       PIC X(01) VALUE 'A'.           00101001
001100   05 IC202-IC-CNT-STUP-DATA.                                     00110001
001200      10 IC202-LOC-NBR             PIC X(05) VALUE ZEROES.        00120001
001300      10 IC202-STUP-ID             PIC X(10) VALUE SPACES.        00130001
001300      10 IC202-SUGG-EXEC-DTE       PIC X(10) VALUE SPACES.        00131001
001300      10 IC202-WND-STRT-DTE        PIC X(10) VALUE SPACES.        00132001
001300      10 IC202-WND-END-DTE         PIC X(10) VALUE SPACES.        00133001
001400      10 IC202-STAT-CDE-DESC       PIC X(30) VALUE SPACES.        00140001
001400      10 IC202-LVL-CDE             PIC X(03) VALUE SPACES.        00150001
