      ***************************************************************** 00010000
      **ICRD058 - REFORMAT OF TRUCKS FILE                               00020000
      ***************************************************************** 00030000
       01  ICRD058-REFORMAT-MANIFEST-FILE.                              00040000
           05  ICRD058-SKU-NBR                PIC S9(8)V COMP-3         00050000
                                                         VALUE ZEROS.   00060000
           05  ICRD058-LOC-NBR                PIC S9(04) COMP           00061000
                                                         VALUE ZEROS.   00062000
           05  ICRD058-INTR-UPC-ID            PIC S9(09) COMP           00070000
                                                         VALUE ZEROS.   00080000
           05  ICRD058-DEPT-NBR               PIC S9(04)V COMP-3        00090000
                                                         VALUE ZEROS.   00100000
           05  ICRD058-MNFST-QTY              PIC S9(04) COMP-3         00110000
                                                         VALUE ZEROS.   00120000
           05  ICRD058-BUS-GP-NBR             PIC S9(04)V COMP-3        00130000
                                                         VALUE ZEROS.   00140000
           05  ICRD058-MAJ-CL-NBR             PIC S9(04)V COMP-3        00150000
                                                         VALUE ZEROS.   00160000
