      ******************************************************************        
      *    ICRD071 - ICT_LOC_CNT_STAT UNLOAD REFOMAT RECORD LAYOUT              
      *    RECORD LENGTH - 117                                                  
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
      *         12-14-2010 J.HELING    CREATION                                 
      ******************************************************************        
       01  IC071-OUTPUT-RECORD.                                                 
           05  IC071-CNT-STAT-CDE            PIC  X(3).                         
           05  IC071-LOC-NBR                 PIC  S9(5)  SIGN LEADING           
                                                         SEPARATE.              
           05  IC071-CNT-STUP-ID             PIC  S9(10) SIGN LEADING           
                                                         SEPARATE.              
           05  IC071-CNT-SEQ-NBR             PIC  S9(5)  SIGN LEADING           
                                                         SEPARATE.              
           05  IC071-LAST-UPD-TMST           PIC  X(26).                        
           05  IC071-LAST-UPD-USR-ID         PIC  X(8).                         
           05  IC071-LAST-ACTN-CDE           PIC  X.                            
           05  IC071-USR-CMNT-TXT-LEN        PIC  S9(5)  SIGN LEADING           
                                                         SEPARATE.              
           05  IC071-USR-CMNT-TXT            PIC  X(50).                        
