      ******************************************************************        
      * WS TIMEZONE CONVERSION ROUTINE                                 *        
      ******************************************************************        
      * WORKING STORAGE AREA USED WITH CNVRTZPR PROCEDURE DIVISION              
      * INCLUDE.  THE ROUTINE THAT USES THIS WILL SET UP THE VARIABLES          
      * TO ALLOW CONVERTING TIMESTAMPS FROM CENTRAL TIME ZONE TO OTHER          
      * TIME ZONES WHILE ALSO CONSIDERING AREAS THAT DO NOT ADHERE TO           
      * DAYLIGHT SAVINGS TIME.                                                  
       01  TIME-ZONE-CONVERSION-VARIABLES.                                      
           05  ICWS010-CURR-TMZONE-TZC        PIC S9(6) COMP VALUE ZERO.        
      * THIS IS THE DIFFERENCE BETWEEN GMT (UTC) AND CENTRAL TIME ZONE          
      * WHEN DAYLIGHT SAVINGS TIME IS IN EFFECT (5 HOURS).                      
               88  ICWS010-DST-TZC            VALUE -050000.                    
      * THIS IS THE DIFFERENCE BETWEEN GMT (UTC) AND CENTRAL TIME ZONE          
      * WHEN DAYLIGHT SAVINGS TIME IS NOT IN EFFECT (6 HOURS).                  
               88  ICWS010-ST-TZC             VALUE -060000.                    
           05  ICWS010-CURR-TMST-TZC          PIC X(26)    VALUE SPACE.         
           05  ICWS010-TZC-LOCATION-TMST      PIC X(26)    VALUE SPACE.         
           05  ICWS010-TZC-TZ-IND-ST-IND      PIC X        VALUE SPACE.         
           05  ICWS010-TZC-TZ-IN-TM-ZN-CDE  PIC X(03)   VALUE SPACE.            
           05  ICWS010-CURR-TMST-WORK-TZC.                                      
               10  ICWS010-CURR-CC-WORK-TZC   PIC 99       VALUE ZERO.          
               10  ICWS010-CURR-YY-WORK-TZC   PIC 99       VALUE ZERO.          
               10  FILLER                     PIC X.                            
               10  ICWS010-CURR-MM-WORK-TZC   PIC 99       VALUE ZERO.          
               10  FILLER                     PIC X.                            
               10  ICWS010-CURR-DD-WORK-TZC   PIC 99       VALUE ZERO.          
               10  FILLER                     PIC X.                            
               10  ICWS010-CURR-HH-WORK-TZC   PIC 99       VALUE ZERO.          
               10  FILLER                     PIC X.                            
               10  ICWS010-CURR-MM-WORK-TZC   PIC 99       VALUE ZERO.          
               10  FILLER                     PIC X.                            
               10  ICWS010-CURR-SS-WORK-TZC   PIC 99       VALUE ZERO.          
               10  FILLER                     PIC X.                            
               10  ICWS010-CURR-MS-WORK-TZC   PIC 999999   VALUE ZERO.          
           05  ICWS010-ETZ-TMST-TZC           PIC X(26)    VALUE SPACE.         
           05  ICWS010-CTZ-TMST-TZC           PIC X(26)    VALUE SPACE.         
           05  ICWS010-MTZ-TMST-TZC           PIC X(26)    VALUE SPACE.         
           05  ICWS010-PTZ-TMST-TZC           PIC X(26)    VALUE SPACE.         
           05  ICWS010-ATZ-TMST-TZC           PIC X(26)    VALUE SPACE.         
           05  ICWS010-ETZ-TMST-NO-DST-TZC    PIC X(26)    VALUE SPACE.         
           05  ICWS010-CTZ-TMST-NO-DST-TZC    PIC X(26)    VALUE SPACE.         
           05  ICWS010-MTZ-TMST-NO-DST-TZC    PIC X(26)    VALUE SPACE.         
           05  ICWS010-PTZ-TMST-NO-DST-TZC    PIC X(26)    VALUE SPACE.         
           05  ICWS010-ATZ-TMST-NO-DST-TZC    PIC X(26)    VALUE SPACE.         
