        PRINT  NOGEN                                                            
IMKM313 DFHMSD TYPE=DSECT,                                             C        
               LANG=COBOL,                                             C        
               MODE=INOUT,                                             C        
               STORAGE=AUTO,                                           C        
               TERM=3270-2,                                            C        
               TIOAPFX=YES                                                      
**************                                                                  
IM313A  DFHMDI LINE=2,COLUMN=1,                                        C        
               SIZE=(19,80),                                           C        
               CTRL=(FREEKB),                                          C        
               MAPATTS=(COLOR,HILIGHT),                                C        
               DSATTS=(COLOR,HILIGHT)                                           
**************                                                                  
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='DEPT:',                                        X        
               LENGTH=5,                                               X        
               COLOR=NEUTRAL,                                          X        
               POS=(02,03)                                                      
ADEPT   DFHMDF ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               LENGTH=3,                                               X        
               POS=(2,10)                                                       
ADESC   DFHMDF ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               LENGTH=25,                                              X        
               POS=(2,15)                                                       
*                                                                               
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,INITIAL='ITEMS'                                    
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE,                                             C        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE,                                             C        
               PICOUT='ZZZZ9'                                                   
*                                                                               
        DFHMDF POS=(03,05),LENGTH=03,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='SEL'                                                    
        DFHMDF POS=(03,10),LENGTH=18,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='VENDOR DESCRIPTION'                                     
        DFHMDF POS=(03,42),LENGTH=08,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='VND_STAT'                                               
        DFHMDF POS=(03,52),LENGTH=08,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='DPT_STAT'                                               
*                                                                               
ASEL01  DFHMDF POS=(04,06),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(04,08),LENGTH=01,ATTRB=(ASKIP)                              
AVNDR01 DFHMDF POS=(04,10),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNST01 DFHMDF POS=(04,45),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADPST01 DFHMDF POS=(04,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASEL02  DFHMDF POS=(05,06),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(05,08),LENGTH=01,ATTRB=(ASKIP)                              
AVNDR02 DFHMDF POS=(05,10),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNST02 DFHMDF POS=(05,45),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADPST02 DFHMDF POS=(05,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASEL03  DFHMDF POS=(06,06),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(06,08),LENGTH=01,ATTRB=(ASKIP)                              
AVNDR03 DFHMDF POS=(06,10),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNST03 DFHMDF POS=(06,45),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADPST03 DFHMDF POS=(06,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASEL04  DFHMDF POS=(07,06),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(07,08),LENGTH=01,ATTRB=(ASKIP)                              
AVNDR04 DFHMDF POS=(07,10),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNST04 DFHMDF POS=(07,45),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADPST04 DFHMDF POS=(07,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASEL05  DFHMDF POS=(08,06),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(08,08),LENGTH=01,ATTRB=(ASKIP)                              
AVNDR05 DFHMDF POS=(08,10),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNST05 DFHMDF POS=(08,45),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADPST05 DFHMDF POS=(08,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASEL06  DFHMDF POS=(09,06),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(09,08),LENGTH=01,ATTRB=(ASKIP)                              
AVNDR06 DFHMDF POS=(09,10),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNST06 DFHMDF POS=(09,45),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADPST06 DFHMDF POS=(09,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASEL07  DFHMDF POS=(10,06),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(10,08),LENGTH=01,ATTRB=(ASKIP)                              
AVNDR07 DFHMDF POS=(10,10),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNST07 DFHMDF POS=(10,45),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADPST07 DFHMDF POS=(10,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASEL08  DFHMDF POS=(11,06),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(11,08),LENGTH=01,ATTRB=(ASKIP)                              
AVNDR08 DFHMDF POS=(11,10),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNST08 DFHMDF POS=(11,45),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADPST08 DFHMDF POS=(11,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASEL09  DFHMDF POS=(12,06),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(12,08),LENGTH=01,ATTRB=(ASKIP)                              
AVNDR09 DFHMDF POS=(12,10),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNST09 DFHMDF POS=(12,45),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADPST09 DFHMDF POS=(12,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASEL10  DFHMDF POS=(13,06),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(13,08),LENGTH=01,ATTRB=(ASKIP)                              
AVNDR10 DFHMDF POS=(13,10),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNST10 DFHMDF POS=(13,45),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADPST10 DFHMDF POS=(13,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASEL11  DFHMDF POS=(14,06),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(14,08),LENGTH=01,ATTRB=(ASKIP)                              
AVNDR11 DFHMDF POS=(14,10),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNST11 DFHMDF POS=(14,45),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADPST11 DFHMDF POS=(14,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASEL12  DFHMDF POS=(15,06),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(15,08),LENGTH=01,ATTRB=(ASKIP)                              
AVNDR12 DFHMDF POS=(15,10),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNST12 DFHMDF POS=(15,45),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADPST12 DFHMDF POS=(15,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASEL13  DFHMDF POS=(16,06),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(16,08),LENGTH=01,ATTRB=(ASKIP)                              
AVNDR13 DFHMDF POS=(16,10),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNST13 DFHMDF POS=(16,45),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADPST13 DFHMDF POS=(16,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASEL14  DFHMDF POS=(17,06),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(17,08),LENGTH=01,ATTRB=(ASKIP)                              
AVNDR14 DFHMDF POS=(17,10),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNST14 DFHMDF POS=(17,45),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADPST14 DFHMDF POS=(17,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASEL15  DFHMDF POS=(18,06),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(18,08),LENGTH=01,ATTRB=(ASKIP)                              
AVNDR15 DFHMDF POS=(18,10),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNST15 DFHMDF POS=(18,45),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADPST15 DFHMDF POS=(18,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'                
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                                      
**************                                                                  
        DFHMSD TYPE=FINAL                                                       
**************                                                                  
        END                                                                     
