*          DATA SET IMKM314    AT LEVEL 001 AS OF 10/31/05                      
  PRINT  NOGEN                                                                  
*-------------------------------------------------------------------*           
*                                                                   *           
*        MAPSET  IMKM314                                            *           
*        MAP     IM314A                                             *           
*        PROGRAM IMKCS314                                           *           
*        TRANSID I314 - BRAND/VENDOR RELATIONSHIP ADD               *           
*        SYSTEM  CICS ARCHITECTURE                                  *           
*                                                                   *           
*-------------------------------------------------------------------*           
IMKM314 DFHMSD TYPE=MAP,                                               X        
               MODE=INOUT,                                             X        
               LANG=COBOL,                                             X        
               TIOAPFX=YES,                                            X        
               CTRL=(FREEKB)                                                    
IM314A  DFHMDI LINE=2,COLUMN=1,                                        X        
               SIZE=(19,80),                                           X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='DEPARTMENT.........:',                         X        
               LENGTH=20,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(02,03)                                                      
ADEPT   DFHMDF ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=3,                                               X        
               COLOR=BLUE,                                             X        
               POS=(02,24)                                                      
ADESC   DFHMDF ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               LENGTH=25,                                              X        
               POS=(2,28)                                                       
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=1,                                               X        
               POS=(2,56)                                                       
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='BRAND DESCRIPTION..:',                         X        
               LENGTH=20,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(04,03)                                                      
ABRAND  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=20,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(04,24)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=1,                                               X        
               COLOR=NEUTRAL,                                          X        
               POS=(04,45)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='VENDOR DESCRIPTION.:',                         X        
               LENGTH=20,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(06,03)                                                      
AVENDR  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=30,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(06,24)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=1,                                               X        
               COLOR=NEUTRAL,                                          X        
               POS=(06,55)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='BEGIN DATE (MMDDYY):',                         X        
               LENGTH=20,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(08,03)                                                      
ABEGDT  DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X        
               LENGTH=6,                                               X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(08,24)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=1,                                               X        
               COLOR=NEUTRAL,                                          X        
               POS=(08,31)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='END DATE (MMDDYY)..:',                         X        
               LENGTH=20,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(10,03)                                                      
AENDDT  DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X        
               LENGTH=6,                                               X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(10,24)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=1,                                               X        
               COLOR=NEUTRAL,                                          X        
               POS=(10,31)                                                      
*                                                                               
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
