        PRINT  NOGEN                                                            
IMKM315 DFHMSD TYPE=DSECT,                                             C        
               LANG=COBOL,                                             C        
               MODE=INOUT,                                             C        
               STORAGE=AUTO,                                           C        
               TERM=3270-2,                                            C        
               TIOAPFX=YES                                                      
**************                                                                  
IM315A  DFHMDI LINE=2,COLUMN=1,                                        C        
               SIZE=(19,80),                                           C        
               CTRL=(FREEKB),                                          C        
               MAPATTS=(COLOR,HILIGHT),                                C        
               DSATTS=(COLOR,HILIGHT)                                           
**************                                                                  
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='DEPT....:',                                    X        
               LENGTH=9,                                               X        
               COLOR=NEUTRAL,                                          X        
               POS=(02,01)                                                      
ADEPT   DFHMDF ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               LENGTH=3,                                               X        
               POS=(02,11)                                                      
ADESC   DFHMDF ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               LENGTH=25,                                              X        
               POS=(02,15)                                                      
*                                                                               
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,INITIAL='ITEMS'                                    
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE,                                             C        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE,                                             C        
               PICOUT='ZZZZ9'                                                   
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='SHOW ALL:',                                    X        
               LENGTH=9,                                               X        
               COLOR=NEUTRAL,                                          X        
               POS=(03,01)                                                      
ASHOALL DFHMDF ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               LENGTH=1,                                               X        
               POS=(03,11)                                                      
*                                                                               
        DFHMDF POS=(04,01),LENGTH=01,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='S'                                                      
        DFHMDF POS=(04,03),LENGTH=03,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='ACT'                                                    
        DFHMDF POS=(04,07),LENGTH=17,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='BRAND DESCRIPTION'                                      
        DFHMDF POS=(04,28),LENGTH=18,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='VENDOR DESCRIPTION'                                     
        DFHMDF POS=(04,59),LENGTH=19,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='BEG DATE   END DATE'                                    
*                                                                               
ASEL01  DFHMDF POS=(05,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
AACT01  DFHMDF POS=(05,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABRND01 DFHMDF POS=(05,07),LENGTH=20,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNDR01 DFHMDF POS=(05,28),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABEGD01 DFHMDF POS=(05,59),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AENDD01 DFHMDF POS=(05,70),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL02  DFHMDF POS=(06,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
AACT02  DFHMDF POS=(06,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABRND02 DFHMDF POS=(06,07),LENGTH=20,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNDR02 DFHMDF POS=(06,28),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABEGD02 DFHMDF POS=(06,59),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AENDD02 DFHMDF POS=(06,70),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL03  DFHMDF POS=(07,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
AACT03  DFHMDF POS=(07,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABRND03 DFHMDF POS=(07,07),LENGTH=20,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNDR03 DFHMDF POS=(07,28),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABEGD03 DFHMDF POS=(07,59),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AENDD03 DFHMDF POS=(07,70),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL04  DFHMDF POS=(08,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
AACT04  DFHMDF POS=(08,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABRND04 DFHMDF POS=(08,07),LENGTH=20,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNDR04 DFHMDF POS=(08,28),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABEGD04 DFHMDF POS=(08,59),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AENDD04 DFHMDF POS=(08,70),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL05  DFHMDF POS=(09,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
AACT05  DFHMDF POS=(09,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABRND05 DFHMDF POS=(09,07),LENGTH=20,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNDR05 DFHMDF POS=(09,28),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABEGD05 DFHMDF POS=(09,59),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AENDD05 DFHMDF POS=(09,70),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL06  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
AACT06  DFHMDF POS=(10,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABRND06 DFHMDF POS=(10,07),LENGTH=20,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNDR06 DFHMDF POS=(10,28),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABEGD06 DFHMDF POS=(10,59),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AENDD06 DFHMDF POS=(10,70),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL07  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
AACT07  DFHMDF POS=(11,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABRND07 DFHMDF POS=(11,07),LENGTH=20,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNDR07 DFHMDF POS=(11,28),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABEGD07 DFHMDF POS=(11,59),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AENDD07 DFHMDF POS=(11,70),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL08  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
AACT08  DFHMDF POS=(12,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABRND08 DFHMDF POS=(12,07),LENGTH=20,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNDR08 DFHMDF POS=(12,28),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABEGD08 DFHMDF POS=(12,59),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AENDD08 DFHMDF POS=(12,70),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL09  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
AACT09  DFHMDF POS=(13,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABRND09 DFHMDF POS=(13,07),LENGTH=20,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNDR09 DFHMDF POS=(13,28),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABEGD09 DFHMDF POS=(13,59),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AENDD09 DFHMDF POS=(13,70),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL10  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
AACT10  DFHMDF POS=(14,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABRND10 DFHMDF POS=(14,07),LENGTH=20,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNDR10 DFHMDF POS=(14,28),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABEGD10 DFHMDF POS=(14,59),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AENDD10 DFHMDF POS=(14,70),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL11  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
AACT11  DFHMDF POS=(15,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABRND11 DFHMDF POS=(15,07),LENGTH=20,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNDR11 DFHMDF POS=(15,28),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABEGD11 DFHMDF POS=(15,59),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AENDD11 DFHMDF POS=(15,70),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL12  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
AACT12  DFHMDF POS=(16,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABRND12 DFHMDF POS=(16,07),LENGTH=20,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNDR12 DFHMDF POS=(16,28),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABEGD12 DFHMDF POS=(16,59),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AENDD12 DFHMDF POS=(16,70),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL13  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
AACT13  DFHMDF POS=(17,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABRND13 DFHMDF POS=(17,07),LENGTH=20,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNDR13 DFHMDF POS=(17,28),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABEGD13 DFHMDF POS=(17,59),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AENDD13 DFHMDF POS=(17,70),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL14  DFHMDF POS=(18,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
AACT14  DFHMDF POS=(18,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABRND14 DFHMDF POS=(18,07),LENGTH=20,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVNDR14 DFHMDF POS=(18,28),LENGTH=30,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ABEGD14 DFHMDF POS=(18,59),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AENDD14 DFHMDF POS=(18,70),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'                
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                                      
**************                                                                  
        DFHMSD TYPE=FINAL                                                       
**************                                                                  
        END                                                                     
