       01  IM098-SIZE-DESC-REC.                                                 
           05  IM098-BUS-EVENT              PIC   X(03).                        
           05  IM098-SIZE-CODE              PIC   9(09).                        
           05  IM098-SIZE-DESC              PIC   X(10).                        
           05  IM098-UPC-ID                 PIC  S9(9) COMP.                    
           05  IM098-UPC-TYP-CDE            PIC   X(01).                        
           05  IM098-SIZE-DESC-FILLER       PIC   X(33).                        
