000100 01  IM002-ERROR-REASONS-AREA.                                    00010000
000110     05  IM002-ERROR-REASONS.                                     00011000
000120         10  IM002-REASON-01             PIC  X(32)  VALUE        00012000
000130             'COLOR NOT SETUP                 '.                  00013000
000140         10  IM002-REASON-02             PIC  X(32)  VALUE        00014000
000150             'SIZE NOT SETUP                  '.                  00015000
000151         10  IM002-REASON-03             PIC  X(32)  VALUE        00015100
000152             'SIZE NOT ACTIVE                 '.                  00015200
000153         10  IM002-REASON-04             PIC  X(32)  VALUE        00015300
000154             'SIZE NOT SETUP FOR DEPT         '.                  00015400
000155         10  IM002-REASON-05             PIC  X(32)  VALUE        00015500
000156             'SIZE NOT ACTIVE - INV SIZE DATE '.                  00015600
000157         10  IM002-REASON-06             PIC  X(32)  VALUE        00015700
000158             'VENDOR NOT SETUP                '.                  00015800
000159         10  IM002-REASON-07             PIC  X(32)  VALUE        00015900
000160             'GROUP PRICE NOT SETUP           '.                  00016000
000161         10  IM002-REASON-08             PIC  X(32)  VALUE        00016100
000162             'UNIT OF MEASURE NOT SETUP-COST  '.                  00016200
000163         10  IM002-REASON-09             PIC  X(32)  VALUE        00016300
000164             'UNIT OF MEASURE NOT SETUP-RETAIL'.                  00016400
000165         10  IM002-REASON-10             PIC  X(32)  VALUE        00016500
000166             'LABEL NOT SETUP                 '.                  00016600
000167         10  IM002-REASON-11             PIC  X(32)  VALUE        00016700
000168             'TICKET TYPE NOT SETUP FOR DEPT  '.                  00016800
000169         10  IM002-REASON-12             PIC  X(32)  VALUE        00016900
000170             'NO PRIMARY TICKET TYPE FOR SCL  '.                  00017000
000171         10  IM002-REASON-13             PIC  X(32)  VALUE        00017100
000172             'NO PRIMARY TICKET TYPE FOR MCL  '.                  00017200
000173         10  IM002-REASON-14             PIC  X(32)  VALUE        00017300
000174             'NO PRIMARY TICKET TYPE FOR DPT  '.                  00017400
000175         10  IM002-REASON-15             PIC  X(32)  VALUE        00017500
000176             'MULT PRIM TICKET TYPES FOR SCL  '.                  00017600
000177         10  IM002-REASON-16             PIC  X(32)  VALUE        00017700
000178             'MULT PRIM TICKET TYPES FOR MCL  '.                  00017800
000179         10  IM002-REASON-17             PIC  X(32)  VALUE        00017900
000180             'MULT PRIM TICKET TYPES FOR DPT  '.                  00018000
000181         10  IM002-REASON-18             PIC  X(32)  VALUE        00018100
000182             'UNIT MEAS VARIES ACROSS SKUS-CST'.                  00018200
000183         10  IM002-REASON-19             PIC  X(32)  VALUE        00018300
000184             'UNIT MEAS VARIES ACROSS SKUS-RTL'.                  00018400
000185         10  IM002-REASON-20             PIC  X(32)  VALUE        00018500
000186             'STICKER NBR VARIES ACROSS SCL   '.                  00018616
000187         10  IM002-REASON-21             PIC  X(32)  VALUE        00018700
000188             'MULT PRICE PT VARIES ACROSS SKUS'.                  00018800
000189         10  IM002-REASON-22             PIC  X(32)  VALUE        00018900
000190             'KEY ITEM VARIES ACROSS SKUS     '.                  00019000
000191         10  IM002-REASON-23             PIC  X(32)  VALUE        00019100
000192             'LABEL VARIES ACROSS SCL         '.                  00019216
000193         10  IM002-REASON-24             PIC  X(32)  VALUE        00019300
000194             'SKU DESCRIPT VARIES ACROSS SKUS '.                  00019400
000195         10  IM002-REASON-25             PIC  X(32)  VALUE        00019500
000196             'CURRENT UNIT RETAIL EQUALS .01  '.                  00019600
000197         10  IM002-REASON-26             PIC  X(32)  VALUE        00019713
000198             'STICKER NUMBER NOT NUMERIC      '.                  00019800
000199         10  IM002-REASON-27             PIC  X(32)  VALUE        00019912
000200             'TKT TYPE MISSING FOR SCL/MCL/DPT'.                  00020017
000201         10  IM002-REASON-28             PIC  X(32)  VALUE        00020114
000202             '*** NO ERRORS FOR THIS DEPT *** '.                  00020214
000203         10  IM002-REASON-29             PIC  X(32)  VALUE        00020316
000204             'CLEANSING SIZE NOT SETUP        '.                  00020415
000205         10  FILLER                      PIC  X(672)  VALUE       00020515
000206             SPACES.                                              00020600
000207     05  IM002-ERROR-REASONS-TABLE REDEFINES IM002-ERROR-REASONS  00020700
000208                                         PIC  X(32)               00020800
000210                                         OCCURS 50 TIMES.         00021000
000300                                                                  00030000
004300 01  IM002-ERROR-TABLES-AREA.                                     00430000
004400     05  IM002-ERROR-TABLES.                                      00440000
004500         10  IM002-TABLE-01              PIC  X(07)  VALUE        00450000
004600             'TCOLOR '.                                           00460000
004700         10  IM002-TABLE-02              PIC  X(07)  VALUE        00470000
004800             'TSIZE  '.                                           00480000
004900         10  IM002-TABLE-03              PIC  X(07)  VALUE        00490000
005000             'TSIZE  '.                                           00500000
005010         10  IM002-TABLE-04              PIC  X(07)  VALUE        00501000
005020             'TDSZMEM'.                                           00502000
005030         10  IM002-TABLE-05              PIC  X(07)  VALUE        00503000
005040             'TSIZE  '.                                           00504000
005100         10  IM002-TABLE-06              PIC  X(07)  VALUE        00510000
005200             'TEXTENT'.                                           00520000
005300         10  IM002-TABLE-07              PIC  X(07)  VALUE        00530000
005400             'TMEITGP'.                                           00540000
005500         10  IM002-TABLE-08              PIC  X(07)  VALUE        00550000
005600             'TUNMSR '.                                           00560000
005700         10  IM002-TABLE-09              PIC  X(07)  VALUE        00570000
005800             'TUNTMSR'.                                           00580000
005900         10  IM002-TABLE-10              PIC  X(07)  VALUE        00590000
006000             'TVSCHVL'.                                           00600000
006100         10  IM002-TABLE-11              PIC  X(07)  VALUE        00610000
006200             'TDCVSVL'.                                           00620000
006300         10  IM002-TABLE-12              PIC  X(07)  VALUE        00630000
006400             'TDCVSVL'.                                           00640000
006500         10  IM002-TABLE-13              PIC  X(07)  VALUE        00650000
006600             'TDCVSVL'.                                           00660000
006700         10  IM002-TABLE-14              PIC  X(07)  VALUE        00670000
006800             'TDCVSVL'.                                           00680000
006810         10  IM002-TABLE-15              PIC  X(07)  VALUE        00681000
006820             'TDCVSVL'.                                           00682000
006830         10  IM002-TABLE-16              PIC  X(07)  VALUE        00683000
006840             'TDCVSVL'.                                           00684000
006850         10  IM002-TABLE-17              PIC  X(07)  VALUE        00685000
006860             'TDCVSVL'.                                           00686000
006900         10  IM002-TABLE-18              PIC  X(07)  VALUE        00690000
007000             'TSK    '.                                           00700000
007100         10  IM002-TABLE-19              PIC  X(07)  VALUE        00710000
007200             'TSK    '.                                           00720000
007300         10  IM002-TABLE-20              PIC  X(07)  VALUE        00730000
007400             'TSK    '.                                           00740000
007500         10  IM002-TABLE-21              PIC  X(07)  VALUE        00750000
007600             'TSK    '.                                           00760000
007700         10  IM002-TABLE-22              PIC  X(07)  VALUE        00770000
007800             'TSK    '.                                           00780000
007900         10  IM002-TABLE-23              PIC  X(07)  VALUE        00790000
008000             'TSK    '.                                           00800000
008001         10  IM002-TABLE-24              PIC  X(07)  VALUE        00800100
008002             'TSK    '.                                           00800200
008003         10  IM002-TABLE-25              PIC  X(07)  VALUE        00800300
008004             'TSK    '.                                           00800400
008005         10  IM002-TABLE-26              PIC  X(07)  VALUE        00800500
008006             'TSK    '.                                           00800600
008007         10  IM002-TABLE-27              PIC  X(07)  VALUE        00800712
008008             'TDCVSVL'.                                           00800812
008009         10  IM002-TABLE-28              PIC  X(07)  VALUE        00800914
008010             '       '.                                           00801014
008011         10  IM002-TABLE-29              PIC  X(07)  VALUE        00801115
008012             'TUMDCLN'.                                           00801215
008013         10  FILLER                      PIC  X(147) VALUE        00801315
008020             SPACES.                                              00802000
008100     05  IM002-ERROR-TABLES-TABLE REDEFINES IM002-ERROR-TABLES    00810000
008200                                         PIC  X(07)               00820000
008300                                         OCCURS 50 TIMES.         00830000
008400                                                                  00840000
