       01  IM030-ITEM-MOS-REC.                                                  
           05  IM030-ITM-NBR                 PIC  S9(15)V COMP-3.               
           05  IM030-UPC-ID                  PIC  S9(9) COMP.                   
