00001 ******************************************************************09/07/99
00002 * IMRD077 - WHITE TICKET PRICE CHANGE RPT UNLOAD RECORD           IMRD007 
00003 ******************************************************************   LV001
00006  01  IM077-UNLOAD-REC.                                                    
           05  IM077-DEPT                   PIC  S9(4)V COMP-3.                 
           05  IM077-CLASS                  PIC  S9(4)V COMP-3.                 
           05  IM077-SUBCLASS               PIC  S9(4)V COMP-3.                 
           05  IM077-SKU                    PIC  S9(8)V COMP-3.                 
           05  IM077-PRCHG-ID               PIC  S9(9) COMP.                    
           05  IM077-PRCHG-EFF-DTE          PIC  X(10).                         
           05  IM077-UNT-RTL-AMT            PIC  S9(7)V9(2) COMP-3.             
           05  IM077-UNT-RTL-AMT-NI         PIC  X(01) VALUE SPACE.             
               88  IM077-UNT-RTL-AMT-NULL              VALUE '?'.               
           05  IM077-VS-ID                  PIC  S9(9) COMP.                    
           05  IM077-SUB-CL-MDSEAR-ID       PIC  S9(6)V COMP-3.                 
           05  IM077-VS-NBR                 PIC  X(20).                         
