00001 ******************************************************************09/07/99
00002 * IMRD200 - ONETIME SKU DESC CONVERSION ON TUPC RECORD LAYOUT     IMRD007 
00003 ******************************************************************   LV001
00006  01  IM200-REC.                                                           
00005      05  IM200-INTR-UPC-ID             PIC  S9(9) COMP.                   
           05  IM200-SKU-DESC                PIC  X(25).                        
