      ***************************************************************           
      *   IMRD121 - DAILY CUSTOMER CHOICE SKU ASSN DELIM RECORD                 
      *   RECORD LENGTH = 93 BYTES                                              
      ***************************************************************           
       01  IM121-CC-SKU-ASSN-DELIM-REC.                                         
           05 IM121-CUST-CHC-ID            PIC  9(10).                          
           05 FILLER                       PIC  X(01) VALUE '|'.                
           05 IM121-SKU-NBR                PIC  9(8).                           
           05 FILLER                       PIC  X(01) VALUE '|'.                
           05 IM121-EFF-BEG-TMST           PIC  X(26).                          
           05 FILLER                       PIC  X(01) VALUE '|'.                
           05 IM121-CRE-DTE                PIC  X(10).                          
           05 FILLER                       PIC  X(01) VALUE '|'.                
           05 IM121-CRE-BY-USR-ID          PIC  X(08).                          
           05 FILLER                       PIC  X(01) VALUE '|'.                
           05 IM121-EFF-END-TMST           PIC  X(26).                          
