      *---------------------------------------------------------------*         
      *                                                               *         
      *    IMRD005 - CORPORATE INITIATIVES COPYBOOK                   *         
      *              PA FEED EXPANDED TO STORE                       *          
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *    WR                   Ù  INITIAL CREATION                   *         
      *---------------------------------------------------------------*         
       01  IM005-RECORD.                                                        
           05  IM005-ITEM-KEY-DATA.                                             
               10  IM005-CORP-INITV-ID          PIC 9(04).                      
               10  IM005-RPT-GP-ID              PIC 9(10).                      
               10  IM005-INTR-UPC-ID            PIC 9(10).                      
               10  IM005-STR-NBR                PIC 9(04).                      
           05  IM005-PRICE-ZONE-DESC            PIC X(30).                      
           05  FILLER                           PIC X(42).                      
