W36546****************************************************************          
W36546*                                                                         
W36546*    WR36546    08/19/2010   COGNIZANT - ADD A NEW FIELD                  
W36546*                            IM053-TST-PRD-TYP-DESC                       
W36546*                                                                         
W38861*    WR38361    08/19/2010   COGNIZANT - ADD A NEW FIELD                  
W38861*                            IM053-WHSE-RPLNT-IND                         
W38861*                                                                         
W38861****************************************************************          
       01  IM053-ITEM-SKU-DOMAIN-REC.                                           
           05 IM053-INTR-UPC-ID             PIC  S9(09)  COMP.                  
           05 IM053-RMS-STYL-ID             PIC  S9(08)V COMP-3.                
           05 IM053-ITM-NBR                 PIC  S9(15)V COMP-3.                
           05 IM053-SKU                     PIC  S9(08)V COMP-3.                
           05 IM053-INTR-UPC-DESC           PIC   X(30).                        
           05 IM053-SKU-STAT-CDE            PIC   X(02).                        
           05 IM053-SKU-STAT-DESC           PIC   X(10).                        
           05 IM053-INNR-PK-QTY             PIC  S9(04)  COMP.                  
           05 IM053-OUTR-PK-QTY             PIC  S9(04)  COMP.                  
           05 IM053-KOHLS-SIZE-CDE          PIC  S9(09)  COMP.                  
           05 IM053-KOHLS-SIZE-DESC         PIC   X(10).                        
           05 IM053-NRF-CLOR-CDE            PIC   X(03).                        
           05 IM053-NRF-CLOR-DESC           PIC   X(10).                        
           05 IM053-SHRT-CLOR-DESC          PIC   X(04).                        
           05 IM053-CSTM-CLOR-DESC          PIC   X(10).                        
           05 IM053-CUSTFACG-CLOR-DESC      PIC   X(22).                        
           05 IM053-REGN-PRIC-IND           PIC   X(01).                        
           05 IM053-RPLNMT-IND              PIC   X(01).                        
           05 IM053-KY-ITM-IND              PIC   X(01).                        
           05 IM053-POG-IND                 PIC   X(01).                        
           05 IM053-GP-CDE                  PIC   X(03).                        
           05 IM053-SEA-DESC                PIC   X(20).                        
           05 IM053-UNT-COST-1ST-AMT        PIC  S9(7)V9(3)  COMP-3.            
           05 IM053-TX-PRD-CDE-DESC         PIC   X(20).                        
           05 IM053-WT-UM-CDE               PIC   X(02).                        
           05 IM053-WT-UM-QTY               PIC  S9(5)V9(3)  COMP-3.            
           05 IM053-SIZE-UM-CDE             PIC   X(02).                        
           05 IM053-WD-UM-QTY               PIC  S9(4)V9(3)  COMP-3.            
           05 IM053-HT-UM-QTY               PIC  S9(4)V9(3)  COMP-3.            
           05 IM053-DPTH-UM-QTY             PIC  S9(4)V9(3)  COMP-3.            
           05 IM053-E-BUS-ITM-IND           PIC   X(01).                        
           05 IM053-ASRT-BEG-DTE            PIC   X(10).                        
           05 IM053-ASRT-END-DTE            PIC   X(10).                        
           05 IM053-STRG-AREA-DESC          PIC   X(20).                        
           05 IM053-SHIP-WD-QTY             PIC  S9(4)V9(3) COMP-3.             
           05 IM053-SHIP-DPTH-QTY           PIC  S9(4)V9(3) COMP-3.             
           05 IM053-SHIP-HT-QTY             PIC  S9(4)V9(3) COMP-3.             
           05 IM053-SHIP-WT-QTY             PIC  S9(5)V9(3) COMP-3.             
           05 IM053-SHIP-DIM-SRC-CDE        PIC   X(1).                         
           05 IM053-PKG-DESC                PIC   X(20).                        
           05 IM053-SHIP-RSTRC-DESC         PIC   X(20).                        
           05 IM053-GFT-WRAP-AVL-IND        PIC   X(1).                         
           05 IM053-PRD-GP-NBR              PIC  S9(8)V COMP-3.                 
           05 IM053-PRD-GP-IND              PIC   X(1).                         
           05 IM053-SHIP-SRCHG-FEE-AMT      PIC  S9(3)V9(2) COMP-3.             
           05 IM053-SHIP-SRVC-DESC          PIC   X(20).                        
           05 IM053-SHIP-GP-DESC            PIC   X(20).                        
           05 IM053-TRNSTN-IND              PIC   X(01).                        
           05 IM053-WEB-EXCLV-IND           PIC   X(01).                        
           05 IM053-EXTD-SZ-CDE             PIC   X(02).                        
           05 IM053-PO-SHRT-CYC-IND         PIC   X(01).                        
           05 IM053-EFF-BEG-DTE             PIC   X(10).                        
W36546*    05 IM053-ITEM-SKU-FILLER         PIC   X(131).                       
W36546     05 IM053-TST-PRD-TYP-DESC        PIC   X(20).                        
W38861     05 IM053-WHSE-RPLNT-IND          PIC   X(01).                        
W38861     05 IM053-ITEM-SKU-FILLER         PIC   X(110).                       
