      ******************************************************************03/11/88
      *             IMRD027 ITEM SKU RENUMBER LOG                      *IMRD027 
      *                                                                *   LV013
      *  THIS FILE CONTAINS A RECORD FOR EVERY SUCCESSFUL SKU          *   CL*13
      *  RENUMBER TRANSACTION.  EACH RECORD IS DATE AND TIME STAMPED.  *   CL*13
      *                                                                *   CL*13
      *  CHANGES:                                                      *        
      *                                                                *        
      *  05/06/98    JEFF HARTIG/COMPUWARE          WR#: 6041          *        
      *            EXPANDED DATE AND TIME FIELDS FOR TSKURNMBR TABLE   *        
      *            EXPANSION.                                          *        
      ******************************************************************   CL*13
      * THIS IS A COPY OF FSRD503O AND WAS CREATED WHEN OWNERSHIP      *   CL**7
      * WENT FROM FS TO IM.                                            *   CL**7
      ******************************************************************   CL*13
                                                                        IMRD027 
       01  IM027-SKU-RENUMBER-RECORD.                                      CL**3
           05  IM027-SKU.                                                  CL*10
               10  IM027-DEPT-NMBR       PIC X(03) VALUE SPACES.           CL*10
               10  IM027-CLASS-NMBR      PIC X(02) VALUE SPACES.           CL*10
               10  IM027-SEQ-NMBR        PIC X(03) VALUE SPACES.           CL*10
           05  IM027-INHOUSE-NMBR        PIC 9(03) VALUE ZEROES.           CL*12
           05  IM027-HIST-SKU.                                                  
               10  IM027-HIST-DEPT-NMBR  PIC X(03) VALUE SPACES.                
               10  IM027-HIST-CLASS-NMBR PIC X(02) VALUE SPACES.                
               10  IM027-HIST-SEQ-NMBR   PIC X(03) VALUE SPACES.                
           05  IM027-DATE.                                                 CL*11
               10  IM027-YEAR            PIC X(04) VALUE SPACES.           CL*11
               10  FILLER                PIC X(01) VALUE SPACES.                
               10  IM027-MONTH           PIC X(02) VALUE SPACES.           CL*11
               10  FILLER                PIC X(01) VALUE SPACES.                
               10  IM027-DAY             PIC X(02) VALUE SPACES.                
           05  IM027-TIME.                                                 CL*11
               10  IM027-HOUR            PIC X(02) VALUE ZEROES.           CL*11
               10  FILLER                PIC X(01) VALUE SPACES.                
               10  IM027-MINUTE          PIC X(02) VALUE ZEROES.           CL*11
               10  FILLER                PIC X(01) VALUE SPACES.                
               10  IM027-SECOND          PIC X(02) VALUE ZEROES.           CL*11
