       01  IM094-BUS-GRP-DEPT-REC.                                              
           05 IM094-BUS-GP-DESC             PIC  X(25).                         
           05 IM094-DEPT                    PIC  S9(4) COMP-3.                  
           05 IM094-FILLER                  PIC  X(32).                         
