00001 ******************************************************************09/07/99
00002 * IMRD019 - STYLE COLOR CLEANUP UNLOAD RECORD                     IMRD007 
00003 ******************************************************************   LV001
00006  01  IM019-UNLOAD-REC.                                                    
           05  IM019-DEPT-NBR               PIC  S9(4)V COMP-3.                 
           05  IM019-VS-ID                  PIC  S9(9) COMP.                    
           05  IM019-SUB-CL-MDSEAR-ID       PIC  S9(6)V COMP-3.                 
           05  IM019-KOHLS-STD-SZ-ID        PIC  S9(9) COMP.                    
           05  IM019-STD-SZ-NULL-IND        PIC  X(1).                          
           05  IM019-KOHLS-SIZE-CDE         PIC  S9(9) COMP.                    
           05  IM019-NRF-CLOR-CDE           PIC  X(3).                          
           05  IM019-NRF-CLOR-FAM-CDE       PIC  X(1).                          
           05  IM019-NRF-CLOR-DESC          PIC  X(10).                         
           05  IM019-INTR-UPC-ID            PIC  S9(9) COMP.                    
