      *---------------------------------------------------------------*         
      *                                                               *         
      *    IMRD110 - CORPORATE INITIATIVES COPYBOOK                   *         
      *              FILE FEED FROM PROJECTION ANALYSIS TO ITEM       *         
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *    WR25548    07/31/2003   INITIAL CREATION                   *         
      *---------------------------------------------------------------*         
       01  IM110-RECORD.                                                        
           05  IM110-ITEM-KEY-DATA.                                             
               10  IM110-CORP-INITV-ID          PIC 9(04).                      
               10  IM110-INTR-UPC-ID            PIC 9(10).                      
               10  IM110-EFF-BEG-DTE            PIC X(10).                      
               10  IM110-EFF-END-DTE            PIC X(10).                      
               10  IM110-STR-GP-TYP-CDE         PIC 9(4).                       
                   88  IM110-RMS-TOTAL-COMPANY       VALUE 1000.                
                   88  IM110-RMS-CLIMATE-ZONE-GROUP  VALUE 3000.                
                   88  IM110-RMS-MARKET-CLUSTERS     VALUE 7000.                
               10  IM110-STR-GP-ID              PIC 9(4).                       
                   88  IM110-RMS-TOTAL-COMPANY       VALUE 1.                   
                   88  IM110-RMS-CLIMATE-HOT         VALUE 1.                   
                   88  IM110-RMS-CLIMATE-MDOERATE    VALUE 2.                   
                   88  IM110-RMS-CLIMATE-COLD        VALUE 3.                   
                   88  IM110-RMS-CLIMATE-WARM        VALUE 4.                   
                   88  IM110-RMS-CLIMATE-WEB         VALUE 5.                   
                   88  IM110-RMS-MARKET-UNASSIGNED   VALUE 1.                   
                   88  IM110-RMS-MARKET-CLASSIC-CORE VALUE 1000.                
                   88  IM110-RMS-MARKET-CLASSIC-WARM VALUE 2000.                
                   88  IM110-RMS-MARKET-UPDATED-CORE VALUE 3000.                
                   88  IM110-RMS-MARKET-UPDATED-HOT  VALUE 4000.                
                   88  IM110-RMS-MARKET-UPDATED-WARM VALUE 5000.                
                   88  IM110-RMS-MARKET-WEB          VALUE 6000.                
               10  IM110-PGM-ID                 PIC 9(10).                      
           05  FILLER                           PIC X(48).                      
