      *---------------------------------------------------------------*         
      *                                                               *         
      *    IMRD034 - CORPORATE INITIATIVES SKU LIST                   *         
      *              EXTRACT FILE LAYOUT - COMMA DELIMITED            *         
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *    WR24636    05/21/2003   INITIAL CREATION   LRECL 114       *         
      *    WR26348    12/29/2003   ADDED SEASONAL SET SHORT NAME, YEAR*         
      *                            AND STORE GP ID.   LRECL 156       *         
      *    WR27078    07/08/2004   CHANGED SIZE OF LOCATION FROM 10 TO*         
      *                            8 AND LRECL FROM 156 TO 154.       *         
      *---------------------------------------------------------------*         
       01  IMRD034-RECORD.                                                      
           05  IM034-CORP-INITV-ID         PIC  9(04)    VALUE ZERO.            
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM034-SKU-NBR               PIC  X(08)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM034-UPC-NBR               PIC  9(15)    VALUE ZERO.            
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM034-FIXTURE-LOC-NAME      PIC  X(08)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM034-CLUSTER-DESC          PIC  X(35)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM034-STR-GP-ID             PIC  X(20)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM034-ITEM-DESC             PIC  X(25)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM034-LABEL-DESC            PIC  X(20)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM034-SEASET-SHRT-NM        PIC  X(05)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM034-SEASET-YR             PIC  X(04)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
