      *---------------------------------------------------------------*         
      *                                                               *         
      *    IMRD004 - CORPORATE INITIATIVES COPYBOOK                   *         
      *              EXTRACT FILE LAYOUT - COMMA DELIMITED            *         
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *---------------------------------------------------------------*         
       01  IM004-CORP-INITV-REC.                                                
           05  IM004-CORP-INITV-ID         PIC  9(04)    VALUE ZERO.            
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-WEEK-BEG-DTE          PIC  X(10)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-SEASON                PIC  X(06)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-WEEK-BEG-YEAR         PIC  9(04)    VALUE ZERO.            
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-WEEK-BEG-MONTH        PIC  X(09)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-STORE-NBR             PIC  9(04)    VALUE ZERO.            
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-DMM-NBR               PIC  X(02)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-DEPT-NBR              PIC  X(03)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-MAJ-CLASS-NBR         PIC  X(02)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-SUB-CLASS-NBR         PIC  X(03)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-SKU-NBR               PIC  X(08)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-DLR-SALES             PIC S9(11)V99 COMP-3                 
                                                         VALUE ZERO.            
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-UNIT-SALES            PIC S9(11)V   COMP-3                 
                                                         VALUE ZERO.            
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-DLR-ONHAND            PIC S9(11)V99 COMP-3                 
                                                         VALUE ZERO.            
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-UNIT-ONHAND           PIC S9(11)V   COMP-3                 
                                                         VALUE ZERO.            
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-CLIMATE-DESC          PIC  X(30)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
           05  IM004-PGM-ID                PIC  X(10)    VALUE SPACES.          
           05  FILLER                      PIC  X(01)    VALUE ','.             
