      *---------------------------------------------------------------*         
      *                                                               *         
      *    IMRD018 - NON-VSM ITEM MAINTENANCE INFO COPYBOOK           *         
      *    LENGTH  - 100 BYTES                                        *         
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *               09/30/2002   INITIAL CREATION                   *         
      *    WR32933    06/06/2007   ADDED EVENTS 020 AND 025.          *         
      *    WR35174    10/06/2008   ADDED EVENT 030.                   *         
      *    CHG0213345 12/03/2018   ADDED EVENTS 905, 910, 915 AND 930.*         
      *---------------------------------------------------------------*         
       01  IMRD018-RECORD.                                                      
           05  IM018-BUSINESS-EVENT-ID           PIC 9(03).                     
               88  IM018-BUS-EVENT-SIZE-DESC-CHG     VALUE 005.                 
      *            SIZE DESCRIPTION CHANGE                                      
      *            (NON-VSM AND RMS ITEM EVENT)                                 
               88  IM018-BUS-EVENT-TKT-TYP-DE-CHG    VALUE 010.                 
      *            TICKET TYPE DESCRIPTION CHANGE (NON-VSM EVENT)               
               88  IM018-BUS-EVENT-LBL-TYP-CD-CHG    VALUE 015.                 
      *            LABEL TYPE CODE CHANGE (NON-VSM EVENT)                       
               88  IM018-BUS-EVENT-SIZE-ADD          VALUE 020.                 
      *            SIZE ADD (RMS ITEM EVENT)                                    
               88  IM018-BUS-EVENT-GROUP-PRIC-ADD    VALUE 025.                 
      *            GROUP PRICE ADD (RMS ITEM EVENT)                             
               88  IM018-BUS-EVENT-LBL-PT-LS-CHG     VALUE 030.                 
      *            LABEL PRICE TIER/LIFESTYLE CHANGE (NON-VSM EVENT)            
               88  IM018-BUS-EVENT-SIZE-DESC-905     VALUE 905.                 
      *            SIMILAR TO 005, BUT GOES TO IMKCS301                         
               88  IM018-BUS-EVENT-TKT-TYP-DE-910    VALUE 910.                 
      *            SIMILAR TO 010, BUT GOES TO IMKCS301                         
               88  IM018-BUS-EVENT-LBL-TYP-CD-915    VALUE 915.                 
      *            SIMILAR TO 015, BUT GOES TO IMKCS301                         
               88  IM018-BUS-EVENT-LBL-PT-LS-930     VALUE 930.                 
      *            SIMILAR TO 030, BUT GOES TO IMKCS301                         
      *                                                                         
           05  IM018-ITEM-ACTION-DATA            PIC X(97).                     
           05  IM018-SIZE-DESC-CHG-DATA                                         
                     REDEFINES IM018-ITEM-ACTION-DATA.                          
      *        IM018-ITEM-ACTION-TYPE = 005                                     
               10  IM018-SIZE-DESC-CHG-SIZE-CDE  PIC 9(09).                     
      *            KOHL'S SIZE CODE                                             
               10  IM018-SIZE-DESC-CHG-KOHLS-DESC                               
                                                 PIC X(10).                     
               10  IM018-SIZE-DESC-CHG-FILLER    PIC X(78).                     
      *                                                                         
           05  IM018-TKT-TYP-DESC-CHG-DATA                                      
                     REDEFINES IM018-ITEM-ACTION-DATA.                          
      *        IM018-ITEM-ACTION-TYPE = 010                                     
               10  IM018-TKT-TYP-DESC-CHG-SEQ-NBR                               
                                                 PIC 9(04).                     
      *            TICKET TYPE SEQUENCE NUMBER                                  
               10  IM018-TKT-TYP-DESC-CHG-DESC   PIC X(20).                     
               10  IM018-TKT-TYP-DESC-CHG-FILLER PIC X(73).                     
      *                                                                         
           05  IM018-LBL-TYP-CDE-CHG-DATA                                       
                     REDEFINES IM018-ITEM-ACTION-DATA.                          
      *        IM018-ITEM-ACTION-TYPE = 015                                     
               10  IM018-LBL-TYP-CDE-CHG-SEQ-NBR                                
                                                 PIC 9(04).                     
      *            LABEL TYPE CODE SEQUENCE NUMBER                              
               10  IM018-LBL-TYP-CDE-CHG-CDE     PIC X(01).                     
               10  IM018-LBL-TYP-CDE-CHG-FILLER  PIC X(92).                     
      *                                                                         
           05  IM018-SIZE-ADD-DATA                                              
                     REDEFINES IM018-ITEM-ACTION-DATA.                          
      *        IM018-ITEM-ACTION-TYPE = 020                                     
               10  IM018-SIZE-ADD-SIZE-CDE       PIC 9(09).                     
      *            KOHL'S SIZE CODE                                             
               10  IM018-SIZE-ADD-KOHLS-DESC     PIC X(10).                     
               10  IM018-SIZE-ADD-SIZE-GP-CDE    PIC 9(04).                     
               10  IM018-SIZE-ADD-FILLER         PIC X(74).                     
      *                                                                         
           05  IM018-GROUP-PRICE-ADD-DATA                                       
                     REDEFINES IM018-ITEM-ACTION-DATA.                          
      *        IM018-ITEM-ACTION-TYPE = 025                                     
               10  IM018-GRP-PRIC-ADD-MEITGP-NBR PIC 9(09).                     
               10  IM018-GRP-PRIC-ADD-MDSEDP-NBR PIC X(03).                     
      *            ORIGINAL MERCHANDISE DEPARTMENT NUMBER                       
               10  IM018-GRP-PRIC-ADD-MEITGP-NAME                               
                                                 PIC X(20).                     
               10  IM018-GRP-PRIC-ADD-MITGPL-QTY PIC 9(04).                     
               10  IM018-GRP-PRIC-ADD-GP-AMT     PIC 9(5).99.                   
               10  IM018-GRP-PRIC-ADD-BEG-DTE    PIC X(10).                     
               10  IM018-GRP-PRIC-ADD-FILLER     PIC X(43).                     
      *                                                                         
           05  IM018-LBL-PT-LS-CHG-DATA                                         
                     REDEFINES IM018-ITEM-ACTION-DATA.                          
      *        IM018-ITEM-ACTION-TYPE = 030                                     
               10  IM018-LBL-PT-LS-CHG-LBL-SEQ-NR                               
                                                 PIC 9(04).                     
      *            LABEL TYPE CODE SEQUENCE NUMBER                              
               10  IM018-LBL-PT-LS-CHG-P-TIER-SEQ                               
                                                 PIC 9(04).                     
      *            PRICE TIER SEQUENCE NUMBER                                   
               10  IM018-LBL-PT-LS-CHG-LFSTYL-SEQ                               
                                                 PIC 9(04).                     
      *            LIFESTYLE SEQUENCE NUMBER                                    
               10  IM018-LBL-PT-LS-CHG-FILLER    PIC X(85).                     
