      *****************************************************************         
      *    WR/INC#      DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *    W36383     05/15/2009   T.KONTAROVICH                      *         
      *                            CHANGE FILLER SIZE TO 50 BYTES.    *         
      *****************************************************************         
       01  IM057-ITEM-SKU-LOC-DOMAIN-REC.                                       
           05 IM057-INTR-UPC-ID             PIC  S9(09) COMP.                   
           05 IM057-STR-NBR                 PIC  S9(4) COMP.                    
           05 IM057-EFF-BEG-TMST            PIC   X(26).                        
           05 IM057-EFF-BEG-PARTS REDEFINES IM057-EFF-BEG-TMST.                 
              15 IM057-BEG-DATE             PIC   X(10).                00352000
              15 FILLER                     PIC   X.                    00353000
              15 IM057-BEG-TIME             PIC   X(15).                00354000
           05 IM057-EFF-END-TMST            PIC   X(26).                        
           05 IM057-UNT-COST-AMT            PIC  S9(7)V9(3) COMP-3.             
           05 IM057-UNT-RTL-AMT             PIC  S9(7)V9(2) COMP-3.             
           05 IM057-UNT-RTL-CHG-DTE         PIC   X(10).                        
           05 IM057-SKU-STAT-CDE            PIC   X(2).                         
           05 IM057-SKU-STAT-DESC           PIC   X(10).                        
           05 IM057-STAT-CHG-DTE            PIC   X(10).                        
           05 IM057-PLU-IND                 PIC   X(1).                         
           05 IM057-MEITGP-NBR              PIC  S9(9) COMP.                    
           05 IM057-GP-RTL-QTY              PIC  S9(4) COMP.                    
           05 IM057-GP-AMT                  PIC  S9(5)V9(2) COMP-3.             
           05 IM057-ORIG-CLR-DTE            PIC   X(10).                        
           05 IM057-MKDN-CDE                PIC   X(1).                         
W36383     05 IM057-ITEM-SKU-LOC-FILLER     PIC   X(50).                        
W36383*    05 IM057-ITEM-SKU-LOC-FILLER     PIC   X(127).                       
