      *****************************************************************         
      *    WR/INC#      DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *    W35378     05/15/2009   T.KONTAROVICH                      *         
      *                            BMC TO IBM UNLOAD CONVERSION       *         
      *****************************************************************         
       01  IM056-ITEM-SKU-LOC-UNLD-REC.                                         
           05 IM056-INTR-UPC-ID             PIC  S9(09) COMP.                   
           05 IM056-STR-NBR                 PIC  S9(4) COMP.                    
           05 IM056-EFF-BEG-TMST            PIC   X(26).                        
W35378     05 IM056-END-TMST-NULL-IND       PIC   X(1).                         
           05 IM056-EFF-END-TMST            PIC   X(26).                        
W35378*    05 IM056-END-TMST-NULL-IND       PIC   X(1).                         
W35378     05 IM056-UNT-COST-NULL-IND       PIC   X(1).                         
           05 IM056-UNT-COST-AMT            PIC  S9(7)V9(3) COMP-3.             
W35378*    05 IM056-UNT-COST-NULL-IND       PIC   X(1).                         
W35378     05 IM056-UNT-RTL-NULL-IND        PIC   X(1).                         
           05 IM056-UNT-RTL-AMT             PIC  S9(7)V9(2) COMP-3.             
W35378*    05 IM056-UNT-RTL-NULL-IND        PIC   X(1).                         
           05 IM056-UNT-RTL-CHG-DTE         PIC   X(10).                        
W35378     05 IM056-SKU-STAT-NULL-IND       PIC   X(1).                         
           05 IM056-SKU-STAT-CDE            PIC   X(2).                         
W35378*    05 IM056-SKU-STAT-NULL-IND       PIC   X(1).                         
           05 IM056-SKU-STAT-CHG-DTE        PIC   X(10).                        
           05 IM056-PLU-IND                 PIC   X(1).                         
W35378     05 IM056-MEITGP-NULL-IND         PIC   X(1).                         
           05 IM056-MEITGP-NBR              PIC  S9(9) COMP.                    
W35378*    05 IM056-MEITGP-NULL-IND         PIC   X(1).                         
           05 IM056-CRE-BY-USR-ID           PIC   X(8).                         
W35378     05 IM056-ORIGCLR-NULL-IND        PIC   X(1).                         
           05 IM056-ORIG-CLR-DTE            PIC   X(10).                        
W35378*    05 IM056-ORIGCLR-NULL-IND        PIC   X(1).                         
W35378     05 IM056-MKDN-CDE-NULL-IND       PIC   X(1).                         
           05 IM056-MKDN-CDE                PIC   X(1).                         
W35378*    05 IM056-MKDN-CDE-NULL-IND       PIC   X(1).                         
