      *---------------------------------------------------------------*         
      *                                                               *         
      *    IMRD044 - PERM PRICE CHANGES REFORMAT FILE COPYBOOK        *         
      *    LENGTH  - 30 BYTES                                         *         
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *    WR#28566   03/28/2005   P. KEBER - INITIAL CREATION        *         
      *    WR29434    09/26/2005   D. THEEL - ADDED NEW MK2 AND FNL.  *         
      *---------------------------------------------------------------*         
       01  IM044-PRICE-CHGS-RFMT-RECORD.                                        
           05  IM044-PCRR-EFF-DTE             PIC X(10)  VALUE SPACES.          
           05  IM044-PCRR-PRCHG-ID            PIC S9(09) VALUE +0 COMP.         
           05  IM044-PCRR-SKU                 PIC S9(08) VALUE +0               
                                                         COMP-3.                
           05  IM044-PCRR-STR-NBR             PIC S9(04) VALUE +0 COMP.         
           05  IM044-PCRR-NEW-UNT-RTL-AMT     PIC S9(07)V99 VALUE +0            
                                                         COMP-3.                
           05  IM044-PCRR-PRCHG-TYP-CDE       PIC X(03)  VALUE SPACES.          
               88  IM044-PRCHGTYP-CLR-TO-ACTIVE          VALUE 'CTA'.           
               88  IM044-PRCHGTYP-MARKUP-ACTIVE          VALUE 'MUA'.           
               88  IM044-PRCHGTYP-MARKDOWN-ACTIVE        VALUE 'MDA'.           
               88  IM044-PRCHGTYP-CLEARNCE               VALUE 'CLR'.           
               88  IM044-PRCHGTYP-REG-CLEARNCE           VALUE 'RCP'.           
               88  IM044-PRCHGTYP-2ND-CLR-MRKDWN         VALUE 'MK2'.           
               88  IM044-PRCHGTYP-FINL-CLR-MRKDWN        VALUE 'FNL'.           
           05  IM044-PCRR-ALL-RMNG-STR-IND    PIC X(01)  VALUE SPACE.           
               88  IM044-PCRR-ALL-RMNG-STRS              VALUE 'Y'.             
      ***          INDICATES A LAST TIER STORE WITH THE HIGHEST PRICE           
