       01  IM054-ITEM-UPC-UNLD-REC.                                             
           05 IM054-UPC-ID                  PIC  S9(09)  COMP.                  
           05 IM054-INTR-UPC-ID             PIC  S9(09)  COMP.                  
           05 IM054-UPC-TYP-CDE             PIC   X(01).                        
           05 IM054-UPC-NBR                 PIC  S9(15)V COMP-3.                
           05 IM054-EDI-ORD-IND             PIC   X(1).                         
           05 IM054-PREPK-IND               PIC   X(1).                         
           05 IM054-CERTD-IND               PIC   X(1).                         
           05 IM054-CERTD-DTE               PIC   X(10).                        
           05 IM054-UPC-SRC-CDE             PIC   X(1).                         
           05 IM054-KOHLS-SIZE-CDE          PIC  S9(09)  COMP.                  
           05 IM054-NRF-CLOR-CDE            PIC   X(03).                        
           05 IM054-CSTM-CLOR-DESC          PIC   X(10).                        
           05 IM054-WT-UM-CDE               PIC   X(02).                        
           05 IM054-WT-UM-QTY               PIC  S9(5)V9(3)  COMP-3.            
           05 IM054-SIZE-UM-CDE             PIC   X(02).                        
           05 IM054-WD-UM-QTY               PIC  S9(4)V9(3)  COMP-3.            
           05 IM054-HT-UM-QTY               PIC  S9(4)V9(3)  COMP-3.            
           05 IM054-DPTH-UM-QTY             PIC  S9(4)V9(3)  COMP-3.            
           05 IM054-ITEM-UPC-FILLER         PIC   X(131).                       
