      ****************************************************************          
      *    IMRD062 - ITEM DOMAIN TSKXREF UNLOAD FILE COPYBOOK                   
      *    LENGTH  - 19 BYTES                                                   
      ****************************************************************          
       01  IM062-ITEM-TSKXREF-UNLD-REC.                                         
           05  IM062-INTR-UPC-ID            PIC  S9(9) COMP.                    
           05  IM062-ITM-NBR                PIC  S9(15)V COMP-3.                
           05  IM062-SKU                    PIC  S9(08)V COMP-3.                
           05  IM062-SKU-STAT-CDE           PIC   X(02).                        
