      ******************************************************************09/07/99
      * IMRD037 - VSM SKU/LOCATION EXTRACT COUNTS RECORD LAYOUT         IMRD007 
      * LENGTH  - 80 BYTES                                              IMRD007 
      ******************************************************************   LV001
       01  IM037-SKU-LOCATION-COUNTS-REC.                                       
           05  FILLER                        PIC  X(20)  VALUE                  
                'LOCATION ZERO RECS: '.                                         
           05  IM037-LOCATION-ZERO-REC-CNT   PIC  9(10)  VALUE ZERO.            
           05  FILLER                        PIC  X(14)  VALUE                  
                '  TOTAL RECS: '.                                               
           05  IM037-TOTAL-RECS-CNT          PIC  9(10)  VALUE ZERO.            
           05  FILLER                        PIC  X(26)  VALUE SPACES.          
