      *---------------------------------------------------------------*         
      *                                                               *         
      *    IMRD041 - PERM PRICE CHANGE UPDATES FILE COPYBOOK          *         
      *    LENGTH  - 48 BYTES                                         *         
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *    WR#27472   09/22/2004   P. KEBER - INITIAL CREATION        *         
      *    WR29434    09/26/2005   D. THEEL - ADDED NEW MK2 AND FNL.  *         
      *---------------------------------------------------------------*         
       01  IM041-PRICE-UPDATE-RECORD.                                           
           05  IM041-PUR-SKU                  PIC S9(08) VALUE +0               
                                                         COMP-3.                
           05  IM041-PUR-STR-NBR              PIC S9(04) VALUE +0 COMP.         
           05  IM041-PUR-NEW-UNT-RTL-AMT      PIC S9(07)V99 VALUE +0            
                                                         COMP-3.                
           05  IM041-PUR-NEW-GP-PRIC-ID       PIC S9(09) VALUE +0 COMP.         
           05  IM041-PUR-NEW-GP-RTL-QTY       PIC S9(03) VALUE +0               
                                                         COMP-3.                
           05  IM041-PUR-NEW-GP-RTL-AMT       PIC S9(07)V99 VALUE +0            
                                                         COMP-3.                
           05  IM041-PUR-EFF-DTE              PIC X(10)  VALUE SPACES.          
           05  IM041-PUR-PRCHG-ID             PIC S9(09) VALUE +0 COMP.         
           05  IM041-PUR-PRCHG-TYP-CDE        PIC X(03)  VALUE SPACES.          
               88  IM041-PRCHGTYP-CLR-TO-ACTIVE          VALUE 'CTA'.           
               88  IM041-PRCHGTYP-MARKUP-ACTIVE          VALUE 'MUA'.           
               88  IM041-PRCHGTYP-MARKDOWN-ACTIVE        VALUE 'MDA'.           
               88  IM041-PRCHGTYP-CLEARNCE               VALUE 'CLR'.           
               88  IM041-PRCHGTYP-REG-CLEARNCE           VALUE 'RCP'.           
               88  IM041-PRCHGTYP-CONT-CLEARNCE          VALUE 'CON'.           
               88  IM041-PRCHGTYP-2ND-CLR-MRKDWN         VALUE 'MK2'.           
               88  IM041-PRCHGTYP-FINL-CLR-MRKDWN        VALUE 'FNL'.           
           05  IM041-PUR-ALL-RMNG-STR-IND     PIC X(01)  VALUE SPACE.           
               88  IM041-PUR-ALL-RMNG-STRS               VALUE 'Y'.             
      ***          INDICATES A LAST TIER STORE WITH THE HIGHEST PRICE           
           05  FILLER                         PIC X(07)  VALUE SPACES.          
