00001 ******************************************************************09/07/99
00002 * IMRD003 - VSM DATA INTEGRITY SKU RECORD LAYOUT - LRECL 18       IMRD007 
00003 ******************************************************************   LV001
00004  01  IM003-SKU-UNLOAD-REC.                                                
00005      05  IM003-DEPT                    PIC  S9(4)V COMP-3.                
00006      05  IM003-ITEM                    PIC  S9(15)V COMP-3.               
00007      05  IM003-SKU                     PIC  S9(8)V COMP-3.                
00008      05  IM003-STATUS                  PIC  S9(3)V COMP-3.                
