      * ****************************************************************        
      *             IMRD091  RCP SKU LIST RECORD                       *        
      *                     LRECL = 230                                *        
      * ****************************************************************        
                                                                                
       01  IM091-RCP-SKU-LIST-REC.                                              
           05  IM091-ITM-NBR                PIC  S9(15)V COMP-3.                
           05  IM091-STAT-CDE               PIC   X(2).                         
           05  IM091-SUM-LVL-CDE            PIC   X(1).                         
           05  IM091-DIST-NBR               PIC   X(2).                         
           05  IM091-OH-QTY                 PIC  S9(9) COMP.                    
           05  IM091-OH-AMT                 PIC  S9(9)V9(2) COMP-3.             
           05  IM091-ONORD-QTY              PIC  S9(9) COMP.                    
           05  IM091-ONORD-AMT              PIC  S9(9)V9(2) COMP-3.             
           05  IM091-ENTRE-QTY              PIC  S9(9) COMP.                    
           05  IM091-ENTRE-AMT              PIC  S9(9)V9(2) COMP-3.             
           05  IM091-SUN-SIS-QTY            PIC  S9(9) COMP.                    
           05  IM091-SUN-SIS-AMT            PIC  S9(9)V9(2) COMP-3.             
           05  IM091-MON-SIS-QTY            PIC  S9(9) COMP.                    
           05  IM091-MON-SIS-AMT            PIC  S9(9)V9(2) COMP-3.             
           05  IM091-TUE-SIS-QTY            PIC  S9(9) COMP.                    
           05  IM091-TUE-SIS-AMT            PIC  S9(9)V9(2) COMP-3.             
           05  IM091-WED-SIS-QTY            PIC  S9(9) COMP.                    
           05  IM091-WED-SIS-AMT            PIC  S9(9)V9(2) COMP-3.             
           05  IM091-THU-SIS-QTY            PIC  S9(9) COMP.                    
           05  IM091-THU-SIS-AMT            PIC  S9(9)V9(2) COMP-3.             
           05  IM091-FRI-SIS-QTY            PIC  S9(9) COMP.                    
           05  IM091-FRI-SIS-AMT            PIC  S9(9)V9(2) COMP-3.             
           05  IM091-SAT-SIS-QTY            PIC  S9(9) COMP.                    
           05  IM091-SAT-SIS-AMT            PIC  S9(9)V9(2) COMP-3.             
           05  IM091-PWK-SUN-SIS-QTY        PIC  S9(9) COMP.                    
           05  IM091-PWK-SUN-SIS-AMT        PIC  S9(9)V9(2) COMP-3.             
           05  IM091-PWK-MON-SIS-QTY        PIC  S9(9) COMP.                    
           05  IM091-PWK-MON-SIS-AMT        PIC  S9(9)V9(2) COMP-3.             
           05  IM091-PWK-TUE-SIS-QTY        PIC  S9(9) COMP.                    
           05  IM091-PWK-TUE-SIS-AMT        PIC  S9(9)V9(2) COMP-3.             
           05  IM091-PWK-WED-SIS-QTY        PIC  S9(9) COMP.                    
           05  IM091-PWK-WED-SIS-AMT        PIC  S9(9)V9(2) COMP-3.             
           05  IM091-PWK-THU-SIS-QTY        PIC  S9(9) COMP.                    
           05  IM091-PWK-THU-SIS-AMT        PIC  S9(9)V9(2) COMP-3.             
           05  IM091-PWK-FRI-SIS-QTY        PIC  S9(9) COMP.                    
           05  IM091-PWK-FRI-SIS-AMT        PIC  S9(9)V9(2) COMP-3.             
           05  IM091-PWK-SAT-SIS-QTY        PIC  S9(9) COMP.                    
           05  IM091-PWK-SAT-SIS-AMT        PIC  S9(9)V9(2) COMP-3.             
           05  IM091-IN-TRNST-QTY           PIC  S9(9) COMP.                    
           05  IM091-IN-TRNST-AMT           PIC  S9(9)V9(2) COMP-3.             
           05  IM091-SKU                    PIC S9(08)V COMP-3.                 
           05  IM091-INTR-UPC-ID            PIC S9(09) COMP.                    
           05  IM091-UNT-RTL-AMT            PIC S9(07)V9(02) COMP-3.            
           05  IM091-STR-NBR                PIC S9(04) COMP.                    
           05  IM091-TICKET-COLOR           PIC X(06).                          
           05  FILLER                       PIC X(15).                          
