       01  IM033-ITEM-SKU-LOC-UNLD-REC.                                         
           05 IM033-INTR-UPC-ID             PIC  S9(09) COMP.                   
           05 IM033-ITM-NBR                 PIC  S9(15)V COMP-3.                
           05 IM033-UNT-COST-AMT            PIC  S9(7)V9(3) COMP-3.             
