      ****************************************************************          
      *    IMRD051 - ITEM DOMAIN TUPC UNLOAD FILE COPYBOOK                      
      *    LENGTH  - 135 BYTES                                                  
W36546*                                                                         
W36546*    WR36546    08/19/2010   COGNIZANT - ADD A NEW FIELD                  
W36546*                            IM051-TST-PRD-TYP-SEQ-NBR                    
W36546*                                                                         
W38861*    WR38361    08/19/2010   COGNIZANT - ADD A NEW FIELD                  
W38861*                            IM051-WHSE-RPLNT-IND                         
W38861*                                                                         
      ****************************************************************          
       01  IM051-ITEM-TUPC-UNLD-REC.                                            
           05  IM051-UPC-ID                 PIC  S9(09)  COMP.                  
           05  IM051-SUB-CL-MDSEAR-ID       PIC  S9(6)V COMP-3.                 
           05  IM051-VS-ID                  PIC  S9(09) COMP.                   
           05  IM051-INTR-UPC-DESC          PIC   X(30).                        
           05  IM051-INNR-PK-QTY            PIC  S9(04)  COMP.                  
           05  IM051-OUTR-PK-QTY            PIC  S9(04)  COMP.                  
           05  IM051-KOHLS-SIZE-CDE         PIC  S9(09)  COMP.                  
           05  IM051-NRF-CLOR-CDE           PIC   X(03).                        
           05  IM051-CSTM-CLOR-DESC         PIC   X(10).                        
           05  IM051-CUSTFACG-CLOR-DESC     PIC   X(22).                        
           05  IM051-REGN-PRIC-IND          PIC   X(01).                        
           05  IM051-RPLNMT-IND             PIC   X(01).                        
           05  IM051-KY-ITM-IND             PIC   X(01).                        
           05  IM051-POG-IND                PIC   X(01).                        
           05  IM051-GP-CDE                 PIC   X(03).                        
           05  IM051-SEA-SEQ-NBR            PIC  S9(04)  COMP.                  
           05  IM051-UNT-COST-1ST-AMT       PIC  S9(7)V9(3)  COMP-3.            
           05  IM051-TX-PRD-CDE-SEQ-NBR     PIC  S9(04)  COMP.                  
           05  IM051-WT-UM-CDE              PIC   X(02).                        
           05  IM051-WT-UM-QTY              PIC  S9(5)V9(3)  COMP-3.            
           05  IM051-SIZE-UM-CDE            PIC   X(02).                        
           05  IM051-WD-UM-QTY              PIC  S9(4)V9(3)  COMP-3.            
           05  IM051-HT-UM-QTY              PIC  S9(4)V9(3)  COMP-3.            
           05  IM051-DPTH-UM-QTY            PIC  S9(4)V9(3)  COMP-3.            
           05  IM051-TRNSTN-IND             PIC   X(01).                        
           05  IM051-PO-SHRT-CYC-IND        PIC   X(01).                        
           05  IM051-EFF-BEG-DTE            PIC   X(10).                        
W36546     05  IM051-TST-PRD-TYP-SEQ-NBR    PIC   S9(4) COMP.                   
W38861     05  IM051-WHSE-RPLNT-IND         PIC   X(01).                        
