      *---------------------------------------------------------------*         
      *                                                               *         
      *    IMRD096 - DIRECT SHIP AND WEB EXCLUSIVE ITEMS              *         
      *              EXTRACT FILE LAYOUT                              *         
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *---------------------------------------------------------------*         
       01  IM096-RECORD.                                                        
           05  IM096-SUB-CL-MDSEAR-ID      PIC S9(06)V COMP-3                   
                                                       VALUE ZERO.              
           05  IM096-VS-ID                 PIC S9(9)   COMP                     
                                                       VALUE ZERO.              
           05  IM096-UPC-ID                PIC S9(9)   COMP                     
                                                       VALUE ZERO.              
           05  IM096-INTR-UPC-DESC         PIC  X(30)  VALUE SPACES.            
           05  IM096-PRD-GP-NBR            PIC S9(08)V COMP-3                   
                                                       VALUE ZERO.              
           05  IM096-WEB-EXCLUSION         PIC  X(01)  VALUE SPACES.            
           05  IM096-DIRECT-SHIP           PIC S9(04)  COMP                     
                                                       VALUE ZERO.              
           05  IM096-SKU-CREATE-DTE        PIC  X(10)  VALUE SPACES.            
