      *---------------------------------------------------------------*         
      *                                                               *         
      *    IMRD038 - ITEM GROUP PRICING DOMAIN UNLOAD FILE COPYBOOK   *         
      *    LENGTH  - 37 BYTES                                         *         
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *---------------------------------------------------------------*         
       01  IM038-GROUP-PRICE-UNLD-REC.                                          
           05 IM038-MEITGP-NBR              PIC  S9(09)  COMP.                  
           05 IM038-MEITGP-NAME             PIC   X(20).                        
           05 IM038-MITGPL-QTY              PIC  S9(04)  COMP.                  
           05 IM038-GP-AMT                  PIC  S9(5)V9(2)  COMP-3.            
           05 IM038-USG-RSTC-CDE            PIC   X(01).                        
           05 IM038-ORIG-MDSEDP-NBR         PIC   X(03).                        
           05 IM038-ORIG-BUYER-NBR          PIC   X(03).                        
