      ****************************************************************          
      *    IMRD029 - ITEM TAXWARE CODE VARIANCE COPYBOOK                        
      *    LENGTH  -  78 BYTES                                                  
      ****************************************************************          
       01  IM029-TAX-VARIANCE-REC.                                              
           05  IM029-DEPT                   PIC   X(03).                        
           05  FILLER                       PIC   X(01) VALUE ','.              
           05  IM029-MAJOR-CLASS            PIC   X(02).                        
           05  FILLER                       PIC   X(01) VALUE ','.              
           05  IM029-SUBCLASS               PIC   X(03).                        
           05  FILLER                       PIC   X(01) VALUE ','.              
           05  IM029-TAXWARE-DESC           PIC   X(20).                        
           05  FILLER                       PIC   X(47).                        
