      *---------------------------------------------------------------*         
      *                                                               *         
      *    IMRD006 - CORPORATE INITIATIVES COPYBOOK                   *         
      *              EXTRACT FILE LAYOUT                              *         
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *---------------------------------------------------------------*         
       01  IM006-RECORD.                                                        
           05  IM006-CORP-INITV-ID         PIC 9(04) VALUE ZERO.                
           05  IM006-WEEK-BEG-DTE          PIC X(10) VALUE SPACES.              
           05  IM006-SEASON                PIC X(06) VALUE SPACES.              
           05  IM006-WEEK-BEG-YEAR         PIC 9(04) VALUE ZERO.                
           05  IM006-WEEK-BEG-MONTH        PIC X(09) VALUE SPACES.              
           05  IM006-STR-NBR               PIC 9(04) VALUE ZERO.                
           05  IM006-DMM-NBR               PIC X(02) VALUE SPACES.              
           05  IM006-DEPT-NBR              PIC X(03) VALUE SPACES.              
           05  IM006-MAJ-CLASS-NBR         PIC X(02) VALUE SPACES.              
           05  IM006-SUB-CLASS-NBR         PIC X(03) VALUE SPACES.              
           05  IM006-SKU-NBR               PIC X(08) VALUE SPACES.              
           05  IM006-INTR-UPC-ID           PIC 9(10) VALUE ZERO.                
           05  IM006-ITM-NBR               PIC S9(15)V COMP-3                   
                                                  VALUE ZERO.                   
           05  IM006-UNT-RTL-AMT           PIC S9(7)V9(2) COMP-3                
                                                  VALUE ZERO.                   
           05  IM006-CLIMATE-DESC          PIC X(30) VALUE SPACES.              
           05  IM006-PGM-ID                PIC 9(10) VALUE ZERO.                
           05  FILLER                      PIC X(42).                           
