      ******************************************************************00010000
      *    IMRD036 - SKU COMPRESSION CANDIDATES COPYBOOK               *00020000
      *    LENGTH  - 20 BYTES                                          *00030000
      ******************************************************************00040000
      ******************************************************************00050000
      *    WR/PITS#     DATE        DESCRIPTION                        *00060000
      *    --------   ----------   ---------------------------------   *00070000
      *               11/17/2006   INITIAL DEVELOPMENT                 *00080000
      ******************************************************************00110000
       01  IM036-SKU-COMPRESS-CAND-REC.                                 00120001
           05  IM036-INTR-UPC-ID       PIC S9(09)    VALUE +0  COMP.    00170000
           05  IM036-ITM-NBR           PIC S9(15)    VALUE +0  COMP-3.  00190000
           05  IM036-SKU               PIC S9(08)V   VALUE +0  COMP-3.  00250000
           05  FILLER                  PIC X(03)     VALUE SPACES.      00300000
