      * ****************************************************************        
      *             IMRD092  RCP SKU LIST RECORD                       *        
      *                     LRECL = 64                                 *        
      * ****************************************************************        
                                                                                
       01  IM092-RCP-SKU-REC.                                                   
           05 IM092-SKU               PIC S9(08)V COMP-3 VALUE +0.              
           05 IM092-ITM-NBR           PIC S9(15)V COMP-3 VALUE +0.              
           05 IM092-INTR-UPC-ID       PIC S9(09) COMP    VALUE +0.              
           05 IM092-STAT-CDE          PIC  X(02)         VALUE SPACE.           
           05 IM092-UNT-RTL-AMT       PIC S9(07)V9(02) COMP-3 VALUE +0.         
           05 IM092-STR-NBR           PIC S9(04) COMP    VALUE +0.              
           05 IM092-TICKET-COLOR      PIC  X             VALUE SPACE.           
           05 IM092-UNT-RTL-CHG-DTE   PIC  X(10)         VALUE SPACE.           
           05 IM092-STAT-CHG-DTE      PIC  X(10)         VALUE SPACE.           
           05 IM092-ORIG-CLR-DTE      PIC  X(10)         VALUE SPACE.           
           05 IM092-MKDN-CDE          PIC  X             VALUE SPACE.           
           05 FILLER                  PIC  X(6)          VALUE SPACE.           
                                                                                
