00001 ******************************************************************09/07/99
00002 * IMRD032 - STYLE COLOR CLEANUP ERROR RECORD                      IMRD007 
00003 ******************************************************************   LV001
00006  01  IM032-REC.                                                           
           05  IM032-DEPT-NBR               PIC  S9(4)V COMP-3.                 
           05  IM032-VS-ID                  PIC  S9(9) COMP.                    
           05  IM032-SUB-CL-MDSEAR-ID       PIC  S9(6)V COMP-3.                 
           05  IM032-KOHLS-STD-SZ-ID        PIC  S9(9) COMP.                    
           05  IM032-KOHLS-SIZE-CDE         PIC  S9(9) COMP.                    
           05  IM032-NRF-CLOR-CDE           PIC   X(3).                         
           05  IM032-INTR-UPC-ID            PIC  S9(9) COMP.                    
           05  IM032-ERROR-MSG              PIC  X(74).                         
