      *---------------------------------------------------------------*         
      *                                                               *         
      *    IMRD097 - DIRECT SHIP WEB EXCLUSIVE ITEMS EXTRACT          *         
      *              FILE LAYOUT                                      *         
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *---------------------------------------------------------------*         
       01  IM097-RECORD.                                                        
           05  IM097-DMM-NBR               PIC  X(02)  VALUE SPACE.             
           05  FILLER                      PIC  X(01)  VALUE ','.               
           05  IM097-DMM-DESC              PIC  X(25)  VALUE SPACE.             
           05  FILLER                      PIC  X(01)  VALUE ','.               
           05  IM097-VENDOR-NAME           PIC  X(30)  VALUE SPACE.             
           05  FILLER                      PIC  X(01)  VALUE ','.               
           05  IM097-DEPT-NBR              PIC  X(03)  VALUE SPACE.             
           05  FILLER                      PIC  X(01)  VALUE ','.               
           05  IM097-MAJ-CL-NBR            PIC  X(02)  VALUE SPACE.             
           05  FILLER                      PIC  X(01)  VALUE ','.               
           05  IM097-SUB-CL-NBR            PIC  X(03)  VALUE SPACE.             
           05  FILLER                      PIC  X(01)  VALUE ','.               
           05  IM097-VS-NBR                PIC  X(20)  VALUE SPACE.             
           05  FILLER                      PIC  X(01)  VALUE ','.               
           05  IM097-SKU                   PIC  X(08)  VALUE SPACE.             
           05  FILLER                      PIC  X(01)  VALUE ','.               
           05  IM097-PRD-GP-NBR            PIC  X(08)  VALUE SPACE.             
           05  FILLER                      PIC  X(01)  VALUE ','.               
           05  IM097-INTR-UPC-DESC         PIC  X(30)  VALUE SPACES.            
           05  FILLER                      PIC  X(01)  VALUE ','.               
           05  IM097-DIRECT-SHIP           PIC  X(01)  VALUE SPACE.             
           05  FILLER                      PIC  X(01)  VALUE ','.               
           05  IM097-WEB-EXCLUSIVE         PIC  X(01)  VALUE SPACE.             
           05  FILLER                      PIC  X(01)  VALUE ','.               
           05  IM097-STATUS-CODE           PIC  X(02)  VALUE SPACE.             
           05  FILLER                      PIC  X(01)  VALUE ','.               
           05  IM097-SKU-CREATE-DATE       PIC  X(10)  VALUE SPACE.             
