      *---------------------------------------------------------------*         
      *                                                               *         
      *    IMRD035 - CORPORATE INITIATIVES COPYBOOK                   *         
      *              FILE FEED FROM PLANNOGRAM TO ITEM                *         
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *    WR27078     05/11/2004  ADD PLANOGRAM NAME, FIXTURE TYPE,  *         
      *                            FIXTURE LOCATION, POSITION ON      *         
      *                            FIXTURE, SET & BREAK DATES         *         
      *    WR26162    11/14/2003   CHANGE CLIMATE TO CLUSTER AND      *         
      *                            THE LENGTH TO 5, FROM 4.           *         
      *    WR24636    05/07/2003   INITIAL CREATION                   *         
      *---------------------------------------------------------------*         
       01  IMRD035-RECORD.                                                      
           05  IM035-ITEM-KEY-DATA.                                             
               10  IM035-CORP-INITV-ID          PIC 9(04).                      
               10  IM035-INTR-UPC-ID            PIC 9(10).                      
               10  IM035-CLUSTER                PIC X(05).                      
                   88  IM035-CLSC-CORE          VALUE '1CLSC'.                  
                   88  IM035-UPDT-CORE          VALUE '2UPDC'.                  
                   88  IM035-CLSC-WARM          VALUE '3CLSW'.                  
                   88  IM035-UPDT-WARM          VALUE '4UPDW'.                  
                   88  IM035-UPDT-HOT           VALUE '5UPDH'.                  
               10  IM035-PLANOGRAM-NAME         PIC X(40).                      
               10  IM035-FIXTURE-TYPE           PIC X(10).                      
               10  IM035-FIXTURE-LOCATION       PIC X(08).                      
               10  IM035-POSITION-ON-FIXTURE    PIC 9(04).                      
               10  IM035-EFF-BEG-DTE            PIC X(10).                      
               10  IM035-EFF-END-DTE            PIC X(10).                      
      *    05  IM035-FIX-LOC-ARRAY.                                             
      *        10  FILLER OCCURS 9 TIMES INDEXED BY IM035-IDX.                  
      *            15  IM035-FIXTURE-LOCATION   PIC X(10).                      
      *    05  FILLER                           PIC X(71).                      
