      ***************************************************************           
      *   IMRD123 - WEEKLY CUSTOMER CHOICE DELIM RECORD                         
      *   RECORD LENGTH = 160 BYTES                                             
      ***************************************************************           
       01  IM123-CC-DELIM-RECORD.                                               
           05 IM123-CUST-CHC-ID            PIC  9(10).                          
           05 FILLER                       PIC  X(01) VALUE '|'.                
           05 IM123-AM-CUST-CHC-CDE        PIC  X(32).                          
           05 FILLER                       PIC  X(01) VALUE '|'.                
           05 IM123-CUST-CHC-DESC          PIC  X(50).                          
           05 FILLER                       PIC  X(01) VALUE '|'.                
           05 IM123-STYL-ID                PIC  9(8).                           
           05 FILLER                       PIC  X(01) VALUE '|'.                
           05 IM123-CSTM-CLOR-DESC         PIC  X(10).                          
           05 FILLER                       PIC  X(01) VALUE '|'.                
           05 IM123-NRF-CLOR-CDE           PIC  X(03).                          
           05 FILLER                       PIC  X(01) VALUE '|'.                
           05 IM123-CRE-DTE                PIC  X(10).                          
           05 FILLER                       PIC  X(01) VALUE '|'.                
           05 IM123-CRE-BY-USR-ID          PIC  X(08).                          
           05 FILLER                       PIC  X(01) VALUE '|'.                
           05 IM123-EFF-BEG-DTE            PIC  X(10).                          
           05 FILLER                       PIC  X(01) VALUE '|'.                
           05 IM123-EFF-END-DTE            PIC  X(10).                          
