00001 ******************************************************************09/07/99
00002 *    IMRD007 - TUPCPLS PURGE FILE LAYOUT - 144 BYTES              IMRD007 
00003 ******************************************************************   LV001
00006  01  IM007-TUPCPLS-PURGE-RECORD.                                          
00005      05  IM007-TUPCPLS-DATA.                                              
00005          10  IM007-TUPCPLS-UPC-ID          PIC  S9(9) COMP.               
00005          10  IM007-TUPCPLS-OPERCO-NBR      PIC   X(2).                    
00005          10  IM007-TUPCPLS-STR-NBR         PIC  S9(4) COMP.               
00005          10  IM007-TUPCPLS-EFF-BEG-TMST    PIC   X(26).                   
00005          10  IM007-TUPCPLS-EFF-END-TMST    PIC   X(26).                   
00005          10  IM007-TUPCPLS-UPC-STAT-CDE    PIC   X(2).                    
00005          10  IM007-TUPCPLS-UNT-COST-AMT    PIC  S9(7)V9(3) COMP-3.        
00005          10  IM007-TUPCPLS-UNT-RTL-AMT     PIC  S9(7)V9(2) COMP-3.        
00005          10  IM007-TUPCPLS-MEITGP-NBR      PIC  S9(9) COMP.               
00005          10  IM007-TUPCPLS-CRE-BY-USR-ID   PIC   X(8).                    
00005          10  IM007-TUPCPLS-CRE-TMST        PIC   X(26).                   
00005          10  IM007-TUPCPLS-ITM-NBR         PIC  S9(15)V COMP-3.           
00005          10  IM007-TUPCPLS-PLU-IND         PIC   X(1).                    
00005          10  IM007-TUPCPLS-UPC-STAT-CHG-DTE                               
                                                 PIC   X(10).                   
00005          10  IM007-TUPCPLS-UNT-RTL-CHG-DTE PIC   X(10).                   
00005      05  IM007-VS-ID                       PIC S9(09) COMP.               
