      ****************************************************************          
      *    IMRD064 - XXT_BOM_SKU_ATTR EXTRACT FILE COPYBOOK                     
      *    LENGTH  - 100 BYTES                                                  
      ****************************************************************          
       01  IM064-BOM-SKU-ATTR-EXTR-REC.                                         
           05  IM064-SKU-NBR          PIC  S9(08)V COMP-3 VALUE +0.             
           05  IM064-FSCL-BOM-DATE    PIC   X(10)         VALUE SPACES.         
           05  IM064-DEPT-NBR         PIC  S9(04)V COMP-3 VALUE +0.             
           05  IM064-MAJ-CL-NBR       PIC  S9(04)V COMP-3 VALUE +0.             
           05  IM064-SUB-CL-NBR       PIC  S9(04)V COMP-3 VALUE +0.             
           05  IM064-ENT-ID           PIC  S9(09)  COMP   VALUE +0.             
           05  IM064-LBL-SEQ-NBR      PIC  S9(04)  COMP   VALUE +0.             
           05  IM064-INTR-UPC-ID      PIC  S9(09)  COMP   VALUE +0.             
           05  IM064-ITM-NBR          PIC  S9(15)V COMP-3 VALUE +0.             
           05  IM064-STYL-ID          PIC  S9(08)V COMP-3 VALUE +0.             
           05  IM064-VS-NBR           PIC   X(20)         VALUE SPACES.         
           05  IM064-VS-ID            PIC  S9(09)  COMP   VALUE +0.             
           05  FILLER                 PIC   X(29)         VALUE SPACES.         
