      ******************************************************************        
      **                        IMWS008                               **        
      **                                                              **        
      **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **        
      **  BRAND VENDOR RELATIONSHIP CRITERIA SPEC.                    **        
      **  LENGTH:  200 BYTES                                          **        
      ******************************************************************        
               10  IM008-INTER-APPL-COMMAREA  REDEFINES                         
                   INTER-APPL-COMM-AREA.                                        
                   15  FILLER                         PIC X(01).                
                   15  IM008-NUMBER-OF-SELECTED-ITEMS PIC S9(09)                
                                                          COMP-3.               
                   15  IM008-NUMBER-OF-TS-ITEMS       PIC S9(05)                
                                                          COMP-3.               
                   15  IM008-SEL-QUEUE-NAME           PIC X(8).                 
                   15  IM008-DEPT                     PIC X(03).                
                   15  IM008-DEPT-DESC                PIC X(25).                
                   15  IM008-BRAND                    PIC X(20).                
                   15  IM008-VENDOR                   PIC X(30).                
                   15  IM008-BEG-DATE                 PIC X(10).                
                   15  IM008-END-DATE                 PIC X(10).                
                   15  IM008-SHOW-ALL-IND             PIC X(01).                
                   15  IM008-LBL-SEQ-NBR              PIC S9(9) COMP.           
                   15  IM008-ENT-ID                   PIC S9(9) COMP.           
                   15  IM008-RLTNSHP-ID               PIC S9(9) COMP.           
                   15  IM008-RETURN-TYPE-IND          PIC X(01).                
                       88  IM008-RETURN-BRAND             VALUE 'B'.            
                       88  IM008-RETURN-VENDOR            VALUE 'V'.            
                   15  IM008-RETURN-DATA              PIC X(30).                
                   15  FILLER                         PIC X(41).                
