      *----------------------------------------------------------------*        
      *                         IMWS006                                *        
      *                                                                *        
      *   THIS WORKING STORAGE IS USED TO CREATE MAINTENANCE LOG       *        
      *   MESSAGES ON THE TSKULOG TABLE FOR USE WITH MERCHANDISE       *        
      *   ALLOCATION.                                                  *        
      *                                                                *        
      *----------------------------------------------------------------*        
                                                                                
      *                                                                         
      *                                                                         
       01  IM006-AM-ADD-TSK-MESSAGES.                                           
      *                                                                         
      *                                                                         
           05  IM006-AM-ADD-TSK-MSG-1.                                          
               10  FILLER                        PIC X(13)  VALUE               
                  'DESCRIPTION=('.                                              
               10  IM006-AM101-SKU-DESCRIPTION   PIC X(25).                     
               10  FILLER                        PIC X(08)  VALUE               
                  ') SIZE=('.                                                   
               10  IM006-AM101-SIZE-DESCRIPTION  PIC X(20).                     
               10  FILLER                        PIC X(09)  VALUE               
                  ') COLOR=('.                                                  
               10  IM006-AM101-COLOR-DESCRIPTION PIC X(20).                     
               10  FILLER                        PIC X(09)  VALUE SPACE.        
      *                                                                         
      *                                                                         
       01  IM006-CM-CHANGE-TSK-MESSAGES.                                        
      *                                                                         
      *                                                                         
           05  IM006-CM-CHANGE-TSK-MSG-1.                                       
               10  FILLER                        PIC X(19)  VALUE               
                  'DESCRIPTION:  OLD=('.                                        
               10  IM006-CM-OLD-SKU-DESCRIPTION  PIC X(25).                     
               10  FILLER                        PIC X(9)   VALUE               
                  ')   NEW=('.                                                  
               10  IM006-CM-NEW-SKU-DESCRIPTION  PIC X(25).                     
               10  FILLER                        PIC X(1)   VALUE ')'.          
               10  FILLER                        PIC X(25)  VALUE SPACE.        
      *                                                                         
           05  IM006-CM-CHANGE-TSK-MSG-2.                               .       
               10  FILLER                        PIC X(12)  VALUE               
                  'SIZE:  OLD=('.                                               
               10  IM006-CM-OLD-SIZE-DESCRIPTION PIC X(20).                     
               10  FILLER                        PIC X(9)   VALUE               
                  ')   NEW=('.                                                  
               10  IM006-CM-NEW-SIZE-DESCRIPTION PIC X(20).                     
               10  FILLER                        PIC X(1)   VALUE ')'.          
               10  FILLER                        PIC X(42)  VALUE SPACE.        
      *                                                                         
           05  IM006-CM-CHANGE-TSK-MSG-3.                               .       
               10  FILLER                        PIC X(13)  VALUE               
                  'COLOR:  OLD=('.                                              
               10  IM006-CM-OLD-COLOR-DESCRIPTION PIC X(20).                    
               10  FILLER                        PIC X(9)   VALUE               
                  ')   NEW=('.                                                  
               10  IM006-CM-NEW-COLOR-DESCRIPTION PIC X(20).                    
               10  FILLER                        PIC X(1)   VALUE ')'.          
               10  FILLER                        PIC X(41)  VALUE SPACE.        
      *                                                                         
           05  IM006-CM-CHANGE-TSK-MSG-4.                                       
               10  FILLER                        PIC X(19)  VALUE               
                  'STATUS CODE:  OLD=('.                                        
               10  IM006-CM-OLD-STATUS-CODE      PIC 9(2).                      
               10  FILLER                        PIC X(9)   VALUE               
                  ')   NEW=('.                                                  
               10  IM006-CM-NEW-STATUS-CODE      PIC 9(2).                      
               10  FILLER                        PIC X(1)   VALUE ')'.          
               10  FILLER                        PIC X(71)  VALUE SPACE.        
      *                                                                         
           05  IM006-CM-CHANGE-TSK-MSG-5.                                       
               10  FILLER                        PIC X(21)  VALUE               
                  'IN-HSE-VENDOR:  OLD=('.                                      
               10  IM006-CM-OLD-IN-HSE-VENDOR-NBR                               
                                                 PIC 9(3).                      
               10  FILLER                        PIC X(9)   VALUE               
                  ')   NEW=('.                                                  
               10  IM006-CM-NEW-IN-HSE-VENDOR-NBR                               
                                                 PIC 9(3).                      
               10  FILLER                        PIC X(1)   VALUE ')'.          
               10  FILLER                        PIC X(67)  VALUE SPACE.        
      *                                                                         
           05  IM006-CM-CHANGE-TSK-MSG-10.                                      
               10  FILLER                        PIC X(22)  VALUE               
                  'CURRENT RETAIL:  OLD=('.                                     
               10  IM006-CM-OLD-CURRENT-RETAIL   PIC ZZZZZ9.99.                 
               10  FILLER                        PIC X(9)   VALUE               
                  ')   NEW=('.                                                  
               10  IM006-CM-NEW-CURRENT-RETAIL   PIC ZZZZZ9.99.                 
               10  FILLER                        PIC X(1)   VALUE ')'.          
               10  FILLER                        PIC X(54)  VALUE SPACE.        
      *                                                                         
           05  IM006-CM-CHANGE-TSK-MSG-16.                                      
               10  FILLER                        PIC X(18)  VALUE               
                  'GROUP CODE:  OLD=('.                                         
               10  IM006-CM-OLD-GROUP-CODE       PIC X(3).                      
               10  FILLER                        PIC X(9)   VALUE               
                  ')   NEW=('.                                                  
               10  IM006-CM-NEW-GROUP-CODE       PIC X(3).                      
               10  FILLER                        PIC X(1)   VALUE ')'.          
               10  FILLER                        PIC X(70)  VALUE SPACE.        
      *                                                                         
           05  IM006-CM-CHANGE-TSK-MSG-19.                                      
               10  FILLER                        PIC X(17)  VALUE               
                  'GROUP QTY:  OLD=('.                                          
               10  IM006-CM-OLD-GP-QTY           PIC ZZZZ9.                     
               10  FILLER                        PIC X(9)   VALUE               
                  ')   NEW=('.                                                  
               10  IM006-CM-NEW-GP-QTY           PIC ZZZZ9.                     
               10  FILLER                        PIC X(1)   VALUE ')'.          
               10  FILLER                        PIC X(67)  VALUE SPACE.        
      *                                                                         
           05  IM006-CM-CHANGE-TSK-MSG-20.                                      
               10  FILLER                        PIC X(20)  VALUE               
                  'GROUP RETAIL:  OLD=('.                                       
               10  IM006-CM-OLD-GP-RTL-AMT       PIC ZZZZZ9.99.                 
               10  FILLER                        PIC X(9)   VALUE               
                  ')   NEW=('.                                                  
               10  IM006-CM-NEW-GP-RTL-AMT       PIC ZZZZZ9.99.                 
               10  FILLER                        PIC X(1)   VALUE ')'.          
               10  FILLER                        PIC X(56)  VALUE SPACE.        
      *                                                                         
           05  IM006-CM-CHANGE-TSK-MSG-28.                                      
               10  FILLER                        PIC X(25)  VALUE               
                  'LONG VENDOR STYLE:  OLD=('.                                  
               10  IM006-CM-OLD-LONG-VENDOR-STYLE                               
                                                 PIC X(20).                     
               10  FILLER                        PIC X(9)   VALUE               
                  ')   NEW=('.                                                  
               10  IM006-CM-NEW-LONG-VENDOR-STYLE                               
                                                 PIC X(20).                     
               10  FILLER                        PIC X(1)   VALUE ')'.          
               10  FILLER                        PIC X(29)  VALUE SPACE.        
      *                                                                         
           05  IM006-CM-CHANGE-TSK-MSG-31.                                      
               10  FILLER                        PIC X(22)  VALUE               
                  'ENTERPRISE ID:   OLD=('.                                     
               10  IM006-CM-OLD-ENTERPRISE-ID    PIC 9(9).                      
               10  FILLER                        PIC X(9)   VALUE               
                  ')   NEW=('.                                                  
               10  IM006-CM-NEW-ENTERPRISE-ID    PIC 9(9).                      
               10  FILLER                        PIC X(1)   VALUE ')'.          
               10  FILLER                        PIC X(54)  VALUE SPACE.        
      *                                                                         
                                                                                
