      *----------------------------------------------------------------*        
      *                         IMWS009                                *        
      *                                                                *        
      *   THIS IS TS QUEUE RECORD LAYOUT USED IN THE BRAND VENDOR      *        
      *   RELATIONSHIP LIST PROGRAM (IMKCS315) TO PASS DATA TO THE     *        
      *   MAINTENANCE PROGRAMS.                                        *        
      *                                                                *        
      *----------------------------------------------------------------*        
                                                                                
       01  IM009-BRAND-VENDOR-REC.                                              
             05  IM009-SELECTED-ITEMS         PIC S9(05)  COMP-3                
                                                          VALUE ZERO.           
             05  IM009-MAX-ITEMS              PIC  9(02)  VALUE 20.             
             05  IM009-SELECTED-ITEM-ARRAY.                                     
                 10  FILLER                   OCCURS 20 TIMES                   
                                              INDEXED BY IM009-IDX.             
                     15  IM009-ITEM           PIC S9(09)  COMP-3.               
                     15  IM009-ACTION-SW      PIC  X(01).                       
                         88  IM009-ADD                    VALUE 'A'.            
                         88  IM009-DEL                    VALUE 'D'.            
                         88  IM009-ERR                    VALUE 'E'.            
                         88  IM009-INQ                    VALUE 'I'.            
                         88  IM009-UPD                    VALUE 'U'.            
                     15  IM009-KEY-DATA.                                        
                         20  IM009-BRAND      PIC X(20).                        
                         20  IM009-VENDOR     PIC X(30).                        
                         20  IM009-BEG-DATE   PIC X(10).                        
                         20  IM009-END-DATE   PIC X(10).                        
                         20  IM009-RLTNSHP-ID PIC S9(9) COMP.                   
