*          DATA SET INKM002    AT LEVEL 004 AS OF 08/16/93                      
************************************************************            00001   
*                                                                       00002   
*     INKM002                                                           00003   
*                                                                       00004   
*     GENERATED          : 07/23/93 AT 01:55:59 PM                      00005   
*     VERSION            : 2.7.01                                       00006   
*     CSD LEVEL          : 2.7.01                                       00007   
*     AUTHOR             : NEWUSER.                                     00008   
*     INSTALLATION       : KNOWLEDGEWARE, INC.                          00009   
*     ENCYCLOPEDIA       : PHYSICAL INVENTORY                           00010   
*     ENCYCLOPEDIA PATH  : C:\ADW_ENC\MLDE00A\                          00011   
*     MAP DETAILS                                                       00012   
*     LAST UPDATED 07/23/1993 AT 12:15:50 BY TKMA072                    00013   
*-----------------------------------------------------------            00014   
*                                                                       00015   
*  BMS MAPSET :  INKM002                                                00016   
*      MAP    :  IN002A                                                 00017   
************************************************************            00018   
         PRINT  NOGEN                                                   00019   
INKM002  DFHMSD TYPE=MAP,                                              X00020   
               TERM=3270-2,                                            X00021   
               EXTATT=YES,                                             X00022   
               LANG=COBOL,                                             X00023   
               MODE=INOUT,                                             X00024   
               TIOAPFX=YES,                                            X00025   
               STORAGE=AUTO                                             00026   
IN002A   DFHMDI LINE=2,                                                X00027   
               COLUMN=1,                                               X00028   
               SIZE=(19,80),                                           X00029   
               CTRL=(FREEKB),                                          X00030   
               MAPATTS=(COLOR,HILIGHT),                                X00031   
               DSATTS=(COLOR,HILIGHT)                                   00032   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00033   
*                                                                       00034   
*  SCREEN LINE 02                                                       00035   
*                                                                       00036   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00037   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00038   
               INITIAL='FOR',                                          X00039   
               COLOR=NEUTRAL,                                          X00040   
               LENGTH=3,                                               X00041   
               POS=(01,24)                                              00042**2
****************************************                                00043   
*  VARIABLE = ASTRNBR      N004                                         00044   
****************************************                                00045   
ASTRNBR  DFHMDF ATTRB=(ASKIP),                                         X00046   
               COLOR=BLUE,                                             X00047   
               LENGTH=4,                                               X00048   
               POS=(01,28)                                              00049   
****************************************                                00043   
*  VARIABLE = ASTRNAM      X020                                         00044   
****************************************                                00045   
ASTRNAM  DFHMDF ATTRB=(ASKIP),                                         X00046   
               COLOR=BLUE,                                             X00047   
               LENGTH=20,                                              X00048   
               POS=(01,33)                                              00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
*                                                                       00051   
*  SCREEN LINE 03                                                       00052   
*                                                                       00053   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00054   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00055   
               INITIAL='ITEMS',                                        X00056   
               COLOR=NEUTRAL,                                          X00057   
               LENGTH=5,                                               X00058   
               POS=(02,40)                                              00059   
****************************************                                00060   
*  VARIABLE = ASTRTIT      N005                                         00061   
****************************************                                00062   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00063   
               JUSTIFY=(LEFT,BLANK),                                   X00064   
               COLOR=GREEN,                                            X00065   
               HILIGHT=UNDERLINE,                                      X00066   
               PICOUT='ZZZZZ',                                         X00067   
               LENGTH=5,                                               X00068   
               POS=(02,46)                                              00069**4
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00070   
               INITIAL='TO',                                           X00071   
               COLOR=NEUTRAL,                                          X00072   
               LENGTH=2,                                               X00073   
               POS=(02,52)                                              00074**4
****************************************                                00075   
*  VARIABLE = AENDIT      N005                                          00076   
****************************************                                00077   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00078   
               JUSTIFY=(LEFT,BLANK),                                   X00079   
               COLOR=BLUE,                                             X00080   
               PICOUT='ZZZZZ',                                         X00081   
               LENGTH=5,                                               X00082   
               POS=(02,55)                                              00083**4
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00084   
               INITIAL='OF',                                           X00085   
               COLOR=NEUTRAL,                                          X00086   
               LENGTH=2,                                               X00087   
               POS=(02,61)                                              00088**4
****************************************                                00089   
*  VARIABLE = ATOTIT      N005                                          00090   
****************************************                                00091   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00092   
               JUSTIFY=(LEFT,BLANK),                                   X00093   
               COLOR=BLUE,                                             X00094   
               PICOUT='ZZZZZ',                                         X00095   
               LENGTH=5,                                               X00096   
               POS=(02,64)                                              00097**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00098   
*                                                                       00099   
*  SCREEN LINE 04                                                       00100   
*                                                                       00101   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00102   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00103   
               INITIAL='NUMBER OF',                                    X00104**2
               COLOR=NEUTRAL,                                          X00105   
               LENGTH=9,                                               X00106**2
               POS=(03,23)                                              00107**2
         DFHMDF ATTRB=(ASKIP),                                         X00108   
               INITIAL='NUMBER LEFT',                                  X00109**2
               COLOR=NEUTRAL,                                          X00110   
               LENGTH=11,                                              X00111**2
               POS=(03,35)                                              00112**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00113   
*                                                                       00114   
*  SCREEN LINE 05                                                       00115   
*                                                                       00116   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00117   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00118   
               INITIAL='SEL  ACT',                                     X00119**2
               COLOR=NEUTRAL,                                          X00120   
               LENGTH=8,                                               X00121**2
               POS=(04,2)                                               00122**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00123   
               INITIAL='AREA',                                         X00124   
               COLOR=NEUTRAL,                                          X00125   
               LENGTH=4,                                               X00126   
               POS=(04,14)                                              00127   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00128   
               INITIAL='FALLOUTS',                                     X00129   
               COLOR=NEUTRAL,                                          X00130   
               LENGTH=8,                                               X00131   
               POS=(04,23)                                              00132**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00133   
               INITIAL='TO CORRECT',                                   X00134**2
               COLOR=NEUTRAL,                                          X00135   
               LENGTH=10,                                              X00136**2
               POS=(04,35)                                              00137**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00138   
*                                                                       00139   
*  SCREEN LINE 06                                                       00140   
*                                                                       00141   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00142   
****************************************                                00143   
*  VARIABLE = ASEL01      X001                                          00144   
****************************************                                00145   
ASEL01   DFHMDF ATTRB=(UNPROT,IC),                                     X00146   
               COLOR=GREEN,                                            X00147   
               HILIGHT=UNDERLINE,                                      X00148   
               LENGTH=1,                                               X00149   
               POS=(05,3)                                               00150**2
         DFHMDF ATTRB=(ASKIP),                                         X00151   
               POS=(05,5),                                             X00152**2
               INITIAL=' ',                                            X00153   
               LENGTH=1                                                 00154   
****************************************                                00155   
*  VARIABLE = AACT01      X003                                          00156   
****************************************                                00157   
AACT01   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=3,                                               X00160   
               POS=(05,7)                                               00161**2
****************************************                                00162   
*  VARIABLE = AREA-NUMBER      N007                                     00163   
****************************************                                00164   
AAREA01  DFHMDF ATTRB=(ASKIP),                                         X00165   
               JUSTIFY=(LEFT,BLANK),                                   X00166   
               COLOR=BLUE,                                             X00167   
               PICOUT='ZZZZZZZ',                                       X00168   
               LENGTH=7,                                               X00169   
               POS=(05,12)                                              00170   
****************************************                                00171   
*  VARIABLE = AFLOUT       N005                                         00172   
****************************************                                00173   
AFLOUT1 DFHMDF ATTRB=(ASKIP),                                          X00174   
               JUSTIFY=(LEFT,BLANK),                                   X00175   
               COLOR=BLUE,                                             X00176   
               PICOUT='ZZZZZ',                                         X00177   
               LENGTH=5,                                               X00178   
               POS=(05,25)                                              00179**2
****************************************                                00180   
*  VARIABLE = ACRECT       N005                                         00181   
****************************************                                00182   
ACRECT1 DFHMDF ATTRB=(ASKIP),                                          X00183   
               JUSTIFY=(LEFT,BLANK),                                   X00184   
               COLOR=BLUE,                                             X00185   
               PICOUT='ZZZZZ',                                         X00186   
               LENGTH=5,                                               X00187   
               POS=(05,38)                                              00188**2
****************************************                                00189   
*  VARIABLE = ASTATS       X008                                         00190   
****************************************                                00191   
ASTATS1 DFHMDF ATTRB=(ASKIP),                                          X00192   
               COLOR=BLUE,                                             X00193   
               LENGTH=8,                                               X00194   
               POS=(05,45)                                              00195**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00196   
*                                                                       00197   
*  SCREEN LINE 07                                                       00198   
*                                                                       00199   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00200   
****************************************                                00201   
*  VARIABLE = ASEL01      X001                                          00202   
****************************************                                00203   
ASEL02   DFHMDF ATTRB=(UNPROT,IC),                                     X00204   
               COLOR=GREEN,                                            X00205   
               HILIGHT=UNDERLINE,                                      X00206   
               LENGTH=1,                                               X00207   
               POS=(06,3)                                               00208**2
         DFHMDF ATTRB=(ASKIP),                                         X00209   
               POS=(06,5),                                             X00210**2
               INITIAL=' ',                                            X00211   
               LENGTH=1                                                 00212   
****************************************                                00213   
*  VARIABLE = AACT01      X003                                          00214   
****************************************                                00215   
AACT02   DFHMDF ATTRB=(ASKIP),                                         X00216   
               COLOR=BLUE,                                             X00217   
               LENGTH=3,                                               X00218   
               POS=(06,7)                                               00219**2
****************************************                                00220   
*  VARIABLE = AREA-NUMBER      N007                                     00221   
****************************************                                00222   
AAREA02  DFHMDF ATTRB=(ASKIP),                                         X00223   
               JUSTIFY=(LEFT,BLANK),                                   X00224   
               COLOR=BLUE,                                             X00225   
               PICOUT='ZZZZZZZ',                                       X00226   
               LENGTH=7,                                               X00227   
               POS=(06,12)                                              00228   
****************************************                                00229   
*  VARIABLE = AFLOUT       N005                                         00230   
****************************************                                00231   
AFLOUT2 DFHMDF ATTRB=(ASKIP),                                          X00232   
               JUSTIFY=(LEFT,BLANK),                                   X00233   
               COLOR=BLUE,                                             X00234   
               PICOUT='ZZZZZ',                                         X00235   
               LENGTH=5,                                               X00236   
               POS=(06,25)                                              00237**2
****************************************                                00238   
*  VARIABLE = ACRECT       N005                                         00239   
****************************************                                00240   
ACRECT2 DFHMDF ATTRB=(ASKIP),                                          X00241   
               JUSTIFY=(LEFT,BLANK),                                   X00242   
               COLOR=BLUE,                                             X00243   
               PICOUT='ZZZZZ',                                         X00244   
               LENGTH=5,                                               X00245   
               POS=(06,38)                                              00246**2
****************************************                                00247   
*  VARIABLE = ASTATS       X008                                         00248   
****************************************                                00249   
ASTATS2 DFHMDF ATTRB=(ASKIP),                                          X00250   
               COLOR=BLUE,                                             X00251   
               LENGTH=8,                                               X00252   
               POS=(06,45)                                              00253**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00254   
*                                                                       00255   
*  SCREEN LINE 08                                                       00256   
*                                                                       00257   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00258   
****************************************                                00259   
*  VARIABLE = ASEL01      X001                                          00260   
****************************************                                00261   
ASEL03   DFHMDF ATTRB=(UNPROT,IC),                                     X00262   
               COLOR=GREEN,                                            X00263   
               HILIGHT=UNDERLINE,                                      X00264   
               LENGTH=1,                                               X00265   
               POS=(07,3)                                               00266**2
         DFHMDF ATTRB=(ASKIP),                                         X00267   
               POS=(07,5),                                             X00268**2
               INITIAL=' ',                                            X00269   
               LENGTH=1                                                 00270   
****************************************                                00271   
*  VARIABLE = AACT01      X003                                          00272   
****************************************                                00273   
AACT03   DFHMDF ATTRB=(ASKIP),                                         X00274   
               COLOR=BLUE,                                             X00275   
               LENGTH=3,                                               X00276   
               POS=(07,7)                                               00277**2
****************************************                                00278   
*  VARIABLE = AREA-NUMBER      N007                                     00279   
****************************************                                00280   
AAREA03  DFHMDF ATTRB=(ASKIP),                                         X00281   
               JUSTIFY=(LEFT,BLANK),                                   X00282   
               COLOR=BLUE,                                             X00283   
               PICOUT='ZZZZZZZ',                                       X00284   
               LENGTH=7,                                               X00285   
               POS=(07,12)                                              00286   
****************************************                                00287   
*  VARIABLE = AFLOUT       N005                                         00288   
****************************************                                00289   
AFLOUT3 DFHMDF ATTRB=(ASKIP),                                          X00290   
               JUSTIFY=(LEFT,BLANK),                                   X00291   
               COLOR=BLUE,                                             X00292   
               PICOUT='ZZZZZ',                                         X00293   
               LENGTH=5,                                               X00294   
               POS=(07,25)                                              00295**2
****************************************                                00296   
*  VARIABLE = ACRECT       N005                                         00297   
****************************************                                00298   
ACRECT3 DFHMDF ATTRB=(ASKIP),                                          X00299   
               JUSTIFY=(LEFT,BLANK),                                   X00300   
               COLOR=BLUE,                                             X00301   
               PICOUT='ZZZZZ',                                         X00302   
               LENGTH=5,                                               X00303   
               POS=(07,38)                                              00304**2
****************************************                                00305   
*  VARIABLE = ASTATS       X008                                         00306   
****************************************                                00307   
ASTATS3 DFHMDF ATTRB=(ASKIP),                                          X00308   
               COLOR=BLUE,                                             X00309   
               LENGTH=8,                                               X00310   
               POS=(07,45)                                              00311**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00312   
*                                                                       00313   
*  SCREEN LINE 09                                                       00314   
*                                                                       00315   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00316   
****************************************                                00317   
*  VARIABLE = ASEL01      X001                                          00318   
****************************************                                00319   
ASEL04   DFHMDF ATTRB=(UNPROT,IC),                                     X00320   
               COLOR=GREEN,                                            X00321   
               HILIGHT=UNDERLINE,                                      X00322   
               LENGTH=1,                                               X00323   
               POS=(08,3)                                               00324**2
         DFHMDF ATTRB=(ASKIP),                                         X00325   
               POS=(08,5),                                             X00326**2
               INITIAL=' ',                                            X00327   
               LENGTH=1                                                 00328   
****************************************                                00329   
*  VARIABLE = AACT01      X003                                          00330   
****************************************                                00331   
AACT04   DFHMDF ATTRB=(ASKIP),                                         X00332   
               COLOR=BLUE,                                             X00333   
               LENGTH=3,                                               X00334   
               POS=(08,7)                                               00335**2
****************************************                                00336   
*  VARIABLE = AREA-NUMBER      N007                                     00337   
****************************************                                00338   
AAREA04  DFHMDF ATTRB=(ASKIP),                                         X00339   
               JUSTIFY=(LEFT,BLANK),                                   X00340   
               COLOR=BLUE,                                             X00341   
               PICOUT='ZZZZZZZ',                                       X00342   
               LENGTH=7,                                               X00343   
               POS=(08,12)                                              00344   
****************************************                                00345   
*  VARIABLE = AFLOUT       N005                                         00346   
****************************************                                00347   
AFLOUT4 DFHMDF ATTRB=(ASKIP),                                          X00348   
               JUSTIFY=(LEFT,BLANK),                                   X00349   
               COLOR=BLUE,                                             X00350   
               PICOUT='ZZZZZ',                                         X00351   
               LENGTH=5,                                               X00352   
               POS=(08,25)                                              00353**2
****************************************                                00354   
*  VARIABLE = ACRECT       N005                                         00355   
****************************************                                00356   
ACRECT4 DFHMDF ATTRB=(ASKIP),                                          X00357   
               JUSTIFY=(LEFT,BLANK),                                   X00358   
               COLOR=BLUE,                                             X00359   
               PICOUT='ZZZZZ',                                         X00360   
               LENGTH=5,                                               X00361   
               POS=(08,38)                                              00362**2
****************************************                                00363   
*  VARIABLE = ASTATS       X008                                         00364   
****************************************                                00365   
ASTATS4 DFHMDF ATTRB=(ASKIP),                                          X00366   
               COLOR=BLUE,                                             X00367   
               LENGTH=8,                                               X00368   
               POS=(08,45)                                              00369**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00370   
*                                                                       00371   
*  SCREEN LINE 10                                                       00372   
*                                                                       00373   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00374   
****************************************                                00375   
*  VARIABLE = ASEL01      X001                                          00376   
****************************************                                00377   
ASEL05   DFHMDF ATTRB=(UNPROT,IC),                                     X00378   
               COLOR=GREEN,                                            X00379   
               HILIGHT=UNDERLINE,                                      X00380   
               LENGTH=1,                                               X00381   
               POS=(09,3)                                               00382**2
         DFHMDF ATTRB=(ASKIP),                                         X00383   
               POS=(09,5),                                             X00384**2
               INITIAL=' ',                                            X00385   
               LENGTH=1                                                 00386   
****************************************                                00387   
*  VARIABLE = AACT01      X003                                          00388   
****************************************                                00389   
AACT05   DFHMDF ATTRB=(ASKIP),                                         X00390   
               COLOR=BLUE,                                             X00391   
               LENGTH=3,                                               X00392   
               POS=(09,7)                                               00393**2
****************************************                                00394   
*  VARIABLE = AREA-NUMBER      N007                                     00395   
****************************************                                00396   
AAREA05  DFHMDF ATTRB=(ASKIP),                                         X00397   
               JUSTIFY=(LEFT,BLANK),                                   X00398   
               COLOR=BLUE,                                             X00399   
               PICOUT='ZZZZZZZ',                                       X00400   
               LENGTH=7,                                               X00401   
               POS=(09,12)                                              00402   
****************************************                                00403   
*  VARIABLE = AFLOUT       N005                                         00404   
****************************************                                00405   
AFLOUT5 DFHMDF ATTRB=(ASKIP),                                          X00406   
               JUSTIFY=(LEFT,BLANK),                                   X00407   
               COLOR=BLUE,                                             X00408   
               PICOUT='ZZZZZ',                                         X00409   
               LENGTH=5,                                               X00410   
               POS=(09,25)                                              00411**2
****************************************                                00412   
*  VARIABLE = ACRECT       N005                                         00413   
****************************************                                00414   
ACRECT5 DFHMDF ATTRB=(ASKIP),                                          X00415   
               JUSTIFY=(LEFT,BLANK),                                   X00416   
               COLOR=BLUE,                                             X00417   
               PICOUT='ZZZZZ',                                         X00418   
               LENGTH=5,                                               X00419   
               POS=(09,38)                                              00420**2
****************************************                                00421   
*  VARIABLE = ASTATS       X008                                         00422   
****************************************                                00423   
ASTATS5 DFHMDF ATTRB=(ASKIP),                                          X00424   
               COLOR=BLUE,                                             X00425   
               LENGTH=8,                                               X00426   
               POS=(09,45)                                              00427**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00428   
*                                                                       00429   
*  SCREEN LINE 11                                                       00430   
*                                                                       00431   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00432   
****************************************                                00433   
*  VARIABLE = ASEL01      X001                                          00434   
****************************************                                00435   
ASEL06   DFHMDF ATTRB=(UNPROT,IC),                                     X00436   
               COLOR=GREEN,                                            X00437   
               HILIGHT=UNDERLINE,                                      X00438   
               LENGTH=1,                                               X00439   
               POS=(10,3)                                               00440**2
         DFHMDF ATTRB=(ASKIP),                                         X00441   
               POS=(10,5),                                             X00442**2
               INITIAL=' ',                                            X00443   
               LENGTH=1                                                 00444   
****************************************                                00445   
*  VARIABLE = AACT01      X003                                          00446   
****************************************                                00447   
AACT06   DFHMDF ATTRB=(ASKIP),                                         X00448   
               COLOR=BLUE,                                             X00449   
               LENGTH=3,                                               X00450   
               POS=(10,7)                                               00451**2
****************************************                                00452   
*  VARIABLE = AREA-NUMBER      N007                                     00453   
****************************************                                00454   
AAREA06  DFHMDF ATTRB=(ASKIP),                                         X00455   
               JUSTIFY=(LEFT,BLANK),                                   X00456   
               COLOR=BLUE,                                             X00457   
               PICOUT='ZZZZZZZ',                                       X00458   
               LENGTH=7,                                               X00459   
               POS=(10,12)                                              00460   
****************************************                                00461   
*  VARIABLE = AFLOUT       N005                                         00462   
****************************************                                00463   
AFLOUT6 DFHMDF ATTRB=(ASKIP),                                          X00464   
               JUSTIFY=(LEFT,BLANK),                                   X00465   
               COLOR=BLUE,                                             X00466   
               PICOUT='ZZZZZ',                                         X00467   
               LENGTH=5,                                               X00468   
               POS=(10,25)                                              00469**2
****************************************                                00470   
*  VARIABLE = ACRECT       N005                                         00471   
****************************************                                00472   
ACRECT6 DFHMDF ATTRB=(ASKIP),                                          X00473   
               JUSTIFY=(LEFT,BLANK),                                   X00474   
               COLOR=BLUE,                                             X00475   
               PICOUT='ZZZZZ',                                         X00476   
               LENGTH=5,                                               X00477   
               POS=(10,38)                                              00478**2
****************************************                                00479   
*  VARIABLE = ASTATS       X008                                         00480   
****************************************                                00481   
ASTATS6 DFHMDF ATTRB=(ASKIP),                                          X00482   
               COLOR=BLUE,                                             X00483   
               LENGTH=8,                                               X00484   
               POS=(10,45)                                              00485**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00486   
*                                                                       00487   
*  SCREEN LINE 12                                                       00488   
*                                                                       00489   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00490   
****************************************                                00491   
*  VARIABLE = ASEL01      X001                                          00492   
****************************************                                00493   
ASEL07   DFHMDF ATTRB=(UNPROT,IC),                                     X00494   
               COLOR=GREEN,                                            X00495   
               HILIGHT=UNDERLINE,                                      X00496   
               LENGTH=1,                                               X00497   
               POS=(11,3)                                               00498**2
         DFHMDF ATTRB=(ASKIP),                                         X00499   
               POS=(11,5),                                             X00500**2
               INITIAL=' ',                                            X00501   
               LENGTH=1                                                 00502   
****************************************                                00503   
*  VARIABLE = AACT01      X003                                          00504   
****************************************                                00505   
AACT07   DFHMDF ATTRB=(ASKIP),                                         X00506   
               COLOR=BLUE,                                             X00507   
               LENGTH=3,                                               X00508   
               POS=(11,7)                                               00509**2
****************************************                                00510   
*  VARIABLE = AREA-NUMBER      N007                                     00511   
****************************************                                00512   
AAREA07  DFHMDF ATTRB=(ASKIP),                                         X00513   
               JUSTIFY=(LEFT,BLANK),                                   X00514   
               COLOR=BLUE,                                             X00515   
               PICOUT='ZZZZZZZ',                                       X00516   
               LENGTH=7,                                               X00517   
               POS=(11,12)                                              00518   
****************************************                                00519   
*  VARIABLE = AFLOUT       N005                                         00520   
****************************************                                00521   
AFLOUT7 DFHMDF ATTRB=(ASKIP),                                          X00522   
               JUSTIFY=(LEFT,BLANK),                                   X00523   
               COLOR=BLUE,                                             X00524   
               PICOUT='ZZZZZ',                                         X00525   
               LENGTH=5,                                               X00526   
               POS=(11,25)                                              00527**2
****************************************                                00528   
*  VARIABLE = ACRECT       N005                                         00529   
****************************************                                00530   
ACRECT7 DFHMDF ATTRB=(ASKIP),                                          X00531   
               JUSTIFY=(LEFT,BLANK),                                   X00532   
               COLOR=BLUE,                                             X00533   
               PICOUT='ZZZZZ',                                         X00534   
               LENGTH=5,                                               X00535   
               POS=(11,38)                                              00536**2
****************************************                                00537   
*  VARIABLE = ASTATS       X008                                         00538   
****************************************                                00539   
ASTATS7 DFHMDF ATTRB=(ASKIP),                                          X00540   
               COLOR=BLUE,                                             X00541   
               LENGTH=8,                                               X00542   
               POS=(11,45)                                              00543**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00544   
*                                                                       00545   
*  SCREEN LINE 13                                                       00546   
*                                                                       00547   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00548   
****************************************                                00549   
*  VARIABLE = ASEL01      X001                                          00550   
****************************************                                00551   
ASEL08   DFHMDF ATTRB=(UNPROT,IC),                                     X00552   
               COLOR=GREEN,                                            X00553   
               HILIGHT=UNDERLINE,                                      X00554   
               LENGTH=1,                                               X00555   
               POS=(12,3)                                               00556**2
         DFHMDF ATTRB=(ASKIP),                                         X00557   
               POS=(12,5),                                             X00558**2
               INITIAL=' ',                                            X00559   
               LENGTH=1                                                 00560   
****************************************                                00561   
*  VARIABLE = AACT01      X003                                          00562   
****************************************                                00563   
AACT08   DFHMDF ATTRB=(ASKIP),                                         X00564   
               COLOR=BLUE,                                             X00565   
               LENGTH=3,                                               X00566   
               POS=(12,7)                                               00567**2
****************************************                                00568   
*  VARIABLE = AREA-NUMBER      N007                                     00569   
****************************************                                00570   
AAREA08  DFHMDF ATTRB=(ASKIP),                                         X00571   
               JUSTIFY=(LEFT,BLANK),                                   X00572   
               COLOR=BLUE,                                             X00573   
               PICOUT='ZZZZZZZ',                                       X00574   
               LENGTH=7,                                               X00575   
               POS=(12,12)                                              00576   
****************************************                                00577   
*  VARIABLE = AFLOUT       N005                                         00578   
****************************************                                00579   
AFLOUT8 DFHMDF ATTRB=(ASKIP),                                          X00580   
               JUSTIFY=(LEFT,BLANK),                                   X00581   
               COLOR=BLUE,                                             X00582   
               PICOUT='ZZZZZ',                                         X00583   
               LENGTH=5,                                               X00584   
               POS=(12,25)                                              00585**2
****************************************                                00586   
*  VARIABLE = ACRECT       N005                                         00587   
****************************************                                00588   
ACRECT8 DFHMDF ATTRB=(ASKIP),                                          X00589   
               JUSTIFY=(LEFT,BLANK),                                   X00590   
               COLOR=BLUE,                                             X00591   
               PICOUT='ZZZZZ',                                         X00592   
               LENGTH=5,                                               X00593   
               POS=(12,38)                                              00594**2
****************************************                                00595   
*  VARIABLE = ASTATS       X008                                         00596   
****************************************                                00597   
ASTATS8 DFHMDF ATTRB=(ASKIP),                                          X00598   
               COLOR=BLUE,                                             X00599   
               LENGTH=8,                                               X00600   
               POS=(12,45)                                              00601**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00602   
*                                                                       00603   
*  SCREEN LINE 14                                                       00604   
*                                                                       00605   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00606   
****************************************                                00607   
*  VARIABLE = ASEL01      X001                                          00608   
****************************************                                00609   
ASEL09   DFHMDF ATTRB=(UNPROT,IC),                                     X00610   
               COLOR=GREEN,                                            X00611   
               HILIGHT=UNDERLINE,                                      X00612   
               LENGTH=1,                                               X00613   
               POS=(13,3)                                               00614**2
         DFHMDF ATTRB=(ASKIP),                                         X00615   
               POS=(13,5),                                             X00616**2
               INITIAL=' ',                                            X00617   
               LENGTH=1                                                 00618   
****************************************                                00619   
*  VARIABLE = AACT01      X003                                          00620   
****************************************                                00621   
AACT09   DFHMDF ATTRB=(ASKIP),                                         X00622   
               COLOR=BLUE,                                             X00623   
               LENGTH=3,                                               X00624   
               POS=(13,7)                                               00625**2
****************************************                                00626   
*  VARIABLE = AREA-NUMBER      N007                                     00627   
****************************************                                00628   
AAREA09  DFHMDF ATTRB=(ASKIP),                                         X00629   
               JUSTIFY=(LEFT,BLANK),                                   X00630   
               COLOR=BLUE,                                             X00631   
               PICOUT='ZZZZZZZ',                                       X00632   
               LENGTH=7,                                               X00633   
               POS=(13,12)                                              00634   
****************************************                                00635   
*  VARIABLE = AFLOUT       N005                                         00636   
****************************************                                00637   
AFLOUT9 DFHMDF ATTRB=(ASKIP),                                          X00638   
               JUSTIFY=(LEFT,BLANK),                                   X00639   
               COLOR=BLUE,                                             X00640   
               PICOUT='ZZZZZ',                                         X00641   
               LENGTH=5,                                               X00642   
               POS=(13,25)                                              00643**2
****************************************                                00644   
*  VARIABLE = ACRECT       N005                                         00645   
****************************************                                00646   
ACRECT9 DFHMDF ATTRB=(ASKIP),                                          X00647   
               JUSTIFY=(LEFT,BLANK),                                   X00648   
               COLOR=BLUE,                                             X00649   
               PICOUT='ZZZZZ',                                         X00650   
               LENGTH=5,                                               X00651   
               POS=(13,38)                                              00652**2
****************************************                                00653   
*  VARIABLE = ASTATS       X008                                         00654   
****************************************                                00655   
ASTATS9 DFHMDF ATTRB=(ASKIP),                                          X00656   
               COLOR=BLUE,                                             X00657   
               LENGTH=8,                                               X00658   
               POS=(13,45)                                              00659**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00660   
*                                                                       00661   
*  SCREEN LINE 15                                                       00662   
*                                                                       00663   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00664   
****************************************                                00665   
*  VARIABLE = ASEL01      X001                                          00666   
****************************************                                00667   
ASEL10   DFHMDF ATTRB=(UNPROT,IC),                                     X00668   
               COLOR=GREEN,                                            X00669   
               HILIGHT=UNDERLINE,                                      X00670   
               LENGTH=1,                                               X00671   
               POS=(14,3)                                               00672**2
         DFHMDF ATTRB=(ASKIP),                                         X00673   
               POS=(14,5),                                             X00674**2
               INITIAL=' ',                                            X00675   
               LENGTH=1                                                 00676   
****************************************                                00677   
*  VARIABLE = AACT01      X003                                          00678   
****************************************                                00679   
AACT10   DFHMDF ATTRB=(ASKIP),                                         X00680   
               COLOR=BLUE,                                             X00681   
               LENGTH=3,                                               X00682   
               POS=(14,7)                                               00683**2
****************************************                                00684   
*  VARIABLE = AREA-NUMBER      N007                                     00685   
****************************************                                00686   
AAREA10  DFHMDF ATTRB=(ASKIP),                                         X00687   
               JUSTIFY=(LEFT,BLANK),                                   X00688   
               COLOR=BLUE,                                             X00689   
               PICOUT='ZZZZZZZ',                                       X00690   
               LENGTH=7,                                               X00691   
               POS=(14,12)                                              00692   
****************************************                                00693   
*  VARIABLE = AFLOUT       N005                                         00694   
****************************************                                00695   
AFLOUTA DFHMDF ATTRB=(ASKIP),                                          X00696   
               JUSTIFY=(LEFT,BLANK),                                   X00697   
               COLOR=BLUE,                                             X00698   
               PICOUT='ZZZZZ',                                         X00699   
               LENGTH=5,                                               X00700   
               POS=(14,25)                                              00701**2
****************************************                                00702   
*  VARIABLE = ACRECT       N005                                         00703   
****************************************                                00704   
ACRECTA DFHMDF ATTRB=(ASKIP),                                          X00705   
               JUSTIFY=(LEFT,BLANK),                                   X00706   
               COLOR=BLUE,                                             X00707   
               PICOUT='ZZZZZ',                                         X00708   
               LENGTH=5,                                               X00709   
               POS=(14,38)                                              00710**2
****************************************                                00711   
*  VARIABLE = ASTATS       X008                                         00712   
****************************************                                00713   
ASTATSA DFHMDF ATTRB=(ASKIP),                                          X00714   
               COLOR=BLUE,                                             X00715   
               LENGTH=8,                                               X00716   
               POS=(14,45)                                              00717**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00718   
*                                                                       00719   
*  SCREEN LINE 16                                                       00720   
*                                                                       00721   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00722   
****************************************                                00723   
*  VARIABLE = ASEL01      X001                                          00724   
****************************************                                00725   
ASEL11   DFHMDF ATTRB=(UNPROT,IC),                                     X00726   
               COLOR=GREEN,                                            X00727   
               HILIGHT=UNDERLINE,                                      X00728   
               LENGTH=1,                                               X00729   
               POS=(15,3)                                               00730**2
         DFHMDF ATTRB=(ASKIP),                                         X00731   
               POS=(15,5),                                             X00732**2
               INITIAL=' ',                                            X00733   
               LENGTH=1                                                 00734   
****************************************                                00735   
*  VARIABLE = AACT01      X003                                          00736   
****************************************                                00737   
AACT11   DFHMDF ATTRB=(ASKIP),                                         X00738   
               COLOR=BLUE,                                             X00739   
               LENGTH=3,                                               X00740   
               POS=(15,7)                                               00741**2
****************************************                                00742   
*  VARIABLE = AREA-NUMBER      N007                                     00743   
****************************************                                00744   
AAREA11  DFHMDF ATTRB=(ASKIP),                                         X00745   
               JUSTIFY=(LEFT,BLANK),                                   X00746   
               COLOR=BLUE,                                             X00747   
               PICOUT='ZZZZZZZ',                                       X00748   
               LENGTH=7,                                               X00749   
               POS=(15,12)                                              00750   
****************************************                                00751   
*  VARIABLE = AFLOUT       N005                                         00752   
****************************************                                00753   
AFLOUTB DFHMDF ATTRB=(ASKIP),                                          X00754   
               JUSTIFY=(LEFT,BLANK),                                   X00755   
               COLOR=BLUE,                                             X00756   
               PICOUT='ZZZZZ',                                         X00757   
               LENGTH=5,                                               X00758   
               POS=(15,25)                                              00759**2
****************************************                                00760   
*  VARIABLE = ACRECT       N005                                         00761   
****************************************                                00762   
ACRECTB DFHMDF ATTRB=(ASKIP),                                          X00763   
               JUSTIFY=(LEFT,BLANK),                                   X00764   
               COLOR=BLUE,                                             X00765   
               PICOUT='ZZZZZ',                                         X00766   
               LENGTH=5,                                               X00767   
               POS=(15,38)                                              00768**2
****************************************                                00769   
*  VARIABLE = ASTATS       X008                                         00770   
****************************************                                00771   
ASTATSB DFHMDF ATTRB=(ASKIP),                                          X00772   
               COLOR=BLUE,                                             X00773   
               LENGTH=8,                                               X00774   
               POS=(15,45)                                              00775**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00776   
*                                                                       00777   
*  SCREEN LINE 17                                                       00778   
*                                                                       00779   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00780   
****************************************                                00781   
*  VARIABLE = ASEL01      X001                                          00782   
****************************************                                00783   
ASEL12   DFHMDF ATTRB=(UNPROT,IC),                                     X00784   
               COLOR=GREEN,                                            X00785   
               HILIGHT=UNDERLINE,                                      X00786   
               LENGTH=1,                                               X00787   
               POS=(16,3)                                               00788**2
         DFHMDF ATTRB=(ASKIP),                                         X00789   
               POS=(16,5),                                             X00790**2
               INITIAL=' ',                                            X00791   
               LENGTH=1                                                 00792   
****************************************                                00793   
*  VARIABLE = AACT01      X003                                          00794   
****************************************                                00795   
AACT12   DFHMDF ATTRB=(ASKIP),                                         X00796   
               COLOR=BLUE,                                             X00797   
               LENGTH=3,                                               X00798   
               POS=(16,7)                                               00799**2
****************************************                                00800   
*  VARIABLE = AREA-NUMBER      N007                                     00801   
****************************************                                00802   
AAREA12  DFHMDF ATTRB=(ASKIP),                                         X00803   
               JUSTIFY=(LEFT,BLANK),                                   X00804   
               COLOR=BLUE,                                             X00805   
               PICOUT='ZZZZZZZ',                                       X00806   
               LENGTH=7,                                               X00807   
               POS=(16,12)                                              00808   
****************************************                                00809   
*  VARIABLE = AFLOUT       N005                                         00810   
****************************************                                00811   
AFLOUTC DFHMDF ATTRB=(ASKIP),                                          X00812   
               JUSTIFY=(LEFT,BLANK),                                   X00813   
               COLOR=BLUE,                                             X00814   
               PICOUT='ZZZZZ',                                         X00815   
               LENGTH=5,                                               X00816   
               POS=(16,25)                                              00817**2
****************************************                                00818   
*  VARIABLE = ACRECT       N005                                         00819   
****************************************                                00820   
ACRECTC DFHMDF ATTRB=(ASKIP),                                          X00821   
               JUSTIFY=(LEFT,BLANK),                                   X00822   
               COLOR=BLUE,                                             X00823   
               PICOUT='ZZZZZ',                                         X00824   
               LENGTH=5,                                               X00825   
               POS=(16,38)                                              00826**2
****************************************                                00827   
*  VARIABLE = ASTATS       X008                                         00828   
****************************************                                00829   
ASTATSC DFHMDF ATTRB=(ASKIP),                                          X00830   
               COLOR=BLUE,                                             X00831   
               LENGTH=8,                                               X00832   
               POS=(16,45)                                              00833**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00834   
*                                                                       00835   
*  SCREEN LINE 18                                                       00836   
*                                                                       00837   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00838   
****************************************                                00839   
*  VARIABLE = ASEL01      X001                                          00840   
****************************************                                00841   
ASEL13   DFHMDF ATTRB=(UNPROT,IC),                                     X00842   
               COLOR=GREEN,                                            X00843   
               HILIGHT=UNDERLINE,                                      X00844   
               LENGTH=1,                                               X00845   
               POS=(17,3)                                               00846**2
         DFHMDF ATTRB=(ASKIP),                                         X00847   
               POS=(17,5),                                             X00848**2
               INITIAL=' ',                                            X00849   
               LENGTH=1                                                 00850   
****************************************                                00851   
*  VARIABLE = AACT01      X003                                          00852   
****************************************                                00853   
AACT13   DFHMDF ATTRB=(ASKIP),                                         X00854   
               COLOR=BLUE,                                             X00855   
               LENGTH=3,                                               X00856   
               POS=(17,7)                                               00857**2
****************************************                                00858   
*  VARIABLE = AREA-NUMBER      N007                                     00859   
****************************************                                00860   
AAREA13  DFHMDF ATTRB=(ASKIP),                                         X00861   
               JUSTIFY=(LEFT,BLANK),                                   X00862   
               COLOR=BLUE,                                             X00863   
               PICOUT='ZZZZZZZ',                                       X00864   
               LENGTH=7,                                               X00865   
               POS=(17,12)                                              00866   
****************************************                                00867   
*  VARIABLE = AFLOUT       N005                                         00868   
****************************************                                00869   
AFLOUTD DFHMDF ATTRB=(ASKIP),                                          X00870   
               JUSTIFY=(LEFT,BLANK),                                   X00871   
               COLOR=BLUE,                                             X00872   
               PICOUT='ZZZZZ',                                         X00873   
               LENGTH=5,                                               X00874   
               POS=(17,25)                                              00875**2
****************************************                                00876   
*  VARIABLE = ACRECT       N005                                         00877   
****************************************                                00878   
ACRECTD DFHMDF ATTRB=(ASKIP),                                          X00879   
               JUSTIFY=(LEFT,BLANK),                                   X00880   
               COLOR=BLUE,                                             X00881   
               PICOUT='ZZZZZ',                                         X00882   
               LENGTH=5,                                               X00883   
               POS=(17,38)                                              00884**2
****************************************                                00885   
*  VARIABLE = ASTATS       X008                                         00886   
****************************************                                00887   
ASTATSD DFHMDF ATTRB=(ASKIP),                                          X00888   
               COLOR=BLUE,                                             X00889   
               LENGTH=8,                                               X00890   
               POS=(17,45)                                              00891**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00892   
*                                                                       00893   
*  SCREEN LINE 19                                                       00894   
*                                                                       00895   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00896   
****************************************                                00897   
*  VARIABLE = ASEL01      X001                                          00898   
****************************************                                00899   
ASEL14   DFHMDF ATTRB=(UNPROT,IC),                                     X00900   
               COLOR=GREEN,                                            X00901   
               HILIGHT=UNDERLINE,                                      X00902   
               LENGTH=1,                                               X00903   
               POS=(18,3)                                               00904**2
         DFHMDF ATTRB=(ASKIP),                                         X00905   
               POS=(18,5),                                             X00906**2
               INITIAL=' ',                                            X00907   
               LENGTH=1                                                 00908   
****************************************                                00909   
*  VARIABLE = AACT01      X003                                          00910   
****************************************                                00911   
AACT14   DFHMDF ATTRB=(ASKIP),                                         X00912   
               COLOR=BLUE,                                             X00913   
               LENGTH=3,                                               X00914   
               POS=(18,7)                                               00915**2
****************************************                                00916   
*  VARIABLE = AREA-NUMBER      N007                                     00917   
****************************************                                00918   
AAREA14  DFHMDF ATTRB=(ASKIP),                                         X00919   
               JUSTIFY=(LEFT,BLANK),                                   X00920   
               COLOR=BLUE,                                             X00921   
               PICOUT='ZZZZZZZ',                                       X00922   
               LENGTH=7,                                               X00923   
               POS=(18,12)                                              00924   
****************************************                                00925   
*  VARIABLE = AFLOUT       N005                                         00926   
****************************************                                00927   
AFLOUTE DFHMDF ATTRB=(ASKIP),                                          X00928   
               JUSTIFY=(LEFT,BLANK),                                   X00929   
               COLOR=BLUE,                                             X00930   
               PICOUT='ZZZZZ',                                         X00931   
               LENGTH=5,                                               X00932   
               POS=(18,25)                                              00933**2
****************************************                                00934   
*  VARIABLE = ACRECT       N005                                         00935   
****************************************                                00936   
ACRECTE DFHMDF ATTRB=(ASKIP),                                          X00937   
               JUSTIFY=(LEFT,BLANK),                                   X00938   
               COLOR=BLUE,                                             X00939   
               PICOUT='ZZZZZ',                                         X00940   
               LENGTH=5,                                               X00941   
               POS=(18,38)                                              00942**2
****************************************                                00943   
*  VARIABLE = ASTATS       X008                                         00944   
****************************************                                00945   
ASTATSE DFHMDF ATTRB=(ASKIP),                                          X00946   
               COLOR=BLUE,                                             X00947   
               LENGTH=8,                                               X00948   
               POS=(18,45)                                              00949**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00950   
*                                                                       00951   
*  SCREEN LINE 20                                                       00952   
*                                                                       00953   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00954   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00955   
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00956**3
               COLOR=NEUTRAL,                                          X00957   
               LENGTH=25,                                              X00958**3
               POS=(19,39)                                              00959   
****************************************                                00960   
*  VARIABLE = ASELIT      N007                                          00961   
****************************************                                00962   
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00963   
               JUSTIFY=(LEFT,BLANK),                                   X00964   
               COLOR=BLUE,                                             X00965   
               PICOUT='ZZZZZZZ',                                       X00966   
               LENGTH=7,                                               X00967   
               POS=(19,66)                                              00968   
         DFHMSD TYPE=FINAL                                              00969   
         END                                                            00970   
