  PRINT  NOGEN                                                          00002   
************************************************************            00003   
*                                                                       00004   
*  AACYY - INKM046                                                      00005   
*                                                                       00006   
*     CREATED            : 03/24/00 AT 03:52:11 PM                      00007   
*     AUTHOR             : PAUL KEBER                                   00010   
*     APPLICATION        : PHYSICAL INVENTORY                           00012   
*     MAP DETAILS                                                       00014   
*     LAST UPDATED                                                              
*                                                                       00016   
*  WR26600  07/  /2004  PHYSICAL INVENTORY STORE EXPANSION              00016   
*    M JOHNSON                                                          00016   
*                                                                       00016   
*-----------------------------------------------------------            00016   
*                                                                       00017   
*  BMS MAPSET :  INKM046                                                00018   
*      MAP    :  IN046A                                                 00019   
************************************************************            00020   
INKM046  DFHMSD TYPE=&SYSPARM,                                         X00021   
               LANG=COBOL,                                             X00022   
               CTRL=(FREEKB),                                          X00023   
               MODE=INOUT,                                             X00024   
               TERM=3270-2,                                            X00025   
               TIOAPFX=YES,                                            X00026   
               STORAGE=AUTO                                             00027   
IN046A   DFHMDI LINE=2,COLUMN=1,                                       X00028   
               SIZE=(19,80),                                           X00029   
               MAPATTS=(COLOR,HILIGHT),                                X00030   
               DSATTS=(COLOR,HILIGHT)                                   00031   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 02                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00113   
*  VARIABLE = ATITLE       X036                                         00242   
****************************************                                00243   
ATITLE   DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=36,                                              X00246   
               POS=(01,22)                                              00247   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 03                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00077   
               INITIAL='ITEMS',                                        X00078   
               COLOR=NEUTRAL,                                          X00079   
               LENGTH=5,                                               X00080   
               POS=(02,51)                                              00081   
****************************************                                00082   
*  VARIABLE = ASTRTIT      N005                                         00083   
****************************************                                00084   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00085   
               JUSTIFY=(LEFT,BLANK),                                   X00086   
               COLOR=GREEN,                                            X00087   
               HILIGHT=UNDERLINE,                                      X00088   
               PICOUT='ZZZZ9',                                         X00089   
               LENGTH=5,                                               X00090   
               POS=(02,57)                                              00091   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00092   
               INITIAL='TO',                                           X00093   
               COLOR=NEUTRAL,                                          X00094   
               LENGTH=2,                                               X00095   
               POS=(02,63)                                              00096   
****************************************                                00097   
*  VARIABLE = AENDIT      N005                                          00098   
****************************************                                00099   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00100   
               JUSTIFY=(LEFT,BLANK),                                   X00101   
               COLOR=BLUE,                                             X00102   
               PICOUT='ZZZZ9',                                         X00103   
               LENGTH=5,                                               X00104   
               POS=(02,66)                                              00105   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00106   
               INITIAL='OF',                                           X00107   
               COLOR=NEUTRAL,                                          X00108   
               LENGTH=2,                                               X00109   
               POS=(02,72)                                              00110   
****************************************                                00111   
*  VARIABLE = ATOTIT      N005                                          00112   
****************************************                                00113   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00114   
               JUSTIFY=(LEFT,BLANK),                                   X00115   
               COLOR=BLUE,                                             X00116   
               PICOUT='ZZZZ9',                                         X00117   
               LENGTH=5,                                               X00118   
               POS=(02,75)                                              00119   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 04                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00037   
               INITIAL='ACTL',                                         X00038   
               COLOR=NEUTRAL,                                          X00039   
               LENGTH=4,                                               X00040   
               POS=(03,35)                                              00041   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 05                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00037   
               INITIAL='LOC',                                          X00038   
               COLOR=NEUTRAL,                                          X00039   
               LENGTH=3,                                               X00040   
               POS=(04,19)                                              00041   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00045   
               INITIAL='INV',                                          X00038   
               COLOR=NEUTRAL,                                          X00046   
               LENGTH=3,                                               X00047   
               POS=(04,27)                                              00048   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00045   
               INITIAL='RECD',                                         X00038   
               COLOR=NEUTRAL,                                          X00046   
               LENGTH=4,                                               X00047   
               POS=(04,35)                                              00048   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00045   
               INITIAL='ON-LINE',                                      X00038   
               COLOR=NEUTRAL,                                          X00046   
               LENGTH=7,                                               X00047   
               POS=(04,46)                                              00048   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00045   
               INITIAL='SALES',                                        X00038   
               COLOR=NEUTRAL,                                          X00046   
               LENGTH=5,                                               X00047   
               POS=(04,57)                                              00048   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00045   
               INITIAL='UNIT',                                         X00038   
               COLOR=NEUTRAL,                                          X00046   
               LENGTH=4,                                               X00047   
               POS=(04,68)                                              00048   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 06                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00045   
               INITIAL='STORE',                                        X00038   
               COLOR=NEUTRAL,                                          X00046   
               LENGTH=5,                                               X00047   
               POS=(05,01)                                              00048   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00037   
               INITIAL='TYPE',                                         X00038   
               COLOR=NEUTRAL,                                          X00039   
               LENGTH=4,                                               X00040   
               POS=(05,19)                                              00041   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00045   
               INITIAL='DATE',                                         X00038   
               COLOR=NEUTRAL,                                          X00046   
               LENGTH=4,                                               X00047   
               POS=(05,27)                                              00048   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00045   
               INITIAL='DATE',                                         X00038   
               COLOR=NEUTRAL,                                          X00046   
               LENGTH=4,                                               X00047   
               POS=(05,35)                                              00048   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00045   
               INITIAL='SHEET',                                        X00038   
               COLOR=NEUTRAL,                                          X00046   
               LENGTH=5,                                               X00047   
               POS=(05,46)                                              00048   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00045   
               INITIAL='ADJ',                                          X00038   
               COLOR=NEUTRAL,                                          X00046   
               LENGTH=3,                                               X00047   
               POS=(05,57)                                              00048   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00045   
               INITIAL='BKING',                                        X00038   
               COLOR=NEUTRAL,                                          X00046   
               LENGTH=5,                                               X00047   
               POS=(05,68)                                              00048   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 07                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00192   
*  VARIABLE = ASTORE01     X004                                         00233   
****************************************                                00234   
ASTORE01 DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00239   
               POS=(06,1)                                               00240   
****************************************                                00241   
*  VARIABLE = ANAME01      X010                                         00242   
****************************************                                00243   
ANAME01  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=10,                                              X00246   
               POS=(06,6)                                               00247   
****************************************                                00248   
*  VARIABLE = ALOCT01      X006                                         00249   
****************************************                                00250   
ALOCT01  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(06,19)                                              00254   
****************************************                                00248   
*  VARIABLE = AIDTE01      X005                                         00249   
****************************************                                00250   
AIDTE01  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(06,27)                                              00254   
****************************************                                00248   
*  VARIABLE = ARDTE01      X008                                         00249   
****************************************                                00250   
ARDTE01  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=8,                                               X00253   
               POS=(06,35)                                              00254   
****************************************                                00248   
*  VARIABLE = AOLSH01      X009                                         00249   
****************************************                                00250   
AOLSH01  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(06,46)                                              00254   
****************************************                                00248   
*  VARIABLE = ASADJ01      X009                                         00249   
****************************************                                00250   
ASADJ01  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(06,57)                                              00254   
****************************************                                00248   
*  VARIABLE = AUNTB01      X012                                         00249   
****************************************                                00250   
AUNTB01  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=12,                                              X00253   
               POS=(06,68)                                              00254   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 08                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00232   
*  VARIABLE = ASTORE02     X003                                         00233   
****************************************                                00234   
ASTORE02 DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00239   
               POS=(07,1)                                               00240   
****************************************                                00241   
*  VARIABLE = ANAME02      X015                                         00242   
****************************************                                00243   
ANAME02  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=10,                                              X00246   
               POS=(07,6)                                               00247   
****************************************                                00248   
*  VARIABLE = ALOCT02      X006                                         00249   
****************************************                                00250   
ALOCT02  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(07,19)                                              00254   
****************************************                                00248   
*  VARIABLE = AIDTE02      X005                                         00249   
****************************************                                00250   
AIDTE02  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(07,27)                                              00254   
****************************************                                00248   
*  VARIABLE = ARDTE02      X008                                         00249   
****************************************                                00250   
ARDTE02  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=8,                                               X00253   
               POS=(07,35)                                              00254   
****************************************                                00248   
*  VARIABLE = AOLSH02      X009                                         00249   
****************************************                                00250   
AOLSH02  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(07,46)                                              00254   
****************************************                                00248   
*  VARIABLE = ASADJ02      X009                                         00249   
****************************************                                00250   
ASADJ02  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(07,57)                                              00254   
****************************************                                00248   
*  VARIABLE = AUNTB02      X012                                         00249   
****************************************                                00250   
AUNTB02  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=12,                                              X00253   
               POS=(07,68)                                              00254   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 09                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00232   
*  VARIABLE = ASTORE03     X003                                         00233   
****************************************                                00234   
ASTORE03 DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00239   
               POS=(08,1)                                               00240   
****************************************                                00241   
*  VARIABLE = ANAME03      X015                                         00242   
****************************************                                00243   
ANAME03  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=10,                                              X00246   
               POS=(08,6)                                               00247   
****************************************                                00248   
*  VARIABLE = ALOCT03      X006                                         00249   
****************************************                                00250   
ALOCT03  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(08,19)                                              00254   
****************************************                                00248   
*  VARIABLE = AIDTE03      X005                                         00249   
****************************************                                00250   
AIDTE03  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(08,27)                                              00254   
****************************************                                00248   
*  VARIABLE = ARDTE03      X008                                         00249   
****************************************                                00250   
ARDTE03  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=8,                                               X00253   
               POS=(08,35)                                              00254   
****************************************                                00248   
*  VARIABLE = AOLSH03      X009                                         00249   
****************************************                                00250   
AOLSH03  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(08,46)                                              00254   
****************************************                                00248   
*  VARIABLE = ASADJ03      X009                                         00249   
****************************************                                00250   
ASADJ03  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(08,57)                                              00254   
****************************************                                00248   
*  VARIABLE = AUNTB03      X012                                         00249   
****************************************                                00250   
AUNTB03  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=12,                                              X00253   
               POS=(08,68)                                              00254   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 10                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00232   
*  VARIABLE = ASTORE04     X003                                         00233   
****************************************                                00234   
ASTORE04 DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00239   
               POS=(09,1)                                               00240   
****************************************                                00241   
*  VARIABLE = ANAME04      X015                                         00242   
****************************************                                00243   
ANAME04  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=10,                                              X00246   
               POS=(09,6)                                               00247   
****************************************                                00248   
*  VARIABLE = ALOCT04      X006                                         00249   
****************************************                                00250   
ALOCT04  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(09,19)                                              00254   
****************************************                                        
*  VARIABLE = AIDTE04      X005                                                 
****************************************                                        
AIDTE04  DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=5,                                               X        
               POS=(09,27)                                                      
****************************************                                00248   
*  VARIABLE = ARDTE04      X008                                         00249   
****************************************                                00250   
ARDTE04  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=8,                                               X00253   
               POS=(09,35)                                              00254   
****************************************                                00248   
*  VARIABLE = AOLSH04      X009                                         00249   
****************************************                                00250   
AOLSH04  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(09,46)                                              00254   
****************************************                                00248   
*  VARIABLE = ASADJ04      X009                                         00249   
****************************************                                00250   
ASADJ04  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(09,57)                                              00254   
****************************************                                00248   
*  VARIABLE = AUNTB04      X012                                         00249   
****************************************                                00250   
AUNTB04  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=12,                                              X00253   
               POS=(09,68)                                              00254   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 11                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00232   
*  VARIABLE = ASTORE05     X003                                         00233   
****************************************                                00234   
ASTORE05 DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00239   
               POS=(10,1)                                               00240   
****************************************                                00241   
*  VARIABLE = ANAME05      X015                                         00242   
****************************************                                00243   
ANAME05  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=10,                                              X00246   
               POS=(10,6)                                               00247   
****************************************                                00248   
*  VARIABLE = ALOCT05      X006                                         00249   
****************************************                                00250   
ALOCT05  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(10,19)                                              00254   
****************************************                                        
*  VARIABLE = AIDTE05      X005                                                 
****************************************                                        
AIDTE05  DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=5,                                               X        
               POS=(10,27)                                                      
****************************************                                00248   
*  VARIABLE = ARDTE05      X008                                         00249   
****************************************                                00250   
ARDTE05  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=8,                                               X00253   
               POS=(10,35)                                              00254   
****************************************                                00248   
*  VARIABLE = AOLSH05      X009                                         00249   
****************************************                                00250   
AOLSH05  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(10,46)                                              00254   
****************************************                                00248   
*  VARIABLE = ASADJ05      X009                                         00249   
****************************************                                00250   
ASADJ05  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(10,57)                                              00254   
****************************************                                00248   
*  VARIABLE = AUNTB05      X012                                         00249   
****************************************                                00250   
AUNTB05  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=12,                                              X00253   
               POS=(10,68)                                              00254   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 12                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00232   
*  VARIABLE = ASTORE06     X003                                         00233   
****************************************                                00234   
ASTORE06 DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00239   
               POS=(11,1)                                               00240   
****************************************                                00241   
*  VARIABLE = ANAME06      X015                                         00242   
****************************************                                00243   
ANAME06  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=10,                                              X00246   
               POS=(11,6)                                               00247   
****************************************                                00248   
*  VARIABLE = ALOCT06      X006                                         00249   
****************************************                                00250   
ALOCT06  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(11,19)                                              00254   
****************************************                                        
*  VARIABLE = AIDTE06      X005                                                 
****************************************                                        
AIDTE06  DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=5,                                               X        
               POS=(11,27)                                                      
****************************************                                00248   
*  VARIABLE = ARDTE06      X008                                         00249   
****************************************                                00250   
ARDTE06  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=8,                                               X00253   
               POS=(11,35)                                              00254   
****************************************                                00248   
*  VARIABLE = AOLSH06      X009                                         00249   
****************************************                                00250   
AOLSH06  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(11,46)                                              00254   
****************************************                                00248   
*  VARIABLE = ASADJ06      X009                                         00249   
****************************************                                00250   
ASADJ06  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(11,57)                                              00254   
****************************************                                00248   
*  VARIABLE = AUNTB06      X012                                         00249   
****************************************                                00250   
AUNTB06  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=12,                                              X00253   
               POS=(11,68)                                              00254   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 13                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00232   
*  VARIABLE = ASTORE07     X003                                         00233   
****************************************                                00234   
ASTORE07 DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00239   
               POS=(12,1)                                               00240   
****************************************                                00241   
*  VARIABLE = ANAME07      X015                                         00242   
****************************************                                00243   
ANAME07  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=10,                                              X00246   
               POS=(12,6)                                               00247   
****************************************                                00248   
*  VARIABLE = ALOCT07      X006                                         00249   
****************************************                                00250   
ALOCT07  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(12,19)                                              00254   
****************************************                                        
*  VARIABLE = AIDTE07      X005                                                 
****************************************                                        
AIDTE07  DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=5,                                               X        
               POS=(12,27)                                                      
****************************************                                00248   
*  VARIABLE = ARDTE07      X008                                         00249   
****************************************                                00250   
ARDTE07  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=8,                                               X00253   
               POS=(12,35)                                              00254   
****************************************                                00248   
*  VARIABLE = AOLSH07      X009                                         00249   
****************************************                                00250   
AOLSH07  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(12,46)                                              00254   
****************************************                                00248   
*  VARIABLE = ASADJ07      X009                                         00249   
****************************************                                00250   
ASADJ07  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(12,57)                                              00254   
****************************************                                00248   
*  VARIABLE = AUNTB07      X012                                         00249   
****************************************                                00250   
AUNTB07  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=12,                                              X00253   
               POS=(12,68)                                              00254   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 14                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00232   
*  VARIABLE = ASTORE08     X003                                         00233   
****************************************                                00234   
ASTORE08 DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00239   
               POS=(13,1)                                               00240   
****************************************                                00241   
*  VARIABLE = ANAME08      X015                                         00242   
****************************************                                00243   
ANAME08  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=10,                                              X00246   
               POS=(13,6)                                               00247   
****************************************                                00248   
*  VARIABLE = ALOCT08      X006                                         00249   
****************************************                                00250   
ALOCT08  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(13,19)                                              00254   
****************************************                                        
*  VARIABLE = AIDTE08      X005                                                 
****************************************                                        
AIDTE08  DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=5,                                               X        
               POS=(13,27)                                                      
****************************************                                00248   
*  VARIABLE = ARDTE08      X008                                         00249   
****************************************                                00250   
ARDTE08  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=8,                                               X00253   
               POS=(13,35)                                              00254   
****************************************                                00248   
*  VARIABLE = AOLSH08      X009                                         00249   
****************************************                                00250   
AOLSH08  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(13,46)                                              00254   
****************************************                                00248   
*  VARIABLE = ASADJ08      X009                                         00249   
****************************************                                00250   
ASADJ08  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(13,57)                                              00254   
****************************************                                00248   
*  VARIABLE = AUNTB08      X012                                         00249   
****************************************                                00250   
AUNTB08  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=12,                                              X00253   
               POS=(13,68)                                              00254   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 15                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00232   
*  VARIABLE = ASTORE09     X003                                         00233   
****************************************                                00234   
ASTORE09 DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00239   
               POS=(14,1)                                               00240   
****************************************                                00241   
*  VARIABLE = ANAME09      X015                                         00242   
****************************************                                00243   
ANAME09  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=10,                                              X00246   
               POS=(14,6)                                               00247   
****************************************                                00248   
*  VARIABLE = ALOCT09      X006                                         00249   
****************************************                                00250   
ALOCT09  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(14,19)                                              00254   
****************************************                                        
*  VARIABLE = AIDTE09      X005                                                 
****************************************                                        
AIDTE09  DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=5,                                               X        
               POS=(14,27)                                                      
****************************************                                00248   
*  VARIABLE = ARDTE09      X008                                         00249   
****************************************                                00250   
ARDTE09  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=8,                                               X00253   
               POS=(14,35)                                              00254   
****************************************                                00248   
*  VARIABLE = AOLSH09      X009                                         00249   
****************************************                                00250   
AOLSH09  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(14,46)                                              00254   
****************************************                                00248   
*  VARIABLE = ASADJ09      X009                                         00249   
****************************************                                00250   
ASADJ09  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(14,57)                                              00254   
****************************************                                00248   
*  VARIABLE = AUNTB09      X012                                         00249   
****************************************                                00250   
AUNTB09  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=12,                                              X00253   
               POS=(14,68)                                              00254   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 16                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00232   
*  VARIABLE = ASTORE10     X003                                         00233   
****************************************                                00234   
ASTORE10 DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00239   
               POS=(15,1)                                               00240   
****************************************                                00241   
*  VARIABLE = ANAME10      X015                                         00242   
****************************************                                00243   
ANAME10  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=10,                                              X00246   
               POS=(15,6)                                               00247   
****************************************                                00248   
*  VARIABLE = ALOCT10      X006                                         00249   
****************************************                                00250   
ALOCT10  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(15,19)                                              00254   
****************************************                                        
*  VARIABLE = AIDTE10      X005                                                 
****************************************                                        
AIDTE10  DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=5,                                               X        
               POS=(15,27)                                                      
****************************************                                00248   
*  VARIABLE = ARDTE10      X008                                         00249   
****************************************                                00250   
ARDTE10  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=8,                                               X00253   
               POS=(15,35)                                              00254   
****************************************                                00248   
*  VARIABLE = AOLSH10      X009                                         00249   
****************************************                                00250   
AOLSH10  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(15,46)                                              00254   
****************************************                                00248   
*  VARIABLE = ASADJ10      X009                                         00249   
****************************************                                00250   
ASADJ10  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(15,57)                                              00254   
****************************************                                00248   
*  VARIABLE = AUNTB10      X012                                         00249   
****************************************                                00250   
AUNTB10  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=12,                                              X00253   
               POS=(15,68)                                              00254   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 17                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00232   
*  VARIABLE = ASTORE11     X003                                         00233   
****************************************                                00234   
ASTORE11 DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00239   
               POS=(16,1)                                               00240   
****************************************                                00241   
*  VARIABLE = ANAME11      X015                                         00242   
****************************************                                00243   
ANAME11  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=10,                                              X00246   
               POS=(16,6)                                               00247   
****************************************                                00248   
*  VARIABLE = ALOCT11      X006                                         00249   
****************************************                                00250   
ALOCT11  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(16,19)                                              00254   
****************************************                                        
*  VARIABLE = AIDTE11      X005                                                 
****************************************                                        
AIDTE11  DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=5,                                               X        
               POS=(16,27)                                                      
****************************************                                00248   
*  VARIABLE = ARDTE11      X008                                         00249   
****************************************                                00250   
ARDTE11  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=8,                                               X00253   
               POS=(16,35)                                              00254   
****************************************                                00248   
*  VARIABLE = AOLSH11      X009                                         00249   
****************************************                                00250   
AOLSH11  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(16,46)                                              00254   
****************************************                                00248   
*  VARIABLE = ASADJ11      X009                                         00249   
****************************************                                00250   
ASADJ11  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(16,57)                                              00254   
****************************************                                00248   
*  VARIABLE = AUNTB11      X012                                         00249   
****************************************                                00250   
AUNTB11  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=12,                                              X00253   
               POS=(16,68)                                              00254   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 18                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00232   
*  VARIABLE = ASTORE12     X003                                         00233   
****************************************                                00234   
ASTORE12 DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00239   
               POS=(17,1)                                               00240   
****************************************                                00241   
*  VARIABLE = ANAME12      X015                                         00242   
****************************************                                00243   
ANAME12  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=10,                                              X00246   
               POS=(17,6)                                               00247   
****************************************                                00248   
*  VARIABLE = ALOCT12      X006                                         00249   
****************************************                                00250   
ALOCT12  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(17,19)                                              00254   
****************************************                                        
*  VARIABLE = AIDTE12      X005                                                 
****************************************                                        
AIDTE12  DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=5,                                               X        
               POS=(17,27)                                                      
****************************************                                00248   
*  VARIABLE = ARDTE12      X008                                         00249   
****************************************                                00250   
ARDTE12  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=8,                                               X00253   
               POS=(17,35)                                              00254   
****************************************                                00248   
*  VARIABLE = AOLSH12      X009                                         00249   
****************************************                                00250   
AOLSH12  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(17,46)                                              00254   
****************************************                                00248   
*  VARIABLE = ASADJ12      X009                                         00249   
****************************************                                00250   
ASADJ12  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(17,57)                                              00254   
****************************************                                00248   
*  VARIABLE = AUNTB12      X012                                         00249   
****************************************                                00250   
AUNTB12  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=12,                                              X00253   
               POS=(17,68)                                              00254   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 19                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00232   
*  VARIABLE = ASTORE13     X003                                         00233   
****************************************                                00234   
ASTORE13 DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00239   
               POS=(18,1)                                               00240   
****************************************                                00241   
*  VARIABLE = ANAME13      X015                                         00242   
****************************************                                00243   
ANAME13  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=10,                                              X00246   
               POS=(18,6)                                               00247   
****************************************                                00248   
*  VARIABLE = ALOCT13      X006                                         00249   
****************************************                                00250   
ALOCT13  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(18,19)                                              00254   
****************************************                                        
*  VARIABLE = AIDTE13      X005                                                 
****************************************                                        
AIDTE13  DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=5,                                               X        
               POS=(18,27)                                                      
****************************************                                00248   
*  VARIABLE = ARDTE13      X008                                         00249   
****************************************                                00250   
ARDTE13  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=8,                                               X00253   
               POS=(18,35)                                              00254   
****************************************                                00248   
*  VARIABLE = AOLSH13      X009                                         00249   
****************************************                                00250   
AOLSH13  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(18,46)                                              00254   
****************************************                                00248   
*  VARIABLE = ASADJ13      X009                                         00249   
****************************************                                00250   
ASADJ13  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(18,57)                                              00254   
****************************************                                00248   
*  VARIABLE = AUNTB13      X012                                         00249   
****************************************                                00250   
AUNTB13  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=12,                                              X00253   
               POS=(18,68)                                              00254   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 20                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00232   
*  VARIABLE = ASTORE14     X003                                         00233   
****************************************                                00234   
ASTORE14 DFHMDF ATTRB=(ASKIP),                                         X00235   
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00239   
               POS=(19,1)                                               00240   
****************************************                                00241   
*  VARIABLE = ANAME14      X015                                         00242   
****************************************                                00243   
ANAME14  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=10,                                              X00246   
               POS=(19,6)                                               00247   
****************************************                                00248   
*  VARIABLE = ALOCT14      X006                                         00249   
****************************************                                00250   
ALOCT14  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=5,                                               X00253   
               POS=(19,19)                                              00254   
****************************************                                        
*  VARIABLE = AIDTE14      X005                                                 
****************************************                                        
AIDTE14  DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=5,                                               X        
               POS=(19,27)                                                      
****************************************                                00248   
*  VARIABLE = ARDTE14      X008                                         00249   
****************************************                                00250   
ARDTE14  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=8,                                               X00253   
               POS=(19,35)                                              00254   
****************************************                                00248   
*  VARIABLE = AOLSH14      X009                                         00249   
****************************************                                00250   
AOLSH14  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(19,46)                                              00254   
****************************************                                00248   
*  VARIABLE = ASADJ14      X009                                         00249   
****************************************                                00250   
ASADJ14  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=9,                                               X00253   
               POS=(19,57)                                              00254   
****************************************                                00248   
*  VARIABLE = AUNTB14      X012                                         00249   
****************************************                                00250   
AUNTB14  DFHMDF ATTRB=(ASKIP),                                         X00251   
               COLOR=BLUE,                                             X00252   
               LENGTH=12,                                              X00253   
               POS=(19,68)                                              00254   
         DFHMSD TYPE=FINAL                                              01328**4
         END                                                            01329**4
