*          DATA SET INKM020    AT LEVEL 001 AS OF 09/28/93                      
  PRINT  NOGEN                                                          00001   
************************************************************            00002   
*                                                                       00003   
*  AACYY - INKM020                                                      00004   
*                                                                       00005   
*     GENERATED          : 07/30/93 AT 09:37:14 AM                      00006   
*     VERSION            : 2.7.01                                       00007   
*     CSD LEVEL          : 2.7.01                                       00008   
*     AUTHOR             : NEWUSER.                                     00009   
*     INSTALLATION       : KNOWLEDGEWARE, INC.                          00010   
*     ENCYCLOPEDIA       : PHYSICAL INVENTORY                           00011   
*     ENCYCLOPEDIA PATH  : C:\ADW_ENC\MLDE00A\                          00012   
*     MAP DETAILS                                                       00013   
*     LAST UPDATED 07/30/1993 AT 08:50:24 BY TKMA132                    00014   
*-----------------------------------------------------------            00015   
*                                                                       00016   
*  BMS MAPSET :  INKM020                                                00017   
*      MAP    :  IN020A                                                 00018   
************************************************************            00019   
INKM020  DFHMSD TYPE=DSECT,                                            X00020   
               CTRL=(FREEKB),                                          X00021   
               TERM=3270-2,                                            X00022   
               LANG=COBOL,                                             X00023   
               MODE=INOUT,                                             X00024   
               TIOAPFX=YES,                                            X00025   
               STORAGE=AUTO                                             00026   
IN020A   DFHMDI LINE=2,                                                X00027   
               COLUMN=1,                                               X00028   
               SIZE=(19,80),                                           X00029   
               MAPATTS=(COLOR,HILIGHT),                                X00030   
               DSATTS=(COLOR,HILIGHT)                                   00031   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 02                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00037   
               POS=(01,1),                                             X00038   
               INITIAL=' ',                                            X00039   
               LENGTH=1                                                 00040   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00041   
*                                                                       00042   
*  SCREEN LINE 03                                                       00043   
*                                                                       00044   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00045   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00046   
               INITIAL='ENTER STORE AND SHEET NUMBER',                 X00047   
               COLOR=NEUTRAL,                                          X00048   
               LENGTH=28,                                              X00049   
               POS=(02,01)                                              00050   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00051   
*                                                                       00052   
*  SCREEN LINE 06                                                       00053   
*                                                                       00054   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00055   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00056   
               INITIAL='STORE',                                        X00057   
               COLOR=NEUTRAL,                                          X00058   
               LENGTH=5,                                               X00059   
               POS=(05,26)                                              00060   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00061   
               INITIAL='NUMBER:',                                      X00062   
               COLOR=NEUTRAL,                                          X00063   
               LENGTH=7,                                               X00064   
               POS=(05,32)                                              00065   
****************************************                                00066   
*  VARIABLE = STORE-NUMBER      X003                                    00067   
****************************************                                00068   
ASTORE   DFHMDF ATTRB=(ASKIP),                                         X00069   
               COLOR=BLUE,                                             X00070   
               LENGTH=4,                                               X00071   
               POS=(05,40)                                              00072   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00073   
               INITIAL=' ',                                            X00074   
               LENGTH=1,                                               X00075   
               POS=(05,45)                                              00076   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00077   
*                                                                       00078   
*  SCREEN LINE 08                                                       00079   
*                                                                       00080   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00081   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00082   
               INITIAL='SHEET',                                        X00083   
               COLOR=NEUTRAL,                                          X00084   
               LENGTH=5,                                               X00085   
               POS=(07,26)                                              00086   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00087   
               INITIAL='NUMBER:',                                      X00088   
               COLOR=NEUTRAL,                                          X00089   
               LENGTH=7,                                               X00090   
               POS=(07,32)                                              00091   
****************************************                                00092   
*  VARIABLE = -SHEET-NUMBER      N007                                   00093   
****************************************                                00094   
ASHEET   DFHMDF ATTRB=(UNPROT,IC),                                     X00095   
               JUSTIFY=(LEFT,BLANK),                                   X00096   
               COLOR=GREEN,                                            X00097   
               HILIGHT=UNDERLINE,                                      X00098   
               LENGTH=6,                                               X00099   
               POS=(07,40)                                              00100   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00101   
               INITIAL=' ',                                            X00102   
               LENGTH=1,                                               X00103   
               POS=(07,47)                                              00104   
         DFHMSD TYPE=FINAL                                              00105   
         END                                                            00106   
