*          DATA SET INKM010    AT LEVEL 004 AS OF 09/09/93                      
  PRINT  NOGEN                                                          00001   
************************************************************            00002   
*                                                                       00003   
*  AACYY - INKM010                                                      00004   
*                                                                       00005   
*     GENERATED          : 08/31/93 AT 12:55:01 PM                      00006   
*     VERSION            : 2.7.01                                       00007   
*     CSD LEVEL          : 2.7.01                                       00008   
*     AUTHOR             : TKMA072.                                     00009   
*     INSTALLATION       : KNOWLEDGEWARE, INC.                          00010   
*     ENCYCLOPEDIA       : PHYSICAL INVENTORY                           00011   
*     ENCYCLOPEDIA PATH  : C:\ADW_ENC\MLDE00A\                          00012   
*     MAP DETAILS                                                       00013   
*     LAST UPDATED 06/21/2002 AT 12:48:49 BY TKMA523                    00014   
*-----------------------------------------------------------            00015   
*                                                                       00016   
* 6/21/2002 - MASS DELETE PROJECT.  ADDED A FIELD FOR 'REASON'          00016   
*                                                                       00016   
*                                                                       00016   
*  BMS MAPSET :  INKM011                                                00017   
*      MAP    :  IN011A                                                 00018   
************************************************************            00019   
INKM010  DFHMSD TYPE=DSECT,                                            X00020   
               LANG=COBOL,                                             X00021   
               CTRL=(FREEKB),                                          X00022   
               MODE=INOUT,                                             X00023   
               TERM=3270-2,                                            X00024   
               TIOAPFX=YES,                                            X00025   
               STORAGE=AUTO                                             00026   
IN010A   DFHMDI LINE=2,COLUMN=1,                                       X00027   
               SIZE=(19,80),                                           X00028   
               MAPATTS=(COLOR,HILIGHT),                                X00029   
               DSATTS=(COLOR,HILIGHT)                                   00030   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00031   
*                                                                       00032   
*  SCREEN LINE 03                                                       00033**2
*                                                                       00034   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00035   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00036   
               INITIAL='PLEASE ENTER STORE AND AREA',                  X00037**2
               COLOR=NEUTRAL,                                          X00038   
               LENGTH=27,                                              X00039**2
               POS=(03,02)                                              00040**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00041**2
*                                                                       00042**2
*  SCREEN LINE 05                                                       00043**2
*                                                                       00044**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00045**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00046**2
               INITIAL='STORE......:',                                 X00047**2
               COLOR=NEUTRAL,                                          X00048**2
               LENGTH=12,                                              X00049**2
               POS=(05,23)                                              00050**2
****************************************                                00051   
*  VARIABLE = STORE-NUMBER      X004                                    00052   
****************************************                                00053   
ASTORE   DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00054**3
               COLOR=GREEN,                                            X00055   
               HILIGHT=UNDERLINE,                                      X00056   
               LENGTH=4,                                               X00057   
               POS=(05,37)                                              00058   
ASTRNAM  DFHMDF ATTRB=(ASKIP),                                         X00059**2
               COLOR=BLUE,                                             X00060**2
               LENGTH=25,                                              X00061**2
               POS=(05,42)                                              00062**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00063   
*                                                                       00064   
*  SCREEN LINE 07                                                       00065   
*                                                                       00066   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00067   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00068   
               INITIAL='AREA',                                         X00069   
               COLOR=NEUTRAL,                                          X00070   
               LENGTH=4,                                               X00071   
               POS=(07,23)                                              00072   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00073   
               INITIAL='NUMBER:',                                      X00074   
               COLOR=NEUTRAL,                                          X00075   
               LENGTH=7,                                               X00076   
               POS=(07,28)                                              00077   
****************************************                                00078   
*  VARIABLE = AREA-NUMBER      N007                                     00079   
****************************************                                00080   
AAREA    DFHMDF ATTRB=(UNPROT,NUM),                                    X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               PICOUT='ZZZZZZ',                                        X00084**4
               LENGTH=6,                                               X00085**3
               POS=(07,37)                                              00086   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00087   
               INITIAL=' ',                                            X00088   
               LENGTH=1,                                               X00089   
               POS=(07,44)                                              00090**3
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00063   
*                                                                       00064   
*  SCREEN LINE 09                                                       00065   
*                                                                       00066   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00067   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00068   
               INITIAL='REASON.....:',                                 X00069   
               COLOR=NEUTRAL,                                          X00070   
               LENGTH=12,                                              X00071   
               POS=(09,23)                                              00072   
****************************************                                00237   
* VARIABLE = MESSAGE-REASON FOR ADJUSTMENT                              00238   
****************************************                                00239   
ADMSG00  DFHMDF ATTRB=(UNPROT),                                        X00240   
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=20,                                              X00242   
               POS=(09,37)                                              00243**2
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(09,58),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
         DFHMSD TYPE=FINAL                                              00091   
         END                                                            00092   
