*                                                                       00003**4
  PRINT  NOGEN                                                          00001**4
************************************************************            00002**4
*                                                                       00003**4
*        - INKCS036                                                     00004**4
*                                                                       00005**4
*     LAST UPDATED 06/13/2006 BY TKMAB17 - WR28545                      00014**4
*-----------------------------------------------------------            00015**4
*                                                                       00016**4
*                                                                       00016**4
* 06/13/2006 - ORIGINAL CREATION  WR28545                               00016**4
*              J. SELWITSCHKA                                           00016**4
*                                                                       00016**4
*                                                                       00016**4
*  BMS MAPSET :  INKM036                                                00017**4
*      MAP    :  IN036A                                                 00018**7
************************************************************            00019**4
INKM036  DFHMSD TYPE=&SYSPARM,                                         X00020**4
               CTRL=(FREEKB),                                          X00021**4
               TERM=3270-2,                                            X00022**4
               LANG=COBOL,                                             X00023**4
               MODE=INOUT,                                             X00024**4
               TIOAPFX=YES,                                            X00025**4
               STORAGE=AUTO                                             00026**4
IN036A   DFHMDI LINE=2,                                                X00027**8
               COLUMN=1,                                               X00028**4
               SIZE=(19,80),                                           X00029**6
               MAPATTS=(COLOR,HILIGHT),                                X00030**4
               DSATTS=(COLOR,HILIGHT)                                   00031**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 01                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00093**4
               POS=(01,1),                                             X00094**4
               INITIAL=' ',                                            X00095**4
               LENGTH=1                                                 00096**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 02                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00041   
               INITIAL='INVENTORY DATE:',                              X00042   
               LENGTH=15,                                              X00043   
               POS=(02,02)                                              00044   
****************************************                                00163   
*  VARIABLE = AINDT01      X010                                         00164   
****************************************                                00165   
AINDT01  DFHMDF ATTRB=(UNPROT,IC),                                     X00262**4
               JUSTIFY=(RIGHT,BLANK),                                  X00263**4
               COLOR=GREEN,                                            X00263**4
               HILIGHT=UNDERLINE,                                      X00263**4
               LENGTH=10,                                              X00264**4
               POS=(02,18)                                              00265**4
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00041   
               LENGTH=01,                                              X00043   
               POS=(02,29)                                              00044   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00088**4
*                                                                       00089**4
*  SCREEN LINE 03                                                       00090**4
*                                                                       00091**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00092**4
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00093**4
               POS=(03,1),                                             X00094**4
               INITIAL=' ',                                            X00095**4
               LENGTH=1                                                 00096**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00144**4
*                                                                       00145**4
*  SCREEN LINE 04                                                       00146**4
*                                                                       00147**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00148**4
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00149**5
               INITIAL='LOC',                                          X00150**5
               COLOR=NEUTRAL,                                          X00151**5
               LENGTH=3,                                               X00152**5
               POS=(04,1)                                               00153**5
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00154**5
               INITIAL='LOC NAME',                                     X00155**5
               COLOR=NEUTRAL,                                          X00156**5
               LENGTH=8,                                               X00157**5
               POS=(04,6)                                               00158**5
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00159**4
               INITIAL='CPLD',                                         X00160**4
               COLOR=NEUTRAL,                                          X00161**4
               LENGTH=4,                                               X00162**4
               POS=(04,18)                                              00163**4
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00168**5
               INITIAL='INVENTORY STATUS',                             X00169**5
               COLOR=NEUTRAL,                                          X00170**5
               LENGTH=16,                                              X00171**5
               POS=(04,25)                                              00172**5
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00222**4
*                                                                       00223**4
*  SCREEN LINE 05                                                       00224**4
*                                                                       00225**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00226**4
****************************************                                00227**4
*  VARIABLE = ALOC01      N004                                          00228**4
****************************************                                00229**4
ALOC01   DFHMDF ATTRB=(PROT,NUM),                                      X00230**4
               JUSTIFY=(RIGHT,ZERO),                                   X        
               COLOR=BLUE,                                             X00231**4
               PICOUT='ZZZ9',                                          X00053**5
               LENGTH=4,                                               X00233**4
               POS=(05,1)                                               00234**4
****************************************                                00239**4
*  VARIABLE = ALNM01      X011                                          00240**4
****************************************                                00241**4
ALNM01   DFHMDF ATTRB=(PROT),                                          X00242**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00231**4
               LENGTH=11,                                              X00243**4
               POS=(05,6)                                               00244**4
****************************************                                00245**4
*  VARIABLE = CPLD TIME         X005                                    00246**4
****************************************                                00247**4
ACPLD01  DFHMDF ATTRB=(PROT),                                          X00248**4
               COLOR=BLUE,                                             X00249**4
               LENGTH=5,                                               X00250**4
               POS=(05,18)                                              00251**4
****************************************                                00245**4
*  VARIABLE = INVENTORY STATUS  X016                                    00246**4
****************************************                                00247**4
ASTAT01  DFHMDF ATTRB=(PROT),                                          X00248**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00249**4
               LENGTH=20,                                              X00250**4
               POS=(05,25)                                              00251**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00222**4
*                                                                       00223**4
*  SCREEN LINE 06                                                       00224**4
*                                                                       00225**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00226**4
****************************************                                00227**4
*  VARIABLE = ALOC02      N004                                          00228**4
****************************************                                00229**4
ALOC02   DFHMDF ATTRB=(PROT,NUM),                                      X00230**4
               JUSTIFY=(RIGHT,ZERO),                                   X        
               COLOR=BLUE,                                             X00231**4
               PICOUT='ZZZ9',                                          X00053**5
               LENGTH=4,                                               X00233**4
               POS=(06,1)                                               00234**4
****************************************                                00239**4
*  VARIABLE = ALNM02      X011                                          00240**4
****************************************                                00241**4
ALNM02   DFHMDF ATTRB=(PROT),                                          X00242**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00231**4
               LENGTH=11,                                              X00243**4
               POS=(06,6)                                               00244**4
****************************************                                00245**4
*  VARIABLE = CPLD TIME         X005                                    00246**4
****************************************                                00247**4
ACPLD02  DFHMDF ATTRB=(PROT),                                          X00248**4
               COLOR=BLUE,                                             X00249**4
               LENGTH=5,                                               X00250**4
               POS=(06,18)                                              00251**4
****************************************                                00245**4
*  VARIABLE = INVENTORY STATUS  X016                                    00246**4
****************************************                                00247**4
ASTAT02  DFHMDF ATTRB=(PROT),                                          X00248**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00249**4
               LENGTH=20,                                              X00250**4
               POS=(06,25)                                              00251**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00222**4
*                                                                       00223**4
*  SCREEN LINE 07                                                       00224**4
*                                                                       00225**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00226**4
****************************************                                00227**4
*  VARIABLE = ALOC03      N004                                          00228**4
****************************************                                00229**4
ALOC03   DFHMDF ATTRB=(PROT,NUM),                                      X00230**4
               JUSTIFY=(RIGHT,ZERO),                                   X        
               COLOR=BLUE,                                             X00231**4
               PICOUT='ZZZ9',                                          X00053**5
               LENGTH=4,                                               X00233**4
               POS=(07,1)                                               00234**4
****************************************                                00239**4
*  VARIABLE = ALNM03      X011                                          00240**4
****************************************                                00241**4
ALNM03   DFHMDF ATTRB=(PROT),                                          X00242**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00231**4
               LENGTH=11,                                              X00243**4
               POS=(07,6)                                               00244**4
****************************************                                00245**4
*  VARIABLE = CPLD TIME         X005                                    00246**4
****************************************                                00247**4
ACPLD03  DFHMDF ATTRB=(PROT),                                          X00248**4
               COLOR=BLUE,                                             X00249**4
               LENGTH=5,                                               X00250**4
               POS=(07,18)                                              00251**4
****************************************                                00245**4
*  VARIABLE = INVENTORY STATUS  X016                                    00246**4
****************************************                                00247**4
ASTAT03  DFHMDF ATTRB=(PROT),                                          X00248**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00249**4
               LENGTH=20,                                              X00250**4
               POS=(07,25)                                              00251**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00222**4
*                                                                       00223**4
*  SCREEN LINE 08                                                       00224**4
*                                                                       00225**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00226**4
****************************************                                00227**4
*  VARIABLE = ALOC04      N004                                          00228**4
****************************************                                00229**4
ALOC04   DFHMDF ATTRB=(PROT,NUM),                                      X00230**4
               JUSTIFY=(RIGHT,ZERO),                                   X        
               COLOR=BLUE,                                             X00231**4
               PICOUT='ZZZ9',                                          X00053**5
               LENGTH=4,                                               X00233**4
               POS=(08,1)                                               00234**4
****************************************                                00239**4
*  VARIABLE = ALNM04      X011                                          00240**4
****************************************                                00241**4
ALNM04   DFHMDF ATTRB=(PROT),                                          X00242**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00231**4
               LENGTH=11,                                              X00243**4
               POS=(08,6)                                               00244**4
****************************************                                00245**4
*  VARIABLE = CPLD TIME         X005                                    00246**4
****************************************                                00247**4
ACPLD04  DFHMDF ATTRB=(PROT),                                          X00248**4
               COLOR=BLUE,                                             X00249**4
               LENGTH=5,                                               X00250**4
               POS=(08,18)                                              00251**4
****************************************                                00245**4
*  VARIABLE = INVENTORY STATUS  X016                                    00246**4
****************************************                                00247**4
ASTAT04  DFHMDF ATTRB=(PROT),                                          X00248**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00249**4
               LENGTH=20,                                              X00250**4
               POS=(08,25)                                              00251**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00222**4
*                                                                       00223**4
*  SCREEN LINE 09                                                       00224**4
*                                                                       00225**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00226**4
****************************************                                00227**4
*  VARIABLE = ALOC05      N004                                          00228**4
****************************************                                00229**4
ALOC05   DFHMDF ATTRB=(PROT,NUM),                                      X00230**4
               JUSTIFY=(RIGHT,ZERO),                                   X        
               COLOR=BLUE,                                             X00231**4
               PICOUT='ZZZ9',                                          X00053**5
               LENGTH=4,                                               X00233**4
               POS=(09,1)                                               00234**4
****************************************                                00239**4
*  VARIABLE = ALNM05      X011                                          00240**4
****************************************                                00241**4
ALNM05   DFHMDF ATTRB=(PROT),                                          X00242**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00231**4
               LENGTH=11,                                              X00243**4
               POS=(09,6)                                               00244**4
****************************************                                00245**4
*  VARIABLE = CPLD TIME         X005                                    00246**4
****************************************                                00247**4
ACPLD05  DFHMDF ATTRB=(PROT),                                          X00248**4
               COLOR=BLUE,                                             X00249**4
               LENGTH=5,                                               X00250**4
               POS=(09,18)                                              00251**4
****************************************                                00245**4
*  VARIABLE = INVENTORY STATUS  X016                                    00246**4
****************************************                                00247**4
ASTAT05  DFHMDF ATTRB=(PROT),                                          X00248**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00249**4
               LENGTH=20,                                              X00250**4
               POS=(09,25)                                              00251**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00222**4
*                                                                       00223**4
*  SCREEN LINE 10                                                       00224**4
*                                                                       00225**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00226**4
****************************************                                00227**4
*  VARIABLE = ALOC06      N004                                          00228**4
****************************************                                00229**4
ALOC06   DFHMDF ATTRB=(PROT,NUM),                                      X00230**4
               JUSTIFY=(RIGHT,ZERO),                                   X        
               COLOR=BLUE,                                             X00231**4
               PICOUT='ZZZ9',                                          X00053**5
               LENGTH=4,                                               X00233**4
               POS=(10,1)                                               00234**4
****************************************                                00239**4
*  VARIABLE = ALNM06      X011                                          00240**4
****************************************                                00241**4
ALNM06   DFHMDF ATTRB=(PROT),                                          X00242**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00231**4
               LENGTH=11,                                              X00243**4
               POS=(10,6)                                               00244**4
****************************************                                00245**4
*  VARIABLE = CPLD TIME         X005                                    00246**4
****************************************                                00247**4
ACPLD06  DFHMDF ATTRB=(PROT),                                          X00248**4
               COLOR=BLUE,                                             X00249**4
               LENGTH=5,                                               X00250**4
               POS=(10,18)                                              00251**4
****************************************                                00245**4
*  VARIABLE = INVENTORY STATUS  X016                                    00246**4
****************************************                                00247**4
ASTAT06  DFHMDF ATTRB=(PROT),                                          X00248**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00249**4
               LENGTH=20,                                              X00250**4
               POS=(10,25)                                              00251**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00222**4
*                                                                       00223**4
*  SCREEN LINE 11                                                       00224**4
*                                                                       00225**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00226**4
****************************************                                00227**4
*  VARIABLE = ALOC07      N004                                          00228**4
****************************************                                00229**4
ALOC07   DFHMDF ATTRB=(PROT,NUM),                                      X00230**4
               JUSTIFY=(RIGHT,ZERO),                                   X        
               COLOR=BLUE,                                             X00231**4
               PICOUT='ZZZ9',                                          X00053**5
               LENGTH=4,                                               X00233**4
               POS=(11,1)                                               00234**4
****************************************                                00239**4
*  VARIABLE = ALNM07      X011                                          00240**4
****************************************                                00241**4
ALNM07   DFHMDF ATTRB=(PROT),                                          X00242**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00231**4
               LENGTH=11,                                              X00243**4
               POS=(11,6)                                               00244**4
****************************************                                00245**4
*  VARIABLE = CPLD TIME         X005                                    00246**4
****************************************                                00247**4
ACPLD07  DFHMDF ATTRB=(PROT),                                          X00248**4
               COLOR=BLUE,                                             X00249**4
               LENGTH=5,                                               X00250**4
               POS=(11,18)                                              00251**4
****************************************                                00245**4
*  VARIABLE = INVENTORY STATUS  X016                                    00246**4
****************************************                                00247**4
ASTAT07  DFHMDF ATTRB=(PROT),                                          X00248**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00249**4
               LENGTH=20,                                              X00250**4
               POS=(11,25)                                              00251**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00222**4
*                                                                       00223**4
*  SCREEN LINE 12                                                       00224**4
*                                                                       00225**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00226**4
****************************************                                00227**4
*  VARIABLE = ALOC08      N004                                          00228**4
****************************************                                00229**4
ALOC08   DFHMDF ATTRB=(PROT,NUM),                                      X00230**4
               JUSTIFY=(RIGHT,ZERO),                                   X        
               COLOR=BLUE,                                             X00231**4
               PICOUT='ZZZ9',                                          X00053**5
               LENGTH=4,                                               X00233**4
               POS=(12,1)                                               00234**4
****************************************                                00239**4
*  VARIABLE = ALNM08      X011                                          00240**4
****************************************                                00241**4
ALNM08   DFHMDF ATTRB=(PROT),                                          X00242**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00231**4
               LENGTH=11,                                              X00243**4
               POS=(12,6)                                               00244**4
****************************************                                00245**4
*  VARIABLE = CPLD TIME         X005                                    00246**4
****************************************                                00247**4
ACPLD08  DFHMDF ATTRB=(PROT),                                          X00248**4
               COLOR=BLUE,                                             X00249**4
               LENGTH=5,                                               X00250**4
               POS=(12,18)                                              00251**4
****************************************                                00245**4
*  VARIABLE = INVENTORY STATUS  X016                                    00246**4
****************************************                                00247**4
ASTAT08  DFHMDF ATTRB=(PROT),                                          X00248**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00249**4
               LENGTH=20,                                              X00250**4
               POS=(12,25)                                              00251**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00222**4
*                                                                       00223**4
*  SCREEN LINE 13                                                       00224**4
*                                                                       00225**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00226**4
****************************************                                00227**4
*  VARIABLE = ALOC09      N004                                          00228**4
****************************************                                00229**4
ALOC09   DFHMDF ATTRB=(PROT,NUM),                                      X00230**4
               JUSTIFY=(RIGHT,ZERO),                                   X        
               COLOR=BLUE,                                             X00231**4
               PICOUT='ZZZ9',                                          X00053**5
               LENGTH=4,                                               X00233**4
               POS=(13,1)                                               00234**4
****************************************                                00239**4
*  VARIABLE = ALNM09      X011                                          00240**4
****************************************                                00241**4
ALNM09   DFHMDF ATTRB=(PROT),                                          X00242**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00231**4
               LENGTH=11,                                              X00243**4
               POS=(13,6)                                               00244**4
****************************************                                00245**4
*  VARIABLE = CPLD TIME         X005                                    00246**4
****************************************                                00247**4
ACPLD09  DFHMDF ATTRB=(PROT),                                          X00248**4
               COLOR=BLUE,                                             X00249**4
               LENGTH=5,                                               X00250**4
               POS=(13,18)                                              00251**4
****************************************                                00245**4
*  VARIABLE = INVENTORY STATUS  X016                                    00246**4
****************************************                                00247**4
ASTAT09  DFHMDF ATTRB=(PROT),                                          X00248**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00249**4
               LENGTH=20,                                              X00250**4
               POS=(13,25)                                              00251**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00222**4
*                                                                       00223**4
*  SCREEN LINE 14                                                       00224**4
*                                                                       00225**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00226**4
****************************************                                00227**4
*  VARIABLE = ALOC10      N004                                          00228**4
****************************************                                00229**4
ALOC10   DFHMDF ATTRB=(PROT,NUM),                                      X00230**4
               JUSTIFY=(RIGHT,ZERO),                                   X        
               COLOR=BLUE,                                             X00231**4
               PICOUT='ZZZ9',                                          X00053**5
               LENGTH=4,                                               X00233**4
               POS=(14,1)                                               00234**4
****************************************                                00239**4
*  VARIABLE = ALNM10      X011                                          00240**4
****************************************                                00241**4
ALNM10   DFHMDF ATTRB=(PROT),                                          X00242**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00231**4
               LENGTH=11,                                              X00243**4
               POS=(14,6)                                               00244**4
****************************************                                00245**4
*  VARIABLE = CPLD TIME         X005                                    00246**4
****************************************                                00247**4
ACPLD10  DFHMDF ATTRB=(PROT),                                          X00248**4
               COLOR=BLUE,                                             X00249**4
               LENGTH=5,                                               X00250**4
               POS=(14,18)                                              00251**4
****************************************                                00245**4
*  VARIABLE = INVENTORY STATUS  X016                                    00246**4
****************************************                                00247**4
ASTAT10  DFHMDF ATTRB=(PROT),                                          X00248**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00249**4
               LENGTH=20,                                              X00250**4
               POS=(14,25)                                              00251**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00222**4
*                                                                       00223**4
*  SCREEN LINE 15                                                       00224**4
*                                                                       00225**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00226**4
****************************************                                00227**4
*  VARIABLE = ALOC11      N004                                          00228**4
****************************************                                00229**4
ALOC11   DFHMDF ATTRB=(PROT,NUM),                                      X00230**4
               JUSTIFY=(RIGHT,ZERO),                                   X        
               COLOR=BLUE,                                             X00231**4
               PICOUT='ZZZ9',                                          X00053**5
               LENGTH=4,                                               X00233**4
               POS=(15,1)                                               00234**4
****************************************                                00239**4
*  VARIABLE = ALNM11      X011                                          00240**4
****************************************                                00241**4
ALNM11   DFHMDF ATTRB=(PROT),                                          X00242**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00231**4
               LENGTH=11,                                              X00243**4
               POS=(15,6)                                               00244**4
****************************************                                00245**4
*  VARIABLE = CPLD TIME         X005                                    00246**4
****************************************                                00247**4
ACPLD11  DFHMDF ATTRB=(PROT),                                          X00248**4
               COLOR=BLUE,                                             X00249**4
               LENGTH=5,                                               X00250**4
               POS=(15,18)                                              00251**4
****************************************                                00245**4
*  VARIABLE = INVENTORY STATUS  X016                                    00246**4
****************************************                                00247**4
ASTAT11  DFHMDF ATTRB=(PROT),                                          X00248**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00249**4
               LENGTH=20,                                              X00250**4
               POS=(15,25)                                              00251**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00222**4
*                                                                       00223**4
*  SCREEN LINE 16                                                       00224**4
*                                                                       00225**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00226**4
****************************************                                00227**4
*  VARIABLE = ALOC12      N004                                          00228**4
****************************************                                00229**4
ALOC12   DFHMDF ATTRB=(PROT,NUM),                                      X00230**4
               JUSTIFY=(RIGHT,ZERO),                                   X        
               COLOR=BLUE,                                             X00231**4
               PICOUT='ZZZ9',                                          X00053**5
               LENGTH=4,                                               X00233**4
               POS=(16,1)                                               00234**4
****************************************                                00239**4
*  VARIABLE = ALNM12      X011                                          00240**4
****************************************                                00241**4
ALNM12   DFHMDF ATTRB=(PROT),                                          X00242**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00231**4
               LENGTH=11,                                              X00243**4
               POS=(16,6)                                               00244**4
****************************************                                00245**4
*  VARIABLE = CPLD TIME         X005                                    00246**4
****************************************                                00247**4
ACPLD12  DFHMDF ATTRB=(PROT),                                          X00248**4
               COLOR=BLUE,                                             X00249**4
               LENGTH=5,                                               X00250**4
               POS=(16,18)                                              00251**4
****************************************                                00245**4
*  VARIABLE = INVENTORY STATUS  X016                                    00246**4
****************************************                                00247**4
ASTAT12  DFHMDF ATTRB=(PROT),                                          X00248**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00249**4
               LENGTH=20,                                              X00250**4
               POS=(16,25)                                              00251**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00222**4
*                                                                       00223**4
*  SCREEN LINE 17                                                       00224**4
*                                                                       00225**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00226**4
****************************************                                00227**4
*  VARIABLE = ALOC13      N004                                          00228**4
****************************************                                00229**4
ALOC13   DFHMDF ATTRB=(PROT,NUM),                                      X00230**4
               JUSTIFY=(RIGHT,ZERO),                                   X        
               COLOR=BLUE,                                             X00231**4
               PICOUT='ZZZ9',                                          X00053**5
               LENGTH=4,                                               X00233**4
               POS=(17,1)                                               00234**4
****************************************                                00239**4
*  VARIABLE = ALNM13      X011                                          00240**4
****************************************                                00241**4
ALNM13   DFHMDF ATTRB=(PROT),                                          X00242**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00231**4
               LENGTH=11,                                              X00243**4
               POS=(17,6)                                               00244**4
****************************************                                00245**4
*  VARIABLE = CPLD TIME         X005                                    00246**4
****************************************                                00247**4
ACPLD13  DFHMDF ATTRB=(PROT),                                          X00248**4
               COLOR=BLUE,                                             X00249**4
               LENGTH=5,                                               X00250**4
               POS=(17,18)                                              00251**4
****************************************                                00245**4
*  VARIABLE = INVENTORY STATUS  X016                                    00246**4
****************************************                                00247**4
ASTAT13  DFHMDF ATTRB=(PROT),                                          X00248**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00249**4
               LENGTH=20,                                              X00250**4
               POS=(17,25)                                              00251**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00222**4
*                                                                       00223**4
*  SCREEN LINE 18                                                       00224**4
*                                                                       00225**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00226**4
****************************************                                00227**4
*  VARIABLE = ALOC14      N004                                          00228**4
****************************************                                00229**4
ALOC14   DFHMDF ATTRB=(PROT,NUM),                                      X00230**4
               JUSTIFY=(RIGHT,ZERO),                                   X        
               COLOR=BLUE,                                             X00231**4
               PICOUT='ZZZ9',                                          X00053**5
               LENGTH=4,                                               X00233**4
               POS=(18,1)                                               00234**4
****************************************                                00239**4
*  VARIABLE = ALNM14      X011                                          00240**4
****************************************                                00241**4
ALNM14   DFHMDF ATTRB=(PROT),                                          X00242**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00231**4
               LENGTH=11,                                              X00243**4
               POS=(18,6)                                               00244**4
****************************************                                00245**4
*  VARIABLE = CPLD TIME         X005                                    00246**4
****************************************                                00247**4
ACPLD14  DFHMDF ATTRB=(PROT),                                          X00248**4
               COLOR=BLUE,                                             X00249**4
               LENGTH=5,                                               X00250**4
               POS=(18,18)                                              00251**4
****************************************                                00245**4
*  VARIABLE = INVENTORY STATUS  X016                                    00246**4
****************************************                                00247**4
ASTAT14  DFHMDF ATTRB=(PROT),                                          X00248**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00249**4
               LENGTH=20,                                              X00250**4
               POS=(18,25)                                              00251**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00222**4
*                                                                       00223**4
*  SCREEN LINE 19                                                       00224**4
*                                                                       00225**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00226**4
****************************************                                00227**4
*  VARIABLE = ALOC15      N004                                          00228**4
****************************************                                00229**4
ALOC15   DFHMDF ATTRB=(PROT,NUM),                                      X00230**4
               JUSTIFY=(RIGHT,ZERO),                                   X        
               COLOR=BLUE,                                             X00231**4
               PICOUT='ZZZ9',                                          X00053**5
               LENGTH=4,                                               X00233**4
               POS=(19,1)                                               00234**4
****************************************                                00239**4
*  VARIABLE = ALNM15      X011                                          00240**4
****************************************                                00241**4
ALNM15   DFHMDF ATTRB=(PROT),                                          X00242**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00231**4
               LENGTH=11,                                              X00243**4
               POS=(19,6)                                               00244**4
****************************************                                00245**4
*  VARIABLE = CPLD TIME         X005                                    00246**4
****************************************                                00247**4
ACPLD15  DFHMDF ATTRB=(PROT),                                          X00248**4
               COLOR=BLUE,                                             X00249**4
               LENGTH=5,                                               X00250**4
               POS=(19,18)                                              00251**4
****************************************                                00245**4
*  VARIABLE = INVENTORY STATUS  X016                                    00246**4
****************************************                                00247**4
ASTAT15  DFHMDF ATTRB=(PROT),                                          X00248**4
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X00249**4
               LENGTH=20,                                              X00250**4
               POS=(19,25)                                              00251**4
         DFHMSD TYPE=FINAL                                              01328**4
         END                                                            01329**4
