*          DATA SET INKM033    AT LEVEL 002 AS OF 09/16/99                      
  PRINT  NOGEN                                                          00001   
************************************************************            00002   
*                                                                       00003   
*  AACYY - INKM033                                                      00004   
*                                                                       00005   
*     GENERATED          : 09/16/99 AT 10:25:08 AM                      00006   
*     VERSION            : 2.7.01                                       00007   
*     CSD LEVEL          : 2.7.01                                       00008   
*     AUTHOR             : NEWUSER.                                     00009   
*     INSTALLATION       : KNOWLEDGEWARE, INC.                          00010   
*     ENCYCLOPEDIA       : PHYSICAL INVENTORY                           00011   
*     ENCYCLOPEDIA PATH  : C:\ADW_ENC\MLDE00A\                          00012   
*     MAP DETAILS                                                       00013   
*     LAST UPDATED 10/28/2002 AT 10:25:01 BY TK22400                    00014   
*                                 CHG ID:W21732                                 
*                                                                       00016   
*  WR26600  07/  /2004  PHYSICAL INVENTORY STORE EXPANSION              00016   
*    INCREASED ASTNAME TO DISPLAY LOCATION ID AND NAME                  00016   
*    M JOHNSON                                                          00016   
*                                                                       00016   
*  WR25248  02/06/2006  CAPTURING AND REPORTING UPC FOR INVENTORY.      00016   
*    EXPAND SKU TO ALLOW UPC ENTRY.                                     00016   
*    J SELWITSCHKA                                                      00016   
*    REFERENCE TKMA.IN.CYCLE.SRCLIB FOR CHANGES                         00016   
*-----------------------------------------------------------            00015   
*                                                                       00016   
*  BMS MAPSET :  INKM033                                                00017   
*      MAP    :  IN033A                                                 00018   
************************************************************            00019   
INKM033  DFHMSD TYPE=DSECT,                                            X00020   
               CTRL=(FREEKB),                                          X00021   
               TERM=3270-2,                                            X00022   
               LANG=COBOL,                                             X00023   
               MODE=INOUT,                                             X00024   
               TIOAPFX=YES,                                            X00025   
               STORAGE=AUTO                                             00026   
IN033A   DFHMDI LINE=2,                                                X00027   
               COLUMN=1,                                               X00028   
               SIZE=(19,80),                                           X00029   
               MAPATTS=(COLOR,HILIGHT),                                X00030   
               DSATTS=(COLOR,HILIGHT)                                   00031   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 02                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
****************************************                                00042   
*  VARIABLE = TYPE-CDE-DESC X025                                        00043   
****************************************                                00044   
ATYPDSC  DFHMDF ATTRB=(ASKIP),                                         X00045   
               COLOR=BLUE,                                             X00046   
               LENGTH=25,                                              X00047   
               POS=(01,10)                                              00048   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00037   
               INITIAL='FOR',                                          X00038   
               COLOR=NEUTRAL,                                          X00039   
               LENGTH=3,                                               X00040   
               POS=(01,36)                                              00041   
****************************************                                00042   
*  VARIABLE = NAME      X025                                            00043   
****************************************                                00044   
ASTNAME  DFHMDF ATTRB=(ASKIP),                                         X00045   
               COLOR=BLUE,                                             X00046   
               LENGTH=32,                                              X00047   
               POS=(01,40)                                              00048   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00049   
*                                                                       00050   
*  SCREEN LINE 03                                                       00051   
*                                                                       00052   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00053   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00054   
               INITIAL='SHEET',                                        X00055   
               COLOR=NEUTRAL,                                          X00056   
               LENGTH=5,                                               X00057   
               POS=(02,2)                                               00058   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00059   
               INITIAL='NUMBER:',                                      X00060   
               COLOR=NEUTRAL,                                          X00061   
               LENGTH=7,                                               X00062   
               POS=(02,8)                                               00063   
****************************************                                00064   
*  VARIABLE = -SHEET-NUMBER      N007                                   00065   
****************************************                                00066   
ASHEET   DFHMDF ATTRB=(ASKIP),                                         X00067   
               JUSTIFY=(LEFT,BLANK),                                   X00068   
               COLOR=BLUE,                                             X00069   
               PICOUT='ZZZZZZ',                                        X00070   
               LENGTH=6,                                               X00071   
               POS=(02,17)                                              00072   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00073   
*                                                                       00074   
*  SCREEN LINE 04                                                       00075   
*                                                                       00076   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00077   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00078   
               INITIAL='SKU / UPC',                                    X00079**2
               COLOR=NEUTRAL,                                          X00080   
               LENGTH=9,                                               X00081**2
               POS=(03,5)                                               00082**2
         DFHMDF ATTRB=(PROT,BRT),                                      X00083   
               INITIAL='QTY',                                          X00084   
               COLOR=NEUTRAL,                                          X00085   
               LENGTH=3,                                               X00086   
               POS=(03,18)                                              00087**2
         DFHMDF ATTRB=(PROT,BRT),                                      X00088   
               INITIAL='RETAIL',                                       X00089   
               COLOR=NEUTRAL,                                          X00090   
               LENGTH=6,                                               X00091   
               POS=(03,24)                                              00092   
         DFHMDF ATTRB=(PROT,BRT),                                      X00093   
               INITIAL='EXTD RTL',                                     X00094   
               COLOR=NEUTRAL,                                          X00095   
               LENGTH=8,                                               X00096   
               POS=(03,32)                                              00097   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00078   
               INITIAL='SKU / UPC',                                    X00079**2
               COLOR=NEUTRAL,                                          X00080   
               LENGTH=9,                                               X00081**2
               POS=(03,45)                                              00082**2
         DFHMDF ATTRB=(PROT,BRT),                                      X00083   
               INITIAL='QTY',                                          X00084   
               COLOR=NEUTRAL,                                          X00085   
               LENGTH=3,                                               X00086   
               POS=(03,58)                                              00087**2
         DFHMDF ATTRB=(PROT,BRT),                                      X00088   
               INITIAL='RETAIL',                                       X00089   
               COLOR=NEUTRAL,                                          X00090   
               LENGTH=6,                                               X00091   
               POS=(03,64)                                              00092   
         DFHMDF ATTRB=(PROT,BRT),                                      X00093   
               INITIAL='EXTD RTL',                                     X00094   
               COLOR=NEUTRAL,                                          X00095   
               LENGTH=8,                                               X00096   
               POS=(03,72)                                              00097   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00103   
*                                                                       00104   
*  SCREEN LINE 05                                                       00105   
*                                                                       00106   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00107   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN01  DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(04,02)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY01   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(04,18)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE01  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(04,22)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD01  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(04,31)                                              00172   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN02  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(04,42)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY02   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(04,58)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE02  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(04,62)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD02  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(04,71)                                              00172   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00103   
*                                                                       00104   
*  SCREEN LINE 06                                                       00105   
*                                                                       00106   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00107   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN03  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(05,02)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY03   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(05,18)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE03  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(05,22)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD03  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(05,31)                                              00172   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN04  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(05,42)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY04   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(05,58)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE04  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(05,62)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD04  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(05,71)                                              00172   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00103   
*                                                                       00104   
*  SCREEN LINE 07                                                       00105   
*                                                                       00106   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00107   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN05  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(06,02)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY05   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(06,18)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE05  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(06,22)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD05  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(06,31)                                              00172   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN06  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(06,42)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY06   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(06,58)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE06  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(06,62)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD06  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(06,71)                                              00172   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00103   
*                                                                       00104   
*  SCREEN LINE 08                                                       00105   
*                                                                       00106   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00107   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN07  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(07,02)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY07   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(07,18)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE07  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(07,22)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD07  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(07,31)                                              00172   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN08  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(07,42)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY08   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(07,58)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE08  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(07,62)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD08  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(07,71)                                              00172   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00103   
*                                                                       00104   
*  SCREEN LINE 09                                                       00105   
*                                                                       00106   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00107   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN09  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(08,02)                                              00131   
                                                                                
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY09   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(08,18)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE09  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(08,22)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD09  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(08,31)                                              00172   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN10  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(08,42)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY10   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(08,58)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE10  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(08,62)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD10  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(08,71)                                              00172   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00103   
*                                                                       00104   
*  SCREEN LINE 10                                                       00105   
*                                                                       00106   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00107   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN11  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(09,02)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY11   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(09,18)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE11  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(09,22)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD11  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(09,31)                                              00172   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN12  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(09,42)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY12   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(09,58)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE12  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(09,62)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD12  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(09,71)                                              00172   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00103   
*                                                                       00104   
*  SCREEN LINE 11                                                       00105   
*                                                                       00106   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00107   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN13  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(10,02)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY13   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(10,18)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE13  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(10,22)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD13  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(10,31)                                              00172   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN14  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(10,42)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY14   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(10,58)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE14  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(10,62)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD14  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(10,71)                                              00172   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00103   
*                                                                       00104   
*  SCREEN LINE 12                                                       00105   
*                                                                       00106   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00107   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN15  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(11,02)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY15   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(11,18)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE15  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(11,22)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD15  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(11,31)                                              00172   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN16  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(11,42)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY16   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(11,58)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE16  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(11,62)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD16  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(11,71)                                              00172   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00103   
*                                                                       00104   
*  SCREEN LINE 13                                                       00105   
*                                                                       00106   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00107   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN17  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(12,02)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY17   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(12,18)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE17  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(12,22)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD17  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(12,31)                                              00172   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN18  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(12,42)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY18   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(12,58)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE18  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(12,62)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD18  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(12,71)                                              00172   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00177   
*                                                                       00178   
*  SCREEN LINE 14                                                       00179   
*                                                                       00180   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00181   
****************************************                                00108   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN19  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(13,02)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY19   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(13,18)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE19  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(13,22)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD19  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(13,31)                                              00172   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN20  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(13,42)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY20   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(13,58)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE20  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(13,62)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD20  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(13,71)                                              00172   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00177   
*                                                                       00178   
*  SCREEN LINE 15                                                       00179   
*                                                                       00180   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00181   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN21  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(14,02)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY21   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(14,18)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE21  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(14,22)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD21  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(14,31)                                              00172   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN22  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(14,42)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY22   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(14,58)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE22  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(14,62)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD22  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(14,71)                                              00172   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00177   
*                                                                       00178   
*  SCREEN LINE 16                                                       00179   
*                                                                       00180   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00181   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN23  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(15,02)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY23   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(15,18)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE23  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(15,22)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD23  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(15,31)                                              00172   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN24  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(15,42)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY24   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(15,58)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE24  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(15,62)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD24  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(15,71)                                              00172   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00177   
*                                                                       00178   
*  SCREEN LINE 17                                                       00179   
*                                                                       00180   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00181   
****************************************                                00124   
*  VARIABLE = -SKU-NBR      X008                                        00125   
****************************************                                00126   
ASKUN25  DFHMDF ATTRB=(UNPROT,NUM),                                    X00127   
               COLOR=GREEN,                                            X00128   
               HILIGHT=UNDERLINE,                                      X00129   
               LENGTH=15,                                              X00130   
               POS=(16,02)                                              00131   
****************************************                                00136   
*  VARIABLE = -LINE-QUANTITY   N04                                      00137   
****************************************                                00138   
AQTY25   DFHMDF ATTRB=(UNPROT,NUM),                                    X00139   
               JUSTIFY=(LEFT,BLANK),                                   X00140   
               COLOR=GREEN,                                            X00141   
               HILIGHT=UNDERLINE,                                      X00142   
               PICOUT='ZZ9',                                           X00143   
               LENGTH=3,                                               X00144   
               POS=(16,18)                                              00145   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N007                             00151   
****************************************                                00152   
APRCE25  DFHMDF ATTRB=(ASKIP),                                         X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00141   
               PICOUT='ZZZZZ.99',                                      X00157   
               LENGTH=8,                                               X00158   
               POS=(16,22)                                              00159   
****************************************                                00164   
*  VARIABLE = -EXTD-PRICE-AMT                                           00165   
****************************************                                00166   
AEXTD25  DFHMDF ATTRB=(ASKIP),                                         X00167   
               JUSTIFY=(LEFT,BLANK),                                   X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZZZZ.99',                                      X00170   
               LENGTH=8,                                               X00171   
               POS=(16,31)                                              00172   
****************************************                                00164   
*  VARIABLE = -TOTALS                                                   00165   
****************************************                                00166   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00037   
               INITIAL='TOTAL',                                        X00038   
               COLOR=NEUTRAL,                                          X00039   
               LENGTH=5,                                               X00040   
               POS=(17,42)                                              00041   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00037   
               INITIAL='RETAIL: $  ',                                  X00038   
               COLOR=NEUTRAL,                                          X00039   
               LENGTH=11,                                              X00040   
               POS=(17,48)                                              00041   
****************************************                                00150   
*******  TOTAL OF ALL RETAIL AMOUNTS **                                 00150   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N016                             00151   
****************************************                                00152   
ATRTL01  DFHMDF ATTRB=(ASKIP,BRT),                                     X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00155   
               PICOUT='Z,ZZZ,ZZZ,ZZZ.99',                              X00157   
               LENGTH=16,                                              X00158   
               POS=(17,61)                                              00159   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(17,78),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00150   
*******  TOTAL OF ALL QUANTITY AMT  ****                                00150   
****************************************                                00150   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00037   
               INITIAL='QTY:      ',                                   X00038   
               COLOR=NEUTRAL,                                          X00039   
               LENGTH=10,                                              X00040   
               POS=(18,51)                                              00041   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT  N010                                00151   
****************************************                                00152   
ATQTY01  DFHMDF ATTRB=(ASKIP,BRT),                                     X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00155   
               PICOUT='ZZ,ZZZ,ZZ9',                                    X00157   
               LENGTH=10,                                              X00158   
               POS=(18,64)                                              00159   
         DFHMDF ATTRB=(ASKIP),                                         X00160   
               POS=(18,75),                                            X00161   
               INITIAL=' ',                                            X00162   
               LENGTH=1                                                 00163   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00177   
*                                                                       00178   
*  SCREEN LINE 17                                                       00179   
*                                                                       00180   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00181   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00037   
               INITIAL='EXTD',                                         X00038   
               COLOR=NEUTRAL,                                          X00039   
               LENGTH=4,                                               X00040   
               POS=(19,43)                                              00041   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00037   
               INITIAL='RETAIL: $ ',                                   X00038   
               COLOR=NEUTRAL,                                          X00039   
               LENGTH=10,                                              X00040   
               POS=(19,48)                                              00041   
****************************************                                00150   
******* TOTAL OF EXTD RETAIL AMOUNTS **                                 00150   
****************************************                                00150   
*  VARIABLE = -ITEM-UNIT-PRICE-AMT     N016                             00151   
****************************************                                00152   
ATEXT01  DFHMDF ATTRB=(ASKIP,BRT),                                     X00153   
               JUSTIFY=(LEFT,BLANK),                                   X00154   
               COLOR=BLUE,                                             X00155   
               PICOUT='Z,ZZZ,ZZZ,ZZZ.99',                              X00157   
               LENGTH=16,                                              X00158   
               POS=(19,61)                                              00159   
         DFHMDF ATTRB=(ASKIP),                                         X00160   
               POS=(19,78),                                            X00161   
               INITIAL=' ',                                            X00162   
               LENGTH=1                                                 00163   
         DFHMSD TYPE=FINAL                                              01287   
         END                                                            01288   
