*          DATA SET INKM003    AT LEVEL 010 AS OF 03/28/94                      
*          DATA SET INKM003    AT LEVEL 010 AS OF 09/13/93              00001**1
  PRINT  NOGEN                                                          00002**1
************************************************************            00003**1
*                                                                       00004**1
*  AACYY - INKM003                                                      00005**1
*                                                                       00006**1
*     GENERATED          : 07/27/93 AT 07:56:25 AM                      00007**1
*     VERSION            : 2.7.01                                       00008**1
*     CSD LEVEL          : 2.7.01                                       00009**1
*     AUTHOR             : TKMA072.                                     00010**1
*     INSTALLATION       : KNOWLEDGEWARE, INC.                          00011**1
*     ENCYCLOPEDIA       : PHYSICAL INVENTORY                           00012**1
*     ENCYCLOPEDIA PATH  : C:\ADW_ENC\MLDE00A\                          00013**1
*     MAP DETAILS                                                       00014**1
*     LAST UPDATED 10/24/2001 AT 07:52:30 BY TK20917 WR# 21732          00015**1
*-----------------------------------------------------------            00016**1
*                                                                       00017**1
*  BMS MAPSET :  INKM003                                                00018**1
*      MAP    :  IN003A                                                 00019**1
************************************************************            00020**1
INKM003  DFHMSD TYPE=DSECT,                                            X00021**1
               LANG=COBOL,                                             X00022**1
               CTRL=(FREEKB),                                          X00023**1
               MODE=INOUT,                                             X00024**1
               TERM=3270-2,                                            X00025**1
               TIOAPFX=YES,                                            X00026**1
               STORAGE=AUTO                                             00027**1
IN003A   DFHMDI LINE=2,COLUMN=1,                                       X00028**1
               SIZE=(19,80),                                           X00029**1
               MAPATTS=(COLOR,HILIGHT),                                X00030**1
               DSATTS=(COLOR,HILIGHT)                                   00031**1
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032**1
*                                                                       00033**1
*  SCREEN LINE 02                                                       00034**1
*                                                                       00035**1
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036**1
         DFHMDF ATTRB=(ASKIP),                                         X00037**1
               POS=(01,1),                                             X00038**1
               INITIAL=' ',                                            X00039**1
               LENGTH=1                                                 00040**1
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00041**1
               INITIAL='FOR',                                          X00042**1
               COLOR=NEUTRAL,                                          X00043**1
               LENGTH=3,                                               X00044**1
               POS=(01,26)                                              00045**1
****************************************                                00046**1
*  VARIABLE = ASTRNBR      N004                                         00047**1
****************************************                                00048**1
ASTRNBR  DFHMDF ATTRB=(ASKIP),                                         X00049**1
               COLOR=BLUE,                                             X00050**1
               LENGTH=4,                                               X00051**1
               POS=(01,30)                                              00052**1
****************************************                                00046**1
*  VARIABLE = ASTRNAM      X025                                         00047**1
****************************************                                00048**1
ASTRNAM  DFHMDF ATTRB=(ASKIP),                                         X00049**1
               COLOR=BLUE,                                             X00050**1
               LENGTH=25,                                              X00051**1
               POS=(01,35)                                              00052**1
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00053**1
*                                                                       00054**1
*  SCREEN LINE 03                                                       00055**1
*                                                                       00056**1
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00057**1
         DFHMDF ATTRB=(ASKIP),                                         X00058**1
               POS=(02,1),                                             X00059**1
               INITIAL=' ',                                            X00060**1
               LENGTH=1                                                 00061**1
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00062**1
               INITIAL='AREA',                                         X00063**1
               COLOR=NEUTRAL,                                          X00064**1
               LENGTH=4,                                               X00065**1
               POS=(02,3)                                               00066**1
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00067**1
               INITIAL='NUMBER:',                                      X00068**1
               COLOR=NEUTRAL,                                          X00069**1
               LENGTH=7,                                               X00070**1
               POS=(02,8)                                               00071**1
****************************************                                00072**1
*  VARIABLE = AAREA      N006                                           00073**1
****************************************                                00074**1
AAREA    DFHMDF ATTRB=(ASKIP),                                         X00075**1
               JUSTIFY=(LEFT,BLANK),                                   X00076**1
               COLOR=BLUE,                                             X00077**1
               PICOUT='ZZZZZZ',                                        X00078**1
               LENGTH=6,                                               X00079**1
               POS=(02,16)                                              00080**1
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00081**1
               INITIAL='ITEMS',                                        X00082**1
               COLOR=NEUTRAL,                                          X00083**1
               LENGTH=5,                                               X00084**1
               POS=(02,40)                                              00085**1
****************************************                                00086**1
*  VARIABLE = ASTRTIT      N005                                         00087**1
****************************************                                00088**1
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00089**1
               JUSTIFY=(LEFT,BLANK),                                   X00090**1
               COLOR=GREEN,                                            X00091**1
               HILIGHT=UNDERLINE,                                      X00092**1
               PICOUT='ZZZZZ',                                         X00093**1
               LENGTH=5,                                               X00094**1
               POS=(02,47)                                              00095**1
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00096**1
               INITIAL='TO',                                           X00097**1
               COLOR=NEUTRAL,                                          X00098**1
               LENGTH=2,                                               X00099**1
               POS=(02,53)                                              00100**1
****************************************                                00101**1
*  VARIABLE = AENDIT      N005                                          00102**1
****************************************                                00103**1
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00104**1
               JUSTIFY=(LEFT,BLANK),                                   X00105**1
               COLOR=BLUE,                                             X00106**1
               PICOUT='ZZZZZ',                                         X00107**1
               LENGTH=5,                                               X00108**1
               POS=(02,56)                                              00109**1
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00110**1
               INITIAL='OF',                                           X00111**1
               COLOR=NEUTRAL,                                          X00112**1
               LENGTH=2,                                               X00113**1
               POS=(02,62)                                              00114**1
****************************************                                00115**1
*  VARIABLE = ATOTIT      N005                                          00116**1
****************************************                                00117**1
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00118**1
               JUSTIFY=(LEFT,BLANK),                                   X00119**1
               COLOR=BLUE,                                             X00120**1
               PICOUT='ZZZZZ',                                         X00121**1
               LENGTH=5,                                               X00122**1
               POS=(02,65)                                              00123**1
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00124**1
*                                                                       00125**1
*  SCREEN LINE 05                                                       00126**1
*                                                                       00127**1
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00128**1
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00129**1
               INITIAL='INVALID',                                      X00130**1
               COLOR=NEUTRAL,                                          X00131**1
               LENGTH=7,                                               X00132**1
               POS=(04,13)                                              00133*10
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00134**1
               INITIAL='INVALID',                                      X00135**1
               COLOR=NEUTRAL,                                          X00136**1
               LENGTH=7,                                               X00137**1
               POS=(04,27)                                              00138**6
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00139**6
               INITIAL='CORRECTED',                                    X00140**6
               COLOR=NEUTRAL,                                          X00141**6
               LENGTH=9,                                               X00142**6
               POS=(04,52)                                              00143**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00144**6
               INITIAL='CORRECTED',                                    X00145**6
               COLOR=NEUTRAL,                                          X00146**6
               LENGTH=9,                                               X00147**6
               POS=(04,68)                                              00148**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00149**1
*                                                                       00150**1
*  SCREEN LINE 06                                                       00151**1
*                                                                       00152**1
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00153**1
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00154**1
               INITIAL='LINE',                                         X00155**1
               COLOR=NEUTRAL,                                          X00156**1
               LENGTH=4,                                               X00157**1
               POS=(05,3)                                               00158**6
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00159**1
               INITIAL='UPC',                                          X00160**1
               COLOR=NEUTRAL,                                          X00161**1
               LENGTH=3,                                               X00162**1
               POS=(05,15)                                              00163*10
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00164**8
               INITIAL='SKU',                                          X00165**8
               COLOR=NEUTRAL,                                          X00166**8
               LENGTH=3,                                               X00167**8
               POS=(05,29)                                              00168**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00169**1
               INITIAL='QUANTITY',                                     X00170**1
               COLOR=NEUTRAL,                                          X00171**1
               LENGTH=8,                                               X00172**1
               POS=(05,36)                                              00173**6
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00174**1
               INITIAL='PRICE',                                        X00175**1
               COLOR=NEUTRAL,                                          X00176**1
               LENGTH=5,                                               X00177**1
               POS=(05,46)                                              00178**6
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00179**6
               INITIAL='SKU',                                          X00180**6
               COLOR=NEUTRAL,                                          X00181**6
               LENGTH=3,                                               X00182**6
               POS=(05,55)                                              00183**7
         DFHMDF ATTRB=(PROT,BRT),                                      X00184**6
               INITIAL='OR',                                           X00185**6
               COLOR=NEUTRAL,                                          X00186**6
               LENGTH=2,                                               X00187**6
               POS=(05,63)                                              00188**6
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00189**6
               INITIAL='UPC',                                          X00190**6
               COLOR=NEUTRAL,                                          X00191**6
               LENGTH=3,                                               X00192**6
               POS=(05,71)                                              00193**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00194**1
*                                                                       00195**1
*  SCREEN LINE 07                                                       00196**1
*                                                                       00197**1
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00198**1
****************************************                                00199**1
*  VARIABLE = -INVENTORY-LINE-NUM      N007                             00200**1
****************************************                                00201**1
ALINE01  DFHMDF ATTRB=(ASKIP),                                         X00202**1
               JUSTIFY=(LEFT,BLANK),                                   X00203**1
               COLOR=BLUE,                                             X00204**1
               PICOUT='ZZZZZZZ',                                       X00205**1
               LENGTH=7,                                               X00206**1
               POS=(06,02)                                              00207**1
****************************************                                00208**1
*  VARIABLE = -RECORDED-UPC-NUMBE      N015                             00209**1
****************************************                                00210**1
AIUPC01  DFHMDF ATTRB=(ASKIP),                                         X00211**1
               JUSTIFY=(LEFT,BLANK),                                   X00212**1
               COLOR=BLUE,                                             X00213**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00214**1
               LENGTH=15,                                              X00215**1
               POS=(06,10)                                              00216**8
****************************************                                00231**8
*  VARIABLE = -RECORDED-SKU-NBR      X008                               00232**8
****************************************                                00233**8
AISKU01  DFHMDF ATTRB=(ASKIP),                                         X00234**8
               COLOR=BLUE,                                             X00235**8
               LENGTH=8,                                               X00236**8
               POS=(06,26)                                              00237*10
****************************************                                00238**1
*  VARIABLE = -RECORDED-QUANTITY      N007                              00239**1
****************************************                                00240**1
ARQTY01  DFHMDF ATTRB=(ASKIP),                                         X00241**1
               JUSTIFY=(LEFT,BLANK),                                   X00242**1
               COLOR=BLUE,                                             X00243**1
               PICOUT='ZZZZZ',                                         X00244**1
               LENGTH=5,                                               X00245**1
               POS=(06,37)                                              00246**9
****************************************                                00247**1
*  VARIABLE = -RECORDED-PRICE         N007                              00248**1
****************************************                                00249**1
ARPRI01  DFHMDF ATTRB=(ASKIP),                                         X00250**1
               JUSTIFY=(LEFT,BLANK),                                   X00251**1
               COLOR=BLUE,                                             X00252**1
               PICOUT='ZZZZZ.99',                                      X00253**1
               LENGTH=8,                                               X00254**1
               POS=(06,43)                                              00255**1
****************************************                                00272**1
*  VARIABLE = -CORRECT-SKU-NUMBER      X008                             00273**1
****************************************                                00274**1
ACSKU01  DFHMDF ATTRB=(UNPROT,IC),                                     X00275**1
               COLOR=GREEN,                                            X00276**1
               HILIGHT=UNDERLINE,                                      X00277**1
               LENGTH=8,                                               X00278**1
               POS=(06,52)                                              00279**1
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' ',                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=1,                                               X        
               POS=(06,61)                                                      
****************************************                                00280**1
*  VARIABLE = -CORRECT-UPC-NUMBER      N015                             00281**1
****************************************                                00282**1
ACUPC01  DFHMDF ATTRB=(UNPROT,NUM),                                    X00283**1
               COLOR=GREEN,                                            X00284**1
               HILIGHT=UNDERLINE,                                      X00285**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00286**1
               LENGTH=15,                                              X00287**1
               POS=(06,63)                                              00288**1
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00289**1
               LENGTH=1,                                               X00290**1
               POS=(06,79)                                              00291**1
*                                                                       00292**1
****************************************                                00293**1
*  VARIABLE = -INVENTORY-LINE-NUM      N007                             00294**1
****************************************                                00295**1
ALINE02  DFHMDF ATTRB=(ASKIP),                                         X00296**1
               JUSTIFY=(LEFT,BLANK),                                   X00297**1
               COLOR=BLUE,                                             X00298**1
               PICOUT='ZZZZZZZ',                                       X00299**1
               LENGTH=7,                                               X00300**1
               POS=(07,02)                                              00301**1
****************************************                                00302**1
*  VARIABLE = -RECORDED-UPC-NUMBE      N015                             00303**1
****************************************                                00304**1
AIUPC02  DFHMDF ATTRB=(ASKIP),                                         X00305**1
               JUSTIFY=(LEFT,BLANK),                                   X00306**1
               COLOR=BLUE,                                             X00307**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00308**1
               LENGTH=15,                                              X00309**1
               POS=(07,10)                                              00310**8
****************************************                                00325**8
*  VARIABLE = -RECORDED-SKU-NBR      X008                               00326**8
****************************************                                00327**8
AISKU02  DFHMDF ATTRB=(ASKIP),                                         X00328**8
               COLOR=BLUE,                                             X00329**8
               LENGTH=8,                                               X00330**8
               POS=(07,26)                                              00331*10
****************************************                                00332**1
*  VARIABLE = -RECORDED-QUANTITY      N007                              00333**1
****************************************                                00334**1
ARQTY02  DFHMDF ATTRB=(ASKIP),                                         X00335**1
               JUSTIFY=(LEFT,BLANK),                                   X00336**1
               COLOR=BLUE,                                             X00337**1
               PICOUT='ZZZZZ',                                         X00338**1
               LENGTH=5,                                               X00339**1
               POS=(07,37)                                              00340**9
****************************************                                00341**1
*  VARIABLE = -RECORDED-PRICE         N007                              00342**1
****************************************                                00343**1
ARPRI02  DFHMDF ATTRB=(ASKIP),                                         X00344**1
               JUSTIFY=(LEFT,BLANK),                                   X00345**1
               COLOR=BLUE,                                             X00346**1
               PICOUT='ZZZZZ.99',                                      X00347**1
               LENGTH=8,                                               X00348**1
               POS=(07,43)                                              00349**1
****************************************                                00366**1
*  VARIABLE = -CORRECT-SKU-NUMBER      X008                             00367**1
****************************************                                00368**1
ACSKU02  DFHMDF ATTRB=(UNPROT,IC),                                     X00369**1
               COLOR=GREEN,                                            X00370**1
               HILIGHT=UNDERLINE,                                      X00371**1
               LENGTH=8,                                               X00372**1
               POS=(07,52)                                              00373**1
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' ',                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=1,                                               X        
               POS=(07,61)                                                      
****************************************                                00374**1
*  VARIABLE = -CORRECT-UPC-NUMBER      N015                             00375**1
****************************************                                00376**1
ACUPC02  DFHMDF ATTRB=(UNPROT,NUM),                                    X00377**1
               COLOR=GREEN,                                            X00378**1
               HILIGHT=UNDERLINE,                                      X00379**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00380**1
               LENGTH=15,                                              X00381**1
               POS=(07,63)                                              00382**1
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00383**1
               LENGTH=1,                                               X00384**1
               POS=(07,79)                                              00385**1
*                                                                       00386**1
****************************************                                00387**1
*  VARIABLE = -INVENTORY-LINE-NUM      N007                             00388**1
****************************************                                00389**1
ALINE03  DFHMDF ATTRB=(ASKIP),                                         X00390**1
               JUSTIFY=(LEFT,BLANK),                                   X00391**1
               COLOR=BLUE,                                             X00392**1
               PICOUT='ZZZZZZZ',                                       X00393**1
               LENGTH=7,                                               X00394**1
               POS=(08,02)                                              00395**1
****************************************                                00396**1
*  VARIABLE = -RECORDED-UPC-NUMBE      N015                             00397**1
****************************************                                00398**1
AIUPC03  DFHMDF ATTRB=(ASKIP),                                         X00399**1
               JUSTIFY=(LEFT,BLANK),                                   X00400**1
               COLOR=BLUE,                                             X00401**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00402**1
               LENGTH=15,                                              X00403**1
               POS=(08,10)                                              00404**8
****************************************                                00419**8
*  VARIABLE = -RECORDED-SKU-NBR      X008                               00420**8
****************************************                                00421**8
AISKU03  DFHMDF ATTRB=(ASKIP),                                         X00422**8
               COLOR=BLUE,                                             X00423**8
               LENGTH=8,                                               X00424**8
               POS=(08,26)                                              00425*10
****************************************                                00426**1
*  VARIABLE = -RECORDED-QUANTITY      N007                              00427**1
****************************************                                00428**1
ARQTY03  DFHMDF ATTRB=(ASKIP),                                         X00429**1
               JUSTIFY=(LEFT,BLANK),                                   X00430**1
               COLOR=BLUE,                                             X00431**1
               PICOUT='ZZZZZ',                                         X00432**1
               LENGTH=5,                                               X00433**1
               POS=(08,37)                                              00434**9
****************************************                                00435**1
*  VARIABLE = -RECORDED-PRICE         N007                              00436**1
****************************************                                00437**1
ARPRI03  DFHMDF ATTRB=(ASKIP),                                         X00438**1
               JUSTIFY=(LEFT,BLANK),                                   X00439**1
               COLOR=BLUE,                                             X00440**1
               PICOUT='ZZZZZ.99',                                      X00441**1
               LENGTH=8,                                               X00442**1
               POS=(08,43)                                              00443**1
****************************************                                00460**1
*  VARIABLE = -CORRECT-SKU-NUMBER      X008                             00461**1
****************************************                                00462**1
ACSKU03  DFHMDF ATTRB=(UNPROT,IC),                                     X00463**1
               COLOR=GREEN,                                            X00464**1
               HILIGHT=UNDERLINE,                                      X00465**1
               LENGTH=8,                                               X00466**1
               POS=(08,52)                                              00467**1
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' ',                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=1,                                               X        
               POS=(08,61)                                                      
****************************************                                00468**1
*  VARIABLE = -CORRECT-UPC-NUMBER      N015                             00469**1
****************************************                                00470**1
ACUPC03  DFHMDF ATTRB=(UNPROT,NUM),                                    X00471**1
               COLOR=GREEN,                                            X00472**1
               HILIGHT=UNDERLINE,                                      X00473**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00474**1
               LENGTH=15,                                              X00475**1
               POS=(08,63)                                              00476**1
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00477**1
               LENGTH=1,                                               X00478**1
               POS=(08,79)                                              00479**1
*                                                                       00480**1
****************************************                                00481**1
*  VARIABLE = -INVENTORY-LINE-NUM      N007                             00482**1
****************************************                                00483**1
ALINE04  DFHMDF ATTRB=(ASKIP),                                         X00484**1
               JUSTIFY=(LEFT,BLANK),                                   X00485**1
               COLOR=BLUE,                                             X00486**1
               PICOUT='ZZZZZZZ',                                       X00487**1
               LENGTH=7,                                               X00488**1
               POS=(09,02)                                              00489**1
****************************************                                00490**1
*  VARIABLE = -RECORDED-UPC-NUMBE      N015                             00491**1
****************************************                                00492**1
AIUPC04  DFHMDF ATTRB=(ASKIP),                                         X00493**1
               JUSTIFY=(LEFT,BLANK),                                   X00494**1
               COLOR=BLUE,                                             X00495**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00496**1
               LENGTH=15,                                              X00497**1
               POS=(09,10)                                              00498**8
****************************************                                00513**8
*  VARIABLE = -RECORDED-SKU-NBR      X008                               00514**8
****************************************                                00515**8
AISKU04  DFHMDF ATTRB=(ASKIP),                                         X00516**8
               COLOR=BLUE,                                             X00517**8
               LENGTH=8,                                               X00518**8
               POS=(09,26)                                              00519*10
****************************************                                00520**1
*  VARIABLE = -RECORDED-QUANTITY      N007                              00521**1
****************************************                                00522**1
ARQTY04  DFHMDF ATTRB=(ASKIP),                                         X00523**1
               JUSTIFY=(LEFT,BLANK),                                   X00524**1
               COLOR=BLUE,                                             X00525**1
               PICOUT='ZZZZZ',                                         X00526**1
               LENGTH=5,                                               X00527**1
               POS=(09,37)                                              00528**9
****************************************                                00529**1
*  VARIABLE = -RECORDED-PRICE         N007                              00530**1
****************************************                                00531**1
ARPRI04  DFHMDF ATTRB=(ASKIP),                                         X00532**1
               JUSTIFY=(LEFT,BLANK),                                   X00533**1
               COLOR=BLUE,                                             X00534**1
               PICOUT='ZZZZZ.99',                                      X00535**1
               LENGTH=8,                                               X00536**1
               POS=(09,43)                                              00537**1
****************************************                                00554**1
*  VARIABLE = -CORRECT-SKU-NUMBER      X008                             00555**1
****************************************                                00556**1
ACSKU04  DFHMDF ATTRB=(UNPROT,IC),                                     X00557**1
               COLOR=GREEN,                                            X00558**1
               HILIGHT=UNDERLINE,                                      X00559**1
               LENGTH=8,                                               X00560**1
               POS=(09,52)                                              00561**1
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' ',                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=1,                                               X        
               POS=(09,61)                                                      
****************************************                                00562**1
*  VARIABLE = -CORRECT-UPC-NUMBER      N015                             00563**1
****************************************                                00564**1
ACUPC04  DFHMDF ATTRB=(UNPROT,NUM),                                    X00565**1
               COLOR=GREEN,                                            X00566**1
               HILIGHT=UNDERLINE,                                      X00567**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00568**1
               LENGTH=15,                                              X00569**1
               POS=(09,63)                                              00570**1
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00571**1
               LENGTH=1,                                               X00572**1
               POS=(09,79)                                              00573**1
*                                                                       00574**1
****************************************                                00575**1
*  VARIABLE = -INVENTORY-LINE-NUM      N007                             00576**1
****************************************                                00577**1
ALINE05  DFHMDF ATTRB=(ASKIP),                                         X00578**1
               JUSTIFY=(LEFT,BLANK),                                   X00579**1
               COLOR=BLUE,                                             X00580**1
               PICOUT='ZZZZZZZ',                                       X00581**1
               LENGTH=7,                                               X00582**1
               POS=(10,02)                                              00583**1
****************************************                                00584**1
*  VARIABLE = -RECORDED-UPC-NUMBE      N015                             00585**1
****************************************                                00586**1
AIUPC05  DFHMDF ATTRB=(ASKIP),                                         X00587**1
               JUSTIFY=(LEFT,BLANK),                                   X00588**1
               COLOR=BLUE,                                             X00589**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00590**1
               LENGTH=15,                                              X00591**1
               POS=(10,10)                                              00592**8
****************************************                                00607**8
*  VARIABLE = -RECORDED-SKU-NBR      X008                               00608**8
****************************************                                00609**8
AISKU05  DFHMDF ATTRB=(ASKIP),                                         X00610**8
               COLOR=BLUE,                                             X00611**8
               LENGTH=8,                                               X00612**8
               POS=(10,26)                                              00613*10
****************************************                                00614**1
*  VARIABLE = -RECORDED-QUANTITY      N007                              00615**1
****************************************                                00616**1
ARQTY05  DFHMDF ATTRB=(ASKIP),                                         X00617**1
               JUSTIFY=(LEFT,BLANK),                                   X00618**1
               COLOR=BLUE,                                             X00619**1
               PICOUT='ZZZZZ',                                         X00620**1
               LENGTH=5,                                               X00621**1
               POS=(10,37)                                              00622**9
****************************************                                00623**1
*  VARIABLE = -RECORDED-PRICE         N007                              00624**1
****************************************                                00625**1
ARPRI05  DFHMDF ATTRB=(ASKIP),                                         X00626**1
               JUSTIFY=(LEFT,BLANK),                                   X00627**1
               COLOR=BLUE,                                             X00628**1
               PICOUT='ZZZZZ.99',                                      X00629**1
               LENGTH=8,                                               X00630**1
               POS=(10,43)                                              00631**1
****************************************                                00648**1
*  VARIABLE = -CORRECT-SKU-NUMBER      X008                             00649**1
****************************************                                00650**1
ACSKU05  DFHMDF ATTRB=(UNPROT,IC),                                     X00651**1
               COLOR=GREEN,                                            X00652**1
               HILIGHT=UNDERLINE,                                      X00653**1
               LENGTH=8,                                               X00654**1
               POS=(10,52)                                              00655**1
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' ',                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=1,                                               X        
               POS=(10,61)                                                      
****************************************                                00656**1
*  VARIABLE = -CORRECT-UPC-NUMBER      N015                             00657**1
****************************************                                00658**1
ACUPC05  DFHMDF ATTRB=(UNPROT,NUM),                                    X00659**1
               COLOR=GREEN,                                            X00660**1
               HILIGHT=UNDERLINE,                                      X00661**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00662**1
               LENGTH=15,                                              X00663**1
               POS=(10,63)                                              00664**1
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00665**1
               LENGTH=1,                                               X00666**1
               POS=(10,79)                                              00667**1
*                                                                       00668**1
****************************************                                00669**1
*  VARIABLE = -INVENTORY-LINE-NUM      N007                             00670**1
****************************************                                00671**1
ALINE06  DFHMDF ATTRB=(ASKIP),                                         X00672**1
               JUSTIFY=(LEFT,BLANK),                                   X00673**1
               COLOR=BLUE,                                             X00674**1
               PICOUT='ZZZZZZZ',                                       X00675**1
               LENGTH=7,                                               X00676**1
               POS=(11,02)                                              00677**1
****************************************                                00678**1
*  VARIABLE = -RECORDED-UPC-NUMBE      N015                             00679**1
****************************************                                00680**1
AIUPC06  DFHMDF ATTRB=(ASKIP),                                         X00681**1
               JUSTIFY=(LEFT,BLANK),                                   X00682**1
               COLOR=BLUE,                                             X00683**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00684**1
               LENGTH=15,                                              X00685**1
               POS=(11,10)                                              00686**8
****************************************                                00701**8
*  VARIABLE = -RECORDED-SKU-NBR      X008                               00702**8
****************************************                                00703**8
AISKU06  DFHMDF ATTRB=(ASKIP),                                         X00704**8
               COLOR=BLUE,                                             X00705**8
               LENGTH=8,                                               X00706**8
               POS=(11,26)                                              00707*10
****************************************                                00708**1
*  VARIABLE = -RECORDED-QUANTITY      N007                              00709**1
****************************************                                00710**1
ARQTY06  DFHMDF ATTRB=(ASKIP),                                         X00711**1
               JUSTIFY=(LEFT,BLANK),                                   X00712**1
               COLOR=BLUE,                                             X00713**1
               PICOUT='ZZZZZ',                                         X00714**1
               LENGTH=5,                                               X00715**1
               POS=(11,37)                                              00716**9
****************************************                                00717**1
*  VARIABLE = -RECORDED-PRICE         N007                              00718**1
****************************************                                00719**1
ARPRI06  DFHMDF ATTRB=(ASKIP),                                         X00720**1
               JUSTIFY=(LEFT,BLANK),                                   X00721**1
               COLOR=BLUE,                                             X00722**1
               PICOUT='ZZZZZ.99',                                      X00723**1
               LENGTH=8,                                               X00724**1
               POS=(11,43)                                              00725**1
****************************************                                00742**1
*  VARIABLE = -CORRECT-SKU-NUMBER      X008                             00743**1
****************************************                                00744**1
ACSKU06  DFHMDF ATTRB=(UNPROT,IC),                                     X00745**1
               COLOR=GREEN,                                            X00746**1
               HILIGHT=UNDERLINE,                                      X00747**1
               LENGTH=8,                                               X00748**1
               POS=(11,52)                                              00749**1
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' ',                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=1,                                               X        
               POS=(11,61)                                                      
****************************************                                00750**1
*  VARIABLE = -CORRECT-UPC-NUMBER      N015                             00751**1
****************************************                                00752**1
ACUPC06  DFHMDF ATTRB=(UNPROT,NUM),                                    X00753**1
               COLOR=GREEN,                                            X00754**1
               HILIGHT=UNDERLINE,                                      X00755**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00756**1
               LENGTH=15,                                              X00757**1
               POS=(11,63)                                              00758**1
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00759**1
               LENGTH=1,                                               X00760**1
               POS=(11,79)                                              00761**1
*                                                                       00762**1
****************************************                                00763**1
*  VARIABLE = -INVENTORY-LINE-NUM      N007                             00764**1
****************************************                                00765**1
ALINE07  DFHMDF ATTRB=(ASKIP),                                         X00766**1
               JUSTIFY=(LEFT,BLANK),                                   X00767**1
               COLOR=BLUE,                                             X00768**1
               PICOUT='ZZZZZZZ',                                       X00769**1
               LENGTH=7,                                               X00770**1
               POS=(12,02)                                              00771**1
****************************************                                00772**1
*  VARIABLE = -RECORDED-UPC-NUMBE      N015                             00773**1
****************************************                                00774**1
AIUPC07  DFHMDF ATTRB=(ASKIP),                                         X00775**1
               JUSTIFY=(LEFT,BLANK),                                   X00776**1
               COLOR=BLUE,                                             X00777**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00778**1
               LENGTH=15,                                              X00779**1
               POS=(12,10)                                              00780**8
****************************************                                00795**8
*  VARIABLE = -RECORDED-SKU-NBR      X008                               00796**8
****************************************                                00797**8
AISKU07  DFHMDF ATTRB=(ASKIP),                                         X00798**8
               COLOR=BLUE,                                             X00799**8
               LENGTH=8,                                               X00800**8
               POS=(12,26)                                              00801*10
****************************************                                00802**1
*  VARIABLE = -RECORDED-QUANTITY      N007                              00803**1
****************************************                                00804**1
ARQTY07  DFHMDF ATTRB=(ASKIP),                                         X00805**1
               JUSTIFY=(LEFT,BLANK),                                   X00806**1
               COLOR=BLUE,                                             X00807**1
               PICOUT='ZZZZZ',                                         X00808**1
               LENGTH=5,                                               X00809**1
               POS=(12,37)                                              00810**9
****************************************                                00811**1
*  VARIABLE = -RECORDED-PRICE         N007                              00812**1
****************************************                                00813**1
ARPRI07  DFHMDF ATTRB=(ASKIP),                                         X00814**1
               JUSTIFY=(LEFT,BLANK),                                   X00815**1
               COLOR=BLUE,                                             X00816**1
               PICOUT='ZZZZZ.99',                                      X00817**1
               LENGTH=8,                                               X00818**1
               POS=(12,43)                                              00819**1
****************************************                                00836**1
*  VARIABLE = -CORRECT-SKU-NUMBER      X008                             00837**1
****************************************                                00838**1
ACSKU07  DFHMDF ATTRB=(UNPROT,IC),                                     X00839**1
               COLOR=GREEN,                                            X00840**1
               HILIGHT=UNDERLINE,                                      X00841**1
               LENGTH=8,                                               X00842**1
               POS=(12,52)                                              00843**1
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' ',                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=1,                                               X        
               POS=(12,61)                                                      
****************************************                                00844**1
*  VARIABLE = -CORRECT-UPC-NUMBER      N015                             00845**1
****************************************                                00846**1
ACUPC07  DFHMDF ATTRB=(UNPROT,NUM),                                    X00847**1
               COLOR=GREEN,                                            X00848**1
               HILIGHT=UNDERLINE,                                      X00849**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00850**1
               LENGTH=15,                                              X00851**1
               POS=(12,63)                                              00852**1
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00853**1
               LENGTH=1,                                               X00854**1
               POS=(12,79)                                              00855**1
*                                                                       00856**1
****************************************                                00857**1
*  VARIABLE = -INVENTORY-LINE-NUM      N008                             00858**1
****************************************                                00859**1
ALINE08  DFHMDF ATTRB=(ASKIP),                                         X00860**1
               JUSTIFY=(LEFT,BLANK),                                   X00861**1
               COLOR=BLUE,                                             X00862**1
               PICOUT='ZZZZZZZ',                                       X00863**1
               LENGTH=7,                                               X00864**1
               POS=(13,02)                                              00865**1
****************************************                                00866**1
*  VARIABLE = -RECORDED-UPC-NUMBE      N015                             00867**1
****************************************                                00868**1
AIUPC08  DFHMDF ATTRB=(ASKIP),                                         X00869**1
               JUSTIFY=(LEFT,BLANK),                                   X00870**1
               COLOR=BLUE,                                             X00871**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00872**1
               LENGTH=15,                                              X00873**1
               POS=(13,10)                                              00874**8
****************************************                                00889**8
*  VARIABLE = -RECORDED-SKU-NBR      X008                               00890**8
****************************************                                00891**8
AISKU08  DFHMDF ATTRB=(ASKIP),                                         X00892**8
               COLOR=BLUE,                                             X00893**8
               LENGTH=8,                                               X00894**8
               POS=(13,26)                                              00895*10
****************************************                                00896**1
*  VARIABLE = -RECORDED-QUANTITY      N008                              00897**1
****************************************                                00898**1
ARQTY08  DFHMDF ATTRB=(ASKIP),                                         X00899**1
               JUSTIFY=(LEFT,BLANK),                                   X00900**1
               COLOR=BLUE,                                             X00901**1
               PICOUT='ZZZZZ',                                         X00902**1
               LENGTH=5,                                               X00903**1
               POS=(13,37)                                              00904**9
****************************************                                00905**1
*  VARIABLE = -RECORDED-PRICE         N008                              00906**1
****************************************                                00907**1
ARPRI08  DFHMDF ATTRB=(ASKIP),                                         X00908**1
               JUSTIFY=(LEFT,BLANK),                                   X00909**1
               COLOR=BLUE,                                             X00910**1
               PICOUT='ZZZZZ.99',                                      X00911**1
               LENGTH=8,                                               X00912**1
               POS=(13,43)                                              00913**1
****************************************                                00930**1
*  VARIABLE = -CORRECT-SKU-NUMBER      X008                             00931**1
****************************************                                00932**1
ACSKU08  DFHMDF ATTRB=(UNPROT,IC),                                     X00933**1
               COLOR=GREEN,                                            X00934**1
               HILIGHT=UNDERLINE,                                      X00935**1
               LENGTH=8,                                               X00936**1
               POS=(13,52)                                              00937**1
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' ',                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=1,                                               X        
               POS=(13,61)                                                      
****************************************                                00938**1
*  VARIABLE = -CORRECT-UPC-NUMBER      N015                             00939**1
****************************************                                00940**1
ACUPC08  DFHMDF ATTRB=(UNPROT,NUM),                                    X00941**1
               COLOR=GREEN,                                            X00942**1
               HILIGHT=UNDERLINE,                                      X00943**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00944**1
               LENGTH=15,                                              X00945**1
               POS=(13,63)                                              00946**1
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00947**1
               LENGTH=1,                                               X00948**1
               POS=(13,79)                                              00949**1
*                                                                       00950**1
****************************************                                00951**1
*  VARIABLE = -INVENTORY-LINE-NUM      N010                             00952**1
****************************************                                00953**1
ALINE09  DFHMDF ATTRB=(ASKIP),                                         X00954**4
               JUSTIFY=(LEFT,BLANK),                                   X00955**1
               COLOR=BLUE,                                             X00956**1
               PICOUT='ZZZZZZZ',                                       X00957**1
               LENGTH=7,                                               X00958**1
               POS=(14,02)                                              00959**3
****************************************                                00960**1
*  VARIABLE = -RECORDED-UPC-NUMBE      N015                             00961**1
****************************************                                00962**1
AIUPC09  DFHMDF ATTRB=(ASKIP),                                         X00963**4
               JUSTIFY=(LEFT,BLANK),                                   X00964**1
               COLOR=BLUE,                                             X00965**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00966**1
               LENGTH=15,                                              X00967**1
               POS=(14,10)                                              00968**8
****************************************                                00983**8
*  VARIABLE = -RECORDED-SKU-NBR      X008                               00984**8
****************************************                                00985**8
AISKU09  DFHMDF ATTRB=(ASKIP),                                         X00986**8
               COLOR=BLUE,                                             X00987**8
               LENGTH=8,                                               X00988**8
               POS=(14,26)                                              00989*10
****************************************                                00990**1
*  VARIABLE = -RECORDED-QUANTITY      N009                              00991**4
****************************************                                00992**1
ARQTY09  DFHMDF ATTRB=(ASKIP),                                         X00993**4
               JUSTIFY=(LEFT,BLANK),                                   X00994**1
               COLOR=BLUE,                                             X00995**1
               PICOUT='ZZZZZ',                                         X00996**1
               LENGTH=5,                                               X00997**1
               POS=(14,37)                                              00998**9
****************************************                                00999**1
*  VARIABLE = -RECORDED-PRICE         N009                              01000**4
****************************************                                01001**1
ARPRI09  DFHMDF ATTRB=(ASKIP),                                         X01002**4
               JUSTIFY=(LEFT,BLANK),                                   X01003**1
               COLOR=BLUE,                                             X01004**1
               PICOUT='ZZZZZ.99',                                      X01005**1
               LENGTH=8,                                               X01006**1
               POS=(14,43)                                              01007**3
****************************************                                01024**1
*  VARIABLE = -CORRECT-SKU-NUMBER      X008                             01025**4
****************************************                                01026**1
ACSKU09  DFHMDF ATTRB=(UNPROT,IC),                                     X01027**4
               COLOR=GREEN,                                            X01028**1
               HILIGHT=UNDERLINE,                                      X01029**1
               LENGTH=8,                                               X01030**1
               POS=(14,52)                                              01031**3
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' ',                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=1,                                               X        
               POS=(14,61)                                                      
****************************************                                01032**1
*  VARIABLE = -CORRECT-UPC-NUMBER      N015                             01033**1
****************************************                                01034**1
ACUPC09  DFHMDF ATTRB=(UNPROT,NUM),                                    X01035**4
               COLOR=GREEN,                                            X01036**1
               HILIGHT=UNDERLINE,                                      X01037**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X01038**1
               LENGTH=15,                                              X01039**1
               POS=(14,63)                                              01040**3
         DFHMDF ATTRB=(ASKIP,DRK),                                     X01041**1
               LENGTH=1,                                               X01042**1
               POS=(14,79)                                              01043**3
*                                                                       01044**1
****************************************                                01045**1
*  VARIABLE = -INVENTORY-LINE-NUM      N010                             01046**1
****************************************                                01047**1
ALINE10  DFHMDF ATTRB=(ASKIP),                                         X01048**1
               JUSTIFY=(LEFT,BLANK),                                   X01049**1
               COLOR=BLUE,                                             X01050**1
               PICOUT='ZZZZZZZ',                                       X01051**1
               LENGTH=7,                                               X01052**1
               POS=(15,02)                                              01053**1
****************************************                                01054**1
*  VARIABLE = -RECORDED-UPC-NUMBE      N015                             01055**1
****************************************                                01056**1
AIUPC10  DFHMDF ATTRB=(ASKIP),                                         X01057**1
               JUSTIFY=(LEFT,BLANK),                                   X01058**1
               COLOR=BLUE,                                             X01059**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X01060**1
               LENGTH=15,                                              X01061**1
               POS=(15,10)                                              01062**8
****************************************                                01077**8
*  VARIABLE = -RECORDED-SKU-NBR      X008                               01078**8
****************************************                                01079**8
AISKU10  DFHMDF ATTRB=(ASKIP),                                         X01080**8
               COLOR=BLUE,                                             X01081**8
               LENGTH=8,                                               X01082**8
               POS=(15,26)                                              01083*10
****************************************                                01084**1
*  VARIABLE = -RECORDED-QUANTITY      N010                              01085**1
****************************************                                01086**1
ARQTY10  DFHMDF ATTRB=(ASKIP),                                         X01087**1
               JUSTIFY=(LEFT,BLANK),                                   X01088**1
               COLOR=BLUE,                                             X01089**1
               PICOUT='ZZZZZ',                                         X01090**1
               LENGTH=5,                                               X01091**1
               POS=(15,37)                                              01092**9
****************************************                                01093**1
*  VARIABLE = -RECORDED-PRICE         N010                              01094**1
****************************************                                01095**1
ARPRI10  DFHMDF ATTRB=(ASKIP),                                         X01096**1
               JUSTIFY=(LEFT,BLANK),                                   X01097**1
               COLOR=BLUE,                                             X01098**1
               PICOUT='ZZZZZ.99',                                      X01099**1
               LENGTH=8,                                               X01100**1
               POS=(15,43)                                              01101**1
****************************************                                01118**1
*  VARIABLE = -CORRECT-SKU-NUMBER      X008                             01119**1
****************************************                                01120**1
ACSKU10  DFHMDF ATTRB=(UNPROT,IC),                                     X01121**1
               COLOR=GREEN,                                            X01122**1
               HILIGHT=UNDERLINE,                                      X01123**1
               LENGTH=8,                                               X01124**1
               POS=(15,52)                                              01125**1
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' ',                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=1,                                               X        
               POS=(15,61)                                                      
****************************************                                01126**1
*  VARIABLE = -CORRECT-UPC-NUMBER      N015                             01127**1
****************************************                                01128**1
ACUPC10  DFHMDF ATTRB=(UNPROT,NUM),                                    X01129**1
               COLOR=GREEN,                                            X01130**1
               HILIGHT=UNDERLINE,                                      X01131**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X01132**1
               LENGTH=15,                                              X01133**1
               POS=(15,63)                                              01134**1
         DFHMDF ATTRB=(ASKIP,DRK),                                     X01135**1
               LENGTH=1,                                               X01136**1
               POS=(15,79)                                              01137**1
*                                                                       01138**1
****************************************                                01139**1
*  VARIABLE = -INVENTORY-LINE-NUM      N011                             01140**1
****************************************                                01141**1
ALINE11  DFHMDF ATTRB=(ASKIP),                                         X01142**1
               JUSTIFY=(LEFT,BLANK),                                   X01143**1
               COLOR=BLUE,                                             X01144**1
               PICOUT='ZZZZZZZ',                                       X01145**1
               LENGTH=7,                                               X01146**1
               POS=(16,02)                                              01147**1
****************************************                                01148**1
*  VARIABLE = -RECORDED-UPC-NUMBE      N015                             01149**1
****************************************                                01150**1
AIUPC11  DFHMDF ATTRB=(ASKIP),                                         X01151**1
               JUSTIFY=(LEFT,BLANK),                                   X01152**1
               COLOR=BLUE,                                             X01153**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X01154**1
               LENGTH=15,                                              X01155**1
               POS=(16,10)                                              01156**8
****************************************                                01171**8
*  VARIABLE = -RECORDED-SKU-NBR      X008                               01172**8
****************************************                                01173**8
AISKU11  DFHMDF ATTRB=(ASKIP),                                         X01174**8
               COLOR=BLUE,                                             X01175**8
               LENGTH=8,                                               X01176**8
               POS=(16,26)                                              01177*10
****************************************                                01178**1
*  VARIABLE = -RECORDED-QUANTITY      N011                              01179**1
****************************************                                01180**1
ARQTY11  DFHMDF ATTRB=(ASKIP),                                         X01181**1
               JUSTIFY=(LEFT,BLANK),                                   X01182**1
               COLOR=BLUE,                                             X01183**1
               PICOUT='ZZZZZ',                                         X01184**1
               LENGTH=5,                                               X01185**1
               POS=(16,37)                                              01186**9
****************************************                                01187**1
*  VARIABLE = -RECORDED-PRICE         N011                              01188**1
****************************************                                01189**1
ARPRI11  DFHMDF ATTRB=(ASKIP),                                         X01190**1
               JUSTIFY=(LEFT,BLANK),                                   X01191**1
               COLOR=BLUE,                                             X01192**1
               PICOUT='ZZZZZ.99',                                      X01193**1
               LENGTH=8,                                               X01194**1
               POS=(16,43)                                              01195**1
****************************************                                01212**1
*  VARIABLE = -CORRECT-SKU-NUMBER      X008                             01213**1
****************************************                                01214**1
ACSKU11  DFHMDF ATTRB=(UNPROT,IC),                                     X01215**1
               COLOR=GREEN,                                            X01216**1
               HILIGHT=UNDERLINE,                                      X01217**1
               LENGTH=8,                                               X01218**1
               POS=(16,52)                                              01219**1
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' ',                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=1,                                               X        
               POS=(16,61)                                                      
****************************************                                01220**1
*  VARIABLE = -CORRECT-UPC-NUMBER      N015                             01221**1
****************************************                                01222**1
ACUPC11  DFHMDF ATTRB=(UNPROT,NUM),                                    X01223**1
               COLOR=GREEN,                                            X01224**1
               HILIGHT=UNDERLINE,                                      X01225**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X01226**1
               LENGTH=15,                                              X01227**1
               POS=(16,63)                                              01228**1
         DFHMDF ATTRB=(ASKIP,DRK),                                     X01229**1
               LENGTH=1,                                               X01230**1
               POS=(16,79)                                              01231**1
*                                                                       01232**1
****************************************                                01233**1
*  VARIABLE = -INVENTORY-LINE-NUM      N011                             01234**1
****************************************                                01235**1
ALINE12  DFHMDF ATTRB=(ASKIP),                                         X01236**4
               JUSTIFY=(LEFT,BLANK),                                   X01237**1
               COLOR=BLUE,                                             X01238**1
               PICOUT='ZZZZZZZ',                                       X01239**1
               LENGTH=7,                                               X01240**1
               POS=(17,02)                                              01241**3
****************************************                                01242**1
*  VARIABLE = -RECORDED-UPC-NUMBE      N015                             01243**1
****************************************                                01244**1
AIUPC12  DFHMDF ATTRB=(ASKIP),                                         X01245**4
               JUSTIFY=(LEFT,BLANK),                                   X01246**1
               COLOR=BLUE,                                             X01247**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X01248**1
               LENGTH=15,                                              X01249**1
               POS=(17,10)                                              01250**8
****************************************                                01265**8
*  VARIABLE = -RECORDED-SKU-NBR      X008                               01266**8
****************************************                                01267**8
AISKU12  DFHMDF ATTRB=(ASKIP),                                         X01268**8
               COLOR=BLUE,                                             X01269**8
               LENGTH=8,                                               X01270**8
               POS=(17,26)                                              01271*10
****************************************                                01272**1
*  VARIABLE = -RECORDED-QUANTITY      N012                              01273**4
****************************************                                01274**1
ARQTY12  DFHMDF ATTRB=(ASKIP),                                         X01275**4
               JUSTIFY=(LEFT,BLANK),                                   X01276**1
               COLOR=BLUE,                                             X01277**1
               PICOUT='ZZZZZ',                                         X01278**1
               LENGTH=5,                                               X01279**1
               POS=(17,37)                                              01280**9
****************************************                                01281**1
*  VARIABLE = -RECORDED-PRICE         N012                              01282**4
****************************************                                01283**1
ARPRI12  DFHMDF ATTRB=(ASKIP),                                         X01284**4
               JUSTIFY=(LEFT,BLANK),                                   X01285**1
               COLOR=BLUE,                                             X01286**1
               PICOUT='ZZZZZ.99',                                      X01287**1
               LENGTH=8,                                               X01288**1
               POS=(17,43)                                              01289**3
****************************************                                01306**1
*  VARIABLE = -CORRECT-SKU-NUMBER      X008                             01307**4
****************************************                                01308**1
ACSKU12  DFHMDF ATTRB=(UNPROT,IC),                                     X01309**4
               COLOR=GREEN,                                            X01310**1
               HILIGHT=UNDERLINE,                                      X01311**1
               LENGTH=8,                                               X01312**1
               POS=(17,52)                                              01313**3
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' ',                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=1,                                               X        
               POS=(17,61)                                                      
****************************************                                01314**1
*  VARIABLE = -CORRECT-UPC-NUMBER      N015                             01315**1
****************************************                                01316**1
ACUPC12  DFHMDF ATTRB=(UNPROT,NUM),                                    X01317**4
               COLOR=GREEN,                                            X01318**1
               HILIGHT=UNDERLINE,                                      X01319**1
               PICOUT='ZZZZZZZZZZZZZZZ',                               X01320**1
               LENGTH=15,                                              X01321**1
               POS=(17,63)                                              01322**3
         DFHMDF ATTRB=(ASKIP,DRK),                                     X01323**1
               LENGTH=1,                                               X01324**1
               POS=(17,79)                                              01325**3
*                                                                       01326**1
****************************************                                01327**2
*  VARIABLE = -INVENTORY-LINE-NUM      N012                             01328**2
****************************************                                01329**2
ALINE13  DFHMDF ATTRB=(ASKIP),                                         X01330**4
               JUSTIFY=(LEFT,BLANK),                                   X01331**2
               COLOR=BLUE,                                             X01332**2
               PICOUT='ZZZZZZZ',                                       X01333**2
               LENGTH=7,                                               X01334**2
               POS=(18,02)                                              01335**3
****************************************                                01336**2
*  VARIABLE = -RECORDED-UPC-NUMBE      N015                             01337**2
****************************************                                01338**2
AIUPC13  DFHMDF ATTRB=(ASKIP),                                         X01339**4
               JUSTIFY=(LEFT,BLANK),                                   X01340**2
               COLOR=BLUE,                                             X01341**2
               PICOUT='ZZZZZZZZZZZZZZZ',                               X01342**2
               LENGTH=15,                                              X01343**2
               POS=(18,10)                                              01344**8
****************************************                                01359**8
*  VARIABLE = -RECORDED-SKU-NBR      X008                               01360**8
****************************************                                01361**8
AISKU13  DFHMDF ATTRB=(ASKIP),                                         X01362**8
               COLOR=BLUE,                                             X01363**8
               LENGTH=8,                                               X01364**8
               POS=(18,26)                                              01365*10
****************************************                                01366**2
*  VARIABLE = -RECORDED-QUANTITY      N013                              01367**4
****************************************                                01368**2
ARQTY13  DFHMDF ATTRB=(ASKIP),                                         X01369**4
               JUSTIFY=(LEFT,BLANK),                                   X01370**2
               COLOR=BLUE,                                             X01371**2
               PICOUT='ZZZZZ',                                         X01372**2
               LENGTH=5,                                               X01373**2
               POS=(18,37)                                              01374**9
****************************************                                01375**2
*  VARIABLE = -RECORDED-PRICE         N013                              01376**4
****************************************                                01377**2
ARPRI13  DFHMDF ATTRB=(ASKIP),                                         X01378**4
               JUSTIFY=(LEFT,BLANK),                                   X01379**2
               COLOR=BLUE,                                             X01380**2
               PICOUT='ZZZZZ.99',                                      X01381**2
               LENGTH=8,                                               X01382**2
               POS=(18,43)                                              01383**3
****************************************                                01400**2
*  VARIABLE = -CORRECT-SKU-NUMBER      X008                             01401**4
****************************************                                01402**2
ACSKU13  DFHMDF ATTRB=(UNPROT,IC),                                     X01403**4
               COLOR=GREEN,                                            X01404**2
               HILIGHT=UNDERLINE,                                      X01405**2
               LENGTH=8,                                               X01406**2
               POS=(18,52)                                              01407**3
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' ',                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=1,                                               X        
               POS=(18,61)                                                      
****************************************                                01408**2
*  VARIABLE = -CORRECT-UPC-NUMBER      N015                             01409**2
****************************************                                01410**2
ACUPC13  DFHMDF ATTRB=(UNPROT,NUM),                                    X01411**4
               COLOR=GREEN,                                            X01412**2
               HILIGHT=UNDERLINE,                                      X01413**2
               PICOUT='ZZZZZZZZZZZZZZZ',                               X01414**2
               LENGTH=15,                                              X01415**2
               POS=(18,63)                                              01416**3
         DFHMDF ATTRB=(ASKIP,DRK),                                     X01417**2
               LENGTH=1,                                               X01418**2
               POS=(18,79)                                              01419**3
*                                                                       01420**2
         DFHMSD TYPE=FINAL                                              01421**1
         END                                                            01422**1
