*          DATA SET INKM001    AT LEVEL 007 AS OF 10/18/93                      
************************************************************            00001   
*                                                                       00002   
*     INKM001                                                           00003   
*                                                                       00004   
*     GENERATED          : 07/23/93 AT 11:18:53 AM                      00005   
*     VERSION            : 2.7.01                                       00006   
*     CSD LEVEL          : 2.7.01                                       00007   
*     AUTHOR             : NEWUSER.                                     00008   
*     INSTALLATION       : KNOWLEDGEWARE, INC.                          00009   
*     ENCYCLOPEDIA       : PHYSICAL INVENTORY                           00010   
*     ENCYCLOPEDIA PATH  : C:\ADW_ENC\MLDE00A\                          00011   
*     MAP DETAILS                                                       00012   
*     LAST UPDATED 07/22/1993 AT 16:11:20 BY TKMA072                    00013   
*-----------------------------------------------------------            00014   
*                                                                       00015   
*  BMS MAPSET :  IN001A                                                 00016   
*      MAP    :  INKM001                                                00017   
************************************************************            00018   
         PRINT  NOGEN                                                   00019   
INKM001  DFHMSD TYPE=DSECT,                                            X00020   
               LANG=COBOL,                                             X00021   
               CTRL=(FREEKB),                                          X00022   
               MODE=INOUT,                                             X00023   
               TERM=3270-2,                                            X00024   
               TIOAPFX=YES,                                            X00025   
               STORAGE=AUTO                                             00026   
IN001A   DFHMDI LINE=2,COLUMN=1,                                       X00027   
               SIZE=(19,80),                                           X00028   
               MAPATTS=(COLOR,HILIGHT),                                X00029   
               DSATTS=(COLOR,HILIGHT)                                   00030   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00031   
*                                                                       00032   
*  SCREEN LINE 03                                                       00033**5
*                                                                       00034   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00035   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00036   
               INITIAL='ENTER AREA NUMBER OR ASTERISKS',               X00037**5
               COLOR=NEUTRAL,                                          X00038   
               LENGTH=30,                                              X00039**5
               POS=(03,02)                                              00040**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00041**5
*                                                                       00042**5
*  SCREEN LINE 05                                                       00043**5
*                                                                       00044**5
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00045**5
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00046**5
               INITIAL='STORE..........:',                             X00047**5
               COLOR=NEUTRAL,                                          X00048**5
               LENGTH=16,                                              X00049**5
               POS=(05,20)                                              00050**5
****************************************                                00051   
*  VARIABLE = ASTORE      N004                                          00052   
****************************************                                00053   
ASTORE   DFHMDF ATTRB=(ASKIP,NUM),                                     X00054**7
               COLOR=BLUE,                                             X00055   
               LENGTH=4,                                               X00056   
               POS=(05,37)                                              00057   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00058   
               POS=(05,42),                                            X00059   
               INITIAL=' ',                                            X00060   
               LENGTH=1                                                 00061   
ASTRNAM  DFHMDF ATTRB=(ASKIP),                                         X00062   
               COLOR=BLUE,                                             X00063   
               LENGTH=25,                                              X00064   
               POS=(05,44)                                              00065   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00066   
*                                                                       00067   
*  SCREEN LINE 06                                                       00068   
*                                                                       00069   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00070   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00071   
               POS=(06,1),                                             X00072   
               INITIAL=' ',                                            X00073   
               LENGTH=1                                                 00074   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00075   
*                                                                       00076   
*  SCREEN LINE 07                                                       00077   
*                                                                       00078   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00079   
         DFHMDF ATTRB=(ASKIP),                                         X00080   
               POS=(07,1),                                             X00081   
               INITIAL=' ',                                            X00082   
               LENGTH=1                                                 00083   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00084   
               INITIAL='AREA...........:',                             X00085**3
               COLOR=NEUTRAL,                                          X00086   
               LENGTH=16,                                              X00087**3
               POS=(07,20)                                              00088**3
****************************************                                00089   
*  VARIABLE = AAREA      N006                                           00090   
****************************************                                00091   
AAREA    DFHMDF ATTRB=(UNPROT,IC),                                     X00092**7
               COLOR=GREEN,                                            X00093   
               HILIGHT=UNDERLINE,                                      X00094   
               LENGTH=6,                                               X00095   
               POS=(07,37)                                              00096   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00097   
               INITIAL=' ',                                            X00098   
               LENGTH=1,                                               X00099   
               POS=(07,44)                                              00100   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00101   
*                                                                       00102   
*  SCREEN LINE 08                                                       00103   
*                                                                       00104   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00105   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00106   
               POS=(08,1),                                             X00107   
               INITIAL=' ',                                            X00108   
               LENGTH=1                                                 00109   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00110   
*                                                                       00111   
*  SCREEN LINE 09                                                       00112   
*                                                                       00113   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00114   
         DFHMDF ATTRB=(ASKIP),                                         X00115   
               POS=(09,1),                                             X00116   
               INITIAL=' ',                                            X00117   
               LENGTH=1                                                 00118   
         DFHMDF ATTRB=(PROT,BRT),                                      X00119   
               INITIAL='COMPLETED',                                    X00120   
               COLOR=NEUTRAL,                                          X00121   
               LENGTH=9,                                               X00122   
               POS=(09,20)                                              00123**3
         DFHMDF ATTRB=(PROT,BRT),                                      X00124   
               INITIAL='AREAS:',                                       X00125**3
               COLOR=NEUTRAL,                                          X00126   
               LENGTH=6,                                               X00127**3
               POS=(09,30)                                              00128**3
****************************************                                00129   
*  VARIABLE = AREACMP      X001                                         00130   
****************************************                                00131   
AREACMP  DFHMDF ATTRB=(UNPROT),                                        X00132   
               COLOR=GREEN,                                            X00133   
               HILIGHT=UNDERLINE,                                      X00134   
               LENGTH=1,                                               X00135   
               POS=(09,37)                                              00136   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00137   
               INITIAL=' ',                                            X00138   
               LENGTH=1,                                               X00139   
               POS=(09,39)                                              00140   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00141   
*                                                                       00142   
*  SCREEN LINE 10                                                       00143   
*                                                                       00144   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00145   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00146   
               POS=(10,1),                                             X00147   
               INITIAL=' ',                                            X00148   
               LENGTH=1                                                 00149   
         DFHMSD TYPE=FINAL                                              00150   
         END                                                            00151   
