*          DATA SET INKM056    AT LEVEL 009 AS OF 03/28/94                      
*          DATA SET INKM056    AT LEVEL 013 AS OF 11/28/93              00001   
  PRINT  NOGEN                                                          00002   
************************************************************            00003   
*                                                                       00004   
*  AACYY - INKM056                                                      00005   
*                                                                       00006   
*     GENERATED          : 09/29/93 AT 08:49:16 AM                      00007   
*     VERSION            : 2.7.01                                       00008   
*     CSD LEVEL          : 2.7.01                                       00009   
*     AUTHOR             : TKMA072.                                     00010   
*     INSTALLATION       : KNOWLEDGEWARE, INC.                          00011   
*     ENCYCLOPEDIA       : PHYSICAL INVENTORY                           00056   
*     ENCYCLOPEDIA PATH  : C:\ADW_ENC\MLDE00A\                          00013   
*     MAP DETAILS                                                       00014   
*     LAST UPDATED 11/11/2002 AT 14:26:34 BY TK20917                    00015   
*-----------------------------------------------------------            00016   
*                                                                       00017   
* 11/30/2003 - ABILITY TO PROCESS ADJUSTMENTS VIA SKU OR UPC.           00017   
*              EXPAND SKU FIELD TO X(15) TO ALLOW SKU OR UPC ENTRY.             
*-----------------------------------------------------------            00016   
*  BMS MAPSET :  INKM056                                                00018   
*      MAP    :  IN056A                                                 00019   
************************************************************            00020   
INKM056  DFHMSD TYPE=DSECT,                                            X00021   
               LANG=COBOL,                                             X00022   
               CTRL=(FREEKB),                                          X00023   
               MODE=INOUT,                                             X00024   
               TERM=3270-2,                                            X00025   
               TIOAPFX=YES,                                            X00026   
               STORAGE=AUTO                                             00027   
IN056A   DFHMDI LINE=2,COLUMN=1,                                       X00028   
               SIZE=(19,80),                                           X00029   
               MAPATTS=(COLOR,HILIGHT),                                X00030   
               DSATTS=(COLOR,HILIGHT)                                   00031   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 02                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00037   
               INITIAL='FOR',                                          X00038   
               COLOR=NEUTRAL,                                          X00039   
               LENGTH=3,                                               X00040   
               POS=(02,26)                                              00041   
ASTRNBR  DFHMDF ATTRB=(ASKIP),                                         X00042   
               COLOR=BLUE,                                             X00043   
               LENGTH=04,                                              X00044   
               POS=(02,30)                                              00045   
ASTRNAM  DFHMDF ATTRB=(ASKIP),                                         X00042   
               COLOR=BLUE,                                             X00043   
               LENGTH=20,                                              X00044   
               POS=(02,35)                                              00045   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 03                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00051   
               INITIAL='ORIGINAL:',                                    X00052   
               COLOR=NEUTRAL,                                          X00053   
               LENGTH=9,                                               X00054   
               POS=(03,2)                                               00055   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00056   
*                                                                       00057   
*  SCREEN LINE 04                                                       00058   
*                                                                       00059   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00060   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00061   
               INITIAL='AREA',                                         X00062   
               COLOR=NEUTRAL,                                          X00063   
               LENGTH=4,                                               X00064   
               POS=(04,3)                                               00065   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00066   
               INITIAL='  SKU    ',                                    X00067   
               COLOR=NEUTRAL,                                          X00068   
               LENGTH=9,                                               X00069   
               POS=(04,13)                                              00070   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00071   
               INITIAL='    QTY ',                                     X00072   
               COLOR=NEUTRAL,                                          X00073   
               LENGTH=8,                                               X00074   
               POS=(04,27)                                              00075   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00076   
               INITIAL='PRICE',                                        X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=5,                                               X00079   
               POS=(04,40)                                              00080**4
         DFHMDF ATTRB=(PROT,BRT),                                      X00081   
               INITIAL='EXTENDED',                                     X00082   
               COLOR=NEUTRAL,                                          X00083   
               LENGTH=8,                                               X00084   
               POS=(04,51)                                              00085**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00086   
               INITIAL='REASON',                                       X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=6,                                               X00089   
               POS=(04,64)                                              00090   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00091   
*                                                                       00092   
*  SCREEN LINE 05                                                       00093   
*                                                                       00094   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00095   
****************************************                                00096   
*  VARIABLE = AAREA      N006                                           00097   
****************************************                                00098   
AAREA    DFHMDF ATTRB=(ASKIP),                                         X00099   
               JUSTIFY=(LEFT,BLANK),                                   X00100   
               COLOR=BLUE,                                             X00101   
               PICOUT='ZZZZZZ',                                        X00102   
               LENGTH=6,                                               X00103   
               POS=(05,2)                                               00104   
****************************************                                00119   
*  VARIABLE = -CORRECT-SKU-NUMBER      X015                             00120   
****************************************                                00121   
ASKU     DFHMDF ATTRB=(ASKIP),                                         X00122   
               JUSTIFY=(LEFT,BLANK),                                   X00134   
               PICOUT='XXXXXXXXXXXXXXX',                               X00136   
               COLOR=BLUE,                                             X00123   
               LENGTH=15,                                              X00124   
               POS=(05,10)                                              00125   
****************************************                                00130   
*  VARIABLE = -CORRECT-QUANTITY      N007                               00131   
****************************************                                00132   
AQTY     DFHMDF ATTRB=(ASKIP),                                         X00133   
               JUSTIFY=(LEFT,BLANK),                                   X00134   
               COLOR=BLUE,                                             X00135   
               PICOUT='------9',                                       X00136   
               LENGTH=7,                                               X00137   
               POS=(05,27)                                              00138   
****************************************                                00139   
*  VARIABLE = -CORRECT-UNIT-PRICE      N00702                           00140   
****************************************                                00141   
APRICE   DFHMDF ATTRB=(ASKIP),                                         X00142   
               JUSTIFY=(LEFT,BLANK),                                   X00143   
               COLOR=BLUE,                                             X00144   
               PICOUT='ZZZZZZZ.99',                                    X00145   
               LENGTH=10,                                              X00146   
               POS=(05,35)                                              00147   
****************************************                                00148   
*  VARIABLE = AEXTPRI      N00502                                       00149   
****************************************                                00150   
AEXTPRI  DFHMDF ATTRB=(ASKIP),                                         X00151   
               JUSTIFY=(LEFT,BLANK),                                   X00152   
               COLOR=BLUE,                                             X00153   
               PICOUT='----------.99',                                 X00154**7
               LENGTH=13,                                              X00155**7
               POS=(05,46)                                              00156**7
****************************************                                00157   
*  VARIABLE = ADJUSTMENT-REASON-T      X020                             00158   
****************************************                                00159   
AREASON  DFHMDF ATTRB=(ASKIP),                                         X00160   
               COLOR=BLUE,                                             X00161   
               LENGTH=15,                                              X00162   
               POS=(05,60)                                              00163**6
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               INITIAL=' ',                                            X00087   
               LENGTH=1,                                               X00089   
               POS=(05,79)                                              00090   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00164   
*                                                                       00165   
*  SCREEN LINE 06                                                       00166   
*                                                                       00167   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00168   
         DFHMDF ATTRB=(PROT,BRT),                                      X00169   
               INITIAL='PREVIOUS',                                     X00170   
               COLOR=NEUTRAL,                                          X00171   
               LENGTH=8,                                               X00172   
               POS=(06,1)                                               00173   
         DFHMDF ATTRB=(PROT,BRT),                                      X00174   
               INITIAL='ADJUSTMENTS:',                                 X00175   
               COLOR=NEUTRAL,                                          X00176   
               LENGTH=12,                                              X00177   
               POS=(06,10)                                              00178   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00179   
*                                                                       00180   
*  SCREEN LINE 07                                                       00181   
*                                                                       00182   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00183   
****************************************                                00184   
*  VARIABLE = AUSERID      X008                                         00185   
****************************************                                00186   
AUSER01  DFHMDF ATTRB=(ASKIP),                                         X00187   
               COLOR=BLUE,                                             X00188   
               LENGTH=8,                                               X00189   
               POS=(07,2)                                               00190   
****************************************                                00191   
*  VARIABLE = AADJDTE      X008                                         00192   
****************************************                                00193   
ADJDT01  DFHMDF ATTRB=(ASKIP),                                         X00194   
               COLOR=BLUE,                                             X00195   
               LENGTH=8,                                               X00196   
               POS=(07,12)                                              00197   
****************************************                                00198   
*  VARIABLE = APQTY      N007                                           00199   
****************************************                                00200   
ADJQT01  DFHMDF ATTRB=(ASKIP),                                         X00201   
               JUSTIFY=(LEFT,BLANK),                                   X00202   
               COLOR=BLUE,                                             X00203   
               PICOUT='ZZZZZZZ',                                       X00204   
               LENGTH=7,                                               X00205   
               POS=(07,27)                                              00206   
****************************************                                00207   
*  VARIABLE = APPRICE      N00502                                       00208   
****************************************                                00209   
ADJPR01  DFHMDF ATTRB=(ASKIP),                                         X00210   
               JUSTIFY=(LEFT,BLANK),                                   X00211   
               COLOR=BLUE,                                             X00212   
               PICOUT='ZZZZZ.99',                                      X00213   
               LENGTH=8,                                               X00214   
               POS=(07,37)                                              00215   
****************************************                                00216   
*  VARIABLE = APEXTPR      N00502                                       00217   
****************************************                                00218   
ADJEX01  DFHMDF ATTRB=(ASKIP),                                         X00219   
               JUSTIFY=(LEFT,BLANK),                                   X00220   
               COLOR=BLUE,                                             X00221   
               PICOUT='----------.99',                                 X00222**7
               LENGTH=13,                                              X00223**7
               POS=(07,46)                                              00224**7
****************************************                                00225   
*  VARIABLE = APREASN      X020                                         00226   
****************************************                                00227   
ADJRE01  DFHMDF ATTRB=(ASKIP),                                         X00228   
               COLOR=BLUE,                                             X00229   
               LENGTH=20,                                              X00230   
               POS=(07,60)                                              00231**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00232   
*                                                                       00233   
*  SCREEN LINE 08                                                       00234   
*                                                                       00235   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00236   
****************************************                                00237   
*  VARIABLE = AUSERID      X008                                         00238   
****************************************                                00239   
AUSER02  DFHMDF ATTRB=(ASKIP),                                         X00240   
               COLOR=BLUE,                                             X00241   
               LENGTH=8,                                               X00242   
               POS=(08,2)                                               00243   
****************************************                                00244   
*  VARIABLE = AADJDTE      X008                                         00245   
****************************************                                00246   
ADJDT02  DFHMDF ATTRB=(ASKIP),                                         X00247   
               COLOR=BLUE,                                             X00248   
               LENGTH=8,                                               X00249   
               POS=(08,12)                                              00250   
****************************************                                00251   
*  VARIABLE = APQTY      N007                                           00252   
****************************************                                00253   
ADJQT02  DFHMDF ATTRB=(ASKIP),                                         X00254   
               JUSTIFY=(LEFT,BLANK),                                   X00255   
               COLOR=BLUE,                                             X00256   
               PICOUT='ZZZZZZZ',                                       X00257   
               LENGTH=7,                                               X00258   
               POS=(08,27)                                              00259   
****************************************                                00260   
*  VARIABLE = APPRICE      N00502                                       00261   
****************************************                                00262   
ADJPR02  DFHMDF ATTRB=(ASKIP),                                         X00263   
               JUSTIFY=(LEFT,BLANK),                                   X00264   
               COLOR=BLUE,                                             X00265   
               PICOUT='ZZZZZ.99',                                      X00266   
               LENGTH=8,                                               X00267   
               POS=(08,37)                                              00268   
****************************************                                00269   
*  VARIABLE = APEXTPR      N00502                                       00270   
****************************************                                00271   
ADJEX02  DFHMDF ATTRB=(ASKIP),                                         X00272   
               JUSTIFY=(LEFT,BLANK),                                   X00273   
               COLOR=BLUE,                                             X00274   
               PICOUT='----------.99',                                 X00275**7
               LENGTH=13,                                              X00276**7
               POS=(08,46)                                              00277**7
****************************************                                00278   
*  VARIABLE = APREASN      X020                                         00279   
****************************************                                00280   
ADJRE02  DFHMDF ATTRB=(ASKIP),                                         X00281**4
               COLOR=BLUE,                                             X00282   
               LENGTH=20,                                              X00283   
               POS=(08,60)                                              00284**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00285   
*                                                                       00286   
*  SCREEN LINE 09                                                       00287   
*                                                                       00288   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00289   
****************************************                                00290   
*  VARIABLE = AUSERID      X008                                         00291   
****************************************                                00292   
AUSER03  DFHMDF ATTRB=(ASKIP),                                         X00293   
               COLOR=BLUE,                                             X00294   
               LENGTH=8,                                               X00295   
               POS=(09,2)                                               00296   
****************************************                                00297   
*  VARIABLE = AADJDTE      X008                                         00298   
****************************************                                00299   
ADJDT03  DFHMDF ATTRB=(ASKIP),                                         X00300   
               COLOR=BLUE,                                             X00301   
               LENGTH=8,                                               X00302   
               POS=(09,12)                                              00303   
****************************************                                00304   
*  VARIABLE = APQTY      N007                                           00305   
****************************************                                00306   
ADJQT03  DFHMDF ATTRB=(ASKIP),                                         X00307   
               JUSTIFY=(LEFT,BLANK),                                   X00308   
               COLOR=BLUE,                                             X00309   
               PICOUT='ZZZZZZZ',                                       X00310   
               LENGTH=7,                                               X00311   
               POS=(09,27)                                              00312   
****************************************                                00313   
*  VARIABLE = APPRICE      N00502                                       00314   
****************************************                                00315   
ADJPR03  DFHMDF ATTRB=(ASKIP),                                         X00316   
               JUSTIFY=(LEFT,BLANK),                                   X00317   
               COLOR=BLUE,                                             X00318   
               PICOUT='ZZZZZ.99',                                      X00319   
               LENGTH=8,                                               X00320   
               POS=(09,37)                                              00321   
****************************************                                00322   
*  VARIABLE = APEXTPR      N00502                                       00323   
****************************************                                00324   
ADJEX03  DFHMDF ATTRB=(ASKIP),                                         X00325   
               JUSTIFY=(LEFT,BLANK),                                   X00326   
               COLOR=BLUE,                                             X00327   
               PICOUT='----------.99',                                 X00328**7
               LENGTH=13,                                              X00329**7
               POS=(09,46)                                              00330**7
****************************************                                00331   
*  VARIABLE = APREASN      X020                                         00332   
****************************************                                00333   
ADJRE03  DFHMDF ATTRB=(ASKIP),                                         X00334**4
               COLOR=BLUE,                                             X00335   
               LENGTH=20,                                              X00336   
               POS=(09,60)                                              00337**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00338   
*                                                                       00339   
*  SCREEN LINE 10                                                       00340   
*                                                                       00341   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00342   
****************************************                                00343   
*  VARIABLE = AUSERID      X008                                         00344   
****************************************                                00345   
AUSER04  DFHMDF ATTRB=(ASKIP),                                         X00346   
               COLOR=BLUE,                                             X00347   
               LENGTH=8,                                               X00348   
               POS=(10,2)                                               00349   
****************************************                                00350   
*  VARIABLE = AADJDTE      X008                                         00351   
****************************************                                00352   
ADJDT04  DFHMDF ATTRB=(ASKIP),                                         X00353   
               COLOR=BLUE,                                             X00354   
               LENGTH=8,                                               X00355   
               POS=(10,12)                                              00356   
****************************************                                00357   
*  VARIABLE = APQTY      N007                                           00358   
****************************************                                00359   
ADJQT04  DFHMDF ATTRB=(ASKIP),                                         X00360   
               JUSTIFY=(LEFT,BLANK),                                   X00361   
               COLOR=BLUE,                                             X00362   
               PICOUT='ZZZZZZZ',                                       X00363   
               LENGTH=7,                                               X00364   
               POS=(10,27)                                              00365   
****************************************                                00366   
*  VARIABLE = APPRICE      N00502                                       00367   
****************************************                                00368   
ADJPR04  DFHMDF ATTRB=(ASKIP),                                         X00369   
               JUSTIFY=(LEFT,BLANK),                                   X00370   
               COLOR=BLUE,                                             X00371   
               PICOUT='ZZZZZ.99',                                      X00372   
               LENGTH=8,                                               X00373   
               POS=(10,37)                                              00374   
****************************************                                00375   
*  VARIABLE = APEXTPR      N00502                                       00376   
****************************************                                00377   
ADJEX04  DFHMDF ATTRB=(ASKIP),                                         X00378   
               JUSTIFY=(LEFT,BLANK),                                   X00379   
               COLOR=BLUE,                                             X00380   
               PICOUT='----------.99',                                 X00381**7
               LENGTH=13,                                              X00382**7
               POS=(10,46)                                              00383**7
****************************************                                00384   
*  VARIABLE = APREASN      X020                                         00385   
****************************************                                00386   
ADJRE04  DFHMDF ATTRB=(ASKIP),                                         X00387**4
               COLOR=BLUE,                                             X00388   
               LENGTH=20,                                              X00389   
               POS=(10,60)                                              00390**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00391   
*                                                                       00392   
*  SCREEN LINE 11                                                       00393   
*                                                                       00394   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00395   
****************************************                                00396   
*  VARIABLE = AUSERID      X008                                         00397   
****************************************                                00398   
AUSER05  DFHMDF ATTRB=(ASKIP),                                         X00399   
               COLOR=BLUE,                                             X00400   
               LENGTH=8,                                               X00401   
               POS=(11,2)                                               00402   
****************************************                                00403   
*  VARIABLE = AADJDTE      X008                                         00404   
****************************************                                00405   
ADJDT05  DFHMDF ATTRB=(ASKIP),                                         X00406   
               COLOR=BLUE,                                             X00407   
               LENGTH=8,                                               X00408   
               POS=(11,12)                                              00409   
****************************************                                00410   
*  VARIABLE = APQTY      N007                                           00411   
****************************************                                00412   
ADJQT05  DFHMDF ATTRB=(ASKIP),                                         X00413   
               JUSTIFY=(LEFT,BLANK),                                   X00414   
               COLOR=BLUE,                                             X00415   
               PICOUT='ZZZZZZZ',                                       X00416   
               LENGTH=7,                                               X00417   
               POS=(11,27)                                              00418   
****************************************                                00419   
*  VARIABLE = APPRICE      N00502                                       00420   
****************************************                                00421   
ADJPR05  DFHMDF ATTRB=(ASKIP),                                         X00422   
               JUSTIFY=(LEFT,BLANK),                                   X00423   
               COLOR=BLUE,                                             X00424   
               PICOUT='ZZZZZ.99',                                      X00425   
               LENGTH=8,                                               X00426   
               POS=(11,37)                                              00427   
****************************************                                00428   
*  VARIABLE = AP XTPR      N00502                                       00429   
****************************************                                00430   
ADJEX05  DFHMDF ATTRB=(ASKIP),                                         X00431   
               JUSTIFY=(LEFT,BLANK),                                   X00432   
               COLOR=BLUE,                                             X00433   
               PICOUT='----------.99',                                 X00434**7
               LENGTH=13,                                              X00435**7
               POS=(11,46)                                              00436**7
****************************************                                00437   
*  VARIABLE = APREASN      X020                                         00438   
****************************************                                00439   
ADJRE05  DFHMDF ATTRB=(ASKIP),                                         X00440**4
               COLOR=BLUE,                                             X00441   
               LENGTH=20,                                              X00442   
               POS=(11,60)                                              00443**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00444   
*                                                                       00445   
*  SCREEN LINE 12                                                       00446   
*                                                                       00447   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00448   
****************************************                                00449   
*  VARIABLE = AUSERID      X008                                         00450   
****************************************                                00451   
AUSER06  DFHMDF ATTRB=(ASKIP),                                         X00452   
               COLOR=BLUE,                                             X00453   
               LENGTH=8,                                               X00454   
               POS=(12,2)                                               00455   
****************************************                                00456   
*  VARIABLE = AADJDTE      X008                                         00457   
****************************************                                00458   
ADJDT06  DFHMDF ATTRB=(ASKIP),                                         X00459   
               COLOR=BLUE,                                             X00460   
               LENGTH=8,                                               X00461   
               POS=(12,12)                                              00462   
****************************************                                00463   
*  VARIABLE = APQTY      N007                                           00464   
****************************************                                00465   
ADJQT06  DFHMDF ATTRB=(ASKIP),                                         X00466   
               JUSTIFY=(LEFT,BLANK),                                   X00467   
               COLOR=BLUE,                                             X00468   
               PICOUT='ZZZZZZZ',                                       X00469   
               LENGTH=7,                                               X00470   
               POS=(12,27)                                              00471   
****************************************                                00472   
*  VARIABLE = APPRICE      N00502                                       00473   
****************************************                                00474   
ADJPR06  DFHMDF ATTRB=(ASKIP),                                         X00475   
               JUSTIFY=(LEFT,BLANK),                                   X00476   
               COLOR=BLUE,                                             X00477   
               PICOUT='ZZZZZ.99',                                      X00478   
               LENGTH=8,                                               X00479   
               POS=(12,37)                                              00480   
****************************************                                00481   
*  VARIABLE = APEXTPR      N00502                                       00482   
****************************************                                00483   
ADJEX06  DFHMDF ATTRB=(ASKIP),                                         X00484   
               JUSTIFY=(LEFT,BLANK),                                   X00485   
               COLOR=BLUE,                                             X00486   
               PICOUT='----------.99',                                 X00487**7
               LENGTH=13,                                              X00488**7
               POS=(12,46)                                              00489**7
****************************************                                00490   
*  VARIABLE = APREASN      X020                                         00491   
****************************************                                00492   
ADJRE06  DFHMDF ATTRB=(ASKIP),                                         X00493**4
               COLOR=BLUE,                                             X00494   
               LENGTH=20,                                              X00495   
               POS=(12,60)                                              00496**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00497   
*                                                                       00498   
*  SCREEN LINE 13                                                       00499   
*                                                                       00500   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00501   
         DFHMDF ATTRB=(ASKIP),                                         X00502   
               INITIAL='--------------------------------',             X00503**7
               COLOR=NEUTRAL,                                          X00504   
               LENGTH=30,                                              X00505**7
               POS=(13,29)                                              00506**4
****************************************                                00507   
*  VARIABLE = ATOTQTY      N007                                         00508   
****************************************                                00509   
ATOTQTY  DFHMDF ATTRB=(ASKIP),                                         X00510   
               JUSTIFY=(LEFT,BLANK),                                   X00511   
               COLOR=BLUE,                                             X00512   
               PICOUT='-----9',                                        X00513   
               LENGTH=6,                                               X00514   
               POS=(14,28)                                              00515   
****************************************                                00516   
*  VARIABLE = ATOTPRI      N00502                                       00517   
****************************************                                00518   
ATOTPRI  DFHMDF ATTRB=(ASKIP),                                         X00519   
               JUSTIFY=(LEFT,BLANK),                                   X00520   
               COLOR=BLUE,                                             X00521   
               PICOUT='-----.99',                                      X00522   
               LENGTH=8,                                               X00523   
               POS=(14,37)                                              00524   
****************************************                                00525   
*  VARIABLE = ATOTEXT      N00502                                       00526   
****************************************                                00527   
ATOTEXT  DFHMDF ATTRB=(ASKIP),                                         X00528   
               JUSTIFY=(LEFT,BLANK),                                   X00529   
               COLOR=BLUE,                                             X00530   
               PICOUT='----------.99',                                 X00531**7
               LENGTH=13,                                              X00532**7
               POS=(14,46)                                              00533**7
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00534   
*                                                                       00535   
*  SCREEN LINE 15                                                       00536   
*                                                                       00537   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00538   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00539   
               INITIAL='CURRENT',                                      X00540   
               COLOR=NEUTRAL,                                          X00541   
               LENGTH=7,                                               X00542   
               POS=(15,2)                                               00543   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00544   
               INITIAL='ADJUSTMENT:',                                  X00545   
               COLOR=NEUTRAL,                                          X00546   
               LENGTH=11,                                              X00547   
               POS=(15,10)                                              00548   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00549   
*                                                                       00550   
*  SCREEN LINE 16                                                       00551   
*                                                                       00552   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00553   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00539   
               INITIAL='SKU',                                          X00540   
               COLOR=NEUTRAL,                                          X00541   
               LENGTH=3,                                               X00542   
               POS=(16,4)                                               00543   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00544   
               INITIAL='UPC NUMBER',                                   X00545   
               COLOR=NEUTRAL,                                          X00546   
               LENGTH=10,                                              X00547   
               POS=(16,10)                                              00548   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00549   
*                                                                       00550   
*  SCREEN LINE 17                                                       00551   
*                                                                       00552   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00553   
****************************************                                00577   
*  VARIABLE = ANSKU      X008                                           00578   
****************************************                                00579   
ANSKU    DFHMDF ATTRB=(ASKIP),                                         X00580   
               COLOR=BLUE,                                             X00581   
               LENGTH=8,                                               X00582   
               POS=(17,1)                                               00583   
****************************************                                00577   
*  VARIABLE = ANUPC         N015                                        00578   
****************************************                                00579   
ANUPC    DFHMDF ATTRB=(ASKIP),                                         X00580   
               JUSTIFY=(RIGHT,BLANK),                                  X00592   
               COLOR=BLUE,                                             X00581   
               LENGTH=15,                                              X00582   
               POS=(17,10)                                              00583   
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               INITIAL=' ',                                            X00087   
               LENGTH=1,                                               X00089   
               POS=(17,26)                                              00090   
****************************************                                00588   
*  VARIABLE = ANADJQT      N007                                         00589   
****************************************                                00590   
ANADJQT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00591   
               JUSTIFY=(LEFT,BLANK),                                   X00592   
               COLOR=GREEN,                                            X00593   
               HILIGHT=UNDERLINE,                                      X00594   
               PICOUT='------',                                        X00595**8
               LENGTH=6,                                               X00596**8
               POS=(17,28)                                              00597**8
         DFHMDF ATTRB=(ASKIP),                                         X00598   
               POS=(17,35),                                            X00599   
               INITIAL=' ',                                            X00600   
               LENGTH=1                                                 00601   
****************************************                                00602   
*  VARIABLE = ANADJPR      N00502                                       00603   
****************************************                                00604   
ANADJPR  DFHMDF ATTRB=(UNPROT,NUM),                                    X00605   
               JUSTIFY=(LEFT,BLANK),                                   X00606   
               COLOR=GREEN,                                            X00607   
               HILIGHT=UNDERLINE,                                      X00608   
               PICOUT='ZZZZZ.ZZ',                                      X00609   
               LENGTH=8,                                               X00610   
               POS=(17,37)                                              00611   
         DFHMDF ATTRB=(ASKIP),                                         X00612   
               POS=(17,46),                                            X00613**7
               INITIAL=' ',                                            X00614   
               LENGTH=1                                                 00615   
****************************************                                00616   
*  VARIABLE = ANADJPR      N00502                                       00617   
****************************************                                00618   
ANREASN  DFHMDF ATTRB=(UNPROT),                                        X00619   
               JUSTIFY=(LEFT,BLANK),                                   X00620   
               COLOR=GREEN,                                            X00621   
               HILIGHT=UNDERLINE,                                      X00622   
               LENGTH=20,                                              X00623   
               POS=(17,60)                                              00624**6
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00625**5
               LENGTH=1,                                               X00626**5
               POS=(18,1)                                               00627**5
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00628   
*                                                                       00629   
*  SCREEN LINE 19                                                       00630   
*                                                                       00631   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00632   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00633   
               INITIAL='ACTUAL ADJUSTMENT:',                           X00634   
               COLOR=NEUTRAL,                                          X00635   
               LENGTH=18,                                              X00636   
               POS=(19,2)                                               00637   
****************************************                                00638   
*  VARIABLE = ANADJQT      N007                                         00639   
****************************************                                00640   
ADADJQT  DFHMDF ATTRB=(ASKIP),                                         X00641   
               JUSTIFY=(LEFT,BLANK),                                   X00642   
               COLOR=BLUE,                                             X00643   
               PICOUT='-------',                                       X00644   
               LENGTH=7,                                               X00645   
               POS=(19,27)                                              00646   
****************************************                                00647   
*  VARIABLE = ANADJPR      N00502                                       00648   
****************************************                                00649   
ADADJPR  DFHMDF ATTRB=(ASKIP),                                         X00650   
               JUSTIFY=(LEFT,BLANK),                                   X00651   
               COLOR=BLUE,                                             X00652   
               PICOUT='------.--',                                     X00653   
               LENGTH=9,                                               X00654   
               POS=(19,36)                                              00655   
****************************************                                00656   
*  VARIABLE = ANEXTPR      N00502                                       00657   
****************************************                                00658   
ADEXTPR  DFHMDF ATTRB=(ASKIP),                                         X00659   
               JUSTIFY=(LEFT,BLANK),                                   X00660   
               COLOR=BLUE,                                             X00661   
               PICOUT='----------.--',                                 X00662**9
               LENGTH=13,                                              X00663**7
               POS=(19,46)                                              00664**7
         DFHMSD TYPE=FINAL                                              00665   
         END                                                            00666   
