*          DATA SET INKM024    AT LEVEL 002 AS OF 10/04/93                      
  PRINT  NOGEN                                                          00001   
************************************************************            00002   
*                                                                       00003   
*  AACYY - INKM024                                                      00004   
*                                                                       00005   
*     GENERATED          : 07/30/93 AT 09:48:23 AM                      00006   
*     VERSION            : 2.7.01                                       00007   
*     CSD LEVEL          : 2.7.01                                       00008   
*     AUTHOR             : NEWUSER.                                     00009   
*     INSTALLATION       : KNOWLEDGEWARE, INC.                          00010   
*     ENCYCLOPEDIA       : PHYSICAL INVENTORY                           00011   
*     ENCYCLOPEDIA PATH  : C:\ADW_ENC\MLDE00A\                          00012   
*     MAP DETAILS                                                       00013   
*     LAST UPDATED 10/25/2002 AT 09:25:09 BY TK22400                    00014   
*                                  CHG ID:W21732                                
*-----------------------------------------------------------            00015   
*                                                                       00016   
*  BMS MAPSET :  INKM024                                                00017   
*      MAP    :  IN024A                                                 00018   
************************************************************            00019   
INKM024  DFHMSD TYPE=DSECT,                                            X00020   
               CTRL=(FREEKB),                                          X00021   
               TERM=3270-2,                                            X00022   
               LANG=COBOL,                                             X00023   
               MODE=INOUT,                                             X00024   
               TIOAPFX=YES,                                            X00025   
               STORAGE=AUTO                                             00026   
IN024A   DFHMDI LINE=2,                                                X00027   
               COLUMN=1,                                               X00028   
               SIZE=(19,80),                                           X00029   
               MAPATTS=(COLOR,HILIGHT),                                X00030   
               DSATTS=(COLOR,HILIGHT)                                   00031   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 02                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00037   
               INITIAL='FOR',                                          X00038   
               COLOR=NEUTRAL,                                          X00039   
               LENGTH=3,                                               X00040   
               POS=(01,32)                                              00041   
****************************************                                00042   
*  VARIABLE = NAME      N004                                            00043   
****************************************                                00044   
ASTRNBR  DFHMDF ATTRB=(ASKIP),                                         X00045   
               COLOR=BLUE,                                             X00046   
               LENGTH=4,                                               X00047   
               POS=(01,36)                                              00048   
****************************************                                00042   
*  VARIABLE = NAME      X025                                            00043   
****************************************                                00044   
ASTNAME  DFHMDF ATTRB=(ASKIP),                                         X00045   
               COLOR=BLUE,                                             X00046   
               LENGTH=25,                                              X00047   
               POS=(01,41)                                              00048   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00049   
*                                                                       00050   
*  SCREEN LINE 03                                                       00051   
*                                                                       00052   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00053   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00054   
               INITIAL='SHEET',                                        X00055   
               COLOR=NEUTRAL,                                          X00056   
               LENGTH=5,                                               X00057   
               POS=(02,3)                                               00058   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00059   
               INITIAL='NUMBER:',                                      X00060   
               COLOR=NEUTRAL,                                          X00061   
               LENGTH=7,                                               X00062   
               POS=(02,9)                                               00063   
****************************************                                00064   
*  VARIABLE = -SHEET-NUMBER      N007                                   00065   
****************************************                                00066   
ASHEET   DFHMDF ATTRB=(ASKIP),                                         X00067   
               JUSTIFY=(LEFT,BLANK),                                   X00068   
               COLOR=BLUE,                                             X00069   
               PICOUT='ZZZZZZ',                                        X00070   
               LENGTH=6,                                               X00071   
               POS=(02,17)                                              00072   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00073   
*                                                                       00074   
*  SCREEN LINE 04                                                       00075   
*                                                                       00076   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00077   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00078   
               INITIAL='SKU',                                          X00079**2
               COLOR=NEUTRAL,                                          X00080   
               LENGTH=3,                                               X00081**2
               POS=(03,7)                                               00082**2
         DFHMDF ATTRB=(PROT,BRT),                                      X00083   
               INITIAL='OR',                                           X00084   
               COLOR=NEUTRAL,                                          X00085   
               LENGTH=2,                                               X00086   
               POS=(03,17)                                              00087**2
         DFHMDF ATTRB=(PROT,BRT),                                      X00088   
               INITIAL='UPC',                                          X00089   
               COLOR=NEUTRAL,                                          X00090   
               LENGTH=3,                                               X00091   
               POS=(03,25)                                              00092   
         DFHMDF ATTRB=(PROT,BRT),                                      X00093   
               INITIAL='QUANTITY',                                     X00094   
               COLOR=NEUTRAL,                                          X00095   
               LENGTH=8,                                               X00096   
               POS=(03,35)                                              00097   
         DFHMDF ATTRB=(PROT,BRT),                                      X00098   
               INITIAL='UNIT RETAIL',                                  X00099**2
               COLOR=NEUTRAL,                                          X00100   
               LENGTH=11,                                              X00101**2
               POS=(03,46)                                              00102**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00103   
*                                                                       00104   
*  SCREEN LINE 05                                                       00105   
*                                                                       00106   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00107   
****************************************                                00122   
*  VARIABLE = -SKU-NBR      X008                                        00123   
****************************************                                00124   
ASKUN01  DFHMDF ATTRB=(ASKIP),                                         X00125   
               COLOR=BLUE,                                             X00126   
               LENGTH=8,                                               X00127   
               POS=(04,5)                                               00128   
         DFHMDF ATTRB=(ASKIP),                                         X00129   
               POS=(04,14),                                            X00130   
               INITIAL=' ',                                            X00131   
               LENGTH=1                                                 00132   
****************************************                                00133   
*  VARIABLE = -UPC-NUMBER      N015                                     00134   
****************************************                                00135   
AUPC01   DFHMDF ATTRB=(ASKIP),                                         X00136   
               JUSTIFY=(LEFT,BLANK),                                   X00137   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00139   
               LENGTH=15,                                              X00140   
               POS=(04,18)                                              00141   
         DFHMDF ATTRB=(ASKIP),                                         X00142   
               POS=(04,34),                                            X00143   
               INITIAL=' ',                                            X00144   
               LENGTH=1                                                 00145   
****************************************                                00146   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             00147   
****************************************                                00148   
AQTY01   DFHMDF ATTRB=(ASKIP),                                         X00149   
               JUSTIFY=(LEFT,BLANK),                                   X00150   
               COLOR=BLUE,                                             X00151   
               PICOUT='ZZZZZZZ',                                       X00152   
               LENGTH=7,                                               X00153   
               POS=(04,36)                                              00154   
****************************************                                00155   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           00156   
****************************************                                00157   
APRCE01  DFHMDF ATTRB=(ASKIP),                                         X00158   
               JUSTIFY=(LEFT,BLANK),                                   X00159   
               COLOR=BLUE,                                             X00160   
               PICOUT='ZZZZZZZ.99',                                    X00161   
               LENGTH=10,                                              X00162   
               POS=(04,46)                                              00163   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00164   
*                                                                       00165   
*  SCREEN LINE 06                                                       00166   
*                                                                       00167   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00168   
         DFHMDF ATTRB=(ASKIP),                                         X00169   
               POS=(05,1),                                             X00170   
               INITIAL=' ',                                            X00171   
               LENGTH=1                                                 00172   
****************************************                                00187   
*  VARIABLE = -SKU-NBR      X008                                        00188   
****************************************                                00189   
ASKUN02  DFHMDF ATTRB=(ASKIP),                                         X00190   
               COLOR=BLUE,                                             X00191   
               LENGTH=8,                                               X00192   
               POS=(05,5)                                               00193   
         DFHMDF ATTRB=(ASKIP),                                         X00194   
               POS=(05,14),                                            X00195   
               INITIAL=' ',                                            X00196   
               LENGTH=1                                                 00197   
****************************************                                00198   
*  VARIABLE = -UPC-NUMBER      N015                                     00199   
****************************************                                00200   
AUPC02   DFHMDF ATTRB=(ASKIP),                                         X00201   
               JUSTIFY=(LEFT,BLANK),                                   X00202   
               COLOR=BLUE,                                             X00203   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00204   
               LENGTH=15,                                              X00205   
               POS=(05,18)                                              00206   
         DFHMDF ATTRB=(ASKIP),                                         X00207   
               POS=(05,34),                                            X00208   
               INITIAL=' ',                                            X00209   
               LENGTH=1                                                 00210   
****************************************                                00211   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             00212   
****************************************                                00213   
AQTY02   DFHMDF ATTRB=(ASKIP),                                         X00214   
               JUSTIFY=(LEFT,BLANK),                                   X00215   
               COLOR=BLUE,                                             X00216   
               PICOUT='ZZZZZZZ',                                       X00217   
               LENGTH=7,                                               X00218   
               POS=(05,36)                                              00219   
****************************************                                00220   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           00221   
****************************************                                00222   
APRCE02  DFHMDF ATTRB=(ASKIP),                                         X00223   
               JUSTIFY=(LEFT,BLANK),                                   X00224   
               COLOR=BLUE,                                             X00225   
               PICOUT='ZZZZZZZ.99',                                    X00226   
               LENGTH=10,                                              X00227   
               POS=(05,46)                                              00228   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00229   
*                                                                       00230   
*  SCREEN LINE 07                                                       00231   
*                                                                       00232   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00233   
         DFHMDF ATTRB=(ASKIP),                                         X00234   
               POS=(06,1),                                             X00235   
               INITIAL=' ',                                            X00236   
               LENGTH=1                                                 00237   
****************************************                                00252   
*  VARIABLE = -SKU-NBR      X008                                        00253   
****************************************                                00254   
ASKUN03  DFHMDF ATTRB=(ASKIP),                                         X00255   
               COLOR=BLUE,                                             X00256   
               LENGTH=8,                                               X00257   
               POS=(06,5)                                               00258   
         DFHMDF ATTRB=(ASKIP),                                         X00259   
               POS=(06,14),                                            X00260   
               INITIAL=' ',                                            X00261   
               LENGTH=1                                                 00262   
****************************************                                00263   
*  VARIABLE = -UPC-NUMBER      N015                                     00264   
****************************************                                00265   
AUPC03   DFHMDF ATTRB=(ASKIP),                                         X00266   
               JUSTIFY=(LEFT,BLANK),                                   X00267   
               COLOR=BLUE,                                             X00268   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00269   
               LENGTH=15,                                              X00270   
               POS=(06,18)                                              00271   
         DFHMDF ATTRB=(ASKIP),                                         X00272   
               POS=(06,34),                                            X00273   
               INITIAL=' ',                                            X00274   
               LENGTH=1                                                 00275   
****************************************                                00276   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             00277   
****************************************                                00278   
AQTY03   DFHMDF ATTRB=(ASKIP),                                         X00279   
               JUSTIFY=(LEFT,BLANK),                                   X00280   
               COLOR=BLUE,                                             X00281   
               PICOUT='ZZZZZZZ',                                       X00282   
               LENGTH=7,                                               X00283   
               POS=(06,36)                                              00284   
****************************************                                00285   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           00286   
****************************************                                00287   
APRCE03  DFHMDF ATTRB=(ASKIP),                                         X00288   
               JUSTIFY=(LEFT,BLANK),                                   X00289   
               COLOR=BLUE,                                             X00290   
               PICOUT='ZZZZZZZ.99',                                    X00291   
               LENGTH=10,                                              X00292   
               POS=(06,46)                                              00293   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00294   
*                                                                       00295   
*  SCREEN LINE 08                                                       00296   
*                                                                       00297   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00298   
         DFHMDF ATTRB=(ASKIP),                                         X00299   
               POS=(07,1),                                             X00300   
               INITIAL=' ',                                            X00301   
               LENGTH=1                                                 00302   
****************************************                                00317   
*  VARIABLE = -SKU-NBR      X008                                        00318   
****************************************                                00319   
ASKUN04  DFHMDF ATTRB=(ASKIP),                                         X00320   
               COLOR=BLUE,                                             X00321   
               LENGTH=8,                                               X00322   
               POS=(07,5)                                               00323   
         DFHMDF ATTRB=(ASKIP),                                         X00324   
               POS=(07,14),                                            X00325   
               INITIAL=' ',                                            X00326   
               LENGTH=1                                                 00327   
****************************************                                00328   
*  VARIABLE = -UPC-NUMBER      N015                                     00329   
****************************************                                00330   
AUPC04   DFHMDF ATTRB=(ASKIP),                                         X00331   
               JUSTIFY=(LEFT,BLANK),                                   X00332   
               COLOR=BLUE,                                             X00333   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00334   
               LENGTH=15,                                              X00335   
               POS=(07,18)                                              00336   
         DFHMDF ATTRB=(ASKIP),                                         X00337   
               POS=(07,34),                                            X00338   
               INITIAL=' ',                                            X00339   
               LENGTH=1                                                 00340   
****************************************                                00341   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             00342   
****************************************                                00343   
AQTY04   DFHMDF ATTRB=(ASKIP),                                         X00344   
               JUSTIFY=(LEFT,BLANK),                                   X00345   
               COLOR=BLUE,                                             X00346   
               PICOUT='ZZZZZZZ',                                       X00347   
               LENGTH=7,                                               X00348   
               POS=(07,36)                                              00349   
****************************************                                00350   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           00351   
****************************************                                00352   
APRCE04  DFHMDF ATTRB=(ASKIP),                                         X00353   
               JUSTIFY=(LEFT,BLANK),                                   X00354   
               COLOR=BLUE,                                             X00355   
               PICOUT='ZZZZZZZ.99',                                    X00356   
               LENGTH=10,                                              X00357   
               POS=(07,46)                                              00358   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00359   
*                                                                       00360   
*  SCREEN LINE 09                                                       00361   
*                                                                       00362   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00363   
         DFHMDF ATTRB=(ASKIP),                                         X00364   
               POS=(08,1),                                             X00365   
               INITIAL=' ',                                            X00366   
               LENGTH=1                                                 00367   
****************************************                                00382   
*  VARIABLE = -SKU-NBR      X008                                        00383   
****************************************                                00384   
ASKUN05  DFHMDF ATTRB=(ASKIP),                                         X00385   
               COLOR=BLUE,                                             X00386   
               LENGTH=8,                                               X00387   
               POS=(08,5)                                               00388   
         DFHMDF ATTRB=(ASKIP),                                         X00389   
               POS=(08,14),                                            X00390   
               INITIAL=' ',                                            X00391   
               LENGTH=1                                                 00392   
****************************************                                00393   
*  VARIABLE = -UPC-NUMBER      N015                                     00394   
****************************************                                00395   
AUPC05   DFHMDF ATTRB=(ASKIP),                                         X00396   
               JUSTIFY=(LEFT,BLANK),                                   X00397   
               COLOR=BLUE,                                             X00398   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00399   
               LENGTH=15,                                              X00400   
               POS=(08,18)                                              00401   
         DFHMDF ATTRB=(ASKIP),                                         X00402   
               POS=(08,34),                                            X00403   
               INITIAL=' ',                                            X00404   
               LENGTH=1                                                 00405   
****************************************                                00406   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             00407   
****************************************                                00408   
AQTY05   DFHMDF ATTRB=(ASKIP),                                         X00409   
               JUSTIFY=(LEFT,BLANK),                                   X00410   
               COLOR=BLUE,                                             X00411   
               PICOUT='ZZZZZZZ',                                       X00412   
               LENGTH=7,                                               X00413   
               POS=(08,36)                                              00414   
****************************************                                00415   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           00416   
****************************************                                00417   
APRCE05  DFHMDF ATTRB=(ASKIP),                                         X00418   
               JUSTIFY=(LEFT,BLANK),                                   X00419   
               COLOR=BLUE,                                             X00420   
               PICOUT='ZZZZZZZ.99',                                    X00421   
               LENGTH=10,                                              X00422   
               POS=(08,46)                                              00423   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00424   
*                                                                       00425   
*  SCREEN LINE 10                                                       00426   
*                                                                       00427   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00428   
         DFHMDF ATTRB=(ASKIP),                                         X00429   
               POS=(09,1),                                             X00430   
               INITIAL=' ',                                            X00431   
               LENGTH=1                                                 00432   
****************************************                                00447   
*  VARIABLE = -SKU-NBR      X008                                        00448   
****************************************                                00449   
ASKUN06  DFHMDF ATTRB=(ASKIP),                                         X00450   
               COLOR=BLUE,                                             X00451   
               LENGTH=8,                                               X00452   
               POS=(09,5)                                               00453   
         DFHMDF ATTRB=(ASKIP),                                         X00454   
               POS=(09,14),                                            X00455   
               INITIAL=' ',                                            X00456   
               LENGTH=1                                                 00457   
****************************************                                00458   
*  VARIABLE = -UPC-NUMBER      N015                                     00459   
****************************************                                00460   
AUPC06   DFHMDF ATTRB=(ASKIP),                                         X00461   
               JUSTIFY=(LEFT,BLANK),                                   X00462   
               COLOR=BLUE,                                             X00463   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00464   
               LENGTH=15,                                              X00465   
               POS=(09,18)                                              00466   
         DFHMDF ATTRB=(ASKIP),                                         X00467   
               POS=(09,34),                                            X00468   
               INITIAL=' ',                                            X00469   
               LENGTH=1                                                 00470   
****************************************                                00471   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             00472   
****************************************                                00473   
AQTY06   DFHMDF ATTRB=(ASKIP),                                         X00474   
               JUSTIFY=(LEFT,BLANK),                                   X00475   
               COLOR=BLUE,                                             X00476   
               PICOUT='ZZZZZZZ',                                       X00477   
               LENGTH=7,                                               X00478   
               POS=(09,36)                                              00479   
****************************************                                00480   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           00481   
****************************************                                00482   
APRCE06  DFHMDF ATTRB=(ASKIP),                                         X00483   
               JUSTIFY=(LEFT,BLANK),                                   X00484   
               COLOR=BLUE,                                             X00485   
               PICOUT='ZZZZZZZ.99',                                    X00486   
               LENGTH=10,                                              X00487   
               POS=(09,46)                                              00488   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00489   
*                                                                       00490   
*  SCREEN LINE 11                                                       00491   
*                                                                       00492   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00493   
         DFHMDF ATTRB=(ASKIP),                                         X00494   
               POS=(10,1),                                             X00495   
               INITIAL=' ',                                            X00496   
               LENGTH=1                                                 00497   
****************************************                                00512   
*  VARIABLE = -SKU-NBR      X008                                        00513   
****************************************                                00514   
ASKUN07  DFHMDF ATTRB=(ASKIP),                                         X00515   
               COLOR=BLUE,                                             X00516   
               LENGTH=8,                                               X00517   
               POS=(10,5)                                               00518   
         DFHMDF ATTRB=(ASKIP),                                         X00519   
               POS=(10,14),                                            X00520   
               INITIAL=' ',                                            X00521   
               LENGTH=1                                                 00522   
****************************************                                00523   
*  VARIABLE = -UPC-NUMBER      N015                                     00524   
****************************************                                00525   
AUPC07   DFHMDF ATTRB=(ASKIP),                                         X00526   
               JUSTIFY=(LEFT,BLANK),                                   X00527   
               COLOR=BLUE,                                             X00528   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00529   
               LENGTH=15,                                              X00530   
               POS=(10,18)                                              00531   
         DFHMDF ATTRB=(ASKIP),                                         X00532   
               POS=(10,34),                                            X00533   
               INITIAL=' ',                                            X00534   
               LENGTH=1                                                 00535   
****************************************                                00536   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             00537   
****************************************                                00538   
AQTY07   DFHMDF ATTRB=(ASKIP),                                         X00539   
               JUSTIFY=(LEFT,BLANK),                                   X00540   
               COLOR=BLUE,                                             X00541   
               PICOUT='ZZZZZZZ',                                       X00542   
               LENGTH=7,                                               X00543   
               POS=(10,36)                                              00544   
****************************************                                00545   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           00546   
****************************************                                00547   
APRCE07  DFHMDF ATTRB=(ASKIP),                                         X00548   
               JUSTIFY=(LEFT,BLANK),                                   X00549   
               COLOR=BLUE,                                             X00550   
               PICOUT='ZZZZZZZ.99',                                    X00551   
               LENGTH=10,                                              X00552   
               POS=(10,46)                                              00553   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00554   
*                                                                       00555   
*  SCREEN LINE 12                                                       00556   
*                                                                       00557   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00558   
         DFHMDF ATTRB=(ASKIP),                                         X00559   
               POS=(11,1),                                             X00560   
               INITIAL=' ',                                            X00561   
               LENGTH=1                                                 00562   
****************************************                                00577   
*  VARIABLE = -SKU-NBR      X008                                        00578   
****************************************                                00579   
ASKUN08  DFHMDF ATTRB=(ASKIP),                                         X00580   
               COLOR=BLUE,                                             X00581   
               LENGTH=8,                                               X00582   
               POS=(11,5)                                               00583   
         DFHMDF ATTRB=(ASKIP),                                         X00584   
               POS=(11,14),                                            X00585   
               INITIAL=' ',                                            X00586   
               LENGTH=1                                                 00587   
****************************************                                00588   
*  VARIABLE = -UPC-NUMBER      N015                                     00589   
****************************************                                00590   
AUPC08   DFHMDF ATTRB=(ASKIP),                                         X00591   
               JUSTIFY=(LEFT,BLANK),                                   X00592   
               COLOR=BLUE,                                             X00593   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00594   
               LENGTH=15,                                              X00595   
               POS=(11,18)                                              00596   
         DFHMDF ATTRB=(ASKIP),                                         X00597   
               POS=(11,34),                                            X00598   
               INITIAL=' ',                                            X00599   
               LENGTH=1                                                 00600   
****************************************                                00601   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             00602   
****************************************                                00603   
AQTY08   DFHMDF ATTRB=(ASKIP),                                         X00604   
               JUSTIFY=(LEFT,BLANK),                                   X00605   
               COLOR=BLUE,                                             X00606   
               PICOUT='ZZZZZZZ',                                       X00607   
               LENGTH=7,                                               X00608   
               POS=(11,36)                                              00609   
****************************************                                00610   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           00611   
****************************************                                00612   
APRCE08  DFHMDF ATTRB=(ASKIP),                                         X00613   
               JUSTIFY=(LEFT,BLANK),                                   X00614   
               COLOR=BLUE,                                             X00615   
               PICOUT='ZZZZZZZ.99',                                    X00616   
               LENGTH=10,                                              X00617   
               POS=(11,46)                                              00618   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00619   
*                                                                       00620   
*  SCREEN LINE 13                                                       00621   
*                                                                       00622   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00623   
         DFHMDF ATTRB=(ASKIP),                                         X00624   
               POS=(12,1),                                             X00625   
               INITIAL=' ',                                            X00626   
               LENGTH=1                                                 00627   
****************************************                                00642   
*  VARIABLE = -SKU      X008                                            00643   
****************************************                                00644   
ASKUN09  DFHMDF ATTRB=(ASKIP),                                         X00645   
               COLOR=BLUE,                                             X00646   
               LENGTH=8,                                               X00647   
               POS=(12,5)                                               00648   
         DFHMDF ATTRB=(ASKIP),                                         X00649   
               POS=(12,14),                                            X00650   
               INITIAL=' ',                                            X00651   
               LENGTH=1                                                 00652   
****************************************                                00653   
*  VARIABLE = -UPC-NUMBER      N015                                     00654   
****************************************                                00655   
AUPC09   DFHMDF ATTRB=(ASKIP),                                         X00656   
               JUSTIFY=(LEFT,BLANK),                                   X00657   
               COLOR=BLUE,                                             X00658   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00659   
               LENGTH=15,                                              X00660   
               POS=(12,18)                                              00661   
         DFHMDF ATTRB=(ASKIP),                                         X00662   
               POS=(12,34),                                            X00663   
               INITIAL=' ',                                            X00664   
               LENGTH=1                                                 00665   
****************************************                                00666   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             00667   
****************************************                                00668   
AQTY09   DFHMDF ATTRB=(ASKIP),                                         X00669   
               JUSTIFY=(LEFT,BLANK),                                   X00670   
               COLOR=BLUE,                                             X00671   
               PICOUT='ZZZZZZZ',                                       X00672   
               LENGTH=7,                                               X00673   
               POS=(12,36)                                              00674   
****************************************                                00675   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           00676   
****************************************                                00677   
APRCE09  DFHMDF ATTRB=(ASKIP),                                         X00678   
               JUSTIFY=(LEFT,BLANK),                                   X00679   
               COLOR=BLUE,                                             X00680   
               PICOUT='ZZZZZZZ.99',                                    X00681   
               LENGTH=10,                                              X00682   
               POS=(12,46)                                              00683   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00684   
*                                                                       00685   
*  SCREEN LINE 14                                                       00686   
*                                                                       00687   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00688   
         DFHMDF ATTRB=(ASKIP),                                         X00689   
               POS=(13,1),                                             X00690   
               INITIAL=' ',                                            X00691   
               LENGTH=1                                                 00692   
****************************************                                00707   
*  VARIABLE = -SKU-NBR      X008                                        00708   
****************************************                                00709   
ASKUN10  DFHMDF ATTRB=(ASKIP),                                         X00710   
               COLOR=BLUE,                                             X00711   
               LENGTH=8,                                               X00712   
               POS=(13,5)                                               00713   
         DFHMDF ATTRB=(ASKIP),                                         X00714   
               POS=(13,14),                                            X00715   
               INITIAL=' ',                                            X00716   
               LENGTH=1                                                 00717   
****************************************                                00718   
*  VARIABLE = -UPC-NUMBER      N015                                     00719   
****************************************                                00720   
AUPC10   DFHMDF ATTRB=(ASKIP),                                         X00721   
               JUSTIFY=(LEFT,BLANK),                                   X00722   
               COLOR=BLUE,                                             X00723   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00724   
               LENGTH=15,                                              X00725   
               POS=(13,18)                                              00726   
         DFHMDF ATTRB=(ASKIP),                                         X00727   
               POS=(13,34),                                            X00728   
               INITIAL=' ',                                            X00729   
               LENGTH=1                                                 00730   
****************************************                                00731   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             00732   
****************************************                                00733   
AQTY10   DFHMDF ATTRB=(ASKIP),                                         X00734   
               JUSTIFY=(LEFT,BLANK),                                   X00735   
               COLOR=BLUE,                                             X00736   
               PICOUT='ZZZZZZZ',                                       X00737   
               LENGTH=7,                                               X00738   
               POS=(13,36)                                              00739   
****************************************                                00740   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           00741   
****************************************                                00742   
APRCE10  DFHMDF ATTRB=(ASKIP),                                         X00743   
               JUSTIFY=(LEFT,BLANK),                                   X00744   
               COLOR=BLUE,                                             X00745   
               PICOUT='ZZZZZZZ.99',                                    X00746   
               LENGTH=10,                                              X00747   
               POS=(13,46)                                              00748   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00749   
*                                                                       00750   
*  SCREEN LINE 15                                                       00751   
*                                                                       00752   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00753   
         DFHMDF ATTRB=(ASKIP),                                         X00754   
               POS=(14,1),                                             X00755   
               INITIAL=' ',                                            X00756   
               LENGTH=1                                                 00757   
****************************************                                00772   
*  VARIABLE = -SKU-NBR      X008                                        00773   
****************************************                                00774   
ASKUN11  DFHMDF ATTRB=(ASKIP),                                         X00775   
               COLOR=BLUE,                                             X00776   
               LENGTH=8,                                               X00777   
               POS=(14,5)                                               00778   
         DFHMDF ATTRB=(ASKIP),                                         X00779   
               POS=(14,14),                                            X00780   
               INITIAL=' ',                                            X00781   
               LENGTH=1                                                 00782   
****************************************                                00783   
*  VARIABLE = -UPC-NUMBER      N015                                     00784   
****************************************                                00785   
AUPC11   DFHMDF ATTRB=(ASKIP),                                         X00786   
               JUSTIFY=(LEFT,BLANK),                                   X00787   
               COLOR=BLUE,                                             X00788   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00789   
               LENGTH=15,                                              X00790   
               POS=(14,18)                                              00791   
         DFHMDF ATTRB=(ASKIP),                                         X00792   
               POS=(14,34),                                            X00793   
               INITIAL=' ',                                            X00794   
               LENGTH=1                                                 00795   
****************************************                                00796   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             00797   
****************************************                                00798   
AQTY11   DFHMDF ATTRB=(ASKIP),                                         X00799   
               JUSTIFY=(LEFT,BLANK),                                   X00800   
               COLOR=BLUE,                                             X00801   
               PICOUT='ZZZZZZZ',                                       X00802   
               LENGTH=7,                                               X00803   
               POS=(14,36)                                              00804   
****************************************                                00805   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           00806   
****************************************                                00807   
APRCE11  DFHMDF ATTRB=(ASKIP),                                         X00808   
               JUSTIFY=(LEFT,BLANK),                                   X00809   
               COLOR=BLUE,                                             X00810   
               PICOUT='ZZZZZZZ.99',                                    X00811   
               LENGTH=10,                                              X00812   
               POS=(14,46)                                              00813   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00814   
*                                                                       00815   
*  SCREEN LINE 16                                                       00816   
*                                                                       00817   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00818   
         DFHMDF ATTRB=(ASKIP),                                         X00819   
               POS=(15,1),                                             X00820   
               INITIAL=' ',                                            X00821   
               LENGTH=1                                                 00822   
****************************************                                00837   
*  VARIABLE = -SKU-NBR      X008                                        00838   
****************************************                                00839   
ASKUN12  DFHMDF ATTRB=(ASKIP),                                         X00840   
               COLOR=BLUE,                                             X00841   
               LENGTH=8,                                               X00842   
               POS=(15,5)                                               00843   
         DFHMDF ATTRB=(ASKIP),                                         X00844   
               POS=(15,14),                                            X00845   
               INITIAL=' ',                                            X00846   
               LENGTH=1                                                 00847   
****************************************                                00848   
*  VARIABLE = -UPC-NUMBER      N015                                     00849   
****************************************                                00850   
AUPC12   DFHMDF ATTRB=(ASKIP),                                         X00851   
               JUSTIFY=(LEFT,BLANK),                                   X00852   
               COLOR=BLUE,                                             X00853   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00854   
               LENGTH=15,                                              X00855   
               POS=(15,18)                                              00856   
         DFHMDF ATTRB=(ASKIP),                                         X00857   
               POS=(15,34),                                            X00858   
               INITIAL=' ',                                            X00859   
               LENGTH=1                                                 00860   
****************************************                                00861   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             00862   
****************************************                                00863   
AQTY12   DFHMDF ATTRB=(ASKIP),                                         X00864   
               JUSTIFY=(LEFT,BLANK),                                   X00865   
               COLOR=BLUE,                                             X00866   
               PICOUT='ZZZZZZZ',                                       X00867   
               LENGTH=7,                                               X00868   
               POS=(15,36)                                              00869   
****************************************                                00870   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           00871   
****************************************                                00872   
APRCE12  DFHMDF ATTRB=(ASKIP),                                         X00873   
               JUSTIFY=(LEFT,BLANK),                                   X00874   
               COLOR=BLUE,                                             X00875   
               PICOUT='ZZZZZZZ.99',                                    X00876   
               LENGTH=10,                                              X00877   
               POS=(15,46)                                              00878   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00879   
*                                                                       00880   
*  SCREEN LINE 17                                                       00881   
*                                                                       00882   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00883   
         DFHMDF ATTRB=(ASKIP),                                         X00884   
               POS=(16,1),                                             X00885   
               INITIAL=' ',                                            X00886   
               LENGTH=1                                                 00887   
****************************************                                00902   
*  VARIABLE = -SKU-NBR      X008                                        00903   
****************************************                                00904   
ASKUN13  DFHMDF ATTRB=(ASKIP),                                         X00905   
               COLOR=BLUE,                                             X00906   
               LENGTH=8,                                               X00907   
               POS=(16,5)                                               00908   
         DFHMDF ATTRB=(ASKIP),                                         X00909   
               POS=(16,14),                                            X00910   
               INITIAL=' ',                                            X00911   
               LENGTH=1                                                 00912   
****************************************                                00913   
*  VARIABLE = -UPC-NUMBER      N015                                     00914   
****************************************                                00915   
AUPC13   DFHMDF ATTRB=(ASKIP),                                         X00916   
               JUSTIFY=(LEFT,BLANK),                                   X00917   
               COLOR=BLUE,                                             X00918   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00919   
               LENGTH=15,                                              X00920   
               POS=(16,18)                                              00921   
         DFHMDF ATTRB=(ASKIP),                                         X00922   
               POS=(16,34),                                            X00923   
               INITIAL=' ',                                            X00924   
               LENGTH=1                                                 00925   
****************************************                                00926   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             00927   
****************************************                                00928   
AQTY13   DFHMDF ATTRB=(ASKIP),                                         X00929   
               JUSTIFY=(LEFT,BLANK),                                   X00930   
               COLOR=BLUE,                                             X00931   
               PICOUT='ZZZZZZZ',                                       X00932   
               LENGTH=7,                                               X00933   
               POS=(16,36)                                              00934   
****************************************                                00935   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           00936   
****************************************                                00937   
APRCE13  DFHMDF ATTRB=(ASKIP),                                         X00938   
               JUSTIFY=(LEFT,BLANK),                                   X00939   
               COLOR=BLUE,                                             X00940   
               PICOUT='ZZZZZZZ.99',                                    X00941   
               LENGTH=10,                                              X00942   
               POS=(16,46)                                              00943   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00944   
*                                                                       00945   
*  SCREEN LINE 18                                                       00946   
*                                                                       00947   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00948   
         DFHMDF ATTRB=(ASKIP),                                         X00949   
               POS=(17,1),                                             X00950   
               INITIAL=' ',                                            X00951   
               LENGTH=1                                                 00952   
****************************************                                00967   
*  VARIABLE = -SKU-NBR      X008                                        00968   
****************************************                                00969   
ASKUN14  DFHMDF ATTRB=(ASKIP),                                         X00970   
               COLOR=BLUE,                                             X00971   
               LENGTH=8,                                               X00972   
               POS=(17,5)                                               00973   
         DFHMDF ATTRB=(ASKIP),                                         X00974   
               POS=(17,14),                                            X00975   
               INITIAL=' ',                                            X00976   
               LENGTH=1                                                 00977   
****************************************                                00978   
*  VARIABLE = -UPC-NUMBER      N015                                     00979   
****************************************                                00980   
AUPC14   DFHMDF ATTRB=(ASKIP),                                         X00981   
               JUSTIFY=(LEFT,BLANK),                                   X00982   
               COLOR=BLUE,                                             X00983   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X00984   
               LENGTH=15,                                              X00985   
               POS=(17,18)                                              00986   
         DFHMDF ATTRB=(ASKIP),                                         X00987   
               POS=(17,34),                                            X00988   
               INITIAL=' ',                                            X00989   
               LENGTH=1                                                 00990   
****************************************                                00991   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             00992   
****************************************                                00993   
AQTY14   DFHMDF ATTRB=(ASKIP),                                         X00994   
               JUSTIFY=(LEFT,BLANK),                                   X00995   
               COLOR=BLUE,                                             X00996   
               PICOUT='ZZZZZZZ',                                       X00997   
               LENGTH=7,                                               X00998   
               POS=(17,36)                                              00999   
****************************************                                01000   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           01001   
****************************************                                01002   
APRCE14  DFHMDF ATTRB=(ASKIP),                                         X01003   
               JUSTIFY=(LEFT,BLANK),                                   X01004   
               COLOR=BLUE,                                             X01005   
               PICOUT='ZZZZZZZ.99',                                    X01006   
               LENGTH=10,                                              X01007   
               POS=(17,46)                                              01008   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 01009   
*                                                                       01010   
*  SCREEN LINE 19                                                       01011   
*                                                                       01012   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 01013   
         DFHMDF ATTRB=(ASKIP),                                         X01014   
               POS=(18,1),                                             X01015   
               INITIAL=' ',                                            X01016   
               LENGTH=1                                                 01017   
****************************************                                01032   
*  VARIABLE = -SKU-NBR      X008                                        01033   
****************************************                                01034   
ASKUN15  DFHMDF ATTRB=(ASKIP),                                         X01035   
               COLOR=BLUE,                                             X01036   
               LENGTH=8,                                               X01037   
               POS=(18,5)                                               01038   
         DFHMDF ATTRB=(ASKIP),                                         X01039   
               POS=(18,14),                                            X01040   
               INITIAL=' ',                                            X01041   
               LENGTH=1                                                 01042   
****************************************                                01043   
*  VARIABLE = -UPC-NUMBER      N015                                     01044   
****************************************                                01045   
AUPC15   DFHMDF ATTRB=(ASKIP),                                         X01046   
               JUSTIFY=(LEFT,BLANK),                                   X01047   
               COLOR=BLUE,                                             X01048   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X01049   
               LENGTH=15,                                              X01050   
               POS=(18,18)                                              01051   
         DFHMDF ATTRB=(ASKIP),                                         X01052   
               POS=(18,34),                                            X01053   
               INITIAL=' ',                                            X01054   
               LENGTH=1                                                 01055   
****************************************                                01056   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             01057   
****************************************                                01058   
AQTY15   DFHMDF ATTRB=(ASKIP),                                         X01059   
               JUSTIFY=(LEFT,BLANK),                                   X01060   
               COLOR=BLUE,                                             X01061   
               PICOUT='ZZZZZZZ',                                       X01062   
               LENGTH=7,                                               X01063   
               POS=(18,36)                                              01064   
****************************************                                01065   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           01066   
****************************************                                01067   
APRCE15  DFHMDF ATTRB=(ASKIP),                                         X01068   
               JUSTIFY=(LEFT,BLANK),                                   X01069   
               COLOR=BLUE,                                             X01070   
               PICOUT='ZZZZZZZ.99',                                    X01071   
               LENGTH=10,                                              X01072   
               POS=(18,46)                                              01073   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 01074   
*                                                                       01075   
*  SCREEN LINE 20                                                       01076   
*                                                                       01077   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 01078   
         DFHMDF ATTRB=(ASKIP),                                         X01079   
               POS=(19,1),                                             X01080   
               INITIAL=' ',                                            X01081   
               LENGTH=1                                                 01082   
****************************************                                01097   
*  VARIABLE = -SKU-NBR      X008                                        01098   
****************************************                                01099   
ASKUN16  DFHMDF ATTRB=(ASKIP),                                         X01100   
               COLOR=BLUE,                                             X01101   
               LENGTH=8,                                               X01102   
               POS=(19,5)                                               01103   
         DFHMDF ATTRB=(ASKIP),                                         X01104   
               POS=(19,14),                                            X01105   
               INITIAL=' ',                                            X01106   
               LENGTH=1                                                 01107   
****************************************                                01108   
*  VARIABLE = -UPC-NUMBER      N015                                     01109   
****************************************                                01110   
AUPC16   DFHMDF ATTRB=(ASKIP),                                         X01111   
               JUSTIFY=(LEFT,BLANK),                                   X01112   
               COLOR=BLUE,                                             X01113   
               PICOUT='ZZZZZZZZZZZZZZZ',                               X01114   
               LENGTH=15,                                              X01115   
               POS=(19,18)                                              01116   
         DFHMDF ATTRB=(ASKIP),                                         X01117   
               POS=(19,34),                                            X01118   
               INITIAL=' ',                                            X01119   
               LENGTH=1                                                 01120   
****************************************                                01121   
*  VARIABLE = -INVENTORIED-QUANTI      N007                             01122   
****************************************                                01123   
AQTY16   DFHMDF ATTRB=(ASKIP),                                         X01124   
               JUSTIFY=(LEFT,BLANK),                                   X01125   
               COLOR=BLUE,                                             X01126   
               PICOUT='ZZZZZZZ',                                       X01127   
               LENGTH=7,                                               X01128   
               POS=(19,36)                                              01129   
****************************************                                01130   
*  VARIABLE = -ITEM-UNIT-PRICE-AM      N00702                           01131   
****************************************                                01132   
APRCE16  DFHMDF ATTRB=(ASKIP),                                         X01133   
               JUSTIFY=(LEFT,BLANK),                                   X01134   
               COLOR=BLUE,                                             X01135   
               PICOUT='ZZZZZZZ.99',                                    X01136   
               LENGTH=10,                                              X01137   
               POS=(19,46)                                              01138   
         DFHMSD TYPE=FINAL                                              01139   
         END                                                            01140   
