*          DATA SET INKM053    AT LEVEL 001 AS OF 08/01/2000            00001   
  PRINT  NOGEN                                                          00002   
************************************************************            00003   
*                                                                       00004   
*  AACYY - INKM053                                                      00005   
*                                                                       00006   
*     GENERATED          : 06/21/02 AT 02:00:00 PM                      00007   
*     VERSION            : 2.7.01                                       00008   
*     CSD LEVEL          : 2.7.01                                       00008   
*     AUTHOR             : TKMA523.                                     00010   
*     INSTALLATION       : KNOWLEDGEWARE, INC.                          00010   
*     ENCYCLOPEDIA       : PHYSICAL INVENTORY                           00011   
*     ENCYCLOPEDIA PATH  : C:\ADW_ENC\MLDE00A\                          00012   
*     MAP DETAILS                                                       00013   
*     LAST UPDATED 12/03/2002 AT 02:00:00 BY TK20917                    00015   
*-----------------------------------------------------------            00016   
*  BMS MAPSET :  INKM053                                                00018   
*      MAP    :  IN053A                                                 00019   
************************************************************            00020   
INKM053  DFHMSD TYPE=DSECT,                                            X00021   
               LANG=COBOL,                                             X00022   
               CTRL=(FREEKB),                                          X00023   
               MODE=INOUT,                                             X00024   
               TERM=3270-2,                                            X00025   
               TIOAPFX=YES,                                            X00026   
               STORAGE=AUTO                                             00027   
IN053A   DFHMDI LINE=2,COLUMN=1,                                       X00028   
               SIZE=(19,80),                                           X00029   
               MAPATTS=(COLOR,HILIGHT),                                X00030   
               DSATTS=(COLOR,HILIGHT)                                   00031   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 01                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00037   
               POS=(01,1),                                             X00038   
               INITIAL=' ',                                            X00039   
               LENGTH=1                                                 00040   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 02                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00037   
               INITIAL='STORE:',                                       X00038   
               COLOR=NEUTRAL,                                          X00039   
               LENGTH=6,                                               X00040   
               POS=(02,03)                                              00041   
ASTRNBR  DFHMDF ATTRB=(ASKIP),                                         X00042   
               COLOR=BLUE,                                             X00043   
               LENGTH=04,                                              X00044   
               POS=(02,13)                                              00045   
ASTRNAM  DFHMDF ATTRB=(ASKIP),                                         X00042   
               COLOR=BLUE,                                             X00043   
               LENGTH=25,                                              X00044   
               POS=(02,20)                                              00045   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 03                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00061   
               INITIAL='AREA :',                                       X00062   
               COLOR=NEUTRAL,                                          X00063   
               LENGTH=6,                                               X00064   
               POS=(03,3)                                               00065   
****************************************                                00096   
*  VARIABLE = AAREA      N006                                           00097   
****************************************                                00098   
AAREA    DFHMDF ATTRB=(ASKIP),                                         X00099   
               JUSTIFY=(LEFT,BLANK),                                   X00100   
               COLOR=BLUE,                                             X00101   
               PICOUT='999999',                                        X00102   
               LENGTH=6,                                               X00103   
               POS=(03,10)                                              00104   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 05                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00066   
               INITIAL='SKU / UPC',                                    X00067   
               COLOR=NEUTRAL,                                          X00068   
               LENGTH=09,                                              X00069   
               POS=(05,08)                                              00070   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00071   
               INITIAL='QUANTITY',                                     X00072   
               COLOR=NEUTRAL,                                          X00073   
               LENGTH=8,                                               X00074   
               POS=(05,22)                                              00075   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00076   
               INITIAL='PRICE',                                        X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=5,                                               X00079   
               POS=(05,36)                                              00080**4
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00081   
               INITIAL='EXTENDED',                                     X00082   
               COLOR=NEUTRAL,                                          X00083   
               LENGTH=8,                                               X00084   
               POS=(05,46)                                              00085**7
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00086   
               INITIAL='REASON',                                       X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=6,                                               X00089   
               POS=(05,63)                                              00090   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 06                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
****************************************                                00203   
*  VARIABLE = -SKU-NUMBER           X008                                00204   
****************************************                                00205   
ASKU01   DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00206   
               COLOR=GREEN,                                            X00207   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=15,                                              X00208   
               POS=(06,04)                                              00209   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(06,20),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY      N007                             00211   
****************************************                                00212   
AQTY01   DFHMDF ATTRB=(UNPROT,NUM),                                    X00213   
               COLOR=GREEN,                                            X00215   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(RIGHT,BLANK),                                  X00214   
               PICOUT='ZZZZZZ9',                                       X00216   
               LENGTH=7,                                               X00217   
               POS=(06,22)                                              00218   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(06,30),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00502                           00220   
****************************************                                00221   
APRI01   DFHMDF ATTRB=(UNPROT,NUM),                                    X00222   
               COLOR=GREEN,                                            X00224   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               PICOUT='ZZZZ9.99',                                      X00225   
               LENGTH=8,                                               X00226   
               POS=(06,33)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N01002                           00229   
****************************************                                00230   
AXPRI01  DFHMDF ATTRB=(ASKIP),                                         X00231   
               COLOR=BLUE,                                             X00233   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               PICOUT='ZZZZZZZZZZ.ZZ',                                 X00234**3
               LENGTH=13,                                              X00235**3
               POS=(06,42)                                              00236**3
****************************************                                00237   
* VARIABLE = MESSAGE-REASON FOR ADJUSTMENT                              00238   
****************************************                                00239   
ADMSG01  DFHMDF ATTRB=(UNPROT),                                        X00240   
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=20,                                              X00242   
               POS=(06,57)                                              00243**2
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(06,78),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 07                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
****************************************                                00203   
*  VARIABLE = -SKU-NUMBER           X008                                00204   
****************************************                                00205   
ASKU02   DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00206   
               COLOR=GREEN,                                            X00207   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=15,                                              X00208   
               POS=(07,04)                                              00209   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(07,20),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY      N007                             00211   
****************************************                                00212   
AQTY02   DFHMDF ATTRB=(UNPROT,NUM),                                    X00213   
               COLOR=GREEN,                                            X00215   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(RIGHT,BLANK),                                  X00214   
               PICOUT='ZZZZZZ9',                                       X00216   
               LENGTH=7,                                               X00217   
               POS=(07,22)                                              00218   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(07,30),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00702                           00220   
****************************************                                00221   
APRI02   DFHMDF ATTRB=(UNPROT,NUM),                                    X00222   
               COLOR=GREEN,                                            X00224   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               PICOUT='ZZZZ9.99',                                      X00225   
               LENGTH=8,                                               X00226   
               POS=(07,33)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N01002                           00229   
****************************************                                00230   
AXPRI02  DFHMDF ATTRB=(ASKIP),                                         X00231   
               COLOR=BLUE,                                             X00233   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               PICOUT='ZZZZZZZZZZ.ZZ',                                 X00234**3
               LENGTH=13,                                              X00235**3
               POS=(07,42)                                              00236**3
****************************************                                00237   
* VARIABLE = MESSAGE-REASON FOR ADJUSTMENT                              00238   
****************************************                                00239   
ADMSG02  DFHMDF ATTRB=(UNPROT),                                        X00240   
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=20,                                              X00242   
               POS=(07,57)                                              00243**2
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(07,78),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 08                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
****************************************                                00203   
*  VARIABLE = -SKU-NUMBER           X008                                00204   
****************************************                                00205   
ASKU03   DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00206   
               COLOR=GREEN,                                            X00207   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=15,                                              X00208   
               POS=(08,04)                                              00209   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(08,20),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY      N007                             00211   
****************************************                                00212   
AQTY03   DFHMDF ATTRB=(UNPROT,NUM),                                    X00213   
               COLOR=GREEN,                                            X00215   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(RIGHT,BLANK),                                  X00214   
               PICOUT='ZZZZZZ9',                                       X00216   
               LENGTH=7,                                               X00217   
               POS=(08,22)                                              00218   
          DFHMDF ATTRB=(ASKIP),                                        X        
               POS=(08,30),                                            X        
               INITIAL=' ',                                            X        
               LENGTH=1                                                         
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00702                           00220   
****************************************                                00221   
APRI03   DFHMDF ATTRB=(UNPROT,NUM),                                    X00222   
               COLOR=GREEN,                                            X00224   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               PICOUT='ZZZZ9.99',                                      X00225   
               LENGTH=8,                                               X00226   
               POS=(08,33)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00702                           00229   
****************************************                                00230   
AXPRI03  DFHMDF ATTRB=(ASKIP),                                         X00231   
               COLOR=BLUE,                                             X00233   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               PICOUT='ZZZZZZZZZZ.ZZ',                                 X00234**3
               LENGTH=13,                                              X00235**3
               POS=(08,42)                                              00236**3
****************************************                                00237   
* VARIABLE = MESSAGE-REASON FOR ADJUSTMENT                              00238   
****************************************                                00239   
ADMSG03  DFHMDF ATTRB=(UNPROT),                                        X00240   
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=20,                                              X00242   
               POS=(08,57)                                              00243**2
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(08,78),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 09                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
****************************************                                00203   
*  VARIABLE = -SKU-NUMBER           X008                                00204   
****************************************                                00205   
ASKU04   DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00206   
               COLOR=GREEN,                                            X00207   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=15,                                              X00208   
               POS=(09,04)                                              00209   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(09,20),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY      N007                             00211   
****************************************                                00212   
AQTY04   DFHMDF ATTRB=(UNPROT,NUM),                                    X00213   
               COLOR=GREEN,                                            X00215   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(RIGHT,BLANK),                                  X00214   
               PICOUT='ZZZZZZ9',                                       X00216   
               LENGTH=7,                                               X00217   
               POS=(09,22)                                              00218   
          DFHMDF ATTRB=(ASKIP),                                        X        
               POS=(09,30),                                            X        
               INITIAL=' ',                                            X        
               LENGTH=1                                                         
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00702                           00220   
****************************************                                00221   
APRI04   DFHMDF ATTRB=(UNPROT,NUM),                                    X00222   
               COLOR=GREEN,                                            X00224   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               PICOUT='ZZZZ9.99',                                      X00225   
               LENGTH=8,                                               X00226   
               POS=(09,33)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00702                           00229   
****************************************                                00230   
AXPRI04  DFHMDF ATTRB=(ASKIP),                                         X00231   
               COLOR=BLUE,                                             X00233   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               PICOUT='ZZZZZZZZZZ.ZZ',                                 X00234**3
               LENGTH=13,                                              X00235**3
               POS=(09,42)                                              00236**3
****************************************                                00237   
* VARIABLE = MESSAGE-REASON FOR ADJUSTMENT                              00238   
****************************************                                00239   
ADMSG04  DFHMDF ATTRB=(UNPROT),                                        X00240   
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=20,                                              X00242   
               POS=(09,57)                                              00243**2
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(09,78),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 10                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
****************************************                                00203   
*  VARIABLE = -SKU-NUMBER           X008                                00204   
****************************************                                00205   
ASKU05   DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00206   
               COLOR=GREEN,                                            X00207   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=15,                                              X00208   
               POS=(10,04)                                              00209   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(10,20),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY      N007                             00211   
****************************************                                00212   
AQTY05   DFHMDF ATTRB=(UNPROT,NUM),                                    X00213   
               COLOR=GREEN,                                            X00215   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(RIGHT,BLANK),                                  X00214   
               PICOUT='ZZZZZZ9',                                       X00216   
               LENGTH=7,                                               X00217   
               POS=(10,22)                                              00218   
          DFHMDF ATTRB=(ASKIP),                                        X        
               POS=(10,30),                                            X        
               INITIAL=' ',                                            X        
               LENGTH=1                                                         
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00702                           00220   
****************************************                                00221   
APRI05   DFHMDF ATTRB=(UNPROT,NUM),                                    X00222   
               COLOR=GREEN,                                            X00224   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               PICOUT='ZZZZ9.99',                                      X00225   
               LENGTH=8,                                               X00226   
               POS=(10,33)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00702                           00229   
****************************************                                00230   
AXPRI05  DFHMDF ATTRB=(ASKIP),                                         X00231   
               COLOR=BLUE,                                             X00233   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               PICOUT='ZZZZZZZZZZ.ZZ',                                 X00234**3
               LENGTH=13,                                              X00235**3
               POS=(10,42)                                              00236**3
****************************************                                00237   
* VARIABLE = MESSAGE-REASON FOR ADJUSTMENT                              00238   
****************************************                                00239   
ADMSG05  DFHMDF ATTRB=(UNPROT),                                        X00240   
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=20,                                              X00242   
               POS=(10,57)                                              00243**2
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(10,78),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 11                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
****************************************                                00203   
*  VARIABLE = -SKU-NUMBER           X008                                00204   
****************************************                                00205   
ASKU06   DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00206   
               COLOR=GREEN,                                            X00207   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=15,                                              X00208   
               POS=(11,04)                                              00209   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(11,20),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY      N007                             00211   
****************************************                                00212   
AQTY06   DFHMDF ATTRB=(UNPROT,NUM),                                    X00213   
               COLOR=GREEN,                                            X00215   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(RIGHT,BLANK),                                  X00214   
               PICOUT='ZZZZZZ9',                                       X00216   
               LENGTH=7,                                               X00217   
               POS=(11,22)                                              00218   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(11,30),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00702                           00220   
****************************************                                00221   
APRI06   DFHMDF ATTRB=(UNPROT,NUM),                                    X00222   
               COLOR=GREEN,                                            X00224   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               PICOUT='ZZZZ9.99',                                      X00225   
               LENGTH=8,                                               X00226   
               POS=(11,33)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00702                           00229   
****************************************                                00230   
AXPRI06  DFHMDF ATTRB=(ASKIP),                                         X00231   
               COLOR=BLUE,                                             X00233   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               PICOUT='ZZZZZZZZZZ.ZZ',                                 X00234**3
               LENGTH=13,                                              X00235**3
               POS=(11,42)                                              00236**3
****************************************                                00237   
* VARIABLE = MESSAGE-REASON FOR ADJUSTMENT                              00238   
****************************************                                00239   
ADMSG06  DFHMDF ATTRB=(UNPROT),                                        X00240   
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=20,                                              X00242   
               POS=(11,57)                                              00243**2
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(11,78),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 12                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
****************************************                                00203   
*  VARIABLE = -SKU-NUMBER           X008                                00204   
****************************************                                00205   
ASKU07   DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00206   
               COLOR=GREEN,                                            X00207   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=15,                                              X00208   
               POS=(12,04)                                              00209   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(12,20),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY      N007                             00211   
****************************************                                00212   
AQTY07   DFHMDF ATTRB=(UNPROT,NUM),                                    X00213   
               COLOR=GREEN,                                            X00215   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(RIGHT,BLANK),                                  X00214   
               PICOUT='ZZZZZZ9',                                       X00216   
               LENGTH=7,                                               X00217   
               POS=(12,22)                                              00218   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(12,30),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00702                           00220   
****************************************                                00221   
APRI07   DFHMDF ATTRB=(UNPROT,NUM),                                    X00222   
               COLOR=GREEN,                                            X00224   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               PICOUT='ZZZZ9.99',                                      X00225   
               LENGTH=8,                                               X00226   
               POS=(12,33)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00702                           00229   
****************************************                                00230   
AXPRI07  DFHMDF ATTRB=(ASKIP),                                         X00231   
               COLOR=BLUE,                                             X00233   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               PICOUT='-ZZZZZZZZZ.ZZ',                                 X00234**3
               LENGTH=13,                                              X00235**3
               POS=(12,42)                                              00236**3
****************************************                                00237   
* VARIABLE = MESSAGE-REASON FOR ADJUSTMENT                              00238   
****************************************                                00239   
ADMSG07  DFHMDF ATTRB=(UNPROT),                                        X00240   
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=20,                                              X00242   
               POS=(12,57)                                              00243**2
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(12,78),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 13                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
****************************************                                00203   
*  VARIABLE = -SKU-NUMBER           X008                                00204   
****************************************                                00205   
ASKU08   DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00206   
               COLOR=GREEN,                                            X00207   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=15,                                              X00208   
               POS=(13,04)                                              00209   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(13,20),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY      N007                             00211   
****************************************                                00212   
AQTY08   DFHMDF ATTRB=(UNPROT,NUM),                                    X00213   
               COLOR=GREEN,                                            X00215   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(RIGHT,BLANK),                                  X00214   
               PICOUT='ZZZZZZ9',                                       X00216   
               LENGTH=7,                                               X00217   
               POS=(13,22)                                              00218   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(13,30),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00702                           00220   
****************************************                                00221   
APRI08   DFHMDF ATTRB=(UNPROT,NUM),                                    X00222   
               COLOR=GREEN,                                            X00224   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               PICOUT='ZZZZ9.99',                                      X00225   
               LENGTH=8,                                               X00226   
               POS=(13,33)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00702                           00229   
****************************************                                00230   
AXPRI08  DFHMDF ATTRB=(ASKIP),                                         X00231   
               COLOR=BLUE,                                             X00233   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               PICOUT='ZZZZZZZZZZ.ZZ',                                 X00234**3
               LENGTH=13,                                              X00235**3
               POS=(13,42)                                              00236**3
****************************************                                00237   
* VARIABLE = MESSAGE-REASON FOR ADJUSTMENT                              00238   
****************************************                                00239   
ADMSG08  DFHMDF ATTRB=(UNPROT),                                        X00240   
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=20,                                              X00242   
               POS=(13,57)                                              00243**2
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(13,78),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 14                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
****************************************                                00203   
*  VARIABLE = -SKU-NUMBER           X008                                00204   
****************************************                                00205   
ASKU09   DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00206   
               COLOR=GREEN,                                            X00207   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=15,                                              X00208   
               POS=(14,04)                                              00209   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(14,20),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY      N007                             00211   
****************************************                                00212   
AQTY09   DFHMDF ATTRB=(UNPROT,NUM),                                    X00213   
               COLOR=GREEN,                                            X00215   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(RIGHT,BLANK),                                  X00214   
               PICOUT='ZZZZZZ9',                                       X00216   
               LENGTH=7,                                               X00217   
               POS=(14,22)                                              00218   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(14,30),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00702                           00220   
****************************************                                00221   
APRI09   DFHMDF ATTRB=(UNPROT,NUM),                                    X00222   
               COLOR=GREEN,                                            X00224   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               PICOUT='ZZZZ9.99',                                      X00225   
               LENGTH=8,                                               X00226   
               POS=(14,33)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00702                           00229   
****************************************                                00230   
AXPRI09  DFHMDF ATTRB=(ASKIP),                                         X00231   
               COLOR=BLUE,                                             X00233   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               PICOUT='ZZZZZZZZZZ.ZZ',                                 X00234**3
               LENGTH=13,                                              X00235**3
               POS=(14,42)                                              00236**3
****************************************                                00237   
* VARIABLE = MESSAGE-REASON FOR ADJUSTMENT                              00238   
****************************************                                00239   
ADMSG09  DFHMDF ATTRB=(UNPROT),                                        X00240   
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=20,                                              X00242   
               POS=(14,57)                                              00243**2
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(14,78),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 15                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
****************************************                                00203   
*  VARIABLE = -SKU-NUMBER           X008                                00204   
****************************************                                00205   
ASKU10   DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00206   
               COLOR=GREEN,                                            X00207   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=15,                                              X00208   
               POS=(15,04)                                              00209   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(15,20),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY      N007                             00211   
****************************************                                00212   
AQTY10   DFHMDF ATTRB=(UNPROT,NUM),                                    X00213   
               COLOR=GREEN,                                            X00215   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(RIGHT,BLANK),                                  X00214   
               PICOUT='ZZZZZZ9',                                       X00216   
               LENGTH=7,                                               X00217   
               POS=(15,22)                                              00218   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(15,30),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00702                           00220   
****************************************                                00221   
APRI10   DFHMDF ATTRB=(UNPROT,NUM),                                    X00222   
               COLOR=GREEN,                                            X00224   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               PICOUT='ZZZZ9.99',                                      X00225   
               LENGTH=8,                                               X00226   
               POS=(15,33)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00702                           00229   
****************************************                                00230   
AXPRI10  DFHMDF ATTRB=(ASKIP),                                         X00231   
               COLOR=BLUE,                                             X00233   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               PICOUT='ZZZZZZZZZZ.ZZ',                                 X00234**3
               LENGTH=13,                                              X00235**3
               POS=(15,42)                                              00236**3
****************************************                                00237   
* VARIABLE = MESSAGE-REASON FOR ADJUSTMENT                              00238   
****************************************                                00239   
ADMSG10  DFHMDF ATTRB=(UNPROT),                                        X00240   
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=20,                                              X00242   
               POS=(15,57)                                              00243**2
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(15,78),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 16                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
****************************************                                00203   
*  VARIABLE = -SKU-NUMBER           X008                                00204   
****************************************                                00205   
ASKU11   DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00206   
               COLOR=GREEN,                                            X00207   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=15,                                              X00208   
               POS=(16,04)                                              00209   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(16,20),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY      N007                             00211   
****************************************                                00212   
AQTY11   DFHMDF ATTRB=(UNPROT,NUM),                                    X00213   
               COLOR=GREEN,                                            X00215   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(RIGHT,BLANK),                                  X00214   
               PICOUT='ZZZZZZ9',                                       X00216   
               LENGTH=7,                                               X00217   
               POS=(16,22)                                              00218   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(16,30),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00702                           00220   
****************************************                                00221   
APRI11   DFHMDF ATTRB=(UNPROT,NUM),                                    X00222   
               COLOR=GREEN,                                            X00224   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               PICOUT='ZZZZ9.99',                                      X00225   
               LENGTH=8,                                               X00226   
               POS=(16,33)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00702                           00229   
****************************************                                00230   
AXPRI11  DFHMDF ATTRB=(ASKIP),                                         X00231   
               COLOR=BLUE,                                             X00233   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               PICOUT='ZZZZZZZZZZ.ZZ',                                 X00234**3
               LENGTH=13,                                              X00235**3
               POS=(16,42)                                              00236**3
****************************************                                00237   
* VARIABLE = MESSAGE-REASON FOR ADJUSTMENT                              00238   
****************************************                                00239   
ADMSG11  DFHMDF ATTRB=(UNPROT),                                        X00240   
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=20,                                              X00242   
               POS=(16,57)                                              00243**2
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(16,78),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 17                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
****************************************                                00203   
*  VARIABLE = -SKU-NUMBER           X008                                00204   
****************************************                                00205   
ASKU12   DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00206   
               COLOR=GREEN,                                            X00207   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=15,                                              X00208   
               POS=(17,04)                                              00209   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(17,20),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY      N007                             00211   
****************************************                                00212   
AQTY12   DFHMDF ATTRB=(UNPROT,NUM),                                    X00213   
               COLOR=GREEN,                                            X00215   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(RIGHT,BLANK),                                  X00214   
               PICOUT='ZZZZZZ9',                                       X00216   
               LENGTH=7,                                               X00217   
               POS=(17,22)                                              00218   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(17,30),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00702                           00220   
****************************************                                00221   
APRI12   DFHMDF ATTRB=(UNPROT,NUM),                                    X00222   
               COLOR=GREEN,                                            X00224   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               PICOUT='ZZZZ9.99',                                      X00225   
               LENGTH=8,                                               X00226   
               POS=(17,33)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00702                           00229   
****************************************                                00230   
AXPRI12  DFHMDF ATTRB=(ASKIP),                                         X00231   
               COLOR=BLUE,                                             X00233   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               PICOUT='ZZZZZZZZZZ.ZZ',                                 X00234**3
               LENGTH=13,                                              X00235**3
               POS=(17,42)                                              00236**3
****************************************                                00237   
* VARIABLE = MESSAGE-REASON FOR ADJUSTMENT                              00238   
****************************************                                00239   
ADMSG12  DFHMDF ATTRB=(UNPROT),                                        X00240   
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=20,                                              X00242   
               POS=(17,57)                                              00243**2
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(17,78),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 18                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
****************************************                                00203   
*  VARIABLE = -SKU-NUMBER           X008                                00204   
****************************************                                00205   
ASKU13   DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00206   
               COLOR=GREEN,                                            X00207   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=15,                                              X00208   
               POS=(18,04)                                              00209   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(18,20),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY      N007                             00211   
****************************************                                00212   
AQTY13   DFHMDF ATTRB=(UNPROT,NUM),                                    X00213   
               COLOR=GREEN,                                            X00215   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(RIGHT,BLANK),                                  X00214   
               PICOUT='ZZZZZZ9',                                       X00216   
               LENGTH=7,                                               X00217   
               POS=(18,22)                                              00218   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(18,30),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00702                           00220   
****************************************                                00221   
APRI13   DFHMDF ATTRB=(UNPROT,NUM),                                    X00222   
               COLOR=GREEN,                                            X00224   
               HILIGHT=UNDERLINE,                                      X        
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               PICOUT='ZZZZ9.99',                                      X00225   
               LENGTH=8,                                               X00226   
               POS=(18,33)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00702                           00229   
****************************************                                00230   
AXPRI13  DFHMDF ATTRB=(ASKIP),                                         X00231   
               COLOR=BLUE,                                             X00233   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               PICOUT='ZZZZZZZZZZ.ZZ',                                 X00234**3
               LENGTH=13,                                              X00235**3
               POS=(18,42)                                              00236**3
****************************************                                00237   
* VARIABLE = MESSAGE-REASON FOR ADJUSTMENT                              00238   
****************************************                                00239   
ADMSG13  DFHMDF ATTRB=(UNPROT),                                        X00240   
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=20,                                              X00242   
               POS=(18,57)                                              00243**2
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(18,78),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00046   
*                                                                       00047   
*  SCREEN LINE 19                                                       00048   
*                                                                       00049   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00050   
****************************************                                00189   
*  VARIABLE = -TOTAL-LINE                                               00190   
****************************************                                00191   
ATOT01   DFHMDF ATTRB=(ASKIP),                                         X00192   
               COLOR=BLUE,                                             X00193   
               LENGTH=5,                                               X00194   
               PICOUT='XXXXX',                                         X00175   
               INITIAL='TOTAL',                                        X00175   
               POS=(19,10)                                              00195   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(19,16),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00196   
*  VARIABLE = -TOTAL-QTY         X002                                   00197   
****************************************                                00198   
ATQTY01  DFHMDF ATTRB=(ASKIP),                                         X00199   
               COLOR=BLUE,                                             X00200   
               LENGTH=11,                                              X00201   
               JUSTIFY=(RIGHT),                                        X00232   
               PICOUT='-ZZ,ZZZ,ZZ9',                                   X00234**3
               POS=(19,18)                                              00202   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(19,30),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
****************************************                                00203   
*  VARIABLE = -TOTAL EXTENDED      X003                                 00204   
****************************************                                00205   
ATRTL01  DFHMDF ATTRB=(ASKIP),                                         X00206   
               LENGTH=18,                                              X00208   
               COLOR=BLUE,                                             X00200   
               JUSTIFY=(RIGHT),                                        X00232   
               PICOUT='ZZZ,ZZZ,ZZZ,ZZZ.99',                            X00234**3
               POS=(19,37)                                              00209   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               POS=(19,56),                                            X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1                                                 00176   
         DFHMSD TYPE=FINAL                                              00105   
         END                                                            00106   
