  PRINT  NOGEN                                                                  
*-------------------------------------------------------------------*           
*                                                                   *           
*        MAPSET  INKM044                                            *           
*        MAP     IN044A                                             *           
*        PROGRAM INKCS044 (PHYSICAL INVENTORY LAPTOP DATA SCREEN)   *           
*        TRANSID I044                                               *           
*        SYSTEM  CICS ARCHITECTURE                                  *           
*                                                                       00016   
*  WR26600  07/  /2004  PHYSICAL INVENTORY STORE EXPANSION              00016   
*    M JOHNSON                                                          00016   
*                                                                               
*  WR28545  05/10/2006  PHYSICAL COUNT TOTAL CHANGES                    00016   
*    J SELWITSCHKA                                                      00016   
*                                                                               
*-------------------------------------------------------------------*           
INKM044 DFHMSD TYPE=DSECT,                                             C        
               LANG=COBOL,                                             C        
               MODE=INOUT,                                             C        
               STORAGE=AUTO,                                           C        
               TERM=3270-2,                                            C        
               TIOAPFX=YES                                                      
IN044A  DFHMDI LINE=2,                                                 C        
               COLUMN=1,                                               C        
               SIZE=(19,80),                                           C        
               CTRL=(FREEKB),                                          C        
               MAPATTS=(COLOR,HILIGHT),                                C        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
*  SCREEN LINE 04                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
        DFHMDF POS=(03,20),LENGTH=13,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='STORE NUMBER:'                                          
ASTORE  DFHMDF POS=(03,34),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
        DFHMDF POS=(03,39),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
*  SCREEN LINE 05                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
        DFHMDF POS=(04,20),LENGTH=13,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='STORE NAME..:'                                          
ASTDESC DFHMDF POS=(04,34),LENGTH=25,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
        DFHMDF POS=(04,60),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
*  SCREEN LINE 07                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
        DFHMDF POS=(06,20),LENGTH=26,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='DATE/TIME COUNT COMPLETED:'                             
ACOMPMM DFHMDF POS=(06,47),LENGTH=02,ATTRB=(UNPROT,NORM),              C        
               COLOR=GREEN,HILIGHT=UNDERLINE,                          C        
               INITIAL='MM'                                                     
        DFHMDF POS=(06,50),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='/'                                                      
ACOMPDD DFHMDF POS=(06,52),LENGTH=02,ATTRB=(UNPROT,NORM),              C        
               COLOR=GREEN,HILIGHT=UNDERLINE,                          C        
               INITIAL='DD'                                                     
        DFHMDF POS=(06,55),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='/'                                                      
ACOMPYY DFHMDF POS=(06,57),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
        DFHMDF POS=(06,62),LENGTH=01,ATTRB=(ASKIP)                              
ACOMPHR DFHMDF POS=(06,65),LENGTH=02,ATTRB=(UNPROT,NORM),              C        
               COLOR=GREEN,HILIGHT=UNDERLINE,                          C        
               INITIAL='HH'                                                     
        DFHMDF POS=(06,68),LENGTH=01,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL=':'                                                      
ACOMPMI DFHMDF POS=(06,70),LENGTH=02,ATTRB=(UNPROT,NORM),              C        
               COLOR=GREEN,HILIGHT=UNDERLINE,                          C        
               INITIAL='MM'                                                     
ACOMPID DFHMDF POS=(06,73),LENGTH=02,ATTRB=(UNPROT,NORM),              C        
               COLOR=GREEN,HILIGHT=UNDERLINE,                          C        
               INITIAL='AM'                                                     
        DFHMDF POS=(06,76),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
*  SCREEN LINE 09                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
        DFHMDF POS=(08,20),LENGTH=35,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='FILE TRANSMISSION SUCCESSFUL (Y/N):'                    
ASTTR01 DFHMDF POS=(08,56),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               COLOR=GREEN,HILIGHT=UNDERLINE,                          C        
               PICOUT='X(01)'                                           00151   
        DFHMDF POS=(08,58),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
*  SCREEN LINE 11                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
        DFHMDF POS=(10,20),LENGTH=22,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='INVENTORY COUNT TOTALS'                                 
        DFHMDF POS=(10,56),LENGTH=07,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='DOLLARS'                                                
        DFHMDF POS=(10,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='QUANTITY'                                               
*                                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
*  SCREEN LINE 13                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
        DFHMDF POS=(12,20),LENGTH=28,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='STORE TOTALS...............:'                           
AEXTN01 DFHMDF POS=(12,49),LENGTH=14,ATTRB=(UNPROT,NORM),              C        
               COLOR=GREEN,HILIGHT=UNDERLINE,                          C        
               PICOUT='ZZZ,ZZZ,ZZ9.99'                                  00151   
        DFHMDF POS=(12,65),LENGTH=01,ATTRB=(ASKIP)                              
AQTY01  DFHMDF POS=(12,67),LENGTH=11,ATTRB=(UNPROT,NORM),              C        
               COLOR=GREEN,HILIGHT=UNDERLINE,                          C        
               PICOUT='ZZZ,ZZZ,ZZ9'                                     00151   
        DFHMDF POS=(12,80),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
*  SCREEN LINE 14                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
AFITOTL DFHMDF POS=(13,20),LENGTH=28,ATTRB=(PROT,NORM),                C        
               COLOR=YELLOW,                                           C        
               INITIAL='FILE TOTALS (        ).....:'                           
        DFHMDF POS=(13,50),LENGTH=01,ATTRB=(ASKIP)                              
AEETOTL DFHMDF POS=(13,49),LENGTH=14,ATTRB=(PROT,NORM),                C        
               COLOR=YELLOW,                                           C        
               PICOUT='ZZZ,ZZZ,ZZ9.99'                                  00151   
        DFHMDF POS=(13,65),LENGTH=01,ATTRB=(ASKIP)                              
AEQTOTL DFHMDF POS=(13,67),LENGTH=11,ATTRB=(PROT,NORM),                C        
               COLOR=YELLOW,                                           C        
               PICOUT='ZZZ,ZZZ,ZZ9'                                     00151   
        DFHMDF POS=(13,80),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
*  SCREEN LINE 16                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
ATRFIR1 DFHMDF POS=(15,20),LENGTH=28,ATTRB=(ASKIP,NORM),               C        
               COLOR=YELLOW,                                           C        
               INITIAL='TRANSMISSION FILES RECEIVED:'                           
ATRFI01 DFHMDF POS=(15,49),LENGTH=03,ATTRB=(PROT,NORM),                C        
               COLOR=YELLOW,                                           C        
               PICOUT='X(03)'                                           00151   
        DFHMDF POS=(15,53),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
*  SCREEN LINE 17                                                               
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                         
AFIBAL1 DFHMDF POS=(16,20),LENGTH=28,ATTRB=(ASKIP,NORM),               C        
               COLOR=YELLOW,                                           C        
               INITIAL='FILE BALANCED..............:'                           
AYES001 DFHMDF POS=(16,49),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=YELLOW,                                           C        
               PICOUT='X(03)'                                           00151   
        DFHMDF POS=(16,53),LENGTH=01,ATTRB=(ASKIP)                              
**************                                                                  
        DFHMSD TYPE=FINAL                                                       
**************                                                                  
        END                                                                     
