*          DATA SET INKM035    AT LEVEL 006 AS OF 08/03/94                      
  PRINT  NOGEN                                                          00001   
************************************************************            00002   
*  BMS MAPSET :  INKM035                                                00017   
*      MAP    :  IN035A                                                 00018   
*                                                                       00016   
*  WR26600  07/  /2004  PHYSICAL INVENTORY STORE EXPANSION              00016   
*    M JOHNSON                                                          00016   
*                                                                       00016   
************************************************************            00019   
INKM035  DFHMSD TYPE=&SYSPARM,                                         X00020**5
               CTRL=(FREEKB),                                          X00021   
               TERM=3270-2,                                            X00022   
               LANG=COBOL,                                             X00023   
               MODE=INOUT,                                             X00024   
               TIOAPFX=YES,                                            X00025   
               STORAGE=AUTO                                             00026   
IN035A   DFHMDI LINE=2,                                                X00027**2
               COLUMN=1,                                               X00028   
               SIZE=(20,80),                                           X00029**2
               MAPATTS=(COLOR,HILIGHT),                                X00030**2
               DSATTS=(COLOR,HILIGHT)                                   00031**6
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*  SCREEN LINE 03                                                       00034   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00077   
               INITIAL='ITEMS',                                        X00078   
               COLOR=NEUTRAL,                                          X00079   
               LENGTH=5,                                               X00080   
               POS=(02,51)                                              00081   
****************************************                                00082   
*  VARIABLE = ASTRTIT      N005                                         00083   
****************************************                                00084   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00085   
               JUSTIFY=(LEFT,BLANK),                                   X00086   
               COLOR=GREEN,                                            X00087   
               HILIGHT=UNDERLINE,                                      X00088   
               PICOUT='ZZZZ9',                                         X00089   
               LENGTH=5,                                               X00090   
               POS=(02,57)                                              00091   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00092   
               INITIAL='TO',                                           X00093   
               COLOR=NEUTRAL,                                          X00094   
               LENGTH=2,                                               X00095   
               POS=(02,63)                                              00096   
****************************************                                00097   
*  VARIABLE = AENDIT      N005                                          00098   
****************************************                                00099   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00100   
               JUSTIFY=(LEFT,BLANK),                                   X00101   
               COLOR=BLUE,                                             X00102   
               PICOUT='ZZZZ9',                                         X00103   
               LENGTH=5,                                               X00104   
               POS=(02,66)                                              00105   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00106   
               INITIAL='OF',                                           X00107   
               COLOR=NEUTRAL,                                          X00108   
               LENGTH=2,                                               X00109   
               POS=(02,72)                                              00110   
****************************************                                00111   
*  VARIABLE = ATOTIT      N005                                          00112   
****************************************                                00113   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00114   
               JUSTIFY=(LEFT,BLANK),                                   X00115   
               COLOR=BLUE,                                             X00116   
               PICOUT='ZZZZ9',                                         X00117   
               LENGTH=5,                                               X00118   
               POS=(02,75)                                              00119   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00113   
*  SCREEN LINE 03                                                       00115**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00117   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00160   
               INITIAL='LOC',                                          X00161   
               COLOR=NEUTRAL,                                          X00162   
               LENGTH=3,                                               X00163   
               POS=(03,26)                                              00164**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00160   
               INITIAL='INV',                                          X00161   
               COLOR=NEUTRAL,                                          X00162   
               LENGTH=3,                                               X00163   
               POS=(03,32)                                              00164**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00169   
               INITIAL='ACTL RCV',                                     X00170   
               COLOR=NEUTRAL,                                          X00171   
               LENGTH=8,                                               X00172   
               POS=(03,38)                                              00173**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00174   
               INITIAL='ON-LINE',                                      X00175   
               COLOR=NEUTRAL,                                          X00176   
               LENGTH=7,                                               X00177   
               POS=(03,47)                                              00178**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00174   
               INITIAL='SALES',                                        X00175   
               COLOR=NEUTRAL,                                          X00176   
               LENGTH=5,                                               X00177   
               POS=(03,57)                                              00178**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00188   
               INITIAL='UNIT',                                         X00189   
               COLOR=NEUTRAL,                                          X00190   
               LENGTH=4,                                               X00191   
               POS=(03,67)                                              00192**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00136   
*  SCREEN LINE 04                                                       00138**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00140   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00141   
               INITIAL='SEL',                                          X00142   
               COLOR=NEUTRAL,                                          X00143   
               LENGTH=3,                                               X00144   
               POS=(04,1)                                               00145**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00146   
               INITIAL='ACT',                                          X00147   
               COLOR=NEUTRAL,                                          X00148   
               LENGTH=3,                                               X00149   
               POS=(04,6)                                               00150**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00155   
               INITIAL='STORE',                                        X00156   
               COLOR=NEUTRAL,                                          X00157   
               LENGTH=5,                                               X00158   
               POS=(04,10)                                              00159**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00160   
               INITIAL='TYPE',                                         X00161   
               COLOR=NEUTRAL,                                          X00162   
               LENGTH=4,                                               X00163   
               POS=(04,26)                                              00164**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00160   
               INITIAL='DATE',                                         X00161   
               COLOR=NEUTRAL,                                          X00162   
               LENGTH=4,                                               X00163   
               POS=(04,32)                                              00164**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00169   
               INITIAL='DATE',                                         X00170   
               COLOR=NEUTRAL,                                          X00171   
               LENGTH=4,                                               X00172   
               POS=(04,38)                                              00173**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00174   
               INITIAL='SHEET',                                        X00175   
               COLOR=NEUTRAL,                                          X00176   
               LENGTH=5,                                               X00177   
               POS=(04,47)                                              00178**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00174   
               INITIAL='ADJ',                                          X00175   
               COLOR=NEUTRAL,                                          X00176   
               LENGTH=3,                                               X00177   
               POS=(04,57)                                              00178**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00188   
               INITIAL='BOOK',                                         X00189   
               COLOR=NEUTRAL,                                          X00190   
               LENGTH=4,                                               X00191   
               POS=(04,67)                                              00192**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00193   
*  SCREEN LINE 05                                                       00195**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00197   
****************************************                                00198   
*  VARIABLE = ASEL01      X001                                          00199   
****************************************                                00200   
ASEL01   DFHMDF ATTRB=(UNPROT,NORM,IC),                                X00201**3
               COLOR=GREEN,                                            X00202   
               HILIGHT=UNDERLINE,                                      X00203   
               LENGTH=1,                                               X00204   
               POS=(05,2)                                               00205**2
         DFHMDF ATTRB=(ASKIP),                                         X00206   
               POS=(05,4),                                             X00207**2
               INITIAL=' ',                                            X00208   
               LENGTH=1                                                 00209   
****************************************                                00210   
*  VARIABLE = AACT01      X003                                          00211   
****************************************                                00212   
AACT01   DFHMDF ATTRB=(ASKIP),                                         X00213   
               LENGTH=3,                                               X00214   
               POS=(05,6)                                               00215**2
****************************************                                00220   
*  VARIABLE = STORE            X003                                     00221   
****************************************                                00222   
ASTOR01  DFHMDF ATTRB=(PROT),                                          X00223**2
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00224   
               POS=(05,10)                                              00225**2
****************************************                                00220   
*  VARIABLE = STORE-NAME       X010                                     00221   
****************************************                                00222   
ANAME01  DFHMDF ATTRB=(PROT),                                          X00223**2
               LENGTH=10,                                              X00224   
               POS=(05,15)                                              00225**2
****************************************                                00226   
*  VARIABLE = LOC-TYPE   X006                                           00227   
****************************************                                00228   
ALTYP01  DFHMDF ATTRB=(PROT),                                          X00229**2
               LENGTH=5,                                               X00232   
               POS=(05,26)                                              00233**2
****************************************                                00238   
*  VARIABLE INV DTE     X005                                            00239   
****************************************                                00240   
AIDTE01  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=5,                                               X00242   
               POS=(05,32)                                              00243**2
****************************************                                00248   
*  VARIABLE ACTL-INV-RCV-DATE X008                                      00249   
****************************************                                00250   
ARCVD01  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=8,                                               X00252   
               POS=(05,38)                                              00253**2
****************************************                                00248   
*  VARIABLE = ONLNE SHEET X009                                          00249   
****************************************                                00250   
ASHET01  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=9,                                               X00252   
               POS=(05,47)                                              00253**2
****************************************                                00238   
*  VARIABLE SALES ADJ DATE X009                                         00239   
****************************************                                00240   
AADTE01  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=9,                                               X00242   
               POS=(05,57)                                              00243**2
****************************************                                00238   
*  VARIABLE UNIT BOOK DATE X012                                         00239   
****************************************                                00240   
AUDTE01  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=12,                                              X00242   
               POS=(05,67)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00258   
*  SCREEN LINE 06                                                       00260**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00262   
****************************************                                00263   
*  VARIABLE = ASEL02      X001                                          00264**2
****************************************                                00265   
ASEL02   DFHMDF ATTRB=(UNPROT,IC),                                     X00266**2
               COLOR=GREEN,                                            X00202   
               HILIGHT=UNDERLINE,                                      X00203   
               LENGTH=1,                                               X00204   
               POS=(06,2)                                               00205**2
         DFHMDF ATTRB=(ASKIP),                                         X00206   
               POS=(06,4),                                             X00207**2
               INITIAL=' ',                                            X00208   
               LENGTH=1                                                 00209   
****************************************                                00210   
*  VARIABLE = AACT02      X003                                          00211   
****************************************                                00212   
AACT02   DFHMDF ATTRB=(ASKIP),                                         X00213   
               LENGTH=3,                                               X00214   
               POS=(06,6)                                               00215**2
****************************************                                00220   
*  VARIABLE = STORE            X004                                     00221   
****************************************                                00222   
ASTOR02  DFHMDF ATTRB=(PROT),                                          X00223**2
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00224   
               POS=(06,10)                                              00225**2
****************************************                                00220   
*  VARIABLE = STORE-NAME       X010                                     00221   
****************************************                                00222   
ANAME02  DFHMDF ATTRB=(PROT),                                          X00223**2
               LENGTH=10,                                              X00224   
               POS=(06,15)                                              00225**2
****************************************                                00226   
*  VARIABLE = LOC-TYPE   X006                                           00227   
****************************************                                00228   
ALTYP02  DFHMDF ATTRB=(PROT),                                          X00229**2
               LENGTH=5,                                               X00232   
               POS=(06,26)                                              00233**2
****************************************                                00238   
*  VARIABLE INV DTE     X005                                            00239   
****************************************                                00240   
AIDTE02  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=5,                                               X00242   
               POS=(06,32)                                              00243**2
****************************************                                00248   
*  VARIABLE ACTL-INV-RCV-DATE X008                                      00249   
****************************************                                00250   
ARCVD02  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=8,                                               X00252   
               POS=(06,38)                                              00253**2
****************************************                                00248   
*  VARIABLE = ONLNE SHEET X009                                          00249   
****************************************                                00250   
ASHET02  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=9,                                               X00252   
               POS=(06,47)                                              00253**2
****************************************                                00238   
*  VARIABLE SALES ADJ DATE X009                                         00239   
****************************************                                00240   
AADTE02  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=9,                                               X00242   
               POS=(06,57)                                              00243**2
****************************************                                00238   
*  VARIABLE UNIT BOOK DATE X012                                         00239   
****************************************                                00240   
AUDTE02  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=12,                                              X00242   
               POS=(06,67)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00323   
*  SCREEN LINE 07                                                       00325**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00327   
****************************************                                00328   
*  VARIABLE = ASEL03      X001                                          00329**2
****************************************                                00330   
ASEL03   DFHMDF ATTRB=(UNPROT,IC),                                     X00331**2
               COLOR=GREEN,                                            X00202   
               HILIGHT=UNDERLINE,                                      X00203   
               LENGTH=1,                                               X00204   
               POS=(07,2)                                               00205**2
         DFHMDF ATTRB=(ASKIP),                                         X00206   
               POS=(07,4),                                             X00207**2
               INITIAL=' ',                                            X00208   
               LENGTH=1                                                 00209   
****************************************                                00210   
*  VARIABLE = AACT03      X003                                          00211   
****************************************                                00212   
AACT03   DFHMDF ATTRB=(ASKIP),                                         X00213   
               LENGTH=3,                                               X00214   
               POS=(07,6)                                               00215**2
****************************************                                00220   
*  VARIABLE = STORE            X004                                     00221   
****************************************                                00222   
ASTOR03  DFHMDF ATTRB=(PROT),                                          X00223**2
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00224   
               POS=(07,10)                                              00225**2
****************************************                                00220   
*  VARIABLE = STORE-NAME       X010                                     00221   
****************************************                                00222   
ANAME03  DFHMDF ATTRB=(PROT),                                          X00223**2
               LENGTH=10,                                              X00224   
               POS=(07,15)                                              00225**2
****************************************                                00226   
*  VARIABLE = LOC-TYPE   X006                                           00227   
****************************************                                00228   
ALTYP03  DFHMDF ATTRB=(PROT),                                          X00229**2
               LENGTH=5,                                               X00232   
               POS=(07,26)                                              00233**2
****************************************                                00238   
*  VARIABLE INV DTE     X005                                            00239   
****************************************                                00240   
AIDTE03  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=5,                                               X00242   
               POS=(07,32)                                              00243**2
****************************************                                00248   
*  VARIABLE ACTL-INV-RCV-DATE X008                                      00249   
****************************************                                00250   
ARCVD03  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=8,                                               X00252   
               POS=(07,38)                                              00253**2
****************************************                                00248   
*  VARIABLE = ONLNE SHEET X009                                          00249   
****************************************                                00250   
ASHET03  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=9,                                               X00252   
               POS=(07,47)                                              00253**2
****************************************                                00238   
*  VARIABLE SALES ADJ DATE X009                                         00239   
****************************************                                00240   
AADTE03  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=9,                                               X00242   
               POS=(07,57)                                              00243**2
****************************************                                00238   
*  VARIABLE UNIT BOOK DATE X012                                         00239   
****************************************                                00240   
AUDTE03  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=12,                                              X00242   
               POS=(07,67)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00388   
*  SCREEN LINE 08                                                       00390**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00392   
****************************************                                00393   
*  VARIABLE = ASEL04      X001                                          00394**2
****************************************                                00395   
ASEL04   DFHMDF ATTRB=(UNPROT,IC),                                     X00396**2
               COLOR=GREEN,                                            X00202   
               HILIGHT=UNDERLINE,                                      X00203   
               LENGTH=1,                                               X00204   
               POS=(08,2)                                               00205**2
         DFHMDF ATTRB=(ASKIP),                                         X00206   
               POS=(08,4),                                             X00207**2
               INITIAL=' ',                                            X00208   
               LENGTH=1                                                 00209   
****************************************                                00210   
*  VARIABLE = AACT03      X003                                          00211   
****************************************                                00212   
AACT04   DFHMDF ATTRB=(ASKIP),                                         X00213   
               LENGTH=3,                                               X00214   
               POS=(08,6)                                               00215**2
****************************************                                00220   
*  VARIABLE = STORE            X004                                     00221   
****************************************                                00222   
ASTOR04  DFHMDF ATTRB=(PROT),                                          X00223**2
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00224   
               POS=(08,10)                                              00225**2
****************************************                                00220   
*  VARIABLE = STORE-NAME       X010                                     00221   
****************************************                                00222   
ANAME04  DFHMDF ATTRB=(PROT),                                          X00223**2
               LENGTH=10,                                              X00224   
               POS=(08,15)                                              00225**2
****************************************                                00226   
*  VARIABLE = LOC-TYPE   X006                                           00227   
****************************************                                00228   
ALTYP04  DFHMDF ATTRB=(PROT),                                          X00229**2
               LENGTH=5,                                               X00232   
               POS=(08,26)                                              00233**2
****************************************                                00238   
*  VARIABLE INV DTE     X005                                            00239   
****************************************                                00240   
AIDTE04  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=5,                                               X00242   
               POS=(08,32)                                              00243**2
****************************************                                00248   
*  VARIABLE ACTL-INV-RCV-DATE X008                                      00249   
****************************************                                00250   
ARCVD04  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=8,                                               X00252   
               POS=(08,38)                                              00253**2
****************************************                                00248   
*  VARIABLE = ONLNE SHEET X009                                          00249   
****************************************                                00250   
ASHET04  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=9,                                               X00252   
               POS=(08,47)                                              00253**2
****************************************                                00238   
*  VARIABLE SALES ADJ DATE X009                                         00239   
****************************************                                00240   
AADTE04  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=9,                                               X00242   
               POS=(08,57)                                              00243**2
****************************************                                00238   
*  VARIABLE UNIT BOOK DATE X012                                         00239   
****************************************                                00240   
AUDTE04  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=12,                                              X00242   
               POS=(08,67)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00453   
*  SCREEN LINE 09                                                       00455**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00457   
****************************************                                00458   
*  VARIABLE = ASEL05      X001                                          00459**2
****************************************                                00460   
ASEL05   DFHMDF ATTRB=(UNPROT,IC),                                     X00461**2
               COLOR=GREEN,                                            X00202   
               HILIGHT=UNDERLINE,                                      X00203   
               LENGTH=1,                                               X00204   
               POS=(09,2)                                               00205**2
         DFHMDF ATTRB=(ASKIP),                                         X00206   
               POS=(09,4),                                             X00207**2
               INITIAL=' ',                                            X00208   
               LENGTH=1                                                 00209   
****************************************                                00210   
*  VARIABLE = AACT03      X003                                          00211   
****************************************                                00212   
AACT05   DFHMDF ATTRB=(ASKIP),                                         X00213   
               LENGTH=3,                                               X00214   
               POS=(09,6)                                               00215**2
****************************************                                00220   
*  VARIABLE = STORE            X004                                     00221   
****************************************                                00222   
ASTOR05  DFHMDF ATTRB=(PROT),                                          X00223**2
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00224   
               POS=(09,10)                                              00225**2
****************************************                                00220   
*  VARIABLE = STORE-NAME       X010                                     00221   
****************************************                                00222   
ANAME05  DFHMDF ATTRB=(PROT),                                          X00223**2
               LENGTH=10,                                              X00224   
               POS=(09,15)                                              00225**2
****************************************                                00226   
*  VARIABLE = LOC-TYPE   X006                                           00227   
****************************************                                00228   
ALTYP05  DFHMDF ATTRB=(PROT),                                          X00229**2
               LENGTH=5,                                               X00232   
               POS=(09,26)                                              00233**2
****************************************                                00238   
*  VARIABLE INV DTE     X005                                            00239   
****************************************                                00240   
AIDTE05  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=5,                                               X00242   
               POS=(09,32)                                              00243**2
****************************************                                00248   
*  VARIABLE ACTL-INV-RCV-DATE X008                                      00249   
****************************************                                00250   
ARCVD05  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=8,                                               X00252   
               POS=(09,38)                                              00253**2
****************************************                                00248   
*  VARIABLE = ONLNE SHEET X009                                          00249   
****************************************                                00250   
ASHET05  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=9,                                               X00252   
               POS=(09,47)                                              00253**2
****************************************                                00238   
*  VARIABLE SALES ADJ DATE X009                                         00239   
****************************************                                00240   
AADTE05  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=9,                                               X00242   
               POS=(09,57)                                              00243**2
****************************************                                00238   
*  VARIABLE UNIT BOOK DATE X012                                         00239   
****************************************                                00240   
AUDTE05  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=12,                                              X00242   
               POS=(09,67)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00518   
*  SCREEN LINE 10                                                       00520**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00522   
****************************************                                00523   
*  VARIABLE = ASEL06      X001                                          00524**2
****************************************                                00525   
ASEL06   DFHMDF ATTRB=(UNPROT,IC),                                     X00526**2
               COLOR=GREEN,                                            X00202   
               HILIGHT=UNDERLINE,                                      X00203   
               LENGTH=1,                                               X00204   
               POS=(10,2)                                               00205**2
         DFHMDF ATTRB=(ASKIP),                                         X00206   
               POS=(10,4),                                             X00207**2
               INITIAL=' ',                                            X00208   
               LENGTH=1                                                 00209   
****************************************                                00210   
*  VARIABLE = AACT03      X003                                          00211   
****************************************                                00212   
AACT06   DFHMDF ATTRB=(ASKIP),                                         X00213   
               LENGTH=3,                                               X00214   
               POS=(10,6)                                               00215**2
****************************************                                00220   
*  VARIABLE = STORE            X004                                     00221   
****************************************                                00222   
ASTOR06  DFHMDF ATTRB=(PROT),                                          X00223**2
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00224   
               POS=(10,10)                                              00225**2
****************************************                                00220   
*  VARIABLE = STORE-NAME       X010                                     00221   
****************************************                                00222   
ANAME06  DFHMDF ATTRB=(PROT),                                          X00223**2
               LENGTH=10,                                              X00224   
               POS=(10,15)                                              00225**2
****************************************                                00226   
*  VARIABLE = LOC-TYPE   X006                                           00227   
****************************************                                00228   
ALTYP06  DFHMDF ATTRB=(PROT),                                          X00229**2
               LENGTH=5,                                               X00232   
               POS=(10,26)                                              00233**2
****************************************                                00238   
*  VARIABLE INV DTE     X005                                            00239   
****************************************                                00240   
AIDTE06  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=5,                                               X00242   
               POS=(10,32)                                              00243**2
****************************************                                00248   
*  VARIABLE ACTL-INV-RCV-DATE X008                                      00249   
****************************************                                00250   
ARCVD06  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=8,                                               X00252   
               POS=(10,38)                                              00253**2
****************************************                                00248   
*  VARIABLE = ONLNE SHEET X009                                          00249   
****************************************                                00250   
ASHET06  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=9,                                               X00252   
               POS=(10,47)                                              00253**2
****************************************                                00238   
*  VARIABLE SALES ADJ DATE X009                                         00239   
****************************************                                00240   
AADTE06  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=9,                                               X00242   
               POS=(10,57)                                              00243**2
****************************************                                00238   
*  VARIABLE UNIT BOOK DATE X012                                         00239   
****************************************                                00240   
AUDTE06  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=12,                                              X00242   
               POS=(10,67)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00583   
*  SCREEN LINE 11                                                       00585**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00587   
****************************************                                00588   
*  VARIABLE = ASEL07      X001                                          00589**2
****************************************                                00590   
ASEL07   DFHMDF ATTRB=(UNPROT,IC),                                     X00591**2
               COLOR=GREEN,                                            X00202   
               HILIGHT=UNDERLINE,                                      X00203   
               LENGTH=1,                                               X00204   
               POS=(11,2)                                               00205**2
         DFHMDF ATTRB=(ASKIP),                                         X00206   
               POS=(11,4),                                             X00207**2
               INITIAL=' ',                                            X00208   
               LENGTH=1                                                 00209   
****************************************                                00210   
*  VARIABLE = AACT03      X003                                          00211   
****************************************                                00212   
AACT07   DFHMDF ATTRB=(ASKIP),                                         X00213   
               LENGTH=3,                                               X00214   
               POS=(11,6)                                               00215**2
****************************************                                00220   
*  VARIABLE = STORE            X004                                     00221   
****************************************                                00222   
ASTOR07  DFHMDF ATTRB=(PROT),                                          X00223**2
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00224   
               POS=(11,10)                                              00225**2
****************************************                                00220   
*  VARIABLE = STORE-NAME       X010                                     00221   
****************************************                                00222   
ANAME07  DFHMDF ATTRB=(PROT),                                          X00223**2
               LENGTH=10,                                              X00224   
               POS=(11,15)                                              00225**2
****************************************                                00226   
*  VARIABLE = LOC-TYPE   X006                                           00227   
****************************************                                00228   
ALTYP07  DFHMDF ATTRB=(PROT),                                          X00229**2
               LENGTH=5,                                               X00232   
               POS=(11,26)                                              00233**2
****************************************                                00238   
*  VARIABLE INV DTE     X005                                            00239   
****************************************                                00240   
AIDTE07  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=5,                                               X00242   
               POS=(11,32)                                              00243**2
****************************************                                00248   
*  VARIABLE ACTL-INV-RCV-DATE X008                                      00249   
****************************************                                00250   
ARCVD07  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=8,                                               X00252   
               POS=(11,38)                                              00253**2
****************************************                                00248   
*  VARIABLE = ONLNE SHEET X009                                          00249   
****************************************                                00250   
ASHET07  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=9,                                               X00252   
               POS=(11,47)                                              00253**2
****************************************                                00238   
*  VARIABLE SALES ADJ DATE X009                                         00239   
****************************************                                00240   
AADTE07  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=9,                                               X00242   
               POS=(11,57)                                              00243**2
****************************************                                00238   
*  VARIABLE UNIT BOOK DATE X012                                         00239   
****************************************                                00240   
AUDTE07  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=12,                                              X00242   
               POS=(11,67)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00648   
*  SCREEN LINE 12                                                       00650**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00652   
****************************************                                00653   
*  VARIABLE = ASEL08      X001                                          00654**2
****************************************                                00655   
ASEL08   DFHMDF ATTRB=(UNPROT,IC),                                     X00656**2
               COLOR=GREEN,                                            X00202   
               HILIGHT=UNDERLINE,                                      X00203   
               LENGTH=1,                                               X00204   
               POS=(12,2)                                               00205**2
         DFHMDF ATTRB=(ASKIP),                                         X00206   
               POS=(12,4),                                             X00207**2
               INITIAL=' ',                                            X00208   
               LENGTH=1                                                 00209   
****************************************                                00210   
*  VARIABLE = AACT03      X003                                          00211   
****************************************                                00212   
AACT08   DFHMDF ATTRB=(ASKIP),                                         X00213   
               LENGTH=3,                                               X00214   
               POS=(12,6)                                               00215**2
****************************************                                00220   
*  VARIABLE = STORE            X004                                     00221   
****************************************                                00222   
ASTOR08  DFHMDF ATTRB=(PROT),                                          X00223**2
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00224   
               POS=(12,10)                                              00225**2
****************************************                                00220   
*  VARIABLE = STORE-NAME       X010                                     00221   
****************************************                                00222   
ANAME08  DFHMDF ATTRB=(PROT),                                          X00223**2
               LENGTH=10,                                              X00224   
               POS=(12,15)                                              00225**2
****************************************                                00226   
*  VARIABLE = LOC-TYPE   X006                                           00227   
****************************************                                00228   
ALTYP08  DFHMDF ATTRB=(PROT),                                          X00229**2
               LENGTH=5,                                               X00232   
               POS=(12,26)                                              00233**2
****************************************                                00238   
*  VARIABLE INV DTE     X005                                            00239   
****************************************                                00240   
AIDTE08  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=5,                                               X00242   
               POS=(12,32)                                              00243**2
****************************************                                00248   
*  VARIABLE ACTL-INV-RCV-DATE X008                                      00249   
****************************************                                00250   
ARCVD08  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=8,                                               X00252   
               POS=(12,38)                                              00253**2
****************************************                                00248   
*  VARIABLE = ONLNE SHEET X009                                          00249   
****************************************                                00250   
ASHET08  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=9,                                               X00252   
               POS=(12,47)                                              00253**2
****************************************                                00238   
*  VARIABLE SALES ADJ DATE X009                                         00239   
****************************************                                00240   
AADTE08  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=9,                                               X00242   
               POS=(12,57)                                              00243**2
****************************************                                00238   
*  VARIABLE UNIT BOOK DATE X012                                         00239   
****************************************                                00240   
AUDTE08  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=12,                                              X00242   
               POS=(12,67)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00713   
*  SCREEN LINE 13                                                       00715**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00717   
****************************************                                00718   
*  VARIABLE = ASEL09      X001                                          00719**2
****************************************                                00720   
ASEL09   DFHMDF ATTRB=(UNPROT,IC),                                     X00721**2
               COLOR=GREEN,                                            X00202   
               HILIGHT=UNDERLINE,                                      X00203   
               LENGTH=1,                                               X00204   
               POS=(13,2)                                               00205**2
         DFHMDF ATTRB=(ASKIP),                                         X00206   
               POS=(13,4),                                             X00207**2
               INITIAL=' ',                                            X00208   
               LENGTH=1                                                 00209   
****************************************                                00210   
*  VARIABLE = AACT03      X003                                          00211   
****************************************                                00212   
AACT09   DFHMDF ATTRB=(ASKIP),                                         X00213   
               LENGTH=3,                                               X00214   
               POS=(13,6)                                               00215**2
****************************************                                00220   
*  VARIABLE = STORE            X004                                     00221   
****************************************                                00222   
ASTOR09  DFHMDF ATTRB=(PROT),                                          X00223**2
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00224   
               POS=(13,10)                                              00225**2
****************************************                                00220   
*  VARIABLE = STORE-NAME       X010                                     00221   
****************************************                                00222   
ANAME09  DFHMDF ATTRB=(PROT),                                          X00223**2
               LENGTH=10,                                              X00224   
               POS=(13,15)                                              00225**2
****************************************                                00226   
*  VARIABLE = LOC-TYPE   X006                                           00227   
****************************************                                00228   
ALTYP09  DFHMDF ATTRB=(PROT),                                          X00229**2
               LENGTH=5,                                               X00232   
               POS=(13,26)                                              00233**2
****************************************                                00238   
*  VARIABLE INV DTE     X005                                            00239   
****************************************                                00240   
AIDTE09  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=5,                                               X00242   
               POS=(13,32)                                              00243**2
****************************************                                00248   
*  VARIABLE ACTL-INV-RCV-DATE X008                                      00249   
****************************************                                00250   
ARCVD09  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=8,                                               X00252   
               POS=(13,38)                                              00253**2
****************************************                                00248   
*  VARIABLE = ONLNE SHEET X009                                          00249   
****************************************                                00250   
ASHET09  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=9,                                               X00252   
               POS=(13,47)                                              00253**2
****************************************                                00238   
*  VARIABLE SALES ADJ DATE X009                                         00239   
****************************************                                00240   
AADTE09  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=9,                                               X00242   
               POS=(13,57)                                              00243**2
****************************************                                00238   
*  VARIABLE UNIT BOOK DATE X012                                         00239   
****************************************                                00240   
AUDTE09  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=12,                                              X00242   
               POS=(13,67)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00778   
*  SCREEN LINE 14                                                       00780**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00782   
****************************************                                00783   
*  VARIABLE = ASEL10      X001                                          00784**2
****************************************                                00785   
ASEL10   DFHMDF ATTRB=(UNPROT,IC),                                     X00786**2
               COLOR=GREEN,                                            X00202   
               HILIGHT=UNDERLINE,                                      X00203   
               LENGTH=1,                                               X00204   
               POS=(14,2)                                               00205**2
         DFHMDF ATTRB=(ASKIP),                                         X00206   
               POS=(14,4),                                             X00207**2
               INITIAL=' ',                                            X00208   
               LENGTH=1                                                 00209   
****************************************                                00210   
*  VARIABLE = AACT03      X003                                          00211   
****************************************                                00212   
AACT10   DFHMDF ATTRB=(ASKIP),                                         X00213   
               LENGTH=3,                                               X00214   
               POS=(14,6)                                               00215**2
****************************************                                00220   
*  VARIABLE = STORE            X004                                     00221   
****************************************                                00222   
ASTOR10  DFHMDF ATTRB=(PROT),                                          X00223**2
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00224   
               POS=(14,10)                                              00225**2
****************************************                                00220   
*  VARIABLE = STORE-NAME       X010                                     00221   
****************************************                                00222   
ANAME10  DFHMDF ATTRB=(PROT),                                          X00223**2
               LENGTH=10,                                              X00224   
               POS=(14,15)                                              00225**2
****************************************                                00226   
*  VARIABLE = LOC-TYPE   X006                                           00227   
****************************************                                00228   
ALTYP10  DFHMDF ATTRB=(PROT),                                          X00229**2
               LENGTH=5,                                               X00232   
               POS=(14,26)                                              00233**2
****************************************                                00238   
*  VARIABLE INV DTE     X005                                            00239   
****************************************                                00240   
AIDTE10  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=5,                                               X00242   
               POS=(14,32)                                              00243**2
****************************************                                00248   
*  VARIABLE ACTL-INV-RCV-DATE X008                                      00249   
****************************************                                00250   
ARCVD10  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=8,                                               X00252   
               POS=(14,38)                                              00253**2
****************************************                                00248   
*  VARIABLE = ONLNE SHEET X009                                          00249   
****************************************                                00250   
ASHET10  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=9,                                               X00252   
               POS=(14,47)                                              00253**2
****************************************                                00238   
*  VARIABLE SALES ADJ DATE X009                                         00239   
****************************************                                00240   
AADTE10  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=9,                                               X00242   
               POS=(14,57)                                              00243**2
****************************************                                00238   
*  VARIABLE UNIT BOOK DATE X012                                         00239   
****************************************                                00240   
AUDTE10  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=12,                                              X00242   
               POS=(14,67)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00843   
*  SCREEN LINE 15                                                       00845**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00847   
****************************************                                00848   
*  VARIABLE = ASEL11      X001                                          00849**2
****************************************                                00850   
ASEL11   DFHMDF ATTRB=(UNPROT,IC),                                     X00851**2
               COLOR=GREEN,                                            X00202   
               HILIGHT=UNDERLINE,                                      X00203   
               LENGTH=1,                                               X00204   
               POS=(15,2)                                               00205**2
         DFHMDF ATTRB=(ASKIP),                                         X00206   
               POS=(15,4),                                             X00207**2
               INITIAL=' ',                                            X00208   
               LENGTH=1                                                 00209   
****************************************                                00210   
*  VARIABLE = AACT03      X003                                          00211   
****************************************                                00212   
AACT11   DFHMDF ATTRB=(ASKIP),                                         X00213   
               LENGTH=3,                                               X00214   
               POS=(15,6)                                               00215**2
****************************************                                00220   
*  VARIABLE = STORE            X004                                     00221   
****************************************                                00222   
ASTOR11  DFHMDF ATTRB=(PROT),                                          X00223**2
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00224   
               POS=(15,10)                                              00225**2
****************************************                                00220   
*  VARIABLE = STORE-NAME       X010                                     00221   
****************************************                                00222   
ANAME11  DFHMDF ATTRB=(PROT),                                          X00223**2
               LENGTH=10,                                              X00224   
               POS=(15,15)                                              00225**2
****************************************                                00226   
*  VARIABLE = LOC-TYPE   X006                                           00227   
****************************************                                00228   
ALTYP11  DFHMDF ATTRB=(PROT),                                          X00229**2
               LENGTH=5,                                               X00232   
               POS=(15,26)                                              00233**2
****************************************                                00238   
*  VARIABLE INV DTE     X005                                            00239   
****************************************                                00240   
AIDTE11  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=5,                                               X00242   
               POS=(15,32)                                              00243**2
****************************************                                00248   
*  VARIABLE ACTL-INV-RCV-DATE X008                                      00249   
****************************************                                00250   
ARCVD11  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=8,                                               X00252   
               POS=(15,38)                                              00253**2
****************************************                                00248   
*  VARIABLE = ONLNE SHEET X009                                          00249   
****************************************                                00250   
ASHET11  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=9,                                               X00252   
               POS=(15,47)                                              00253**2
****************************************                                00238   
*  VARIABLE SALES ADJ DATE X009                                         00239   
****************************************                                00240   
AADTE11  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=9,                                               X00242   
               POS=(15,57)                                              00243**2
****************************************                                00238   
*  VARIABLE UNIT BOOK DATE X012                                         00239   
****************************************                                00240   
AUDTE11  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=12,                                              X00242   
               POS=(15,67)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00908   
*  SCREEN LINE 16                                                       00910**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00912   
****************************************                                00913   
*  VARIABLE = ASEL12      X001                                          00914**2
****************************************                                00915   
ASEL12   DFHMDF ATTRB=(UNPROT,IC),                                     X00916**2
               COLOR=GREEN,                                            X00202   
               HILIGHT=UNDERLINE,                                      X00203   
               LENGTH=1,                                               X00204   
               POS=(16,2)                                               00205**2
         DFHMDF ATTRB=(ASKIP),                                         X00206   
               POS=(16,4),                                             X00207**2
               INITIAL=' ',                                            X00208   
               LENGTH=1                                                 00209   
****************************************                                00210   
*  VARIABLE = AACT03      X003                                          00211   
****************************************                                00212   
AACT12   DFHMDF ATTRB=(ASKIP),                                         X00213   
               LENGTH=3,                                               X00214   
               POS=(16,6)                                               00215**2
****************************************                                00220   
*  VARIABLE = STORE            X004                                     00221   
****************************************                                00222   
ASTOR12  DFHMDF ATTRB=(PROT),                                          X00223**2
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00224   
               POS=(16,10)                                              00225**2
****************************************                                00220   
*  VARIABLE = STORE-NAME       X010                                     00221   
****************************************                                00222   
ANAME12  DFHMDF ATTRB=(PROT),                                          X00223**2
               LENGTH=10,                                              X00224   
               POS=(16,15)                                              00225**2
****************************************                                00226   
*  VARIABLE = LOC-TYPE   X006                                           00227   
****************************************                                00228   
ALTYP12  DFHMDF ATTRB=(PROT),                                          X00229**2
               LENGTH=5,                                               X00232   
               POS=(16,26)                                              00233**2
****************************************                                00238   
*  VARIABLE INV DTE     X005                                            00239   
****************************************                                00240   
AIDTE12  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=5,                                               X00242   
               POS=(16,32)                                              00243**2
****************************************                                00248   
*  VARIABLE ACTL-INV-RCV-DATE X008                                      00249   
****************************************                                00250   
ARCVD12  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=8,                                               X00252   
               POS=(16,38)                                              00253**2
****************************************                                00248   
*  VARIABLE = ONLNE SHEET X009                                          00249   
****************************************                                00250   
ASHET12  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=9,                                               X00252   
               POS=(16,47)                                              00253**2
****************************************                                00238   
*  VARIABLE SALES ADJ DATE X009                                         00239   
****************************************                                00240   
AADTE12  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=9,                                               X00242   
               POS=(16,57)                                              00243**2
****************************************                                00238   
*  VARIABLE UNIT BOOK DATE X012                                         00239   
****************************************                                00240   
AUDTE12  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=12,                                              X00242   
               POS=(16,67)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00973   
*  SCREEN LINE 17                                                       00975**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00977   
****************************************                                00978   
*  VARIABLE = ASEL13      X001                                          00979**2
****************************************                                00980   
ASEL13   DFHMDF ATTRB=(UNPROT,IC),                                     X00981**2
               COLOR=GREEN,                                            X00202   
               HILIGHT=UNDERLINE,                                      X00203   
               LENGTH=1,                                               X00204   
               POS=(17,2)                                               00205**2
         DFHMDF ATTRB=(ASKIP),                                         X00206   
               POS=(17,4),                                             X00207**2
               INITIAL=' ',                                            X00208   
               LENGTH=1                                                 00209   
****************************************                                00210   
*  VARIABLE = AACT03      X003                                          00211   
****************************************                                00212   
AACT13   DFHMDF ATTRB=(ASKIP),                                         X00213   
               LENGTH=3,                                               X00214   
               POS=(17,6)                                               00215**2
****************************************                                00220   
*  VARIABLE = STORE            X004                                     00221   
****************************************                                00222   
ASTOR13  DFHMDF ATTRB=(PROT),                                          X00223**2
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00224   
               POS=(17,10)                                              00225**2
****************************************                                00220   
*  VARIABLE = STORE-NAME       X010                                     00221   
****************************************                                00222   
ANAME13  DFHMDF ATTRB=(PROT),                                          X00223**2
               LENGTH=10,                                              X00224   
               POS=(17,15)                                              00225**2
****************************************                                00226   
*  VARIABLE = LOC-TYPE   X006                                           00227   
****************************************                                00228   
ALTYP13  DFHMDF ATTRB=(PROT),                                          X00229**2
               LENGTH=5,                                               X00232   
               POS=(17,26)                                              00233**2
****************************************                                00238   
*  VARIABLE INV DTE     X005                                            00239   
****************************************                                00240   
AIDTE13  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=5,                                               X00242   
               POS=(17,32)                                              00243**2
****************************************                                00248   
*  VARIABLE ACTL-INV-RCV-DATE X008                                      00249   
****************************************                                00250   
ARCVD13  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=8,                                               X00252   
               POS=(17,38)                                              00253**2
****************************************                                00248   
*  VARIABLE = ONLNE SHEET X009                                          00249   
****************************************                                00250   
ASHET13  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=9,                                               X00252   
               POS=(17,47)                                              00253**2
****************************************                                00238   
*  VARIABLE SALES ADJ DATE X009                                         00239   
****************************************                                00240   
AADTE13  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=9,                                               X00242   
               POS=(17,57)                                              00243**2
****************************************                                00238   
*  VARIABLE UNIT BOOK DATE X012                                         00239   
****************************************                                00240   
AUDTE13  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=12,                                              X00242   
               POS=(17,67)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 01038   
*  SCREEN LINE 18                                                       01040**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 01042   
****************************************                                01043   
*  VARIABLE = ASEL14      X001                                          01044**2
****************************************                                01045   
ASEL14   DFHMDF ATTRB=(UNPROT,IC),                                     X01046**2
               COLOR=GREEN,                                            X00202   
               HILIGHT=UNDERLINE,                                      X00203   
               LENGTH=1,                                               X00204   
               POS=(18,2)                                               00205**2
         DFHMDF ATTRB=(ASKIP),                                         X00206   
               POS=(18,4),                                             X00207**2
               INITIAL=' ',                                            X00208   
               LENGTH=1                                                 00209   
****************************************                                00210   
*  VARIABLE = AACT03      X003                                          00211   
****************************************                                00212   
AACT14   DFHMDF ATTRB=(ASKIP),                                         X00213   
               LENGTH=3,                                               X00214   
               POS=(18,6)                                               00215**2
****************************************                                00220   
*  VARIABLE = STORE            X004                                     00221   
****************************************                                00222   
ASTOR14  DFHMDF ATTRB=(PROT),                                          X00223**2
               JUSTIFY=(LEFT,BLANK),                                   X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=4,                                               X00224   
               POS=(18,10)                                              00225**2
****************************************                                00220   
*  VARIABLE = STORE-NAME       X010                                     00221   
****************************************                                00222   
ANAME14  DFHMDF ATTRB=(PROT),                                          X00223**2
               LENGTH=10,                                              X00224   
               POS=(18,15)                                              00225**2
****************************************                                00226   
*  VARIABLE = LOC-TYPE   X006                                           00227   
****************************************                                00228   
ALTYP14  DFHMDF ATTRB=(PROT),                                          X00229**2
               LENGTH=5,                                               X00232   
               POS=(18,26)                                              00233**2
****************************************                                00238   
*  VARIABLE INV DTE     X005                                            00239   
****************************************                                00240   
AIDTE14  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=5,                                               X00242   
               POS=(18,32)                                              00243**2
****************************************                                00248   
*  VARIABLE ACTL-INV-RCV-DATE X008                                      00249   
****************************************                                00250   
ARCVD14  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=8,                                               X00252   
               POS=(18,38)                                              00253**2
****************************************                                00248   
*  VARIABLE = ONLNE SHEET X009                                          00249   
****************************************                                00250   
ASHET14  DFHMDF ATTRB=(PROT),                                          X00251**2
               LENGTH=9,                                               X00252   
               POS=(18,47)                                              00253**2
****************************************                                00238   
*  VARIABLE SALES ADJ DATE X009                                         00239   
****************************************                                00240   
AADTE14  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=9,                                               X00242   
               POS=(18,57)                                              00243**2
****************************************                                00238   
*  VARIABLE UNIT BOOK DATE X012                                         00239   
****************************************                                00240   
AUDTE14  DFHMDF ATTRB=(PROT),                                          X00241**2
               LENGTH=12,                                              X00242   
               POS=(18,67)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 01103   
*  SCREEN LINE 19                                                       01105**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 01107   
         DFHMDF ATTRB=(ASKIP),                                         X01108   
               POS=(19,1),                                             X01109**2
               INITIAL=' ',                                            X01110   
               LENGTH=1                                                 01111   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X01112   
               INITIAL='NUMBER',                                       X01113   
               COLOR=NEUTRAL,                                          X01114   
               LENGTH=6,                                               X01115   
               POS=(19,39)                                              01116**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X01117   
               INITIAL='OF',                                           X01118   
               COLOR=NEUTRAL,                                          X01119   
               LENGTH=2,                                               X01120   
               POS=(19,46)                                              01121**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X01122   
               INITIAL='SELECTED',                                     X01123   
               COLOR=NEUTRAL,                                          X01124   
               LENGTH=8,                                               X01125   
               POS=(19,49)                                              01126**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X01127   
               INITIAL='ITEMS:',                                       X01128   
               COLOR=NEUTRAL,                                          X01129   
               LENGTH=6,                                               X01130   
               POS=(19,58)                                              01131**2
         DFHMDF ATTRB=(ASKIP),                                         X01132   
               POS=(19,65),                                            X01133**2
               INITIAL=' ',                                            X01134   
               LENGTH=1                                                 01135   
****************************************                                01136   
*  VARIABLE = ASELIT      N007                                          01137   
****************************************                                01138   
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X01139   
               JUSTIFY=(LEFT,BLANK),                                   X01140   
               COLOR=BLUE,                                             X01141   
               PICOUT='ZZZZZZZ',                                       X01142   
               LENGTH=7,                                               X01143   
               POS=(19,67)                                              01144**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X01145   
               INITIAL=' ',                                            X01146   
               LENGTH=1,                                               X01147   
               POS=(19,75)                                              01148**2
         DFHMSD TYPE=FINAL                                              01149   
         END                                                            01150   
