*          DATA SET INKM013    AT LEVEL 001 AS OF 09/26/2003                    
  PRINT  NOGEN                                                          00002   
************************************************************            00003   
*                                                                       00004   
*  AACYY - INKM013                                                      00005   
*                                                                       00006   
*     GENERATED          : 09/26/2003 AT 09:00:00 AM                    00007   
*     VERSION            : 1.1.01                                       00008   
*     CSD LEVEL          : 1.1.01                                       00009   
*     AUTHOR             : TKMA372.                                     00010   
*     ENCYCLOPEDIA       : PHYSICAL INVENTORY                           00012   
*     MAP DETAILS                                                       00014   
*     LAST UPDATED 09/26/2003 AT 09:09:03 BY TKMA372 WR#25428           00015   
*-----------------------------------------------------------            00016   
*                                                                       00017   
*  BMS MAPSET :  INKM013                                                00018   
*      MAP    :  INK013A                                                00019   
************************************************************            00020   
INKM013  DFHMSD TYPE=DSECT,                                            X00021   
               LANG=COBOL,                                             X00022   
               CTRL=(FREEKB),                                          X00023   
               MODE=INOUT,                                             X00024   
               TERM=3270-2,                                            X00025   
               TIOAPFX=YES,                                            X00026   
               STORAGE=AUTO                                             00027   
IN013A   DFHMDI LINE=2,COLUMN=1,                                       X00028   
               SIZE=(19,80),                                           X00029   
               MAPATTS=(COLOR,HILIGHT),                                X00030   
               DSATTS=(COLOR,HILIGHT)                                   00031   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00032   
*                                                                       00033   
*  SCREEN LINE 02                                                       00034   
*                                                                       00035   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00036   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00037   
               INITIAL='FOR',                                          X00038   
               COLOR=NEUTRAL,                                          X00039   
               LENGTH=3,                                               X00040   
               POS=(01,28)                                              00041   
****************************************                                00042   
*  VARIABLE = NAME      N004                                            00043   
****************************************                                00044   
ASTRNBR  DFHMDF ATTRB=(ASKIP),                                         X00045   
               LENGTH=4,                                               X00046   
               POS=(01,32)                                              00047   
****************************************                                00042   
*  VARIABLE = NAME      X025                                            00043   
****************************************                                00044   
ASTRNAM  DFHMDF ATTRB=(ASKIP),                                         X00045   
               LENGTH=25,                                              X00046   
               POS=(01,37)                                              00047   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00048   
*                                                                       00049   
*  SCREEN LINE 03                                                       00050   
*                                                                       00051   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00052   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00053   
               INITIAL='AREA',                                         X00054   
               COLOR=NEUTRAL,                                          X00055   
               LENGTH=4,                                               X00056   
               POS=(02,1)                                               00057   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00058   
               INITIAL='NUMBER:',                                      X00059   
               COLOR=NEUTRAL,                                          X00060   
               LENGTH=7,                                               X00061   
               POS=(02,6)                                               00062   
****************************************                                00063   
*  VARIABLE = AREA-NUMBER      N007                                     00064   
****************************************                                00065   
AAREA    DFHMDF ATTRB=(ASKIP,NUM),                                     X00066   
               JUSTIFY=(LEFT,BLANK),                                   X00067   
               PICOUT='9999999',                                       X00068   
               COLOR=BLUE,                                             X00069   
               LENGTH=7,                                               X00070   
               POS=(02,14)                                              00071   
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               INITIAL=' ',                                            X00259   
               LENGTH=1,                                               X00260   
               POS=(02,22)                                              00258   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00072   
               INITIAL='ITEMS',                                        X00073   
               COLOR=NEUTRAL,                                          X00074   
               LENGTH=5,                                               X00075   
               POS=(02,40)                                              00076   
****************************************                                00077   
*  VARIABLE = ASTRTIT      N005                                         00078   
****************************************                                00079   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00080   
               JUSTIFY=(LEFT,BLANK),                                   X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               PICOUT='ZZZZZ',                                         X00084   
               LENGTH=5,                                               X00085   
               POS=(02,46)                                              00086   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00087   
               INITIAL='TO',                                           X00088   
               COLOR=NEUTRAL,                                          X00089   
               LENGTH=2,                                               X00090   
               POS=(02,52)                                              00091   
****************************************                                00092   
*  VARIABLE = AENDIT      N005                                          00093   
****************************************                                00094   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00095   
               JUSTIFY=(LEFT,BLANK),                                   X00096   
               COLOR=BLUE,                                             X00097   
               PICOUT='ZZZZZ',                                         X00098   
               LENGTH=5,                                               X00099   
               POS=(02,55)                                              00100   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00101   
               INITIAL='OF',                                           X00102   
               COLOR=NEUTRAL,                                          X00103   
               LENGTH=2,                                               X00104   
               POS=(02,61)                                              00105   
****************************************                                00106   
*  VARIABLE = ATOTIT      N005                                          00107   
****************************************                                00108   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00109   
               JUSTIFY=(LEFT,BLANK),                                   X00110   
               COLOR=BLUE,                                             X00111   
               PICOUT='ZZZZZ',                                         X00112   
               LENGTH=5,                                               X00113   
               POS=(02,64)                                              00114   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00048   
*                                                                       00049   
*  SCREEN LINE 04                                                       00050   
*                                                                       00051   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00052   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00058   
               INITIAL='SKU:',                                         X00059   
               COLOR=NEUTRAL,                                          X00060   
               LENGTH=4,                                               X00061   
               POS=(03,9)                                               00062   
****************************************                                00063   
*  VARIABLE =  SKU-NUMBER      N008                                     00064   
****************************************                                00065   
ASKU     DFHMDF ATTRB=(ASKIP,NUM),                                     X00066   
               JUSTIFY=(LEFT,BLANK),                                   X00067   
               PICOUT='99999999',                                      X00068   
               COLOR=BLUE,                                             X00069   
               LENGTH=8,                                               X00070   
               POS=(03,14)                                              00071   
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               INITIAL=' ',                                            X00259   
               LENGTH=1,                                               X00260   
               POS=(03,23)                                              00258   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00115   
*                                                                       00116   
*  SCREEN LINE 05                                                       00117   
*                                                                       00118   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00119   
*.*.*.*                                                                 00130   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00130   
*                                                                       00131   
*  SCREEN LINE 06                                                       00132   
*                                                                       00133   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00134   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00135   
               INITIAL='S',                                            X00136   
               COLOR=NEUTRAL,                                          X00137   
               LENGTH=1,                                               X00138   
               POS=(05,2)                                               00139   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00140   
               INITIAL='ACT',                                          X00141   
               COLOR=NEUTRAL,                                          X00142   
               LENGTH=3,                                               X00143   
               POS=(05,6)                                               00144   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00145   
               INITIAL='INVENTORIED UPC',                              X00146   
               COLOR=NEUTRAL,                                          X00147   
               LENGTH=15,                                              X00148   
               POS=(05,14)                                              00149   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00150   
               INITIAL='QTY',                                          X00151   
               COLOR=NEUTRAL,                                          X00152   
               LENGTH=3,                                               X00153   
               POS=(05,35)                                              00154   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00155   
               INITIAL='PRICE',                                        X00156   
               COLOR=NEUTRAL,                                          X00157   
               LENGTH=5,                                               X00158   
               POS=(05,45)                                              00159   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00160   
               INITIAL='EXTD PRICE',                                   X00161   
               COLOR=NEUTRAL,                                          X00162   
               LENGTH=10,                                              X00163   
               POS=(05,55)                                              00164   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00160   
               INITIAL='ADJ TYPE',                                     X00161   
               COLOR=NEUTRAL,                                          X00162   
               LENGTH=8,                                               X00163   
               POS=(05,70)                                              00164   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00165   
*                                                                       00166   
*  SCREEN LINE 07                                                       00167   
*                                                                       00168   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00169   
****************************************                                00170   
*  VARIABLE = ASEL01      X001                                          00171   
****************************************                                00172   
ASEL01   DFHMDF ATTRB=(UNPROT,IC),                                     X00173   
               COLOR=GREEN,                                            X00174   
               HILIGHT=UNDERLINE,                                      X00175   
               LENGTH=1,                                               X00176   
               POS=(06,2)                                               00177   
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(06,4),                                             X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00182   
*  VARIABLE = AACT01      X003                                          00183   
****************************************                                00184   
AACT01   DFHMDF ATTRB=(ASKIP),                                         X00185   
               COLOR=BLUE,                                             X00186   
               LENGTH=3,                                               X00187   
               POS=(06,6)                                               00188   
*********************************************************************** 00203   
** VARIABLE = -UPC-NUMBER       MAX X015 (UPC)                        * 00204   
*********************************************************************** 00205   
AUPC01   DFHMDF ATTRB=(ASKIP),                                         X00206   
               COLOR=BLUE,                                             X00207   
               PICOUT='ZZZZZZZZZZZZZZ9',                               X00216   
               LENGTH=15,                                              X00208   
               POS=(06,14)                                              00209   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY   N006                                00211   
****************************************                                00212   
AQTY01   DFHMDF ATTRB=(ASKIP),                                         X00213   
               JUSTIFY=(LEFT,BLANK),                                   X00214   
               COLOR=BLUE,                                             X00215   
               PICOUT='ZZZZZZ',                                        X00216   
               LENGTH=6,                                               X00217   
               POS=(06,32)                                              00218   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00602                           00220   
****************************************                                00221   
APRI01   DFHMDF ATTRB=(ASKIP),                                         X00222   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00224   
               PICOUT='ZZZZZZZ.99',                                    X00225   
               LENGTH=10,                                              X00226   
               POS=(06,40)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00902                           00229   
****************************************                                00230   
AXPRI01  DFHMDF ATTRB=(ASKIP),                                         X00231   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00233   
               PICOUT='---------.99',                                  X00234**3
               LENGTH=12,                                              X00235**3
               POS=(06,54)                                              00236**3
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(06,67),                                            X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00237   
*                                                                       00238   
****************************************                                00239   
ADMSG01  DFHMDF ATTRB=(ASKIP),                                         X00240   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00241   
               LENGTH=10,                                              X00242   
               POS=(06,69)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00244   
*                                                                       00245   
*  SCREEN LINE 08                                                       00246   
*                                                                       00247   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00248   
****************************************                                00249   
*  VARIABLE = ASEL02      X001                                          00250   
****************************************                                00251   
ASEL02   DFHMDF ATTRB=(UNPROT,IC),                                     X00252   
               HILIGHT=UNDERLINE,                                      X00175   
               COLOR=GREEN,                                            X00253   
               LENGTH=1,                                               X00255   
               POS=(07,2)                                               00256   
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(07,4),                                             X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00261   
*  VARIABLE = AACT02      X003                                          00262   
****************************************                                00263   
AACT02   DFHMDF ATTRB=(ASKIP),                                         X00264   
               COLOR=BLUE,                                             X00265   
               LENGTH=3,                                               X00266   
               POS=(07,6)                                               00267   
*********************************************************************** 00203   
** VARIABLE = -UPC-NUMBER       MAX X015 (UPC)                        * 00204   
*********************************************************************** 00205   
AUPC02   DFHMDF ATTRB=(ASKIP),                                         X00206   
               COLOR=BLUE,                                             X00207   
               LENGTH=15,                                              X00208   
               POS=(07,14)                                              00209   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY   N006                                00211   
****************************************                                00212   
AQTY02   DFHMDF ATTRB=(ASKIP),                                         X00213   
               JUSTIFY=(LEFT,BLANK),                                   X00214   
               COLOR=BLUE,                                             X00215   
               PICOUT='ZZZZZZ',                                        X00216   
               LENGTH=6,                                               X00217   
               POS=(07,32)                                              00218   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI     -N00602                           00220   
****************************************                                00221   
APRI02   DFHMDF ATTRB=(ASKIP),                                         X00222   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00224   
               PICOUT='ZZZZZZZ.99',                                    X00225   
               LENGTH=10,                                              X00226   
               POS=(07,40)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00902                           00229   
****************************************                                00230   
AXPRI02  DFHMDF ATTRB=(ASKIP),                                         X00231   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00233   
               PICOUT='---------.99',                                  X00234**3
               LENGTH=12,                                              X00235**3
               POS=(07,54)                                              00236**3
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(07,67),                                            X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00237   
*                                                                       00238   
****************************************                                00239   
ADMSG02  DFHMDF ATTRB=(ASKIP),                                         X00240   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00241   
               LENGTH=10,                                              X00242   
               POS=(07,69)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00244   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00323   
*                                                                       00324   
*  SCREEN LINE 09                                                       00325   
*                                                                       00326   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00327   
****************************************                                00249   
*  VARIABLE = ASEL02      X001                                          00250   
****************************************                                00251   
ASEL03   DFHMDF ATTRB=(UNPROT,IC),                                     X00252   
               COLOR=GREEN,                                            X00253   
               HILIGHT=UNDERLINE,                                      X00254   
               LENGTH=1,                                               X00255   
               POS=(08,2)                                               00256   
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(08,4),                                             X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00261   
*  VARIABLE = AACT02      X003                                          00262   
****************************************                                00263   
AACT03   DFHMDF ATTRB=(ASKIP),                                         X00264   
               JUSTIFY=(RIGHT,BLANK),                                  X00223   
               COLOR=BLUE,                                             X00265   
               LENGTH=3,                                               X00266   
               POS=(08,6)                                               00267   
*********************************************************************** 00203   
** VARIABLE = -UPC-NUMBER       MAX X015 (UPC)                        * 00204   
*********************************************************************** 00205   
AUPC03   DFHMDF ATTRB=(ASKIP),                                         X00206   
               COLOR=BLUE,                                             X00207   
               LENGTH=15,                                              X00208   
               POS=(08,14)                                              00209   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY   N006                                00211   
****************************************                                00212   
AQTY03   DFHMDF ATTRB=(ASKIP),                                         X00213   
               JUSTIFY=(LEFT,BLANK),                                   X00214   
               COLOR=BLUE,                                             X00215   
               PICOUT='ZZZZZZ',                                        X00216   
               LENGTH=6,                                               X00217   
               POS=(08,32)                                              00218   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00602                           00220   
****************************************                                00221   
APRI03   DFHMDF ATTRB=(ASKIP),                                         X00222   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00224   
               PICOUT='ZZZZZZZ.99',                                    X00225   
               LENGTH=10,                                              X00226   
               POS=(08,40)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00902                           00229   
****************************************                                00230   
AXPRI03  DFHMDF ATTRB=(ASKIP),                                         X00231   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00233   
               PICOUT='---------.99',                                  X00234**3
               LENGTH=12,                                              X00235**3
               POS=(08,54)                                              00236**3
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(08,67),                                            X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00237   
*                                                                       00238   
****************************************                                00239   
ADMSG03  DFHMDF ATTRB=(ASKIP),                                         X00240   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00241   
               LENGTH=10,                                              X00242   
               POS=(08,69)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00244   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00323   
*                                                                       00324   
*  SCREEN LINE 10                                                       00325   
*                                                                       00326   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00327   
****************************************                                00249   
*  VARIABLE = ASEL04      X001                                          00250   
****************************************                                00251   
ASEL04   DFHMDF ATTRB=(UNPROT,IC),                                     X00252   
               COLOR=GREEN,                                            X00253   
               HILIGHT=UNDERLINE,                                      X00254   
               LENGTH=1,                                               X00255   
               POS=(09,2)                                               00256   
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(09,4),                                             X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00261   
*  VARIABLE = AACT04      X003                                          00262   
****************************************                                00263   
AACT04   DFHMDF ATTRB=(ASKIP),                                         X00264   
               COLOR=BLUE,                                             X00265   
               LENGTH=3,                                               X00266   
               POS=(09,6)                                               00267   
*********************************************************************** 00203   
** VARIABLE = -UPC-NUMBER       MAX X015 (UPC)                        * 00204   
*********************************************************************** 00205   
AUPC04   DFHMDF ATTRB=(ASKIP),                                         X00206   
               COLOR=BLUE,                                             X00207   
               LENGTH=15,                                              X00208   
               POS=(09,14)                                              00209   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY   N006                                00211   
****************************************                                00212   
AQTY04   DFHMDF ATTRB=(ASKIP),                                         X00213   
               JUSTIFY=(LEFT,BLANK),                                   X00214   
               COLOR=BLUE,                                             X00215   
               PICOUT='ZZZZZZ',                                        X00216   
               LENGTH=6,                                               X00217   
               POS=(09,32)                                              00218   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00602                           00220   
****************************************                                00221   
APRI04   DFHMDF ATTRB=(ASKIP),                                         X00222   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00224   
               PICOUT='ZZZZZZZ.99',                                    X00225   
               LENGTH=10,                                              X00226   
               POS=(09,40)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00902                           00229   
****************************************                                00230   
AXPRI04  DFHMDF ATTRB=(ASKIP),                                         X00231   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00233   
               PICOUT='---------.99',                                  X00234**3
               LENGTH=12,                                              X00235**3
               POS=(09,54)                                              00236**3
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(09,67),                                            X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00237   
*                                                                       00238   
****************************************                                00239   
ADMSG04  DFHMDF ATTRB=(ASKIP),                                         X00240   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00241   
               LENGTH=10,                                              X00242   
               POS=(09,69)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00323   
*                                                                       00324   
*  SCREEN LINE 11                                                       00325   
*                                                                       00326   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00327   
****************************************                                00249   
*  VARIABLE = ASEL05      X001                                          00250   
****************************************                                00251   
ASEL05   DFHMDF ATTRB=(UNPROT,IC),                                     X00252   
               COLOR=GREEN,                                            X00253   
               HILIGHT=UNDERLINE,                                      X00254   
               LENGTH=1,                                               X00255   
               POS=(10,2)                                               00256   
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(10,4),                                             X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00261   
*  VARIABLE = AACT05      X003                                          00262   
****************************************                                00263   
AACT05   DFHMDF ATTRB=(ASKIP),                                         X00264   
               COLOR=BLUE,                                             X00265   
               LENGTH=3,                                               X00266   
               POS=(10,6)                                               00267   
*********************************************************************** 00203   
** VARIABLE = -UPC-NUMBER       MAX X015 (UPC)                        * 00204   
*********************************************************************** 00205   
AUPC05   DFHMDF ATTRB=(ASKIP),                                         X00206   
               COLOR=BLUE,                                             X00207   
               LENGTH=15,                                              X00208   
               POS=(10,14)                                              00209   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY   N006                                00211   
****************************************                                00212   
AQTY05   DFHMDF ATTRB=(ASKIP),                                         X00213   
               JUSTIFY=(LEFT,BLANK),                                   X00214   
               COLOR=BLUE,                                             X00215   
               PICOUT='ZZZZZZ',                                        X00216   
               LENGTH=6,                                               X00217   
               POS=(10,32)                                              00218   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00602                           00220   
****************************************                                00221   
APRI05   DFHMDF ATTRB=(ASKIP),                                         X00222   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00224   
               PICOUT='ZZZZZZZ.99',                                    X00225   
               LENGTH=10,                                              X00226   
               POS=(10,40)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00902                           00229   
****************************************                                00230   
AXPRI05  DFHMDF ATTRB=(ASKIP),                                         X00231   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00233   
               PICOUT='---------.99',                                  X00234**3
               LENGTH=12,                                              X00235**3
               POS=(10,54)                                              00236**3
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(10,67),                                            X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00237   
*                                                                       00238   
****************************************                                00239   
ADMSG05  DFHMDF ATTRB=(ASKIP),                                         X00240   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00241   
               LENGTH=10,                                              X00242   
               POS=(10,69)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00323   
*                                                                       00324   
*  SCREEN LINE 12                                                       00325   
*                                                                       00326   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00327   
****************************************                                00249   
*  VARIABLE = ASEL06      X001                                          00250   
****************************************                                00251   
ASEL06   DFHMDF ATTRB=(UNPROT,IC),                                     X00252   
               COLOR=GREEN,                                            X00253   
               HILIGHT=UNDERLINE,                                      X00254   
               LENGTH=1,                                               X00255   
               POS=(11,2)                                               00256   
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(11,4),                                             X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00261   
*  VARIABLE = AACT06      X003                                          00262   
****************************************                                00263   
AACT06   DFHMDF ATTRB=(ASKIP),                                         X00264   
               COLOR=BLUE,                                             X00265   
               LENGTH=3,                                               X00266   
               POS=(11,6)                                               00267   
*********************************************************************** 00203   
** VARIABLE = -UPC-NUMBER       MAX X015 (UPC)                        * 00204   
*********************************************************************** 00205   
AUPC06   DFHMDF ATTRB=(ASKIP),                                         X00206   
               COLOR=BLUE,                                             X00207   
               LENGTH=15,                                              X00208   
               POS=(11,14)                                              00209   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY   N006                                00211   
****************************************                                00212   
AQTY06   DFHMDF ATTRB=(ASKIP),                                         X00213   
               JUSTIFY=(LEFT,BLANK),                                   X00214   
               COLOR=BLUE,                                             X00215   
               PICOUT='ZZZZZZ',                                        X00216   
               LENGTH=6,                                               X00217   
               POS=(11,32)                                              00218   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00602                           00220   
****************************************                                00221   
APRI06   DFHMDF ATTRB=(ASKIP),                                         X00222   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00224   
               PICOUT='ZZZZZZZ.99',                                    X00225   
               LENGTH=10,                                              X00226   
               POS=(11,40)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00902                           00229   
****************************************                                00230   
AXPRI06  DFHMDF ATTRB=(ASKIP),                                         X00231   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00233   
               PICOUT='---------.99',                                  X00234**3
               LENGTH=12,                                              X00235**3
               POS=(11,54)                                              00236**3
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(11,67),                                            X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00237   
*                                                                       00238   
****************************************                                00239   
ADMSG06  DFHMDF ATTRB=(ASKIP),                                         X00240   
               JUSTIFY=(LEFT,BLANK),                                   X00241   
               COLOR=BLUE,                                             X00241   
               LENGTH=10,                                              X00242   
               POS=(11,69)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00244   
*                                                                       00324   
*  SCREEN LINE 13                                                       00325   
*                                                                       00326   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00327   
****************************************                                00249   
*  VARIABLE = ASEL07      X001                                          00250   
****************************************                                00251   
ASEL07   DFHMDF ATTRB=(UNPROT,IC),                                     X00252   
               COLOR=GREEN,                                            X00253   
               HILIGHT=UNDERLINE,                                      X00254   
               LENGTH=1,                                               X00255   
               POS=(12,2)                                               00256   
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(12,4),                                             X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00261   
*  VARIABLE = AACT07      X003                                          00262   
****************************************                                00263   
AACT07   DFHMDF ATTRB=(ASKIP),                                         X00264   
               COLOR=BLUE,                                             X00265   
               LENGTH=3,                                               X00266   
               POS=(12,6)                                               00267   
*********************************************************************** 00203   
** VARIABLE = -UPC-NUMBER       MAX X015 (UPC)                        * 00204   
*********************************************************************** 00205   
AUPC07   DFHMDF ATTRB=(ASKIP),                                         X00206   
               COLOR=BLUE,                                             X00207   
               LENGTH=15,                                              X00208   
               POS=(12,14)                                              00209   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY   N006                                00211   
****************************************                                00212   
AQTY07   DFHMDF ATTRB=(ASKIP),                                         X00213   
               JUSTIFY=(LEFT,BLANK),                                   X00214   
               COLOR=BLUE,                                             X00215   
               PICOUT='ZZZZZZ',                                        X00216   
               LENGTH=6,                                               X00217   
               POS=(12,32)                                              00218   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00602                           00220   
****************************************                                00221   
APRI07   DFHMDF ATTRB=(ASKIP),                                         X00222   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00224   
               PICOUT='ZZZZZZZ.99',                                    X00225   
               LENGTH=10,                                              X00226   
               POS=(12,40)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00902                           00229   
****************************************                                00230   
AXPRI07  DFHMDF ATTRB=(ASKIP),                                         X00231   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00233   
               PICOUT='---------.99',                                  X00234**3
               LENGTH=12,                                              X00235**3
               POS=(12,54)                                              00236**3
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(12,67),                                            X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00237   
*                                                                       00238   
****************************************                                00239   
ADMSG07  DFHMDF ATTRB=(ASKIP),                                         X00240   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00241   
               LENGTH=10,                                              X00242   
               POS=(12,69)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00244   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00323   
*                                                                       00324   
*  SCREEN LINE 14                                                       00325   
*                                                                       00326   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00327   
****************************************                                00249   
*  VARIABLE = ASEL08      X001                                          00250   
****************************************                                00251   
ASEL08   DFHMDF ATTRB=(UNPROT,IC),                                     X00252   
               COLOR=GREEN,                                            X00253   
               HILIGHT=UNDERLINE,                                      X00254   
               LENGTH=1,                                               X00255   
               POS=(13,2)                                               00256   
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(13,4),                                             X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00261   
*  VARIABLE = AACT08      X003                                          00262   
****************************************                                00263   
AACT08   DFHMDF ATTRB=(ASKIP),                                         X00264   
               COLOR=BLUE,                                             X00265   
               LENGTH=3,                                               X00266   
               POS=(13,6)                                               00267   
*********************************************************************** 00203   
** VARIABLE = -UPC-NUMBER       MAX X015 (UPC)                        * 00204   
*********************************************************************** 00205   
AUPC08   DFHMDF ATTRB=(ASKIP),                                         X00206   
               COLOR=BLUE,                                             X00207   
               LENGTH=15,                                              X00208   
               POS=(13,14)                                              00209   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY   N006                                00211   
****************************************                                00212   
AQTY08   DFHMDF ATTRB=(ASKIP),                                         X00213   
               JUSTIFY=(LEFT,BLANK),                                   X00214   
               COLOR=BLUE,                                             X00215   
               PICOUT='ZZZZZZ',                                        X00216   
               LENGTH=6,                                               X00217   
               POS=(13,32)                                              00218   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00602                           00220   
****************************************                                00221   
APRI08   DFHMDF ATTRB=(ASKIP),                                         X00222   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00224   
               PICOUT='ZZZZZZZ.99',                                    X00225   
               LENGTH=10,                                              X00226   
               POS=(13,40)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00902                           00229   
****************************************                                00230   
AXPRI08  DFHMDF ATTRB=(ASKIP),                                         X00231   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00233   
               PICOUT='---------.99',                                  X00234**3
               LENGTH=12,                                              X00235**3
               POS=(13,54)                                              00236**3
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(13,67),                                            X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00237   
*                                                                       00238   
****************************************                                00239   
ADMSG08  DFHMDF ATTRB=(ASKIP),                                         X00240   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00241   
               LENGTH=10,                                              X00242   
               POS=(13,69)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00323   
*                                                                       00324   
*  SCREEN LINE 15                                                       00325   
*                                                                       00326   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00327   
****************************************                                00249   
*  VARIABLE = ASEL09      X001                                          00250   
****************************************                                00251   
ASEL09   DFHMDF ATTRB=(UNPROT,IC),                                     X00252   
               COLOR=GREEN,                                            X00253   
               HILIGHT=UNDERLINE,                                      X00254   
               LENGTH=1,                                               X00255   
               POS=(14,2)                                               00256   
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(14,4),                                             X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00261   
*  VARIABLE = AACT09      X003                                          00262   
****************************************                                00263   
AACT09   DFHMDF ATTRB=(ASKIP),                                         X00264   
               COLOR=BLUE,                                             X00265   
               LENGTH=3,                                               X00266   
               POS=(14,6)                                               00267   
*********************************************************************** 00203   
** VARIABLE = -UPC-NUMBER       MAX X015 (UPC)                        * 00204   
*********************************************************************** 00205   
AUPC09   DFHMDF ATTRB=(ASKIP),                                         X00206   
               COLOR=BLUE,                                             X00207   
               LENGTH=15,                                              X00208   
               POS=(14,14)                                              00209   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY   N006                                00211   
****************************************                                00212   
AQTY09   DFHMDF ATTRB=(ASKIP),                                         X00213   
               JUSTIFY=(LEFT,BLANK),                                   X00214   
               COLOR=BLUE,                                             X00215   
               PICOUT='ZZZZZZ',                                        X00216   
               LENGTH=6,                                               X00217   
               POS=(14,32)                                              00218   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00602                           00220   
****************************************                                00221   
APRI09   DFHMDF ATTRB=(ASKIP),                                         X00222   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00224   
               PICOUT='ZZZZZZZ.99',                                    X00225   
               LENGTH=10,                                              X00226   
               POS=(14,40)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00902                           00229   
****************************************                                00230   
AXPRI09  DFHMDF ATTRB=(ASKIP),                                         X00231   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00233   
               PICOUT='---------.99',                                  X00234**3
               LENGTH=12,                                              X00235**3
               POS=(14,54)                                              00236**3
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(14,67),                                            X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00237   
*                                                                       00238   
****************************************                                00239   
ADMSG09  DFHMDF ATTRB=(ASKIP),                                         X00240   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00241   
               LENGTH=10,                                              X00242   
               POS=(14,69)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00244   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00323   
*                                                                       00324   
*  SCREEN LINE 16                                                       00325   
*                                                                       00326   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00327   
****************************************                                00249   
*  VARIABLE = ASEL10      X001                                          00250   
****************************************                                00251   
ASEL10   DFHMDF ATTRB=(UNPROT,IC),                                     X00252   
               HILIGHT=UNDERLINE,                                      X00175   
               COLOR=GREEN,                                            X00253   
               LENGTH=1,                                               X00255   
               POS=(15,2)                                               00256   
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(15,4),                                             X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00261   
*  VARIABLE = AACT10      X003                                          00262   
****************************************                                00263   
AACT10   DFHMDF ATTRB=(ASKIP),                                         X00264   
               COLOR=BLUE,                                             X00265   
               LENGTH=3,                                               X00266   
               POS=(15,6)                                               00267   
*********************************************************************** 00203   
** VARIABLE = -UPC-NUMBER       MAX X015 (UPC)                        * 00204   
*********************************************************************** 00205   
AUPC10   DFHMDF ATTRB=(ASKIP),                                         X00206   
               COLOR=BLUE,                                             X00207   
               LENGTH=15,                                              X00208   
               POS=(15,14)                                              00209   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY   N006                                00211   
****************************************                                00212   
AQTY10   DFHMDF ATTRB=(ASKIP),                                         X00213   
               JUSTIFY=(LEFT,BLANK),                                   X00214   
               COLOR=BLUE,                                             X00215   
               PICOUT='ZZZZZZ',                                        X00216   
               LENGTH=6,                                               X00217   
               POS=(15,32)                                              00218   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00602                           00220   
****************************************                                00221   
APRI10   DFHMDF ATTRB=(ASKIP),                                         X00222   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00224   
               PICOUT='ZZZZZZZ.99',                                    X00225   
               LENGTH=10,                                              X00226   
               POS=(15,40)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00902                           00229   
****************************************                                00230   
AXPRI10  DFHMDF ATTRB=(ASKIP),                                         X00231   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00233   
               PICOUT='---------.99',                                  X00234**3
               LENGTH=12,                                              X00235**3
               POS=(15,54)                                              00236**3
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(15,67),                                            X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00237   
*                                                                       00238   
****************************************                                00239   
ADMSG10  DFHMDF ATTRB=(ASKIP),                                         X00240   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00241   
               LENGTH=10,                                              X00242   
               POS=(15,69)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00244   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00323   
*                                                                       00324   
*  SCREEN LINE 17                                                       00325   
*                                                                       00326   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00327   
****************************************                                00249   
*  VARIABLE = ASEL11      X001                                          00250   
****************************************                                00251   
ASEL11   DFHMDF ATTRB=(UNPROT,IC),                                     X00252   
               COLOR=GREEN,                                            X00253   
               HILIGHT=UNDERLINE,                                      X00254   
               LENGTH=1,                                               X00255   
               POS=(16,2)                                               00256   
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(16,4),                                             X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00261   
*  VARIABLE = AACT11      X003                                          00262   
****************************************                                00263   
AACT11   DFHMDF ATTRB=(ASKIP),                                         X00264   
               COLOR=BLUE,                                             X00265   
               LENGTH=3,                                               X00266   
               POS=(16,6)                                               00267   
*********************************************************************** 00203   
** VARIABLE = -UPC-NUMBER       MAX X015 (UPC)                        * 00204   
*********************************************************************** 00205   
AUPC11   DFHMDF ATTRB=(ASKIP),                                         X00206   
               COLOR=BLUE,                                             X00207   
               LENGTH=15,                                              X00208   
               POS=(16,14)                                              00209   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY   N006                                00211   
****************************************                                00212   
AQTY11   DFHMDF ATTRB=(ASKIP),                                         X00213   
               JUSTIFY=(LEFT,BLANK),                                   X00214   
               COLOR=BLUE,                                             X00215   
               PICOUT='ZZZZZZ',                                        X00216   
               LENGTH=6,                                               X00217   
               POS=(16,32)                                              00218   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00602                           00220   
****************************************                                00221   
APRI11   DFHMDF ATTRB=(ASKIP),                                         X00222   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00224   
               PICOUT='ZZZZZZZ.99',                                    X00225   
               LENGTH=10,                                              X00226   
               POS=(16,40)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00902                           00229   
****************************************                                00230   
AXPRI11  DFHMDF ATTRB=(ASKIP),                                         X00231   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00233   
               PICOUT='---------.99',                                  X00234**3
               LENGTH=12,                                              X00235**3
               POS=(16,54)                                              00236**3
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(16,67),                                            X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00237   
*                                                                       00238   
****************************************                                00239   
ADMSG11  DFHMDF ATTRB=(ASKIP),                                         X00240   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00241   
               LENGTH=10,                                              X00242   
               POS=(16,69)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00323   
*                                                                       00324   
*  SCREEN LINE 18                                                       00325   
*                                                                       00326   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00327   
****************************************                                00249   
*  VARIABLE = ASEL12      X001                                          00250   
****************************************                                00251   
ASEL12   DFHMDF ATTRB=(UNPROT,IC),                                     X00252   
               COLOR=GREEN,                                            X00253   
               HILIGHT=UNDERLINE,                                      X00254   
               LENGTH=1,                                               X00255   
               POS=(17,2)                                               00256   
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(17,4),                                             X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00261   
*  VARIABLE = AACT12      X003                                          00262   
****************************************                                00263   
AACT12   DFHMDF ATTRB=(ASKIP),                                         X00264   
               COLOR=BLUE,                                             X00265   
               LENGTH=3,                                               X00266   
               POS=(17,6)                                               00267   
*********************************************************************** 00203   
** VARIABLE = -UPC-NUMBER       MAX X015 (UPC)                        * 00204   
*********************************************************************** 00205   
AUPC12   DFHMDF ATTRB=(ASKIP),                                         X00206   
               COLOR=BLUE,                                             X00207   
               LENGTH=15,                                              X00208   
               POS=(17,14)                                              00209   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY   N006                                00211   
****************************************                                00212   
AQTY12   DFHMDF ATTRB=(ASKIP),                                         X00213   
               JUSTIFY=(LEFT,BLANK),                                   X00214   
               COLOR=BLUE,                                             X00215   
               PICOUT='ZZZZZZ',                                        X00216   
               LENGTH=6,                                               X00217   
               POS=(17,32)                                              00218   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00602                           00220   
****************************************                                00221   
APRI12   DFHMDF ATTRB=(ASKIP),                                         X00222   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00224   
               PICOUT='ZZZZZZZ.99',                                    X00225   
               LENGTH=10,                                              X00226   
               POS=(17,40)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00902                           00229   
****************************************                                00230   
AXPRI12  DFHMDF ATTRB=(ASKIP),                                         X00231   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00233   
               PICOUT='---------.99',                                  X00234**3
               LENGTH=12,                                              X00235**3
               POS=(17,54)                                              00236**3
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(17,67),                                            X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00237   
*                                                                       00238   
****************************************                                00239   
ADMSG12  DFHMDF ATTRB=(ASKIP),                                         X00240   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00241   
               LENGTH=10,                                              X00242   
               POS=(17,69)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00244   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00323   
*                                                                       00324   
*  SCREEN LINE 19                                                       00325   
*                                                                       00326   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00327   
****************************************                                00249   
*  VARIABLE = ASEL13      X001                                          00250   
****************************************                                00251   
ASEL13   DFHMDF ATTRB=(UNPROT,IC),                                     X00252   
               COLOR=GREEN,                                            X00253   
               HILIGHT=UNDERLINE,                                      X00254   
               LENGTH=1,                                               X00255   
               POS=(18,2)                                               00256   
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(18,4),                                             X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00261   
*  VARIABLE = AACT13      X003                                          00262   
****************************************                                00263   
AACT13   DFHMDF ATTRB=(ASKIP),                                         X00264   
               COLOR=BLUE,                                             X00265   
               LENGTH=3,                                               X00266   
               POS=(18,6)                                               00267   
*********************************************************************** 00203   
** VARIABLE = -UPC-NUMBER       MAX X015 (UPC)                        * 00204   
*********************************************************************** 00205   
AUPC13   DFHMDF ATTRB=(ASKIP),                                         X00206   
               COLOR=BLUE,                                             X00207   
               LENGTH=15,                                              X00208   
               POS=(18,14)                                              00209   
****************************************                                00210   
*  VARIABLE = ADJUSTMENT-QUANTITY   N006                                00211   
****************************************                                00212   
AQTY13   DFHMDF ATTRB=(ASKIP),                                         X00213   
               JUSTIFY=(LEFT,BLANK),                                   X00214   
               COLOR=BLUE,                                             X00215   
               PICOUT='ZZZZZZ',                                        X00216   
               LENGTH=6,                                               X00217   
               POS=(18,32)                                              00218   
****************************************                                00219   
*  VARIABLE = ADJUSTMENT-UNIT-PRI      N00602                           00220   
****************************************                                00221   
APRI13   DFHMDF ATTRB=(ASKIP),                                         X00222   
               JUSTIFY=(LEFT,BLANK),                                   X00223   
               COLOR=BLUE,                                             X00224   
               PICOUT='ZZZZZZZ.99',                                    X00225   
               LENGTH=10,                                              X00226   
               POS=(18,40)                                              00227   
****************************************                                00228   
*  VARIABLE = ADJUSTMENT-EXTENDED      N00902                           00229   
****************************************                                00230   
AXPRI13  DFHMDF ATTRB=(ASKIP),                                         X00231   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00233   
               PICOUT='---------.99',                                  X00234**3
               LENGTH=12,                                              X00235**3
               POS=(18,54)                                              00236**3
         DFHMDF ATTRB=(ASKIP),                                         X00257   
               POS=(18,67),                                            X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1                                                 00260   
****************************************                                00237   
*                                                                       00238   
****************************************                                00239   
ADMSG13  DFHMDF ATTRB=(ASKIP),                                         X00240   
               JUSTIFY=(LEFT,BLANK),                                   X00232   
               COLOR=BLUE,                                             X00241   
               LENGTH=10,                                              X00242   
               POS=(18,69)                                              00243**2
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00244   
*                                                                       01197   
*  SCREEN LINE 20                                                       01198   
*                                                                       01199   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 01200   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X01201   
               INITIAL='NUMBER',                                       X01202   
               COLOR=NEUTRAL,                                          X01203   
               LENGTH=6,                                               X01204   
               POS=(19,39)                                              01205   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X01206   
               INITIAL='OF',                                           X01207   
               COLOR=NEUTRAL,                                          X01208   
               LENGTH=2,                                               X01209   
               POS=(19,46)                                              01210   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X01211   
               INITIAL='SELECTED',                                     X01212   
               COLOR=NEUTRAL,                                          X01213   
               LENGTH=8,                                               X01214   
               POS=(19,49)                                              01215   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X01216   
               INITIAL='ITEMS:',                                       X01217   
               COLOR=NEUTRAL,                                          X01218   
               LENGTH=6,                                               X01219   
               POS=(19,58)                                              01220   
****************************************                                01221   
*  VARIABLE = ASELIT      N007                                          01222   
****************************************                                01223   
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X01224   
               JUSTIFY=(LEFT,BLANK),                                   X01225   
               COLOR=BLUE,                                             X01226   
               PICOUT='ZZZZZZZ',                                       X01227   
               LENGTH=7,                                               X01228   
               POS=(19,69)                                              01229**2
         DFHMSD TYPE=FINAL                                              01230   
         END                                                            01231   
