       ID DIVISION.                                                             
       PROGRAM-ID.      INKUT266.                                               
       AUTHOR.          B. GRAHAM - STRATAGEM.                                  
       DATE-WRITTEN     NOVEMBER 2, 2006.                                       
       DATE-COMPILED.                                                           
      ******************************************************************        
      *    INKUT266                                                     00070036
      *  - DETERMINE TYPE OF LOOK UP. LOOK UP FOR ALL RECORDS OR ONLY   00080036
      *    IF DEPT IS MISSING.                                          00090036
      *  - READ SHORTAGE EXTRACT RECORDS (INRD034 LAYOUT WITH SKU &DTE) 00100036
      *  - DETERMINE ATTRIBUTES FROM COMMON PRICING PROCESS             00110036
      *              ML-LWST-ID, DEPT, MAJ CL AND SUB CL                00120036
      *  - CHECK IF CLASS SHOULD BE SKIPPED AND WRITE TO BLOCKED DEPT   00130036
      *    CLASS FILE                                                   00140036
      *  - DETERMINE IF DEPARTMENT INV OR STORE INVENTORY, WRITE TO     00150036
      *    NA FILE ANY DEPARTMENT ITEMS COUNTED THAT SHOULDN'T HAVE     00160036
      *    BEEN.                                                        00170036
      *  - WRITE UPDATED SHORTAGE RECORDS (INRD014 LAYOUT WITHOUT SKU)  00180036
      *                                                                 00190036
      ******************************************************************00200036
      *  CHANGE LOG                                                     00210036
      *  DATE       CHANGED BY    DESC                                  00220036
      *  ---------- ------------- --------------------------------------00230036
      *  09-07-2006 B. GRAHAM - STRATAGEM                               00240036
      *                           W28582 VENDOR BRAND CHANGES           00250036
      *                           ORIGINAL CODE                         00260036
      *                                                                 00270036
035382*  08-28-2006 R. MCDOANLD                                         00240036
035382*                           INC000000035382 - PROGRAM IS NOT      00250036
035382*                           HANDLING DEPARTMENT LEVEL             00260036
035382*                           INVENTORY WHEN THE INPUT RECORD               
035382*                           HAS 2 CONSECUTIVE SKUS WHERE THE              
035382*                           DEPARTMENT ON THE INPUT RECORD IS             
035382*                           FILLED IN.  TO FIX THIS MAPPED                
035382*                           THE DEPT, CLASS, AND SUBCLASS                 
035382*                           TO HOLD VARIABLES, AFTER WRITING              
035382*                           THE OUTPUT RECORD WHEN THE SKU                
035382*                           AND THE INVENTORY DATE ARE THE SAME.          
W34517*                                                                 00270036
W34517*  06-13-2008 J. SELWITSCHKA                                      00240036
W34517*                           PERFORM BVPD100 TO GET DKEY USING     00250036
W34517*                           BRAND AND VENDOR FROM THE BEGINNING-  00260036
W34517*                           OF-MONTH SNAPSHOT (XMT_BOM_SKU_ATTR).         
W33304*  11-28-2008 NIJESH/INFOSYS                                              
W33304*                           HOLDING INVENTORY LEDGER OPEN                 
W33304*                           ACROSS PERIODS (HILO).                        
RONNA *  04-07-2013 RONNA MCDONALD                                              
RONNA *                           REPLACE INPD400 WITH INPD402                  
RONNA *                               AND INWS400 WITH INWS402                  
RONNA *                               AND BVPD100 WITH BVPD101                  
RONNA *                           THE PURPOSE IS TO USE BVPD003                 
RONNA *                           INSTEAD OF BVPD001.  THE DIFFERENCE           
RONNA *                           IS THAT BVPD003 HAS PROCESS                   
RONNA *                           IMPROVEMENTS.                                 
0224RM*  02-02-2024 BOB MCASEY    RECOMPILE DUE TO ESTIMATED INV CODE           
0224RM*  CHG0300700               REMOVAL IN INSW401 INV_LOC_CSR.               
W34517******************************************************************00280036
                                                                        00290036
       ENVIRONMENT DIVISION.                                            00300036
       CONFIGURATION SECTION.                                           00310036
       SOURCE-COMPUTER.        IBM-3090.                                00320036
       OBJECT-COMPUTER.        IBM-3090.                                00330036
       INPUT-OUTPUT SECTION.                                            00340036
       FILE-CONTROL.                                                    00350036
                                                                        00360036
           SELECT  IN-CONTROL-FILE         ASSIGN TO INP01.             00370036
                                                                        00380036
           SELECT  IN-SHORTAGE-EXT-FILE    ASSIGN TO INP02.             00390036
                                                                        00400036
           SELECT  SKIP-CLASS-FILE         ASSIGN TO INP03.             00410036
                                                                        00420036
W34517     SELECT  OPTIONAL IN-CONTROL-DTE-FILE                         00370036
W34517                                     ASSIGN TO INP04.             00370036
W34517                                                                  00380036
           SELECT  OUT-SHORTAGE-EXT-FILE   ASSIGN TO OUT01.             00430036
                                                                        00440036
           SELECT  OUT-LOOKUP-ERROR-FILE   ASSIGN TO OUT02.             00450036
                                                                        00460036
           SELECT  BLOCKED-DEPT-CLASS-FILE ASSIGN TO OUT03.             00470036
                                                                        00480036
           SELECT  OUT-DEPT-INV-NA-FILE    ASSIGN TO OUT04.             00490036
                                                                        00500036
       DATA DIVISION.                                                   00510036
                                                                        00520036
       FILE SECTION.                                                    00530036
                                                                        00540036
       FD  IN-CONTROL-FILE                                              00550036
           RECORDING MODE F                                             00560036
           LABEL RECORDS ARE STANDARD                                   00570036
           BLOCK CONTAINS  0 RECORDS.                                   00580036
                                                                        00590036
       01  IN-CONTROL-REC                  PIC X(80).                   00600036
                                                                        00610036
       FD  IN-SHORTAGE-EXT-FILE                                         00620036
           RECORDING MODE F                                             00630036
           LABEL RECORDS ARE STANDARD                                   00640036
           BLOCK CONTAINS  0 RECORDS.                                   00650036
                                                                        00660036
       01  IN-SHORTAGE-EXT-RECORD          PIC X(200).                  00670036
                                                                        00680036
       FD  SKIP-CLASS-FILE                                              00690036
           RECORDING  MODE IS F                                         00700036
           LABEL RECORDS ARE STANDARD                                   00710036
           BLOCK CONTAINS 0 RECORDS.                                    00720036
       01  SKIP-CLASS-REC                  PIC X(80).                   00730036
                                                                        00740036
W34517 FD  IN-CONTROL-DTE-FILE                                          00690036
W34517     RECORDING  MODE IS F                                         00700036
W34517     LABEL RECORDS ARE STANDARD                                   00710036
W34517     BLOCK CONTAINS 0 RECORDS.                                    00720036
W34517 01  IN-CONTROL-DTE-REC              PIC X(80).                   00730036
W34517                                                                  00740036
       FD  OUT-SHORTAGE-EXT-FILE                                        00750036
           RECORDING MODE F                                             00760036
           LABEL RECORDS ARE STANDARD                                   00770036
           BLOCK CONTAINS  0 RECORDS.                                   00780036
                                                                        00790036
W33304 01  OUT-SHORTAGE-EXT-RECORD         PIC X(170).                  00800036
                                                                        00810036
       FD  OUT-LOOKUP-ERROR-FILE                                        00820036
           RECORDING MODE F                                             00830036
           LABEL RECORDS ARE STANDARD                                   00840036
           BLOCK CONTAINS  0 RECORDS.                                   00850036
                                                                        00860036
       01  OUT-LOOKUP-ERROR-RECORD         PIC X(273).                  00870036
                                                                        00880036
       FD  BLOCKED-DEPT-CLASS-FILE                                      00890036
           LABEL RECORDS ARE STANDARD                                   00900036
           RECORDING MODE IS F                                          00910036
           BLOCK CONTAINS 0 RECORDS.                                    00920036
       01  BLOCKED-DEPT-CLASS-REC          PIC X(80).                   00930036
                                                                        00940036
       FD  OUT-DEPT-INV-NA-FILE                                         00950036
           RECORDING MODE F                                             00960036
           LABEL RECORDS ARE STANDARD                                   00970036
           BLOCK CONTAINS  0 RECORDS.                                   00980036
                                                                        00990036
       01  OUT-DEPT-INV-NA-RECORD          PIC X(200).                  01000036
                                                                        01010036
                                                                        01020036
       WORKING-STORAGE SECTION.                                         01030036
                                                                        01040036
       01  PA-PROGRAM-ACCUMULATORS.                                     01050036
           05  PA-INPUT-RECORD-COUNT     PIC S9(9) COMP-3 VALUE +0.     01060036
           05  PA-OUT-GOOD-COUNT         PIC S9(9) COMP-3 VALUE +0.     01070036
           05  PA-OUT-BLOCKED-COUNT      PIC S9(9) COMP-3 VALUE +0.     01080036
           05  PA-OUT-ERROR-COUNT        PIC S9(9) COMP-3 VALUE +0.     01090036
           05  PA-OUT-INV-NA-COUNT       PIC S9(9) COMP-3 VALUE +0.     01100036
           05  PA-COMMIT-COUNT           PIC S9(9) COMP-3 VALUE +0.     01110036
                                                                        01120036
       01  PC-PROGRAM-CONSTANTS.                                        01130036
           05  PC-PROGRAM-ID         PIC X(08)     VALUE 'INKUT266'.    01140036
           05  PC-ALL                PIC X(04)     VALUE 'ALL '.        01150036
                                                                        01160036
       01  PV-PROGRAM-VARIABLES.                                        01170036
           05  PV-CONTROL-TYPE       PIC X(04).                         01180036
               88  PV-CONTROL-TYPE-ALL                   VALUE 'ALL '.  01190036
               88  PV-CONTROL-TYPE-DEPT                  VALUE 'DEPT'.  01200036
           05  PV-DB2-OPER-ATTEMPTED PIC  X(30)          VALUE SPACES.  01210036
           05  PV-MAX-RETRIES        PIC S9(05)   COMP-3 VALUE +3.      01220036
           05  PV-PARAGRAPH-NAME     PIC  X(30)          VALUE SPACES.  01230036
           05  PV-HOLD-PREV-SKU      PIC S9(8)V COMP-3   VALUE ZEROS.   01240036
           05  PV-HOLD-PREV-DEPT     PIC  X(03)          VALUE SPACES.  01241036
           05  PV-HOLD-PREV-MCL      PIC  X(02)          VALUE SPACES.  01242036
           05  PV-HOLD-PREV-SCL      PIC  X(02)          VALUE SPACES.  01243036
           05  PV-HOLD-ACTL-INV-DTE  PIC  X(10)          VALUE SPACES.  01250036
           05  PV-ML-LWST-ID         PIC S9(9)V COMP     VALUE ZEROS.   01260036
           05  PV-EDIT-LOC-NBR       PIC  9(5)           VALUE ZEROS.   01270036
           05  PV-EDIT-DEPT-NBR      PIC  9(4)           VALUE ZEROS.   01280036
           05  PV-EDIT-DEPT-NBR-R REDEFINES PV-EDIT-DEPT-NBR.           01290036
               10  FILLER            PIC  X(01).                        01300036
               10  PV-EDIT-DEPT-2-4  PIC  X(03).                        01310036
           05  PV-EDIT-MCL-NBR       PIC  9(4)           VALUE ZEROS.   01320036
           05  PV-EDIT-MCL-NBR-R REDEFINES PV-EDIT-MCL-NBR.             01330036
               10  FILLER            PIC  X(02).                        01340036
               10  PV-EDIT-MCL-3-4   PIC  X(02).                        01350036
           05  PV-EDIT-MCL-NBR-X REDEFINES PV-EDIT-MCL-NBR-R.           01360036
               10  PV-EDIT-MCL-1-2   PIC  9(02).                        01370036
               10  PV-EDIT-MCL-3-4-X PIC  X(02).                        01380036
           05  PV-EDIT-SCL-NBR       PIC  9(4)           VALUE ZEROS.   01390036
           05  PV-EDIT-SCL-NBR-R REDEFINES PV-EDIT-SCL-NBR.             01400036
               10  FILLER            PIC  X(02).                        01410036
               10  PV-EDIT-SCL-3-4   PIC  X(02).                        01420036
           05  PV-EDIT-SKU           PIC  9(8)           VALUE ZEROS.   01430036
           05  PV-EDIT-STR-NBR       PIC  9(5)           VALUE ZEROS.   01440036
           05  PV-EDIT-STR-NBR-R REDEFINES PV-EDIT-STR-NBR              01450036
                                     PIC  X(05).                        01460036
W34517     05  PV-EDIT-ENT-ID        PIC  9(09)          VALUE ZEROS.   01440036
W34517     05  PV-EDIT-LBL-SEQ-NBR   PIC  9(04)          VALUE ZEROS.   01440036
W34517     05  PV-EDIT-LO-MDSE-LVL-ID PIC 9(09)          VALUE ZEROS.   01440036
                                                                        01470036
       01  PS-PROGRAM-SWITCHES.                                         01480036
           05  PS-CONTROL-AT-END-SW        PIC X(01)     VALUE 'N'.     01490036
               88  PS-CONTROL-AT-END-NO                  VALUE 'N'.     01500036
               88  PS-CONTROL-AT-END-YES                 VALUE 'Y'.     01510036
W34517     05  PS-CONTROL-DTE-AT-END-SW    PIC X(01)     VALUE 'N'.     01490036
W34517         88  PS-CONTROL-DTE-AT-END-NO              VALUE 'N'.     01500036
W34517         88  PS-CONTROL-DTE-AT-END-YES             VALUE 'Y'.     01510036
W34517     05  PS-CC-DATE-PROVIDED-SW      PIC X(01)     VALUE 'N'.     01490036
W34517         88  PS-CC-DATE-PROVIDED                   VALUE 'Y'.     01500036
W34517         88  PS-CC-DATE-NOT-PROVIDED               VALUE 'N'.     01510036
           05  PS-INPUT-AT-END-SW          PIC X(01)     VALUE 'N'.     01520036
               88  PS-INPUT-AT-END-NO                    VALUE 'N'.     01530036
               88  PS-INPUT-AT-END-YES                   VALUE 'Y'.     01540036
           05  PS-WRITE-CNTL-SW            PIC X(01)     VALUE '0'.     01550036
               88  PS-WRITE-GOOD-YES                     VALUE '0'.     01560036
               88  PS-WRITE-ERROR-YES                    VALUE '1'.     01570036
               88  PS-WRITE-BLOCKED-YES                  VALUE '2'.     01580036
               88  PS-WRITE-INV-NA-YES                   VALUE '3'.     01590036
           05  END-OF-SKIP-CLASS-IND       PIC X(01)     VALUE 'N'.     01600036
               88  END-OF-SKIP-CLASS                     VALUE 'Y'.     01610036
                                                                        01620036
       01  PT-PROGRAM-TABLE-AREA.                                       01630036
           05  PT-SKIP-CLASS.                                           01640036
               10  PT-SKIP-CLASS-INDX      PIC S9(04)      VALUE ZEROS  01650036
                               COMP-3.                                  01660036
               10  PT-SKIP-CLASS-COUNT     PIC S9(04)      VALUE ZEROS  01670036
                               COMP-3.                                  01680036
               10  PT-SKIP-CLASS-MAX       PIC S9(04)      VALUE +999   01690036
                               COMP-3.                                  01700036
               10  PT-SKIP-CLASS-TBL OCCURS 999 TIMES.                  01710036
                   15  PT-SKIP-DEPT-CLASS  PIC X(05)       VALUE SPACES.01720036
                   15  FILLER REDEFINES PT-SKIP-DEPT-CLASS.             01730036
                       20  PT-SKIP-DEPT    PIC 9(03).                   01740036
                       20  PT-SKIP-DEPT-X REDEFINES PT-SKIP-DEPT        01750036
                                           PIC X(03).                   01760036
                       20  PT-SKIP-CLASS   PIC 9(02).                   01770036
                       20  PT-SKIP-CLASS-X REDEFINES PT-SKIP-CLASS      01780036
                                           PIC X(02).                   01790036
                                                                        01800036
       01  ABEND-CODE                      PIC S9(04)                   01810036
                                                   VALUE +0 COMP SYNC.  01820036
           88  ABEND-4013-DB2-ERROR                VALUE +4013.         01830036
           88  ABEND-4003                          VALUE +4003.         01840036
                                                                        01850036
                                                                        01860036
       01  IN-CC-REC.                                                   01870036
           05  IN-CC-TYPE                  PIC X(04).                   01880036
               88  IN-CC-TYPE-ALL                  VALUE 'ALL '.        01890036
               88  IN-CC-TYPE-DEPT                 VALUE 'DEPT'.        01900036
           05  FILLER                      PIC X(76).                   01910036
                                                                        01920036
W34517 01  IN-CC-REC2.                                                  01870036
W34517     05  IN-CC-DTE.                                               01880036
W34517         10  IN-CC-DTE-CCYY          PIC X(04).                   01880036
W34517         10  FILLER                  PIC X(01).                   01880036
W34517             88 IN-CC-DTE-VALID-DASH-1 VALUE '-'.                 01880036
W34517         10  IN-CC-DTE-MM            PIC X(02).                   01880036
W34517         10  FILLER                  PIC X(01).                   01880036
W34517             88 IN-CC-DTE-VALID-DASH-2 VALUE '-'.                 01880036
W34517         10  IN-CC-DTE-DD            PIC X(02).                   01880036
W34517     05  FILLER                      PIC X(70).                   01910036
W34517                                                                  01920036
      *************************************************************     01930036
      *    COPYBOOK FOR INVENTORY EXTRACT FILE (INPUT)                  01940036
      *************************************************************     01950036
           COPY INRD034.                                                01960036
                                                                        01970036
      *************************************************************     01980036
      *    COPYBOOK FOR INVENTORY EXTRACT FILE (INPUT)                  01990036
      *************************************************************     02000036
           COPY INRD034 REPLACING IN034 BY ERROR.                       02010036
           05  ERROR-REST.                                              02020036
RONNA          10  ERROR-IN402-PV-EFF-DTE-IN           PIC X(10).       02030036
RONNA          10  ERROR-IN402-PV-LOOKUP-TYPE-IN       PIC X(06).       02040036
RONNA          10  ERROR-IN402-PV-LOC-IN-NUM           PIC X(05).       02050036
RONNA          10  ERROR-IN402-PV-SKU-IN-NUM           PIC X(08).       02060036
RONNA          10  ERROR-IN402-PV-ATT-SQLCDE  PIC S9(9) COMP-4.         02070036
RONNA          10  ERROR-IN402-PV-RETURN-RSN           PIC X(40) .      02080036
                                                                        02090036
       01  SK-SKIP-CLASS-RECORD.                                        02100036
           05  SK-SKIP-DEPT-CLASS          PIC X(05)       VALUE SPACES.02110036
           05  FILLER                      PIC X(75)       VALUE SPACES.02120036
                                                                        02130036
      ***************************************************************** 02140036
      *  BLOCKED/REJECTED DEPT/CLASS RECORD LAYOUT                      02150036
      ***************************************************************** 02160036
           COPY MLRD123.                                                02170036
                                                                        02180036
      *************************************************************     02190036
      *    COPYBOOK FOR INVENTORY EXTRACT FILE (OUTPUT)                 02200036
      *************************************************************     02210036
           COPY INRD014.                                                02220036
                                                                        02230036
                                                                        02240036
W34517*************************************************************     02250036
W34517*    COPYBOOK FOR COMMON BEGINNING-OF-MONTH SNAPSHOT LOOKUP       02260036
W34517*************************************************************     02270036
RONNA      COPY BVWS101.                                                02280036
W34517                                                                  02290036
W34517                                                                  02300036
      *************************************************************     02250036
      *    COPYBOOK FOR COMMON PRICING PROCESS WORKING STORAGE          02260036
      *************************************************************     02270036
RONNA      COPY INWS402.                                                02280036
RONNA ******************************************************************        
RONNA *  SKU CROSS REFERENCE LOOKUP TABLE                                       
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE TSKXREF                                                  
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  VENDOR DEPT TABLE                                                      
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE TVNDDPT                                                  
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  VENDOR STYLE TABLE                                                     
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE TVNDSTL                                                  
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  TMDARVS TABLE                                                          
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE TMDARVS                                                  
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  UPC TABLE                                                              
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE TUPC                                                     
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  TUPCSKU TABLE                                                          
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE TUPCSKU                                                  
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  UPCPLS TABLE                                                           
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE TUPCPLS                                                  
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  GROUP PRICING TABLE                                                    
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE TMEITGP                                                  
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  GROUP PRICING TABLE                                                    
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE TMITGPL                                                  
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  INVENTORY SKU STYLE DELETION TABLE.                                    
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE INT00003                                                 
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE IMT00015                                                 
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE IMT00017                                                 
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE IMT00020                                                 
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE MLT00011                                                 
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE MLV00000                                                 
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE TMDSEAR                                                  
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE TAPLAVL                                                  
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE TRSPBAR                                                  
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE TEXTENT                                                  
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  PERM PRICING TABLE.                                                    
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE TPPCPRC                                                  
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  DATE ATTRIBUTE TABLE                                                   
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE TDTATTR                                                  
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  BEGINNING OF MONTH TABLE                                               
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          INCLUDE XMT00023                                                 
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  TPPCPRC TABLE LOOKUP.                                                  
RONNA *****************************************************************         
RONNA      EXEC SQL                                                             
RONNA           DECLARE TPPCPRC-CSR CURSOR FOR                                  
RONNA              SELECT RTL_AMT                                               
RONNA                    ,MEITGP_NBR                                            
RONNA                    ,STATUS_CDE                                            
RONNA              FROM TPPCPRC                                                 
RONNA              WHERE TSK_ITM_NBR = :PPCPRC-TSK-ITM-NBR                      
RONNA                AND STR_NBR = :PPCPRC-STR-NBR                              
RONNA                AND (:PPCPRC-STRT-TMST >= STRT_TMST AND                    
RONNA                     :PPCPRC-END-TMST <= END_TMST)                         
RONNA              ORDER BY END_TMST DESC                                       
RONNA              FOR FETCH ONLY                                               
RONNA              WITH UR                                                      
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  INT_SKU_STYL_DLT TABLE LOOKUP - SKU                                    
RONNA *****************************************************************         
RONNA      EXEC SQL                                                             
RONNA         DECLARE SKUSTYL-SKU-CSR CURSOR FOR                                
RONNA            SELECT UPC_ID                                                  
RONNA                  ,LOC_NBR                                                 
RONNA                  ,EFF_BEG_TMST                                            
RONNA                  ,UPC_NBR                                                 
RONNA                  ,EFF_END_TMST                                            
RONNA                  ,UPC_STAT_CDE                                            
RONNA                  ,UNT_COST_AMT                                            
RONNA                  ,UNT_RTL_AMT                                             
RONNA                  ,MEITGP_NBR                                              
RONNA                  ,ITM_NBR                                                 
RONNA                  ,INTR_UPC_ID                                             
RONNA                  ,UPC_STAT_CHG_DTE                                        
RONNA                  ,UNT_RTL_CHG_DTE                                         
RONNA                  ,ORIG_CLR_DTE                                            
RONNA                  ,MKDN_CDE                                                
RONNA                  ,SUB_CL_MDSEAR_ID                                        
RONNA                  ,VS_ID                                                   
RONNA                  ,DEPT_NBR                                                
RONNA                  ,MAJ_CL_NBR                                              
RONNA                  ,SUB_CL_NBR                                              
RONNA                  ,SKU_NBR                                                 
RONNA                  ,ENT_ID                                                  
RONNA                  ,PLU_DWNLD_IND                                           
RONNA             FROM INT_SKU_STYL_DLT                                         
RONNA             WHERE SKU_NBR = :INT00003-SKU-NBR                             
RONNA               AND LOC_NBR = :INT00003-LOC-NBR                             
RONNA               AND EFF_BEG_TMST <= :INT00003-EFF-BEG-TMST                  
RONNA               AND (EFF_END_TMST >= :INT00003-EFF-END-TMST                 
RONNA                OR  EFF_END_TMST IS NULL)                                  
RONNA             ORDER BY EFF_END_TMST DESC                                    
RONNA             WITH UR                                                       
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  INT_SKU_STYL_DLT TABLE LOOKUP - UPC_NBR                                
RONNA *****************************************************************         
RONNA      EXEC SQL                                                             
RONNA         DECLARE SKUSTYL-UPC-CSR CURSOR FOR                                
RONNA            SELECT UPC_ID                                                  
RONNA                  ,LOC_NBR                                                 
RONNA                  ,EFF_BEG_TMST                                            
RONNA                  ,UPC_NBR                                                 
RONNA                  ,EFF_END_TMST                                            
RONNA                  ,UPC_STAT_CDE                                            
RONNA                  ,UNT_COST_AMT                                            
RONNA                  ,UNT_RTL_AMT                                             
RONNA                  ,MEITGP_NBR                                              
RONNA                  ,ITM_NBR                                                 
RONNA                  ,INTR_UPC_ID                                             
RONNA                  ,UPC_STAT_CHG_DTE                                        
RONNA                  ,UNT_RTL_CHG_DTE                                         
RONNA                  ,ORIG_CLR_DTE                                            
RONNA                  ,MKDN_CDE                                                
RONNA                  ,SUB_CL_MDSEAR_ID                                        
RONNA                  ,VS_ID                                                   
RONNA                  ,DEPT_NBR                                                
RONNA                  ,MAJ_CL_NBR                                              
RONNA                  ,SUB_CL_NBR                                              
RONNA                  ,SKU_NBR                                                 
RONNA                  ,ENT_ID                                                  
RONNA                  ,PLU_DWNLD_IND                                           
RONNA             FROM INT_SKU_STYL_DLT                                         
RONNA             WHERE UPC_NBR = :INT00003-UPC-NBR                             
RONNA               AND LOC_NBR = :INT00003-LOC-NBR                             
RONNA               AND EFF_BEG_TMST <= :INT00003-EFF-BEG-TMST                  
RONNA               AND (EFF_END_TMST >= :INT00003-EFF-END-TMST                 
RONNA                OR  EFF_END_TMST IS NULL)                                  
RONNA             ORDER BY EFF_END_TMST DESC                                    
RONNA             WITH UR                                                       
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  INT_SKU_STYL_DLT TABLE LOOKUP - INTR_UPC_ID                            
RONNA *****************************************************************         
RONNA      EXEC SQL                                                             
RONNA         DECLARE SKUSTYL-IUPC-CSR CURSOR FOR                               
RONNA            SELECT UPC_ID                                                  
RONNA                  ,LOC_NBR                                                 
RONNA                  ,EFF_BEG_TMST                                            
RONNA                  ,UPC_NBR                                                 
RONNA                  ,EFF_END_TMST                                            
RONNA                  ,UPC_STAT_CDE                                            
RONNA                  ,UNT_COST_AMT                                            
RONNA                  ,UNT_RTL_AMT                                             
RONNA                  ,MEITGP_NBR                                              
RONNA                  ,ITM_NBR                                                 
RONNA                  ,INTR_UPC_ID                                             
RONNA                  ,UPC_STAT_CHG_DTE                                        
RONNA                  ,UNT_RTL_CHG_DTE                                         
RONNA                  ,ORIG_CLR_DTE                                            
RONNA                  ,MKDN_CDE                                                
RONNA                  ,SUB_CL_MDSEAR_ID                                        
RONNA                  ,VS_ID                                                   
RONNA                  ,DEPT_NBR                                                
RONNA                  ,MAJ_CL_NBR                                              
RONNA                  ,SUB_CL_NBR                                              
RONNA                  ,SKU_NBR                                                 
RONNA                  ,ENT_ID                                                  
RONNA                  ,PLU_DWNLD_IND                                           
RONNA             FROM INT_SKU_STYL_DLT                                         
RONNA             WHERE INTR_UPC_ID = :INT00003-INTR-UPC-ID                     
RONNA               AND LOC_NBR = :INT00003-LOC-NBR                             
RONNA               AND EFF_BEG_TMST <= :INT00003-EFF-BEG-TMST                  
RONNA               AND (EFF_END_TMST >= :INT00003-EFF-END-TMST                 
RONNA                OR  EFF_END_TMST IS NULL)                                  
RONNA             ORDER BY EFF_END_TMST DESC                                    
RONNA             WITH UR                                                       
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA *  INT_SKU_STYL_DLT TABLE LOOKUP - ITM_NBR                                
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA         DECLARE SKUSTYL-ITM-CSR CURSOR FOR                                
RONNA            SELECT UPC_ID                                                  
RONNA                  ,LOC_NBR                                                 
RONNA                  ,EFF_BEG_TMST                                            
RONNA                  ,UPC_NBR                                                 
RONNA                  ,EFF_END_TMST                                            
RONNA                  ,UPC_STAT_CDE                                            
RONNA                  ,UNT_COST_AMT                                            
RONNA                  ,UNT_RTL_AMT                                             
RONNA                  ,MEITGP_NBR                                              
RONNA                  ,ITM_NBR                                                 
RONNA                  ,INTR_UPC_ID                                             
RONNA                  ,UPC_STAT_CHG_DTE                                        
RONNA                  ,UNT_RTL_CHG_DTE                                         
RONNA                  ,ORIG_CLR_DTE                                            
RONNA                  ,MKDN_CDE                                                
RONNA                  ,SUB_CL_MDSEAR_ID                                        
RONNA                  ,VS_ID                                                   
RONNA                  ,DEPT_NBR                                                
RONNA                  ,MAJ_CL_NBR                                              
RONNA                  ,SUB_CL_NBR                                              
RONNA                  ,SKU_NBR                                                 
RONNA                  ,ENT_ID                                                  
RONNA                  ,PLU_DWNLD_IND                                           
RONNA             FROM INT_SKU_STYL_DLT                                         
RONNA             WHERE ITM_NBR = :INT00003-ITM-NBR                             
RONNA               AND LOC_NBR = :INT00003-LOC-NBR                             
RONNA               AND EFF_BEG_TMST <= :INT00003-EFF-BEG-TMST                  
RONNA               AND (EFF_END_TMST >= :INT00003-EFF-END-TMST                 
RONNA                OR  EFF_END_TMST IS NULL)                                  
RONNA             ORDER BY EFF_END_TMST DESC                                    
RONNA             WITH UR                                                       
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ******************************************************************        
RONNA * BRAND CURSOR.                                                           
RONNA ******************************************************************        
RONNA      EXEC SQL                                                             
RONNA          DECLARE BV_BRND_CSR CURSOR FOR                                   
RONNA            SELECT  DEPT_BRND_VND_ID                                       
RONNA                   ,DEPT_NBR                                               
RONNA                   ,ENT_ID                                                 
RONNA            FROM IMT_DEPT_BRND_VND                                         
RONNA            WHERE LBL_SEQ_NBR   = :BV003-PV-WORK-BRAND                     
RONNA              AND EFF_BEG_DTE  <= :BV003-PV-WORK-DATE                      
RONNA              AND (EFF_END_DTE IS NULL OR                                  
RONNA                   EFF_END_DTE >= :BV003-PV-WORK-DATE)                     
RONNA            WITH UR                                                        
RONNA            FOR FETCH ONLY                                                 
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ************************************************************              
RONNA * BRAND DEPT CURSOR.                                                      
RONNA ************************************************************              
RONNA      EXEC SQL                                                             
RONNA          DECLARE BV_BRND_DEPT_CSR CURSOR FOR                              
RONNA            SELECT  DEPT_BRND_VND_ID                                       
RONNA                   ,ENT_ID                                                 
RONNA            FROM IMT_DEPT_BRND_VND                                         
RONNA            WHERE LBL_SEQ_NBR   = :BV003-PV-WORK-BRAND                     
RONNA              AND EFF_BEG_DTE  <= :BV003-PV-WORK-DATE                      
RONNA              AND (EFF_END_DTE IS NULL OR                                  
RONNA                   EFF_END_DTE >= :BV003-PV-WORK-DATE)                     
RONNA              AND DEPT_NBR      = :BV003-PV-WORK-DEPT                      
RONNA            WITH UR                                                        
RONNA            FOR FETCH ONLY                                                 
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ************************************************************              
RONNA * VENDOR CURSOR.                                                          
RONNA ************************************************************              
RONNA      EXEC SQL                                                             
RONNA          DECLARE BV_VNDR_CSR CURSOR FOR                                   
RONNA            SELECT  DEPT_BRND_VND_ID                                       
RONNA                   ,DEPT_NBR                                               
RONNA                   ,LBL_SEQ_NBR                                            
RONNA            FROM IMT_DEPT_BRND_VND                                         
RONNA            WHERE ENT_ID        = :BV003-PV-WORK-ENT-ID                    
RONNA              AND EFF_BEG_DTE  <= :BV003-PV-WORK-DATE                      
RONNA              AND (EFF_END_DTE IS NULL OR                                  
RONNA                   EFF_END_DTE >= :BV003-PV-WORK-DATE)                     
RONNA            WITH UR                                                        
RONNA            FOR FETCH ONLY                                                 
RONNA      END-EXEC.                                                            
RONNA                                                                           
RONNA ************************************************************              
RONNA * VENDOR DEPT CURSOR.                                                     
RONNA ************************************************************              
RONNA      EXEC SQL                                                             
RONNA          DECLARE BV_VNDR_DEPT_CSR CURSOR FOR                              
RONNA            SELECT  DEPT_BRND_VND_ID                                       
RONNA                   ,LBL_SEQ_NBR                                            
RONNA            FROM IMT_DEPT_BRND_VND                                         
RONNA            WHERE ENT_ID        = :BV003-PV-WORK-ENT-ID                    
RONNA              AND EFF_BEG_DTE  <= :BV003-PV-WORK-DATE                      
RONNA              AND (EFF_END_DTE IS NULL OR                                  
RONNA                   EFF_END_DTE >= :BV003-PV-WORK-DATE)                     
RONNA              AND DEPT_NBR      = :BV003-PV-WORK-DEPT                      
RONNA            WITH UR                                                        
RONNA            FOR FETCH ONLY                                                 
RONNA      END-EXEC.                                                            
RONNA ************************************************************              
RONNA * VENDOR DEPT FUTURE CURSOR                                               
RONNA ************************************************************              
RONNA      EXEC SQL                                                             
RONNA          DECLARE BV_VND_DPT_FUT_CSR CURSOR FOR                            
RONNA            SELECT  DEPT_BRND_VND_ID                                       
RONNA                   ,LBL_SEQ_NBR                                            
RONNA            FROM IMT_DEPT_BRND_VND                                         
RONNA            WHERE ENT_ID        = :BV003-PV-WORK-ENT-ID                    
RONNA              AND EFF_BEG_DTE  >  :BV003-PV-WORK-DATE                      
RONNA              AND (EFF_END_DTE IS NULL OR                                  
RONNA                   EFF_END_DTE >  :BV003-PV-WORK-DATE)                     
RONNA              AND DEPT_NBR      = :BV003-PV-WORK-DEPT                      
RONNA            WITH UR                                                        
RONNA            FOR FETCH ONLY                                                 
RONNA      END-EXEC.                                                            
RONNA ************************************************************              
RONNA * VENDOR DEPT PAST CURSOR                                                 
RONNA ************************************************************              
RONNA      EXEC SQL                                                             
RONNA          DECLARE BV_VND_DPT_PST_CSR CURSOR FOR                            
RONNA            SELECT  DEPT_BRND_VND_ID                                       
RONNA                   ,LBL_SEQ_NBR                                            
RONNA            FROM IMT_DEPT_BRND_VND BV1                                     
RONNA            WHERE ENT_ID      =  :BV003-PV-WORK-ENT-ID                     
RONNA              AND EFF_BEG_DTE <  :BV003-PV-WORK-DATE                       
RONNA              AND EFF_BEG_DTE >= DATE(:BV003-PV-WORK-DATE) -               
RONNA                                      :BV003-PV-PAST-MONTHS MONTHS         
RONNA              AND DEPT_NBR    =  :BV003-PV-WORK-DEPT                       
RONNA              AND EFF_END_DTE = (SELECT MAX(EFF_END_DTE)                   
RONNA                                   FROM IMT_DEPT_BRND_VND BV2              
RONNA                                  WHERE BV1.ENT_ID = BV2.ENT_ID            
RONNA                                    AND BV1.LBL_SEQ_NBR =                  
RONNA                                        BV2.LBL_SEQ_NBR                    
RONNA                                    AND BV1.DEPT_NBR    =                  
RONNA                                        BV2.DEPT_NBR                       
RONNA                                    AND BV2.EFF_BEG_DTE <                  
RONNA                                        :BV003-PV-WORK-DATE                
RONNA                                    AND BV2.EFF_BEG_DTE >=                 
RONNA                                        DATE(:BV003-PV-WORK-DATE) -        
RONNA                                        :BV003-PV-PAST-MONTHS              
RONNA                                         MONTHS)                           
RONNA            WITH UR                                                        
RONNA            FOR FETCH ONLY                                                 
RONNA      END-EXEC.                                                            
RONNA                                                                   02290036
                                                                        02300036
      ******************************************************************02310036
      *  WORKING STORAGE FOR COMMON DEPARTMENT INVENTORY FILTER         02320036
      ******************************************************************02330036
                                                                        02340036
           COPY INWS401.                                                02350036
      *                                                                 02360036
                                                                        02370036
                                                                        02380036
      ***************************************************************** 02390036
      * ERROR MESSAGE AREA FOR DB2                                      02400036
      ***************************************************************** 02410036
           COPY DPWS004.                                                02420036
                                                                        02430036
      *************************************************************     02440036
      *    DB2 COMMUNICATION AREA                                 *     02450036
      *************************************************************     02460036
           EXEC SQL                                                     02470036
               INCLUDE SQLCA                                            02480036
           END-EXEC.                                                    02490036
                                                                        02500036
                                                                        02510036
       PROCEDURE DIVISION.                                              02520036
                                                                        02530036
      *************************************************************     02540036
      * MAIN PROCESSING PARAGRAPH                                 *     02550036
      *************************************************************     02560036
       0000-MAINLINE.                                                   02570036
                                                                        02580036
            PERFORM 1000-INITIALIZATION.                                02590036
                                                                        02600036
            PERFORM 3000-PROCESS-INPUT                                  02610036
               UNTIL PS-INPUT-AT-END-YES.                               02620036
                                                                        02630036
            PERFORM 8000-END-PROCESSING.                                02640036
                                                                        02650036
            STOP RUN.                                                   02660036
                                                                        02670036
      ***************************************************************   02680036
      * OPEN FILES                                                      02690036
      ***************************************************************   02700036
       1000-INITIALIZATION.                                             02710036
                                                                        02720036
           OPEN INPUT  IN-CONTROL-FILE                                  02730036
                       IN-SHORTAGE-EXT-FILE                             02740036
                       SKIP-CLASS-FILE                                  02750036
W34517                 IN-CONTROL-DTE-FILE                                      
                OUTPUT OUT-SHORTAGE-EXT-FILE                            02760036
                       BLOCKED-DEPT-CLASS-FILE                          02770036
                       OUT-LOOKUP-ERROR-FILE                            02780036
                       OUT-DEPT-INV-NA-FILE.                            02790036
                                                                        02800036
           PERFORM 1050-READ-CONTROL.                                   02810036
                                                                        02820036
W34517     PERFORM 1060-READ-CONTROL-DTE.                               02810036
W34517                                                                  02820036
           PERFORM 1100-LOAD-SKIP-CLASS.                                02830036
                                                                        02840036
       1050-READ-CONTROL.                                               02850036
                                                                        02860036
           READ IN-CONTROL-FILE INTO IN-CC-REC                          02870036
               AT END                                                   02880036
                   DISPLAY 'CONTROL FILE IS EMPTY, DEFAUT TO ALL'       02890036
                   DISPLAY 'CONTROL FILE IS EMPTY, DEFAUT TO ALL'       02900036
                   DISPLAY 'CONTROL FILE IS EMPTY, DEFAUT TO ALL'       02910036
                   DISPLAY 'CONTROL FILE IS EMPTY, DEFAUT TO ALL'       02920036
                   DISPLAY 'CONTROL FILE IS EMPTY, DEFAUT TO ALL'       02930036
                   MOVE PC-ALL TO PV-CONTROL-TYPE                       02940036
                   SET PS-CONTROL-AT-END-YES TO TRUE.                   02950036
                                                                        02960036
           IF PS-CONTROL-AT-END-NO                                      02970036
               IF IN-CC-TYPE-DEPT OR IN-CC-TYPE-ALL                     02980036
                   MOVE IN-CC-TYPE TO PV-CONTROL-TYPE                   02990036
               ELSE                                                     03000036
                   DISPLAY 'CONTROL FILE REC INVALID ' IN-CC-TYPE       03010036
                   DISPLAY 'CONTROL FILE REC INVALID ' IN-CC-TYPE       03020036
                   DISPLAY 'DEFAULT TO ALL'                             03030036
                   MOVE PC-ALL TO PV-CONTROL-TYPE                       03040036
               END-IF                                                   03050036
           END-IF.                                                      03060036
                                                                        03070036
W34517                                                                  02860036
W34517 1060-READ-CONTROL-DTE.                                           02850036
W34517                                                                  02860036
W34517     READ IN-CONTROL-DTE-FILE                                     02870036
W34517         AT END                                                   02880036
W34517             SET PS-CONTROL-DTE-AT-END-YES TO TRUE.               02950036
W34517                                                                  02860036
W34517     IF PS-CONTROL-DTE-AT-END-YES                                 02950036
W34517         OR IN-CC-DTE-CCYY NOT NUMERIC                            02950036
W34517         OR IN-CC-DTE-MM   NOT NUMERIC                            02950036
W34517         OR IN-CC-DTE-DD   NOT NUMERIC                            02950036
W34517         OR NOT IN-CC-DTE-VALID-DASH-1                            02950036
W34517         OR NOT IN-CC-DTE-VALID-DASH-2                            02950036
W34517         DISPLAY ' ' PC-PROGRAM-ID                                02890036
W34517                 ' - CONTROL CARD DATE NOT PROVIDED OR INVALID'   02890036
W34517         DISPLAY ' WILL USE IN034-ACTL-INV-DTE TO GET BOM DATE'   02890036
W34517         SET PS-CC-DATE-NOT-PROVIDED TO TRUE                      02890036
W34517     ELSE                                                         02960036
W34517         DISPLAY ' ' PC-PROGRAM-ID                                02890036
W34517               ' - CONTROL CARD DATE WILL BE USED TO GET BOM DATE'02890036
W34517         DISPLAY ' ' PC-PROGRAM-ID                                02890036
W34517                 ' - CONTROL CARD DATE ' IN-CC-DTE                02890036
W34517         DISPLAY ' '                                              02890036
W34517         SET PS-CC-DATE-PROVIDED TO TRUE                          02890036
W34517     END-IF.                                                      02960036
W34517                                                                  02960036
W34517                                                                  03070036
       1100-LOAD-SKIP-CLASS.                                            03080036
                                                                        03090036
           MOVE ZEROS           TO PT-SKIP-CLASS-INDX.                  03100036
           PERFORM 1175-READ-SKIP-CLASS.                                03110036
           PERFORM                                                      03120036
               UNTIL END-OF-SKIP-CLASS                                  03130036
                   OR PT-SKIP-CLASS-INDX > PT-SKIP-CLASS-MAX            03140036
               ADD +1                     TO PT-SKIP-CLASS-INDX         03150036
               MOVE SK-SKIP-DEPT-CLASS                                  03160036
                   TO PT-SKIP-DEPT-CLASS(PT-SKIP-CLASS-INDX)            03170036
               PERFORM 1175-READ-SKIP-CLASS                             03180036
           END-PERFORM.                                                 03190036
                                                                        03200036
           IF PT-SKIP-CLASS-INDX > PT-SKIP-CLASS-MAX                    03210036
               DISPLAY 'MORE THAN ' PT-SKIP-CLASS-MAX ' SKIP CLASS '    03220036
               DISPLAY 'MUST EXPAND SKIP-CLASS TABLE  '                 03230036
               SET ABEND-4003         TO TRUE                           03240036
               PERFORM 9800-ABEND                                       03250036
           ELSE                                                         03260036
               MOVE PT-SKIP-CLASS-INDX    TO PT-SKIP-CLASS-COUNT        03270036
           END-IF.                                                      03280036
                                                                        03290036
                                                                        03300036
       1175-READ-SKIP-CLASS.                                            03310036
                                                                        03320036
           READ SKIP-CLASS-FILE      INTO SK-SKIP-CLASS-RECORD          03330036
             AT END                                                     03340036
               SET END-OF-SKIP-CLASS        TO TRUE.                    03350036
                                                                        03360036
                                                                        03370036
      ***************************************************************   03380036
      *     3000-PROCESS-INPUT                                      *   03390036
      *     READ INPUT                                              *   03400036
      *     DETERMINE BRAND VENDOR ID                               *   03410036
      *     WRITE OUTPUT                                            *   03420036
      ***************************************************************   03430036
                                                                        03440036
       3000-PROCESS-INPUT.                                              03450036
                                                                        03460036
           PERFORM 3100-READ-INPUT.                                     03470036
                                                                        03480036
           IF PS-INPUT-AT-END-NO                                        03490036
               IF IN034-SKU = PV-HOLD-PREV-SKU                          03500036
                   AND IN034-ACTL-INV-DTE = PV-HOLD-ACTL-INV-DTE        03510036
                   MOVE PV-HOLD-PREV-DEPT    TO IN034-DEPT-NBR          03512034
                   MOVE PV-HOLD-PREV-MCL     TO IN034-MAJ-CL-NBR        03513034
                   MOVE PV-HOLD-PREV-SCL     TO IN034-SUB-CL-NBR        03514034
                   PERFORM 5000-WRITE-OUTPUT                            03520036
               ELSE                                                     03530036
                   PERFORM 4000-LOOK-UP                                 03540036
                   PERFORM 5000-WRITE-OUTPUT                            03550036
                   MOVE IN034-SKU TO PV-HOLD-PREV-SKU                   03560036
                   MOVE IN034-ACTL-INV-DTE TO PV-HOLD-ACTL-INV-DTE      03570036
035382             MOVE IN034-DEPT-NBR      TO PV-HOLD-PREV-DEPT        04031036
035382             MOVE IN034-MAJ-CL-NBR    TO PV-HOLD-PREV-MCL         04032036
035382             MOVE IN034-SUB-CL-NBR    TO PV-HOLD-PREV-SCL         04033036
               END-IF                                                   03580036
           END-IF.                                                      03590036
                                                                        03600036
       3100-READ-INPUT.                                                 03610036
                                                                        03620036
           READ IN-SHORTAGE-EXT-FILE INTO IN034-SHORTAGE-EXTR-REC       03630036
               AT END                                                   03640036
                  SET PS-INPUT-AT-END-YES TO TRUE.                      03650036
                                                                        03660036
           IF PS-INPUT-AT-END-NO                                        03670036
               ADD +1 TO PA-INPUT-RECORD-COUNT                          03680036
           END-IF.                                                              
                                                                        03690036
       4000-LOOK-UP.                                                    03700036
                                                                        03710036
W34517*    IF PV-CONTROL-TYPE-ALL                                       03720036
W34517*        PERFORM 4100-LOOK-UP                                     03730036
W34517*    ELSE                                                         03740036
W34517*        IF IN034-DEPT-NBR = SPACES                               03750036
W34517*            PERFORM 4100-LOOK-UP                                 03760036
W34517*        END-IF                                                   03770036
W34517*    END-IF.                                                      03780036
W34517     IF IN034-DEPT-NBR = SPACES                                   03750036
W34517         PERFORM 4100-LOOK-UP                                     03760036
W34517     END-IF.                                                      03770036
W34517                                                                  03770036
RONNA      SET BV101-PV-BOM-NOT-FOUND TO TRUE.                          03540036
W34517                                                                  03770036
W34517     IF IN034-SKU NOT = ZEROS                                     03920036
W34517         PERFORM 4300-BOM-LOOK-UP                                 03540036
W34517     END-IF.                                                      03770036
W34517                                                                  03770036
RONNA      IF BV101-PV-BOM-NOT-FOUND                                    03540036
W34517         IF IN034-DEPT-NBR NOT = SPACES                           03720036
W34517             PERFORM 4100-LOOK-UP                                 03730036
W34517         END-IF                                                   03780036
W34517     END-IF.                                                      03540036
                                                                        03790036
                                                                        03800036
       4100-LOOK-UP.                                                    03810036
                                                                        03820036
RONNA      INITIALIZE IN402-PV-INPUT-AREA.                              03830036
                                                                        03840036
           SET PS-WRITE-GOOD-YES        TO TRUE.                        03850036
                                                                        03860036
RONNA      MOVE IN034-ACTL-INV-DTE      TO IN402-PV-EFF-DTE-IN.         03870036
RONNA      MOVE 'ASKU'                  TO IN402-PV-LOOKUP-TYPE-IN.     03880036
RONNA      MOVE IN034-SKU               TO IN402-PV-SKU-IN-NUM.         03890036
RONNA      MOVE IN034-STR-NBR           TO IN402-PV-LOC-IN-NUM.         03900036
                                                                        03910036
RONNA      IF IN402-PV-SKU-IN-NUM = ZEROS                               03920036
RONNA          MOVE 99999999 TO IN402-PV-SKU-IN-NUM.                    03930036
                                                                        03940036
RONNA      PERFORM IN402-LOOKUP-RETAIL.                                 03950036
                                                                        03960036
RONNA      IF IN402-PV-ATT-FOUND                                        03970036
RONNA          MOVE IN402-VND-ML-LO-MDSE-LVL-ID                         03980036
                                        TO PV-ML-LWST-ID                03990036
               PERFORM 4050-BRAND-VENDOR-COMMIT-CHK                     04000036
               IF IN034-DEPT-NBR = SPACES                               04010036
                   PERFORM 4200-ATTRIBUTE-UPDATE                        04020036
               END-IF                                                   04030036
               MOVE IN034-DEPT-NBR      TO PV-HOLD-PREV-DEPT            04031036
               MOVE IN034-MAJ-CL-NBR    TO PV-HOLD-PREV-MCL             04032036
               MOVE IN034-SUB-CL-NBR    TO PV-HOLD-PREV-SCL             04033036
RONNA          IF IN402-VND-ML-LO-MDSE-LVL-ID = ZEROS                   04040036
                   DISPLAY ' FOUND  ID OF ZEROS '                       04050036
RONNA              DISPLAY 'DTE ' IN402-PV-EFF-DTE-IN                   04060036
RONNA              DISPLAY 'TYPE ' IN402-PV-LOOKUP-TYPE-IN              04070036
RONNA              DISPLAY 'LOC '  IN402-PV-LOC-IN-NUM                  04080036
RONNA              DISPLAY 'SKU ' IN402-PV-SKU-IN-NUM                   04090036
RONNA              DISPLAY 'SQL ' IN402-PV-ATT-SQLCDE                   04100036
RONNA              DISPLAY 'RSN ' IN402-PV-RETURN-RSN                   04110036
               END-IF                                                   04120036
           ELSE                                                         04130036
RONNA          IF IN402-PV-ATT-NOT-FOUND                                04140036
                   MOVE ZEROS           TO PV-ML-LWST-ID                04150036
                   SET PS-WRITE-ERROR-YES TO TRUE                       04160036
RONNA              DISPLAY 'IN402 ATTR ID IS ZEROS NOT FOUND'           04170036
RONNA              DISPLAY 'DTE ' IN402-PV-EFF-DTE-IN                   04180036
RONNA              DISPLAY 'TYPE ' IN402-PV-LOOKUP-TYPE-IN              04190036
RONNA              DISPLAY 'LOC '  IN402-PV-LOC-IN-NUM                  04200036
RONNA              DISPLAY 'SKU ' IN402-PV-SKU-IN-NUM                   04210036
RONNA              DISPLAY 'SQL ' IN402-PV-ATT-SQLCDE                   04220036
RONNA              DISPLAY 'RSN ' IN402-PV-RETURN-RSN                   04230036
           ELSE                                                         04240036
RONNA              DISPLAY 'IN402-PV-ATT-RTNCDE '                       04250036
RONNA                                       IN402-PV-ATT-RTNCDE         04260036
                   MOVE '4100-LOOK-UP '                                 04270036
                                         TO PV-PARAGRAPH-NAME           04280036
RONNA              MOVE 'INPD402 ATTRIBUTE LOOK UP '                    04290036
                                 TO  PV-DB2-OPER-ATTEMPTED              04300036
                   PERFORM 9900-SQL-ABEND                               04310036
                                                                        04320036
           END-IF.                                                      04330036
                                                                        04340036
       4050-BRAND-VENDOR-COMMIT-CHK.                                    04350036
                                                                        04360036
RONNA      IF BV003-UNKNOWN-INS                                         04370036
               EXEC SQL                                                 04380036
                   COMMIT                                               04390036
               END-EXEC                                                 04400036
               IF SQLCODE NOT = ZEROS                                   04410036
                   DISPLAY 'ERROR TRYING TO COMMIT BV UPDATES '         04420036
                   MOVE '4050-BRAND-VENDOR-COMMIT-CHK'                  04430036
                                         TO PV-PARAGRAPH-NAME           04440036
                   MOVE 'COMMIT PROCESS            '                    04450036
                                 TO  PV-DB2-OPER-ATTEMPTED              04460036
                   PERFORM 9900-SQL-ABEND                               04470036
               END-IF                                                   04480036
           END-IF.                                                      04490036
                                                                        04500036
       4200-ATTRIBUTE-UPDATE.                                           04510036
                                                                        04520036
RONNA      MOVE IN402-ATT-DEPT-OUT   TO PV-EDIT-DEPT-NBR.               04530036
           MOVE PV-EDIT-DEPT-2-4     TO IN034-DEPT-NBR.                 04540036
RONNA      MOVE IN402-ATT-MCL-OUT    TO PV-EDIT-MCL-NBR.                04550036
           MOVE PV-EDIT-MCL-3-4      TO IN034-MAJ-CL-NBR.               04560036
RONNA      MOVE IN402-ATT-SCL-OUT    TO PV-EDIT-SCL-NBR.                04570036
           MOVE PV-EDIT-SCL-3-4      TO IN034-SUB-CL-NBR.               04580036
                                                                        04610036
                                                                        04620036
W34517 4300-BOM-LOOK-UP.                                                03810036
W34517                                                                  03820036
RONNA      INITIALIZE BV101-PV-INPUT-AREA.                              03830036
W34517                                                                  03840036
RONNA      SET BV101-PV-SKU-LOOKUP      TO TRUE.                        03880036
W34517     IF PS-CC-DATE-PROVIDED                                       03870036
RONNA          MOVE IN-CC-DTE           TO BV101-PV-EFF-DTE-IN          03870036
W34517     ELSE                                                         03870036
RONNA          MOVE IN034-ACTL-INV-DTE  TO BV101-PV-EFF-DTE-IN          03870036
W34517         IF IN034-ACTL-INV-DTE = PV-HOLD-ACTL-INV-DTE             03870036
RONNA              SET BV101-PS-NEW-BOM-DTE-NO  TO TRUE                 03870036
W34517         ELSE                                                     03870036
RONNA              SET BV101-PS-NEW-BOM-DTE-YES TO TRUE                 03870036
W34517         END-IF                                                   03870036
W34517     END-IF.                                                      03870036
RONNA      MOVE IN034-SKU               TO BV101-PV-SKU-IN-NUM.         03890036
RONNA      MOVE IN034-DEPT-NBR          TO BV101-PV-DEPT-IN-9.          03890036
W34517                                                                  03910036
RONNA      PERFORM BV101-LOOKUP-BOM.                                    03950036
W34517                                                                  03960036
RONNA      IF BV101-PV-BOM-FOUND                                        03970036
W34517         SET PS-WRITE-GOOD-YES          TO TRUE                   03850036
RONNA          MOVE BV101-BOM-LO-MDSE-LVL-ID-OUT                        03980036
W34517                                        TO PV-ML-LWST-ID          03990036
W34517                                           PV-EDIT-LO-MDSE-LVL-ID 04530036
RONNA          MOVE BV101-BOM-ENT-ID-OUT      TO PV-EDIT-ENT-ID         04530036
RONNA          MOVE BV101-BOM-LBL-SEQ-NBR-OUT TO PV-EDIT-LBL-SEQ-NBR    04530036
W34517         EVALUATE TRUE                                                    
RONNA              WHEN BV101-PV-DKEY-FOUND-NO-EFF                              
W34517                 DISPLAY 'DKEY FOUND OUTSIDE EFF DATE'                    
RONNA                  DISPLAY 'SKU      ' BV101-PV-SKU-IN-NUM                  
RONNA                  DISPLAY 'BOM DATE ' BV101-BOM-FSCL-DTE-OUT               
W34517                 DISPLAY 'DEPT     ' IN034-DEPT-NBR                       
W34517                 DISPLAY 'ENT ID   ' PV-EDIT-ENT-ID                       
W34517                 DISPLAY 'LBL SEQ  ' PV-EDIT-LBL-SEQ-NBR                  
W34517                 DISPLAY 'DKEY     ' PV-EDIT-LO-MDSE-LVL-ID               
RONNA              WHEN BV101-PV-DKEY-UNKN-BRAND                                
W34517                 DISPLAY 'DKEY FOUND UNKNOWN BRAND'                       
RONNA                  DISPLAY 'SKU      ' BV101-PV-SKU-IN-NUM                  
RONNA                  DISPLAY 'BOM DATE ' BV101-BOM-FSCL-DTE-OUT               
W34517                 DISPLAY 'DEPT     ' IN034-DEPT-NBR                       
W34517                 DISPLAY 'ENT ID   ' PV-EDIT-ENT-ID                       
W34517                 DISPLAY 'LBL SEQ  ' PV-EDIT-LBL-SEQ-NBR                  
W34517                 DISPLAY 'DKEY     ' PV-EDIT-LO-MDSE-LVL-ID               
RONNA              WHEN BV101-PV-DKEY-UNKN-UNKN                                 
W34517                 DISPLAY 'DKEY FOUND UNKNOWN/UNKNOWN'                     
RONNA                  DISPLAY 'SKU      ' BV101-PV-SKU-IN-NUM                  
RONNA                  DISPLAY 'BOM DATE ' BV101-BOM-FSCL-DTE-OUT               
W34517                 DISPLAY 'DEPT     ' IN034-DEPT-NBR                       
W34517                 DISPLAY 'ENT ID   ' PV-EDIT-ENT-ID                       
W34517                 DISPLAY 'LBL SEQ  ' PV-EDIT-LBL-SEQ-NBR                  
W34517                 DISPLAY 'DKEY     ' PV-EDIT-LO-MDSE-LVL-ID               
RONNA              WHEN BV101-PV-DKEY-UNKN-NOT-FOUND                            
W34517                 DISPLAY 'DKEY UNKNOWN/UNKNOWN NOT FOUND'                 
RONNA                  DISPLAY 'SKU      ' BV101-PV-SKU-IN-NUM                  
RONNA                  DISPLAY 'BOM DATE ' BV101-BOM-FSCL-DTE-OUT               
W34517                 DISPLAY 'DEPT     ' IN034-DEPT-NBR                       
W34517                 DISPLAY 'ENT ID   ' PV-EDIT-ENT-ID                       
W34517                 DISPLAY 'LBL SEQ  ' PV-EDIT-LBL-SEQ-NBR                  
W34517                 DISPLAY 'DKEY     ' PV-EDIT-LO-MDSE-LVL-ID               
W34517         END-EVALUATE                                                     
W34517         MOVE IN034-DEPT-NBR      TO PV-HOLD-PREV-DEPT            04031036
W34517         MOVE IN034-MAJ-CL-NBR    TO PV-HOLD-PREV-MCL             04032036
W34517         MOVE IN034-SUB-CL-NBR    TO PV-HOLD-PREV-SCL             04033036
W34517     ELSE                                                         04130036
RONNA          IF BV101-PV-BOM-NOT-FOUND                                04140036
W34517             MOVE ZEROS            TO PV-ML-LWST-ID               04150036
RONNA****** ONLY DISPLAY IF IT IS NOT A DUMMY SKU                               
RONNA              IF NOT BV101-PV-DUMMY-SKU   THEN                             
W34517                DISPLAY 'BOM NOT FOUND FOR: '                     03870036
RONNA                 DISPLAY 'BOM DATE ' BV101-PV-EFF-DTE-IN           03870036
RONNA                 DISPLAY 'SKU      ' BV101-PV-SKU-IN-NUM           03890036
RONNA              END-IF                                                       
RONNA              IF BV101-PV-INVALID-KEY-INPUT                        04240036
RONNA                 DISPLAY 'BV101-PV-BOM-RTNCDE '                    04250036
RONNA                                          BV101-PV-BOM-RTNCDE      04260036
W34517                MOVE '4300-BOM-LOOK-UP '                          04270036
W34517                                      TO PV-PARAGRAPH-NAME        04280036
RONNA                 MOVE 'BV101-BOM LOOK UP '                         04290036
W34517                                      TO PV-DB2-OPER-ATTEMPTED    04300036
W34517                DISPLAY '**********************************'      04240036
W34517                DISPLAY '* BOM LOOKUP RETURN REASON:'             04240036
RONNA                 DISPLAY BV101-PV-RETURN-RSN                       04240036
W34517                DISPLAY '**********************************'      04240036
RONNA                 IF BV101-PV-BOM-SQL-ERROR                         04240036
W34517                    PERFORM 9900-SQL-ABEND                        04310036
W34517                ELSE                                              04330036
W34517                    PERFORM 9800-ABEND                            06310036
W34517                END-IF                                            04330036
W34517             END-IF                                               04330036
W34517         END-IF                                                   04330036
W34517     END-IF.                                                      04330036
W34517                                                                  04340036
W34517                                                                  04340036
       5000-WRITE-OUTPUT.                                               04630036
                                                                        04640036
           IF PS-WRITE-ERROR-YES                                        04650036
               PERFORM 5005-WRITE-ERROR                                 04660036
           ELSE                                                         04670036
               PERFORM 5100-SKIP-CHK                                    04680036
               IF PS-WRITE-BLOCKED-YES                                  04690036
                   PERFORM 5125-WRITE-BLOCKED                           04700036
               ELSE                                                     04710036
                   PERFORM 5200-DEPT-INV-CHK                            04720036
                   IF PS-WRITE-INV-NA-YES                               04730036
                       PERFORM 5225-WRITE-INV-NA                        04740036
                   ELSE                                                 04750036
                       PERFORM 5010-WRITE-GOOD                          04760036
                   END-IF                                               04770036
               END-IF                                                   04780036
           END-IF.                                                      04790036
                                                                        04800036
                                                                        04810036
       5005-WRITE-ERROR.                                                04820036
                                                                        04830036
           MOVE IN034-GMA-NBR           TO ERROR-GMA-NBR.               04840036
           MOVE IN034-BYR-NBR           TO ERROR-BYR-NBR.               04850036
           MOVE IN034-BYR-NAME          TO ERROR-BYR-NAME.              04860036
           MOVE IN034-DEPT-NBR          TO ERROR-DEPT-NBR.              04870036
           MOVE IN034-DEPT-MDSEAR-DESC  TO ERROR-DEPT-MDSEAR-DESC.      04880036
           MOVE IN034-MAJ-CL-NBR        TO ERROR-MAJ-CL-NBR.            04890036
           MOVE IN034-SUB-CL-NBR        TO ERROR-SUB-CL-NBR.            04900036
           MOVE PV-ML-LWST-ID           TO ERROR-ML-LWST-ID.            04910036
           MOVE IN034-RPT-CL-NBR        TO ERROR-RPT-CL-NBR.            04920036
           MOVE IN034-RPT-LVL           TO ERROR-RPT-LVL.               04930036
           MOVE IN034-STR-NBR           TO ERROR-STR-NBR.               04940036
           MOVE IN034-STR-NAME          TO ERROR-STR-NAME.              04950036
           MOVE IN034-BOOK-INV-RTL-AMT  TO ERROR-BOOK-INV-RTL-AMT.      04960036
           MOVE IN034-SLS-BSE-RTL-AMT   TO ERROR-SLS-BSE-RTL-AMT.       04970036
           MOVE IN034-SHNK-RTL-AMT      TO ERROR-SHNK-RTL-AMT.          04980036
           MOVE IN034-TOTAL-BOOK-RTL-AMT                                04990036
                                     TO ERROR-TOTAL-BOOK-RTL-AMT        05000036
           MOVE IN034-PHY-INV-RTL-AMT   TO ERROR-PHY-INV-RTL-AMT.       05010036
           MOVE IN034-SHORTAGE-RTL-AMT  TO ERROR-SHORTAGE-RTL-AMT.      05020036
           MOVE IN034-ESTIMATED-INV-ADJ-AMT                             05030036
                                     TO ERROR-ESTIMATED-INV-ADJ-AMT.    05040036
           MOVE IN034-DISTRICT-NMBR     TO ERROR-DISTRICT-NMBR.         05050036
           MOVE IN034-REGION-NBR        TO ERROR-REGION-NBR.            05060036
           MOVE IN034-TERRITORY-NBR     TO ERROR-TERRITORY-NBR.         05070036
           MOVE IN034-SKU               TO ERROR-SKU.                   05080036
           MOVE IN034-ACTL-INV-DTE      TO ERROR-ACTL-INV-DTE.          05090036
RONNA      MOVE IN402-PV-EFF-DTE-IN     TO ERROR-IN402-PV-EFF-DTE-IN.   05100036
RONNA      MOVE IN402-PV-LOOKUP-TYPE-IN TO                              05110036
                                        ERROR-IN402-PV-LOOKUP-TYPE-IN.  05120036
RONNA      MOVE IN402-PV-LOC-IN-NUM     TO ERROR-IN402-PV-LOC-IN-NUM.   05130036
RONNA      MOVE IN402-PV-SKU-IN-NUM     TO ERROR-IN402-PV-SKU-IN-NUM.   05140036
RONNA      MOVE IN402-PV-ATT-SQLCDE     TO ERROR-IN402-PV-ATT-SQLCDE.   05150036
RONNA      MOVE IN402-PV-RETURN-RSN     TO ERROR-IN402-PV-RETURN-RSN.   05160036
                                                                        05170036
           WRITE OUT-LOOKUP-ERROR-RECORD                                05180036
                                     FROM ERROR-SHORTAGE-EXTR-REC.      05190036
                                                                        05200036
           ADD +1 TO PA-OUT-ERROR-COUNT.                                05210036
                                                                        05220036
       5010-WRITE-GOOD.                                                 05230036
                                                                        05240036
           MOVE IN034-GMA-NBR           TO IN014-GMA-NBR.               05250036
           MOVE IN034-BYR-NBR           TO IN014-BYR-NBR.               05260036
           MOVE IN034-BYR-NAME          TO IN014-BYR-NAME.              05270036
           MOVE IN034-DEPT-NBR          TO IN014-DEPT-NBR.              05280036
           MOVE IN034-DEPT-MDSEAR-DESC  TO IN014-DEPT-MDSEAR-DESC.      05290036
           MOVE IN034-MAJ-CL-NBR        TO IN014-MAJ-CL-NBR.            05300036
           MOVE IN034-SUB-CL-NBR        TO IN014-SUB-CL-NBR.            05310036
           MOVE PV-ML-LWST-ID           TO IN014-ML-LWST-ID.            05320036
           MOVE IN034-RPT-CL-NBR        TO IN014-RPT-CL-NBR.            05330036
           MOVE IN034-RPT-LVL           TO IN014-RPT-LVL.               05340036
           MOVE IN034-STR-NBR           TO IN014-STR-NBR.               05350036
           MOVE IN034-STR-NAME          TO IN014-STR-NAME.              05360036
           MOVE IN034-BOOK-INV-RTL-AMT  TO IN014-BOOK-INV-RTL-AMT.      05370036
           MOVE IN034-SLS-BSE-RTL-AMT   TO IN014-SLS-BSE-RTL-AMT.       05380036
           MOVE IN034-SHNK-RTL-AMT      TO IN014-SHNK-RTL-AMT.          05390036
           MOVE IN034-TOTAL-BOOK-RTL-AMT                                05400036
                                     TO IN014-TOTAL-BOOK-RTL-AMT        05410036
           MOVE IN034-PHY-INV-RTL-AMT   TO IN014-PHY-INV-RTL-AMT.       05420036
           MOVE IN034-SHORTAGE-RTL-AMT  TO IN014-SHORTAGE-RTL-AMT.      05430036
           MOVE IN034-ESTIMATED-INV-ADJ-AMT                             05440036
                                     TO IN014-ESTIMATED-INV-ADJ-AMT.    05450036
           MOVE IN034-DISTRICT-NMBR     TO IN014-DISTRICT-NMBR.         05460036
           MOVE IN034-REGION-NBR        TO IN014-REGION-NBR.            05470036
           MOVE IN034-TERRITORY-NBR     TO IN014-TERRITORY-NBR.         05480036
W33304     MOVE IN034-INV-ID            TO IN014-INV-ID.                        
W33304     MOVE IN034-FINCL-INV-STAT-CDE                                        
W33304                                  TO IN014-FINCL-INV-STAT-CDE.            
W33304     MOVE IN034-OPN-FSCL-MN-DTE   TO IN014-OPN-FSCL-MN-DTE.               
                                                                        05490036
           WRITE OUT-SHORTAGE-EXT-RECORD                                05500036
                                     FROM IN014-SHORTAGE-EXTR-REC.      05510036
                                                                        05520036
           ADD +1 TO PA-OUT-GOOD-COUNT.                                 05530036
                                                                        05540036
                                                                        05550036
       5100-SKIP-CHK.                                                   05560036
                                                                        05570036
           SET PS-WRITE-GOOD-YES        TO TRUE.                        05580036
           PERFORM                                                      05590036
               VARYING PT-SKIP-CLASS-INDX FROM 1 BY 1                   05600036
               UNTIL PT-SKIP-CLASS-INDX > PT-SKIP-CLASS-COUNT           05610036
                   OR PS-WRITE-BLOCKED-YES                              05620036
               IF PT-SKIP-DEPT-X(PT-SKIP-CLASS-INDX) = IN034-DEPT-NBR   05630036
                   AND (PT-SKIP-CLASS-X(PT-SKIP-CLASS-INDX) = ZEROS OR  05640036
                        PT-SKIP-CLASS-X(PT-SKIP-CLASS-INDX)             05650036
                            = IN034-SUB-CL-NBR)                         05660036
                   SET PS-WRITE-BLOCKED-YES TO TRUE                     05670036
               END-IF                                                   05680036
           END-PERFORM.                                                 05690036
                                                                        05700036
                                                                        05710036
       5125-WRITE-BLOCKED.                                              05720036
                                                                        05730036
           MOVE IN034-STR-NBR              TO PV-EDIT-STR-NBR.          05740036
           MOVE PV-EDIT-STR-NBR-R          TO ML123-STORE-NBR.          05750036
           MOVE IN034-SKU                  TO PV-EDIT-SKU.              05760036
           MOVE PV-EDIT-SKU                TO ML123-SKU.                05770036
           SET ML123-ADJ-CDE               TO TRUE.                     05780036
           MOVE ZEROS                      TO ML123-CST-AMT.            05790036
           MOVE IN034-PHY-INV-RTL-AMT      TO ML123-RTL-AMT.            05800036
           MOVE SPACES                     TO ML123-PO-NBR              05810036
                                              ML123-COSA-IND            05820036
                                              ML123-POS-IND.            05830036
           MOVE ML123-STORE-NBR(3:3)       TO ML123-BATCH-NBR.          05840036
           MOVE IN034-DEPT-NBR             TO ML123-DEPT-NBR.           05850036
           MOVE IN034-SUB-CL-NBR           TO ML123-CL-NBR.             05860036
           MOVE ZEROS                      TO PV-EDIT-MCL-1-2.          05870036
           MOVE IN034-MAJ-CL-NBR           TO PV-EDIT-MCL-3-4-X.        05880036
           MOVE PV-EDIT-MCL-NBR            TO ML123-MAJ-CL-NBR.         05890036
W33304     MOVE IN034-INV-ID               TO ML123-INV-ID.                     
W33304     MOVE IN034-OPN-FSCL-MN-DTE      TO ML123-OPN-FSCL-MN-DTE.            
                                                                        05900036
           WRITE BLOCKED-DEPT-CLASS-REC FROM ML123-RECORD.              05910036
                                                                        05920036
           ADD +1 TO PA-OUT-BLOCKED-COUNT.                              05930036
                                                                        05940036
                                                                        05950036
       5200-DEPT-INV-CHK.                                               05960036
                                                                        05970036
           SET PS-WRITE-GOOD-YES        TO TRUE.                        05980036
                                                                        05990036
           PERFORM 5205-DEPT-INV-FILTER-CHK.                            06000036
                                                                        06010036
           IF IN401-PV-RET-CODE-OK                                      06020036
               IF IN401-PS-QUALIFIES-YES                                06030036
                   CONTINUE                                             06040036
               ELSE                                                     06050036
                   SET PS-WRITE-INV-NA-YES TO TRUE                      06060036
               END-IF                                                   06070036
           END-IF.                                                      06080036
                                                                        06090036
                                                                        06100036
       5205-DEPT-INV-FILTER-CHK.                                        06110036
                                                                        06120036
           MOVE IN034-INV-ID              TO IN401-PV-LOOKUP-INV-ID.    06130036
           MOVE IN034-STR-NBR             TO IN401-PV-LOOKUP-LOC-NBR.   06140036
           MOVE ZEROS                     TO PV-EDIT-DEPT-NBR.          06150036
           MOVE IN034-DEPT-NBR            TO PV-EDIT-DEPT-2-4.          06160036
           MOVE PV-EDIT-DEPT-NBR          TO IN401-PV-LOOKUP-DEPT-NBR.  06170036
                                                                        06180036
                                                                        06183036
                                                                        06184036
                                                                        06185036
           PERFORM IN401-INV-DEPT-LOOKUP.                               06190036
                                                                        06200036
           IF IN401-PV-RET-CODE-OK                                      06210036
               CONTINUE                                                 06220036
           ELSE                                                         06230036
               MOVE +4013                 TO ABEND-CODE                 06240036
               DISPLAY '**  ABEND     ** '                              06250036
               DISPLAY '**  PROGRAM   **  =  INKUT266'                  06260036
               DISPLAY 'BAD RETURN FROM COMMON DEPT FILTER PROCESS '    06270036
               DISPLAY 'IN401-PV-RETURN-CDE ' IN401-PV-RETURN-CDE       06280036
               DISPLAY 'IN401-PV-SQLCDE  ' IN401-PV-SQLCDE              06290036
               DISPLAY 'IN401-PV-RETURN-RSN ' IN401-PV-RETURN-RSN       06300036
           DISPLAY 'IN401-PV-LOOKUP-DEPT-NBR ' IN401-PV-LOOKUP-DEPT-NBR 06301036
           DISPLAY 'IN034-DEPT-NBR           ' IN034-DEPT-NBR           06302036
           DISPLAY 'PA-INPUT-RECORD-COUNT    ' PA-INPUT-RECORD-COUNT    06303036
               PERFORM 9800-ABEND                                       06310036
           END-IF.                                                      06320036
                                                                        06330036
       5225-WRITE-INV-NA.                                               06340036
                                                                        06350036
           WRITE OUT-DEPT-INV-NA-RECORD FROM IN034-SHORTAGE-EXTR-REC.   06360036
                                                                        06370036
           ADD +1 TO PA-OUT-INV-NA-COUNT.                               06380036
                                                                        06390036
       8000-END-PROCESSING.                                             06400036
                                                                        06410036
           CLOSE IN-CONTROL-FILE                                        06420036
                 IN-SHORTAGE-EXT-FILE                                   06430036
                 SKIP-CLASS-FILE                                        06440036
W34517           IN-CONTROL-DTE-FILE                                            
                 OUT-SHORTAGE-EXT-FILE                                  06450036
                 BLOCKED-DEPT-CLASS-FILE                                06460036
                 OUT-DEPT-INV-NA-FILE                                   06470036
                 OUT-LOOKUP-ERROR-FILE.                                 06480036
                                                                        06490036
           DISPLAY '*** TOTAL NBR OF PHYS COUNT RECS READ  '            06500036
                PA-INPUT-RECORD-COUNT.                                  06510036
           DISPLAY '*** TOTAL NBR OF PHYS COUNT RECS WRITTEN '          06520036
                PA-OUT-GOOD-COUNT.                                      06530036
           DISPLAY '*** TOTAL NBR OF BLOCKED RECS WRITTEN '             06540036
                PA-OUT-BLOCKED-COUNT.                                   06550036
           DISPLAY '*** TOTAL NBR OF DEPT INV N/A RECS WRITTEN '        06560036
                PA-OUT-INV-NA-COUNT.                                    06570036
           DISPLAY '*** TOTAL NBR OF ERROR RECS WRITTEN '               06580036
                PA-OUT-ERROR-COUNT.                                     06590036
           DISPLAY ' '.                                                 06600036
                                                                        06610036
           IF PA-INPUT-RECORD-COUNT = (PA-OUT-GOOD-COUNT                06620036
                                    +  PA-OUT-BLOCKED-COUNT             06630036
                                    +  PA-OUT-INV-NA-COUNT              06640036
                                    +  PA-OUT-ERROR-COUNT)              06650036
                 DISPLAY ' JOB IN BALANCE '                             06660036
           ELSE                                                         06670036
                 DISPLAY ' JOB OUT OF BALANCE '.                        06680036
                                                                        06690036
           DISPLAY 'NUMBER OF BV COMMITS TAKEN ' PA-COMMIT-COUNT.       06700036
                                                                        06710036
      *                                                                 06720036
                                                                        06730036
W34517*************************************************************     06740036
W34517*    COPYBOOK FOR COMMON BEGINNING-OF-MONTH SNAPSHOT LOOKUP       06750036
W34517*************************************************************     06760036
RONNA      COPY BVPD101.                                                06770036
W34517                                                                  06780036
W34517                                                                  06790036
W34517                                                                  06800036
      *************************************************************     06740036
      *    COPYBOOK FOR COMMON PRICING PROCESS PROCEDURE                06750036
      *************************************************************     06760036
RONNA      COPY INPD402.                                                06770036
                                                                        06780036
                                                                        06790036
                                                                        06800036
      *************************************************************     06810036
      *    COPYBOOK FOR COMMON DEPARTMENT FILTER PROCEDURE              06820036
      *************************************************************     06830036
                                                                        06840036
           COPY INPD401.                                                06850036
                                                                        06860036
                                                                        06870036
       9800-ABEND.                                                      06880036
           CALL 'ILBOABN0'  USING ABEND-CODE.                           06890036
                                                                        06900036
                                                                        06910036
      ***************************************************************   06920036
      *    SQL ABEND PROCESSING                                     *   06930036
      ***************************************************************   06940036
       9900-SQL-ABEND.                                                  06950036
                                                                        06960036
           DISPLAY '** ABEND     **'.                                   06970036
           DISPLAY '** PROGRAM   = ' PC-PROGRAM-ID.                     06980036
           DISPLAY '** PARAGRAPH = ' PV-PARAGRAPH-NAME.                 06990036
           DISPLAY '** OPERATION = ' PV-DB2-OPER-ATTEMPTED.             07000036
                                                                        07010036
           COPY DPPD004.                                                07020036
                                                                        07030036
           CALL 'ILBOABN0'  USING ABEND-CODE.                           07040036
                                                                        07050036
