      *****************************************************************         
      *    INRD154 - DETAILED INV LEDGER UPDATE TRANSACTION                     
      *    LENGTH  - 130 BYTES                                                  
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PROGRAMMER   DESCRIPTION                             
      * ------- ---------- ------------ --------------------------              
      * WR33304 05-08-2008 K.PETERSON   HILO PROJECT - INITIAL IMPL             
      *****************************************************************         
       01  IN154-UPDATE-REC.                                                    
           05 IN154-FSCL-MN-NBR            PIC  X(2).                           
           05 IN154-FSCL-MN-END-DTE        PIC  X(10).                          
           05 IN154-FSCL-WK-NBR            PIC  X(2).                           
           05 IN154-FSCL-WK-END-DTE        PIC  X(10).                          
           05 IN154-DEPT-NBR               PIC  S9(4)V COMP-3.                  
           05 IN154-MAJ-CL-NBR             PIC  S9(4)V COMP-3.                  
           05 IN154-SUB-CL-NBR             PIC  S9(4)V COMP-3.                  
           05 IN154-LOC-NBR                PIC  S9(4) COMP.                     
           05 IN154-INV-ID                 PIC  S9(9) COMP VALUE ZERO.          
           05 IN154-IN-OPN-FSCL-MN-DTE     PIC X(10)   VALUE SPACES.            
           05 IN154-FINCL-INV-STAT-CDE     PIC X(02)   VALUE SPACES.            
           05 IN154-ML-LWST-ID             PIC  S9(9) COMP.                     
           05 IN154-SKU-NBR                PIC  S9(8)V COMP-3.                  
           05 IN154-FIN-LIAB-DTE           PIC X(10)   VALUE SPACES.            
           05 IN154-TRN-TYP-CDE            PIC X(02)   VALUE SPACES.            
               88 IN154-PURCH-PURCHASE                 VALUE '10'.              
               88 IN154-SALE                           VALUE '20'.              
               88 IN154-PURCH-TRANS-FRM-STORE          VALUE '30'.              
               88 IN154-PURCH-TRANS-TO-STORE           VALUE '31'.              
               88 IN154-PC-MARKDOWN                    VALUE '40'.              
               88 IN154-PC-MARKUP                      VALUE '50'.              
               88 IN154-INV-ADJ                        VALUE '80'.              
           05 IN154-SLS-REG-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 IN154-SLS-PROMO-RTL-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 IN154-SLS-PROCLR-RTL-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 IN154-SLS-CLR-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 IN154-SLS-OTH-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 FILLER                       PIC X(23)   VALUE SPACES.            
