      *****************************************************************         
      *    INRD136 - VARIANCE AUDIT RECORD                                      
W33304*    RECORD LENGTH - 100 BYTES                                            
      *****************************************************************         
      *                                                                         
       01  IN136-AUDIT-RECORD.                                                  
           05  IN136-UPC-ID                   PIC  X(15)  VALUE SPACES.         
           05  IN136-ITM-NBR                  PIC S9(15)V                       
                                                 COMP-3 VALUE ZERO.             
           05  IN136-BEG-WK-DTE               PIC  X(10)  VALUE SPACES.         
W26600*    05  IN136-STR-NBR                  PIC  X(03)  VALUE SPACES.         
W26600     05  IN136-STR-NBR                  PIC  X(05)  VALUE SPACES.         
W26600     05  IN136-STR-NBR-9 REDEFINES IN136-STR-NBR                          
W26600                                        PIC  9(05).                       
           05  IN136-STAT-CDE                 PIC  X(02)  VALUE SPACES.         
           05  IN136-UNT-CTOFF                PIC S9(09)                        
                                                 COMP-3 VALUE ZERO.             
W26600     05  IN136-UNTS-DECR                PIC S9(11)                        
                                                 COMP-3 VALUE ZERO.             
W26600     05  IN136-UNTS-INCR                PIC S9(11)                        
                                                 COMP-3 VALUE ZERO.             
24521      05  IN136-TRUE-CUTOFF-QTY          PIC S9(09)                        
24521                                            COMP-3 VALUE ZERO.             
24521      05  IN136-TRUE-UNTS-DECR           PIC S9(09)                        
24521                                            COMP-3 VALUE ZERO.             
24521      05  IN136-TRUE-UNTS-INCR           PIC S9(09)                        
24521                                            COMP-3 VALUE ZERO.             
W33304     05  IN136-INV-ID                   PIC S9(09) COMP                   
W33304                                                  VALUE ZERO.             
W33304     05  IN136-FINCL-INV-STAT-CDE       PIC X(02) VALUE SPACE.            
W33304     05  IN136-CYCLE-PLND-FIN-BKG-DTE   PIC X(10) VALUE SPACE.            
W33304     05  FILLER                         PIC X(12) VALUE SPACE.            
