00001  01  IN002I-STORE-SHORTAGE-REC.                                   01/05/94
W26600     05  IN002I-STORE-NUMB          PIC  9(05)     VALUE ZEROS.   INRD002I
00003      05  IN002I-DIVISION-NUMB       PIC  9(02)     VALUE ZEROS.      LV001
00004      05  IN002I-DEPARTMENT-NUMB     PIC  9(03)     VALUE ZEROS.   INRD002I
00005      05  IN002I-CLASS-NUMB          PIC  9(02)     VALUE ZEROS.   INRD002I
00006      05  IN002I-BUYER-NUMB          PIC  9(02)     VALUE ZEROS.   INRD002I
00007      05  IN002I-STORE-NAME          PIC  X(10)     VALUE SPACE.   INRD002I
00008      05  IN002I-DEPARTMENT-NAME     PIC  X(20)     VALUE SPACE.   INRD002I
00009      05  IN002I-FINANCE-CORP-NMBR   PIC  X(02)     VALUE SPACE.   INRD002I
W26600     05  IN002I-BOOK-INV            PIC S9(13)V99  VALUE ZEROS    INRD002I
00011                                                    COMP-3.        INRD002I
W26600     05  IN002I-SHRINK-ALLOWANCE    PIC S9(13)V99  VALUE ZEROS    INRD002I
00013                                                    COMP-3.        INRD002I
W26600     05  IN002I-TOTAL-RETAIL        PIC S9(13)V99  VALUE ZEROS    INRD002I
00015                                                    COMP-3.        INRD002I
W26600     05  IN002I-TOTAL-COST          PIC S9(13)V99  VALUE ZEROS    INRD002I
00017                                                    COMP-3.        INRD002I
W26600     05  IN002I-PHY-INV-RETAIL      PIC S9(13)V99  VALUE ZEROS    INRD002I
00019                                                    COMP-3.        INRD002I
W26600     05  IN002I-SHORT-RETAIL        PIC S9(13)V99  VALUE ZEROS    INRD002I
00021                                                    COMP-3.        INRD002I
W26600     05  IN002I-SHORT-COST          PIC S9(13)V99  VALUE ZEROS    INRD002I
00023                                                    COMP-3.        INRD002I
W26600     05  IN002I-TOTAL-SALES         PIC S9(13)V99  VALUE ZEROS    INRD002I
00025                                                    COMP-3.        INRD002I
00026      05  IN002I-SHRINK-PER          PIC S9(03)V99  VALUE ZEROS    INRD002I
00027                                                    COMP-3.        INRD002I
W26600     05  FILLER                     PIC X(07)      VALUE SPACE.           
