      ******************************************************************00010000
      *  INDR109 :  ADJ-PHY-INV-FILE COPYBOOK.  THIS FILE IS CREATED    00020001
      *             BY PROGRAM INKUT109.                                00030001
      *                                                                 00040001
      *  THIS COPYBOOK IS USED BY  1. INKRP102                          00050001
      *                            2. INKRP109                          00060001
      *                            3. INKRP111                          00070001
W21732*                            4. INKUT109                          00071001
24521 *                            5. INKRP286                          00072001
      *                                                                 00080001
      *CHANGE HISTORY:                                                  00090001
      * CHG ID/                                                         00100001
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                     00110001
      * -------  ----------  ----------------------------------------   00120001
24521 * 24521    04-25-2003  DAILY DETAIL STOCKROOM WITHDRAWAL & STORE  00121001
24521 *                      CORRECTIONS REPORT CREATION.               00121101
24521 *                      -ROD JANSSEN                               00122001
W26600* W26600  03-08-2004 ROD JANSSEN MERCH LEDGER STORE EXPANSION     00123004
W33304* W33304  05-12-2005 CHUCK EBERT HOLD INVENTORY LEDGER OPEN       00124006
      ******************************************************************00140000
      *                                                                 00150000
       01  IN109-PHY-IN-SUMMARY-RECORD.                                 00160000
W26600     05  IN109-STORE-NBR                   PIC  X(05).            00170004
           05  IN109-STORE-TYPE                  PIC  X(02).            00180000
           05  IN109-DEPT                        PIC  X(04).            00190000
           05  IN109-SKU                         PIC  9(08).            00200000
           05  IN109-TABLE-NAME                  PIC  X(06).            00210000
           05  IN109-ADJUST-TYPE-CODE            PIC  X(02).            00220000
           05  IN109-INV-QTY                     PIC  S9(15).           00230000
           05  IN109-EXTD-AMT                    PIC  S9(15)V99.        00240000
           05  IN109-UNIT-PR-AMT                 PIC  S9(05)V99.        00250000
24521      05  IN109-AREA-NBR                    PIC  S9(9) COMP.       00251002
24521      05  IN109-SHEET-NBR                   PIC  S9(9) COMP.       00252002
24521      05  IN109-CREATE-DATE                 PIC  X(10).            00253002
W33304     05  IN109-PLND-FIN-BK-DTE             PIC  X(10).            00260005
W33304     05  IN109-INV-ID                      PIC  S9(9) COMP.       00270005
W33304     05  IN109-FINCL-INV-STAT-CDE          PIC  X(02).            00280005
