      *    INRD143 - INVENTORY SKU RECLASS EXTRACT                              
      *    RECORD LENGTH - 56 BYTES                                             
      *                                                                         
       01  IN143-SKU-RECLASS-EXTRACT.                                           
          05  IN143-RECLASS-EFF-DATE      PIC  X(10)        VALUE SPACE.        
          05  IN143-SKU                   PIC  9(08)        VALUE ZERO.         
          05  IN143-OLD-ATTR-DATA.                                              
              10  IN143-OLD-DEPT          PIC S9(4)V COMP-3 VALUE ZERO.         
              10  IN143-OLD-MCL           PIC S9(4)V COMP-3 VALUE ZERO.         
              10  IN143-OLD-SCL           PIC S9(4)V COMP-3 VALUE ZERO.         
          05  IN143-NEW-ATTR-DATA.                                              
              10  IN143-NEW-DEPT          PIC S9(4)V COMP-3 VALUE ZERO.         
              10  IN143-NEW-MCL           PIC S9(4)V COMP-3 VALUE ZERO.         
              10  IN143-NEW-SCL           PIC S9(4)V COMP-3 VALUE ZERO.         
          05  FILLER                      PIC X(20)         VALUE SPACE.        
