      ******************************************************************        
      *  INRD028 - SHORTAGE EXTRACT FILE FOR THE DATA WAREHOUSE                 
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
24029 * 24029   10-14-2002 ROD JANSSEN SHORTAGE TO THE DATA WAREHOUSE           
24029 *                                PROJECT.                                 
W26600* W26600  04-05-2004 ROD JANSSEN INV LEDGER STORE EXPANSION               
W33304* W33304  06-05-2008 S JACKSON   HILO CHANGES                             
      ******************************************************************        
                                                                                
       01  IN028-SHORTAGE-EXTR-REC.                                             
W26600     05  IN028-STR-NBR                PIC X(05)      VALUE SPACES.        
           05  IN028-PSTG-MTH-BEG-DTE       PIC X(10)      VALUE SPACES.        
           05  IN028-DEPT-NBR               PIC X(03)      VALUE SPACES.        
           05  IN028-MAJ-CL-NBR             PIC X(02)      VALUE SPACES.        
           05  IN028-SUB-CL-NBR             PIC X(02)      VALUE SPACES.        
           05  IN028-SCAN-IND               PIC X(01)      VALUE SPACE.         
W26600     05  IN028-BOOK-INV-RTL-AMT       PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN028-SLS-BSE-RTL-AMT        PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN028-SHNK-RTL-AMT           PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN028-PHY-INV-RTL-AMT        PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN028-ESTIMATED-INV-ADJ-AMT  PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN028-SHORTAGE-RTL-AMT       PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W33304     05  IN028-INV-ID                 PIC S9(9)      COMP.                
W33304     05  IN028-INV-SRVC-ENT-ID        PIC 9(9) USAGE COMP.                
W33304     05  FILLER                       PIC X(1).                           
