      ******************************************************************        
      *  INRD138 - VARIANCE DATA FOR THE DATA WAREHOUSE                         
W33304*  RECORD LENGTH - 100 BYTES                                              
      *                                                                         
      * CHANGE HISTORY:                                                         
      * WR#     DATE       PGMR          DESCRIPTION OF CHANGES                 
      * ------- ---------- -----------   -------------------------------        
      * W33304  08-14-2008 K. PETERSON   HILO PROJECT - NEW COPYBOOK            
      ******************************************************************        
       01  IN138-VARIANCE-SUMM-RECORD.                                          
           05  IN138-PROD-DIM-KEY.                                              
               10  IN138-UPC-ID               PIC X(15)   VALUE ZERO.           
               10  IN138-ITM-NBR              PIC S9(15)V COMP-3                
                                                          VALUE ZERO.           
           05  IN138-BEG-WK-DTE               PIC X(10)   VALUE SPACES.         
           05  IN138-STR-NBR                  PIC S9(05)  COMP-3                
                                                          VALUE ZERO.           
           05  IN138-STAT-CDE                 PIC X(02)   VALUE SPACES.         
           05  IN138-UNT-CTOFF                PIC S9(11)  COMP-3                
                                                          VALUE ZERO.           
           05  IN138-UNTS-DECR                PIC S9(11)  COMP-3                
                                                          VALUE ZERO.           
           05  IN138-UNTS-INCR                PIC S9(11)  COMP-3                
                                                          VALUE ZERO.           
           05  IN138-TRUE-CUTOFF-QTY          PIC S9(11)  COMP-3                
                                                          VALUE ZERO.           
           05  IN138-TRUE-UNTS-DECR           PIC S9(11)  COMP-3                
                                                          VALUE ZERO.           
           05  IN138-TRUE-UNTS-INCR           PIC S9(11)  COMP-3                
                                                          VALUE ZERO.           
           05  IN138-INV-ID                   PIC S9(09)  COMP.                 
           05  IN138-INV-SRVC-ENT-ID          PIC S9(09)  COMP.                 
           05  FILLER                         PIC X(18)   VALUE SPACES.         
