      *****************************************************************         
      *  INRD139 - EXTRACT LAYOUT FOR CUTOFF DATABASE (INT_INV_CTOFF) *         
      *****************************************************************         
       01  INRD139-CUTOFF-REC.                                                  
           05  IN139-LOC-NBR             PIC S9(04)  COMP   VALUE ZERO.         
           05  IN139-SKU                 PIC S9(08)V COMP-3 VALUE ZERO.         
           05  IN139-CTOFF-OH-QTY        PIC S9(09)  COMP   VALUE ZERO.         
           05  IN139-IN-TRNST-CTOFF-QTY  PIC S9(09)  COMP   VALUE ZERO.         
           05  IN139-POST-FSH-RCPT-QTY   PIC S9(09)  COMP   VALUE ZERO.         
           05  IN139-STR-EXPTED-CTOFF-QTY PIC S9(09) COMP   VALUE ZERO.         
