W26600*                                                                         
W26600*                                                                         
W26600*                                                                         
00001  01  IN003I-STORE-SHORTAGE-REC.                                   12/23/93
W26600     05  IN003I-STORE-NUMB          PIC  9(05)     VALUE ZERO.    INRD003I
00003      05  IN003I-DIVISION-NUMB       PIC  9(02)     VALUE ZERO.       LV001
00004      05  IN003I-DEPARTMENT-NUMB     PIC  9(03)     VALUE ZERO.    INRD003I
00005      05  IN003I-CLASS-NUMB          PIC  9(02)     VALUE ZERO.    INRD003I
00006      05  IN003I-BUYER-NUMB          PIC  9(02)     VALUE ZERO.    INRD003I
00007      05  IN003I-STORE-NAME          PIC  X(10)     VALUE SPACES.  INRD003I
00008      05  IN003I-DEPARTMENT-NAME     PIC  X(20)     VALUE SPACES.  INRD003I
00009      05  IN003I-FINANCE-CORP-NMBR   PIC  X(02)     VALUE SPACES.  INRD003I
W26600     05  IN003I-BOOK-INV            PIC S9(13)V99  COMP-3         INRD003I
00011                                                    VALUE ZERO.    INRD003I
W26600     05  IN003I-SHRINK-ALLOWANCE    PIC S9(13)V99  COMP-3         INRD003I
00013                                                    VALUE ZERO.    INRD003I
W26600     05  IN003I-TOTAL-RETAIL        PIC S9(13)V99  COMP-3         INRD003I
00015                                                    VALUE ZERO.    INRD003I
W26600     05  IN003I-TOTAL-COST          PIC S9(13)V99  COMP-3         INRD003I
00017                                                    VALUE ZERO.    INRD003I
W26600     05  IN003I-PHY-INV-RETAIL      PIC S9(13)V99  COMP-3         INRD003I
00019                                                    VALUE ZERO.    INRD003I
W26600     05  IN003I-SHORT-RETAIL        PIC S9(13)V99  COMP-3         INRD003I
00021                                                    VALUE ZERO.    INRD003I
W26600     05  IN003I-SHORT-COST          PIC S9(13)V99  COMP-3         INRD003I
00023                                                    VALUE ZERO.    INRD003I
W26600     05  IN003I-TOTAL-SALES         PIC S9(13)V99  COMP-3         INRD003I
00025                                                    VALUE ZERO.    INRD003I
W33304     05  IN003I-OPN-FSCL-MN-DTE     PIC X(10)      VALUE SPACES.          
W33304     05  IN003I-INV-ID              PIC S9(9) COMP VALUE ZERO.            
W33304     05  IN003I-FINCL-INV-STAT-CDE  PIC X(02)      VALUE SPACES.          
