      *    INRD144 - INVENTORY SKU RECLASS REPORT EXTRACT                       
      *    RECORD LENGTH - 131 BYTES                                            
      *                                                                         
       01  IN144-SKU-RECLASS-EXTRACT.                                           
          05  IN144-INV-DATE              PIC  X(10)        VALUE SPACE.        
          05  IN144-LOC-NBR               PIC  9(4)         VALUE ZERO.         
          05  IN144-AREA-NUMBER           PIC  9(9)         VALUE ZERO.         
          05  IN144-SKU                   PIC  9(8)         VALUE ZERO.         
          05  IN144-UPC                   PIC  9(15)        VALUE ZERO.         
          05  IN144-UNIT-RETAIL           PIC  S9(5)V9(2) COMP-3                
                                                            VALUE ZERO.         
          05  IN144-QUANTITY              PIC  S9(9)        VALUE ZERO.         
          05  IN144-OLD-ATTR-DATA.                                              
              10  IN144-OLD-DEPT          PIC  9(4)         VALUE ZERO.         
              10  IN144-OLD-MCL           PIC  9(4)         VALUE ZERO.         
              10  IN144-OLD-SCL           PIC  9(4)         VALUE ZERO.         
          05  IN144-NEW-ATTR-DATA.                                              
              10  IN144-NEW-DEPT          PIC  9(4)         VALUE ZERO.         
              10  IN144-NEW-MCL           PIC  9(4)         VALUE ZERO.         
              10  IN144-NEW-SCL           PIC  9(4)         VALUE ZERO.         
          05  IN144-EXTD-AMT              PIC S9(9)V9(2)    COMP-3              
                                                            VALUE ZERO.         
          05  IN144-LOC-NM                PIC X(40)         VALUE SPACE.        
          05  IN144-REPORT-IND            PIC X             VALUE SPACE.        
              88  IN144-STORE-DEPT-FROM-DETAIL              VALUE '1'.          
              88  IN144-STORE-DEPT-TO-DETAIL                VALUE '2'.          
              88  IN144-STORE-DEPT-FROM-SUMMARY             VALUE '3'.          
              88  IN144-STORE-DEPT-TO-SUMMARY               VALUE '4'.          
              88  IN144-DEPT-STORE-SUMMARY                  VALUE '5'.          
              88  IN144-DEPT-SUMMARY-ALL-STORES             VALUE '6'.          
          05  IN144-REPORT-IND-R REDEFINES IN144-REPORT-IND PIC 9.              
          05  IN144-LATE-RECLS-IND        PIC X             VALUE ' '.          
              88  IN144-LATE-RECLS                          VALUE '*'.          
