      ******************************************************************        
      *  INRD023 - SALES BASE CUM FILE.                                         
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
W26600* W26600  04-05-2004 ROD JANSSEN INV LEDGER STORE EXPANSION               
W20445* W20445  09-01-2004 ROD JANSSEN DETAILED INVNENTORY ADJUSTMENT           
W?????* W?????  12-20-2005 C. SCHWENN  VENDOR/BRAND CHANGE ENT-ID TO            
W?????* W?????                         ML-LWST-ID.                              
      ******************************************************************        
       01  IN023-SALES-BASE-CUM-REC.                                            
           05  IN023-DEPT-NBR               PIC X(03)      VALUE SPACE.         
           05  IN023-SUB-CL-NBR             PIC X(02)      VALUE SPACE.         
W20445     05  IN023-ML-LWST-ID             PIC S9(9)      COMP                 
W20445                                                     VALUE ZERO.          
           05  IN023-STR-NBR                PIC S9(4)      COMP                 
                                                           VALUE ZERO.          
W26600     05  IN023-OPN-SLS-RTL-AMT        PIC S9(11)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN023-OPN-SHNK-RTL-AMT       PIC S9(11)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN023-CUM-SLS-RTL-AMT        PIC S9(11)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN023-CUM-SHNK-RTL-AMT       PIC S9(11)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN023-NXT-SLS-RTL-AMT        PIC S9(11)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN023-NXT-SHNK-RTL-AMT       PIC S9(11)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN023-ESTIMATED-INV-ADJ-AMT  PIC S9(11)V99  COMP-3               
0400RM                                                     VALUE ZERO.          
W20445     05  FILLER                       PIC X(20)      VALUE SPACE.         
