      *    INRD145 - INVENTORY SKU RECLASS COMBO EXTRACT                        
      *    RECORD LENGTH - 119 BYTES                                            
      *                                                                         
       01  IN145-SKU-RECLASS-COMBO.                                             
          05  IN145-INV-DATE              PIC  X(10)        VALUE SPACE.        
          05  IN145-LOC-NBR               PIC  9(4)         VALUE ZERO.         
          05  IN145-AREA-NUMBER           PIC  9(9)         VALUE ZERO.         
          05  IN145-SKU                   PIC  9(8)         VALUE ZERO.         
          05  IN145-UPC                   PIC  9(15)        VALUE ZERO.         
          05  IN145-UNIT-RETAIL           PIC  S9(5)V9(2) COMP-3                
                                                            VALUE ZERO.         
          05  IN145-QUANTITY              PIC  S9(9)        VALUE ZERO.         
          05  IN145-ATTR-DATA.                                                  
              10  IN145-DEPT              PIC  9(4)         VALUE ZERO.         
              10  IN145-MCL               PIC  9(4)         VALUE ZERO.         
              10  IN145-SCL               PIC  9(4)         VALUE ZERO.         
          05  IN145-EXTD-AMT              PIC S9(9)V9(2)    COMP-3              
                                                            VALUE ZERO.         
          05  IN145-LOC-NM                PIC X(40)         VALUE SPACE.        
          05  IN145-REPORT-IND            PIC X             VALUE SPACE.        
              88  IN145-STORE-DEPT-FROM-DETAIL              VALUE '1'.          
              88  IN145-STORE-DEPT-TO-DETAIL                VALUE '2'.          
              88  IN145-STORE-DEPT-FROM-SUMMARY             VALUE '3'.          
              88  IN145-STORE-DEPT-TO-SUMMARY               VALUE '4'.          
              88  IN145-DEPT-STORE-SUMMARY                  VALUE '5'.          
              88  IN145-DEPT-SUMMARY-ALL-STORES             VALUE '6'.          
          05  IN145-REPORT-IND-R REDEFINES IN145-REPORT-IND PIC 9.              
          05  IN145-LATE-RECLS-IND        PIC X             VALUE ' '.          
              88  IN145-LATE-RECLS                          VALUE '*'.          
