      ******************************************************************        
      *  INRD237 - EXTRACT LAYOUT FOR STORE-EXPECTED FILE WITH HILO INFO        
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
      * W33304  11-19-2008 D. THEEL    CLONE OF PARTS OF INRD137 FOR            
      *                                HILO ADDING ADDITIONAL HILO              
      *                                INFORMATION                              
      **************************************************************            
       01  IN237-STR-EXPTED-RECORD.                                             
           05  IN237-INV-ID                PIC S9(9)    VALUE ZEROES            
                                                        COMP.                   
           05  IN237-IN-OPN-FSCL-MN-DTE    PIC X(10)    VALUE SPACES.           
           05  IN237-IN-OPN-FSCL-MN-NBR    PIC X(02)    VALUE SPACES.           
           05  IN237-FINCL-INV-STAT-CDE    PIC X(02)    VALUE SPACES.           
           05  IN237-STORE-NBR-9           PIC 9(05)    VALUE ZEROES.           
           05  IN237-ADJ-DATE              PIC X(10)    VALUE SPACES.           
           05  IN237-ADJ-QTY               PIC S9(9)    VALUE ZEROES            
                                                        COMP.                   
           05  IN237-EXTD-RTL-AMT          PIC S9(13)V9(2) VALUE ZEROES         
                                                        COMP-3.                 
           05  FILLER                      PIC X(30)    VALUE SPACES.           
