000010******************************************************************00001002
000020*  INRD010 - SHORTAGE EXTRACT FILE WITH ADDITIONAL DETAILS        00002002
000030*                                                                 00003002
000040*CHANGE HISTORY:                                                  00004002
000050* WR/PROJ DATE       MODIFIED    DESCRIPTION OF CHANGES           00005003
000060* ------- ---------- ----------- -------------------------------- 00006002
000070* W34259  10-24-2013 COGNIZANT   INITIAL IMPLEMENTATION           00007002
000071*                                                                 00007102
000072******************************************************************00007202
000100 01  IN010-STORE-SHORTAGE-REC.                                    00010000
000200     05  IN010-STORE-NUMB           PIC  9(05)     VALUE ZERO.    00020001
000300     05  IN010-DIVISION-NUMB        PIC  9(02)     VALUE ZERO.    00030001
000400     05  IN010-DEPARTMENT-NUMB      PIC  9(03)     VALUE ZERO.    00040001
000500     05  IN010-CLASS-NUMB           PIC  9(02)     VALUE ZERO.    00050001
000600     05  IN010-BUYER-NUMB           PIC  9(02)     VALUE ZERO.    00060001
000700     05  IN010-STORE-NAME           PIC  X(10)     VALUE SPACES.  00070001
000800     05  IN010-DEPARTMENT-NAME      PIC  X(20)     VALUE SPACES.  00080001
000900     05  IN010-FINANCE-CORP-NMBR    PIC  X(02)     VALUE SPACES.  00090001
001000     05  IN010-BOOK-INV             PIC S9(13)V99  COMP-3         00100001
001100                                                   VALUE ZERO.    00110001
001200     05  IN010-SHRINK-ALLOWANCE     PIC S9(13)V99  COMP-3         00120001
001300                                                   VALUE ZERO.    00130001
001400     05  IN010-TOTAL-RETAIL         PIC S9(13)V99  COMP-3         00140001
001500                                                   VALUE ZERO.    00150001
001600     05  IN010-TOTAL-COST           PIC S9(13)V99  COMP-3         00160001
001700                                                   VALUE ZERO.    00170001
001800     05  IN010-PHY-INV-RETAIL       PIC S9(13)V99  COMP-3         00180001
001900                                                   VALUE ZERO.    00190001
002000     05  IN010-SHORT-RETAIL         PIC S9(13)V99  COMP-3         00200001
002100                                                   VALUE ZERO.    00210001
002200     05  IN010-SHORT-COST           PIC S9(13)V99  COMP-3         00220001
002300                                                   VALUE ZERO.    00230001
002400     05  IN010-TOTAL-SALES          PIC S9(13)V99  COMP-3         00240001
002500                                                   VALUE ZERO.    00250001
002600     05  IN010-OPN-FSCL-MN-DTE      PIC X(10)      VALUE SPACES.  00260001
002700     05  IN010-INV-ID               PIC S9(9) COMP VALUE ZERO.    00270001
002800     05  IN010-FINCL-INV-STAT-CDE   PIC X(02)      VALUE SPACES.  00280001
002900     05  IN010-GMM-NUMBER           PIC X(02)      VALUE SPACES.  00290001
003000     05  IN010-DMM-NUMBER           PIC X(02)      VALUE SPACES.  00300001
003100     05  IN010-CLASS-DESCRIPTION    PIC X(25)      VALUE SPACES.  00310001
