      *****************************************************************         
      *    INRD024 - INVENTORY EXCEPTIONS BY STORE EXTRACT                      
      *    RECORD LENGTH - 100 BYTES                                       LV001
      *                                                                    CL*28
      *CHANGE HISTORY:                                                          
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                             
      * -------  ----------  ----------------------------------------           
W21591* W21591   05-01-2001  MANIFESTING                                        
W21591*                      -RONNA BUTZ                                        
W22055* W22055   05-31-2001  PHYS INV TOP EXCEPTION RPT ENHANCEMENT             
W22055*                      -ROD JANSSEN                                       
W21732* W21732   02-03-2003  NI-SKU CONVERSION.                                 
W21732*                      -SUDHARSHAN ADDURI,IGSI.                           
24521 * 24521    04-01-2003  CUMM ACTIVE SKU NOT INVENTORIED REPORT.            
24521 *                      (CREATION) -ROD JANSSEN                            
W26600* W26600   07-26-2004  STR NBR EXPAND & EXCEPT REWRITE.INCLUDES A         
W26600*                      A RESTRUCTURING OF COPYBOOK AND REMOVAL OF         
W26600*                      ALL MBS DATA. DEFINE SEPARATE WORKING AREA         
W26600*                      FOR PHYSICAL DATA AND NEW CTOFF DB DATA            
W26600*                      -SCOTT JACKSON                                     
W27808* W27808   03-31-2005  NEW MANIFESTING PROJECT                            
W34894* W34894   06-02-2008  ADD INTR-UPC-ID FOR PROGRAM INKUT013 USE.          
W34894*                      -PAUL KEBER                                        
SR3403* SR3403   03-26-2012  LARGE RETAIL PROJECT                               
SR3403*                      -ANUJ GUPTA                                        
      *****************************************************************         
       01  IN024-INV-EXCEPTS-STR-REC.                                   INRD024 
W26600     05  IN024-STORE-NUMBER          PIC  9(04)     VALUE ZERO.   INRD024 
W26600     05  IN024-STORE-NUMBER-X REDEFINES                           INRD024 
W26600         IN024-STORE-NUMBER          PIC  X(04).                  INRD024 
W21732     05  IN024-SKU                   PIC  9(08)     VALUE ZERO.   INRD024 
W26600     05  IN024-PHYSICAL-DATA.                                     INRD024 
               10  IN024-AREA-NUMBER       PIC  9(06)     VALUE ZERO.   INRD024 
               10  IN024-QUANTITY          PIC  9(09)     VALUE ZERO.   INRD024 
SR3403         10  IN024-PRICE             PIC  9(05)V99  VALUE ZERO.   INRD024 
W26600         10  IN024-SKU-STR-TOT-EXTD  PIC S9(11)V99  VALUE +0 COMP.        
W26600     05  IN024-CTOFF-DATA.                                        INRD024 
               10  IN024-INV-CUTOFF-OH-QTY PIC S9(09)     VALUE +0 COMP.INRD024 
               10  IN024-POST-FL-AFT-REC   PIC S9(09)     VALUE +0 COMP.INRD024 
               10  IN024-CUTOFF-INTRANSIT  PIC S9(09)     VALUE +0 COMP.INRD024 
W27808         10  IN024-CUTOFF-STR-EXPECT PIC S9(09)     VALUE +0 COMP.INRD024 
SR3403     05  IN024-SYSTEM-PRICE          PIC S9(05)V99  VALUE ZERO.   INRD024 
W26600     05  IN024-SOURCE-FOUND-FLAG     PIC S9(02)     COMP-3        INRD024 
                                                          VALUE +00.            
               88  IN024-PHYSICAL-ONLY                    VALUE +01.            
               88  IN024-CTOFF-DB-ONLY                    VALUE +02.            
               88  IN024-FOUND-IN-BOTH                    VALUE +03.            
W26600     05  IN024-VARIANCE-QTY          PIC S9(09)     VALUE +0 COMP.        
           05  IN024-VARIANCE-PRICE        PIC S9(07)V99  VALUE +0 COMP.        
W26600     05  IN024-ABSOLUTE-VAR-QTY      PIC S9(09)     VALUE +0 COMP.        
W26600     05  IN024-ABSOLUTE-VAR-PRICE    PIC S9(07)V99  VALUE +0 COMP.        
W21732     05  IN024-SKU-ATTRIBUTES.                                            
W21732         10  IN024-DEPT-CLASS.                                            
W21732             15  IN024-DEPT          PIC  9(04)     VALUE ZERO.   INRD024 
W21732             15  IN024-CLASS         PIC  9(04)     VALUE ZERO.   INRD024 
W21732         10  IN024-SUB-CLASS         PIC  9(04)     VALUE ZERO.   INRD024 
24521      05  IN024-MFSTNG-IND            PIC  X(01)     VALUE SPACE.  INRD024 
W34894     05  IN024-INTR-UPC-ID           PIC S9(09)     VALUE +0 COMP.        
SR3403*    05  FILLER                      PIC  X(02)     VALUE SPACES. INRD024 
