      ***************************************************************           
      *   INRD182 - PHYSICAL INVENTORY SHORTAGE LOAD FILE                       
      *   RECORD LENGTH = 146 BYTES                                             
      ***************************************************************           
       01  IN182-SHORTAGE-RECORD.                                               
           05  IN182-DEPT-NBR                PIC X(03).                         
           05  IN182-MAJ-CL-NBR              PIC X(02).                         
           05  IN182-SUB-CL-NBR              PIC X(02).                         
           05  IN182-TM-DIM-KY-DTE           PIC X(10).                         
           05  IN182-PHY-SITE-HIST-ID        PIC +9(5).                         
           05  IN182-ENT-ID                  PIC +9(9).                         
           05  IN182-INV-CYC-ID              PIC +9(9).                         
           05  IN182-ACTL-PHY-INV-IND        PIC X(01).                         
           05  IN182-BK-INV-RTL-AMT          PIC +9(13).9(2).                   
           05  IN182-BSE-SLS-RTL-AMT         PIC +9(13).9(2).                   
           05  IN182-INV-SHNKG-AMT           PIC +9(13).9(2).                   
           05  IN182-PHY-INV-RTL-AMT         PIC +9(13).9(2).                   
           05  IN182-EST-INV-ADJ-AMT         PIC +9(13).9(2).                   
           05  IN182-SHTG-RTL-AMT            PIC +9(13).9(2).                   
