00001  01  IN003O-STORE-SHORTAGE-REC.                                   12/23/93
W26600     05  IN003O-STORE-NUMB          PIC  9(05)     VALUE ZERO.    INRD003O
00003      05  IN003O-DIVISION-NUMB       PIC  9(02)     VALUE ZERO.       LV001
00004      05  IN003O-DEPARTMENT-NUMB     PIC  9(03)     VALUE ZERO.    INRD003O
00005      05  IN003O-CLASS-NUMB          PIC  9(02)     VALUE ZERO.    INRD003O
00006      05  IN003O-BUYER-NUMB          PIC  9(02)     VALUE ZERO.    INRD003O
00007      05  IN003O-STORE-NAME          PIC  X(10)     VALUE SPACES.  INRD003O
00008      05  IN003O-DEPARTMENT-NAME     PIC  X(20)     VALUE SPACES.  INRD003O
00009      05  IN003O-FINANCE-CORP-NMBR   PIC  X(02)     VALUE SPACES.  INRD003O
W26600     05  IN003O-BOOK-INV            PIC S9(13)V99  COMP-3         INRD003O
00011                                                    VALUE ZERO.    INRD003O
W26600     05  IN003O-SHRINK-ALLOWANCE    PIC S9(13)V99  COMP-3         INRD003O
00013                                                    VALUE ZERO.    INRD003O
W26600     05  IN003O-TOTAL-RETAIL        PIC S9(13)V99  COMP-3         INRD003O
00015                                                    VALUE ZERO.    INRD003O
W26600     05  IN003O-TOTAL-COST          PIC S9(13)V99  COMP-3         INRD003O
00017                                                    VALUE ZERO.    INRD003O
W26600     05  IN003O-PHY-INV-RETAIL      PIC S9(13)V99  COMP-3         INRD003O
00019                                                    VALUE ZERO.    INRD003O
W26600     05  IN003O-SHORT-RETAIL        PIC S9(13)V99  COMP-3         INRD003O
00021                                                    VALUE ZERO.    INRD003O
W26600     05  IN003O-SHORT-COST          PIC S9(13)V99  COMP-3         INRD003O
00023                                                    VALUE ZERO.    INRD003O
W26600     05  IN003O-TOTAL-SALES         PIC S9(13)V99  COMP-3         INRD003O
00025                                                    VALUE ZERO.    INRD003O
W33304     05  IN003O-OPN-FSCL-MN-DTE     PIC X(10)      VALUE SPACES.          
W33304     05  IN003O-INV-ID              PIC S9(9) COMP VALUE ZERO.            
W33304     05  IN003O-FINCL-INV-STAT-CDE  PIC X(02)      VALUE SPACES.          
00009      05  IN003O-PRIME-DC            PIC  X(02)     VALUE SPACES.  INRD003O
