      *****************************************************************         
      *    INRD035 - INV LEDGER EDIT SPLIT RPT RECORD LAYOUT.                   
      *    RECORD LENGTH - 110 BYTES                                            
      *                                                                         
      *    INRD035 IS THE LAYOUT FOR THE EDIT/SPLIT REPORT.                     
      *    TO ASSURE THAT SORTS MAY BE DONE, EACH RECORD HAS                    
      *    A ONE BYTE SORT KEY FIELD (C=CNTL CARD, D=DETAIL)                    
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR         DESCRIPTION OF CHANGES                  
      * ------- ---------- ----------- --------------------------------         
      * WR33304 05-12-2008 K.PETERSON   HILO PROJECT - INITIAL IMPL             
      *****************************************************************         
                                                                                
       01  IN035-RPT1-RECORD.                                                   
           05  FILLER                       PIC  X(01)    VALUE 'C'.            
               88  IN035-RPT1-CNTL-CARD-HDR-REC           VALUE 'C'.            
               88  IN035-RPT1-DETAIL-REC                  VALUE 'D'.            
           05  FILLER                       PIC  X(109)   VALUE SPACES.         
                                                                                
       01  IN035-RPT1-CNTL-CARD-RECORD      REDEFINES                           
           IN035-RPT1-RECORD.                                                   
           05  FILLER                       PIC  X(01).                         
           05  IN035-RPT1-CURR-FSCL-YR-PER.                                     
               10  IN035-RPT1-CURR-FSCL-YR-CDE                                  
                                            PIC  X(04).                         
               10  IN035-RPT1-CURR-FSCL-PER-CDE                                 
                                            PIC  X(02).                         
           05  IN035-RPT1-NEXT-FSCL-YR-PER.                                     
               10  IN035-RPT1-NEXT-FSCL-YR-CDE                                  
                                            PIC  X(04).                         
               10  IN035-RPT1-NEXT-FSCL-PER-CDE                                 
                                            PIC  X(02).                         
           05  IN035-RPT1-EDIT-DTE          PIC  X(10).                         
           05  IN035-RPT1-PROCESSING-MODE   PIC X(04).                          
               88  IN035-RPT1-MODE-ML          VALUE 'ML' 'BOTH'.               
               88  IN035-RPT1-MODE-ML-ONLY     VALUE 'ML'.                      
               88  IN035-RPT1-MODE-INV         VALUE 'INV' 'BOTH'.              
               88  IN035-RPT1-MODE-INV-ONLY    VALUE 'INV'.                     
           05  FILLER                       PIC  X(83).                         
                                                                                
       01  IN035-RPT1-DETAIL-RECORD         REDEFINES                           
           IN035-RPT1-RECORD.                                                   
           05  FILLER                       PIC  X(01).                         
           05  IN035-RPT1-STORE-NBR         PIC  X(05).                         
           05  IN035-RPT1-TRANS-CDE         PIC  X(02).                         
               88  IN035-RPT1-PURCHASE                    VALUE '10'.           
               88  IN035-RPT1-SALE                        VALUE '20'.           
               88  IN035-RPT1-TRANSFER-FROM-STORE         VALUE '30'.           
               88  IN035-RPT1-TRANSFER-TO-STORE           VALUE '31'.           
               88  IN035-RPT1-MARKDOWN                    VALUE '40'.           
               88  IN035-RPT1-MARKUP                      VALUE '50'.           
               88  IN035-RPT1-ADJUSTMENT                  VALUE '80'.           
           05  IN035-RPT1-FIN-LIAB-DTE      PIC  X(10).                         
           05  IN035-RPT1-FSCL-YR-PER.                                          
               10  IN035-RPT1-FSCL-YR-CDE   PIC  X(04).                         
               10  IN035-RPT1-FSCL-PER-CDE  PIC  X(02).                         
           05  IN035-RPT1-SKU               PIC  X(08).                         
           05  IN035-RPT1-EXTD-RTL-AMT      PIC S9(11)V99 COMP-3.               
           05  IN035-RPT1-EXTD-COST-AMT     PIC S9(11)V99 COMP-3.               
           05  FILLER                       PIC X(04).                          
           05  IN035-RPT1-ML-IND            PIC  X.                             
               88  IN035-RPT1-INCLUDE-IN-ML               VALUE 'Y'.            
               88  IN035-RPT1-DONT-INCLUDE-IN-ML          VALUE 'N'.            
           05  IN035-RPT1-INV-IND           PIC  X.                             
               88  IN035-RPT1-INCLUDE-IN-INV              VALUE 'Y'.            
               88  IN035-RPT1-DONT-INCLUDE-IN-INV         VALUE 'N'.            
           05  IN035-RPT1-DOC-5-NBRX.                                           
               15  IN035-RPT1-DOC-5-NBR     PIC  9(5).                          
           05  IN035-RPT1-BATCH-NBR         PIC  X(4).                          
      *            TRANSERS  - DOCUMENT NUMBER                                  
           05  IN035-RPT1-XFER-DOC-NBR.                                         
               10  IN035-RPT1-XFER-DOC-STORE    PIC  9(05).                     
               10  IN035-RPT1-XFER-DOC-SEQ      PIC  9(06).                     
           05  IN035-RPT1-SYST-ORIG-CDE     PIC X(02).                          
               88  IN035-PURCH-RECEIPT                VALUE '08'.               
           05  IN035-RPT1-DEPT-CLASS.                                           
               10  IN035-RPT1-DEPT-NBR      PIC  9(03).                         
               10  IN035-RPT1-CLASS-NBR     PIC  9(02).                         
           05  IN035-INV-ID                 PIC  S9(9) COMP.                    
           05  IN035-IN-OPN-FSCL-MN-DTE     PIC X(10).                          
           05  IN035-FINCL-INV-STAT-CDE     PIC X(02).                          
           05  IN035-RPT1-INV-FSCL-PER-CDE  PIC X(02).                          
           05  FILLER                       PIC X(13).                          
