      *****************************************************************         
      *    INRD019 - TIME TIMESTAMP RECORD/ SALE ADJUSTMENT RECORD    *         
      *              ALSO INCLUDES THE SALES ADJ/TTL SALES TTL REC    *         
W21732*              8 DIGIT SKU,AREA ALL EQUAL 9'S ON TTL REC        *         
      *****************************************************************         
      *                                                                         
       01  IN019-ITEM-REC.                                                      
           03  IN019-TIMESTMP-DETAIL.                                           
               05  IN019-TIMESTMP-KEY.                                          
W26600            10  IN019-STR-NBR          PIC S9(4) COMP VALUE ZERO.         
W21732            10  IN019-SKU              PIC X(08) VALUE SPACE.             
               05  IN019-ACTL-INV-DTE             PIC 9(06) VALUE ZERO.         
               05  IN019-SCAN-AREA                PIC 9(06) VALUE ZERO.         
               05  IN019-SCAN-DTE                 PIC 9(04)                     
                                                        COMP-3 VALUE 0.         
               05  IN019-SCAN-TIMESTAMP           PIC 9(06)                     
                                                        COMP-3 VALUE 0.         
               05  IN019-TTL-PHY-COUNT            PIC 9(06)                     
                                                        COMP-3 VALUE 0.         
               05  IN019-UNIT-PRICE               PIC 9(05)V99                  
                                                        COMP-3 VALUE 0.         
               05  IN019-FIRST-SLS-TIMESTAMP      PIC 9(06)                     
                                                        COMP-3 VALUE 0.         
               05  IN019-UNITS-SLD-AFT-TIMESTAMP  PIC S9(06)                    
                                                        COMP-3 VALUE +0.        
               05  IN019-NEG-INV-ADJUST           PIC S9(06)                    
                                                        COMP-3 VALUE +0.        
               05  IN019-SALES-ADJ-QTY            PIC S9(06)                    
                                                        COMP-3 VALUE +0.        
               05  IN019-SALES-ADJ-EXT-RTL-AMT    PIC S9(09)V99                 
                                                        COMP-3 VALUE +0.        
               05  IN019-INVLD-STKRMW             PIC S9(06)                    
                                                        COMP-3 VALUE +0.        
               05  IN019-DKEY-NBR                 PIC  S9(9) COMP.              
W21732         05  IN019-DEPT-NBR                 PIC X(04) VALUE SPACE.        
W21732         05  IN019-CL-NBR                   PIC X(04) VALUE SPACE.        
W33304         05  IN019-INV-ID                   PIC S9(9) COMP.               
W33304         05  IN019-FINCL-INV-STAT-CDE       PIC X(02) VALUE SPACE.        
W33304         05  FILLER                         PIC X(19) VALUE SPACE.        
                                                                                
           03  IN019-TIMESTMP-TTL REDEFINES IN019-TIMESTMP-DETAIL.              
W26600         05  IN019-TIMESTMP-KEY-TTL         PIC X(10).                    
               05  IN019-TTL-ACTL-INV-DTE.                                      
                   10  IN019-TTL-ACTL-INV-YY      PIC 9(02).                    
                   10  IN019-TTL-ACTL-INV-MM      PIC 9(02).                    
                   10  IN019-TTL-ACTL-INV-DD      PIC 9(02).                    
               05  FILLER                         PIC X(06).                    
W26600         05  IN019-TTL-SALES-ADJ-QTY        PIC S9(07)                    
                               COMP-3.                                          
               05  IN019-TTL-SALES-ADJ-RTL-AMT    PIC S9(09)V99                 
                               COMP-3.                                          
W26600         05  IN019-TTL-SALES-QTY            PIC S9(07)                    
                               COMP-3.                                          
               05  IN019-TTL-RTL-SALES-AMT        PIC S9(09)V99                 
                               COMP-3.                                          
               05  IN019-SALES-ADJ-PCT            PIC S9(03)V99                 
                               COMP-3.                                          
W26600         05  IN019-RETURN-QTY               PIC S9(07)                    
W26600                         COMP-3.                                          
W26600         05  IN019-RETURN-RTL-AMT           PIC S9(09)V99                 
W26600                         COMP-3.                                          
W33304         05  FILLER                         PIC X(20).                    
W33304* THE FIELDS ARE NECESSARY FOR SORTING                                    
W33304         05  IN019-TTL-INV-ID               PIC S9(9) COMP.               
W33304         05  IN019-TTL-FINCL-INV-STAT-CDE   PIC X(02).                    
W33304         05  FILLER1                        PIC X(19).                    
