      ***************************************************************** 00010001
      *    INRD030 - RECEIVING SYSTEM REPORT DETAIL RECORD              00020001
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE     PGMR          DESCRIPTION OF CHANGES                   
      * ------- -------- ------------- --------------------------------         
      * WR33744 01/15/08 J SELWITSCHKA INITIAL IMPLEMENTATION.                  
      ***************************************************************** 00030001
      *                                                                 00040001
       01  IN030-REPORT-DETAIL.                                         00050001
           05  IN030-LOC-NBR                  PIC S9(04) COMP VALUE +0. 00060001
           05  IN030-INV-DTE                  PIC  X(10) VALUE SPACE.   00061101
           05  IN030-UNIT-BK-DTE              PIC  X(10) VALUE SPACE.   00061301
           05  IN030-DEPT-NBR                 PIC S9(04)                00060001
                                                        COMP-3 VALUE +0.00062001
           05  IN030-SUB-CL-NBR               PIC S9(04)                00061401
                                                        COMP-3 VALUE +0.00062001
           05  IN030-SKU-NBR                  PIC S9(08)                00061401
                                                        COMP-3 VALUE +0.00062001
           05  IN030-ADJ-UNITS                PIC S9(06)                00061501
                                                        COMP-3 VALUE +0.00062001
           05  IN030-UNIT-RTL-AMT             PIC S9(11)V99             00061901
                                                        COMP-3 VALUE +0.00062001
           05  IN030-EXTD-RTL-AMT             PIC S9(11)V99             00061901
                                                        COMP-3 VALUE +0.00062001
           05  IN030-VENDOR-NAME              PIC  X(30) VALUE SPACE.   00061301
           05  IN030-SKU-DESC                 PIC  X(30) VALUE SPACE.   00061301
           05  FILLER                         PIC  X(39) VALUE SPACE.           
