      ******************************************************************00010000
      *  INDR051 :  CUTOFF DATABASE - ADJUSTMENT EXTRACT COPYBOOK.      00020001
      *  RECORD LENGTH - 48 BYTES                                       00040001
      *                                                                 00040001
      *  THIS COPYBOOK IS USED BY  1. INKUT154                          00050001
      *                            2. INKUP009                          00060001
      *                                                                 00080001
      *CHANGE HISTORY:                                                  00090001
      * CHG ID/                                                         00100001
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                     00110001
      * -------  ----------  ----------------------------------------   00120001
      * W26600   06-03-2004  CUTOFF DATABASE - ADJUSTMENT EXTRACT       00121001
      *                      COPYBOOK CREATION.                         00121101
      *                      -PAUL KEBER                                00122001
      ******************************************************************00140000
      *                                                                 00150000
       01  IN051-CTOFF-ADJ-EXTR-RECORD.                                 00160000
           05  IN051-LOC-NBR                PIC S9(04)  VALUE +0 COMP.  00170004
           05  IN051-TRANS-TYPE             PIC  X(04)  VALUE SPACES.   00250000
               88  IN051-TRANS-FSRA                     VALUE 'FSRA'.   00260004
               88  IN051-TRANS-INV1                     VALUE 'INV1'.   00260004
               88  IN051-TRANS-INV2                     VALUE 'INV2'.   00260004
           05  IN051-VERIFIED-DATE          PIC  X(10)  VALUE SPACES.   00240000
           05  IN051-QUANTITY               PIC S9(09)  VALUE +0 COMP.  00210000
           05  IN051-SKU-NBR                PIC S9(08)  VALUE +0 COMP-3.00200000
           05  IN051-ITEM-NBR               PIC S9(15)  VALUE +0 COMP-3.00200000
           05  FILLER                       PIC  X(15)  VALUE SPACES.   00260004
