000100******************************************************************        
000200*  INRD013 - BEFORE INVENTORY ADJUSTMENT EXTRACT FILE                     
W33304*  RECORD LENGTH - 144 BYTES                                              
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
W26600* W26600  03-08-2004 ROD JANSSEN INV LEDGER STORE EXPANSION               
W27808* W27808  05-25-2005 S .JACKSON  NEW MANIFESTING/STORE-EXPECT CHGS        
      * W28545  11-02-2005 V.L. YANG   ESTIMATED DAILY INVENTORY LEDGER         
W33304* W33304  09-09-2008 VIGNESH     HOLDING INVENTORY LEDGER OPEN            
W33304*                                HILO                                     
001100******************************************************************        
                                                                                
001200 01  IN013-INVENTORY-ADJ-EXTR-REC.                                        
001300     05  IN013-GMA-NBR                PIC X(02)      VALUE SPACES.        
001400     05  IN013-DMA-NBR                PIC X(02)      VALUE SPACES.        
001500     05  IN013-BYR-NBR                PIC X(03)      VALUE SPACES.        
001600     05  IN013-DEPT-NBR               PIC X(03)      VALUE SPACES.        
001600     05  IN013-SUB-CL-NBR             PIC X(02)      VALUE SPACES.        
001600     05  IN013-STR-NBR                PIC S9(4) COMP VALUE ZERO.          
W26600     05  IN013-BEG-INV-RTL-AMT        PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN013-SLS-RTL-AMT            PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN013-MKDN-RTL-AMT           PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN013-MKUP-RTL-AMT           PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN013-XFER-IN-RTL-AMT        PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN013-XFER-OUT-RTL-AMT       PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN013-RCPT-RTL-AMT           PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN013-PADJ-RTL-AMT           PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN013-SHNK-RTL-AMT           PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  IN013-END-INV-RTL-AMT        PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
OCFSFS     05  IN013-STR-PARL-SHIP-RTL-AMT  PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W27808     05  IN013-STR-EXPTED-RTL-AMT     PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W28545     05  IN013-PHY-INV-RTL-AMT        PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W33304     05  IN013-INV-ID                 PIC S9(09)     COMP                 
W33304                                                     VALUE ZERO.          
W33304     05  IN013-FINCL-INV-STAT-CDE     PIC X(02)      VALUE SPACE.         
W33304     05  IN013-OPN-FSCL-MN-DTE        PIC X(10)      VALUE SPACE.         
W33304     05  FILLER                       PIC X(10)      VALUE SPACES.        
