00001  01  IN002O-STORE-SHORTAGE-REC.                                   01/05/94
W26600     05  IN002O-STORE-NUMB          PIC  9(05)     VALUE ZEROS.   INRD002O
00003      05  IN002O-DIVISION-NUMB       PIC  9(02)     VALUE ZEROS.      LV001
00004      05  IN002O-DEPARTMENT-NUMB     PIC  9(03)     VALUE ZEROS.   INRD002O
00005      05  IN002O-CLASS-NUMB          PIC  9(02)     VALUE ZEROS.   INRD002O
00006      05  IN002O-BUYER-NUMB          PIC  9(02)     VALUE ZEROS.   INRD002O
00007      05  IN002O-STORE-NAME          PIC  X(10)     VALUE SPACE.   INRD002O
00008      05  IN002O-DEPARTMENT-NAME     PIC  X(20)     VALUE SPACE.   INRD002O
00009      05  IN002O-FINANCE-CORP-NMBR   PIC  X(02)     VALUE SPACE.   INRD002O
W26600     05  IN002O-BOOK-INV            PIC S9(13)V99  VALUE ZEROS    INRD002O
00011                                                    COMP-3.        INRD002O
W26600     05  IN002O-SHRINK-ALLOWANCE    PIC S9(13)V99  VALUE ZEROS    INRD002O
00013                                                    COMP-3.        INRD002O
W26600     05  IN002O-TOTAL-RETAIL        PIC S9(13)V99  VALUE ZEROS    INRD002O
00015                                                    COMP-3.        INRD002O
W26600     05  IN002O-TOTAL-COST          PIC S9(13)V99  VALUE ZEROS    INRD002O
00017                                                    COMP-3.        INRD002O
W26600     05  IN002O-PHY-INV-RETAIL      PIC S9(13)V99  VALUE ZEROS    INRD002O
00019                                                    COMP-3.        INRD002O
W26600     05  IN002O-SHORT-RETAIL        PIC S9(13)V99  VALUE ZEROS    INRD002O
00021                                                    COMP-3.        INRD002O
W26600     05  IN002O-SHORT-COST          PIC S9(13)V99  VALUE ZEROS    INRD002O
00023                                                    COMP-3.        INRD002O
W26600     05  IN002O-TOTAL-SALES         PIC S9(13)V99  VALUE ZEROS    INRD002O
00025                                                    COMP-3.        INRD002O
00026      05  IN002O-SHRINK-PER          PIC S9(03)V99  VALUE ZEROS    INRD002O
00027                                                    COMP-3.        INRD002O
W26600     05  FILLER                     PIC X(07)      VALUE SPACE.           
