      *****************************************************************         
      *    INRD027 - TOTAL SALES FOR INVENTORING STORES               *         
      *****************************************************************         
      *                                                                         
       01  IN027-TOTAL-SALES-REC.                                               
W26600     05  IN027-STR-NBR              PIC S9(4)        VALUE ZEROES         
W26600                         COMP.                                            
           05  IN027-POS-TRAN-DTE         PIC 9(07)        VALUE ZEROES         
W26600                         COMP-3.                                          
W26600     05  IN027-TRAN-QTY             PIC S9(07)       VALUE ZEROES         
W26600                         COMP-3.                                          
           05  IN027-RTL-AMT              PIC S9(9)V99     VALUE ZEROES 08280050
W26600                         COMP-3.                                          
W26600     05  IN027-RETURN-QTY           PIC S9(07)       VALUE ZEROES         
W26600                         COMP-3.                                          
W26600     05  IN027-RETURN-RTL-AMT       PIC S9(9)V99     VALUE ZEROES 08280050
W26600                         COMP-3.                                          
W26600     05  FILLER                     PIC X(04)        VALUE SPACES.        
