      *****************************************************************         
      *    INRD009 - VARIANCE DATA FOR THE DATA WAREHOUSE             *         
      *****************************************************************         
      *                                                                         
       01  IN009-VARIANCE-RECORD.                                               
           05  IN009-PROD-DIM-KEY.                                              
               10  IN009-UPC-ID               PIC X(15) VALUE ZERO.             
               10  IN009-ITM-NBR              PIC S9(15)V                       
                                                 COMP-3 VALUE ZERO.             
           05  IN009-INV-DTE                  PIC X(10) VALUE SPACE.            
           05  IN009-STR-NBR                  PIC S9(05)                        
                                                 COMP-3 VALUE ZERO.             
           05  IN009-STAT-CDE                 PIC X(02) VALUE SPACES.           
           05  IN009-PHY-CNT                  PIC S9(09)                        
                                                 COMP-3 VALUE ZERO.             
           05  IN009-UNT-CTOFF                PIC S9(09)                        
                                                 COMP-3 VALUE ZERO.             
24521      05  IN009-TRUE-CUTOFF-QTY          PIC S9(09)                        
24521                                            COMP-3 VALUE ZERO.             
24521      05  FILLER                         PIC X(07) VALUE SPACE.            
