      *****************************************************************         
      *    INRD016 - POS SALES AND RETURN DATA                        *         
      *              (NOTE: THIS FILE ORIGINATED FROM THE PSK005 FILE *         
      *               PKMO.PS.DAILY.SALES.FILE(COPYBOOK PSRD110I)     *         
RB1002*    OCT 2002 - MODIFIED TO USE THE NEW COSA DAILY FILE.        *         
RB1002*               SOME OF THE OLD FIELDS ARE NO LONGER USED.  SOME*         
RB1002*               OF THE FIELDS HAVE DIFFERENT LAYOUTS AND OR     *         
RB1002*               DIFFERENT VALUES.                               *         
      *****************************************************************         
      *                                                                         
       01  IN016-POS-ITEM-DETAIL.                                               
           05  IN016-POS-KEY.                                                   
W26600         10  IN016-STR-NBR              PIC 9(04)    VALUE ZEROES.        
W21732         10  IN016-SKU                  PIC X(08) VALUE SPACE.            
           05  IN016-TRAN-DTE                 PIC 9(07)                         
                                                 COMP-3 VALUE ZERO.             
           05  IN016-TRAN-TIMESTAMP           PIC 9(05)                         
                                                 COMP-3 VALUE ZERO.             
RB1002     05  IN016-TRAN-TYPE                PIC X(02) VALUE SPACE.            
RB1002         88  IN016-PRICE-ADJUSTMENT       VALUE '24', '25'.               
RB1002         88  IN016-SALE-TYPE              VALUE '01', '02'.               
RB1002         88  IN016-RETURN-TYPE            VALUE '11', '12'.               
           05  IN016-TRAN-QTY                 PIC S9(05)                        
                                                 COMP-3 VALUE ZERO.             
RB1002*        **  OWNED RETAIL AMOUNT **                                       
           05  IN016-RTL-AMT                  PIC S9(5)V99 VALUE ZEROS  08280050
                                                    COMP-3.             08290050
RB1002*        **  NET AMT CHANGED     **                                       
RB1002*    05  IN016-SLS-AMT                  PIC S9(7)V99 VALUE ZEROS          
RB1002*                                             COMP-3.                     
W21732     05  IN016-DEPT-NBR                 PIC X(04) VALUE SPACE.            
W21732     05  IN016-CL-NBR                   PIC X(04) VALUE SPACE.            
RB1002     05  IN016-MAJ-NBR-FILLER           PIC X(02) VALUE SPACE.            
RB1002     05  IN016-MAJ-NBR                  PIC X(02) VALUE SPACE.            
RB1002     05  IN016-SALE-RETURN-CDE          PIC X(01) VALUE SPACE.            
RB1002         88  IN016-SALE                   VALUE 'S', 'A'.                 
RB1002         88  IN016-RETURN                 VALUE 'R', 'B'.                 
W21732     05  FILLER                         PIC X(09) VALUE SPACE.            
