      **************************************************************            
      *  INRD135 - EXTRACT LAYOUT FOR TOTAL PIECE COUNT REPORTING  *            
W26600*            RCD LENGTH = 30                                              
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                             
      * -------  ----------  ----------------------------------------           
W21732* W21732   12-26-2002  NON-INTELLIGENT SKU. - IBM                         
25248 * 25248    10-06-2003  UPC CAPABILITIES -ROD JANSSEN                      
W26600* W26600   06-  -2004  PHYSICAL INVENTORY STORE EXPANSION                 
W26600*                      M JOHNSON                                          
      *                                                                         
      **************************************************************            
       01  INRD135-PIECE-EXTR-REC.                                              
W26600     05  IN135-STORE                 PIC  X(04).                          
           05  IN135-AREA                  PIC S9(09)      COMP.                
W21732     05  IN135-SKU                   PIC  X(08).                          
           05  IN135-QTY                   PIC S9(09)      COMP.                
25248      05  IN135-UPC-CODE              PIC S9(15)V     COMP-3.              
W26600     05  FILLER                      PIC  X(02).                          
