      *****************************************************************         
      *    INRD017 - TIMESTAMPS FOR "AFTER" INVENTORY SALES AND RETURNS         
      *****************************************************************         
      *                                                                         
       01  IN017-SALE-TIMESTAMPS.                                               
W26600     05  IN017-STR-NBR                  PIC S9(4) COMP VALUE ZERO.        
W21732     05  IN017-SKU                      PIC X(08) VALUE SPACE.            
           05  IN017-SCAN-DTE                 PIC 9(04)                         
                                                 COMP-3 VALUE ZERO.             
           05  IN017-SCAN-TIMESTAMP           PIC 9(06)                         
                                                 COMP-3 VALUE ZERO.             
           05  IN017-SALE-DTE                 PIC 9(04)                         
                                                 COMP-3 VALUE ZERO.             
           05  IN017-SALE-TIMESTAMP           PIC 9(06)                         
                                                 COMP-3 VALUE ZERO.             
           05  IN017-SALES-QTY                PIC S9(06)                        
                                                 COMP-3 VALUE ZERO.             
           05  IN017-TRAN-TYPE                PIC X(02) VALUE SPACE.            
               88  IN017-PRICE-ADJUSTMENT       VALUE '24', '25'.               
               88  IN017-SALE-CDE               VALUE '01', '02'.               
               88  IN017-RETURN-CDE             VALUE '11', '12'.               
           05  IN017-SALE-RETURN-CDE          PIC X(1)  VALUE SPACE.            
               88  IN017-SALE                   VALUE 'S', 'A'.                 
               88  IN017-RETURN                 VALUE 'R', 'B'.                 
W26600     05  FILLER                         PIC X(19) VALUE SPACE.            
