00001 *----------------------------------------------------------------*12/20/94
00002 *                         INWS003                                *INWS003 
00003 *                                                                *   LV001
00004 *   THIS IS TS QUEUE RECORD LAYOUT USED IN THE PHYSICAL INVENTORY*INWS003 
00005 *   MAINTENANCE PROGRAMS TO PASS THE LINE NUMBER.                *INWS003 
00006 *                                                                *INWS003 
00007 *----------------------------------------------------------------*INWS003 
00008                                                                   INWS003 
00009  01  IN003-SELECTED-LINES.                                        INWS003 
00010        05  IN003-SELECTED-ITEMS         PIC S9(05)  COMP-3        INWS003 
00011                                                     VALUE ZERO.   INWS003 
00012        05  IN003-MAX-ITEMS              PIC  9(03)  VALUE 50.     INWS003 
00013        05  IN003-SELECTED-ITEM-ARRAY.                             INWS003 
00014            10  FILLER                   OCCURS 50 TIMES           INWS003 
00015                                         INDEXED BY IN003-IDX.     INWS003 
00016                15  IN003-ITEM           PIC S9(09)  COMP-3.       INWS003 
00017                15  IN003-ACTION-SW      PIC  X(01).               INWS003 
00018                    88  IN003-INQ                    VALUE 'I'.    INWS003 
00019                    88  IN003-UPD                    VALUE 'U'.    INWS003 
00020                    88  IN003-DEL                    VALUE 'D'.    INWS003 
00021                    88  IN003-ERR                    VALUE 'E'.    INWS003 
00022                15  IN003-KEY-DATA.                                INWS003 
00023                    20  IN003-INV-LINE-NBR    PIC S9(08)  COMP.    INWS003 
00024                    20  IN003-SCAN-LINE-NBR   PIC S9(08)  COMP.    INWS003 
