00009  01  IN027-SELECTED-SKUS.                                         00010008
00010      05  IN027-SELECTED-ITEMS           PIC S9(05)    COMP-3      00020006
00011                                                       VALUE ZERO. 00030006
00012      05  IN027-MAX-ITEMS                PIC  9(03)    VALUE 50.   00040009
00013      05  IN027-SELECTED-ITEM-ARRAY.                               00050009
00014            10  FILLER                   OCCURS 50 TIMES           00060006
00015                                         INDEXED BY IN027-IDX.     00070006
00016                15  IN027-ITEM           PIC S9(09)    COMP-3.     00080008
00017                15  IN027-ACTION-SW      PIC  X(01).               00090008
00018                    88  IN027-INQ                      VALUE 'I'.  00100008
00019                    88  IN027-UPD                      VALUE 'U'.  00110008
00020                    88  IN027-DEL                      VALUE 'D'.  00120008
00021                    88  IN027-ERR                      VALUE 'E'.  00130008
00022                15  IN027-KEY-DATA.                                00140008
00011                    20  IN027-SKU              PIC  9(08).         00150012
00012                    20  IN027-SKU-X REDEFINES                      00160012
00013                        IN027-SKU              PIC  X(08).         00170012
00038                    20  IN027-PRICE            PIC  9(07)V99.      00180013
00039                    20  IN027-PRICE-X REDEFINES                    00190009
00040                        IN027-PRICE            PIC  X(09).         00200013
