      *----------------------------------------------------------------*07/07/94
      *                         INWS035                                *INWS035 
      *   THIS IS THE TEMP-STORAGE QUEUE (RECORD LAYOUT) USED BY       *INWS035 
      *   INKCS035 TO PASS THE SELECTED QUEUE                          *INWS035 
W26600*                                                                *INWS035 
W26600*  W26600  07-  -2004  PHYSICAL INVENTORY STORE EXPANSION        *INWS035 
W26600*                      M JOHNSON                                 *INWS035 
W26600*                                                                *INWS035 
      *----------------------------------------------------------------*INWS035 
       01  IN035-SELECTED-SHEET.                                        INWS035 
           05  IN035-SELECTED-ITEMS         PIC S9(05) COMP-3           INWS035 
                                                          VALUE ZERO.   INWS035 
           05  IN035-MAX-ITEMS              PIC 9(03)  VALUE 20.        INWS035 
           05  IN035-SELECTED-ITEM-ARRAY.                               INWS035 
               10  FILLER                   OCCURS 20 TIMES             INWS035 
                                            INDEXED BY IN035-IDX.       INWS035 
                   15  IN035-ITEM           PIC S9(09)  COMP-3.         INWS035 
                   15  IN035-ACTION-SW      PIC  X(03).                    CL**5
                       88  IN035-INQ                    VALUE 'INQ'.       CL**5
                       88  IN035-ADD                    VALUE 'ADD'.       CL**5
                       88  IN035-UPD                    VALUE 'UPD'.       CL**5
                       88  IN035-DEL                    VALUE 'DEL'.       CL**5
                       88  IN035-ERR                    VALUE 'ERR'.       CL**5
                   15  IN035-KEY-DATA.                                  INWS035 
W26600                 20  IN035-STORE-NBR    PIC 9(04).                   CL**6
                       20  IN035-ACTL-INV-DTE PIC X(10).                INWS035 
