00001 *----------------------------------------------------------------*09/17/93
00002 *                         INWS022                                *INWS022 
00003 *                                                                *   LV003
00004 *   THIS IS TS QUEUE RECORD LAYOUT USED IN THE STOCKROOM         *INWS022 
00005 *   WITHDRAWAL MAINTENANCE PROGRAMS TO PASS THE SHEET NUMBER.    *INWS022 
00006 *                                                                *INWS022 
00007 *----------------------------------------------------------------*INWS022 
00008                                                                   INWS022 
00009  01  IN022-SHEET-SEL-REC.                                         INWS022 
00010        05  IN022-SELECTED-ITEMS         PIC S9(05)  COMP-3        INWS022 
00011                                                     VALUE ZERO.   INWS022 
00012        05  IN022-MAX-ITEMS              PIC  9(02)  VALUE 50.        CL**2
00013        05  IN022-SELECTED-ITEM-ARRAY.                             INWS022 
00014            10  FILLER                   OCCURS 50 TIMES              CL**2
00015                                         INDEXED BY IN022-IDX.     INWS022 
00016                15  IN022-ITEM           PIC S9(09)  COMP-3.       INWS022 
00017                15  IN022-ACTION-SW      PIC  X(01).               INWS022 
00018                    88  IN022-INQ                    VALUE 'I'.    INWS022 
00019                    88  IN022-UPD                    VALUE 'U'.    INWS022 
00020                    88  IN022-DEL                    VALUE 'D'.    INWS022 
00021                    88  IN022-ERR                    VALUE 'E'.    INWS022 
00022                15  IN022-KEY-DATA.                                INWS022 
00023                    20  IN022-SHEET-NBR  PIC 9(06).                   CL**3
