      ****************************************************************          
      *    INWS004 - VALID STORE NUMBERS FROM INK300                            
      ****************************************************************          
      *  ** W26682 - STORE EXPANSION (STR-NBR INC FROM X(3) TO X(4))            
      *              CHANGE STR-NBR AFTER JUNE, 2004 INVENTORY CYCLE            
      ****************************************************************          
W26600*  W26600  06-  -2004  PHYSICAL INVENTORY STORE EXPANSION                 
W26600*                      M JOHNSON                                          
W26600*                                                                         
W26600****************************************************************          
       01  IN004-INVENTORY-COUNT-RECORD.                                        
W26600     05  IN004-STR-NBR                  PIC  X(04).                       
W26682     05  IN004-STR-NUMBER REDEFINES                                       
W26600         IN004-STR-NBR                  PIC  9(04).                       
W26600*    05  FILLER                         PIC  X(01)   VALUE SPACE.         
           05  IN004-PROCESS-TYPE             PIC  X(01).                       
               88  IN004-PROCESS-SHEET                     VALUE 'S'.           
               88  IN004-PROCESS-NON-SHEET                 VALUE 'N'.           
               88  IN004-PROCESS-REQUEST                   VALUE 'R'.           
               88  IN004-PROCESS-NA                        VALUE ' '.           
           05  FILLER                         PIC  X(01)   VALUE SPACE.         
           05  IN004-DATA-TYPE                PIC  X(10).                       
               88  IN004-STORE-SCAN           VALUE 'STR SCAN  '.               
               88  IN004-STORE-SHEET          VALUE 'STR SHEET '.               
               88  IN004-DC                   VALUE 'DC        '.               
               88  IN004-BUYER-REQ-EXECP-RPT  VALUE 'BUYER REQ '.               
               88  IN004-LOCATION-NA          VALUE '          '.               
           05  FILLER                         PIC  X(64)   VALUE SPACE.         
