00001 *----------------------------------------------------------------*08/10/93
00002 *                         INWS002                                *INWS002 
00003 *                                                                *   LV016
00004 *   THIS IS TS QUEUE RECORD LAYOUT USED IN THE PHYSICAL INVENTORY*   CL*14
00005 *   MAINTENANCE PROGRAMS TO PASS THE AREA NUMBER.                *   CL*14
00006 *                                                                *   CL*14
00007 *----------------------------------------------------------------*   CL*14
00008                                                                      CL*14
00009  01  IN002-SELECTED-AREAS.                                           CL*15
00010        05  IN002-SELECTED-ITEMS         PIC S9(05)  COMP-3           CL*15
00011                                                     VALUE ZERO.      CL*14
00012        05  IN002-MAX-ITEMS              PIC  9(03)  VALUE 50.        CL*15
00013        05  IN002-SELECTED-ITEM-ARRAY.                                CL*15
00014            10  FILLER                   OCCURS 50 TIMES              CL*15
00015                                         INDEXED BY IN002-IDX.        CL*15
00016                15  IN002-ITEM           PIC S9(09)  COMP-3.          CL*15
00017                15  IN002-ACTION-SW      PIC  X(01).                  CL*15
00018                    88  IN002-INQ                    VALUE 'I'.       CL*15
00019                    88  IN002-UPD                    VALUE 'U'.       CL*15
00020                    88  IN002-DEL                    VALUE 'D'.       CL*15
00021                    88  IN002-ERR                    VALUE 'E'.       CL*15
00022                15  IN002-KEY-DATA.                                   CL*15
00023                    20  IN002-AREA-NBR   PIC S9(08)  COMP.            CL*16
