      ******************************************************************        
      *                                                                *        
      *  THIS WORKING STORAGE COPYBOOK IS USED IN CONJUNCTION WITH     *        
      *  INPD089 COPY CODE TO GENERATE A TWO-CHARACTER CODE FOR        *        
      *  PHYSICAL INVENTORY IN BUILDING THE TRANSMISSION/FTP JOBS.     *        
      *                                                                *        
      ******************************************************************        
       01  IN089-INPUT-WORK-AREA.                                               
           05  IN089-REQUESTED-NUMBER      PIC S9(04)      VALUE ZEROES         
                               COMP.                                            
                                                                                
       01  IN089-OUTPUT-WORK-AREA.                                              
           05  IN089-RESULTING-CHARS       PIC X(02)       VALUE SPACES.        
           05  FILLER REDEFINES IN089-RESULTING-CHARS.                          
               10  IN089-RESULTING-LETTER  PIC X(01).                           
               10  IN089-RESULTING-NUMBER  PIC 9(01).                           
                                                                                
       01  IN089-CONSTANT-AREA.                                                 
           05  IN089-PC-LETTER-TBL-SIZE    PIC S9(04)      VALUE +26            
                               COMP.                                            
                                                                                
       01  IN089-PV-WORK-AREA.                                                  
           05  IN089-PV-CALC-RESULT        PIC S9(04)      VALUE ZEROES         
                               COMP.                                            
           05  IN089-PV-CALC-REMAINDER     PIC S9(04)      VALUE ZEROES         
                               COMP.                                            
                                                                                
       01  IN089-LETTER-TBL-WORK-AREA.                                          
           05  FILLER                      PIC X(01)       VALUE 'A'.           
           05  FILLER                      PIC X(01)       VALUE 'B'.           
           05  FILLER                      PIC X(01)       VALUE 'C'.           
           05  FILLER                      PIC X(01)       VALUE 'D'.           
           05  FILLER                      PIC X(01)       VALUE 'E'.           
           05  FILLER                      PIC X(01)       VALUE 'F'.           
           05  FILLER                      PIC X(01)       VALUE 'G'.           
           05  FILLER                      PIC X(01)       VALUE 'H'.           
           05  FILLER                      PIC X(01)       VALUE 'I'.           
           05  FILLER                      PIC X(01)       VALUE 'J'.           
           05  FILLER                      PIC X(01)       VALUE 'K'.           
           05  FILLER                      PIC X(01)       VALUE 'L'.           
           05  FILLER                      PIC X(01)       VALUE 'M'.           
           05  FILLER                      PIC X(01)       VALUE 'N'.           
           05  FILLER                      PIC X(01)       VALUE 'O'.           
           05  FILLER                      PIC X(01)       VALUE 'P'.           
           05  FILLER                      PIC X(01)       VALUE 'Q'.           
           05  FILLER                      PIC X(01)       VALUE 'R'.           
           05  FILLER                      PIC X(01)       VALUE 'S'.           
           05  FILLER                      PIC X(01)       VALUE 'T'.           
           05  FILLER                      PIC X(01)       VALUE 'U'.           
           05  FILLER                      PIC X(01)       VALUE 'V'.           
           05  FILLER                      PIC X(01)       VALUE 'W'.           
           05  FILLER                      PIC X(01)       VALUE 'X'.           
           05  FILLER                      PIC X(01)       VALUE 'Y'.           
           05  FILLER                      PIC X(01)       VALUE 'Z'.           
       01  FILLER REDEFINES IN089-LETTER-TBL-WORK-AREA.                         
           05  IN089-LETTER-TBL OCCURS 26 TIMES.                                
               10  IN089-JOB-LETTER        PIC X(01).                           
                                                                                
