000100*                          INWS007                                00010000
000200*  THIS IS THE WORKING STORAGE LAYOUT USED TO PASS DATA TO THE    00020000
000300*  PHYSICAL INVENTORY INVALID DATA COMPARISON PRINT PROGRAM.      00030000
W26600*  RECORD LENGTH = 233.                                           00040001
000400*                                                                 00050000
      *CHANGE HISTORY:                                                  00052000
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES           00053000
      * ------- ---------- ----------- -------------------------------- 00054000
W26600* W26600  06-29-2004 ROD JANSSEN INV STORE EXPANSION              00055000
00006 *                                                                *00056000
000500 01  IN007-COMMAREA.                                              00060000
W26600     05  IN007-STORE-NBR                 PIC  X(04)  VALUE SPACE. 00070001
000700     05  IN007-STORE-NAME                PIC  X(25)  VALUE SPACE. 00080000
000700     05  IN007-LOCATION-TYPE             PIC  X(02)  VALUE SPACE. 00090000
000800     05  IN007-ALL-AREAS-IND             PIC  X(01)  VALUE SPACE. 00100000
000900         88  IN007-PRINT-ALL-AREAS                   VALUE 'Y'.   00110000
000800     05  IN007-DISPLAY-COMPLETE-IND      PIC  X(01)  VALUE SPACE. 00120000
000900         88  IN007-DISPLAY-COMPLETE                  VALUE 'Y'.   00130000
001000     05  IN007-AREA-LIST.                                         00140000
001100         10  IN007-AREA-NBR  OCCURS 50 TIMES                      00150000
001200                                         PIC S9(09)  VALUE +0     00160000
001300                                                     COMP.        00170000
