W31475**********************!!! ATTENTION !!!***************************        
W31475* THIS IS A CLONE OF INWS400. ANY CHANGE HERE NEEDS TO REFLECT            
W31475* THERE AND VICE VERSA.                                                   
      *****************************************************************         
28545 *  INWS400 - COMMON PRICE LOOKUP MODULE WORKING STORAGE DEFINITION        
28545 *                                                                         
28545 *-----------------------------------------------------------------        
28545 *CHANGE HISTORY:                                                          
28545 * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
28545 * ------- ---------- ----------- --------------------------------         
28545 * W28545  03-08-2006 ROD JANSSEN CYCLE INVENTORY SKU/STYLE DELETE         
BV    * W28545  04-11-2006 ROD JANSSEN TEMP REMOVE BV COPY CODE CALLS.          
D28545* W28545  04-11-2006 ROD JANSSEN DUMMY SKU & RETURN CODES.                
E28545* W28545  04-26-2006 ROD JANSSEN PASS BACK RENUMBER STATUS TO HOST        
I28545* W28545  07-07-2006 ROD JANSSEN BUILD IN PERFORMANCE EFFICIENCIES        
J28545* W28545  07-24-2006 ROD JANSSEN INVENTORY RECLASS                        
RONNA * W28545  10-22-2006 RONNA M     CHANGED TO USE THE BVPD001               
RONNA *                                AND BVWS001 MODULES (BRAND VEN-          
RONNA *                                DOR UTILITY)                             
28545 *                                                                         
28545 *-----------------------------------------------------------------        
28545 *PURPOSE: COMMON PRICE LOOKUP MODULE WORKING STORAGE COPY CODE.           
28545 *                                                                         
28545 *NOTE:    REFER TO MODULE INPD400 FOR EACH PROCESSING OPTION.             
28545 *           THE INPUT FIELDS WILL BE INITIALIZED AFTER EACH               
28545 *           CALL TO THE ROUTINE.                                          
28545 *                                                                         
28545 *-----------------------------------------------------------------        
28545 *  HOW TO USE THIS COPYBOOK WITH INPD400:                                 
28545 *-----------------------------------------------------------------        
28545 *  1.  DETERMINE IF WE CAN USE VSM PRICING TABLES OR HISTORICAL           
28545 *      PHYSICAL INVENTORY STYLE DELETION TABLES.                          
28545 *                                                                         
28545 *  2.  PRICE LOOKUP.                                                      
28545 *      A.  INPUT(S) BUILD.                                                
      *      - THE MINIMUM INPUT REQUIRED TO RETRIEVE CURRENT RETAIL ARE        
      *        KEY DATES, LOCATION, AND VALID IDENTIFIER PV-LOOKUP-TYPE         
      *      - SET THE APPROPRIATE PV-LOOKUP-TYPE INDICATOR, BY SETTING         
      *        THE 88 LEVEL TO TRUE: SKU, UPC, UPCID, ITM.                      
      *        IF NOTHING IS SET HERE, IT WILL SEARCH UNTIL IT FINDS            
      *        SKU, UPC-NBR, UPC-ID, ITM-NBR THE PROCESS CAN UTILIZE            
      *      - PRIOR TO ENTERING PROCEDURE DIVISION, MOVE DATA TO THE           
      *        APPROPRIATE FIELD CORRESPNDING TO THE SWITCH THAT WAS SET        
      *      - IF ADDITIONAL DATA IS AVAILABLE (ITM_NBR FOR SKU LOOKUP)         
      *        INCLUDE THIS AS WELL IN CASE THE FIRST CALL FAILED               
      *      - IF THE LOOKUP AT THE SPECIFIED LEVEL OR THE FIRST                
      *        ASSUMPTION LEVEL FAIL, THIS PROCESS WILL TRY AGAIN USING         
      *        THE ADDITIONAL DATA FIELD UNTIL ATTEMPTS ARE EXHAUSTED.          
      *                                                                         
      *      - ENTRY PROCEDURE: IN402-LOOKUP-RETAIL                             
      *                                                                         
28545 *      B.  RESULTS.                                                       
28545 *      - PRICE LOOKUP RETURN CODE VARIABLES ARE DEFINED HERE.             
28545 *        (IN402-PV-COMMON-AREA)                                           
28545 *         - RETURN STATUS CODE                                            
28545 *         - RETURN STATUS CODE REASON TEXT                                
28545 *                                                                         
28545 *      - ON A SUCCESSFUL EXECUTION AND RETURN TO THE CALLING              
28545 *        PROGRAM, THE FOLLOWING DATA WILL BE RETURNED TO THE              
28545 *        FOLLOWING WORKING STORAGE FIELD                                  
28545 *        (IN402-PRICE-RESULT-AREA)                                        
28545 *         - EFF BEGIN DATE                                                
28545 *         - EFF END DATE                                                  
28545 *         - SKU                        (TSKXREF)                          
28545 *         - INTERNAL UPC ID            (TSKXREF)                          
28545 *         - UPC NUMBER                 (TUPC)                             
28545 *         - ITEM NUMBER                (TSKXREF)                          
28545 *         - STATUS CODE                (TSKXREF)                          
28545 *         - UPC CHANGE DATE            (TUPCPLS)                          
28545 *         - STATUS CHANGE DATE         (TUPCPLS)                          
28545 *         - GROUP PRICE NUMBER         (TMEITGP)                          
28545 *         - GROUP PRICE QUANTITY       (TMITGPL)                          
28545 *         - GROUP PRICE RETAIL AMOUNT  (TMITGPL)                          
28545 *         - UNIT RETAIL AMOUNT         (TUPCPLS)                          
28545 *         - EXTENDED UNIT RETAIL AMOUNT                                   
28545 *                                                                         
28545 *      - ON A SUCCESSFUL EXECUTION AND RETURN TO THE CALLING              
28545 *        PROGRAM, THE FOLLOWING DATA WILL BE RETURNED TO THE              
28545 *        FOLLOWING WORKING STORAGE FIELD.                                 
28545 *        (IN402-ATTRIB-RESULT-AREA)                                       
28545 *         -  SKU                                                          
28545 *         -  INTERNAL UPC ID                                              
28545 *         -  UPC                                                          
28545 *         -  ITEM NUMBER                                                  
28545 *         -  DEPARTMENT                                                   
28545 *         -  MAJOR CLASS                                                  
28545 *         -  SUB CLASS                                                    
28545 *         -  SKU STATUS CODE                                              
28545 *         -  MDSEAR ID                                                    
28545 *         -  RMS STYLE ID                                                 
28545 *         -  VENDOR STYLE ID                                              
28545 *         -  VENDOR STYLE NUMBER                                          
28545 *                                                                         
      *      - ON A SUCCESSFUL EXECUTION AND RETURN TO THE CALLING              
      *        PROGRAM, THE FOLLOWING DATA WILL BE RETURNED TO THE              
28545 *        FOLLOWING WORKING STORAGE FIELD.                                 
28545 *        (IN402-VENDOR-RESULT-AREA)                                       
28545 *         -  SKU                                                          
28545 *         -  INTERNAL UPC ID                                              
28545 *         -  UPC                                                          
28545 *         -  ITEM NUMBER                                                  
28545 *         -  DEPARTMENT                                                   
28545 *         -  VENDOR ENT_ID                                                
28545 *         -  VENDOR DUNS NUMBER                                           
28545 *         -  VENDOR INHOUSE NUMBER                                        
28545 *         -  BRAND                                                        
28545 *                                                                         
28545 *-----------------------------------------------------------------        
28545 *  3.  ATTRIBUTES LOOKUP.                                                 
28545 *      A.  ATTRIBUTES INPUT(S) BUILD.                                     
28545 *      - BOTH THE ITEM ATTRIBUTES AND BRAND/VENDOR ATTRIBUTES ARE         
28545 *        BUILT DURING THIS PROCESS.                                       
28545 *      - THE MINIMUM INPUT REQUIRED TO RETRIEVE CURRENT RETAIL ARE        
28545 *        KEY DATES AND VALID IDENTIFIER PV-LOOKUP-TYPE                    
28545 *      - SET THE APPROPRIATE PV-LOOKUP-TYPE INDICATOR, BY SETTING         
28545 *        THE 88 LEVEL TO TRUE: ASKU, AUPC, AUPCID, AITM.                  
28545 *        IF NOTHING IS SET HERE, IT WILL SEARCH UNTIL IT FINDS            
28545 *        SKU, UPC-NBR, UPC-ID, ITM-NBR THE PROCESS CAN UTILIZE            
28545 *      - PRIOR TO ENTERING PROCEDURE DIVISION, MOVE DATA TO THE           
28545 *        APPROPRIATE FIELD CORRESPNDING TO THE SWITCH THAT WAS SET        
28545 *      - IF ADDITIONAL DATA IS AVAILABLE (ITM_NBR FOR SKU LOOKUP)         
28545 *        INCLUDE THIS AS WELL IN CASE THE FIRST CALL FAILED               
28545 *      - IF THE LOOKUP AT THE SPECIFIED LEVEL OR THE FIRST                
28545 *        ASSUMPTION LEVEL FAIL, THIS PROCESS WILL TRY AGAIN USING         
28545 *        THE ADDITIONAL DATA FIELD UNTIL ATTEMPTS ARE EXHAUSTED.          
28545 *                                                                         
28545 *      - ENTRY PROCEDURE: IN402-LOOKUP-ATTRIBUTES                         
28545 *                                                                         
28545 *      B.  ATTRIBUTES RESULTS.                                            
28545 *      - ON A SUCCESSFUL EXECUTION AND RETURN TO THE CALLING              
28545 *        PROGRAM, THE FOLLOWING DATA WILL BE RETURNED TO THE              
28545 *        FOLLOWING WORKING STORAGE FIELD.                                 
28545 *        (IN402-ATTRIB-RESULT-AREA)                                       
28545 *         -  SKU                                                          
28545 *         -  INTERNAL UPC ID                                              
28545 *         -  UPC                                                          
28545 *         -  ITEM NUMBER                                                  
28545 *         -  DEPARTMENT                                                   
28545 *         -  MAJOR CLASS                                                  
28545 *         -  SUB CLASS                                                    
28545 *         -  SKU STATUS CODE                                              
28545 *         -  MDSEAR ID                                                    
28545 *         -  RMS STYLE ID                                                 
28545 *         -  VENDOR STYLE ID                                              
28545 *         -  VENDOR STYLE NUMBER                                          
28545 *         -  INHOUSE NUMBER                                               
28545 *         -  DUNS NUMBER                                                  
28545 *         -  VENDOR ENT_ID (TVNDSTL)                                      
28545 *                                                                         
28545 *      C.  VENDOR ATTRIBUTES INPUT(S) BUILD.                              
28545 *      - AT AN INTERNAL UPC ID LEVEL, CAPTURE THE BRAND/VENDOR            
28545 *        LEVEL ATTRIBUTES. USE OF THE ITEM ATTRIBUTES INTR_UPC_ID         
28545 *        TO BUILD BRAND/VENDOR INFORMATION.                               
28545 *      - INPUT DATA REQUIREMENTS. (EFFECTIVE DATE/DEPARTMENT/VEND/        
28545 *        INTR_UPC_ID)                                                     
28545 *      - VENDOR ATTRIBUTES ARE BASED ON THE COPYCODE BVWS001 &            
28545 *        BVPD001.                                                         
28545 *                                                                         
28545 *      - ENTRY PROCEDURE: BV003-LOOKUP-MAIN                               
28545 *                                                                         
28545 *      D.  VENDOR ATTRIBUTES RESULTS.                                     
28545 *      - ON A SUCCESSFUL EXECUTION AND RETURN TO THE CALLING              
28545 *        PROGRAM, THE FOLLOWING DATA WILL BE RETURNED TO THE              
28545 *        FOLLOWING WORKING STORAGE FIELD.                                 
28545 *        (IN402-VENDOR-RESULT-AREA)                                       
28545 *         -  SKU                                                          
28545 *         -  INTERNAL UPC ID                                              
28545 *         -  UPC                                                          
28545 *         -  ITEM NUMBER                                                  
28545 *         -  DEPARTMENT                                                   
28545 *         -  VENDOR ENT_ID                                                
28545 *         -  MDSE_LO_LVL_ID                                               
28545 *         -  LBL_SEQ_NBR                                                  
28545 *                                                                         
28545 *IN ALL PRICE SCENARIOS, THE FOLLOWING HOLDS TRUE.                        
28545 *                                                                         
28545 *I.  PRICE LOOKUP RULES (PRICE LEVEL DETERMINATION)                       
28545 *  1.  VARIABLES TO PASS TO THE PRICE MODULE FOR PRICE LOOKUP.            
28545 *      A.  AT THE SOURCE MODULE LEVEL PASS EITHER THE SKU, UPC_NBR        
28545 *          INTR_UPC_ID, OR ITM_NBR.                                       
28545 *      B.  THE LOCATION NUMBER.                                           
28545 *      C.  EFFECTIVE DATE. INVENTORY - USE THE SOURCE MODULE DATE         
28545 *          REQUIREMENTS OR THE TINVPAR PLANNED INVENTORY DATE.            
28545 *          THE DEFAULT IS SYSTEM DATE)                                    
28545 *      D.  THE TYPE OF LOOKUP TO BE PERFORMED. IN INWS400, SEE THE        
28545 *          INPUT VARIABLE IN402-PV-LOOKUP-TYPE-IN FOR MORE DETAILS        
28545 *          VALID PRICE LEVEL LOOKUPS INCLUDE:                             
28545 *          I.   SKU     - IN402-PV-SKU-LOOKUP                             
28545 *          II.  UPC_NBR - IN402-PV-UPC-NBR-LOOKUP                         
28545 *          III. UPC_ID  - IN402-PV-INTR-UPC-ID-LOOKUP                     
28545 *          IV.  ITM_NBR - IN402-PV-ITM-NBR-LOOKUP                         
28545 *          V.   IF NOT DEFINED THE PRICE MODULE WILL ATTEMPT TO           
28545 *               LOCATE RICE BASED ON ITEM I.1.A. IF NOT FOUND,            
28545 *               ABEND....                                                 
28545 *                                                                         
28545 *  2.  USE VSM TABLES OR INVENTORY SKU/STYLE DELETE TABLE?                
28545 *                                                                         
28545 *  **** VSM -                                                             
28545 *  3.  VSM TABLE LOOKUP, STORE SPECIFIC - VALID SKU/UPC/UPC_ID/           
28545 *      ITM_NBR, STORE, EFF BEG/END DATE RANGE.                            
28545 *  4.  VSM TABLE LOOKUP, CORPORATE - VALID SKU/UPC/UPC_ID/ITEM,           
28545 *      STORE, EFF BEG/END DATE RANGE.                                     
28545 *  5.  NO MATCH VSM TABLE LOOKUP, PERM HISTORY, STORE SPECIFIC -          
28545 *      VALID ITEM, LOCATION.                                              
28545 *  6.  NO MATCH VSM TABLE LOOKUP, PERM HISTORY, CORPORATE - VALID         
28545 *      ITEM, LOCATION.                                                    
28545 *  7.  ATTRIBUTE LOOKUP INCLUDES:                                         
28545 *      A.  VSM ATTRIBUTES.                                                
28545 *      B.  MBS ATTRIBUTES.                                                
28545 *      C.  BRAND/VENDOR ATTRIBUTES.                                       
28545 *                                                                         
28545 *  **** INVENTORY SKU/STYLE DELETE -                                      
28545 *  8.  INVENTORY SKU/STYLE DELETE TABLE, STORE SPECIFIC - VALID           
28545 *      SKU/UPC_ID/UPC_NBR/ITEM, STORE, EFF BEG/END DATE RANGE.            
28545 *  9.  INVENTORY SKU/STYLE DELETE TABLE, CORPORATE - VALID SKU/           
28545 *      UPC_NBR/UPC_ID/ITEM, STORE, EFF BEG/END DATE RANGE.                
28545 *  10. BOTH PRICE AND ATTRIBUTE LOOKUP IS CAPTURED WHEN USING THE         
28545 *      INVENTORY SKU/STYLE DELETE.                                        
28545 *      A.  VSM ATTRIBUTES.                                                
28545 *      B.  MBS ATTRIBUTES.                                                
28545 *      C.  BRAND/VENDOR ATTRIBUTES.                                       
28545 *                                                                         
28545 *  11. ERROR HANDLING PASSED TO THE SOURCE MODULE.                        
28545 *                                                                         
28545 *II. ATTRIBUTE LOOKUP RULES (PRICE LEVEL DETERMINATION)                   
28545 *  1.  VARIABLES TO PASS TO THE PRICE MODULE FOR ATTRIBUTE LOOKUP.        
28545 *      A.  AT THE SOURCE MODULE LEVEL PASS EITHER THE SKU, UPC_NBR        
28545 *          INTR_UPC_ID, OR ITM_NBR.                                       
28545 *      B.  THE LOCATION NUMBER.                                           
28545 *      C.  EFFECTIVE DATE. INVENTORY - USE THE SOURCE MODULE DATE         
28545 *          REQUIREMENTS OR THE TINVPAR PLANNED INVENTORY DATE.            
28545 *          THE DEFAULT IS SYSTEM DATE)                                    
28545 *      D.  THE TYPE OF LOOKUP TO BE PERFORMED. IN INWS400, SEE THE        
28545 *          INPUT VARIABLE IN402-PV-LOOKUP-TYPE-IN FOR MORE DETAILS        
28545 *          VALID ATTRIBUTE LEVEL LOOKUPS INCLUDE:                         
28545 *          I.   SKU     - IN402-PV-SKU-ATTRIB-LOOK                        
28545 *          II.  UPC_NBR - IN402-PV-UPC-NBR-ATTRIB-LOOK                    
28545 *          III. UPC_ID  - IN402-PV-INTUPCID-ATTRIB-LOOK                   
28545 *          IV.  ITM_NBR - IN402-PV-ITEM-ATTRIB-LOOK                       
28545 *          V.   IF NOT DEFINED THE PRICE MODULE WILL ATTEMPT TO           
28545 *               LOCATE, ATTRIBUTES BASED ON ITEM II.1.A. IF NOT           
28545 *               FOUND, ABEND.....                                         
28545 *                                                                         
28545 *  2.  USE VSM TABLES OR INVENTORY SKU/STYLE DELETE TABLE?                
28545 *                                                                         
28545 *  **** VSM -                                                             
28545 *  3.  VSM TABLE LOOKUP - VALID SKU/UPC/UPC_ID/ITEM,                      
28545 *      STORE, DATE RANGES.                                                
28545 *  4.  NO MATCH VSM TABLE LOOKUP - ZERO OUT ATTRIBUTES AND PERFORM        
28545 *      ERROR HANDLING.                                                    
28545 *  5.  ATTRIBUTE LOOKUP INCLUDES:                                         
28545 *      A.  VSM ATTRIBUTES.                                                
28545 *      B.  MBS ATTRIBUTES.                                                
28545 *      C.  BRAND/VENDOR ATTRIBUTES.                                       
28545 *                                                                         
28545 *  **** INVENTORY SKU/STYLE DELETE -                                      
28545 *  6.  INVENTORY SKU/STYLE DELETE TABLE, STORE SPECIFIC - VALID           
28545 *      SKU/UPC_NBR/UPC_ID/ITEM, STORE, EFF BEG/END DATE RANGE.            
28545 *  7.  INVENTORY SKU/STYLE DELETE TABLE, CORPORATE - VALID SKU/           
28545 *      IPC_NBR/UPC_ID/ITEM, STORE, EFF BEG/END DATE RANGE.                
28545 *  8.  BOTH PRICE AND ATTRIBUTE LOOKUP IS CAPTURED WHEN USING THE         
28545 *      INVENTORY SKU/STYLE DELETE.                                        
28545 *      A.  VSM ATTRIBUTES.                                                
28545 *      B.  MBS ATTRIBUTES.                                                
28545 *      C.  BRAND/VENDOR ATTRIBUTES.                                       
28545 *                                                                         
28545 *  9.  ERROR HANDLING PASSED TO THE SOURCE MODULE.                        
28545 *                                                                         
28545 ******************************************************************        
                                                                                
       01  IN402-PV-PROGRAM-VARIABLE.                                           
           05  IN402-PV-MAX-RETRIES    PIC S9(03) VALUE +03 COMP-3.     INKUT102
           05  IN402-PV-INPUT-AREA.                                             
               10  IN402-PV-LOOKUP-TYPE-IN PIC X(06)   VALUE SPACES.            
                   88  IN402-PV-NO-LOOKUP-TYPE         VALUE SPACES.            
28545                                                                           
28545              88  IN402-PV-PRICE-LOOKUP           VALUES                   
28545                  'SKU   ', 'UPC   ', 'UPCID ', 'ITM   '.                  
                   88  IN402-PV-SKU-LOOKUP             VALUE 'SKU   '.          
                   88  IN402-PV-UPC-NBR-LOOKUP         VALUE 'UPC   '.          
                   88  IN402-PV-INTR-UPC-ID-LOOKUP     VALUE 'UPCID '.          
                   88  IN402-PV-ITM-NBR-LOOKUP         VALUE 'ITM   '.          
28545                                                                           
28545              88  IN402-PV-ATTRIBUTE-LOOKUP       VALUES                   
28545                  'ASKU  ', 'AUPC  ', 'AUPCID', 'AITM  '.                  
28545              88  IN402-PV-SKU-ATTRIB-LOOK        VALUE 'ASKU  '.          
28545              88  IN402-PV-UPC-NBR-ATTRIB-LOOK    VALUE 'AUPC  '.          
28545              88  IN402-PV-INTUPCID-ATTRIB-LOOK   VALUE 'AUPCID'.          
28545              88  IN402-PV-ITEM-ATTRIB-LOOK       VALUE 'AITM  '.          
RONNA              88  IN402-PV-SKU-ASKU-LOOK          VALUES                   
RONNA                  'SKU   ', 'ASKU  '.                                      
RONNA              88  IN402-PV-UPC-AUPC-LOOK          VALUES                   
RONNA                  'UPC   ', 'AUPC  '.                                      
RONNA              88  IN402-PV-UPCID-AUPCID-LOOK      VALUES                   
RONNA                  'UPCID ', 'AUPCID'.                                      
RONNA              88  IN402-PV-ITM-AITM-LOOK          VALUES                   
28545                  'ITM   ', 'AITM  '.                                      
28545                                                                           
28545          10  IN402-PV-EFF-BEG-DTE-IN.                                     
28545              15  IN402-PV-EFF-BEG-DTE-CCYY PIC X(04).                     
28545              15  FILLER                    PIC X(01).                     
28545              15  IN402-PV-EFF-BEG-DTE-MM   PIC X(02).                     
28545              15  FILLER                    PIC X(01).                     
28545              15  IN402-PV-EFF-BEG-DTE-DD   PIC X(02).                     
28545          10  IN402-PV-EFF-BEG-DTE-X REDEFINES                             
28545              IN402-PV-EFF-BEG-DTE-IN       PIC X(10).                     
28545                                                                           
28545          10  IN402-PV-EFF-END-DTE-IN.                                     
28545              15  IN402-PV-EFF-END-DTE-CCYY PIC X(04).                     
28545              15  FILLER                    PIC X(01).                     
28545              15  IN402-PV-EFF-END-DTE-MM   PIC X(02).                     
28545              15  FILLER                    PIC X(01).                     
28545              15  IN402-PV-EFF-END-DTE-DD   PIC X(02).                     
28545          10  IN402-PV-EFF-END-DTE-X REDEFINES                             
28545              IN402-PV-EFF-END-DTE-IN       PIC X(10).                     
28545                                                                           
28545          10  IN402-CONVERT-LOC       PIC 9(05) VALUE ZEROS.               
               10  IN402-PV-LOC-IN         PIC X(05) VALUE SPACES.              
               10  IN402-PV-LOC-IN-NUM REDEFINES                                
                   IN402-PV-LOC-IN         PIC 9(05).                           
28545                                                                           
               10  IN402-PV-SKU-IN         PIC X(08) VALUE SPACES.              
               10  IN402-PV-SKU-IN-NUM REDEFINES                                
                   IN402-PV-SKU-IN         PIC 9(08).                           
               10  FILLER REDEFINES IN402-PV-SKU-IN.                            
                   15  FILLER              PIC X(05).                           
                   15  FILLER              PIC X(03).                           
                       88  IN402-PV-DUMMY-SKU    VALUES '000' '999'.            
28545                                                                           
               10  IN402-PV-UPC-NBR-IN     PIC X(15) VALUE SPACES.              
               10  IN402-PV-UPC-NBR-IN-NUM REDEFINES                            
                   IN402-PV-UPC-NBR-IN     PIC 9(15).                           
D28545         10  FILLER REDEFINES IN402-PV-UPC-NBR-IN.                        
D28545             15  FILLER                    PIC X(02).                     
D28545             15  IN402-PV-UPC-NBR-KOHL-UPC PIC X(04).                     
D28545                 88  IN402-PV-KOHLS-UPC    VALUES '0400'.                 
D28545             15  IN402-PV-UPC-SKU.                                        
                       20  FILLER                PIC X(05).                     
                       20  FILLER                PIC X(03).                     
I28545                     88  IN402-PV-DUMMY-UPC VALUES '000'.                 
D28545             15  IN402-PV-UPC-SKU-9 REDEFINES                             
D28545                 IN402-PV-UPC-SKU        PIC 9(08).                       
D28545             15  IN402-PV-UPC-CHK-DIGIT    PIC X(01).                     
D28545                                                                          
                                                                                
      *  HAD TO DEFINE INTR-UPC-ID AS 10 DIGITS AND REDEFINES AS SHOWN          
      *  BECAUSE S9(9) CAN ACTUALLY HOLD 10 DIGITS UP TO A CERTAIN              
      *  POINT.  MOVING THE FIELD FROM DB2 DCLGEN TO A S9(9) WILL               
      *  TRUNCATE THE LEFT MOST DIGIT, SO DEFINING AS BELOW WILL                
      *  PREVENT TRUNCATION.                                                    
               10  IN402-PV-UPC-ID-IN      PIC S9(10) COMP VALUE ZEROS.         
               10  IN402-PV-UPC-ID-IN-X REDEFINES                               
                   IN402-PV-UPC-ID-IN.                                          
                    15  FILLER             PIC X(04).                           
                    15  IN402-PV-UPC-ID-4  PIC X(04).                           
                    15  IN402-PV-UPC-ID-SPC REDEFINES                           
                        IN402-PV-UPC-ID-4  PIC S9(9) COMP.                      
28545                                                                           
               10  IN402-PV-ITM-NBR-IN     PIC X(15) VALUE SPACES.              
               10  IN402-PV-ITM-NBR-IN-NUM REDEFINES                            
                   IN402-PV-ITM-NBR-IN     PIC 9(15).                           
28545                                                                           
28545          10  IN402-PV-EFF-DTE-IN     PIC X(10) VALUE SPACES.              
28545          10  IN402-PV-ENT-ID-IN      PIC X(09) VALUE SPACES.              
28545          10  IN402-PV-ENT-ID-IN-9 REDEFINES                               
28545              IN402-PV-ENT-ID-IN      PIC 9(09).                           
28545                                                                           
28545          10  IN402-PV-INHOUSE-NBR-IN PIC X(03) VALUE SPACES.              
28545          10  IN402-PV-INHOUSE-NBR-IN-9 REDEFINES                          
28545              IN402-PV-INHOUSE-NBR-IN PIC 9(03).                           
28545                                                                           
28545          10  IN402-PV-DEPT-IN        PIC X(04)       VALUE SPACES.        
28545          10  IN402-PV-DEPT-IN-9 REDEFINES IN402-PV-DEPT-IN                
28545                                      PIC 9(04).                           
28545          10  FILLER REDEFINES IN402-PV-DEPT-IN.                           
28545              15  FILLER              PIC X(01).                           
28545              15  IN402-PV-DEPT-IN-3X PIC X(03).                           
28545              15  IN402-PV-DEPT-IN-3X-9 REDEFINES                          
28545                  IN402-PV-DEPT-IN-3X PIC 9(03).                           
28545                                                                           
28545      05  IN402-PV-COMMON-AREA.                                            
               10  IN402-PV-SQL-SUB        PIC 9(03)  VALUE ZERO.       INKUT102
               10  IN402-PV-RETURN-STATUS-AREA.                                 
D28545             15  IN402-PV-PRC-SQLCDE PIC S9(9) COMP-4 VALUE ZEROS.        
                   15  IN402-PV-RETURN-CDE PIC S9(04) COMP VALUE ZEROS.         
                       88  IN402-PV-FOUND             VALUES ZEROS, +04.        
                       88  IN402-PV-FOUND-AS-REQUESTED     VALUE ZEROS.         
                       88  IN402-PV-FOUND-WITH-ASSUMPTION  VALUE +04.           
                       88  IN402-PV-NOT-FOUND              VALUE +08.           
                       88  IN402-PV-SQL-ERROR              VALUE +16.           
D28545             15  IN402-PV-ATT-SQLCDE PIC S9(9) COMP-4 VALUE ZEROS.        
D28545             15  IN402-PV-ATT-RTNCDE PIC S9(04) COMP VALUE ZEROS.         
D28545                 88  IN402-PV-ATT-FOUND         VALUES ZEROS, +04.        
D28545                 88  IN402-PV-ATT-FOUND-AS-RQSTD     VALUE ZEROS.         
D28545                 88  IN402-PV-ATT-FOUND-WITH-ASSMPT  VALUE +04.           
D28545                 88  IN402-PV-ATT-NOT-FOUND          VALUE +08.           
D28545                 88  IN402-PV-ATT-SQL-ERROR          VALUE +16.           
RONNA              15  IN402-PV-DBV-SQLCDE PIC S9(9) COMP-4 VALUE ZEROS.        
RONNA              15  IN402-PV-DBV-RTNCDE PIC S9(04) COMP VALUE +8.            
RONNA                  88  IN402-PV-DBV-FOUND         VALUES ZEROS, +04.        
RONNA                  88  IN402-PV-DBV-FOUND-AS-RQSTD     VALUE ZEROS.         
RONNA                  88  IN402-PV-DBV-FOUND-WITH-ASSMPT  VALUE +04.           
RONNA                  88  IN402-PV-DBV-NOT-FOUND          VALUE +08.           
RONNA                  88  IN402-PV-DBV-SQL-ERROR          VALUE +16.           
                   15  IN402-PV-RETURN-RSN PIC X(40)       VALUE SPACES.        
D28545*** ANY NEW 'ERROR RELATED' IN402-PV-RETURN-RSN NEED TO INCLUDED          
D28545*** IN THE IN402-PV-INVALID-KEY-INPUT LEVEL 88...                         
                       88  IN402-PV-INVALID-KEY-INPUT      VALUES ARE           
D28545                     'CANNOT DETERMINE RETAIL BASED ON INPUT  ',          
D28545                     'THE REQUIRED DATE IS MISSING OR INVALID ',          
D28545                     'THE LOCATION IS MISSING OR INVALID      ',          
D28545                     'NOT ENOUGH INFORMATION TO FIND RETAIL   ',          
D28545                     'RETURN ENT-ID GIVEN IN THE REQUEST      ',          
D28545                     'CANNOT DETERMINE ASSUMPTION RULE        ',          
D28545                     'CURSOR OPEN ISSUE                       ',          
D28545                     'CURSOR FETCH ISSUE                      ',          
D28545                     'CURSOR CLOSE ISSUE                      ',          
D28545                     'MBS ATTRIBUTE LOOKUP ISSUE              ',          
D28545                     'BRAND ATTRIBUTE LOOKUP ISSUE            ',          
D28545                     'VSM ATTRIBUTE LOOKUP ISSUE              ',          
D28545                     'DEADLOCK ERROR - ATTRIBUTES             ',          
D28545                     'DEADLOCK ERROR - PRICE                  ',          
D28545                     'DUMMY UPC IS NOT PRESENT                ',          
D28545                     'DUMMY SKU IS NOT PRESENT                ',          
D28545                     'AN UNDEFINED SQLCODE ERROR IS PRESENT   ',          
D28545                     'PLU ATTRIBUTE LOOKUP ISSUE              ',          
J28545                     'INVENTORY RECLASS ISSUE                 '.          
D28545*** VALID RETURN MESSAGES....                                             
D28545                 88  IN402-PV-DUMMY-SKU-VALID        VALUE                
D28545                     'DUMMY SKU IS PRESENT                    '.          
D28545                 88  IN402-PV-DUMMY-UPC-VALID        VALUE                
D28545                     'DUMMY UPC IS PRESENT                    '.          
E28545                 88  IN402-PV-RENUMBER-SKU           VALUE                
E28545                     'RENUMBER SKU IS FOUND                   '.          
                       88  IN402-PV-TRY-SKU-LOOKUP         VALUE                
                           'TRY TO LOOKUP USING SKU                 '.          
                       88  IN402-PV-TRY-UPC-NBR-LOOKUP     VALUE                
                           'TRY TO LOOKUP USING UPC-NBR             '.          
                       88  IN402-PV-TRY-UPC-ID-LOOKUP      VALUE                
                           'TRY TO LOOKUP USING INTR-UPC-ID         '.          
                       88  IN402-PV-TRY-ITM-NBR-LOOKUP     VALUE                
                           'TRY TO LOOKUP USING ITM-NBR             '.          
D28545*** INVALID "ERROR" RETURN MESSAGES....                                   
                       88  IN402-PV-INVALID-EFF-BEG-DTE    VALUE                
                           'THE REQUIRED DATE IS MISSING OR INVALID '.          
                       88  IN402-PV-INVALID-LOCATION       VALUE                
                           'THE LOCATION IS MISSING OR INVALID      '.          
                       88  IN402-PV-MISSING-KEY-DATA       VALUE                
                           'NOT ENOUGH INFORMATION TO FIND RETAIL   '.          
28545                  88  IN402-PV-ENT-ID-GIVEN           VALUE                
28545                      'RETURN ENT-ID GIVEN IN THE REQUEST      '.          
28545                  88  IN402-PV-FAIL-ASSUMPTION-RULE   VALUE                
28545                      'CANNOT DETERMINE ASSUMPTION RULE        '.          
D28545                 88  IN402-PV-CURSOR-OPEN            VALUE                
D28545                     'CURSOR OPEN ISSUE                       '.          
D28545                 88  IN402-PV-CURSOR-FETCH           VALUE                
D28545                     'CURSOR FETCH ISSUE                      '.          
D28545                 88  IN402-PV-CURSOR-CLOSE           VALUE                
D28545                     'CURSOR CLOSE ISSUE                      '.          
D28545                 88  IN402-PV-MBS-LOOKUP             VALUE                
D28545                     'MBS ATTRIBUTE LOOKUP ISSUE              '.          
D28545                 88  IN402-PV-BRAND-LOOKUP           VALUE                
D28545                     'BRAND ATTRIBUTE LOOKUP ISSUE            '.          
D28545                 88  IN402-PV-VSM-LOOKUP             VALUE                
D28545                     'VSM ATTRIBUTE LOOKUP ISSUE              '.          
J28545                 88  IN402-PV-INV-RCLSS-LOOKUP       VALUE                
J28545                     'INVENTORY RECLASS ISSUE                 '.          
D28545                 88  IN402-PV-PLU-LOOKUP             VALUE                
D28545                     'PLU ATTRIBUTE LOOKUP ISSUE              '.          
D28545                 88  IN402-PV-DEADLOCK-ATTRIB        VALUE                
D28545                     'DEADLOCK ERROR - ATTRIBUTES             '.          
D28545                 88  IN402-PV-DEADLOCK-PRICE         VALUE                
D28545                     'DEADLOCK ERROR - PRICE                  '.          
D28545                 88  IN402-PV-DUMMY-SKU-ERR          VALUE                
D28545                     'DUMMY SKU IS NOT PRESENT                '.          
D28545                 88  IN402-PV-DUMMY-UPC-ERR          VALUE                
D28545                     'DUMMY UPC IS NOT PRESENT                '.          
D28545             15  IN402-PV-PARAGRAPH  PIC X(100) VALUE SPACES.             
D28545                                                                          
28545          10  IN402-PV-NULL-AREA.                                          
28545              15  IN402-PV-NULL-EFF-END-TMST                               
28545                                   PIC S9(04) COMP SYNC VALUE 0.           
28545              15  IN402-PV-NULL-UPC-STAT-CDE                               
28545                                   PIC S9(04) COMP SYNC VALUE 0.           
28545              15  IN402-PV-NULL-UNT-COST-AMT                               
28545                                   PIC S9(04) COMP SYNC VALUE 0.           
28545              15  IN402-PV-NULL-UNT-RTL-AMT                                
28545                                   PIC S9(04) COMP SYNC VALUE 0.           
28545              15  IN402-PV-NULL-MEITGP-NBR                                 
28545                                   PIC S9(04) COMP SYNC VALUE 0.           
28545              15  IN402-PV-NULL-ORIG-CLR-DTE                               
28545                                   PIC S9(04) COMP SYNC VALUE 0.           
28545              15  IN402-PV-NULL-MKDN-CDE                                   
28545                                   PIC S9(04) COMP SYNC VALUE 0.           
28545              15  IN402-PV-NULL-VS-ID                                      
28545                                   PIC S9(04) COMP SYNC VALUE 0.           
J28545             15  IN402-PV-NULL-ID PIC S9(04) COMP SYNC VALUE 0.           
D28545                                                                          
               10  IN402-PS-LOOKUP-SWITCHES.                                    
                   15  IN402-PS-STR-ROW-FOUND-SW PIC X(01)  VALUE 'Y'.          
                       88  IN402-PS-STR-NOT-FOUND           VALUE 'N'.          
                       88  IN402-PS-STR-FOUND               VALUE 'Y'.          
                   15  IN402-PS-RETAIL-FOUND-SW  PIC X(01)  VALUE 'Y'.          
                       88  IN402-PS-RTL-NOT-FOUND           VALUE 'N'.          
                       88  IN402-PS-RTL-FOUND               VALUE 'Y'.          
RONNA              15  IN402-PS-BVUTIL-FOUND-SW  PIC X(01)  VALUE 'N'.          
RONNA                  88  IN402-PS-BVUTIL-NOT-FOUND        VALUE 'N'.          
RONNA                  88  IN402-PS-BVUTIL-FOUND            VALUE 'Y'.          
RONNA              15  IN402-PS-DBV-ASSUMP-SW    PIC S9(4)  VALUE +0.           
RONNA                  88  IN402-PS-DBV-NO-ASSUMP           VALUE +0.           
RONNA                  88  IN402-PS-DBV-ASSUMP              VALUES              
RONNA                      +1, +2, +3.                                          
RONNA                  88  IN402-PS-DBV-DEPT-ASSUMP         VALUES              
RONNA                      +1, +3.                                              
RONNA                  88  IN402-PS-DBV-ENT-ID-ASSUMP       VALUES              
RONNA                      +2, +3.                                              
D28545             15  IN402-PS-ATTRIB-FOUND-SW  PIC X(01)  VALUE 'N'.          
D28545                 88  IN402-PS-ATTR-NOT-FOUND          VALUE 'N'.          
D28545                 88  IN402-PS-ATTR-FOUND              VALUE 'Y'.          
D28545             15  IN402-PS-DUMMY-SKU-SW     PIC X(01)  VALUE 'N'.          
D28545                 88  IN402-PS-DUMMY-SKU               VALUE 'Y'.          
E28545             15  IN402-PS-RENUM-SKU-SW     PIC X(01)  VALUE 'N'.          
E28545                 88  IN402-PS-RENUMBER-SKU            VALUE 'Y'.          
28545              15  IN402-PS-END-TPPCPRC-CSR-SW PIC X(1) VALUE 'N'.          
28545                  88  IN402-PS-END-TPPCPRC-CSR         VALUE 'Y'.          
28545              15  IN402-PS-END-SKUSTYL-CSR-SW PIC X(1) VALUE 'N'.          
28545                  88  IN402-PS-END-SKUSTYL-CSR         VALUE 'Y'.          
J28545             15  IN402-PS-RECLASS-FOUND-SW PIC X(1)   VALUE 'N'.          
J28545                 88  IN402-PS-RECLASS-FOUND           VALUE 'Y'.          
28545              15  IN402-PS-PRIOR-FOUND-SW PIC X(01)    VALUE 'N'.          
28545                  88  IN402-PRIOR-FOUND                VALUE 'Y'.          
28545                  88  IN402-PRIOR-NOT-FOUND            VALUE 'N'.          
28545                                                                           
28545      05  IN402-PRICE-RESULT-AREA.                                         
28545          10  IN402-PRC-EFF-BEG-DTE-OUT PIC X(10) VALUE SPACES.            
28545          10  IN402-PRC-EFF-END-DTE-OUT PIC X(10) VALUE SPACES.            
28545          10  IN402-PRC-SKU-OUT     PIC S9(8)V COMP-3 VALUE ZEROS.         
28545          10  IN402-PRC-UPCID-OUT   PIC S9(9) COMP VALUE ZEROS.            
28545          10  IN402-PRC-UPC-OUT     PIC S9(15)V COMP-3 VALUE ZEROS.        
28545          10  IN402-PRC-ITM-NBR-OUT PIC S9(15)V COMP-3 VALUE ZEROS.        
28545          10  IN402-PRC-STATUS-OUT  PIC X(02) VALUE SPACES.                
28545          10  IN402-PRC-UPC-CHG-DTE-OUT  PIC X(10) VALUE SPACES.           
28545          10  IN402-PRC-STAT-CHG-DTE-OUT PIC X(10) VALUE SPACES.           
28545          10  IN402-PRC-MEITGP-NBR  PIC S9(9) COMP VALUE ZEROS.            
28545          10  IN402-PRC-MITGPL-QTY  PIC S9(4) COMP VALUE ZEROS.            
28545          10  IN402-PRC-GP-AMT      PIC S9(5)V9(2) COMP-3                  
28545                                                    VALUE ZEROES.          
28545          10  IN402-PRC-UNIT-RTL-OUT PIC S9(7)V9(2) COMP-3                 
28545                                                    VALUE ZEROES.          
28545          10  IN402-PRC-EXTD-RTL-OUT PIC S9(13)V9(2) COMP-3                
28545                                                    VALUE ZEROES.          
28545          10  IN402-PRC-ORIG-CLR-DTE PIC X(10) VALUE SPACES.               
28545          10  IN402-PRC-MKDN-CDE     PIC X(1) VALUE SPACES.                
E28545         10  IN402-PV-PRC-RENUM-STAT-CDE PIC X(02) VALUE SPACES.          
E28545         10  FILLER                 PIC X(147) VALUE SPACES.              
28545                                                                           
28545      05  IN402-ATTRIB-RESULT-AREA.                                        
28545          10  IN402-ATT-SKU-OUT     PIC S9(8)V COMP-3 VALUE ZEROS.         
28545          10  IN402-ATT-UPCID-OUT   PIC S9(9)   COMP VALUE ZEROS.          
28545          10  IN402-ATT-UPC-OUT     PIC S9(15)V COMP-3 VALUE ZEROS.        
28545          10  IN402-ATT-ITM-NBR-OUT PIC S9(15)V COMP-3 VALUE ZEROS.        
28545          10  IN402-ATT-DEPT-OUT    PIC S9(4)V COMP-3 VALUE ZEROS.         
28545          10  IN402-ATT-MCL-OUT     PIC S9(4)V COMP-3 VALUE ZEROS.         
28545          10  IN402-ATT-SCL-OUT     PIC S9(4)V COMP-3 VALUE ZEROS.         
28545          10  IN402-ATT-STATUS-OUT  PIC X(02) VALUE SPACES.                
28545          10  IN402-ATT-MDEAR-ID-OUT PIC S9(08) COMP-3 VALUE ZEROS.        
28545          10  IN402-ATT-STYL-ID-OUT PIC S9(8)V COMP-3 VALUE ZEROS.         
28545          10  IN402-ATT-VS-ID-OUT   PIC S9(09) COMP VALUE ZEROS.           
28545          10  IN402-ATT-VS-NBR-OUT    PIC X(20) VALUE SPACES.              
28545          10  IN402-ATT-ENT-ID-OUT    PIC S9(09) COMP VALUE ZEROS.         
28545          10  IN402-ATT-INHSE-NBR-OUT PIC S9(09) COMP VALUE ZEROS.         
28545          10  IN402-ATT-DUNS-NBR-OUT  PIC S9(09) COMP VALUE ZEROS.         
28545          10  IN402-ATT-GMA-NBR       PIC X(02) VALUE SPACES.              
28545          10  IN402-ATT-DMA-NBR       PIC X(02) VALUE SPACES.              
28545          10  IN402-ATT-BYR-NBR       PIC X(03) VALUE SPACES.              
28545          10  IN402-ATT-GMM-LAST-NAME PIC X(18) VALUE SPACES.              
28545          10  IN402-ATT-GMM-FIR-NAME  PIC X(12) VALUE SPACES.              
28545          10  IN402-ATT-DMM-LAST-NAME PIC X(18) VALUE SPACES.              
28545          10  IN402-ATT-DMM-FIR-NAME  PIC X(12) VALUE SPACES.              
28545          10  IN402-ATT-BYR-LAST-NAME PIC X(18) VALUE SPACES.              
28545          10  IN402-ATT-BYR-FIR-NAME  PIC X(12) VALUE SPACES.              
D28545         10  IN402-ATT-PLU-DWNLD-IND PIC X(1) VALUE SPACES.               
E28545         10  IN402-PV-ATT-RENUM-STAT-CDE PIC X(02) VALUE SPACES.          
E28545         10  IN402-ATT-MDSEAR-DESC   PIC X(25) VALUE SPACES.              
RONNA          10  IN402-ATT-LBL-SEQ-NBR-OUT PIC S9(4) COMP VALUE ZEROS.        
E28545         10  FILLER                  PIC X(41) VALUE SPACES.              
28545                                                                           
28545      05  IN402-VENDOR-RESULT-AREA.                                        
28545          10  IN402-VND-SKU-OUT     PIC S9(8)V COMP-3 VALUE ZEROS.         
28545          10  IN402-VND-ITM-NBR-OUT PIC S9(15)V COMP-3 VALUE ZEROS.        
28545          10  IN402-VND-UPCID-OUT   PIC S9(9)   COMP VALUE ZEROS.          
28545          10  IN402-VND-UPC-OUT     PIC S9(15)V COMP-3 VALUE ZEROS.        
28545          10  IN402-VND-DEPT-OUT    PIC S9(4)V COMP-3 VALUE ZEROS.         
28545          10  IN402-VND-ENT-ID-OUT  PIC S9(09) COMP VALUE ZEROS.           
28545          10  IN402-VND-ML-LO-MDSE-LVL-ID                                  
28545                                    PIC S9(9) COMP VALUE ZEROS.            
28545          10  IN402-VND-LBL-SEQ-NBR PIC S9(4) COMP VALUE ZEROS.            
28545          10  FILLER                PIC X(212) VALUE SPACES.               
28545                                                                           
           05  IN402-PV-WORK-AREA.                                              
J28545         10  IN402-PV-MIN-RECLS-TMST  PIC X(26) VALUE SPACES.             
               10  IN402-PV-WORK-RETAIL  PIC S9(7)V9(2) COMP-3                  
                                                      VALUE ZEROS.              
28545          10  IN402-PV-MITGPL-QTY   PIC S9(4) COMP.                        
28545          10  IN402-PV-MITGPL-GP-AMT PIC S9(5)V9(2) COMP-3.                
               10  IN402-PV-WORK-SKU     PIC S9(08)V COMP-3 VALUE ZEROS.        
D28545         10  IN402-PV-DUMB-SKU     PIC 9(08)          VALUE ZEROS.        
D28545         10  IN402-PV-DUMB-SKU-X REDEFINES                                
D28545             IN402-PV-DUMB-SKU     PIC X(08).                             
               10  IN402-PV-WORK-UPC-NBR PIC S9(15)V COMP-3 VALUE ZEROS.        
               10  IN402-PV-WORK-UPC-ID  PIC S9(09) COMP VALUE ZEROS.           
               10  IN402-PV-WORK-ITM-NBR PIC S9(15)V COMP-3 VALUE ZEROS.        
                                                                                
28545          10  IN402-CONVERT-MCL           PIC 9(04) VALUE ZEROS.           
28545          10  IN402-PV-WORK-MCL           PIC X(04) VALUE SPACES.          
28545          10  IN402-PV-WORK-MCL-9 REDEFINES                                
28545              IN402-PV-WORK-MCL           PIC 9(04).                       
28545          10  FILLER REDEFINES IN402-PV-WORK-MCL.                          
28545              15  FILLER                  PIC X(01).                       
28545              15  IN402-PV-WORK-MCL-3X    PIC X(03).                       
28545              15  IN402-PV-WORK-MCL-3X-9 REDEFINES                         
28545                  IN402-PV-WORK-MCL-3X    PIC 9(03).                       
28545          10  FILLER2 REDEFINES IN402-PV-WORK-MCL.                         
28545              15  FILLER                  PIC X(02).                       
28545              15  IN402-PV-WORK-MCL-2X    PIC X(02).                       
28545              15  IN402-PV-WORK-MCL-2X-9 REDEFINES                         
28545                  IN402-PV-WORK-MCL-2X    PIC 9(02).                       
                                                                                
28545          10  IN402-CONVERT-DEPT          PIC 9(04) VALUE ZEROS.           
               10  IN402-PV-WORK-DEPT          PIC X(04) VALUE SPACES.          
               10  IN402-PV-WORK-DEPT-9 REDEFINES                               
                   IN402-PV-WORK-DEPT          PIC 9(04).                       
               10  FILLER REDEFINES IN402-PV-WORK-DEPT.                         
                   15  FILLER                  PIC X(01).                       
                   15  IN402-PV-WORK-DEPT-3X   PIC X(03).                       
                   15  IN402-PV-WORK-DEPT-3X-9 REDEFINES                        
                       IN402-PV-WORK-DEPT-3X   PIC 9(03).                       
                                                                                
28545          10  IN402-CONVERT-SCL           PIC 9(04) VALUE ZEROS.           
               10  IN402-PV-WORK-SCL           PIC X(04) VALUE SPACES.          
               10  IN402-PV-WORK-SCL-9 REDEFINES                                
                   IN402-PV-WORK-SCL           PIC 9(04).                       
               10  FILLER REDEFINES IN402-PV-WORK-SCL.                          
                   15  FILLER                  PIC X(01).                       
                   15  IN402-PV-WORK-SCL-3X    PIC X(03).                       
                   15  IN402-PV-WORK-SCL-3X-9 REDEFINES                         
                       IN402-PV-WORK-SCL-3X    PIC 9(03).                       
                                                                                
               10  IN402-PV-WORK-INHOUSE PIC S9(03)V COMP-3 VALUE ZEROS.        
                                                                                
           05  IN402-CONVERT-UPC         PIC S9(15) COMP VALUE ZEROES.          
           05  IN402-CONVERT-UPC-9       PIC 9(15) VALUE ZEROES.                
                                                                                
           05  IN402-TEMP-UPC.                                                  
               10  FILLER                    PIC 9(02).                         
               10  IN402-TEMP-UPC-KOHL-UPC   PIC 9(04).                         
               10  IN402-TEMP-UPC-SKU        PIC 9(08).                         
               10  IN402-TEMP-UPC-CHK-DIGIT  PIC 9(01).                         
                                                                                
           05  IN402-PV-EFF-BEG-DTE-TMST.                                       
               10  IN402-PV-EFF-BEG-DTE    PIC  X(10) VALUE SPACES.             
               10  FILLER                  PIC  X(16) VALUE                     
                                                 '-23.59.59.999999'.            
                                                                                
28545      05  IN402-PV-EFF-END-DTE-TMST.                                       
28545          10  IN402-PV-EFF-END-DTE    PIC  X(10) VALUE SPACES.             
28545          10  FILLER                  PIC  X(16) VALUE                     
28545                                            '-23.59.59.999999'.            
28545                                                                   INKUT102
28545 ******************************************************************        
28545 * COPYBOOK - BRAND VENDOR MODULE                                          
28545 ******************************************************************        
W31475*    COPY BVWS001.                                                        
W31475     COPY BVWS003.                                                        
