      *****************************************************************         
      *    INWS050 - THIS WORKING STORAGE COPYBOOK MEMBER IS USED IN            
      *              CONJUNCTION WITH INPD050 TO EDIT THE INCOMING              
      *              CONTROL CARD.                                              
      *                                                                         
      *              UNDER NORMAL CONDITIONS THE EDIT/VALIDATE IS NOT           
      *              NECESSARY BECAUSE THE CARD IS SYSTEM GENERATED             
      *              WEEKLY. IF, HOWEVER, DURING RERUN SITUATIONS, THE          
      *              CARD IS MANUALLY PREPARED / MANIPULATED, SOME              
      *              EDITING/VALIDATION MUST BE DONE.                           
      *                                                                         
      *              PV-IN050-PGM-NUMBER MUST BE POPULATED BY THE               
      *              INCLUDING PROGRAM.                                         
      *-----------------------------------------------------------------        
      * CHANGE HISTORY:                                                         
      * WR NUMBER     PROGRAMMER       DATE                            *        
      * ---------------------------------------------------------------*        
      * WR34557       KARTHIK M        09/13/2011                      *        
      * ORIGINAL VERSION                                               *        
      *                                                                         
      *****************************************************************         
      *                                                                         
       01  PV-IN050-VARIABLES.                                                  
           03  PV-IN050-PGM-NUMBER              PIC X(08) VALUE SPACES.         
           03  PV-IN050-PROCESS-DATE            PIC X(10) VALUE SPACES.         
           03  FILLER      REDEFINES PV-IN050-PROCESS-DATE.             .       
               05  PV-IN050-PROCESS-DATE-CCYY   PIC X(04).                      
               05  PV-IN050-PROCESS-DATE-DASH-1 PIC X(01).                      
                   88  PV-IN050-PROCESS-DT-DASH-1         VALUE '-'.            
               05  PV-IN050-PROCESS-DATE-MM     PIC X(02).                      
               05  PV-IN050-PROCESS-DATE-DASH-2 PIC X(01).                      
                   88  PV-IN050-PROCESS-DT-DASH-2         VALUE '-'.            
               05  PV-IN050-PROCESS-DATE-DD     PIC X(02).                      
           03  PV-IN050-PARAGRAPH-NAME          PIC X(30) VALUE SPACES.         
           03  PV-IN050-RETRY-COUNT             PIC S9(04) VALUE ZERO.          
           03  PV-IN050-MSG-1                   PIC X(60) VALUE SPACES.         
           03  PV-IN050-MSG-2                   PIC X(60) VALUE SPACES.         
           03  PV-IN050-DB2-OPER-ATTEMPT        PIC X(50) VALUE SPACES.         
           03  PV-IN050-DTE-FLD-NME             PIC X(30) VALUE SPACES.         
                                                                                
       01  PC-IN050-CONSTANTS.                                                  
           03  PC-IN050-MAX-RETRY-CNT           PIC S9(04) VALUE +2             
                                                           COMP SYNC.           
       01  PS-IN050-SWITCHES.                                                   
           03  PS-IN050-ERR-FLAG                PIC  X(01) VALUE 'N'.           
               88  PS-IN050-ERR-FLG-YES                    VALUE 'Y'.           
               88  PS-IN050-ERR-FLG-NO                     VALUE 'N'.           
           03  PS-IN050-ABEND-CODE              PIC S9(04) VALUE +0             
                                                           COMP SYNC.           
               88  PS-IN050-ABEND-4003-CTLCRD-ER           VALUE +4003.         
               88  PS-IN050-ABEND-4004-TABLE-ER            VALUE +4004.         
               88  PS-IN050-ABEND-4013-DB2-ER              VALUE +4013.         
               88  PS-IN050-ABEND-4015-DATE-ER             VALUE +4015.         
