      ************************************************************      INWS018 
      *    INWS018 - INPUT RECORD LAYOUT FOR FILES RECEIVED                LV001
      *              FROM KEYING/SCANNING SERVICES.                     INWS018 
      *              'HEADER RECORD' IS CREATED BY KOHL'S               INWS018 
      *              'TTL          ' IS CREATED BY THE SCANNING SERVICE INWS018 
      *                  AND IS INCLUDED IN THE FTP'D DATA              INWS018 
      *                                                                 INWS018 
      *    RECORD LENGTH - 58 BYTES                                     INWS018 
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                             
      * -------  ----------  ----------------------------------------           
W21732* W21732   12-26-2002  NON-INTELLIGENT SKU. - IBM                         
25248 * 25248    10-06-2003  UPC CAPABILITIES & STORE NUMBER EXPANSION          
25248 *                      -ROD JANSSEN                                       
SR3403* SR3403   03-28-2012  EXPAND PRICE FIELDS FOR LARGE RETAIL               
SR3403*                      PROJECT - JALAJ KUMAR                              
      ************************************************************      INWS018 
       01  IN018-INVENTORY-COUNT-RECORD.                                INWS018 
25248      05  IN018-STORE-NUMBER             PIC  9(04).               INWS018 
           05  IN018-STORE-NUMBER-X REDEFINES                           INWS018 
25248          IN018-STORE-NUMBER             PIC  X(04).               INWS018 
           05  IN018-AREA-NUMBER              PIC  9(06).               INWS018 
           05  IN018-AREA-NUMBER-X REDEFINES                            INWS018 
               IN018-AREA-NUMBER              PIC  X(06).               INWS018 
           05  IN018-LINE-NUMBER              PIC  9(04).               INWS018 
           05  IN018-LINE-NUMBER-X REDEFINES                            INWS018 
               IN018-LINE-NUMBER              PIC  X(04).               INWS018 
W21732     05  IN018-SKU                      PIC  9(08).                       
W21732     05  IN018-SKU-X         REDEFINES                                    
W21732         IN018-SKU                      PIC  X(08).                       
           05  IN018-QUANTITY                 PIC  9(04).               INWS018 
           05  IN018-QUANTITY-X REDEFINES                               INWS018 
               IN018-QUANTITY                 PIC  X(04).               INWS018 
SR3403     05  IN018-PRICE                    PIC  9(05)V99.            INWS018 
SR3403     05  IN018-PRICE-X REDEFINES                                  INWS018 
SR3403         IN018-PRICE                    PIC  X(07).               INWS018 
           05  IN018-UPC-CODE                 PIC  9(13).               INWS018 
           05  IN018-UPC-CODE-X REDEFINES                               INWS018 
               IN018-UPC-CODE                 PIC  X(13).               INWS018 
           05  IN018-INVALID-INDICATOR        PIC  X(01).               INWS018 
               88 IN018-INVALID-REC           VALUE 'I', 'I'.           INWS018 
           05  IN018-BLANK-SHEET-INDICATOR    PIC  X(01).               INWS018 
               88 IN018-BLANK-SHEET           VALUE 'B', 'B'.           INWS018 
           05  IN018-SCAN-DTE                 PIC  9(04).                       
           05  IN018-SCAN-DTE-X REDEFINES                               INWS018 
               IN018-SCAN-DTE                 PIC  X(04).               INWS018 
           05  IN018-SCAN-TIMESTAMP           PIC  9(06).                       
           05  IN018-SCAN-TIMESTAMP-X REDEFINES                         INWS018 
               IN018-SCAN-TIMESTAMP           PIC  X(06).               INWS018 
SR3403*    05  FILLER                         PIC  X(01).               INWS018 
                                                                        INWS018 
       01  IN018-INVENTORY-HEADER-RECORD      REDEFINES                 INWS018 
           IN018-INVENTORY-COUNT-RECORD.                                INWS018 
           05  FILLER                         PIC X(13).                INWS018 
               88  IN018-HDR-RECORD           VALUE 'HEADER RECORD'.    INWS018 
           05  IN018-HDR-FIELDS               PIC X(29).                INWS018 
               88  IN018-HDR-TOTALS-NOT-INCL  VALUE SPACES.             INWS018 
           05  FILLER                         REDEFINES                 INWS018 
               IN018-HDR-FIELDS.                                        INWS018 
               10  FILLER                     PIC X(01).                INWS018 
               10  IN018-HDR-QTY              PIC 9(12).                INWS018 
               10  FILLER                     PIC X(01).                INWS018 
               10  IN018-HDR-RETAIL           PIC 9(12)V99.             INWS018 
               10  FILLER                     PIC X(01).                INWS018 
25248      05  IN018-HDR-STORE                PIC X(04).                INWS018 
25248      05  FILLER                         PIC X(12).                INWS018 
