      ******************************************************************INWS016 
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
W26600* W26600  08-01-2004 ROD JANSSEN INVENTORY STORE EXPANSION                
W27808* W27808  05-02-2005 ERIN SEARL  MANIFESTING PROJECT                      
      ******************************************************************INWS016 
00006  01  IN016-PHYSICAL-COUNT-RECORD.                                 INWS016 
W26603     05  IN016-STORE-9              PIC 9(04).                       CL**2
W26603     05  IN016-STORE REDEFINES IN016-STORE-9                         CL**2
W26603                                    PIC X(04).                       CL**2
W21732     05  IN016-SKU                  PIC X(08).                       CL**2
W26603     05  IN016-QTY                  PIC S9(09)       COMP.           CL**2
W26603     05  IN016-OLD-ONHAND-QTY       PIC S9(09)       COMP.           CL**2
W26603     05  IN016-ADJUSTMENT-AMT       PIC S9(09)       COMP.           CL**2
00015      05  IN016-ITEM-NUMBER          PIC S9(15)V      COMP-3.         CL**2
00016      05  IN016-SCAN-IND             PIC X(01).                       CL**2
00017      05  IN016-INV-DATE             PIC X(10).                       CL**2
00018      05  IN016-AFTER-RECEIPTS       PIC S9(07)       COMP-3.         CL**4
00019      05  IN016-STAT-CDE             PIC X(02)    VALUE SPACE.        CL**4
           05  IN016-ITEM-TYPE            PIC X(01).                            
               88  IN016-REGULAR-ITEM     VALUE 'R'.                            
W21732         88  IN016-GWP-ITEM         VALUE 'G'.                            
               88  IN016-ITEM-NOT-FOUND   VALUE 'N'.                            
00019      05  IN016-CUTOFF-INTRANSIT     PIC S9(07)       COMP-3.         CL**4
W21732     05  IN016-DEPT                 PIC X(04).                    INWS016 
W21732     05  IN016-DEPT-9  REDEFINES IN016-DEPT                       INWS016 
W21732                                    PIC 9(04).                            
W21732     05  IN016-CLASS                PIC X(04).                    INWS016 
W21732     05  IN016-CLASS-9 REDEFINES IN016-CLASS                      INWS016 
W21732                                    PIC 9(04).                            
W27808     05  IN016-STR-EXP-OH-QTY       PIC S9(09)       COMP.           CL**2
W26603     05  FILLER                     PIC X(14).                       CL**4
