00001 ******************************************************************09/15/93
00002 *                        INWS001O                                 INWS001O
00003 *                                                                    LV002
00004 *   THIS IS AN OUTPUT RECORD FOR INKUT015                         INWS001O
00005 *                                                                 INWS001O
W21732*   LENGTH:  40 BYTES (IBM)                                          CL**2
C21732*   LENGTH:  30 BYTES (S JACKSON-KOHLS)                              CL**2
RONNA *   LENGTH:  60 BYTES (R MCDONALD-KOHLS) -- ADD DESCRIPTION               
VLY   *   LENGTH:  64 BYTES (V L YANG) -- ADD SOURCE INDICATOR                  
1122RM*   LENGTH:  67 BYTES (B MCASEY) -- ADD SUBCLASS                          
00007 ******************************************************************INWS001O
00008                                                                   INWS001O
00009  01  IN015O-SKU-INFO.                                             INWS001O
00010      05  IN015O-SKU-NBR               PIC X(08)     VALUE SPACE.     CL**2
00015      05  FILLER                       PIC X(01)     VALUE SPACE.     CL**2
00016      05  IN015O-UPC-NBR               PIC X(13)     VALUE SPACE.     CL**2
00017      05  FILLER                       PIC X(03)     VALUE SPACE.     CL**2
W21732     05  IN015O-DEPT-NBR              PIC X(04)     VALUE ZERO.      CL**2
W21732     05  FILLER                       PIC X(01)     VALUE SPACE.     CL**2
RONNA      05  IN015O-INTR-UPC-DESC         PIC X(30)     VALUE SPACE.          
C21732*    05  IN015O-CLASS-NBR             PIC X(04)     VALUE ZERO.      CL**2
VLY        05  FILLER                       PIC X(01)     VALUE SPACE.     CL**2
VLY        05  IN015O-SOURCE-IND            PIC S9(04)    VALUE ZEROES     CL**2
VLY                            COMP-3.                                          
1122RM     05  FILLER                       PIC X(01)     VALUE SPACE.     CL**2
1122RM     05  IN015O-SUBCL-NBR             PIC X(02)     VALUE ZERO.      CL**2
