      *----------------------------------------------------------------*12/04/93
00002 *                         INWS001                                *INWS001 
00003 *                                                                *   LV018
00004 *   THIS IS THE INTER-APPLICATION COMMUNICATIONS WORK AREA       *INWS001 
00005 *   USED IN THE PHYSICAL INVENTORY SYSTEM.                       *INWS001 
00006 *                                                                *INWS001 
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
W26600* W26600  06-29-2004 ROD JANSSEN INV STORE EXPANSION                      
W28545* W28545  05-16-2006 BRUCE GRAHAM - STRATAGEM DEPARTMENT INV CHG          
00007 *----------------------------------------------------------------*INWS001 
00008                                                                   INWS001 
00009        10  IN001-INTER-APPL-COMM-AREA  REDEFINES                     CL**2
00010            INTER-APPL-COMM-AREA.                                     CL**2
00011                                                                      CL**5
00012            15  FILLER                   PIC  X(01).                  CL**5
00013            15  IN001-STORE-NBR-X.                                    CL**6
W26600               20  IN001-STORE-NBR      PIC  9(04).                  CL**5
00015            15  IN001-AREA-NBR-X.                                     CL**6
00016                88  IN001-AREA-ASTERISK              VALUE ALL '*'.   CL*15
00017                20  IN001-AREA-NBR       PIC  9(07).                  CL**8
00018            15  IN001-LINE-NBR-X.                                     CL**8
00019                20  IN001-LINE-NBR       PIC  9(07).                  CL**8
00020            15  IN001-SHEET-NBR-X.                                    CL**3
00021                20  IN001-SHEET-NBR      PIC  9(06).                  CL*16
00022            15  IN001-STORE-NAME         PIC  X(25).                  CL**7
00023                                                                      CL**4
00024            15  IN001-NUMBER-OF-SELECTED-ITEMS                        CL**5
00025                                         PIC S9(09)                   CL**4
00026                                             COMP-3.                  CL**4
00027            15  IN001-NUMBER-OF-TS-ITEMS PIC S9(05)                   CL**5
00028                                             COMP-3.                  CL**4
00029            15  IN001-SEL-QUEUE-NAME     PIC X(8).                    CL**5
00030                                                                      CL*11
00031            15  IN001-IN-WITHDRAWAL-PERIOD-SW                         CL*10
00032                                         PIC  X.                      CL*10
00033                88  IN001-IN-WITHDRAWAL-PERIOD        VALUE 'Y'.      CL*10
00034                88  IN001-NOT-IN-WITHDRAWAL-PERIOD    VALUE 'N'.      CL*11
00035            15  IN001-ACTL-INV-DTE-YYYYMMDD                           CL*10
00036                                         PIC  X(08).                  CL*10
W28545           15  IN001-ACT-INV-DATE REDEFINES                          CL**2
W28545                                      IN001-ACTL-INV-DTE-YYYYMMDD.        
W28545               20  IN001-ACT-INV-YYYY          PIC  X(04).           CL**2
W28545               20  IN001-ACT-INV-MM            PIC  X(02).           CL**2
W28545               20  IN001-ACT-INV-DD            PIC  X(02).           CL**2
00037            15  IN001-SCANNING-STORE-SW  PIC  X.                      CL*11
00038                88  IN001-SCANNING-STORE              VALUE 'Y'.      CL*11
00039            15  IN001-DISPLAY-COMPLETE-SW PIC X.                      CL*13
00040                88  IN001-DISPLAY-COMPLETE            VALUE 'Y'.      CL*13
00041            15  IN001-DB2-ACTL-INV-DTE   PIC  X(10).                  CL*12
00042            15  IN001-ITM-CTOFF-IND      PIC  X.                      CL*17
00043                88  IN001-ITM-CTOFF-HAS-OCCURRED      VALUE 'Y'.      CL*17
00044                88  IN001-ITM-CTOFF-HASNT-OCCURRED    VALUE 'N'.      CL*17
00045            15  IN001-AREA-FROM-NBR      PIC  9(07).                  CL*18
00046            15  IN001-AREA-TO-NBR        PIC  9(07).                  CL*18
00047                                                                      CL**4
23511            15  IN001-REASON-MSG         PIC  X(20).                       
25248            15  IN001-UNIT-BOOK-IND      PIC  X.                      CL*17
25248                88  IN001-UNIT-BOOK-HAS-OCCURRED      VALUE 'Y'.      CL*17
25248                88  IN001-UNIT-BOOK-HASNT-OCCURRED    VALUE 'N'.      CL*17
W28545           15  IN001-INV-ID             PIC  9(09).                  CL*18
W28545           15  IN001-INV-NM             PIC  X(20).                  CL*18
W28545           15  IN001-HIST-IND           PIC  X(01).                  CL**2
W28545           15  IN001-ACTION             PIC  X(01).                  CL**2
W28545           15  FILLER                   PIC  X(44).                  CL*18
