      *----------------------------------------------------------------*12/04/93
00002 *                         INWS030                                *INWS030 
00003 *                                                                *   LV018
00004 *   THIS IS THE INTER-APPLICATION COMMUNICATIONS WORK AREA       *INWS030 
00005 *   USED IN THE PHYSICAL INVENTORY SHEET INVENTORY SCREENS.      *INWS030 
00006 *                                                                *INWS030 
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
W28545* W28545  08-22-2005 ROD JANSSEN THE NEW TRANSFER PROCESS                 
00007 *----------------------------------------------------------------*INWS030 
00008                                                                   INWS030 
00009        10  IN030-INTER-APPL-COMM-AREA   REDEFINES                    CL**2
00010            INTER-APPL-COMM-AREA.                                     CL**2
00011                                                                      CL**5
00012            15  FILLER                   PIC X.                       CL**5
00013            15  IN030-STR-NBR            PIC S9(4) COMP.              CL**6
00021            15  IN030-SHEET-NBR          PIC S9(9) COMP.              CL*16
00022            15  IN030-STORE-NAME         PIC X(25).                   CL**7
00023                                                                      CL**4
00024            15  IN030-NUMBER-OF-SELECTED-ITEMS                        CL**5
00025                                         PIC S9(09) COMP-3.           CL**4
00027            15  IN030-NUMBER-OF-TS-ITEMS PIC S9(05) COMP-3.           CL**5
00029            15  IN030-SEL-QUEUE-NAME     PIC X(8).                    CL**5
00041            15  IN030-DB2-ACTL-INV-DTE   PIC X(10).                   CL*12
00042            15  IN030-SHEET-INV-IND      PIC X.                       CL*17
00043                88  IN030-SHEET-INV-COMPLETED       VALUE 'Y'.        CL*17
00044                88  IN030-SHEET-INV-NOT-COMPLETED   VALUE 'N'.        CL*17
W24521           15  IN030-STORE-TYPE-CODE    PIC X(2).                    CL*18
W28545           15  IN030-TYPE-CDE           PIC  X(01).                       
W28545               88  IN030-TYPE-ALL-SHEETS           VALUE '*'.             
W28545               88  IN030-TYPE-TFR-SHEET            VALUE 'T'.             
W28545               88  IN030-TYPE-MANI-SHEET           VALUE 'M'.             
W28545               88  IN030-TYPE-ENTRD-SHEET          VALUE 'K'.             
W28545           15  IN030-TYPE-CDE-DESC         PIC  X(25).                    
W28545               88  IN030-DESC-ALL-SHEETS                                  
W28545                   VALUE 'ALL SHEETS'.                                    
W28545               88  IN030-DESC-TFR-SHEET                                   
W28545                   VALUE 'TRANSFER STORE SHEETS'.                         
W28545               88  IN030-DESC-MANI-SHEET                                  
W28545                   VALUE 'MANIFEST TRAILER SHEETS'.                       
W28545               88  IN030-DESC-ENTRD-SHEET                                 
W28545                   VALUE 'USER ENTERED SHEETS'.                           
W28545           15  IN030-INV-ID             PIC  9(09).                  CL*18
W28545           15  IN030-INV-NM             PIC  X(20).                  CL*18
W28545           15  FILLER                   PIC  X(84).                  CL*18
