*          DATA SET IQKM408                                                     
        PRINT  NOGEN                                                    00002   
IQKM408 DFHMSD TYPE=DSECT,                                             X00003   
               LANG=COBOL,                                             X00004   
               MODE=INOUT,                                             X00005   
               STORAGE=AUTO,                                           X00006   
               TERM=3270-2,                                            X00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
IQ408A  DFHMDI LINE=2,COLUMN=1,                                        X00010**5
               SIZE=(19,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
**************                                                          00015   
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00016**4
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00017**3
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00018**7
               COLOR=GREEN,                                            X00019   
               HILIGHT=UNDERLINE,                                      X00020   
               PICOUT='ZZZZ9'                                           00021   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00022**3
               COLOR=NEUTRAL,                                          X00023   
               INITIAL='TO'                                             00024   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025**3
               COLOR=BLUE,                                             X00026   
               PICOUT='ZZZZ9'                                           00027   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00028**3
               COLOR=NEUTRAL,                                          X00029   
               INITIAL='OF'                                             00030   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00031**3
               COLOR=BLUE,                                             X00032   
               PICOUT='ZZZZ9'                                           00033   
************************                                                00053   
* INSERT PASSED DATA HERE                                               00034   
************************                                                00053   
        DFHMDF POS=(03,01),LENGTH=03,ATTRB=(PROT,NORM),                X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='SEL'                                            00037   
        DFHMDF POS=(03,05),LENGTH=03,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='MAJ'                                            00040   
        DFHMDF POS=(03,10),LENGTH=03,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='SUB'                                            00040   
        DFHMDF POS=(03,14),LENGTH=11,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='DESCRIPTION'                                    00040   
        DFHMDF POS=(03,31),LENGTH=03,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='UPC'                                            00040   
        DFHMDF POS=(03,47),LENGTH=02,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='ST'                                             00040   
        DFHMDF POS=(03,50),LENGTH=05,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='COLOR'                                          00040   
        DFHMDF POS=(03,61),LENGTH=05,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='SIZE'                                           00040   
        DFHMDF POS=(03,72),LENGTH=07,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='CUR RTL'                                        00040   
************************                                                00053   
ASEL04  DFHMDF POS=(04,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ04  DFHMDF POS=(04,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB04  DFHMDF POS=(04,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES04  DFHMDF POS=(04,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC04  DFHMDF POS=(04,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT04 DFHMDF POS=(04,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACOLR04 DFHMDF POS=(04,50),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE04 DFHMDF POS=(04,61),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL04 DFHMDF POS=(04,72),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
************************                                                00053   
ASEL05  DFHMDF POS=(05,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ05  DFHMDF POS=(05,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB05  DFHMDF POS=(05,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES05  DFHMDF POS=(05,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC05  DFHMDF POS=(05,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT05 DFHMDF POS=(05,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACOLR05 DFHMDF POS=(05,50),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE05 DFHMDF POS=(05,61),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL05 DFHMDF POS=(05,72),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
************************                                                00053   
ASEL06  DFHMDF POS=(06,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ06  DFHMDF POS=(06,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB06  DFHMDF POS=(06,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES06  DFHMDF POS=(06,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC06  DFHMDF POS=(06,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT06 DFHMDF POS=(06,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACOLR06 DFHMDF POS=(06,50),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE06 DFHMDF POS=(06,61),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL06 DFHMDF POS=(06,72),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
************************                                                00053   
ASEL07  DFHMDF POS=(07,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ07  DFHMDF POS=(07,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB07  DFHMDF POS=(07,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES07  DFHMDF POS=(07,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC07  DFHMDF POS=(07,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT07 DFHMDF POS=(07,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACOLR07 DFHMDF POS=(07,50),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE07 DFHMDF POS=(07,61),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL07 DFHMDF POS=(07,72),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
************************                                                00053   
ASEL08  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ08  DFHMDF POS=(08,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB08  DFHMDF POS=(08,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES08  DFHMDF POS=(08,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC08  DFHMDF POS=(08,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT08 DFHMDF POS=(08,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACOLR08 DFHMDF POS=(08,50),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE08 DFHMDF POS=(08,61),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL08 DFHMDF POS=(08,72),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
************************                                                00053   
ASEL09  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ09  DFHMDF POS=(09,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB09  DFHMDF POS=(09,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES09  DFHMDF POS=(09,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC09  DFHMDF POS=(09,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT09 DFHMDF POS=(09,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACOLR09 DFHMDF POS=(09,50),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE09 DFHMDF POS=(09,61),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL09 DFHMDF POS=(09,72),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
************************                                                00053   
ASEL10  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ10  DFHMDF POS=(10,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB10  DFHMDF POS=(10,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES10  DFHMDF POS=(10,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC10  DFHMDF POS=(10,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT10 DFHMDF POS=(10,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACOLR10 DFHMDF POS=(10,50),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE10 DFHMDF POS=(10,61),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL10 DFHMDF POS=(10,72),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
************************                                                00053   
ASEL11  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ11  DFHMDF POS=(11,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB11  DFHMDF POS=(11,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES11  DFHMDF POS=(11,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC11  DFHMDF POS=(11,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT11 DFHMDF POS=(11,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACOLR11 DFHMDF POS=(11,50),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE11 DFHMDF POS=(11,61),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL11 DFHMDF POS=(11,72),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
************************                                                00053   
ASEL12  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ12  DFHMDF POS=(12,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB12  DFHMDF POS=(12,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES12  DFHMDF POS=(12,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC12  DFHMDF POS=(12,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT12 DFHMDF POS=(12,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACOLR12 DFHMDF POS=(12,50),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE12 DFHMDF POS=(12,61),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL12 DFHMDF POS=(12,72),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
************************                                                00053   
ASEL13  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ13  DFHMDF POS=(13,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB13  DFHMDF POS=(13,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES13  DFHMDF POS=(13,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC13  DFHMDF POS=(13,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT13 DFHMDF POS=(13,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACOLR13 DFHMDF POS=(13,50),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE13 DFHMDF POS=(13,61),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL13 DFHMDF POS=(13,72),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
************************                                                00053   
ASEL14  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ14  DFHMDF POS=(14,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB14  DFHMDF POS=(14,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES14  DFHMDF POS=(14,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC14  DFHMDF POS=(14,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT14 DFHMDF POS=(14,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACOLR14 DFHMDF POS=(14,50),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE14 DFHMDF POS=(14,61),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL14 DFHMDF POS=(14,72),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
************************                                                00053   
ASEL15  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ15  DFHMDF POS=(15,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB15  DFHMDF POS=(15,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES15  DFHMDF POS=(15,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC15  DFHMDF POS=(15,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT15 DFHMDF POS=(15,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACOLR15 DFHMDF POS=(15,50),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE15 DFHMDF POS=(15,61),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL15 DFHMDF POS=(15,72),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
************************                                                00053   
ASEL16  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ16  DFHMDF POS=(16,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB16  DFHMDF POS=(16,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES16  DFHMDF POS=(16,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC16  DFHMDF POS=(16,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT16 DFHMDF POS=(16,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACOLR16 DFHMDF POS=(16,50),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE16 DFHMDF POS=(16,61),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL16 DFHMDF POS=(16,72),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
************************                                                00053   
ASEL17  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ17  DFHMDF POS=(17,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB17  DFHMDF POS=(17,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES17  DFHMDF POS=(17,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC17  DFHMDF POS=(17,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT17 DFHMDF POS=(17,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACOLR17 DFHMDF POS=(17,50),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE17 DFHMDF POS=(17,61),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL17 DFHMDF POS=(17,72),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
************************                                                00053   
ASEL18  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ18  DFHMDF POS=(18,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB18  DFHMDF POS=(18,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES18  DFHMDF POS=(18,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC18  DFHMDF POS=(18,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT18 DFHMDF POS=(18,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACOLR18 DFHMDF POS=(18,50),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE18 DFHMDF POS=(18,61),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL18 DFHMDF POS=(18,72),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
************************                                                00053   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
