        PRINT  NOGEN                                                    00002   
IQKM416 DFHMSD TYPE=DSECT,                                             X00003   
               LANG=COBOL,                                             X00004   
               MODE=INOUT,                                             X00005   
               STORAGE=AUTO,                                           X00006   
               TERM=3270-2,                                            X00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
IQ416A  DFHMDI LINE=2,COLUMN=1,                                        X00010**5
               SIZE=(19,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
**************                                                          00015   
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00016**4
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00017**3
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00018**7
               COLOR=GREEN,                                            X00019   
               HILIGHT=UNDERLINE,                                      X00020   
               PICOUT='ZZZZ9'                                           00021   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00022**3
               COLOR=NEUTRAL,                                          X00023   
               INITIAL='TO'                                             00024   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025**3
               COLOR=BLUE,                                             X00026   
               PICOUT='ZZZZ9'                                           00027   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00028**3
               COLOR=NEUTRAL,                                          X00029   
               INITIAL='OF'                                             00030   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00031**3
               COLOR=BLUE,                                             X00032   
               PICOUT='ZZZZ9'                                           00033   
*                                                                       00034   
        DFHMDF POS=(03,01),LENGTH=05,ATTRB=(ASKIP,NORM),               X00016**4
               COLOR=NEUTRAL,INITIAL='DEPT:'                            00017**3
ADEPT   DFHMDF POS=(03,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00018**7
               COLOR=NEUTRAL                                            00019   
ADPTDSC DFHMDF POS=(03,12),LENGTH=20,ATTRB=(ASKIP,NORM),               X00022**3
               COLOR=NEUTRAL                                            00023   
        DFHMDF POS=(03,35),LENGTH=06,ATTRB=(ASKIP,NORM),               X00016**4
               COLOR=NEUTRAL,INITIAL='STORE:'                           00017**3
ASTORE  DFHMDF POS=(03,42),LENGTH=04,ATTRB=(NUM,UNPROT,NORM),          X00018**7
               COLOR=GREEN,                                            X00019   
               HILIGHT=UNDERLINE                                        00020   
ASTRNAM DFHMDF POS=(03,47),LENGTH=20,ATTRB=(ASKIP,NORM),               X00022**3
               COLOR=NEUTRAL                                            00023   
*                                                                               
        DFHMDF POS=(04,01),LENGTH=03,ATTRB=(PROT,NORM),                X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='SEL'                                            00037   
        DFHMDF POS=(04,05),LENGTH=03,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='MAJ'                                            00040   
        DFHMDF POS=(04,10),LENGTH=03,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='SUB'                                            00040   
        DFHMDF POS=(04,14),LENGTH=11,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='DESCRIPTION'                                    00040   
        DFHMDF POS=(04,31),LENGTH=03,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='UPC'                                            00040   
        DFHMDF POS=(04,47),LENGTH=02,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='ST'                                             00040   
        DFHMDF POS=(04,50),LENGTH=08,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL=' CUR RTL'                                       00040   
AOHCOLR DFHMDF POS=(04,60),LENGTH=10,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='STR ONHAND'                                     00040   
ASIZHDR DFHMDF POS=(04,73),LENGTH=04,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='SIZE'                                           00040   
*                                                                       00053   
ASEL01  DFHMDF POS=(05,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ01  DFHMDF POS=(05,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB01  DFHMDF POS=(05,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADESC01 DFHMDF POS=(05,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC01  DFHMDF POS=(05,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT01 DFHMDF POS=(05,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL01 DFHMDF POS=(05,50),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
AOHCL01 DFHMDF POS=(05,59),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE01 DFHMDF POS=(05,70),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
*                                                                       00053   
ASEL02  DFHMDF POS=(06,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ02  DFHMDF POS=(06,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB02  DFHMDF POS=(06,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADESC02 DFHMDF POS=(06,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC02  DFHMDF POS=(06,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT02 DFHMDF POS=(06,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL02 DFHMDF POS=(06,50),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
AOHCL02 DFHMDF POS=(06,59),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE02 DFHMDF POS=(06,70),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
*                                                                       00053   
ASEL03  DFHMDF POS=(07,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ03  DFHMDF POS=(07,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB03  DFHMDF POS=(07,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADESC03 DFHMDF POS=(07,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC03  DFHMDF POS=(07,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT03 DFHMDF POS=(07,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL03 DFHMDF POS=(07,50),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
AOHCL03 DFHMDF POS=(07,59),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE03 DFHMDF POS=(07,70),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
*                                                                       00053   
ASEL04  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ04  DFHMDF POS=(08,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB04  DFHMDF POS=(08,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADESC04 DFHMDF POS=(08,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC04  DFHMDF POS=(08,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT04 DFHMDF POS=(08,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL04 DFHMDF POS=(08,50),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
AOHCL04 DFHMDF POS=(08,59),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE04 DFHMDF POS=(08,70),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
*                                                                       00053   
ASEL05  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ05  DFHMDF POS=(09,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB05  DFHMDF POS=(09,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADESC05 DFHMDF POS=(09,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC05  DFHMDF POS=(09,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT05 DFHMDF POS=(09,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL05 DFHMDF POS=(09,50),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
AOHCL05 DFHMDF POS=(09,59),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE05 DFHMDF POS=(09,70),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
*                                                                       00053   
ASEL06  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ06  DFHMDF POS=(10,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB06  DFHMDF POS=(10,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADESC06 DFHMDF POS=(10,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC06  DFHMDF POS=(10,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT06 DFHMDF POS=(10,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL06 DFHMDF POS=(10,50),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
AOHCL06 DFHMDF POS=(10,59),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE06 DFHMDF POS=(10,70),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
*                                                                       00053   
ASEL07  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ07  DFHMDF POS=(11,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB07  DFHMDF POS=(11,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADESC07 DFHMDF POS=(11,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC07  DFHMDF POS=(11,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT07 DFHMDF POS=(11,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL07 DFHMDF POS=(11,50),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
AOHCL07 DFHMDF POS=(11,59),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE07 DFHMDF POS=(11,70),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
*                                                                       00053   
ASEL08  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ08  DFHMDF POS=(12,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB08  DFHMDF POS=(12,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADESC08 DFHMDF POS=(12,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC08  DFHMDF POS=(12,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT08 DFHMDF POS=(12,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL08 DFHMDF POS=(12,50),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
AOHCL08 DFHMDF POS=(12,59),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE08 DFHMDF POS=(12,70),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
*                                                                       00053   
ASEL09  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ09  DFHMDF POS=(13,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB09  DFHMDF POS=(13,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADESC09 DFHMDF POS=(13,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC09  DFHMDF POS=(13,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT09 DFHMDF POS=(13,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL09 DFHMDF POS=(13,50),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
AOHCL09 DFHMDF POS=(13,59),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE09 DFHMDF POS=(13,70),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
*                                                                       00053   
ASEL10  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ10  DFHMDF POS=(14,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB10  DFHMDF POS=(14,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADESC10 DFHMDF POS=(14,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC10  DFHMDF POS=(14,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT10 DFHMDF POS=(14,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL10 DFHMDF POS=(14,50),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
AOHCL10 DFHMDF POS=(14,59),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE10 DFHMDF POS=(14,70),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
*                                                                       00053   
ASEL11  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ11  DFHMDF POS=(15,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB11  DFHMDF POS=(15,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADESC11 DFHMDF POS=(15,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC11  DFHMDF POS=(15,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT11 DFHMDF POS=(15,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL11 DFHMDF POS=(15,50),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
AOHCL11 DFHMDF POS=(15,59),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE11 DFHMDF POS=(15,70),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
*                                                                       00053   
ASEL12  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ12  DFHMDF POS=(16,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB12  DFHMDF POS=(16,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADESC12 DFHMDF POS=(16,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC12  DFHMDF POS=(16,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT12 DFHMDF POS=(16,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL12 DFHMDF POS=(16,50),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
AOHCL12 DFHMDF POS=(16,59),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE12 DFHMDF POS=(16,70),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
*                                                                       00053   
ASEL13  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
AMAJ13  DFHMDF POS=(17,04),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB13  DFHMDF POS=(17,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADESC13 DFHMDF POS=(17,14),LENGTH=16,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
AUPC13  DFHMDF POS=(17,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASTAT13 DFHMDF POS=(17,47),LENGTH=02,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ACRTL13 DFHMDF POS=(17,50),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.99'                                        00033   
AOHCL13 DFHMDF POS=(17,59),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASIZE13 DFHMDF POS=(17,70),LENGTH=10,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
*                                                                       00068   
        DFHMDF POS=(18,20),LENGTH=37,ATTRB=(ASKIP,NORM),               X00264   
               COLOR=NEUTRAL,                                          X00265   
               INITIAL='TOTALS FOR ENTIRE SELECTION LIST --->'          00265   
ATOTLOH DFHMDF POS=(18,58),LENGTH=11,ATTRB=(ASKIP,NORM),               X00266   
               COLOR=BLUE,PICOUT='---,---,--9'                          00267   
*                                                                       00263   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               X00264   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00265   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               X00266   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00267   
**************                                                          00268   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
