*          DATA SET IQKM405                                                     
        PRINT  NOGEN                                                    00002   
IQKM405 DFHMSD TYPE=DSECT,                                             X00003   
               LANG=COBOL,                                             X00004   
               MODE=INOUT,                                             X00005   
               STORAGE=AUTO,                                           X00006   
               TERM=3270-2,                                            X00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
IQ405A  DFHMDI LINE=2,COLUMN=1,                                        X00010**5
               SIZE=(19,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
**************                                                          00015   
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00016**4
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00017**3
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00018**7
               COLOR=GREEN,                                            X00019   
               HILIGHT=UNDERLINE,                                      X00020   
               PICOUT='ZZZZ9'                                           00021   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00022**3
               COLOR=NEUTRAL,                                          X00023   
               INITIAL='TO'                                             00024   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025**3
               COLOR=BLUE,                                             X00026   
               PICOUT='ZZZZ9'                                           00027   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00028**3
               COLOR=NEUTRAL,                                          X00029   
               INITIAL='OF'                                             00030   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00031**3
               COLOR=BLUE,                                             X00032   
               PICOUT='ZZZZ9'                                           00033   
************************                                                00053   
* INSERT PASSED DATA HERE                                               00034   
************************                                                00053   
        DFHMDF POS=(03,01),LENGTH=13,ATTRB=(ASKIP,NORM),               X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='VENDOR......:'                                  00037   
AVENDNM DFHMDF POS=(03,15),LENGTH=30,ATTRB=(ASKIP,NORM),               X00054**2
               COLOR=BLUE                                               00056   
        DFHMDF POS=(03,46),LENGTH=01,ATTRB=(ASKIP)                      00057   
************************                                                00053   
        DFHMDF POS=(04,01),LENGTH=13,ATTRB=(ASKIP,NORM),               X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='BUSINESS GRP:'                                  00037   
ABUSGRP DFHMDF POS=(04,15),LENGTH=03,ATTRB=(ASKIP,NORM),               X00054**2
               COLOR=BLUE                                               00056   
ABUSDES DFHMDF POS=(04,19),LENGTH=25,ATTRB=(ASKIP,NORM),               X00054**2
               COLOR=BLUE                                               00056   
        DFHMDF POS=(04,62),LENGTH=09,ATTRB=(ASKIP,NORM),               X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='AVAIL UPC'                                              
ASKU    DFHMDF POS=(04,72),LENGTH=07,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ,ZZ9'                                                 
************************                                                00053   
        DFHMDF POS=(05,01),LENGTH=13,ATTRB=(ASKIP,NORM),               X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='DEPARTMENT..:'                                  00037   
ADEPTNO DFHMDF POS=(05,15),LENGTH=04,ATTRB=(ASKIP,NORM),               X00054**2
               COLOR=BLUE                                               00056   
ADPTDES DFHMDF POS=(05,20),LENGTH=20,ATTRB=(ASKIP,NORM),               X00054**2
               COLOR=BLUE                                               00056   
        DFHMDF POS=(05,41),LENGTH=01,ATTRB=(ASKIP)                      00057   
************************                                                00053   
        DFHMDF POS=(07,01),LENGTH=03,ATTRB=(PROT,NORM),                X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='SEL'                                            00037   
        DFHMDF POS=(07,07),LENGTH=05,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='MAJOR'                                          00040   
        DFHMDF POS=(07,14),LENGTH=03,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='SUB'                                            00040   
        DFHMDF POS=(07,20),LENGTH=11,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='DESCRIPTION'                                    00040   
        DFHMDF POS=(07,41),LENGTH=01,ATTRB=(ASKIP)                      00057   
************************                                                00053   
ASEL08  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(08,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AMAJ08  DFHMDF POS=(08,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB08  DFHMDF POS=(08,14),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES08  DFHMDF POS=(08,20),LENGTH=20,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL09  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(09,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AMAJ09  DFHMDF POS=(09,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB09  DFHMDF POS=(09,14),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES09  DFHMDF POS=(09,20),LENGTH=20,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL10  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(10,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AMAJ10  DFHMDF POS=(10,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB10  DFHMDF POS=(10,14),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES10  DFHMDF POS=(10,20),LENGTH=20,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL11  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(11,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AMAJ11  DFHMDF POS=(11,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB11  DFHMDF POS=(11,14),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES11  DFHMDF POS=(11,20),LENGTH=20,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL12  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(12,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AMAJ12  DFHMDF POS=(12,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB12  DFHMDF POS=(12,14),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES12  DFHMDF POS=(12,20),LENGTH=20,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL13  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(13,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AMAJ13  DFHMDF POS=(13,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB13  DFHMDF POS=(13,14),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES13  DFHMDF POS=(13,20),LENGTH=20,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL14  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(14,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AMAJ14  DFHMDF POS=(14,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB14  DFHMDF POS=(14,14),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES14  DFHMDF POS=(14,20),LENGTH=20,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL15  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(15,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AMAJ15  DFHMDF POS=(15,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB15  DFHMDF POS=(15,14),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES15  DFHMDF POS=(15,20),LENGTH=20,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL16  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(16,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AMAJ16  DFHMDF POS=(16,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB16  DFHMDF POS=(16,14),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES16  DFHMDF POS=(16,20),LENGTH=20,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL17  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(17,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AMAJ17  DFHMDF POS=(17,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB17  DFHMDF POS=(17,14),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES17  DFHMDF POS=(17,20),LENGTH=20,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL18  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(18,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AMAJ18  DFHMDF POS=(18,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ASUB18  DFHMDF POS=(18,14),LENGTH=04,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES18  DFHMDF POS=(18,20),LENGTH=20,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
