*          DATA SET IQKM403                                                     
        PRINT  NOGEN                                                            
IQKM403 DFHMSD TYPE=DSECT,                                             X00003   
               LANG=COBOL,                                             X00004   
               MODE=INOUT,                                             X00005   
               STORAGE=AUTO,                                           X00006   
               TERM=3270-2,                                            X00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
IQ403A  DFHMDI LINE=2,COLUMN=1,                                        X00010**5
               SIZE=(19,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
**************                                                          00015   
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00016**4
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00017**3
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00018**7
               COLOR=GREEN,                                            X00019   
               HILIGHT=UNDERLINE,                                      X00020   
               PICOUT='ZZZZ9'                                           00021   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00022**3
               COLOR=NEUTRAL,                                          X00023   
               INITIAL='TO'                                             00024   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025**3
               COLOR=BLUE,                                             X00026   
               PICOUT='ZZZZ9'                                           00027   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00028**3
               COLOR=NEUTRAL,                                          X00029   
               INITIAL='OF'                                             00030   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00031**3
               COLOR=BLUE,                                             X00032   
               PICOUT='ZZZZ9'                                           00033   
************************                                                00053   
* INSERT PASSED DATA HERE                                               00034   
************************                                                00053   
        DFHMDF POS=(03,01),LENGTH=07,ATTRB=(ASKIP,NORM),               X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='VENDOR:'                                        00037   
AVENDNM DFHMDF POS=(03,09),LENGTH=30,ATTRB=(ASKIP,NORM),               X00054**2
               COLOR=BLUE                                               00056   
        DFHMDF POS=(03,40),LENGTH=01,ATTRB=(ASKIP)                      00057   
************************                                                00053   
        DFHMDF POS=(04,01),LENGTH=03,ATTRB=(PROT,NORM),                X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='SEL'                                            00037   
        DFHMDF POS=(04,06),LENGTH=03,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='GRP'                                            00040   
        DFHMDF POS=(04,15),LENGTH=11,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='DESCRIPTION'                                    00040   
************************                                                00053   
ASEL05  DFHMDF POS=(05,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(05,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AGRP05  DFHMDF POS=(05,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES05  DFHMDF POS=(05,15),LENGTH=25,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL06  DFHMDF POS=(06,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(06,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AGRP06  DFHMDF POS=(06,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES06  DFHMDF POS=(06,15),LENGTH=25,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL07  DFHMDF POS=(07,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(07,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AGRP07  DFHMDF POS=(07,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES07  DFHMDF POS=(07,15),LENGTH=25,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL08  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(08,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AGRP08  DFHMDF POS=(08,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES08  DFHMDF POS=(08,15),LENGTH=25,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL09  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(09,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AGRP09  DFHMDF POS=(09,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES09  DFHMDF POS=(09,15),LENGTH=25,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL10  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(10,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AGRP10  DFHMDF POS=(10,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES10  DFHMDF POS=(10,15),LENGTH=25,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL11  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(11,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AGRP11  DFHMDF POS=(11,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES11  DFHMDF POS=(11,15),LENGTH=25,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL12  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(12,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AGRP12  DFHMDF POS=(12,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES12  DFHMDF POS=(12,15),LENGTH=25,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL13  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(13,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AGRP13  DFHMDF POS=(13,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES13  DFHMDF POS=(13,15),LENGTH=25,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL14  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(14,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AGRP14  DFHMDF POS=(14,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES14  DFHMDF POS=(14,15),LENGTH=25,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL15  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(15,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AGRP15  DFHMDF POS=(15,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES15  DFHMDF POS=(15,15),LENGTH=25,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL16  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(16,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AGRP16  DFHMDF POS=(16,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES16  DFHMDF POS=(16,15),LENGTH=25,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL17  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(17,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AGRP17  DFHMDF POS=(17,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES17  DFHMDF POS=(17,15),LENGTH=25,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
ASEL18  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00054**2
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(18,04),LENGTH=01,ATTRB=(ASKIP)                      00057   
AGRP18  DFHMDF POS=(18,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
ADES18  DFHMDF POS=(18,15),LENGTH=25,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
************************                                                00053   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
