  PRINT  NOGEN                                                          00010000
*-------------------------------------------------------------------*   00020000
*                                                                   *   00030000
*        MAPSET  IQKM411                                            *   00040000
*        MAP     IQ411A                                             *   00050000
*        PROGRAM IQKCS411                                           *   00060000
*        TRANSID I411 - RECEIPT LOOKUP CRITERIA SPEC                *   00070000
*        SYSTEM  CICS ARCHITECTURE                                  *   00080000
*                                                                   *   00090000
*-------------------------------------------------------------------*   00100000
IQKM411 DFHMSD TYPE=MAP,                                               X00110000
               MODE=INOUT,                                             X00120000
               LANG=COBOL,                                             X00130000
               TIOAPFX=YES,                                            X00140000
               CTRL=(FREEKB)                                            00150000
IQ411A  DFHMDI LINE=2,COLUMN=1,                                        X00160000
               SIZE=(19,80),                                           X00170000
               MAPATTS=(COLOR,HILIGHT),                                X00180000
               DSATTS=(COLOR,HILIGHT)                                   00190000
*                                                                       00200000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00210000
               INITIAL='ENTER THE INFORMATION BELOW TO LIST TRANSACTIONX00220000
               S MATCHING THE CRITERIA.',                              X00230000
               LENGTH=71,                                              X00240000
               COLOR=NEUTRAL,                                          X00250000
               POS=(02,02)                                              00260000
*                                                                       00270003
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00280003
               INITIAL='SCAN THE ACCOUNT NUMBER OR PRESS TAB KEY TWICE X00290017
               TO MANUALLY ENTER:',                                    X00300017
               LENGTH=68,                                              X00310013
               COLOR=NEUTRAL,                                          X00320003
               POS=(04,02)                                              00330015
*                                                                       00340001
ACSRPOS DFHMDF ATTRB=(UNPROT,DRK),                                     X00350017
               LENGTH=1,                                               X00360003
               COLOR=NEUTRAL,                                          X00370001
               POS=(05,02)                                              00380015
*                                                                       00390017
        DFHMDF ATTRB=(UNPROT,DRK),                                     X00400017
               LENGTH=1,                                               X00410017
               COLOR=NEUTRAL,                                          X00420017
               POS=(05,04)                                              00430017
*                                                                       00440010
        DFHMDF ATTRB=(ASKIP),                                          X00450010
               LENGTH=01,POS=(05,06)                                    00460017
*                                                                       00470003
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00480003
               LENGTH=15,                                              X00490003
               COLOR=NEUTRAL,                                          X00500003
               POS=(06,03),                                            X00510015
               INITIAL='ACCOUNT NUMBER:'                                00520003
*                                                                       00530000
ATNDNBR DFHMDF ATTRB=(UNPROT,NORM),                                    X00540000
               LENGTH=12,                                              X00550003
               COLOR=GREEN,                                            X00560000
               HILIGHT=UNDERLINE,                                      X00570000
               POS=(06,19)                                              00580015
*                                                                       00590005
        DFHMDF ATTRB=(ASKIP),                                          X00600005
               LENGTH=01,POS=(06,32)                                    00610015
*                                                                       00620003
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00630003
               INITIAL='SCAN THE UPC NUMBER OR PRESS TAB KEY TO MANUALLX00640014
               Y ENTER:',                                              X00650014
               LENGTH=68,                                              X00660013
               COLOR=NEUTRAL,                                          X00670003
               POS=(08,02)                                              00680015
*                                                                       00690003
ACSRUPC DFHMDF ATTRB=(UNPROT,DRK),                                     X00700019
               LENGTH=1,                                               X00710003
               COLOR=NEUTRAL,                                          X00720003
               POS=(09,02)                                              00730015
*                                                                       00740010
        DFHMDF ATTRB=(ASKIP),                                          X00750010
               LENGTH=01,POS=(09,04)                                    00760015
*                                                                       00770000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00780000
               LENGTH=15,                                              X00790003
               COLOR=NEUTRAL,                                          X00800000
               POS=(10,03),                                            X00810015
               INITIAL='UPC NUMBER....:'                                00820003
*                                                                       00830000
AUPC    DFHMDF ATTRB=(UNPROT,NORM),                                    X00840000
               LENGTH=15,                                              X00850000
               COLOR=GREEN,                                            X00860000
               HILIGHT=UNDERLINE,                                      X00870000
               POS=(10,19)                                              00880015
*                                                                       00890000
        DFHMDF ATTRB=(ASKIP),                                          X00900000
               LENGTH=01,POS=(10,35)                                    00910015
*                                                                       00920001
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00930001
               INITIAL='STORE.........:',                              X00940003
               LENGTH=15,                                              X00950003
               COLOR=NEUTRAL,                                          X00960001
               POS=(11,03)                                              00970015
*                                                                       00980000
ASTORE  DFHMDF ATTRB=(UNPROT,NORM),                                    X00990000
               LENGTH=4,                                               X01000006
               COLOR=GREEN,                                            X01010000
               HILIGHT=UNDERLINE,                                      X01020020
               POS=(11,19)                                              01030015
*                                                                       01040003
        DFHMDF ATTRB=(ASKIP),                                          X01050003
               LENGTH=01,POS=(11,24)                                    01060015
*                                                                       01070000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X01080000
               INITIAL='SALES MONTH...:',                              X01090003
               LENGTH=15,                                              X01100003
               COLOR=NEUTRAL,                                          X01110000
               POS=(12,03)                                              01120015
ASLSMM  DFHMDF ATTRB=(UNPROT,NORM),                                    X01130003
               LENGTH=2,                                               X01140003
               COLOR=GREEN,                                            X01150000
               HILIGHT=UNDERLINE,                                      X01160020
               POS=(12,19)                                              01170015
*                                                                       01180000
ASLSYR  DFHMDF ATTRB=(UNPROT,NORM),                                    X01190003
               LENGTH=4,                                               X01200003
               COLOR=GREEN,                                            X01210000
               HILIGHT=UNDERLINE,                                      X01220000
               POS=(12,22)                                              01230015
*                                                                       01240000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X01250000
               LENGTH=9,COLOR=NEUTRAL,POS=(12,27),                     X01260015
               INITIAL='(MM YYYY)'                                      01270003
*                                                                       01280000
        DFHMDF ATTRB=(ASKIP),                                          X01290000
               LENGTH=01,POS=(12,71)                                    01300015
*                                                                       01310000
        DFHMSD TYPE=FINAL                                               01320000
         END                                                            01330000
