000100******************************************************************00010000
000200**                        IQWS004                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR           **00040000
000500**  IQ TRANSACTION INQUIRY.                                     **00050000
000600**  LENGTH:  200 BYTES                                          **00060000
000700******************************************************************00070000
000800         10  IQ004-INTER-APPL-COMMAREA  REDEFINES                 00080000
000900             INTER-APPL-COMM-AREA.                                00090000
001000             15  FILLER                         PIC X(01).        00100000
001100             15  IQ004-NUMBER-OF-SELECTED-ITEMS PIC S9(09)        00110000
001200                                                    COMP-3.       00120000
001300             15  IQ004-NUMBER-OF-TS-ITEMS       PIC S9(05)        00130000
001400                                                    COMP-3.       00140000
001500             15  IQ004-SEL-QUEUE-NAME           PIC X(8).         00150000
002100             15  FILLER                         PIC X(183).       00210001
