000100******************************************************************00010000
000200**                        IQWS002                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040000
000500**  RECEIPT LOOKUP CRITERIA SPECIFICATION (I411).               **00050000
000600**  LENGTH:  200 BYTES                                          **00060000
000700******************************************************************00070000
000800         10  IQ002-INTER-APPL-COMMAREA  REDEFINES                 00080000
000900             INTER-APPL-COMM-AREA.                                00090000
001000             15  FILLER                         PIC X(01).        00100000
001100             15  IQ002-SALES-DATE-FROM          PIC X(10).        00110000
001200             15  IQ002-SALES-DATE-TO            PIC X(10).        00120000
001300             15  IQ002-STORE                    PIC S9(04) COMP.  00130000
002100             15  IQ002-TENDER-ID                PIC X(33).        00210000
002600             15  IQ002-UPC-NBR                  PIC S9(15) COMP-3.00260000
003200             15  FILLER                         PIC X(136).       00320002
