000100*----------------------------------------------------------------*00010000
000200*                         IQWS003                                *00020000
000300*                                                                *00030000
000400*   THIS IS TS QUEUE RECORD LAYOUT USED IN STORE INQUIRY PROGRAMS*00040006
000500*   TO PASS SELECTED TRANSACTION INFORMATION.                    *00050000
000800*----------------------------------------------------------------*00080000
000900                                                                  00090000
001000 01  IQ003-TRANSACTION-SEL-REC.                                   00100000
001100       05  IQ003-SELECTED-ITEMS         PIC S9(05)  COMP-3        00110000
001200                                                    VALUE ZERO.   00120000
001300       05  IQ003-MAX-ITEMS              PIC  9(02)  VALUE 20.     00130000
001400       05  IQ003-SELECTED-ITEM-ARRAY.                             00140000
001500           10  FILLER                   OCCURS 20 TIMES           00150000
001600                                        INDEXED BY IQ003-IDX.     00160000
001700               15  IQ003-ITEM           PIC S9(09)  COMP-3.       00170000
001710               15  IQ003-ACTION-SW      PIC  X(01).               00171003
001720                   88  IQ003-INQ                    VALUE 'I'.    00172003
001730                   88  IQ003-UPD                    VALUE 'U'.    00173003
001740                   88  IQ003-DEL                    VALUE 'D'.    00174003
001750                   88  IQ003-ERR                    VALUE 'E'.    00175003
001760                   88  IQ003-REV                    VALUE 'R'.    00176003
001800               15  IQ003-SALES-DATE     PIC  X(10).               00180002
002400               15  IQ003-KEY-DATA.                                00240000
002500                   20  IQ003-PARTITION  PIC S9(04)  COMP.         00250000
002510                   20  IQ003-DB-STRUC-CDE                         00251004
002520                                        PIC  X(01).               00252004
002530                   20  IQ003-SALES-DATE-ISO                       00253005
002540                                        PIC  X(10).               00254005
002600                   20  IQ003-STORE      PIC S9(04)  COMP.         00260000
002700                   20  IQ003-REGISTER   PIC S9(04)  COMP.         00270000
002800                   20  IQ003-TRANS      PIC S9(04)  COMP.         00280000
003100                   20  IQ003-START-TIME PIC  X(08).               00310000
003300                   20  IQ003-SALES-CORR-SEQ-NBR                   00330000
003400                                        PIC S9(04)  COMP.         00340000
