       IDENTIFICATION DIVISION.                                                 
       PROGRAM-ID.         ISKUT004.                                            
       AUTHOR.             JEFF ROUBIK.                                         
       INSTALLATION.       KOHLS DEPARTMENT STORES.                             
       DATE-WRITTEN.       JULY 2000.                                           
                                                                                
      ***************************************************************           
      *  THIS PROGRAM IS CALLED FROM OTHER CICS PROGRAMS TO PASS                
      *  MESSAGES TO NETCOOL. ISKUT003 IS IT'S BATCH EQUIVILANT.                
      *--------------------------------------------------------------           
      *  JJR  07/06/2000  CREATED.                                              
      *  JJR  03/09/2001  CHANGED TO USE MQSERIES ROUTINE TO GET                
      *                   REASON DESCRIPTIONS.                                  
      ***************************************************************           
                                                                                
       DATA DIVISION.                                                           
       WORKING-STORAGE SECTION.                                                 
                                                                                
       01  PC-PGM-NAME              PIC X(8) VALUE "ISKUT004".                  
                                                                                
           COPY ISWS005.                                                        
           COPY ISWS004.                                                        
           COPY ISPD004.                                                        
           COPY ISPD005.                                                        
                                                                                
                                                                                
       1002-GET-JOB-INFO.                                                       
                                                                                
           MOVE 'CSQCCONN' TO WS-MQCONN.                                        
           MOVE 'CSQCPUT1' TO WS-MQPUT1.                                        
           MOVE 'CSQCDISC' TO WS-MQDISC.                                        
                                                                                
           EXEC CICS ASSIGN                                                     
               APPLID  (PV-APPLID)                                              
               PROGRAM (PV-PROG)                                                
               USERID  (PV-USERID)                                              
           END-EXEC.                                                            
                                                                                
           IF PV-APPLID (1:5) = 'CICSP'                                         
               SET PV-PROD-ENVIRONMENT TO TRUE                                  
           ELSE                                                                 
               SET PV-TEST-ENVIRONMENT TO TRUE                                  
           END-IF.                                                              
