000100 9800-REMOVE-EMPTY-TAGS.                                                  
000200                                                                          
000300     UNSTRING PV-XML(1:XML-LENGTH)                                        
000400       DELIMITED BY IS012-EMPTY-TAG(1:IS012-EMPTY-TAG-LENGTH)             
000500               INTO IS012-BEFORE COUNT IS012-BEFORE-CNT.                  
000600                                                                          
000700     PERFORM UNTIL IS012-BEFORE-CNT = XML-LENGTH                          
000800       COMPUTE IS012-AFTER-CNT = IS012-BEFORE-CNT                         
000900             + IS012-EMPTY-TAG-LENGTH + 1                                 
001000       MOVE PV-XML TO IS012-AFTER                                         
001100       STRING IS012-BEFORE(1:IS012-BEFORE-CNT)                            
001200              IS012-AFTER(IS012-AFTER-CNT:XML-LENGTH)                     
001300         DELIMITED BY SIZE INTO PV-XML                                    
001400       COMPUTE XML-LENGTH = XML-LENGTH - IS012-EMPTY-TAG-LENGTH           
001500                                                                          
001600       UNSTRING PV-XML(1:XML-LENGTH)                                      
001610         DELIMITED BY IS012-EMPTY-TAG(1:IS012-EMPTY-TAG-LENGTH)           
001800                 INTO IS012-BEFORE COUNT IS012-BEFORE-CNT                 
001900     END-PERFORM.                                                         
