      *****************************************************************         
      **                                                                        
      **   Lookup XML-CODE Descriptions for COBOL XML Parser                    
      **   This routine is used to aid in debugging the XML PARSE               
      **   and XML GENERATE commands in a COBOL program.  When called           
      **   an XML-MSG array is filled with a description of the                 
      **   XML-CODE value.                                                      
      **   This copybook is used in conjunction with ISPD007.                   
      **                                                                        
      *****************************************************************         
                                                                                
       01  XML-RESPONSE-LINES          PIC 9    VALUE ZERO.                     
       01  XML-RESPONSE-MESSAGE.                                                
           05  XML-MSG                                                          
               OCCURS 0 TO 9 TIMES                                              
               DEPENDING ON XML-RESPONSE-LINES.                                 
               10                       PIC X(04).                              
               10  XML-DESCRIPTION      PIC X(50).                              
                                                                                
       01  XML-LINE-IDX                PIC 9    VALUE ZERO.                     
                                                                                
      * THESE FIELDS ARE FOR INTERNAL USE ONLY.                                 
       01  XML-RESPONSE-CODE           PIC ---------9.                          
       01  XML-SPACE-CNT               PIC 99.                                  
