000100*****************************************************************         
000200**                                                                        
000300**   Use DISPLAY statements to print out a formatted XML message.         
000400**   This routine is used to aid in debugging the XML PARSE               
000500**   and XML GENERATE commands in a COBOL program by formatting           
000600**   an XML message into a more readable format.                          
000700**                                                                        
000800**   This copybook is used in conjunction with ISPDXMG.                   
000900**   Your program must include the following copybooks:                   
001000**       ISWSXME                                                          
001100**       ISWSXMF                                                          
001200**       ISPDXME                                                          
001300**       ISPDXMF                                                          
001400**       ISPDXMG                                                          
001500*****************************************************************         
001600                                                                          
001700 01  XML-FMT-IDX                  PIC 99999      VALUE ZERO.              
001800 01  XML-FMT-LINE                 PIC 99999      VALUE ZERO.              
001900 01  XML-BK                       PIC 999999     VALUE ZERO.              
002000 01  XML-SPACES                   PIC X(120)     VALUE SPACES.            
