      *****************************************************************         
      **                                                                        
      **   MQSERIES COMPLETION & REASON CODE TABLES FOR BATCH.                  
      **   USED IN CONJUCTION WITH ISPD002.                                     
      **   CICS VERSION OF THIS IS ISWS005.                                     
      **                                                                        
      *****************************************************************         
       01  IS-MQCHECK                       PIC X(8)  VALUE 'MQR2C'.            
       01  IS-COMPLETION                    PIC 9(4)  VALUE ZERO.               
       01  IS-COMPLETION-MAX                PIC 9(4)  VALUE 4.                  
       01  IS-COMPLETION-CODE-TABLE.                                            
           05  PIC X(9)  VALUE '0 OK     '.                                     
           05  PIC X(9)  VALUE '1 WARNING'.                                     
           05  PIC X(9)  VALUE '2 FAILED '.                                     
           05  PIC X(9)  VALUE '9 UNKNOWN'.                                     
       01  FILLER  REDEFINES  IS-COMPLETION-CODE-TABLE.                         
           05  FILLER  OCCURS 4 TIMES.                                          
               10  IS-COMPLETION-CODE       PIC 9(1).                           
               10                           PIC X(1).                           
               10  IS-COMPLETION-CODE-DESC  PIC X(7).                           
                                                                                
       01  IS-REASON-TEXT          PIC X(25).                                   
