000010 01  IS012-EMPTY-TAG        PIC X(5000)     VALUE SPACES.                 
000020 01  IS012-EMPTY-TAG-LENGTH PIC 9(06)       VALUE 0.                      
000100 01  IS012-BEFORE           PIC X(99999).                                 
000200 01  IS012-AFTER            PIC X(99999).                                 
000300 01  IS012-BEFORE-CNT       PIC 9(09)       VALUE ZERO.                   
000400 01  IS012-AFTER-CNT        PIC 9(09)       VALUE ZERO.                   
