      ******************************************************************        
      * BUSINESS OBJECTS REPORT RESPONSE COPYBOOK.                              
      *                                                                         
      * !! ENSURE THAT ANY CHANGES MADE TO THIS COPYBOOK ARE MADE IN            
      *    BOTH 01 LEVELS TO KEEP THEM IN SYNC WITH EACH OTHER.                 
      *    THE 01 LEVELS ARE USED FOR MAPPING COPYBOOK FIELDS TO                
      *    XML TAGS, SO THEY NEED TO MATCH !!                                   
      ******************************************************************        
                                                                                
       01  IS011-REPORT-RESPONSE.                                               
           05  IS011-REQUEST-ID              PIC X(48) VALUE SPACES.            
           05  IS011-OVERALL-STATUS          PIC X(07) VALUE SPACES.            
               88  IS011-SUCCESS                 VALUE "SUCCESS".               
               88  IS011-FAILURE                 VALUE "FAILURE".               
               88  IS011-TIMEOUT                 VALUE "TIMEOUT".               
           05  IS011-TITLE                   PIC X(50) VALUE SPACES.            
           05  IS011-FOLDER-PATH             PIC X(150) VALUE SPACES.           
           05  IS011-OUTPUT-FORMAT           PIC X(15) VALUE SPACES.            
           05  IS011-DESTINATION-TYPE        PIC X(15) VALUE SPACES.            
           05  IS011-DESTINATION-PATH        PIC X(225) VALUE SPACES.           
           05  IS011-DESTINATION-FILE-NAME   PIC X(50) VALUE SPACES.            
           05  IS011-REPORT-ID               PIC X(10) VALUE ZERO.              
           05  IS011-NUM-ERRORS              PIC 9(02).                         
           05  IS011-ERROR-LIST.                                                
               10  IS011-ERRORS              PIC X(50)                          
                                         OCCURS 0 TO 20 TIMES                   
                                         DEPENDING ON IS011-NUM-ERRORS.         
           05  FILLER                        PIC X(100).                        
                                                                                
      *01  reportReturn REDEFINES IS011-REPORT-RESPONSE.                        
       01  reportReturn.                                                        
           05  uniqueRequestId                PIC X(48).                        
           05  overallStatus                  PIC X(07).                        
           05  reportTitle                    PIC X(50).                        
           05  folderPath                     PIC X(150).                       
           05  outputFormat                   PIC X(15).                        
           05  destinationType                PIC X(15).                        
           05  destinationPath                PIC X(225).                       
           05  destinationFileName            PIC X(50).                        
           05  reportId                       PIC X(10).                        
           05  numOfErrors                    PIC 9(02).                        
           05  errorList.                                                       
               10  errors                     PIC X(50)                         
                                      OCCURS 0 TO 20 TIMES                      
                                      DEPENDING ON numOfErrors                  
                                      VALUE SPACES.                             
           05  filler                         PIC X(100).                       
