001700***                 COPY BOOK  ISWS006                                    
001800***  NON-INTELLIGENT SKU RE-FORMATTING WORK FIELDS                        
001900 01  NI-SKU-WORK-AREAS.                                                   
002000     05 NI-DEPT-9-4                    PIC S9(04) COMP-3.                 
002100                                                                          
002200     05 NI-DEPT                        PIC X(04).                         
002300     05 NI-DEPT-9    REDEFINES NI-DEPT PIC 9(04).                         
002400                                                                          
002500     05 NI-DEPT-X-3                    PIC X(03).                         
002600     05 NI-DEPT-9-3  REDEFINES NI-DEPT-X-3                                
002700                                       PIC 9(03).                         
002800                                                                          
002900                                                                          
003000     05 NI-CLASS-9-4                   PIC S9(04) COMP-3.                 
003100                                                                          
003200     05 NI-CLASS                       PIC X(04).                         
003300     05 NI-CLASS-9   REDEFINES NI-CLASS                                   
003400                                       PIC 9(04).                         
003500                                                                          
003600     05 NI-CLASS-X-2                   PIC X(02).                         
003700     05 NI-CLASS-9-2 REDEFINES NI-CLASS-X-2                               
003800                                       PIC 9(02).                         
003900                                                                          
004000                                                                          
004100     05 NI-SUB-CLASS-9-4               PIC S9(04) COMP-3.                 
004200                                                                          
004300     05 NI-SUB-CLASS                   PIC X(04).                         
004400     05 NI-SUB-CLASS-9   REDEFINES NI-SUB-CLASS                           
004500                                       PIC 9(04).                         
004600                                                                          
004700     05 NI-SUB-CLASS-X-2               PIC X(02).                         
004800     05 NI-SUB-CLASS-9-2 REDEFINES NI-SUB-CLASS-X-2                       
004900                                       PIC 9(02).                         
005000                                                                          
005100                                                                          
005200     05 NI-SKU-9-8                     PIC S9(08) COMP-3.                 
005300                                                                          
005400     05 NI-SKU                         PIC X(08).                         
005500     05 NI-SKU-9     REDEFINES NI-SKU  PIC 9(08).                         
