      *****************************************************************         
      **                        ISWS003                               *         
      **                                                              *         
      **  THIS IS THE PARAMETER LAYOUT FOR CALLED SUBROUTINE ISKUT003 *         
      *****************************************************************         
       01  IS003-NETCOOL-ALERT.                                                 
                                                                                
      *** VALUES PASSED TO ALERT PROGRAM. ***                                   
           05  IS003-ALERT-PROGRAM    PIC X(008)  VALUE 'ISKUT003'.             
               88  IS003-BATCH                    VALUE 'ISKUT003'.             
               88  IS003-CICS                     VALUE 'ISKUT004'.             
           05  IS003-VERSION          PIC 9(003)  VALUE 001.                    
               88  IS003-VERSION-1                VALUE 001.                    
               88  IS003-VALID-VERSION            VALUE 001.                    
           05  IS003-SYSTEM-ID        PIC X(002).                               
           05  IS003-TYPE             PIC 9(004).                               
               88  IS003-PROBLEM-ALERT            VALUE 0001.                   
               88  IS003-RESOLUTION-ALERT         VALUE 0002.                   
           05  IS003-SEVERITY         PIC 9(004).                               
               88  IS003-ALL-CLEAR                VALUE 0000.                   
               88  IS003-INTERMEDIATE             VALUE 0001.                   
               88  IS003-WARNING                  VALUE 0002.                   
               88  IS003-MINOR-ALERT              VALUE 0003.                   
               88  IS003-MAJOR-ALERT              VALUE 0004.                   
               88  IS003-CRITICAL                 VALUE 0005.                   
               88  IS003-PROBLEM-SEVERITY         VALUE 0001                    
                                                   THRU 0005.                   
           05  IS003-AUTOMATION-LABEL PIC X(008).                               
           05  FILLER                 PIC X(635).                               
           05  IS003-SUMMARY          PIC X(255).                               
                                                                                
      *** VALUES RETURNED FROM ALERT PROGRAM. ***                               
           05  IS003-RETURN-CODE      PIC 9(001).                               
               88  IS003-OK                       VALUE 0.                      
               88  IS003-INFO-MSG                 VALUE 1.                      
               88  IS003-ERROR                    VALUE 9.                      
           05  IS003-MESSAGE          PIC X(080).                               
                                                                                
       01  IS003-CICS-COMMAREA        PIC X(001)  VALUE SPACE.                  
