       IDENTIFICATION DIVISION.                                         00010000
       PROGRAM-ID.    MAKUT010.                                         00020000
       AUTHOR.        GEORGETTE GILPIN.                                 00030000
       DATE-WRITTEN.  OCTOBER 05, 1999.                                 00040000
      ***************************************************************** 00050000
      *          MA - ONHAND/ONORDER EXTRACT                          * 00060096
      ***************************************************************** 00070000
      *    THE PURPOSE OF THIS PROGRAM IS TO MATCH UNLOADS OF TSK,    * 00080096
      *    TSKST, TSKSTOO AND BUILD THE RELOAD OF THE MA              * 00090096
      *    ONHAND/ONORDER TABLE.                                      * 00100096
      ***************************************************************** 00110000
      * MODIFICATION LOG                                              * 00130001
      * WR5207 - ANN SUN  10-19-1999                                  * 00140001
      *    - ADDED LOGIC TO HANDLE REGIONAL CLEARANCE PRICING CHNAGE. * 00150001
      *      CHECK THE SKU STORE STATUS FROM TUPCPLS TABLE.           * 00160001
      * WR21065- ANN SUN  06-26-2000                                  * 00170071
      *    - ADDED CODE TO BRIDGE CS CLEARANCE ONHAND QTY.            * 00180046
      *    -LOG AS AS002.                                             * 00190075
      * WR21736- LINDA GRIESBACH 12-22-2000                           * 00200095
      *    - ADDED MOVE OF ONORDER QTY TO THE OUTPUT RCD.             * 00210095
      * WR????? - CHRIS LEADLEY 01-05-2002                            * 00211099
      *    - ADDED LOGIC TO INCLUDE THE 873 ECOMMERCE LOCATION        * 00212099
      *      IN THE EXTRACT OF CLEARANCE ON HAND QTYS FOR CENTRAL     * 00213099
      *      STOCK LOCATIONS, SINCE CS PULLS CAN NOW BE DONE FROM     * 00214099
      *      873 IN THE ALLOCATION SYSTEM.                            * 00215099
      * WR????? - LINDA GRIESBACH 03-01-02                            * 00216099
      *    - REMOVED CODE TO BRIDGE CS CLEARANCE ONHAND QTY.          * 00217099
      * WR21120 - LINDA GRIESBACH 06-30-03                            * 00218099
      *    - NI SKU                                                   * 00219099
      * WR25478 - LINDA GRIESBACH 11-17-04                            * 00219199
      *    - STORE NBR EXPANSION                                      * 00219499
C11956* CHG0211956 -COGNIZANT 10-26-18                                * 00219599
C11956*    - INCLUDED LOGIC TO HANDLE THE SEARCH ITEM IN TSKXREF      * 00219699
C11956*      WHEN THE RENUMBERED SKUS ARE NOT FOUND IN IT.            * 00219799
      ***************************************************************** 00220001
                                                                        00230099
       ENVIRONMENT DIVISION.                                            00240000
       INPUT-OUTPUT SECTION.                                            00250000
       FILE-CONTROL.                                                    00260000
           SELECT SKU-UNLOAD-FILE                                       00270000
               ASSIGN TO INP01.                                         00280000
                                                                        00290099
           SELECT STORE-INV-UNLOAD-FILE                                 00300000
               ASSIGN TO INP02.                                         00310000
WR5207                                                                  00320099
WR5207     SELECT RCP-UNLOAD-FILE                                       00330002
WR5207         ASSIGN TO INP03.                                         00340002
                                                                        00350099
21120      SELECT TSKXREF-UNLOAD-FILE                                   00351099
21120          ASSIGN TO INP04.                                         00352099
                                                                        00353099
           SELECT SKU-STORE-INV-EXTRACT-FILE                            00360000
               ASSIGN TO OUT01.                                         00370000
                                                                        00380099
       DATA DIVISION.                                                   00390000
       FILE SECTION.                                                    00400000
       FD  STORE-INV-UNLOAD-FILE                                        00410000
           RECORDING MODE IS F                                          00420000
           BLOCK CONTAINS 0 RECORDS.                                    00430000
21736  01  STORE-INV-UNLOAD-RECORD         PIC  X(021).                 00440099
                                                                        00450099
       FD  SKU-UNLOAD-FILE                                              00460000
           RECORDING MODE IS F                                          00470000
           BLOCK CONTAINS 0 RECORDS.                                    00480000
21120  01  SKU-UNLOAD-RECORD               PIC  X(035).                 00490099
WR5207                                                                  00500099
WR5207 FD  RCP-UNLOAD-FILE                                              00510002
WR5207     RECORDING MODE IS F                                          00520002
WR5207     BLOCK CONTAINS 0 RECORDS.                                    00530002
WR5207 01  RCP-UNLOAD-RECORD               PIC  X(012).                 00540078
                                                                        00541099
21120  FD  TSKXREF-UNLOAD-FILE                                          00542099
21120      RECORDING MODE IS F                                          00543099
21120      BLOCK CONTAINS 0 RECORDS.                                    00544099
21120  01  TSKXREF-UNLOAD-RECORD           PIC  X(019).                 00545099
                                                                        00550099
       FD  SKU-STORE-INV-EXTRACT-FILE                                   00560000
           RECORDING MODE IS F                                          00570000
           BLOCK CONTAINS 0 RECORDS.                                    00580000
       01  SKU-STORE-INV-EXTRACT-RECORD    PIC  X(109).                 00590099
                                                                        00600099
       WORKING-STORAGE SECTION.                                         00610000
                                                                        00620000
       01  PV-PROGRAM-VARIABLES.                                        00630000
           05  PV-SKUINV-OUTPUT-RECS       PIC  9(11) VALUE ZERO.       00640099
           05  PV-STR-NBR-1                PIC  S9(4) COMP-3.           00660099
           05  PV-STR-NBR-2                PIC  S9(4).                  00661099
           05  PV-STR-NBR-3                PIC  9(4).                   00661199
           05  PV-STR-NBR-4                PIC  X(4).                   00662099
21120      05  PV-ABEND-CODE               PIC S9(04) COMP SYNC         00670099
21120                                                 VALUE +4001.      00680099
21120      05  PV-WORK-ITEM-NBR            PIC  9(15).                  00690099
21120      05  PV-WORK-PREV-ITEM-NBR       PIC  S9(15)                  00690199
21120                                                 COMP-3            00690299
21120                                                 VALUE 0.          00690399
21120      05  PV-WORK-DEPT-X              PIC  9(04).                  00691099
21120      05  PV-WORK-SUBCLASS-X          PIC  9(04).                  00700099
21120      05  PV-WORK-SKU-X               PIC  9(08).                  00710099
21120      05  PV-WORK-DEPT-Y.                                          00720099
21120          10  PV-WORK-DEPT-Y-1        PIC  X(01).                  00720199
21120          10  PV-WORK-DEPT-Y-2-4      PIC  X(03).                  00720299
21120      05  PV-WORK-SUBCLASS-Y.                                      00721099
21120          10  PV-WORK-SUBCLASS-Y-1-2  PIC  X(02).                  00721199
21120          10  PV-WORK-SUBCLASS-Y-3-4  PIC  X(02).                  00721299
21120      05  PV-WORK-SKU-Y.                                           00721399
21120          10  PV-WORK-SKU-Y-1         PIC  X(01).                  00721499
21120          10  PV-WORK-SKU-Y-2-8       PIC  X(07).                  00721599
                                                                        00730099
           05  PV-SKU.                                                  00740000
               10  PV-SKU-DEPT             PIC  X(03) VALUE SPACE.      00750099
               10  FILLER                  PIC  X(01) VALUE '-'.        00760099
               10  PV-SKU-CLASS            PIC  X(02) VALUE SPACE.      00770099
               10  FILLER                  PIC  X(01) VALUE '-'.        00780099
21120          10  PV-SKU-NI-SKU           PIC  X(08) VALUE SPACE.      00790099
21120          10  FILLER                  PIC  X(05) VALUE SPACE.      00800099
                                                                        00810099
       01  PC-PROGRAM-CONSTANTS.                                        00830000
           05  PC-I                        PIC  X(01) VALUE 'I'.        00840099
                                                                        00910000
       01  PS-PROGRAM-SWITCHES.                                         00920000
21120      05  PS-ITEM-FOUND-SW            PIC  X(01) VALUE 'N'.        00930099
21120          88  PS-ITEM-FOUND                      VALUE 'Y'.        00940099
21120          88  PS-ITEM-NOT-FOUND                  VALUE 'N'.        00940199
21120      05  PS-ITEM-MISSING-SW          PIC  X(01) VALUE 'N'.        00940299
21120          88  PS-ITEM-MISSING                    VALUE 'Y'.        00940399
21120          88  PS-ITEM-NOT-MISSING                VALUE 'N'.        00940499
21120      05  PS-TSKXREF-PROCESS-SW       PIC  X(01) VALUE 'N'.        00940599
21120          88  PS-TSKXREF-END-PROCESS             VALUE 'Y'.        00940699
21120          88  PS-TSKXREF-NOT-END-PROCESS         VALUE 'N'.        00940799
           05  PS-END-TSKST-SW             PIC  X(01) VALUE 'N'.        00941099
               88  PS-END-TSKST                       VALUE 'Y'.        00942099
           05  PS-END-TSK-SW               PIC  X(01) VALUE 'N'.        00950099
               88  PS-END-TSK                         VALUE 'Y'.        00960099
WR5207     05  PS-END-RCP-SW               PIC  X(01) VALUE 'N'.        00970099
WR5207         88  PS-END-RCP                         VALUE 'Y'.        00980099
21120      05  PS-END-TSKXREF-SW           PIC  X(01) VALUE 'N'.        00990099
21120          88  PS-END-TSKXREF                     VALUE 'Y'.        01000099
                                                                        01020099
      ******************************************************************01030000
      *  RECORD LAYOUT FOR THE TSK UNLOAD FILE.                         01040000
      ******************************************************************01050000
           COPY MARD010.                                                01060000
                                                                        01070099
      ******************************************************************01080000
      *  RECORD LAYOUT FOR THE COMBINED TSKST AND TSKSTOO RECORD        01090088
      ******************************************************************01100000
           COPY MARD011.                                                01110000
                                                                        01120099
WR5207******************************************************************01130002
WR5207*  RECORD LAYOUT FOR THE TUPCPLS UNLOAD FILE                      01140002
WR5207******************************************************************01150002
WR5207     COPY MARD012.                                                01160002
                                                                        01170099
      ******************************************************************01170299
      *  RECORD LAYOUT FOR THE TSKXREF RECORD                           01170399
      ******************************************************************01170499
21120  01  PV-TSKXREF-REC.                                              01171099
21120      05  PV-TSKXREF-ITM-NBR          PIC  S9(15)                  01172099
21120                                                 COMP-3.           01173099
21120      05  PV-TSKXREF-DEPT             PIC  S9(4) COMP-3.           01174099
21120      05  PV-TSKXREF-SUBCLASS         PIC  S9(4) COMP-3.           01175099
21120      05  PV-TSKXREF-SKU              PIC  S9(8) COMP-3.           01176099
                                                                        01177099
      ******************************************************************01180000
      *  RECORD LAYOUT FOR THE SKU STORE INVENTORY EXTRACT FILE.        01190000
      ******************************************************************01200000
           COPY MARD021.                                                01210000
                                                                        01210199
                                                                        01219199
               EJECT                                                    01220000
       PROCEDURE DIVISION.                                              01530099
                                                                        01540099
       0000-MAINLINE.                                                   01550000
      ******************************************************************01560000
      *  CONTROLS THE ENTIRE FLOW OF THE PROGRAM.                       01570000
      *    -- OPEN FILES                                                01580000
      *    -- PERFORM MAIN PROCESSING LOOP                              01590000
      *    -- CLOSE FILES                                               01600000
      *    -- DISPLAY COUNT                                             01610000
      *    -- RETURN CONTROL TO SYSTEM                                  01620000
      ******************************************************************01630000
           OPEN OUTPUT SKU-STORE-INV-EXTRACT-FILE                       01640000
                 INPUT SKU-UNLOAD-FILE                                  01650000
                       STORE-INV-UNLOAD-FILE                            01660021
                       RCP-UNLOAD-FILE                                  01670099
                       TSKXREF-UNLOAD-FILE.                             01671099
                                                                        01680000
           PERFORM 1000-PROCESS-DATABASE.                               01690000
                                                                        01700084
           CLOSE SKU-STORE-INV-EXTRACT-FILE                             01720073
                 SKU-UNLOAD-FILE                                        01730073
                 RCP-UNLOAD-FILE                                        01740021
                 TSKXREF-UNLOAD-FILE                                    01741099
                 STORE-INV-UNLOAD-FILE.                                 01750000
                                                                        01760000
           DISPLAY 'EXTRACT RECORDS WRITTEN -- '                        01770000
                   PV-SKUINV-OUTPUT-RECS.                               01780000
                                                                        01790000
           STOP RUN.                                                    01800000
                                                                        01810099
       1000-PROCESS-DATABASE.                                           01820000
      *----------------------------------------------------------------*01830000
      *                                                                *01840000
      *    THIS STARTS THE PROCESS.  THE PO CURSOR DRIVES ALL OTHER    *01850000
      *    LOGIC.  FOR EACH ROW RETURNED, OPEN THE OTHER CURSORS AND   *01860000
      *    EXTRACT/ACCUMULATE DATA FOR THE OUTPUT RECORD.              *01870000
      *                                                                *01880000
      *----------------------------------------------------------------*01890000
           PERFORM 7000-READ-TSKST-UNLOAD.                              01900000
                                                                        01910000
           PERFORM 7100-READ-TSK-UNLOAD.                                01920000
                                                                        01930000
WR5207     PERFORM 7200-READ-RCP-UNLOAD.                                01940002
                                                                        01950001
21120      MOVE ZEROS TO PV-TSKXREF-ITM-NBR.                            01951099
                                                                        01952099
           PERFORM 1200-PROCESS-SKUINV-CURSOR                           01960000
               UNTIL PS-END-TSK                                         01970000
                  OR PS-END-TSKST.                                      01980000
                                                                        01990099
       1200-PROCESS-SKUINV-CURSOR.                                      02000000
      *----------------------------------------------------------------*02010000
      *                                                                *02020000
      *    THIS IS THE LOGIC TO PROCESS EACH SKU INVENTORY ROW READ.   *02030000
      *                                                                *02040000
      *----------------------------------------------------------------*02050000
           IF  MA010-ITEM-NMBR < MA011-ITEM-NMBR                        02060003
               PERFORM  7100-READ-TSK-UNLOAD                            02070000
                  UNTIL PS-END-TSK                                      02080000
                     OR MA010-ITEM-NMBR NOT LESS THAN MA011-ITEM-NMBR.  02090000
                                                                        02100000
           IF  MA010-ITEM-NMBR = MA011-ITEM-NMBR                        02110003
               IF PS-END-RCP                                            02120089
21120              IF PV-TSKXREF-ITM-NBR = MA011-ITEM-NMBR              02120199
21120                  PERFORM 8000-WRITE-EXTRACT                       02120299
21120              ELSE                                                 02120399
21120                  SET PS-ITEM-NOT-FOUND          TO TRUE           02121099
21120                  SET PS-ITEM-NOT-MISSING        TO TRUE           02122099
21120                  SET PS-TSKXREF-NOT-END-PROCESS TO TRUE           02122199
21120                  PERFORM 9000-PROCESS-TSKXREF                     02123099
21120                     THRU 9000-EXIT                                02123199
21120                    UNTIL PS-TSKXREF-END-PROCESS                   02123299
21120                  IF PS-ITEM-FOUND                                 02124099
21120                      PERFORM 8000-WRITE-EXTRACT                   02130099
21120                  END-IF                                           02131099
21120              END-IF                                               02132099
                   PERFORM 7000-READ-TSKST-UNLOAD                       02140089
               ELSE                                                     02150089
                   PERFORM 1500-CHECK-RCP-DATA                          02160089
               END-IF                                                   02170089
           ELSE                                                         02180039
               PERFORM 7000-READ-TSKST-UNLOAD                           02190039
           END-IF.                                                      02200039
                                                                        02201099
WR5207 1500-CHECK-RCP-DATA.                                             02210004
      *----------------------------------------------------------------*02220004
      *    -WR5207                                                     *02230004
      *    THIS IS THE LOGIC TO CHECK WHETHER RCP CLEARANCE OF THIS    *02240004
      *    SKU STORE.                                                  *02250004
      *                                                                *02260004
      *----------------------------------------------------------------*02270004
           IF MA011-ITEM-NMBR > MA012-ITM-NBR                           02280007
             PERFORM 7200-READ-RCP-UNLOAD                               02290005
               UNTIL PS-END-RCP                                         02300005
                 OR MA011-ITEM-NMBR NOT GREATER THAN MA012-ITM-NBR.     02310007
                                                                        02320099
           MOVE MA012-STR-NBR TO PV-STR-NBR-1.                          02330099
           MOVE PV-STR-NBR-1  TO PV-STR-NBR-2.                          02331099
           MOVE PV-STR-NBR-2  TO PV-STR-NBR-3.                          02331199
           MOVE PV-STR-NBR-3  TO PV-STR-NBR-4.                          02332099
           IF MA011-ITEM-NMBR = MA012-ITM-NBR                           02350007
               IF MA011-STORE-NMBR > PV-STR-NBR-4                       02360099
                   PERFORM 7200-READ-RCP-UNLOAD                         02370006
               END-IF                                                   02380033
               IF MA011-STORE-NMBR < PV-STR-NBR-4                       02390099
21120              IF PV-TSKXREF-ITM-NBR = MA011-ITEM-NMBR              02391099
21120                  PERFORM 8000-WRITE-EXTRACT                       02392099
21120              ELSE                                                 02392199
21120                  SET PS-ITEM-NOT-FOUND          TO TRUE           02392299
21120                  SET PS-ITEM-NOT-MISSING        TO TRUE           02392399
21120                  SET PS-TSKXREF-NOT-END-PROCESS TO TRUE           02392499
21120                  PERFORM 9000-PROCESS-TSKXREF                     02393099
21120                     THRU 9000-EXIT                                02393199
21120                    UNTIL PS-TSKXREF-END-PROCESS                   02393299
21120                  IF PS-ITEM-FOUND                                 02394099
21120                      PERFORM 8000-WRITE-EXTRACT                   02400099
21120                  END-IF                                           02401099
21120              END-IF                                               02402099
                   PERFORM 7000-READ-TSKST-UNLOAD                       02410034
               END-IF                                                   02420033
               IF MA011-STORE-NMBR = PV-STR-NBR-4                       02430099
                   PERFORM 7000-READ-TSKST-UNLOAD                       02440089
               END-IF                                                   02450033
           END-IF.                                                      02460089
           IF MA011-ITEM-NMBR < MA012-ITM-NBR                           02470089
21120          IF PV-TSKXREF-ITM-NBR = MA011-ITEM-NMBR                  02470199
21120              PERFORM 8000-WRITE-EXTRACT                           02470299
21120          ELSE                                                     02472099
21120              SET PS-ITEM-NOT-FOUND          TO TRUE               02472199
21120              SET PS-ITEM-NOT-MISSING        TO TRUE               02472299
21120              SET PS-TSKXREF-NOT-END-PROCESS TO TRUE               02472399
21120              PERFORM 9000-PROCESS-TSKXREF                         02473099
21120                 THRU 9000-EXIT                                    02473199
21120                UNTIL PS-TSKXREF-END-PROCESS                       02473299
21120              IF PS-ITEM-FOUND                                     02474099
21120                  PERFORM 8000-WRITE-EXTRACT                       02480099
21120              END-IF                                               02481099
21120      END-IF                                                       02482099
               PERFORM 7000-READ-TSKST-UNLOAD                           02490099
           END-IF.                                                      02500089
                                                                        02510099
                                                                        02520099
       7000-READ-TSKST-UNLOAD.                                          02530020
             READ STORE-INV-UNLOAD-FILE                                 02540019
                 INTO MA011-TSKST-UNLOAD-RECORD                         02550019
               AT END                                                   02560019
                 SET PS-END-TSKST TO TRUE.                              02570019
                                                                        02580000
       7100-READ-TSK-UNLOAD.                                            02590020
              READ SKU-UNLOAD-FILE                                      02600019
                 INTO MA010-TSK-UNLOAD-RECORD                           02610019
               AT END                                                   02620019
                  SET PS-END-TSK TO TRUE                                02630019
                  SET MA010-NO-MORE-ITEMS TO TRUE.                      02640019
                                                                        02650001
WR5207 7200-READ-RCP-UNLOAD.                                            02660020
             READ RCP-UNLOAD-FILE                                       02670019
                 INTO MA012-RCP-UNLOAD-RECORD                           02680019
               AT END                                                   02690019
                  SET PS-END-RCP TO TRUE.                               02700019
                                                                        02710000
       8000-WRITE-EXTRACT.                                              02720020
                                                                        02720199
21120      MOVE PV-TSKXREF-DEPT        TO  PV-WORK-DEPT-X.              02721099
21120      MOVE PV-WORK-DEPT-X         TO  PV-WORK-DEPT-Y.              02722099
21120      MOVE PV-WORK-DEPT-Y-2-4     TO  PV-SKU-DEPT.                 02722199
                                                                        02722299
21120      MOVE PV-TSKXREF-SUBCLASS    TO  PV-WORK-SUBCLASS-X.          02723099
21120      MOVE PV-WORK-SUBCLASS-X     TO  PV-WORK-SUBCLASS-Y.          02724099
21120      MOVE PV-WORK-SUBCLASS-Y-3-4 TO  PV-SKU-CLASS.                02724199
                                                                        02725099
21120 *                                                                 02725199
21120 *        PV-TSKXREF-SKU IS DEFINED AS 8 DIGIT NUMERIC -           02725299
21120 *        HOWEVER, IF A 7 DIGIT SKU IS RETRIEVED THE               02725399
21120 *        COBOL CODE PLACES A LEADING ZERO IN PV-TSKXREF-SKU.      02725499
21120 *        THIS LEADING ZERO MUST BE REMOVED BEFORE WE              02725599
21120 *        FORMAT THE ITEM-CLUSTR-NAME.                             02725699
21120 *                                                                 02725799
                                                                        02725899
21120      MOVE PV-TSKXREF-SKU         TO  PV-WORK-SKU-X.               02726099
21120      MOVE PV-WORK-SKU-X          TO  PV-WORK-SKU-Y.               02727099
21120      MOVE SPACES                 TO  PV-SKU-NI-SKU.               02727199
21120      IF PV-WORK-SKU-Y-1 = '0'                                     02728099
21120          MOVE PV-WORK-SKU-Y-2-8  TO  PV-SKU-NI-SKU                02750099
21120      ELSE                                                         02750199
21120          MOVE PV-WORK-SKU-Y      TO  PV-SKU-NI-SKU                02750299
21120      END-IF.                                                      02750399
                                                                        02751099
           MOVE PV-SKU                 TO  MA021-SKU.                   02760099
           MOVE MA010-GROUP-CODE       TO  MA021-GROUP-CODE.            02770099
           MOVE MA010-LONG-VENDOR-STYLE                                 02780099
                                           TO  MA021-LONG-VENDOR-STYLE. 02790004
           MOVE MA010-ENT-ID           TO  MA021-ENT-ID.                02800099
           MOVE MA011-STORE-NMBR       TO  MA021-STORE.                 02810099
           MOVE MA011-ONHAND-QTY       TO  MA021-ONHAND-QTY.            02820099
21736      MOVE MA011-ONORDER-QTY      TO  MA021-ONORD-QTY.             02830099
           MOVE PC-I                   TO  MA021-CLUSTR-CDE.            02840099
           MOVE SPACES                 TO  MA021-HIER-CDE.              02850099
21120      MOVE PV-WORK-DEPT-Y-2-4     TO  MA021-OWNER-DEPT.            02860099
           ADD 1                       TO  PV-SKUINV-OUTPUT-RECS.       02870099
                                                                        02880000
           WRITE SKU-STORE-INV-EXTRACT-RECORD                           02890000
                     FROM MA021-SKU-STORE-INVENTORY.                    02900000
                                                                        04450049
21120  9000-PROCESS-TSKXREF.                                            04460099
                                                                        04461099
C11956     IF NOT PS-END-TSKXREF AND                                    04461299
C11956         (PV-TSKXREF-ITM-NBR < MA011-ITEM-NMBR)                   04461399
21120          PERFORM 9100-READ-TSKXREF-UNLOAD                         04461499
21120      END-IF.                                                      04461599
                                                                        04464499
21120      IF NOT PS-END-TSKXREF                                        04464599
21120          IF PV-TSKXREF-ITM-NBR = MA011-ITEM-NMBR                  04464699
21120              SET PS-ITEM-FOUND TO TRUE                            04464799
21120          ELSE                                                     04464999
21120              IF PV-TSKXREF-ITM-NBR > MA011-ITEM-NMBR              04465099
21120                  SET PS-ITEM-MISSING TO TRUE                      04465199
21120              ELSE                                                 04465399
21120                  GO TO 9000-EXIT                                  04465499
21120              END-IF                                               04465599
21120          END-IF                                                   04465699
21120      END-IF.                                                      04465899
                                                                        04600099
21120      IF PS-ITEM-MISSING OR PS-END-TSKXREF                         04620099
21120          IF MA011-ITEM-NMBR = PV-WORK-PREV-ITEM-NBR               04621099
21120              NEXT SENTENCE                                        04622099
21120          ELSE                                                     04623099
21120              MOVE MA011-ITEM-NMBR TO PV-WORK-ITEM-NBR             04630099
21120              DISPLAY 'ITEM NBR NOT FOUND ON TSKXREF'              04650099
21120              DISPLAY 'MA011-ITEM-NMBR: ' PV-WORK-ITEM-NBR         04660099
21120              DISPLAY '*******************************'            04670099
21120              MOVE MA011-ITEM-NMBR TO PV-WORK-PREV-ITEM-NBR        04670199
21120          END-IF                                                   04671099
21120      END-IF.                                                      04680099
                                                                        04760199
21120      SET PS-TSKXREF-END-PROCESS TO TRUE.                          04760299
                                                                        04760399
21120  9000-EXIT.                                                       04760499
21120      EXIT.                                                        04760599
                                                                        04760699
                                                                        04760799
21120  9100-READ-TSKXREF-UNLOAD.                                        04760899
21120          READ TSKXREF-UNLOAD-FILE                                 04760999
21120              INTO PV-TSKXREF-REC                                  04761099
21120                  AT END                                           04761199
21120                      SET PS-END-TSKXREF TO TRUE.                  04761299
                                                                        04762099
