00001 ***************************************************************** 12/18/95
00002 **                      MARD016                                ** MARD016 
00003 *****************************************************************    LV001
00004 **  THIS IS THE RECORD LAYOUT FOR TINVSKU ORACLE TABLE LOAD    ** MARD016 
00005 **  DATA CREATED IN MAKUT026.                                  ** MARD016 
00006 **                                                             ** MARD016 
00007 **  RECORD LENGTH:  29 BYTES                                   ** MARD016 
00008 **  RECORD FORMAT:  SEQUENTIAL                                 ** MARD016 
00009 ***************************************************************** MARD016 
00010  01  MA016-INVENTORY-LOAD.                                        MARD016 
00011      05  MA016-ITEM-CLUSTER-ID           PIC  9(09) VALUE ZERO.   MARD016 
00012      05  FILLER                          PIC  X(01) VALUE ','.    MARD016 
00013      05  MA016-ORG-UNIT-CLUSTER-ID       PIC  9(09) VALUE ZERO.   MARD016 
00014      05  FILLER                          PIC  X(01) VALUE ','.    MARD016 
00015      05  MA016-ONHAND-QTY           PIC -999999999  VALUE ZERO.   MARD016 
00014      05  FILLER                          PIC  X(01) VALUE ','.    MARD016 
00015      05  MA016-ONORD-QTY            PIC -999999999  VALUE ZERO.   MARD016 
