      *****************************************************************         
      **                      MARD010                                **         
      *****************************************************************         
      **  THIS IS THE RECORD LAYOUT FOR TSK DB2 TABLE UNLOAD         **         
      **                                                             **         
      **  RECORD LENGTH:  35 BYTES                                   **         
      **  RECORD FORMAT:  SEQUENTIAL                                 **         
      *****************************************************************         
       01  MA010-TSK-UNLOAD-RECORD.                                             
           05 MA010-ITEM-NMBR               PIC  S9(15)V COMP-3.                
              88 MA010-NO-MORE-ITEMS         VALUE +999999999999999.            
           05 MA010-ENT-ID                  PIC  S9(09) COMP.                   
           05 MA010-LONG-VENDOR-STYLE       PIC   X(20).                        
           05 MA010-GROUP-CODE              PIC   X(03).                        
