000100*****************************************************************         
000200*                 MARD042                                       *         
000300*****************************************************************         
000400* RECORD LAYOUT FOR THE TORGCLT EXTRACT FILE                    *         
000400*                                                               *         
000400* DAVE METZGER 12/01/2004 WR25478                               *         
000400* REMOVED 1 BYTE OF FILLER AND INCREASED ORG CLUSTER STORE FROM *         
000400* X(03) TO X(04) - SO NO CHANGE IN FILE SIZE (STILL 13 BYTES)   *         
000500*****************************************************************         
000600 01  MA042-ORG-CLUSTR-RECORD.                                             
000700     05  MA042-ORG-CLUSTR-STORE          PIC  X(04) VALUE SPACES.         
000900     05  MA042-ORG-CLUSTR-ID             PIC  9(09) VALUE ZERO.           
