      *****************************************************************         
      **                      MARD012                                **         
      *****************************************************************         
      **  THIS IS THE RECORD LAYOUT FOR TUPCPLS DB2 TABLE UNLOAD     **         
      **                                                             **         
      **  RECORD LENGTH:   12 BYTES                                  **         
      **  RECORD FORMAT:  SEQUENTIAL                                 **         
      *****************************************************************         
       01  MA012-RCP-UNLOAD-RECORD.                                             
           05  MA012-ITM-NBR          PIC  S9(15)V COMP-3.                      
           05  MA012-STR-NBR          PIC  S9(4)V COMP.                         
           05  MA012-UPC-STAT-CDE     PIC  X(02).                               
