      ******************************************************************        
      *  RECORD LAYOUT FOR THE SKU REN EXTRACT FILE.                            
      ******************************************************************        
       01        MA025-RECORD.                                                  
                 10 MA025-SKU-NMBR.                                             
                     15 MA025-MERCH-DEPT-NMBR        PIC X(3).                  
                     15 MA025-MERCH-CLASS-NMBR       PIC X(2).                  
                     15 MA025-SEQ-NMBR               PIC X(3).                  
                 10 MA025-RNMBR-DATE                 PIC X(10).                 
                 10 MA025-RNMBR-TIME                 PIC X(8).                  
                 10 MA025-HIST-SKU-NMBR.                                        
                     15 MA025-HIST-DEPT-NMBR         PIC X(3).                  
                     15 MA025-HIST-CLASS-NMBR        PIC X(2).                  
                     15 MA025-HIST-SEQ-NMBR          PIC X(3).                  
                 10 MA025-VNDR-IN-HSE-NMBR           PIC S9(4) COMP.            
                 10 MA025-APLD-SUM-TBL-IND           PIC X(1).                  
      *                                                                         
