      *****************************************************************         
      *                MARD040    -  LRECL = 60                       *         
      *****************************************************************         
      * RECORD LAYOUT FOR THE REGIONAL CLEARANCE PRICING DATA         *         
      * EXTRACT FILE.                                                 *         
      * WR25478 - DAVE METZGER 12/01/2004  INCREASED LRECL 40 TO 60   *         
      * CHANGED STR-NBR  X(4) AND ADDED 19 BYTES OF FILLER            *         
      *****************************************************************         
       01  MA040-RCP-DATA.                                                      
           05  MA040-ITM-NAME.                                                  
               10  MA040-DEPT-NBR       PIC  X(03) VALUE SPACE.                 
               10  DL-DASH1             PIC  X(01) VALUE '-'.                   
               10  MA040-CLASS-NBR      PIC  X(02) VALUE SPACE.                 
               10  DL-DASH2             PIC  X(01) VALUE '-'.                   
               10  MA040-SEQ-NBR        PIC  X(08) VALUE SPACE.                 
           05  MA040-STAT-CDE           PIC  X(02) VALUE SPACES.                
           05  MA040-STR-NBR            PIC  X(04) VALUE SPACES.                
           05  MA040-STAT-BEG-DTE       PIC  X(10) VALUE SPACES.                
           05  MA040-STAT-END-DTE       PIC  X(10) VALUE SPACES.                
           05  FILLER                   PIC  X(19) VALUE SPACES.                
