      *****************************************************************         
      **                      MARD082                                **         
      *****************************************************************         
      **  THIS IS THE RECORD LAYOUT FOR TSIPEPR DB2 PLATINUM UNLOAD  **         
      **                                                             **         
      **  RECORD LENGTH:   16 BYTES                                  **         
      **  RECORD FORMAT:  SEQUENTIAL                                 **         
      *****************************************************************         
       01  MA082-TSIPEPR-UNLOAD-RECORD.                                         
           05  MA082-UPC-ID             PIC  S9(09)  COMP.                      
           05  MA082-BEG-DTE            PIC   X(10).                            
           05  MA082-UPC-STAT-CDE       PIC   X(02).                            
