      *****************************************************************         
      **                      MARD080                                **         
      *****************************************************************         
      **  THIS IS THE RECORD LAYOUT FOR TUPCPLS DB2 PLATINUM UNLOAD  **         
      **                                                             **         
      **  RECORD LENGTH:   54 BYTES                                  **         
      **  RECORD FORMAT:  SEQUENTIAL                                 **         
      **                                                             **         
      ** 12/01/2004 DAVE METZGER  - CHANGED STR_NBR FROM X(03) TO    **         
      **            X(04), REMOVED EFF_END_TMST AND ADDED 25 BYTES   **         
      **            OF FILLER WHICH DID NOT CHANGE FILE LENGTH.      **         
      *****************************************************************         
       01  MA080-TUPCPLS-UNLOAD-RECORD.                                         
           05  MA080-UPC-ID             PIC  S9(09)  COMP.                      
           05  MA080-ITM-NBR            PIC  S9(15)V COMP-3.                    
           05  MA080-STR-NBR            PIC  S9(04)  COMP.                      
           05  MA080-UPC-STAT-CDE       PIC   X(02).                            
           05  FILLER                   PIC   X(01).                            
           05  MA080-UPC-STAT-CHG-DTE   PIC   X(10).                            
           05  FILLER                   PIC   X(25).                            
