*          DATA SET MBKM125    AT LEVEL 006 AS OF 01/30/92                      
*********************************************************************** 00001**1
*       MAPSET  MBKM125                                                 00002**1
*       MAP     MB125A                                                  00003**1
*       PROGRAM MBKCS125 - APPLICATION SYSTEM LIST                      00004**1
*       TRANSID R125                                                    00005**1
*       SYSTEM  CICS ARCHITECTURE                                       00006**1
*********************************************************************** 00007**1
        PRINT  NOGEN                                                    00008**1
MBKM125 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES,             C00009**1
               CTRL=(FREEKB)                                            00010**1
MB125A  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),                   C00011**1
               DSATTS=(COLOR,HILIGHT)                                   00012**1
*          DATA SET LINE01     AT LEVEL 001 AS OF 01/02/91              00013**1
ADATE   DFHMDF POS=(01,02),LENGTH=10,ATTRB=(ASKIP,BRT),                C00014**6
               COLOR=NEUTRAL                                            00015**1
ATIME   DFHMDF POS=(01,14),LENGTH=08,ATTRB=(ASKIP,BRT),                C00016**6
               COLOR=NEUTRAL                                            00017**1
ATITLE  DFHMDF POS=(01,25),LENGTH=30,ATTRB=(ASKIP,BRT),                C00018**1
               COLOR=NEUTRAL                                            00019**1
ATERMID DFHMDF POS=(01,66),LENGTH=04,ATTRB=(ASKIP,BRT),                C00020**6
               COLOR=NEUTRAL                                            00021**1
APGMID  DFHMDF POS=(01,72),LENGTH=08,ATTRB=(ASKIP,BRT),                C00022**6
               COLOR=NEUTRAL                                            00023**1
*                                                                       00024**1
        DFHMDF POS=(2,31),LENGTH=8,ATTRB=(ASKIP,BRT),                  C00025**1
               INITIAL='COMPANY:'                                       00026**1
AOPERCO DFHMDF POS=(2,41),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE        00027**6
*                                                                       00028**1
        DFHMDF POS=(3,48),LENGTH=6,ATTRB=(ASKIP,BRT),                  C00029**1
               INITIAL='ITEMS:'                                         00030**1
ABEGITM DFHMDF POS=(3,55),LENGTH=5,ATTRB=(UNPROT,FSET,NUM),            C00031**3
               HILIGHT=UNDERLINE,COLOR=GREEN                            00032**1
        DFHMDF POS=(3,61),LENGTH=2,ATTRB=(ASKIP,BRT),                  C00033**1
               INITIAL='TO'                                             00034**1
ATOITM  DFHMDF POS=(3,64),LENGTH=5,ATTRB=(ASKIP,NORM),COLOR=BLUE        00035**6
        DFHMDF POS=(3,70),LENGTH=2,ATTRB=(ASKIP,BRT),                  C00036**1
               INITIAL='OF'                                             00037**1
ATOTITM DFHMDF POS=(3,73),LENGTH=5,ATTRB=(ASKIP,NORM),COLOR=BLUE        00038**6
*                                                                       00039**1
        DFHMDF POS=(5,08),LENGTH=04,ATTRB=(ASKIP,BRT),                 C00040**5
               INITIAL='APPL'                                           00041**5
        DFHMDF POS=(5,44),LENGTH=12,ATTRB=(ASKIP,BRT),                 C00042**5
               INITIAL='PARENT  MDSE'                                   00043**5
        DFHMDF POS=(6,02),LENGTH=11,ATTRB=(ASKIP,BRT),                 C00044**5
               INITIAL='SEL  SYSTEM'                                    00045**5
        DFHMDF POS=(6,14),LENGTH=11,ATTRB=(ASKIP,BRT),                 C00046**5
               INITIAL='DESCRIPTION'                                    00047**1
        DFHMDF POS=(6,44),LENGTH=11,ATTRB=(ASKIP,BRT),                 C00048**5
               INITIAL='SYSTEM  IND'                                    00049**5
*       START OF DETAIL LINES.                                          00050**1
SEL1    DFHMDF POS=(7,03),LENGTH=1,ATTRB=(UNPROT,FSET),                C00051**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00052**1
        DFHMDF POS=(7,05),LENGTH=1,ATTRB=(ASKIP)                        00053**4
APLSYS1 DFHMDF POS=(7,09),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE        00054**6
DESC1   DFHMDF POS=(7,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00055**6
PRTSYS1 DFHMDF POS=(7,46),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE        00056**6
MDSEIN1 DFHMDF POS=(7,53),LENGTH=1,ATTRB=(ASKIP,NORM),COLOR=BLUE        00057**6
*                                                                       00058**1
SEL2    DFHMDF POS=(8,03),LENGTH=1,ATTRB=(UNPROT,FSET),                C00059**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00060**5
        DFHMDF POS=(8,05),LENGTH=1,ATTRB=(ASKIP)                        00061**5
APLSYS2 DFHMDF POS=(8,09),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE        00062**6
DESC2   DFHMDF POS=(8,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00063**6
PRTSYS2 DFHMDF POS=(8,46),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE        00064**6
MDSEIN2 DFHMDF POS=(8,53),LENGTH=1,ATTRB=(ASKIP,NORM),COLOR=BLUE        00065**6
*                                                                       00066**5
SEL3    DFHMDF POS=(9,03),LENGTH=1,ATTRB=(UNPROT,FSET),                C00067**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00068**5
        DFHMDF POS=(9,05),LENGTH=1,ATTRB=(ASKIP)                        00069**5
APLSYS3 DFHMDF POS=(9,09),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE        00070**6
DESC3   DFHMDF POS=(9,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00071**6
PRTSYS3 DFHMDF POS=(9,46),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE        00072**6
MDSEIN3 DFHMDF POS=(9,53),LENGTH=1,ATTRB=(ASKIP,NORM),COLOR=BLUE        00073**6
*                                                                       00074**5
SEL4    DFHMDF POS=(10,3),LENGTH=1,ATTRB=(UNPROT,FSET),                C00075**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00076**5
        DFHMDF POS=(10,05),LENGTH=1,ATTRB=(ASKIP)                       00077**5
APLSYS4 DFHMDF POS=(10,09),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00078**6
DESC4   DFHMDF POS=(10,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00079**6
PRTSYS4 DFHMDF POS=(10,46),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00080**6
MDSEIN4 DFHMDF POS=(10,53),LENGTH=1,ATTRB=(ASKIP,NORM),COLOR=BLUE       00081**6
*                                                                       00082**5
SEL5    DFHMDF POS=(11,3),LENGTH=1,ATTRB=(UNPROT,FSET),                C00083**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00084**5
        DFHMDF POS=(11,05),LENGTH=1,ATTRB=(ASKIP)                       00085**5
APLSYS5 DFHMDF POS=(11,09),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00086**6
DESC5   DFHMDF POS=(11,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00087**6
PRTSYS5 DFHMDF POS=(11,46),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00088**6
MDSEIN5 DFHMDF POS=(11,53),LENGTH=1,ATTRB=(ASKIP,NORM),COLOR=BLUE       00089**6
*                                                                       00090**5
SEL6    DFHMDF POS=(12,3),LENGTH=1,ATTRB=(UNPROT,FSET),                C00091**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00092**5
        DFHMDF POS=(12,05),LENGTH=1,ATTRB=(ASKIP)                       00093**5
APLSYS6 DFHMDF POS=(12,09),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00094**6
DESC6   DFHMDF POS=(12,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00095**6
PRTSYS6 DFHMDF POS=(12,46),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00096**6
MDSEIN6 DFHMDF POS=(12,53),LENGTH=1,ATTRB=(ASKIP,NORM),COLOR=BLUE       00097**6
*                                                                       00098**5
SEL7    DFHMDF POS=(13,3),LENGTH=1,ATTRB=(UNPROT,FSET),                C00099**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00100**5
        DFHMDF POS=(13,05),LENGTH=1,ATTRB=(ASKIP)                       00101**5
APLSYS7 DFHMDF POS=(13,09),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00102**6
DESC7   DFHMDF POS=(13,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00103**6
PRTSYS7 DFHMDF POS=(13,46),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00104**6
MDSEIN7 DFHMDF POS=(13,53),LENGTH=1,ATTRB=(ASKIP,NORM),COLOR=BLUE       00105**6
*                                                                       00106**5
SEL8    DFHMDF POS=(14,3),LENGTH=1,ATTRB=(UNPROT,FSET),                C00107**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00108**5
        DFHMDF POS=(14,05),LENGTH=1,ATTRB=(ASKIP)                       00109**5
APLSYS8 DFHMDF POS=(14,09),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00110**6
DESC8   DFHMDF POS=(14,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00111**6
PRTSYS8 DFHMDF POS=(14,46),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00112**6
MDSEIN8 DFHMDF POS=(14,53),LENGTH=1,ATTRB=(ASKIP,NORM),COLOR=BLUE       00113**6
*                                                                       00114**5
SEL9    DFHMDF POS=(15,3),LENGTH=1,ATTRB=(UNPROT,FSET),                C00115**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00116**5
        DFHMDF POS=(15,05),LENGTH=1,ATTRB=(ASKIP)                       00117**5
APLSYS9 DFHMDF POS=(15,09),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00118**6
DESC9   DFHMDF POS=(15,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00119**6
PRTSYS9 DFHMDF POS=(15,46),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00120**6
MDSEIN9 DFHMDF POS=(15,53),LENGTH=1,ATTRB=(ASKIP,NORM),COLOR=BLUE       00121**6
*                                                                       00122**5
SEL10   DFHMDF POS=(16,3),LENGTH=1,ATTRB=(UNPROT,FSET),                C00123**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00124**5
        DFHMDF POS=(16,05),LENGTH=1,ATTRB=(ASKIP)                       00125**5
APLSYSA DFHMDF POS=(16,09),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00126**6
DESCA   DFHMDF POS=(16,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00127**6
PRTSYSA DFHMDF POS=(16,46),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00128**6
MDSEINA DFHMDF POS=(16,53),LENGTH=1,ATTRB=(ASKIP,NORM),COLOR=BLUE       00129**6
*                                                                       00130**5
SEL11   DFHMDF POS=(17,3),LENGTH=1,ATTRB=(UNPROT,FSET),                C00131**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00132**5
        DFHMDF POS=(17,05),LENGTH=1,ATTRB=(ASKIP)                       00133**5
APLSYSB DFHMDF POS=(17,09),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00134**6
DESCB   DFHMDF POS=(17,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00135**6
PRTSYSB DFHMDF POS=(17,46),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00136**6
MDSEINB DFHMDF POS=(17,53),LENGTH=1,ATTRB=(ASKIP,NORM),COLOR=BLUE       00137**6
*                                                                       00138**5
SEL12   DFHMDF POS=(18,3),LENGTH=1,ATTRB=(UNPROT,FSET),                C00139**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00140**5
        DFHMDF POS=(18,05),LENGTH=1,ATTRB=(ASKIP)                       00141**5
APLSYSC DFHMDF POS=(18,09),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00142**6
DESCC   DFHMDF POS=(18,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00143**6
PRTSYSC DFHMDF POS=(18,46),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00144**6
MDSEINC DFHMDF POS=(18,53),LENGTH=1,ATTRB=(ASKIP,NORM),COLOR=BLUE       00145**6
*                                                                       00146**5
SEL13   DFHMDF POS=(19,3),LENGTH=1,ATTRB=(UNPROT,FSET),                C00147**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00148**5
        DFHMDF POS=(19,05),LENGTH=1,ATTRB=(ASKIP)                       00149**5
APLSYSD DFHMDF POS=(19,09),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00150**6
DESCD   DFHMDF POS=(19,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00151**6
PRTSYSD DFHMDF POS=(19,46),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE       00152**6
MDSEIND DFHMDF POS=(19,53),LENGTH=1,ATTRB=(ASKIP,NORM),COLOR=BLUE       00153**6
*                                                                       00154**5
        DFHMDF POS=(20,51),LENGTH=20,ATTRB=(ASKIP,BRT),                C00155**6
               INITIAL='TOTAL ITEMS SELECTED'                           00156**1
TOTSEL  DFHMDF POS=(20,73),LENGTH=5,ATTRB=(ASKIP,NORM),COLOR=BLUE       00157**6
*                                                                       00158**1
AMSG    DFHMDF POS=(21,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=RED          00159**1
        DFHMDF POS=(22,1),LENGTH=11,INITIAL='COMMAND==>',              C00160**1
               ATTRB=(PROT,BRT)                                         00161**1
ANAVCMD DFHMDF POS=(22,13),LENGTH=8,ATTRB=(UNPROT),                    C00162**1
               HILIGHT=UNDERLINE,COLOR=GREEN                            00163**1
        DFHMDF POS=(22,22),LENGTH=1,ATTRB=(ASKIP)                       00164**1
        DFHMDF POS=(22,24),LENGTH=7,INITIAL='KEY===>',ATTRB=(PROT,BRT)  00165**1
ANAVKEY DFHMDF POS=(22,32),LENGTH=25,ATTRB=(UNPROT),                   C00166**1
               HILIGHT=UNDERLINE,COLOR=GREEN                            00167**1
        DFHMDF POS=(22,58),LENGTH=1,ATTRB=(ASKIP)                       00168**1
        DFHMDF POS=(22,63),LENGTH=16,INITIAL='PA2=OTHER FKEYS',        C00169**1
               ATTRB=(PROT,BRT)                                         00170**1
AFKLIN1 DFHMDF POS=(23,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00171**1
AFKLIN2 DFHMDF POS=(24,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00172**1
        DFHMSD TYPE=FINAL                                               00173**1
        END                                                             00174**1
