*          DATA SET MBKM130    AT LEVEL 005 AS OF 01/30/92                      
*********************************************************************** 00001**1
*       MAPSET  MBKM130                                                 00002**1
*       MAP     MB130A                                                  00003**1
*       PROGRAM MBKCS130 - RESPONSIBILITY LEVEL MAINTENANCE             00004**1
*       TRANSID R130                                                    00005**1
*       SYSTEM  CICS ARCHITECTURE                                       00006**1
*********************************************************************** 00007**1
        PRINT  NOGEN                                                    00008**1
MBKM130 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES,             C00009**1
               CTRL=(FREEKB)                                            00010**1
MB130A  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),                   C00011**1
               DSATTS=(COLOR,HILIGHT)                                   00012**1
ADATE   DFHMDF POS=(01,02),LENGTH=10,ATTRB=(ASKIP,BRT),                C00013**5
               COLOR=NEUTRAL                                            00014**1
ATIME   DFHMDF POS=(01,14),LENGTH=08,ATTRB=(ASKIP,BRT),                C00015**5
               COLOR=NEUTRAL                                            00016**1
ATITLE  DFHMDF POS=(01,25),LENGTH=30,ATTRB=(ASKIP,BRT),                C00017**1
               COLOR=NEUTRAL                                            00018**1
ATERMID DFHMDF POS=(01,66),LENGTH=04,ATTRB=(ASKIP,BRT),                C00019**5
               COLOR=NEUTRAL                                            00020**1
APGMID  DFHMDF POS=(01,72),LENGTH=08,ATTRB=(ASKIP,BRT),                C00021**5
               COLOR=NEUTRAL                                            00022**1
*                                                                       00023**1
        DFHMDF POS=(2,31),LENGTH=8,ATTRB=(ASKIP,BRT),                  C00024**1
               INITIAL='COMPANY:'                                       00025**1
AOPERCO DFHMDF POS=(2,41),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE        00026**5
*                                                                       00027**1
        DFHMDF POS=(4,18),LENGTH=21,ATTRB=(ASKIP,BRT),                 C00028**1
               INITIAL='RESPONSIBILITY LEVEL:'                          00029**1
ARSPLVL DFHMDF POS=(4,41),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE        00030**5
        DFHMDF POS=(4,45),LENGTH=1,ATTRB=(ASKIP)                        00031**3
        DFHMDF POS=(6,27),LENGTH=12,ATTRB=(ASKIP,BRT),                 C00032**1
               INITIAL='DESCRIPTION:'                                   00033**1
ARSPDES DFHMDF POS=(6,41),LENGTH=25,ATTRB=(UNPROT,FSET),               C00034**4
               HILIGHT=UNDERLINE,COLOR=GREEN                            00035**1
        DFHMDF POS=(6,67),LENGTH=1,ATTRB=ASKIP                          00036**2
*                                                                       00037**1
AMSG    DFHMDF POS=(21,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=RED          00038**1
        DFHMDF POS=(22,1),LENGTH=11,INITIAL='COMMAND==>',              C00039**1
               ATTRB=(PROT,BRT)                                         00040**1
ANAVCMD DFHMDF POS=(22,13),LENGTH=8,ATTRB=(UNPROT),                    C00041**1
               HILIGHT=UNDERLINE,COLOR=GREEN                            00042**1
        DFHMDF POS=(22,22),LENGTH=1,ATTRB=(ASKIP)                       00043**1
        DFHMDF POS=(22,24),LENGTH=7,INITIAL='KEY===>',ATTRB=(PROT,BRT)  00044**1
ANAVKEY DFHMDF POS=(22,32),LENGTH=25,ATTRB=(UNPROT),                   C00045**1
               HILIGHT=UNDERLINE,COLOR=GREEN                            00046**1
        DFHMDF POS=(22,58),LENGTH=1,ATTRB=(ASKIP)                       00047**1
        DFHMDF POS=(22,63),LENGTH=16,INITIAL='PA2=OTHER FKEYS',        C00048**1
               ATTRB=(PROT,BRT)                                         00049**1
*                                                                       00050**5
AFKLIN1 DFHMDF POS=(23,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00051**1
AFKLIN2 DFHMDF POS=(24,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00052**1
        DFHMSD TYPE=FINAL                                               00053**1
        END                                                             00054**1
