*          DATA SET MBKM111    AT LEVEL 025 AS OF 10/23/91                      
*  SCREEN LAYOUT MERCHANDISE DEPARTMENT SELECTION                       00001*18
        PRINT  NOGEN                                                    00002*18
MBKM111 DFHMSD TYPE=DSECT,                                             C00003*19
               LANG=COBOL,                                             C00004**5
               MODE=INOUT,                                             C00005**5
               STORAGE=AUTO,                                           C00006**5
               TERM=3270-2,                                            C00007**5
               TIOAPFX=YES                                              00008**5
MB111A  DFHMDI LINE=1,                                                 C00009*19
               COLUMN=1,                                               C00010*21
               CTRL=FREEKB,                                            C00011*21
               SIZE=(24,80),                                           C00012**6
               MAPATTS=(COLOR,HILIGHT),                                C00013**5
               DSATTS=(COLOR,HILIGHT)                                   00014**5
ADATE   DFHMDF POS=(1,2),                                              C00015**5
               LENGTH=10,                                              C00016**5
               COLOR=NEUTRAL,                                          C00017**5
               ATTRB=(ASKIP,BRT)                                        00018**5
ATIME   DFHMDF POS=(1,14),                                             C00019**5
               LENGTH=8,                                               C00020**5
               COLOR=NEUTRAL,                                          C00021**5
               ATTRB=(ASKIP,BRT)                                        00022**5
ATITLE  DFHMDF POS=(1,25),                                             C00023**5
               LENGTH=30,                                              C00024**5
               COLOR=NEUTRAL,                                          C00025**5
               ATTRB=(ASKIP,BRT)                                        00026**5
ATERMID DFHMDF POS=(1,63),                                             C00027**5
               LENGTH=4,                                               C00028**5
               COLOR=NEUTRAL,                                          C00029**5
               ATTRB=(ASKIP,BRT,FSET)                                   00030**5
APGMID  DFHMDF POS=(1,71),                                             C00031**5
               LENGTH=8,                                               C00032**5
               COLOR=NEUTRAL,                                          C00033**5
               ATTRB=(ASKIP,BRT)                                        00034**5
*                                                                       00035**5
        DFHMDF POS=(2,32),                                             C00036**5
               LENGTH=8,                                               C00037**5
               INITIAL='COMPANY:',                                     C00038**5
               COLOR=NEUTRAL,                                          C00039**5
               ATTRB=(PROT,BRT)                                         00040*21
ACO     DFHMDF POS=(2,42),                                             C00041**5
               LENGTH=2,                                               C00042**5
               COLOR=BLUE,                                             C00043**5
               ATTRB=(ASKIP,NORM)                                       00044**5
*                                                                       00045**5
        DFHMDF POS=(4,36),                                             C00046**5
               LENGTH=4,                                               C00047**5
               INITIAL='GMA:',                                         C00048**5
               COLOR=NEUTRAL,                                          C00049**5
               ATTRB=(PROT,BRT)                                         00050*21
AGMA    DFHMDF POS=(4,42),                                             C00051**5
               LENGTH=2,                                               C00052**5
               COLOR=GREEN,                                            C00053*21
               HILIGHT=UNDERLINE,                                      C00054*24
               ATTRB=(UNPROT,NORM)                                      00055*20
        DFHMDF POS=(4,45),                                             C00056**5
               LENGTH=1,                                               C00057**5
               INITIAL=' ',                                            C00058**5
               ATTRB=(PROT,ASKIP,DRK)                                   00059**5
*                                                                       00060**5
        DFHMDF POS=(5,36),                                             C00061**5
               LENGTH=4,                                               C00062**5
               INITIAL='DMA:',                                         C00063**9
               COLOR=NEUTRAL,                                          C00064**5
               ATTRB=(PROT,BRT)                                         00065*21
ADMA    DFHMDF POS=(5,42),                                             C00066**5
               LENGTH=2,                                               C00067**5
               COLOR=GREEN,                                            C00068*22
               HILIGHT=UNDERLINE,                                      C00069*24
               ATTRB=(UNPROT,NORM,IC)                                   00070*21
        DFHMDF POS=(5,45),                                             C00071**5
               LENGTH=1,                                               C00072**7
               INITIAL=' ',                                            C00073**5
               ATTRB=(PROT,ASKIP,DRK)                                   00074**5
*                                                                       00075**5
        DFHMDF POS=(8,29),                                             C00076*17
               LENGTH=11,                                              C00077**5
               INITIAL='DEPARTMENT:',                                  C00078**5
               COLOR=NEUTRAL,                                          C00079**5
               ATTRB=(PROT,BRT)                                         00080*21
ADEPT   DFHMDF POS=(8,42),                                             C00081*17
               LENGTH=3,                                               C00082**5
               COLOR=GREEN,                                            C00083*22
               HILIGHT=UNDERLINE,                                      C00084*24
               ATTRB=(UNPROT,NORM)                                      00085*20
        DFHMDF POS=(8,46),                                             C00086*17
               LENGTH=1,                                               C00087**5
               INITIAL=' ',                                            C00088**5
               ATTRB=(PROT,ASKIP,DRK)                                   00089**5
*                                                                       00090**5
        DFHMDF POS=(10,24),                                            C00091*21
               LENGTH=16,                                              C00092*21
               INITIAL='INCLUDE HISTORY:',                             C00093*21
               COLOR=NEUTRAL,                                          C00094*21
               ATTRB=(PROT,BRT)                                         00095*21
AHISTRY DFHMDF POS=(10,42),                                            C00096*23
               LENGTH=1,                                               C00097*25
               COLOR=GREEN,                                            C00098*22
               HILIGHT=UNDERLINE,                                      C00099*24
               ATTRB=(UNPROT,NORM)                                      00100*21
        DFHMDF POS=(10,44),                                            C00101*25
               LENGTH=1,                                               C00102*23
               INITIAL=' ',                                            C00103*23
               ATTRB=(PROT,ASKIP,DRK)                                   00104*23
*                                                                       00105**5
AMSG    DFHMDF POS=(21,1),                                             C00106**5
               LENGTH=78,                                              C00107**5
               COLOR=NEUTRAL,                                          C00108**8
               ATTRB=(ASKIP,BRT)                                        00109**5
*                                                                       00110**5
        DFHMDF POS=(22,1),                                             C00111**5
               LENGTH=11,                                              C00112**5
               INITIAL='COMMAND===>',                                  C00113**5
               COLOR=NEUTRAL,                                          C00114**5
               ATTRB=(PROT,BRT)                                         00115**5
ANAVCMD DFHMDF POS=(22,13),                                            C00116**5
               LENGTH=8,                                               C00117**5
               COLOR=GREEN,                                            C00118**5
               HILIGHT=UNDERLINE,                                      C00119**5
               ATTRB=(UNPROT,NORM)                                      00120*20
        DFHMDF POS=(22,22),                                            C00121*13
               LENGTH=1,                                               C00122*13
               ATTRB=(ASKIP,DRK)                                        00123*14
        DFHMDF POS=(22,24),                                            C00124*13
               LENGTH=7,                                               C00125*13
               INITIAL='KEY===>',                                      C00126*13
               COLOR=NEUTRAL,                                          C00127*13
               ATTRB=(PROT,BRT)                                         00128*13
ANAVKEY DFHMDF POS=(22,32),                                            C00129**5
               LENGTH=25,                                              C00130**5
               COLOR=GREEN,                                            C00131**5
               HILIGHT=UNDERLINE,                                      C00132**5
               ATTRB=(UNPROT,NORM)                                      00133**5
        DFHMDF POS=(22,58),                                            C00134*10
               LENGTH=1,                                               C00135*10
               ATTRB=(ASKIP,DRK)                                        00136*15
        DFHMDF POS=(22,63),                                            C00137*10
               LENGTH=16,                                              C00138*10
               COLOR=NEUTRAL,                                          C00139*11
               INITIAL='PA2=OTHER F KEYS',                             C00140*12
               ATTRB=(PROT,BRT)                                         00141*12
*                                                                       00142**5
AFKLIN1 DFHMDF POS=(23,1),                                             C00143**5
               LENGTH=78,                                              C00144**5
               PICOUT='X(78)',                                         C00145**5
               COLOR=NEUTRAL,                                          C00146**5
               ATTRB=(ASKIP,BRT)                                        00147**5
*                                                                       00148**5
AFKLIN2 DFHMDF POS=(24,1),                                             C00149**5
               LENGTH=78,                                              C00150**5
               PICOUT='X(78)',                                         C00151**5
               COLOR=NEUTRAL,                                          C00152**5
               ATTRB=(ASKIP,BRT)                                        00153**5
        DFHMSD TYPE=FINAL                                               00154   
        END                                                             00155   
