*          DATA SET MBKM128    AT LEVEL 003 AS OF 01/30/92                      
*********************************************************************** 00001**1
*       MAPSET  MBKM128                                                 00002**1
*       MAP     MB128A                                                  00003**1
*       PROGRAM MBKCS128 - MERCHANDISE LEVEL MAINTENANCE                00004**1
*       TRANSID R128                                                    00005**1
*       SYSTEM  CICS ARCHITECTURE                                       00006**1
*********************************************************************** 00007**1
        PRINT  NOGEN                                                    00008**1
MBKM128 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES,             C00009**1
               CTRL=(FREEKB)                                            00010**1
MB128A  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),                   C00011**1
               DSATTS=(COLOR,HILIGHT)                                   00012**1
ADATE   DFHMDF POS=(01,02),LENGTH=10,ATTRB=(ASKIP,BRT),                C00013**3
               COLOR=NEUTRAL                                            00014**1
ATIME   DFHMDF POS=(01,14),LENGTH=08,ATTRB=(ASKIP,BRT),                C00015**3
               COLOR=NEUTRAL                                            00016**1
ATITLE  DFHMDF POS=(01,25),LENGTH=30,ATTRB=(ASKIP,BRT),                C00017**1
               COLOR=NEUTRAL                                            00018**1
ATERMID DFHMDF POS=(01,66),LENGTH=04,ATTRB=(ASKIP,BRT),                C00019**3
               COLOR=NEUTRAL                                            00020**1
APGMID  DFHMDF POS=(01,72),LENGTH=08,ATTRB=(ASKIP,BRT),                C00021**3
               COLOR=NEUTRAL                                            00022**1
*                                                                       00023**1
        DFHMDF POS=(2,31),LENGTH=8,ATTRB=(ASKIP,BRT),                  C00024**1
               INITIAL='COMPANY:'                                       00025**1
AOPERCO DFHMDF POS=(2,41),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE        00026**3
*                                                                       00027**1
        DFHMDF POS=(4,21),LENGTH=18,ATTRB=(ASKIP,BRT),                 C00028**1
               INITIAL='MERCHANDISE LEVEL:'                             00029**1
AMLEVEL DFHMDF POS=(4,41),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE        00030**3
        DFHMDF POS=(5,27),LENGTH=12,ATTRB=(ASKIP,BRT),                 C00031**1
               INITIAL='DESCRIPTION:'                                   00032**1
ALVLDES DFHMDF POS=(5,41),LENGTH=25,ATTRB=(UNPROT,FSET),               C00033**2
               HILIGHT=UNDERLINE,COLOR=GREEN                            00034**1
        DFHMDF POS=(5,67),LENGTH=1,ATTRB=ASKIP                          00035**1
        DFHMDF POS=(7,26),LENGTH=13,ATTRB=(ASKIP,BRT),                 C00036**1
               INITIAL='PARENT LEVEL:'                                  00037**1
ALVLPRT DFHMDF POS=(7,41),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE        00038**3
        DFHMDF POS=(8,27),LENGTH=12,ATTRB=(ASKIP,BRT),                 C00039**1
               INITIAL='DESCRIPTION:'                                   00040**1
APRTDES DFHMDF POS=(8,41),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00041**3
*                                                                       00042**1
AMSG    DFHMDF POS=(21,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=RED          00043**1
        DFHMDF POS=(22,1),LENGTH=11,INITIAL='COMMAND==>',              C00044**1
               ATTRB=(PROT,BRT)                                         00045**1
ANAVCMD DFHMDF POS=(22,13),LENGTH=8,ATTRB=(UNPROT),                    C00046**1
               HILIGHT=UNDERLINE,COLOR=GREEN                            00047**1
        DFHMDF POS=(22,22),LENGTH=1,ATTRB=(ASKIP)                       00048**1
        DFHMDF POS=(22,24),LENGTH=7,INITIAL='KEY===>',ATTRB=(PROT,BRT)  00049**1
ANAVKEY DFHMDF POS=(22,32),LENGTH=25,ATTRB=(UNPROT),                   C00050**1
               HILIGHT=UNDERLINE,COLOR=GREEN                            00051**1
        DFHMDF POS=(22,58),LENGTH=1,ATTRB=(ASKIP)                       00052**1
        DFHMDF POS=(22,63),LENGTH=16,INITIAL='PA2=OTHER FKEYS',        C00053**1
               ATTRB=(PROT,BRT)                                         00054**1
AFKLIN1 DFHMDF POS=(23,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00055**1
AFKLIN2 DFHMDF POS=(24,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00056**1
        DFHMSD TYPE=FINAL                                               00057**1
        END                                                             00058**1
