*          DATA SET MBKM109    AT LEVEL 004 AS OF 01/29/92                      
*********************************************************************** 00001**1
*       MAPSET  MBKM109                                                 00002**1
*       MAP     MB109A                                                  00003**1
*       PROGRAM MBKCS109 - MERCHANDISE SUB-CLASS LIST                   00004**1
*       TRANSID R109                                                    00005**1
*       SYSTEM  CICS ARCHITECTURE                                       00006**1
*********************************************************************** 00007**1
        PRINT  NOGEN                                                    00008**1
MBKM109 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES,             C00009**1
               CTRL=(FREEKB)                                            00010**1
MB109A  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),                   C00011**1
               DSATTS=(COLOR,HILIGHT)                                   00012**1
*          DATA SET LINE01     AT LEVEL 001 AS OF 01/02/91              00013**1
ADATE   DFHMDF POS=(01,02),LENGTH=10,ATTRB=(ASKIP,BRT),                C00014**4
               COLOR=NEUTRAL                                            00015**1
ATIME   DFHMDF POS=(01,14),LENGTH=08,ATTRB=(ASKIP,BRT),                C00016**4
               COLOR=NEUTRAL                                            00017**1
ATITLE  DFHMDF POS=(01,25),LENGTH=30,ATTRB=(ASKIP,BRT),                C00018**1
               COLOR=NEUTRAL                                            00019**1
ATERMID DFHMDF POS=(01,66),LENGTH=04,ATTRB=(ASKIP,BRT),                C00020**4
               COLOR=NEUTRAL                                            00021**1
APGMID  DFHMDF POS=(01,72),LENGTH=08,ATTRB=(ASKIP,BRT),                C00022**4
               COLOR=NEUTRAL                                            00023**1
*                                                                       00024**1
        DFHMDF POS=(2,31),LENGTH=8,ATTRB=(ASKIP,BRT),                  C00025**1
               INITIAL='COMPANY:'                                       00026**1
AOPERCO DFHMDF POS=(2,41),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE        00027**4
*                                                                       00028**1
        DFHMDF POS=(4,35),LENGTH=04,ATTRB=(ASKIP,BRT),                 C00029**1
               INITIAL='GMA:'                                           00030**1
AGMA    DFHMDF POS=(4,41),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE       00031**4
AGMADES DFHMDF POS=(4,47),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00032**4
*                                                                       00033**1
ADMAHED DFHMDF POS=(5,35),LENGTH=04,ATTRB=(ASKIP,BRT),                 C00034**1
               INITIAL='DMA:'                                           00035**1
ADMA    DFHMDF POS=(5,41),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE       00036**4
ADMADES DFHMDF POS=(5,47),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00037**4
*                                                                       00038**1
ADPTHED DFHMDF POS=(6,28),LENGTH=11,ATTRB=(ASKIP,BRT),                 C00039**1
               INITIAL='DEPARTMENT:'                                    00040**1
ADEPT   DFHMDF POS=(6,41),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE       00041**4
ADPTDES DFHMDF POS=(6,47),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00042**4
*                                                                       00043**1
AMCLHED DFHMDF POS=(7,27),LENGTH=12,ATTRB=(ASKIP,BRT),                 C00044**1
               INITIAL='MAJOR CLASS:'                                   00045**1
AMCLASS DFHMDF POS=(7,41),LENGTH=02,ATTRB=(ASKIP,NORM),COLOR=BLUE       00046**4
AMCDES  DFHMDF POS=(7,47),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00047**4
*                                                                       00048**1
ASCLHED DFHMDF POS=(8,29),LENGTH=10,ATTRB=(ASKIP,BRT),                 C00049**1
               INITIAL='SUB CLASS:'                                     00050**1
ASCLASS DFHMDF POS=(8,41),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE        00051**4
ASCDES  DFHMDF POS=(8,47),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00052**4
*                                                                       00053**1
        DFHMDF POS=(10,24),LENGTH=15,ATTRB=(ASKIP,BRT),                C00054**1
               INITIAL='POS-DESCRIPTION'                                00055**1
APDESC  DFHMDF POS=(10,41),LENGTH=17,ATTRB=(ASKIP,NORM),COLOR=BLUE      00056**4
*                                                                       00057**1
        DFHMDF POS=(11,28),LENGTH=11,ATTRB=(ASKIP,BRT),                C00058**1
               INITIAL='TAX DEFAULT'                                    00059**1
ATAXDFT DFHMDF POS=(11,41),LENGTH=1,ATTRB=(ASKIP,NORM),COLOR=BLUE       00060**4
*                                                                       00061**1
AMSG    DFHMDF POS=(21,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=RED          00062**1
        DFHMDF POS=(22,1),LENGTH=11,INITIAL='COMMAND==>',              C00063**1
               ATTRB=(PROT,BRT)                                         00064**1
ANAVCMD DFHMDF POS=(22,13),LENGTH=8,ATTRB=(UNPROT),                    C00065**1
               HILIGHT=UNDERLINE,COLOR=GREEN                            00066**1
        DFHMDF POS=(22,22),LENGTH=1,ATTRB=(ASKIP)                       00067**1
        DFHMDF POS=(22,24),LENGTH=7,INITIAL='KEY===>',ATTRB=(PROT,BRT)  00068**1
ANAVKEY DFHMDF POS=(22,32),LENGTH=25,ATTRB=(UNPROT),                   C00069**1
               HILIGHT=UNDERLINE,COLOR=GREEN                            00070**1
        DFHMDF POS=(22,58),LENGTH=1,ATTRB=(ASKIP)                       00071**1
        DFHMDF POS=(22,63),LENGTH=16,INITIAL='PA2=OTHER FKEYS',        C00072**1
               ATTRB=(PROT,BRT)                                         00073**1
AFKLIN1 DFHMDF POS=(23,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00074**1
AFKLIN2 DFHMDF POS=(24,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00075**1
        DFHMSD TYPE=FINAL                                               00076**1
        END                                                             00077**1
