*          DATA SET MBKM132    AT LEVEL 005 AS OF 01/30/92                      
*********************************************************************** 00001**1
*       MAPSET  MBKM132                                                 00002**1
*       MAP     MB132A                                                  00003**1
*       PROGRAM MBKCS132 - MERCHANDISE AREA RESPL INQUIRY               00004**1
*       TRANSID R132                                                    00005**1
*       SYSTEM  CICS ARCHITECTURE                                       00006**1
*********************************************************************** 00007**1
        PRINT  NOGEN                                                    00008**1
MBKM132 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES,             C00009**1
               CTRL=(FREEKB)                                            00010**1
MB132A  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),                   C00011**1
               DSATTS=(COLOR,HILIGHT)                                   00012**1
ADATE   DFHMDF POS=(01,02),LENGTH=10,ATTRB=(ASKIP,BRT),                C00013**5
               COLOR=NEUTRAL                                            00014**1
ATIME   DFHMDF POS=(01,14),LENGTH=08,ATTRB=(ASKIP,BRT),                C00015**5
               COLOR=NEUTRAL                                            00016**1
ATITLE  DFHMDF POS=(01,25),LENGTH=30,ATTRB=(ASKIP,BRT),                C00017**1
               COLOR=NEUTRAL                                            00018**1
ATERMID DFHMDF POS=(01,66),LENGTH=04,ATTRB=(ASKIP,BRT),                C00019**5
               COLOR=NEUTRAL                                            00020**1
APGMID  DFHMDF POS=(01,72),LENGTH=08,ATTRB=(ASKIP,BRT),                C00021**5
               COLOR=NEUTRAL                                            00022**1
*                                                                       00023**1
        DFHMDF POS=(2,31),LENGTH=8,ATTRB=(ASKIP,BRT),                  C00024**1
               INITIAL='COMPANY:'                                       00025**1
AOPERCO DFHMDF POS=(2,41),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE        00026**5
*                                                                       00027**1
        DFHMDF POS=(4,35),LENGTH=04,ATTRB=(ASKIP,BRT),                 C00028**1
               INITIAL='GMA:'                                           00029**1
AGMA    DFHMDF POS=(4,41),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE       00030**5
AGMADES DFHMDF POS=(4,47),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00031**5
*                                                                       00032**1
ADMAHED DFHMDF POS=(5,35),LENGTH=04,ATTRB=(ASKIP,BRT),                 C00033**2
               INITIAL='DMA:'                                           00034**1
ADMA    DFHMDF POS=(5,41),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE       00035**5
ADMADES DFHMDF POS=(5,47),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00036**5
*                                                                       00037**1
ADPTHED DFHMDF POS=(6,28),LENGTH=11,ATTRB=(ASKIP,BRT),                 C00038**2
               INITIAL='DEPARTMENT:'                                    00039**1
ADEPT   DFHMDF POS=(6,41),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE       00040**5
ADPTDES DFHMDF POS=(6,47),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00041**5
*                                                                       00042**1
        DFHMDF POS=(7,21),LENGTH=18,ATTRB=(ASKIP,BRT),                 C00043**1
               INITIAL='MERCHANDISE LEVEL:'                             00044**1
AMLEVEL DFHMDF POS=(7,41),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE       00045**5
*                                                                       00046**1
        DFHMDF POS=(9,08),LENGTH=15,ATTRB=(ASKIP,BRT),                 C00047**1
               INITIAL='RESPBL   RESPBL'                                00048**1
        DFHMDF POS=(9,28),LENGTH=16,ATTRB=(ASKIP,BRT),                 C00049**1
               INITIAL='RESPBL    WORKER'                               00050**1
        DFHMDF POS=(10,08),LENGTH=24,ATTRB=(ASKIP,BRT),                C00051**3
               INITIAL='LEVEL    START       END'                       00052**3
        DFHMDF POS=(10,38),LENGTH=18,ATTRB=(ASKIP,BRT),                C00053**1
               INITIAL='USER-ID  LAST-NAME'                             00054**1
        DFHMDF POS=(10,66),LENGTH=10,ATTRB=(ASKIP,BRT),                C00055**1
               INITIAL='FIRST-NAME'                                     00056**1
*                                                                       00057**1
ARLEVL1 DFHMDF POS=(11,09),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE      00058**5
ASTART1 DFHMDF POS=(11,16),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00059**5
AEND1   DFHMDF POS=(11,27),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00060**5
AUSER1  DFHMDF POS=(11,38),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00061**5
ALNAME1 DFHMDF POS=(11,47),LENGTH=18,ATTRB=(ASKIP,NORM),COLOR=BLUE      00062**5
AFNAME1 DFHMDF POS=(11,66),LENGTH=12,ATTRB=(ASKIP,NORM),COLOR=BLUE      00063**5
*                                                                       00064**1
ARLEVL2 DFHMDF POS=(12,09),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE      00065**5
ASTART2 DFHMDF POS=(12,16),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00066**5
AEND2   DFHMDF POS=(12,27),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00067**5
AUSER2  DFHMDF POS=(12,38),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00068**5
ALNAME2 DFHMDF POS=(12,47),LENGTH=18,ATTRB=(ASKIP,NORM),COLOR=BLUE      00069**5
AFNAME2 DFHMDF POS=(12,66),LENGTH=12,ATTRB=(ASKIP,NORM),COLOR=BLUE      00070**5
*                                                                       00071**1
ARLEVL3 DFHMDF POS=(13,09),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE      00072**5
ASTART3 DFHMDF POS=(13,16),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00073**5
AEND3   DFHMDF POS=(13,27),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00074**5
AUSER3  DFHMDF POS=(13,38),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00075**5
ALNAME3 DFHMDF POS=(13,47),LENGTH=18,ATTRB=(ASKIP,NORM),COLOR=BLUE      00076**5
AFNAME3 DFHMDF POS=(13,66),LENGTH=12,ATTRB=(ASKIP,NORM),COLOR=BLUE      00077**5
*                                                                       00078**1
ARLEVL4 DFHMDF POS=(14,09),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE      00079**5
ASTART4 DFHMDF POS=(14,16),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00080**5
AEND4   DFHMDF POS=(14,27),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00081**5
AUSER4  DFHMDF POS=(14,38),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00082**5
ALNAME4 DFHMDF POS=(14,47),LENGTH=18,ATTRB=(ASKIP,NORM),COLOR=BLUE      00083**5
AFNAME4 DFHMDF POS=(14,66),LENGTH=12,ATTRB=(ASKIP,NORM),COLOR=BLUE      00084**5
*                                                                       00085**1
ARLEVL5 DFHMDF POS=(15,09),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE      00086**5
ASTART5 DFHMDF POS=(15,16),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00087**5
AEND5   DFHMDF POS=(15,27),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00088**5
AUSER5  DFHMDF POS=(15,38),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00089**5
ALNAME5 DFHMDF POS=(15,47),LENGTH=18,ATTRB=(ASKIP,NORM),COLOR=BLUE      00090**5
AFNAME5 DFHMDF POS=(15,66),LENGTH=12,ATTRB=(ASKIP,NORM),COLOR=BLUE      00091**5
*                                                                       00092**1
ARLEVL6 DFHMDF POS=(16,09),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE      00093**5
ASTART6 DFHMDF POS=(16,16),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00094**5
AEND6   DFHMDF POS=(16,27),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00095**5
AUSER6  DFHMDF POS=(16,38),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00096**5
ALNAME6 DFHMDF POS=(16,47),LENGTH=18,ATTRB=(ASKIP,NORM),COLOR=BLUE      00097**5
AFNAME6 DFHMDF POS=(16,66),LENGTH=12,ATTRB=(ASKIP,NORM),COLOR=BLUE      00098**5
*                                                                       00099**1
ARLEVL7 DFHMDF POS=(17,09),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE      00100**5
ASTART7 DFHMDF POS=(17,16),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00101**5
AEND7   DFHMDF POS=(17,27),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00102**5
AUSER7  DFHMDF POS=(17,38),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00103**5
ALNAME7 DFHMDF POS=(17,47),LENGTH=18,ATTRB=(ASKIP,NORM),COLOR=BLUE      00104**5
AFNAME7 DFHMDF POS=(17,66),LENGTH=12,ATTRB=(ASKIP,NORM),COLOR=BLUE      00105**5
*                                                                       00106**1
ARLEVL8 DFHMDF POS=(18,09),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE      00107**5
ASTART8 DFHMDF POS=(18,16),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00108**5
AEND8   DFHMDF POS=(18,27),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00109**5
AUSER8  DFHMDF POS=(18,38),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00110**5
ALNAME8 DFHMDF POS=(18,47),LENGTH=18,ATTRB=(ASKIP,NORM),COLOR=BLUE      00111**5
AFNAME8 DFHMDF POS=(18,66),LENGTH=12,ATTRB=(ASKIP,NORM),COLOR=BLUE      00112**5
*                                                                       00113**1
ARLEVL9 DFHMDF POS=(19,09),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE      00114**5
ASTART9 DFHMDF POS=(19,16),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00115**5
AEND9   DFHMDF POS=(19,27),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00116**5
AUSER9  DFHMDF POS=(19,38),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00117**5
ALNAME9 DFHMDF POS=(19,47),LENGTH=18,ATTRB=(ASKIP,NORM),COLOR=BLUE      00118**5
AFNAME9 DFHMDF POS=(19,66),LENGTH=12,ATTRB=(ASKIP,NORM),COLOR=BLUE      00119**5
*                                                                       00120**1
ARLEVLA DFHMDF POS=(20,09),LENGTH=03,ATTRB=(ASKIP,NORM),COLOR=BLUE      00121**5
ASTARTA DFHMDF POS=(20,16),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00122**5
AENDA   DFHMDF POS=(20,27),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00123**5
AUSERA  DFHMDF POS=(20,38),LENGTH=08,ATTRB=(ASKIP,NORM),COLOR=BLUE      00124**5
ALNAMEA DFHMDF POS=(20,47),LENGTH=18,ATTRB=(ASKIP,NORM),COLOR=BLUE      00125**5
AFNAMEA DFHMDF POS=(20,66),LENGTH=12,ATTRB=(ASKIP,NORM),COLOR=BLUE      00126**5
*                                                                       00127**1
AMSG    DFHMDF POS=(21,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=RED          00128**1
        DFHMDF POS=(22,1),LENGTH=11,INITIAL='COMMAND==>',              C00129**1
               ATTRB=(PROT,BRT)                                         00130**1
ANAVCMD DFHMDF POS=(22,13),LENGTH=8,ATTRB=(UNPROT),                    C00131**1
               HILIGHT=UNDERLINE,COLOR=GREEN                            00132**1
        DFHMDF POS=(22,22),LENGTH=1,ATTRB=(ASKIP)                       00133**1
        DFHMDF POS=(22,24),LENGTH=7,INITIAL='KEY===>',ATTRB=(PROT,BRT)  00134**1
ANAVKEY DFHMDF POS=(22,32),LENGTH=25,ATTRB=(UNPROT),                   C00135**1
               HILIGHT=UNDERLINE,COLOR=GREEN                            00136**1
        DFHMDF POS=(22,58),LENGTH=1,ATTRB=(ASKIP)                       00137**1
        DFHMDF POS=(22,63),LENGTH=16,INITIAL='PA2=OTHER FKEYS',        C00138**1
               ATTRB=(PROT,BRT)                                         00139**1
*                                                                       00140**5
AFKLIN1 DFHMDF POS=(23,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00141**1
AFKLIN2 DFHMDF POS=(24,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00142**1
        DFHMSD TYPE=FINAL                                               00143**1
        END                                                             00144**1
