*          DATA SET MBKM107    AT LEVEL 027 AS OF 01/29/92                      
        PRINT  NOGEN                                                    00001*19
MBKM107 DFHMSD TYPE=DSECT,                                             C00002*20
               LANG=COBOL,                                             C00003*19
               MODE=INOUT,                                             C00004*19
               STORAGE=AUTO,                                           C00005*19
               TERM=3270-2,                                            C00006*19
               TIOAPFX=YES                                              00007*19
MB107A  DFHMDI LINE=1,                                                 C00008*20
               COLUMN=1,                                               c00009*19
               CTRL=(FREEKB,FRSET),                                    C00010*19
               SIZE=(24,80),                                           C00011*19
               MAPATTS=(COLOR,HILIGHT),                                C00012*19
               DSATTS=(COLOR,HILIGHT)                                   00013*19
ADATE   DFHMDF POS=(1,2),                                              C00014*19
               LENGTH=10,                                              C00015*19
               COLOR=NEUTRAL,                                          C00016*19
               ATTRB=(ASKIP,BRT)                                        00017*19
ATIME   DFHMDF POS=(1,14),                                             C00018*19
               LENGTH=8,                                               C00019*19
               COLOR=NEUTRAL,                                          C00020*19
               ATTRB=(ASKIP,BRT)                                        00021*19
ATITLE  DFHMDF POS=(1,25),                                             C00022*19
               LENGTH=30,                                              C00023*19
               COLOR=NEUTRAL,                                          C00024*19
               ATTRB=(ASKIP,BRT)                                        00025*19
ATERMID DFHMDF POS=(1,63),                                             C00026*19
               LENGTH=4,                                               C00027*19
               COLOR=NEUTRAL,                                          C00028*19
               ATTRB=(ASKIP,BRT,FSET)                                   00029*19
APGMID  DFHMDF POS=(1,71),                                             C00030*19
               LENGTH=8,                                               C00031*19
               COLOR=NEUTRAL,                                          C00032*19
               ATTRB=(ASKIP,BRT)                                        00033*19
*                                                                       00034*19
        DFHMDF POS=(2,32),                                             C00035*19
               LENGTH=8,                                               C00036*19
               INITIAL='COMPANY:',                                     C00037*19
               COLOR=NEUTRAL,                                          C00038*19
               ATTRB=(PROT,BRT)                                         00039*27
ACO     DFHMDF POS=(2,42),                                             C00040*19
               LENGTH=2,                                               C00041*19
               COLOR=BLUE,                                             C00042*19
               ATTRB=(ASKIP,NORM)                                       00043*19
*                                                                       00044*19
        DFHMDF POS=(4,29),                                             C00045*19
               LENGTH=11,                                              C00046*19
               INITIAL='DEPARTMENT:',                                  C00047*19
               COLOR=NEUTRAL,                                          C00048*19
               ATTRB=(PROT,BRT)                                         00049*27
ADEPT   DFHMDF POS=(4,42),                                             C00050*19
               LENGTH=3,                                               C00051*19
               HILIGHT=UNDERLINE,                                      C00052*24
               COLOR=GREEN,                                            C00053*24
               ATTRB=(UNPROT,NORM,IC)                                   00054*24
        DFHMDF POS=(4,46),                                             C00055*19
               LENGTH=1,                                               C00056*19
               INITIAL=' ',                                            C00057*19
               ATTRB=(PROT,ASKIP,DRK)                                   00058*19
*                                                                       00059*19
        DFHMDF POS=(5,28),                                             C00060*19
               LENGTH=12,                                              C00061*19
               INITIAL='MAJOR CLASS:',                                 C00062*19
               COLOR=NEUTRAL,                                          C00063*19
               ATTRB=(PROT,BRT)                                         00064*27
AMCLASS DFHMDF POS=(5,42),                                             C00065*19
               LENGTH=2,                                               C00066*19
               HILIGHT=UNDERLINE,                                      C00067*24
               COLOR=GREEN,                                            C00068*24
               ATTRB=(UNPROT,NORM)                                      00069*24
        DFHMDF POS=(5,45),                                             C00070*19
               LENGTH=1,                                               C00071*19
               INITIAL=' ',                                            C00072*19
               ATTRB=(PROT,ASKIP,DRK)                                   00073*19
*                                                                       00074*19
        DFHMDF POS=(6,30),                                             C00075*19
               LENGTH=10,                                              C00076*19
               INITIAL='SUB CLASS:',                                   C00077*19
               COLOR=NEUTRAL,                                          C00078*19
               ATTRB=(PROT,BRT)                                         00079*27
ASCLASS DFHMDF POS=(6,42),                                             C00080*19
               LENGTH=3,                                               C00081*19
               HILIGHT=UNDERLINE,                                      C00082*24
               COLOR=GREEN,                                            C00083*24
               ATTRB=(UNPROT,NORM)                                      00084*24
        DFHMDF POS=(6,46),                                             C00085*19
               LENGTH=1,                                               C00086*19
               INITIAL=' ',                                            C00087*19
               ATTRB=(PROT,ASKIP,DRK)                                   00088*19
*                                                                       00089*19
        DFHMDF POS=(8,24),                                             C00090*23
               LENGTH=16,                                              C00091*23
               INITIAL='INCLUDE HISTORY:',                             C00092*23
               COLOR=NEUTRAL,                                          C00093*23
               ATTRB=(PROT,BRT)                                         00094*27
AHISTRY DFHMDF POS=(8,42),                                             C00095*26
               LENGTH=1,                                               C00096*23
               COLOR=GREEN,                                            C00097*23
               HILIGHT=UNDERLINE,                                      C00098*24
               ATTRB=(UNPROT,NORM)                                      00099*24
        DFHMDF POS=(8,44),                                             C00100*26
               LENGTH=1,                                               C00101*23
               INITIAL=' ',                                            C00102*23
               ATTRB=(PROT,ASKIP,DRK)                                   00103*23
*                                                                       00104*23
AMSG    DFHMDF POS=(21,1),                                             C00105*19
               LENGTH=78,                                              C00106*19
               COLOR=NEUTRAL,                                          C00107*19
               ATTRB=(ASKIP,BRT)                                        00108*19
*                                                                       00109*19
        DFHMDF POS=(22,1),                                             C00110*19
               LENGTH=11,                                              C00111*19
               INITIAL='COMMAND===>',                                  C00112*19
               COLOR=NEUTRAL,                                          C00113*19
               ATTRB=(PROT,BRT)                                         00114*19
ANAVCMD DFHMDF POS=(22,13),                                            C00115*19
               LENGTH=8,                                               C00116*19
               COLOR=GREEN,                                            C00117*19
               HILIGHT=UNDERLINE,                                      C00118*19
               ATTRB=(UNPROT,NORM)                                      00119*24
        DFHMDF POS=(22,22),                                            C00120*19
               LENGTH=1,                                               C00121*19
               ATTRB=(ASKIP,DRK)                                        00122*19
        DFHMDF POS=(22,24),                                            C00123*19
               LENGTH=7,                                               C00124*19
               INITIAL='KEY===>',                                      C00125*19
               COLOR=NEUTRAL,                                          C00126*19
               ATTRB=(PROT,BRT)                                         00127*19
ANAVKEY DFHMDF POS=(22,32),                                            C00128*19
               LENGTH=25,                                              C00129*19
               COLOR=GREEN,                                            C00130*19
               HILIGHT=UNDERLINE,                                      C00131*19
               ATTRB=(UNPROT,NORM)                                      00132*19
        DFHMDF POS=(22,58),                                            C00133*19
               LENGTH=1,                                               C00134*19
               ATTRB=(ASKIP,DRK)                                        00135*19
        DFHMDF POS=(22,63),                                            C00136*19
               LENGTH=16,                                              C00137*19
               COLOR=NEUTRAL,                                          C00138*19
               INITIAL='PA2=OTHER F KEYS',                             C00139*19
               ATTRB=(PROT,BRT)                                         00140*19
*                                                                       00141*19
AFKLIN1 DFHMDF POS=(23,1),                                             C00142*19
               LENGTH=78,                                              C00143*19
               PICOUT='X(78)',                                         C00144*19
               COLOR=NEUTRAL,                                          C00145*19
               ATTRB=(ASKIP,BRT)                                        00146*19
*                                                                       00147*19
AFKLIN2 DFHMDF POS=(24,1),                                             C00148*19
               LENGTH=78,                                              C00149*19
               PICOUT='X(78)',                                         C00150*19
               COLOR=NEUTRAL,                                          C00151*19
               ATTRB=(ASKIP,BRT)                                        00152*19
        DFHMSD TYPE=FINAL                                               00153*19
        END                                                             00154*19
