*          DATA SET MBKM127    AT LEVEL 007 AS OF 01/30/92                      
*********************************************************************** 00001**1
*       MAPSET  MBKM127                                                 00002**1
*       MAP     MB1237                                                  00003**1
*       PROGRAM MBKCS127 - MERCHANDISE LEVEL LIST                       00004**1
*       TRANSID R127                                                    00005**1
*       SYSTEM  CICS ARCHITECTURE                                       00006**1
*********************************************************************** 00007**1
        PRINT  NOGEN                                                    00008**1
MBKM127 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES,             C00009**1
               CTRL=(FREEKB)                                            00010**1
MB127A  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),                   C00011**1
               DSATTS=(COLOR,HILIGHT)                                   00012**1
ADATE   DFHMDF POS=(01,02),LENGTH=10,ATTRB=(ASKIP,BRT),                C00013**7
               COLOR=NEUTRAL                                            00014**1
ATIME   DFHMDF POS=(01,14),LENGTH=08,ATTRB=(ASKIP,BRT),                C00015**7
               COLOR=NEUTRAL                                            00016**1
ATITLE  DFHMDF POS=(01,25),LENGTH=30,ATTRB=(ASKIP,BRT),                C00017**1
               COLOR=NEUTRAL                                            00018**1
ATERMID DFHMDF POS=(01,66),LENGTH=04,ATTRB=(ASKIP,BRT),                C00019**7
               COLOR=NEUTRAL                                            00020**1
APGMID  DFHMDF POS=(01,72),LENGTH=08,ATTRB=(ASKIP,BRT),                C00021**7
               COLOR=NEUTRAL                                            00022**1
*                                                                       00023**1
        DFHMDF POS=(2,31),LENGTH=8,ATTRB=(ASKIP,BRT),                  C00024**1
               INITIAL='COMPANY:'                                       00025**1
AOPERCO DFHMDF POS=(2,41),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE        00026**7
*                                                                       00027**1
        DFHMDF POS=(3,48),LENGTH=6,ATTRB=(ASKIP,BRT),                  C00028**1
               INITIAL='ITEMS:'                                         00029**1
ABEGITM DFHMDF POS=(3,55),LENGTH=5,ATTRB=(UNPROT,FSET,NUM),            C00030**3
               HILIGHT=UNDERLINE,COLOR=GREEN                            00031**1
        DFHMDF POS=(3,61),LENGTH=2,ATTRB=(ASKIP,BRT),                  C00032**1
               INITIAL='TO'                                             00033**1
ATOITM  DFHMDF POS=(3,64),LENGTH=5,ATTRB=(ASKIP,NORM),COLOR=BLUE        00034**7
        DFHMDF POS=(3,70),LENGTH=2,ATTRB=(ASKIP,BRT),                  C00035**1
               INITIAL='OF'                                             00036**1
ATOTITM DFHMDF POS=(3,73),LENGTH=5,ATTRB=(ASKIP,NORM),COLOR=BLUE        00037**7
*                                                                       00038**1
        DFHMDF POS=(4,07),LENGTH=05,ATTRB=(ASKIP,BRT),                 C00039**5
               INITIAL='MERCH'                                          00040**5
        DFHMDF POS=(4,41),LENGTH=06,ATTRB=(ASKIP,BRT),                 C00041**5
               INITIAL='PARENT'                                         00042**5
        DFHMDF POS=(5,02),LENGTH=10,ATTRB=(ASKIP,BRT),                 C00043**6
               INITIAL='SEL  LEVEL'                                     00044**5
        DFHMDF POS=(5,14),LENGTH=11,ATTRB=(ASKIP,BRT),                 C00045**5
               INITIAL='DESCRIPTION'                                    00046**1
        DFHMDF POS=(5,41),LENGTH=05,ATTRB=(ASKIP,BRT),                 C00047**5
               INITIAL='LEVEL'                                          00048**5
*                                                                       00049**1
SEL1    DFHMDF POS=(6,03),LENGTH=1,ATTRB=(UNPROT,FSET),                C00050**4
               HILIGHT=UNDERLINE,COLOR=GREEN                            00051**1
        DFHMDF POS=(6,05),LENGTH=1,ATTRB=ASKIP                          00052**4
MLEVEL1 DFHMDF POS=(6,08),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE        00053**7
DESC1   DFHMDF POS=(6,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00054**7
PLEVEL1 DFHMDF POS=(6,42),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE        00055**7
*                                                                       00056**1
SEL2    DFHMDF POS=(7,03),LENGTH=1,ATTRB=(UNPROT,FSET),                C00057**4
               HILIGHT=UNDERLINE,COLOR=GREEN                            00058**1
        DFHMDF POS=(7,05),LENGTH=1,ATTRB=ASKIP                          00059**4
MLEVEL2 DFHMDF POS=(7,08),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE        00060**7
DESC2   DFHMDF POS=(7,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00061**7
PLEVEL2 DFHMDF POS=(7,42),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE        00062**7
*                                                                       00063**1
SEL3    DFHMDF POS=(8,03),LENGTH=1,ATTRB=(UNPROT,FSET),                C00064**4
               HILIGHT=UNDERLINE,COLOR=GREEN                            00065**1
        DFHMDF POS=(8,05),LENGTH=1,ATTRB=ASKIP                          00066**4
MLEVEL3 DFHMDF POS=(8,08),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE        00067**7
DESC3   DFHMDF POS=(8,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00068**7
PLEVEL3 DFHMDF POS=(8,42),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE        00069**7
*                                                                       00070**1
SEL4    DFHMDF POS=(9,03),LENGTH=1,ATTRB=(UNPROT,FSET),                C00071**4
               HILIGHT=UNDERLINE,COLOR=GREEN                            00072**1
        DFHMDF POS=(9,05),LENGTH=1,ATTRB=ASKIP                          00073**4
MLEVEL4 DFHMDF POS=(9,08),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE        00074**7
DESC4   DFHMDF POS=(9,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00075**7
PLEVEL4 DFHMDF POS=(9,42),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE        00076**7
*                                                                       00077**1
SEL5    DFHMDF POS=(10,03),LENGTH=1,ATTRB=(UNPROT,FSET),               C00078**4
               HILIGHT=UNDERLINE,COLOR=GREEN                            00079**1
        DFHMDF POS=(10,05),LENGTH=1,ATTRB=ASKIP                         00080**4
MLEVEL5 DFHMDF POS=(10,08),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00081**7
DESC5   DFHMDF POS=(10,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00082**7
PLEVEL5 DFHMDF POS=(10,42),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00083**7
*                                                                       00084**1
SEL6    DFHMDF POS=(11,03),LENGTH=1,ATTRB=(UNPROT,FSET),               C00085**4
               HILIGHT=UNDERLINE,COLOR=GREEN                            00086**1
        DFHMDF POS=(11,05),LENGTH=1,ATTRB=ASKIP                         00087**4
MLEVEL6 DFHMDF POS=(11,08),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00088**7
DESC6   DFHMDF POS=(11,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00089**7
PLEVEL6 DFHMDF POS=(11,42),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00090**7
*                                                                       00091**1
SEL7    DFHMDF POS=(12,03),LENGTH=1,ATTRB=(UNPROT,FSET),               C00092**4
               HILIGHT=UNDERLINE,COLOR=GREEN                            00093**1
        DFHMDF POS=(12,05),LENGTH=1,ATTRB=ASKIP                         00094**4
MLEVEL7 DFHMDF POS=(12,08),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00095**7
DESC7   DFHMDF POS=(12,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00096**7
PLEVEL7 DFHMDF POS=(12,42),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00097**7
*                                                                       00098**1
SEL8    DFHMDF POS=(13,03),LENGTH=1,ATTRB=(UNPROT,FSET),               C00099**4
               HILIGHT=UNDERLINE,COLOR=GREEN                            00100**1
        DFHMDF POS=(13,05),LENGTH=1,ATTRB=ASKIP                         00101**4
MLEVEL8 DFHMDF POS=(13,08),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00102**7
DESC8   DFHMDF POS=(13,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00103**7
PLEVEL8 DFHMDF POS=(13,42),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00104**7
*                                                                       00105**1
SEL9    DFHMDF POS=(14,03),LENGTH=1,ATTRB=(UNPROT,FSET),               C00106**4
               HILIGHT=UNDERLINE,COLOR=GREEN                            00107**1
        DFHMDF POS=(14,05),LENGTH=1,ATTRB=ASKIP                         00108**4
MLEVEL9 DFHMDF POS=(14,08),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00109**7
DESC9   DFHMDF POS=(14,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00110**7
PLEVEL9 DFHMDF POS=(14,42),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00111**7
*                                                                       00112**1
SEL10   DFHMDF POS=(15,03),LENGTH=1,ATTRB=(UNPROT,FSET),               C00113**4
               HILIGHT=UNDERLINE,COLOR=GREEN                            00114**1
        DFHMDF POS=(15,05),LENGTH=1,ATTRB=ASKIP                         00115**4
MLEVEL0 DFHMDF POS=(15,08),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00116**7
DESC10  DFHMDF POS=(15,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00117**7
PLEVEL0 DFHMDF POS=(15,42),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00118**7
*                                                                       00119**1
SELB    DFHMDF POS=(16,03),LENGTH=1,ATTRB=(UNPROT,FSET),               C00120**4
               HILIGHT=UNDERLINE,COLOR=GREEN                            00121**1
        DFHMDF POS=(16,05),LENGTH=1,ATTRB=ASKIP                         00122**4
MLEVELB DFHMDF POS=(16,08),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00123**7
DESCB   DFHMDF POS=(16,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00124**7
PLEVELB DFHMDF POS=(16,42),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00125**7
*                                                                       00126**1
SELC    DFHMDF POS=(17,03),LENGTH=1,ATTRB=(UNPROT,FSET),               C00127**4
               HILIGHT=UNDERLINE,COLOR=GREEN                            00128**1
        DFHMDF POS=(17,05),LENGTH=1,ATTRB=ASKIP                         00129**4
MLEVELC DFHMDF POS=(17,08),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00130**7
DESCC   DFHMDF POS=(17,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00131**7
PLEVELC DFHMDF POS=(17,42),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00132**7
*                                                                       00133**1
SELD    DFHMDF POS=(18,03),LENGTH=1,ATTRB=(UNPROT,FSET),               C00134**4
               HILIGHT=UNDERLINE,COLOR=GREEN                            00135**1
        DFHMDF POS=(18,05),LENGTH=1,ATTRB=ASKIP                         00136**4
MLEVELD DFHMDF POS=(18,08),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00137**7
DESCD   DFHMDF POS=(18,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00138**7
PLEVELD DFHMDF POS=(18,42),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00139**7
*                                                                       00140**5
SELE    DFHMDF POS=(19,03),LENGTH=1,ATTRB=(UNPROT,FSET),               C00141**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00142**5
        DFHMDF POS=(19,05),LENGTH=1,ATTRB=ASKIP                         00143**5
MLEVELE DFHMDF POS=(19,08),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00144**7
DESCE   DFHMDF POS=(19,14),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00145**7
PLEVELE DFHMDF POS=(19,42),LENGTH=3,ATTRB=(ASKIP,NORM),COLOR=BLUE       00146**7
*                                                                       00147**1
        DFHMDF POS=(20,51),LENGTH=20,ATTRB=(ASKIP,BRT),                C00148**5
               INITIAL='TOTAL ITEMS SELECTED'                           00149**1
TOTSEL  DFHMDF POS=(20,73),LENGTH=5,ATTRB=(ASKIP,NORM),COLOR=BLUE       00150**7
*                                                                       00151**1
AMSG    DFHMDF POS=(21,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=RED          00152**1
        DFHMDF POS=(22,1),LENGTH=11,INITIAL='COMMAND==>',              C00153**1
               ATTRB=(PROT,BRT)                                         00154**1
ANAVCMD DFHMDF POS=(22,13),LENGTH=8,ATTRB=(UNPROT),                    C00155**1
               HILIGHT=UNDERLINE,COLOR=GREEN                            00156**1
        DFHMDF POS=(22,22),LENGTH=1,ATTRB=(ASKIP)                       00157**1
        DFHMDF POS=(22,24),LENGTH=7,INITIAL='KEY===>',ATTRB=(PROT,BRT)  00158**1
ANAVKEY DFHMDF POS=(22,32),LENGTH=25,ATTRB=(UNPROT),                   C00159**1
               HILIGHT=UNDERLINE,COLOR=GREEN                            00160**1
        DFHMDF POS=(22,58),LENGTH=1,ATTRB=(ASKIP)                       00161**1
        DFHMDF POS=(22,63),LENGTH=16,INITIAL='PA2=OTHER FKEYS',        C00162**1
               ATTRB=(PROT,BRT)                                         00163**1
AFKLIN1 DFHMDF POS=(23,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00164**1
AFKLIN2 DFHMDF POS=(24,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00165**1
        DFHMSD TYPE=FINAL                                               00166**1
        END                                                             00167**1
