*          DATA SET MBKM102    AT LEVEL 032 AS OF 01/29/92                      
*          SCREEN LAYOUT MERCHANDISE AREA LIST                          00001**5
        PRINT  NOGEN                                                    00002   
MBKM102 DFHMSD TYPE=MAP,                                               C00003*28
               MODE=INOUT,                                             C00004   
               LANG=COBOL,                                             C00005*20
               TIOAPFX=YES,                                            C00006*20
               CTRL=(FREEKB)                                            00007*20
MB102A  DFHMDI SIZE=(24,80),                                           C00008*28
               MAPATTS=(COLOR,HILIGHT),                                C00009   
               DSATTS=(COLOR,HILIGHT)                                   00010   
ADATE   DFHMDF POS=(1,2),                                              C00011   
               LENGTH=10,                                              C00012   
               COLOR=NEUTRAL,                                          C00013   
               ATTRB=(ASKIP,BRT)                                        00014*32
ATIME   DFHMDF POS=(1,14),                                             C00015   
               LENGTH=8,                                               C00016   
               COLOR=NEUTRAL,                                          C00017   
               ATTRB=(ASKIP,BRT)                                        00018*32
ATITLE  DFHMDF POS=(1,25),                                             C00019   
               LENGTH=30,                                              C00020   
               COLOR=NEUTRAL,                                          C00021   
               ATTRB=(ASKIP,BRT)                                        00022   
ATERMID DFHMDF POS=(1,63),                                             C00023   
               LENGTH=4,                                               C00024   
               COLOR=NEUTRAL,                                          C00025   
               ATTRB=(ASKIP,BRT)                                        00026*32
APGMID  DFHMDF POS=(1,71),                                             C00027   
               LENGTH=8,                                               C00028   
               COLOR=NEUTRAL,                                          C00029   
               ATTRB=(ASKIP,BRT)                                        00030*32
*                                                                       00031   
        DFHMDF POS=(2,33),                                             C00032*27
               LENGTH=8,                                               C00033   
               INITIAL='COMPANY:',                                     C00034   
               COLOR=NEUTRAL,                                          C00035**6
               ATTRB=(PROT,BRT)                                         00036*32
AOPERCO DFHMDF POS=(2,43),                                             C00037*27
               LENGTH=2,                                               C00038   
               COLOR=BLUE,                                             C00039   
               ATTRB=(ASKIP,NORM)                                       00040   
*                                                                       00041*26
        DFHMDF POS=(3,40),                                             C00042   
               LENGTH=1,                                               C00043   
               INITIAL=' ',                                            C00044   
               ATTRB=(PROT,ASKIP,DRK)                                   00045   
        DFHMDF POS=(3,43),                                             C00046   
               LENGTH=6,                                               C00047   
               INITIAL='ITEMS:',                                       C00048   
               COLOR=NEUTRAL,                                          C00049**6
               ATTRB=(PROT,BRT)                                         00050*32
ABEGITM DFHMDF POS=(3,50),                                             C00051   
               LENGTH=6,                                               C00052*30
               COLOR=GREEN,                                            C00053**8
               HILIGHT=UNDERLINE,                                      C00054**8
               ATTRB=(UNPROT,FSET,NUM,NORM)                             00055*32
        DFHMDF POS=(3,57),                                             C00056*31
               LENGTH=2,                                               C00057   
               INITIAL='TO',                                           C00058   
               COLOR=NEUTRAL,                                          C00059**6
               ATTRB=(ASKIP,BRT)                                        00060*26
AENDITM DFHMDF POS=(3,60),                                             C00061*31
               LENGTH=6,                                               C00062*30
               COLOR=BLUE,                                             C00063   
               ATTRB=(ASKIP,NORM)                                       00064*32
AOF     DFHMDF POS=(3,68),                                             C00065*31
               LENGTH=2,                                               C00066   
               INITIAL='OF',                                           C00067   
               COLOR=NEUTRAL,                                          C00068**6
               ATTRB=(ASKIP,BRT)                                        00069*20
ATOTITM DFHMDF POS=(3,71),                                             C00070*31
               LENGTH=6,                                               C00071*30
               COLOR=BLUE,                                             C00072   
               ATTRB=(ASKIP,NORM)                                       00073*32
*                                                                       00074   
        DFHMDF POS=(5,1),                                              C00075   
               LENGTH=3,                                               C00076   
               INITIAL='SEL',                                          C00077   
               COLOR=NEUTRAL,                                          C00078**7
               ATTRB=(PROT,BRT)                                         00079**8
        DFHMDF POS=(5,5),                                              C00080**2
               LENGTH=3,                                               C00081**2
               INITIAL='GMA',                                          C00082**2
               COLOR=NEUTRAL,                                          C00083**7
               ATTRB=(PROT,BRT)                                         00084**8
        DFHMDF POS=(5,9),                                              C00085**3
               LENGTH=3,                                               C00086**3
               INITIAL='DMA',                                          C00087**3
               COLOR=NEUTRAL,                                          C00088**7
               ATTRB=(PROT,BRT)                                         00089**8
        DFHMDF POS=(5,13),                                             C00090**3
               LENGTH=3,                                               C00091**3
               INITIAL='DPT',                                          C00092**3
               COLOR=NEUTRAL,                                          C00093**7
               ATTRB=(PROT,BRT)                                         00094**8
        DFHMDF POS=(5,17),                                             C00095**3
               LENGTH=3,                                               C00096**3
               INITIAL='MCL',                                          C00097**3
               COLOR=NEUTRAL,                                          C00098**8
               ATTRB=(PROT,BRT)                                         00099**8
        DFHMDF POS=(5,21),                                             C00100**3
               LENGTH=3,                                               C00101**3
               INITIAL='SCL',                                          C00102**3
               COLOR=NEUTRAL,                                          C00103**8
               ATTRB=(PROT,BRT)                                         00104**8
        DFHMDF POS=(5,25),                                             C00105**3
               LENGTH=3,                                               C00106**3
               INITIAL='LVL',                                          C00107**3
               COLOR=NEUTRAL,                                          C00108**8
               ATTRB=(PROT,BRT)                                         00109**8
        DFHMDF POS=(5,29),                                             C00110**3
               LENGTH=11,                                              C00111**3
               INITIAL='DESCRIPTION',                                  C00112**3
               COLOR=NEUTRAL,                                          C00113**8
               ATTRB=(PROT,BRT)                                         00114**8
        DFHMDF POS=(5,57),                                             C00115**3
               LENGTH=5,                                               C00116**3
               INITIAL='START',                                        C00117**3
               COLOR=NEUTRAL,                                          C00118**8
               ATTRB=(PROT,BRT)                                         00119**8
        DFHMDF POS=(5,66),                                             C00120**3
               LENGTH=3,                                               C00121**3
               INITIAL='END',                                          C00122**3
               COLOR=NEUTRAL,                                          C00123**8
               ATTRB=(PROT,BRT)                                         00124**8
        DFHMDF POS=(5,73),                                             C00125**3
               LENGTH=6,                                               C00126**3
               INITIAL='ACTION',                                       C00127**3
               COLOR=NEUTRAL,                                          C00128**8
               ATTRB=(PROT,BRT)                                         00129**8
*                                                                       00130**3
ASEL01  DFHMDF POS=(6,1),                                              C00131*15
               LENGTH=1,                                               C00132**3
               COLOR=GREEN,                                            C00133**8
               HILIGHT=UNDERLINE,                                      C00134*13
               ATTRB=(UNPROT,FSET,NORM)                                 00135*32
        DFHMDF POS=(6,3),                                              C00136*15
               INITIAL=' ',                                            C00137*16
               LENGTH=1,                                               C00138*15
               ATTRB=(ASKIP,DRK)                                        00139*15
AGMA01  DFHMDF POS=(6,5),                                              C00140**3
               LENGTH=2,                                               C00141**3
               COLOR=BLUE,                                             C00142**3
               ATTRB=(ASKIP,NORM)                                       00143**3
ADMA01  DFHMDF POS=(6,9),                                              C00144**3
               LENGTH=2,                                               C00145**3
               COLOR=BLUE,                                             C00146**3
               ATTRB=(ASKIP,NORM)                                       00147**3
ADEPT01 DFHMDF POS=(6,13),                                             C00148**3
               LENGTH=3,                                               C00149**3
               COLOR=BLUE,                                             C00150**3
               ATTRB=(ASKIP,NORM)                                       00151**3
AMCLS01 DFHMDF POS=(6,17),                                             C00152**3
               LENGTH=2,                                               C00153**3
               COLOR=BLUE,                                             C00154**3
               ATTRB=(ASKIP,NORM)                                       00155**3
ASCLS01 DFHMDF POS=(6,21),                                             C00156**3
               LENGTH=3,                                               C00157**3
               COLOR=BLUE,                                             C00158**3
               ATTRB=(ASKIP,NORM)                                       00159**3
AMLVL01 DFHMDF POS=(6,25),                                             C00160**3
               LENGTH=3,                                               C00161**3
               COLOR=BLUE,                                             C00162**3
               ATTRB=(ASKIP,NORM)                                       00163**3
AMDES01 DFHMDF POS=(6,29),                                             C00164**3
               LENGTH=25,                                              C00165**3
               COLOR=BLUE,                                             C00166**3
               ATTRB=(ASKIP,NORM)                                       00167**3
ASTRT01 DFHMDF POS=(6,55),                                             C00168**3
               LENGTH=8,                                               C00169**3
               COLOR=BLUE,                                             C00170**3
               ATTRB=(ASKIP,NORM)                                       00171**3
AEND01  DFHMDF POS=(6,64),                                             C00172**3
               LENGTH=8,                                               C00173**3
               COLOR=BLUE,                                             C00174**3
               ATTRB=(ASKIP,NORM)                                       00175**3
AACT01  DFHMDF POS=(6,73),                                             C00176**3
               LENGTH=7,                                               C00177**3
               COLOR=BLUE,                                             C00178**3
               ATTRB=(ASKIP,NORM)                                       00179**3
*                                                                       00180**4
ASEL02  DFHMDF POS=(7,1),                                              C00181*17
               LENGTH=1,                                               C00182**4
               COLOR=GREEN,                                            C00183*13
               HILIGHT=UNDERLINE,                                      C00184*13
               ATTRB=(UNPROT,FSET,NORM)                                 00185*32
        DFHMDF POS=(7,3),                                              C00186*16
               INITIAL=' ',                                            C00187*16
               LENGTH=1,                                               C00188*16
               ATTRB=(ASKIP,DRK)                                        00189*16
AGMA02  DFHMDF POS=(7,5),                                              C00190**4
               LENGTH=2,                                               C00191**4
               COLOR=BLUE,                                             C00192**4
               ATTRB=(ASKIP,NORM)                                       00193**4
ADMA02  DFHMDF POS=(7,9),                                              C00194**4
               LENGTH=2,                                               C00195**4
               COLOR=BLUE,                                             C00196**4
               ATTRB=(ASKIP,NORM)                                       00197**4
ADEPT02 DFHMDF POS=(7,13),                                             C00198**4
               LENGTH=3,                                               C00199**4
               COLOR=BLUE,                                             C00200**4
               ATTRB=(ASKIP,NORM)                                       00201**4
AMCLS02 DFHMDF POS=(7,17),                                             C00202**4
               LENGTH=2,                                               C00203**4
               COLOR=BLUE,                                             C00204**4
               ATTRB=(ASKIP,NORM)                                       00205**4
ASCLS02 DFHMDF POS=(7,21),                                             C00206**4
               LENGTH=3,                                               C00207**4
               COLOR=BLUE,                                             C00208**4
               ATTRB=(ASKIP,NORM)                                       00209**4
AMLVL02 DFHMDF POS=(7,25),                                             C00210**4
               LENGTH=3,                                               C00211**4
               COLOR=BLUE,                                             C00212**4
               ATTRB=(ASKIP,NORM)                                       00213**4
AMDES02 DFHMDF POS=(7,29),                                             C00214**4
               LENGTH=25,                                              C00215**4
               COLOR=BLUE,                                             C00216**4
               ATTRB=(ASKIP,NORM)                                       00217**4
ASTRT02 DFHMDF POS=(7,55),                                             C00218**4
               LENGTH=8,                                               C00219**4
               COLOR=BLUE,                                             C00220**4
               ATTRB=(ASKIP,NORM)                                       00221**4
AEND02  DFHMDF POS=(7,64),                                             C00222**4
               LENGTH=8,                                               C00223**4
               COLOR=BLUE,                                             C00224**4
               ATTRB=(ASKIP,NORM)                                       00225**4
AACT02  DFHMDF POS=(7,73),                                             C00226**4
               LENGTH=7,                                               C00227**4
               COLOR=BLUE,                                             C00228**4
               ATTRB=(ASKIP,NORM)                                       00229**4
*                                                                       00230**4
ASEL03  DFHMDF POS=(8,1),                                              C00231*17
               LENGTH=1,                                               C00232**4
               COLOR=GREEN,                                            C00233*13
               HILIGHT=UNDERLINE,                                      C00234*13
               ATTRB=(UNPROT,FSET,NORM)                                 00235*32
        DFHMDF POS=(8,3),                                              C00236*16
               INITIAL=' ',                                            C00237*16
               LENGTH=1,                                               C00238*16
               ATTRB=(ASKIP,DRK)                                        00239*16
AGMA03  DFHMDF POS=(8,5),                                              C00240**4
               LENGTH=2,                                               C00241**4
               COLOR=BLUE,                                             C00242**4
               ATTRB=(ASKIP,NORM)                                       00243**4
ADMA03  DFHMDF POS=(8,9),                                              C00244**4
               LENGTH=2,                                               C00245**4
               COLOR=BLUE,                                             C00246**4
               ATTRB=(ASKIP,NORM)                                       00247**4
ADEPT03 DFHMDF POS=(8,13),                                             C00248**4
               LENGTH=3,                                               C00249**4
               COLOR=BLUE,                                             C00250**4
               ATTRB=(ASKIP,NORM)                                       00251**4
AMCLS03 DFHMDF POS=(8,17),                                             C00252**4
               LENGTH=2,                                               C00253**4
               COLOR=BLUE,                                             C00254**4
               ATTRB=(ASKIP,NORM)                                       00255**4
ASCLS03 DFHMDF POS=(8,21),                                             C00256**4
               LENGTH=3,                                               C00257**4
               COLOR=BLUE,                                             C00258**4
               ATTRB=(ASKIP,NORM)                                       00259**4
AMLVL03 DFHMDF POS=(8,25),                                             C00260**4
               LENGTH=3,                                               C00261**4
               COLOR=BLUE,                                             C00262**4
               ATTRB=(ASKIP,NORM)                                       00263**4
AMDES03 DFHMDF POS=(8,29),                                             C00264**4
               LENGTH=25,                                              C00265**4
               COLOR=BLUE,                                             C00266**4
               ATTRB=(ASKIP,NORM)                                       00267**4
ASTRT03 DFHMDF POS=(8,55),                                             C00268**4
               LENGTH=8,                                               C00269**4
               COLOR=BLUE,                                             C00270**4
               ATTRB=(ASKIP,NORM)                                       00271**4
AEND03  DFHMDF POS=(8,64),                                             C00272**4
               LENGTH=8,                                               C00273**4
               COLOR=BLUE,                                             C00274**4
               ATTRB=(ASKIP,NORM)                                       00275**4
AACT03  DFHMDF POS=(8,73),                                             C00276**4
               LENGTH=7,                                               C00277**4
               COLOR=BLUE,                                             C00278**4
               ATTRB=(ASKIP,NORM)                                       00279**4
*                                                                       00280**4
ASEL04  DFHMDF POS=(9,1),                                              C00281*17
               LENGTH=1,                                               C00282**4
               COLOR=GREEN,                                            C00283*13
               HILIGHT=UNDERLINE,                                      C00284*13
               ATTRB=(UNPROT,FSET,NORM)                                 00285*32
        DFHMDF POS=(9,3),                                              C00286*16
               INITIAL=' ',                                            C00287*16
               LENGTH=1,                                               C00288*16
               ATTRB=(ASKIP,DRK)                                        00289*16
AGMA04  DFHMDF POS=(9,5),                                              C00290**4
               LENGTH=2,                                               C00291**4
               COLOR=BLUE,                                             C00292**4
               ATTRB=(ASKIP,NORM)                                       00293**4
ADMA04  DFHMDF POS=(9,9),                                              C00294**4
               LENGTH=2,                                               C00295**4
               COLOR=BLUE,                                             C00296**4
               ATTRB=(ASKIP,NORM)                                       00297**4
ADEPT04 DFHMDF POS=(9,13),                                             C00298**4
               LENGTH=3,                                               C00299**4
               COLOR=BLUE,                                             C00300**4
               ATTRB=(ASKIP,NORM)                                       00301**4
AMCLS04 DFHMDF POS=(9,17),                                             C00302**4
               LENGTH=2,                                               C00303**4
               COLOR=BLUE,                                             C00304**4
               ATTRB=(ASKIP,NORM)                                       00305**4
ASCLS04 DFHMDF POS=(9,21),                                             C00306**4
               LENGTH=3,                                               C00307**4
               COLOR=BLUE,                                             C00308**4
               ATTRB=(ASKIP,NORM)                                       00309**4
AMLVL04 DFHMDF POS=(9,25),                                             C00310**4
               LENGTH=3,                                               C00311**4
               COLOR=BLUE,                                             C00312**4
               ATTRB=(ASKIP,NORM)                                       00313**4
AMDES04 DFHMDF POS=(9,29),                                             C00314**4
               LENGTH=25,                                              C00315**4
               COLOR=BLUE,                                             C00316**4
               ATTRB=(ASKIP,NORM)                                       00317**4
ASTRT04 DFHMDF POS=(9,55),                                             C00318**4
               LENGTH=8,                                               C00319**4
               COLOR=BLUE,                                             C00320**4
               ATTRB=(ASKIP,NORM)                                       00321**4
AEND04  DFHMDF POS=(9,64),                                             C00322**4
               LENGTH=8,                                               C00323**4
               COLOR=BLUE,                                             C00324**4
               ATTRB=(ASKIP,NORM)                                       00325**4
AACT04  DFHMDF POS=(9,73),                                             C00326**4
               LENGTH=7,                                               C00327**4
               COLOR=BLUE,                                             C00328**4
               ATTRB=(ASKIP,NORM)                                       00329**4
*                                                                       00330**4
ASEL05  DFHMDF POS=(10,1),                                             C00331*17
               LENGTH=1,                                               C00332**4
               COLOR=GREEN,                                            C00333*13
               HILIGHT=UNDERLINE,                                      C00334*13
               ATTRB=(UNPROT,FSET,NORM)                                 00335*32
        DFHMDF POS=(10,3),                                             C00336*16
               INITIAL=' ',                                            C00337*16
               LENGTH=1,                                               C00338*16
               ATTRB=(ASKIP,DRK)                                        00339*16
AGMA05  DFHMDF POS=(10,5),                                             C00340**4
               LENGTH=2,                                               C00341**4
               COLOR=BLUE,                                             C00342**4
               ATTRB=(ASKIP,NORM)                                       00343**4
ADMA05  DFHMDF POS=(10,9),                                             C00344**4
               LENGTH=2,                                               C00345**4
               COLOR=BLUE,                                             C00346**4
               ATTRB=(ASKIP,NORM)                                       00347**4
ADEPT05 DFHMDF POS=(10,13),                                            C00348**4
               LENGTH=3,                                               C00349**4
               COLOR=BLUE,                                             C00350**4
               ATTRB=(ASKIP,NORM)                                       00351**4
AMCLS05 DFHMDF POS=(10,17),                                            C00352**4
               LENGTH=2,                                               C00353**4
               COLOR=BLUE,                                             C00354**4
               ATTRB=(ASKIP,NORM)                                       00355**4
ASCLS05 DFHMDF POS=(10,21),                                            C00356**4
               LENGTH=3,                                               C00357**4
               COLOR=BLUE,                                             C00358**4
               ATTRB=(ASKIP,NORM)                                       00359**4
AMLVL05 DFHMDF POS=(10,25),                                            C00360**9
               LENGTH=3,                                               C00361**4
               COLOR=BLUE,                                             C00362**4
               ATTRB=(ASKIP,NORM)                                       00363**4
AMDES05 DFHMDF POS=(10,29),                                            C00364**4
               LENGTH=25,                                              C00365**4
               COLOR=BLUE,                                             C00366**4
               ATTRB=(ASKIP,NORM)                                       00367**4
ASTRT05 DFHMDF POS=(10,55),                                            C00368**4
               LENGTH=8,                                               C00369**4
               COLOR=BLUE,                                             C00370**4
               ATTRB=(ASKIP,NORM)                                       00371**4
AEND05  DFHMDF POS=(10,64),                                            C00372**4
               LENGTH=8,                                               C00373**4
               COLOR=BLUE,                                             C00374**4
               ATTRB=(ASKIP,NORM)                                       00375**4
AACT05  DFHMDF POS=(10,73),                                            C00376**4
               LENGTH=7,                                               C00377**4
               COLOR=BLUE,                                             C00378**4
               ATTRB=(ASKIP,NORM)                                       00379**4
*                                                                       00380**4
ASEL06  DFHMDF POS=(11,1),                                             C00381*17
               LENGTH=1,                                               C00382**4
               COLOR=GREEN,                                            C00383*13
               HILIGHT=UNDERLINE,                                      C00384*13
               ATTRB=(UNPROT,FSET,NORM)                                 00385*32
        DFHMDF POS=(11,3),                                             C00386*16
               INITIAL=' ',                                            C00387*16
               LENGTH=1,                                               C00388*16
               ATTRB=(ASKIP,DRK)                                        00389*16
AGMA06  DFHMDF POS=(11,5),                                             C00390**4
               LENGTH=2,                                               C00391**4
               COLOR=BLUE,                                             C00392**4
               ATTRB=(ASKIP,NORM)                                       00393**4
ADMA06  DFHMDF POS=(11,9),                                             C00394**4
               LENGTH=2,                                               C00395**4
               COLOR=BLUE,                                             C00396**4
               ATTRB=(ASKIP,NORM)                                       00397**4
ADEPT06 DFHMDF POS=(11,13),                                            C00398**4
               LENGTH=3,                                               C00399**4
               COLOR=BLUE,                                             C00400**4
               ATTRB=(ASKIP,NORM)                                       00401**4
AMCLS06 DFHMDF POS=(11,17),                                            C00402**4
               LENGTH=2,                                               C00403**4
               COLOR=BLUE,                                             C00404**4
               ATTRB=(ASKIP,NORM)                                       00405**4
ASCLS06 DFHMDF POS=(11,21),                                            C00406**4
               LENGTH=3,                                               C00407**4
               COLOR=BLUE,                                             C00408**4
               ATTRB=(ASKIP,NORM)                                       00409**4
AMLVL06 DFHMDF POS=(11,25),                                            C00410**9
               LENGTH=3,                                               C00411**4
               COLOR=BLUE,                                             C00412**4
               ATTRB=(ASKIP,NORM)                                       00413**4
AMDES06 DFHMDF POS=(11,29),                                            C00414**4
               LENGTH=25,                                              C00415**4
               COLOR=BLUE,                                             C00416**4
               ATTRB=(ASKIP,NORM)                                       00417**4
ASTRT06 DFHMDF POS=(11,55),                                            C00418**4
               LENGTH=8,                                               C00419**4
               COLOR=BLUE,                                             C00420**4
               ATTRB=(ASKIP,NORM)                                       00421**4
AEND06  DFHMDF POS=(11,64),                                            C00422**4
               LENGTH=8,                                               C00423**4
               COLOR=BLUE,                                             C00424**4
               ATTRB=(ASKIP,NORM)                                       00425**4
AACT06  DFHMDF POS=(11,73),                                            C00426**4
               LENGTH=7,                                               C00427**4
               COLOR=BLUE,                                             C00428**4
               ATTRB=(ASKIP,NORM)                                       00429**4
*                                                                       00430**4
ASEL07  DFHMDF POS=(12,1),                                             C00431*17
               LENGTH=1,                                               C00432**4
               COLOR=GREEN,                                            C00433*13
               HILIGHT=UNDERLINE,                                      C00434*13
               ATTRB=(UNPROT,FSET,NORM)                                 00435*32
        DFHMDF POS=(12,3),                                             C00436*16
               INITIAL=' ',                                            C00437*16
               LENGTH=1,                                               C00438*16
               ATTRB=(ASKIP,DRK)                                        00439*16
AGMA07  DFHMDF POS=(12,5),                                             C00440**4
               LENGTH=2,                                               C00441**4
               COLOR=BLUE,                                             C00442**4
               ATTRB=(ASKIP,NORM)                                       00443**4
ADMA07  DFHMDF POS=(12,9),                                             C00444**4
               LENGTH=2,                                               C00445**4
               COLOR=BLUE,                                             C00446**4
               ATTRB=(ASKIP,NORM)                                       00447**4
ADEPT07 DFHMDF POS=(12,13),                                            C00448**4
               LENGTH=3,                                               C00449**4
               COLOR=BLUE,                                             C00450**4
               ATTRB=(ASKIP,NORM)                                       00451**4
AMCLS07 DFHMDF POS=(12,17),                                            C00452**4
               LENGTH=2,                                               C00453**4
               COLOR=BLUE,                                             C00454**4
               ATTRB=(ASKIP,NORM)                                       00455**4
ASCLS07 DFHMDF POS=(12,21),                                            C00456**4
               LENGTH=3,                                               C00457**4
               COLOR=BLUE,                                             C00458**4
               ATTRB=(ASKIP,NORM)                                       00459**4
AMLVL07 DFHMDF POS=(12,25),                                            C00460**9
               LENGTH=3,                                               C00461**4
               COLOR=BLUE,                                             C00462**4
               ATTRB=(ASKIP,NORM)                                       00463**4
AMDES07 DFHMDF POS=(12,29),                                            C00464**4
               LENGTH=25,                                              C00465**4
               COLOR=BLUE,                                             C00466**4
               ATTRB=(ASKIP,NORM)                                       00467**4
ASTRT07 DFHMDF POS=(12,55),                                            C00468**4
               LENGTH=8,                                               C00469**4
               COLOR=BLUE,                                             C00470**4
               ATTRB=(ASKIP,NORM)                                       00471**4
AEND07  DFHMDF POS=(12,64),                                            C00472**4
               LENGTH=8,                                               C00473**4
               COLOR=BLUE,                                             C00474**4
               ATTRB=(ASKIP,NORM)                                       00475**4
AACT07  DFHMDF POS=(12,73),                                            C00476**4
               LENGTH=7,                                               C00477**4
               COLOR=BLUE,                                             C00478**4
               ATTRB=(ASKIP,NORM)                                       00479**4
*                                                                       00480**4
ASEL08  DFHMDF POS=(13,1),                                             C00481*17
               LENGTH=1,                                               C00482**4
               COLOR=GREEN,                                            C00483*13
               HILIGHT=UNDERLINE,                                      C00484*13
               ATTRB=(UNPROT,FSET,NORM)                                 00485*32
        DFHMDF POS=(13,3),                                             C00486*16
               INITIAL=' ',                                            C00487*16
               LENGTH=1,                                               C00488*16
               ATTRB=(ASKIP,DRK)                                        00489*16
AGMA08  DFHMDF POS=(13,5),                                             C00490**4
               LENGTH=2,                                               C00491**4
               COLOR=BLUE,                                             C00492**4
               ATTRB=(ASKIP,NORM)                                       00493**4
ADMA08  DFHMDF POS=(13,9),                                             C00494**4
               LENGTH=2,                                               C00495**4
               COLOR=BLUE,                                             C00496**4
               ATTRB=(ASKIP,NORM)                                       00497**4
ADEPT08 DFHMDF POS=(13,13),                                            C00498**4
               LENGTH=3,                                               C00499**4
               COLOR=BLUE,                                             C00500**4
               ATTRB=(ASKIP,NORM)                                       00501**4
AMCLS08 DFHMDF POS=(13,17),                                            C00502**4
               LENGTH=2,                                               C00503**4
               COLOR=BLUE,                                             C00504**4
               ATTRB=(ASKIP,NORM)                                       00505**4
ASCLS08 DFHMDF POS=(13,21),                                            C00506**4
               LENGTH=3,                                               C00507**4
               COLOR=BLUE,                                             C00508**4
               ATTRB=(ASKIP,NORM)                                       00509**4
AMLVL08 DFHMDF POS=(13,25),                                            C00510**9
               LENGTH=3,                                               C00511**4
               COLOR=BLUE,                                             C00512**4
               ATTRB=(ASKIP,NORM)                                       00513**4
AMDES08 DFHMDF POS=(13,29),                                            C00514**4
               LENGTH=25,                                              C00515**4
               COLOR=BLUE,                                             C00516**4
               ATTRB=(ASKIP,NORM)                                       00517**4
ASTRT08 DFHMDF POS=(13,55),                                            C00518**4
               LENGTH=8,                                               C00519**4
               COLOR=BLUE,                                             C00520**4
               ATTRB=(ASKIP,NORM)                                       00521**4
AEND08  DFHMDF POS=(13,64),                                            C00522**4
               LENGTH=8,                                               C00523**4
               COLOR=BLUE,                                             C00524**4
               ATTRB=(ASKIP,NORM)                                       00525**4
AACT08  DFHMDF POS=(13,73),                                            C00526**4
               LENGTH=7,                                               C00527**4
               COLOR=BLUE,                                             C00528**4
               ATTRB=(ASKIP,NORM)                                       00529**4
*                                                                       00530**5
ASEL09  DFHMDF POS=(14,1),                                             C00531*17
               LENGTH=1,                                               C00532**5
               COLOR=GREEN,                                            C00533*13
               HILIGHT=UNDERLINE,                                      C00534*13
               ATTRB=(UNPROT,FSET,NORM)                                 00535*32
        DFHMDF POS=(14,3),                                             C00536*16
               INITIAL=' ',                                            C00537*16
               LENGTH=1,                                               C00538*16
               ATTRB=(ASKIP,DRK)                                        00539*16
AGMA09  DFHMDF POS=(14,5),                                             C00540**5
               LENGTH=2,                                               C00541**5
               COLOR=BLUE,                                             C00542**5
               ATTRB=(ASKIP,NORM)                                       00543**5
ADMA09  DFHMDF POS=(14,9),                                             C00544**5
               LENGTH=2,                                               C00545**5
               COLOR=BLUE,                                             C00546**5
               ATTRB=(ASKIP,NORM)                                       00547**5
ADEPT09 DFHMDF POS=(14,13),                                            C00548**5
               LENGTH=3,                                               C00549**5
               COLOR=BLUE,                                             C00550**5
               ATTRB=(ASKIP,NORM)                                       00551**5
AMCLS09 DFHMDF POS=(14,17),                                            C00552**5
               LENGTH=2,                                               C00553**5
               COLOR=BLUE,                                             C00554**5
               ATTRB=(ASKIP,NORM)                                       00555**5
ASCLS09 DFHMDF POS=(14,21),                                            C00556**5
               LENGTH=3,                                               C00557**5
               COLOR=BLUE,                                             C00558**5
               ATTRB=(ASKIP,NORM)                                       00559**5
AMLVL09 DFHMDF POS=(14,25),                                            C00560**9
               LENGTH=3,                                               C00561**5
               COLOR=BLUE,                                             C00562**5
               ATTRB=(ASKIP,NORM)                                       00563**5
AMDES09 DFHMDF POS=(14,29),                                            C00564**5
               LENGTH=25,                                              C00565**5
               COLOR=BLUE,                                             C00566**5
               ATTRB=(ASKIP,NORM)                                       00567**5
ASTRT09 DFHMDF POS=(14,55),                                            C00568**5
               LENGTH=8,                                               C00569**5
               COLOR=BLUE,                                             C00570**5
               ATTRB=(ASKIP,NORM)                                       00571**5
AEND09  DFHMDF POS=(14,64),                                            C00572**5
               LENGTH=8,                                               C00573**5
               COLOR=BLUE,                                             C00574**5
               ATTRB=(ASKIP,NORM)                                       00575**5
AACT09  DFHMDF POS=(14,73),                                            C00576**5
               LENGTH=7,                                               C00577**5
               COLOR=BLUE,                                             C00578**5
               ATTRB=(ASKIP,NORM)                                       00579**5
*                                                                       00580**5
ASEL10  DFHMDF POS=(15,1),                                             C00581*17
               LENGTH=1,                                               C00582**5
               COLOR=GREEN,                                            C00583*13
               HILIGHT=UNDERLINE,                                      C00584*13
               ATTRB=(UNPROT,FSET,NORM)                                 00585*32
        DFHMDF POS=(15,3),                                             C00586*16
               INITIAL=' ',                                            C00587*16
               LENGTH=1,                                               C00588*16
               ATTRB=(ASKIP,DRK)                                        00589*16
AGMA10  DFHMDF POS=(15,5),                                             C00590**5
               LENGTH=2,                                               C00591**5
               COLOR=BLUE,                                             C00592**5
               ATTRB=(ASKIP,NORM)                                       00593**5
ADMA10  DFHMDF POS=(15,9),                                             C00594**5
               LENGTH=2,                                               C00595**5
               COLOR=BLUE,                                             C00596**5
               ATTRB=(ASKIP,NORM)                                       00597**5
ADEPT10 DFHMDF POS=(15,13),                                            C00598**5
               LENGTH=3,                                               C00599**5
               COLOR=BLUE,                                             C00600**5
               ATTRB=(ASKIP,NORM)                                       00601**5
AMCLS10 DFHMDF POS=(15,17),                                            C00602**5
               LENGTH=2,                                               C00603**5
               COLOR=BLUE,                                             C00604**5
               ATTRB=(ASKIP,NORM)                                       00605**5
ASCLS10 DFHMDF POS=(15,21),                                            C00606**5
               LENGTH=3,                                               C00607**5
               COLOR=BLUE,                                             C00608**5
               ATTRB=(ASKIP,NORM)                                       00609**5
AMLVL10 DFHMDF POS=(15,25),                                            C00610**9
               LENGTH=3,                                               C00611**5
               COLOR=BLUE,                                             C00612**5
               ATTRB=(ASKIP,NORM)                                       00613**5
AMDES10 DFHMDF POS=(15,29),                                            C00614**5
               LENGTH=25,                                              C00615**5
               COLOR=BLUE,                                             C00616**5
               ATTRB=(ASKIP,NORM)                                       00617**5
ASTRT10 DFHMDF POS=(15,55),                                            C00618**5
               LENGTH=8,                                               C00619**5
               COLOR=BLUE,                                             C00620**5
               ATTRB=(ASKIP,NORM)                                       00621**5
AEND10  DFHMDF POS=(15,64),                                            C00622**5
               LENGTH=8,                                               C00623**5
               COLOR=BLUE,                                             C00624**5
               ATTRB=(ASKIP,NORM)                                       00625**5
AACT10  DFHMDF POS=(15,73),                                            C00626**5
               LENGTH=7,                                               C00627**5
               COLOR=BLUE,                                             C00628**5
               ATTRB=(ASKIP,NORM)                                       00629**5
*                                                                       00630**5
ASEL11  DFHMDF POS=(16,1),                                             C00631*17
               LENGTH=1,                                               C00632**5
               COLOR=GREEN,                                            C00633*13
               HILIGHT=UNDERLINE,                                      C00634*13
               ATTRB=(UNPROT,FSET,NORM)                                 00635*32
        DFHMDF POS=(16,3),                                             C00636*16
               INITIAL=' ',                                            C00637*16
               LENGTH=1,                                               C00638*16
               ATTRB=(ASKIP,DRK)                                        00639*16
AGMA11  DFHMDF POS=(16,5),                                             C00640**5
               LENGTH=2,                                               C00641**5
               COLOR=BLUE,                                             C00642**5
               ATTRB=(ASKIP,NORM)                                       00643**5
ADMA11  DFHMDF POS=(16,9),                                             C00644**5
               LENGTH=2,                                               C00645**5
               COLOR=BLUE,                                             C00646**5
               ATTRB=(ASKIP,NORM)                                       00647**5
ADEPT11 DFHMDF POS=(16,13),                                            C00648**5
               LENGTH=3,                                               C00649**5
               COLOR=BLUE,                                             C00650**5
               ATTRB=(ASKIP,NORM)                                       00651**5
AMCLS11 DFHMDF POS=(16,17),                                            C00652**5
               LENGTH=2,                                               C00653**5
               COLOR=BLUE,                                             C00654**5
               ATTRB=(ASKIP,NORM)                                       00655**5
ASCLS11 DFHMDF POS=(16,21),                                            C00656**5
               LENGTH=3,                                               C00657**5
               COLOR=BLUE,                                             C00658**5
               ATTRB=(ASKIP,NORM)                                       00659**5
AMLVL11 DFHMDF POS=(16,25),                                            C00660**9
               LENGTH=3,                                               C00661**5
               COLOR=BLUE,                                             C00662**5
               ATTRB=(ASKIP,NORM)                                       00663**5
AMDES11 DFHMDF POS=(16,29),                                            C00664**5
               LENGTH=25,                                              C00665**5
               COLOR=BLUE,                                             C00666**5
               ATTRB=(ASKIP,NORM)                                       00667**5
ASTRT11 DFHMDF POS=(16,55),                                            C00668**5
               LENGTH=8,                                               C00669**5
               COLOR=BLUE,                                             C00670**5
               ATTRB=(ASKIP,NORM)                                       00671**5
AEND11  DFHMDF POS=(16,64),                                            C00672**5
               LENGTH=8,                                               C00673**5
               COLOR=BLUE,                                             C00674**5
               ATTRB=(ASKIP,NORM)                                       00675**5
AACT11  DFHMDF POS=(16,73),                                            C00676**5
               LENGTH=7,                                               C00677**5
               COLOR=BLUE,                                             C00678**5
               ATTRB=(ASKIP,NORM)                                       00679**5
*                                                                       00680**5
ASEL12  DFHMDF POS=(17,1),                                             C00681*17
               LENGTH=1,                                               C00682**5
               COLOR=GREEN,                                            C00683*13
               HILIGHT=UNDERLINE,                                      C00684*13
               ATTRB=(UNPROT,FSET,NORM)                                 00685*32
        DFHMDF POS=(17,3),                                             C00686*16
               INITIAL=' ',                                            C00687*16
               LENGTH=1,                                               C00688*16
               ATTRB=(ASKIP,DRK)                                        00689*16
AGMA12  DFHMDF POS=(17,5),                                             C00690**5
               LENGTH=2,                                               C00691**5
               COLOR=BLUE,                                             C00692**5
               ATTRB=(ASKIP,NORM)                                       00693**5
ADMA12  DFHMDF POS=(17,9),                                             C00694**5
               LENGTH=2,                                               C00695**5
               COLOR=BLUE,                                             C00696**5
               ATTRB=(ASKIP,NORM)                                       00697**5
ADEPT12 DFHMDF POS=(17,13),                                            C00698**5
               LENGTH=3,                                               C00699**5
               COLOR=BLUE,                                             C00700**5
               ATTRB=(ASKIP,NORM)                                       00701**5
AMCLS12 DFHMDF POS=(17,17),                                            C00702**5
               LENGTH=2,                                               C00703**5
               COLOR=BLUE,                                             C00704**5
               ATTRB=(ASKIP,NORM)                                       00705**5
ASCLS12 DFHMDF POS=(17,21),                                            C00706**5
               LENGTH=3,                                               C00707**5
               COLOR=BLUE,                                             C00708**5
               ATTRB=(ASKIP,NORM)                                       00709**5
AMLVL12 DFHMDF POS=(17,25),                                            C00710**9
               LENGTH=3,                                               C00711**5
               COLOR=BLUE,                                             C00712**5
               ATTRB=(ASKIP,NORM)                                       00713**5
AMDES12 DFHMDF POS=(17,29),                                            C00714**5
               LENGTH=25,                                              C00715**5
               COLOR=BLUE,                                             C00716**5
               ATTRB=(ASKIP,NORM)                                       00717**5
ASTRT12 DFHMDF POS=(17,55),                                            C00718**5
               LENGTH=8,                                               C00719**5
               COLOR=BLUE,                                             C00720**5
               ATTRB=(ASKIP,NORM)                                       00721**5
AEND12  DFHMDF POS=(17,64),                                            C00722**5
               LENGTH=8,                                               C00723**5
               COLOR=BLUE,                                             C00724**5
               ATTRB=(ASKIP,NORM)                                       00725**5
AACT12  DFHMDF POS=(17,73),                                            C00726**5
               LENGTH=7,                                               C00727**5
               COLOR=BLUE,                                             C00728**5
               ATTRB=(ASKIP,NORM)                                       00729**5
*                                                                       00730**5
ASEL13  DFHMDF POS=(18,1),                                             C00731*17
               LENGTH=1,                                               C00732**5
               COLOR=GREEN,                                            C00733*13
               HILIGHT=UNDERLINE,                                      C00734*13
               ATTRB=(UNPROT,FSET,NORM)                                 00735*32
        DFHMDF POS=(18,3),                                             C00736*16
               INITIAL=' ',                                            C00737*16
               LENGTH=1,                                               C00738*16
               ATTRB=(ASKIP,DRK)                                        00739*16
AGMA13  DFHMDF POS=(18,5),                                             C00740**5
               LENGTH=2,                                               C00741**5
               COLOR=BLUE,                                             C00742**5
               ATTRB=(ASKIP,NORM)                                       00743**5
ADMA13  DFHMDF POS=(18,9),                                             C00744**5
               LENGTH=2,                                               C00745**5
               COLOR=BLUE,                                             C00746**5
               ATTRB=(ASKIP,NORM)                                       00747**5
ADEPT13 DFHMDF POS=(18,13),                                            C00748**5
               LENGTH=3,                                               C00749**5
               COLOR=BLUE,                                             C00750**5
               ATTRB=(ASKIP,NORM)                                       00751**5
AMCLS13 DFHMDF POS=(18,17),                                            C00752**5
               LENGTH=2,                                               C00753**5
               COLOR=BLUE,                                             C00754**5
               ATTRB=(ASKIP,NORM)                                       00755**5
ASCLS13 DFHMDF POS=(18,21),                                            C00756**5
               LENGTH=3,                                               C00757**5
               COLOR=BLUE,                                             C00758**5
               ATTRB=(ASKIP,NORM)                                       00759**5
AMLVL13 DFHMDF POS=(18,25),                                            C00760**9
               LENGTH=3,                                               C00761**5
               COLOR=BLUE,                                             C00762**5
               ATTRB=(ASKIP,NORM)                                       00763**5
AMDES13 DFHMDF POS=(18,29),                                            C00764**5
               LENGTH=25,                                              C00765**5
               COLOR=BLUE,                                             C00766**5
               ATTRB=(ASKIP,NORM)                                       00767**5
ASTRT13 DFHMDF POS=(18,55),                                            C00768**5
               LENGTH=8,                                               C00769**5
               COLOR=BLUE,                                             C00770**5
               ATTRB=(ASKIP,NORM)                                       00771**5
AEND13  DFHMDF POS=(18,64),                                            C00772**5
               LENGTH=8,                                               C00773**5
               COLOR=BLUE,                                             C00774**5
               ATTRB=(ASKIP,NORM)                                       00775**5
AACT13  DFHMDF POS=(18,73),                                            C00776**5
               LENGTH=7,                                               C00777**5
               COLOR=BLUE,                                             C00778**5
               ATTRB=(ASKIP,NORM)                                       00779**5
*                                                                       00780**5
ASEL14  DFHMDF POS=(19,1),                                             C00781*17
               LENGTH=1,                                               C00782**5
               COLOR=GREEN,                                            C00783*13
               HILIGHT=UNDERLINE,                                      C00784*13
               ATTRB=(UNPROT,FSET,NORM)                                 00785*32
        DFHMDF POS=(19,3),                                             C00786*16
               INITIAL=' ',                                            C00787*16
               LENGTH=1,                                               C00788*16
               ATTRB=(ASKIP,DRK)                                        00789*16
AGMA14  DFHMDF POS=(19,5),                                             C00790**5
               LENGTH=2,                                               C00791**5
               COLOR=BLUE,                                             C00792**5
               ATTRB=(ASKIP,NORM)                                       00793**5
ADMA14  DFHMDF POS=(19,9),                                             C00794**5
               LENGTH=2,                                               C00795**5
               COLOR=BLUE,                                             C00796**5
               ATTRB=(ASKIP,NORM)                                       00797**5
ADEPT14 DFHMDF POS=(19,13),                                            C00798**5
               LENGTH=3,                                               C00799**5
               COLOR=BLUE,                                             C00800**5
               ATTRB=(ASKIP,NORM)                                       00801**5
AMCLS14 DFHMDF POS=(19,17),                                            C00802**5
               LENGTH=2,                                               C00803**5
               COLOR=BLUE,                                             C00804**5
               ATTRB=(ASKIP,NORM)                                       00805**5
ASCLS14 DFHMDF POS=(19,21),                                            C00806**5
               LENGTH=3,                                               C00807**5
               COLOR=BLUE,                                             C00808**5
               ATTRB=(ASKIP,NORM)                                       00809**5
AMLVL14 DFHMDF POS=(19,25),                                            C00810**9
               LENGTH=3,                                               C00811**5
               COLOR=BLUE,                                             C00812**5
               ATTRB=(ASKIP,NORM)                                       00813**5
AMDES14 DFHMDF POS=(19,29),                                            C00814**5
               LENGTH=25,                                              C00815**5
               COLOR=BLUE,                                             C00816**5
               ATTRB=(ASKIP,NORM)                                       00817**5
ASTRT14 DFHMDF POS=(19,55),                                            C00818**5
               LENGTH=8,                                               C00819**5
               COLOR=BLUE,                                             C00820**5
               ATTRB=(ASKIP,NORM)                                       00821**5
AEND14  DFHMDF POS=(19,64),                                            C00822**5
               LENGTH=8,                                               C00823**5
               COLOR=BLUE,                                             C00824**5
               ATTRB=(ASKIP,NORM)                                       00825**5
AACT14  DFHMDF POS=(19,73),                                            C00826**5
               LENGTH=7,                                               C00827**5
               COLOR=BLUE,                                             C00828**5
               ATTRB=(ASKIP,NORM)                                       00829**5
*                                                                       00830**3
        DFHMDF POS=(20,47),                                            C00831**4
               LENGTH=24,                                              C00832**4
               INITIAL='NUMBER OF SELECTED ITEMS',                     C00833*25
               COLOR=NEUTRAL,                                          C00834*29
               ATTRB=(PROT,BRT)                                         00835*32
ATOTSEL DFHMDF POS=(20,73),                                            C00836**4
               LENGTH=7,                                               C00837**4
               COLOR=BLUE,                                             C00838*21
               ATTRB=(ASKIP,NORM)                                       00839*21
*                                                                       00840**4
AMSG    DFHMDF POS=(21,1),                                             C00841**4
               LENGTH=78,                                              C00842**4
               COLOR=NEUTRAL,                                          C00843**4
               ATTRB=(ASKIP,BRT)                                        00844**4
*                                                                       00845**4
        DFHMDF POS=(22,1),                                             C00846**4
               LENGTH=11,                                              C00847**4
               INITIAL='COMMAND===>',                                  C00848**4
               COLOR=NEUTRAL,                                          C00849**4
               ATTRB=(PROT,BRT)                                         00850**9
ANAVCMD DFHMDF POS=(22,13),                                            C00851**4
               LENGTH=8,                                               C00852**4
               COLOR=GREEN,                                            C00853**9
               HILIGHT=UNDERLINE,                                      C00854**9
               ATTRB=(UNPROT,NORM,IC)                                   00855   
        DFHMDF POS=(22,22),                                            C00856*18
               LENGTH=1,                                               C00857*18
               ATTRB=(ASKIP,DRK)                                        00858*18
        DFHMDF POS=(22,24),                                            C00859**4
               LENGTH=7,                                               C00860**4
               INITIAL='KEY===>',                                      C00861**4
               COLOR=NEUTRAL,                                          C00862**4
               ATTRB=(PROT,BRT)                                         00863*12
ANAVKEY DFHMDF POS=(22,32),                                            C00864**4
               LENGTH=25,                                              C00865**4
               COLOR=GREEN,                                            C00866**9
               HILIGHT=UNDERLINE,                                      C00867**9
               ATTRB=(UNPROT,NORM)                                      00868**4
        DFHMDF POS=(22,58),                                            C00869*12
               LENGTH=1,                                               C00870*12
               ATTRB=(ASKIP,DRK)                                        00871*12
        DFHMDF POS=(22,63),                                            C00872*12
               LENGTH=16,                                              C00873*12
               INITIAL='PA2=OTHER FKEYS',                              C00874*12
               ATTRB=(PROT,BRT)                                         00875*12
*                                                                       00876**4
AFKLIN1 DFHMDF POS=(23,1),                                             C00877**4
               LENGTH=78,                                              C00878**4
               COLOR=NEUTRAL,                                          C00879**4
               ATTRB=(ASKIP,BRT)                                        00880**4
*                                                                       00881**4
AFKLIN2 DFHMDF POS=(24,1),                                             C00882**4
               LENGTH=78,                                              C00883**4
               COLOR=NEUTRAL,                                          C00884**4
               ATTRB=(ASKIP,BRT)                                        00885**4
        DFHMSD TYPE=FINAL                                               00886   
        END                                                             00887   
