*          DATA SET MBKM133    AT LEVEL 006 AS OF 01/30/92                      
        PRINT  NOGEN                                                    00001**1
MBKM133 DFHMSD TYPE=DSECT,                                             C00002**1
               LANG=COBOL,                                             C00003**1
               MODE=INOUT,                                             C00004**1
               STORAGE=AUTO,                                           C00005**1
               TERM=3270-2,                                            C00006**1
               TIOAPFX=YES                                              00007**1
MB133A  DFHMDI LINE=1,                                                 C00008**1
               COLUMN=1,                                               C00009**1
               CTRL=FREEKB,                                            C00010**1
               SIZE=(24,80),                                           C00011**1
               MAPATTS=(COLOR,HILIGHT),                                C00012**1
               DSATTS=(COLOR,HILIGHT)                                   00013**1
ADATE   DFHMDF POS=(1,2),                                              C00014**1
               LENGTH=10,                                              C00015**1
               COLOR=NEUTRAL,                                          C00016**1
               ATTRB=(ASKIP,BRT)                                        00017**1
ATIME   DFHMDF POS=(1,14),                                             C00018**1
               LENGTH=8,                                               C00019**1
               COLOR=NEUTRAL,                                          C00020**1
               ATTRB=(ASKIP,BRT)                                        00021**1
ATITLE  DFHMDF POS=(1,25),                                             C00022**1
               LENGTH=30,                                              C00023**1
               COLOR=NEUTRAL,                                          C00024**1
               ATTRB=(ASKIP,BRT)                                        00025**1
ATERMID DFHMDF POS=(1,63),                                             C00026**1
               LENGTH=4,                                               C00027**1
               COLOR=NEUTRAL,                                          C00028**1
               ATTRB=(ASKIP,BRT,FSET)                                   00029**1
APGMID  DFHMDF POS=(1,71),                                             C00030**1
               LENGTH=8,                                               C00031**1
               COLOR=NEUTRAL,                                          C00032**1
               ATTRB=(ASKIP,BRT)                                        00033**1
*                                                                       00034**1
        DFHMDF POS=(2,32),                                             C00035**1
               LENGTH=8,                                               C00036**1
               INITIAL='COMPANY:',                                     C00037**1
               ATTRB=(ASKIP,BRT)                                        00038**5
AOPERCO DFHMDF POS=(2,42),                                             C00039**1
               LENGTH=2,                                               C00040**1
               COLOR=BLUE,                                             C00041**1
               ATTRB=(ASKIP,NORM)                                       00042**6
*                                                                       00043**1
        DFHMDF POS=(4,25),                                             C00044**1
               LENGTH=15,                                              C00045**1
               INITIAL='WORKER USER ID:',                              C00046**5
               ATTRB=(ASKIP,BRT)                                        00047**2
AWORKER DFHMDF POS=(4,42),                                             C00048**1
               LENGTH=8,                                               C00049**1
               COLOR=GREEN,                                            C00050**1
               HILIGHT=UNDERLINE,                                      C00051**1
               ATTRB=(UNPROT,NORM,IC)                                   00052**1
        DFHMDF POS=(4,51),                                             C00053**1
               LENGTH=1,                                               C00054**1
               INITIAL=' ',                                            C00055**1
               ATTRB=(ASKIP,DRK)                                        00056**1
*                                                                       00057**1
        DFHMDF POS=(06,24),                                            C00058**1
               LENGTH=16,                                              C00059**1
               INITIAL='INCLUDE HISTORY:',                             C00060**1
               ATTRB=(ASKIP,BRT)                                        00061**2
AHIST   DFHMDF POS=(06,42),                                            C00062**1
               LENGTH=1,                                               C00063**1
               COLOR=GREEN,                                            C00064**1
               HILIGHT=UNDERLINE,                                      C00065**1
               ATTRB=(UNPROT,NORM)                                      00066**1
        DFHMDF POS=(06,44),                                            C00067**2
               LENGTH=1,                                               C00068**1
               INITIAL=' ',                                            C00069**2
               ATTRB=(ASKIP,DRK)                                        00070**1
*                                                                       00071**1
AMSG    DFHMDF POS=(21,1),                                             C00072**1
               LENGTH=78,                                              C00073**1
               COLOR=NEUTRAL,                                          C00074**1
               ATTRB=(ASKIP,BRT)                                        00075**1
*                                                                       00076**1
        DFHMDF POS=(22,1),                                             C00077**1
               LENGTH=11,                                              C00078**1
               INITIAL='COMMAND===>',                                  C00079**1
               COLOR=NEUTRAL,                                          C00080**1
               ATTRB=(PROT,BRT)                                         00081**1
ANAVCMD DFHMDF POS=(22,13),                                            C00082**1
               LENGTH=8,                                               C00083**1
               COLOR=GREEN,                                            C00084**1
               HILIGHT=UNDERLINE,                                      C00085**1
               ATTRB=(UNPROT,NORM)                                      00086**1
        DFHMDF POS=(22,22),                                            C00087**1
               LENGTH=1,                                               C00088**1
               ATTRB=(ASKIP,DRK)                                        00089**1
        DFHMDF POS=(22,24),                                            C00090**1
               LENGTH=7,                                               C00091**1
               INITIAL='KEY===>',                                      C00092**1
               COLOR=NEUTRAL,                                          C00093**1
               ATTRB=(PROT,BRT)                                         00094**1
ANAVKEY DFHMDF POS=(22,32),                                            C00095**1
               LENGTH=25,                                              C00096**1
               COLOR=GREEN,                                            C00097**1
               HILIGHT=UNDERLINE,                                      C00098**1
               ATTRB=(UNPROT,NORM)                                      00099**1
        DFHMDF POS=(22,58),                                            C00100**1
               LENGTH=1,                                               C00101**1
               ATTRB=(ASKIP,DRK)                                        00102**1
        DFHMDF POS=(22,63),                                            C00103**1
               LENGTH=16,                                              C00104**1
               COLOR=NEUTRAL,                                          C00105**1
               INITIAL='PA2=OTHER F KEYS',                             C00106**1
               ATTRB=(PROT,BRT)                                         00107**1
*                                                                       00108**1
AFKLIN1 DFHMDF POS=(23,1),                                             C00109**1
               LENGTH=78,                                              C00110**1
               PICOUT='X(78)',                                         C00111**1
               COLOR=NEUTRAL,                                          C00112**1
               ATTRB=(ASKIP,BRT)                                        00113**1
*                                                                       00114**1
AFKLIN2 DFHMDF POS=(24,1),                                             C00115**1
               LENGTH=78,                                              C00116**1
               PICOUT='X(78)',                                         C00117**1
               COLOR=NEUTRAL,                                          C00118**1
               ATTRB=(ASKIP,BRT)                                        00119**1
        DFHMSD TYPE=FINAL                                               00120**1
        END                                                             00121**1
