*          DATA SET MBKM135    AT LEVEL 010 AS OF 03/02/92                      
*          DATA SET MBKM135    AT LEVEL 007 AS OF 01/30/92              00001   
*********************************************************************** 00002   
*       MAPSET  MBKM135                                                 00003   
*       MAP     MB135A                                                  00004   
*       PROGRAM MBKCS135 - MERCHANDISE BUSINESS BATCH PARAMETER UPDATE  00005   
*       TRANSID R135                                                    00006   
*       SYSTEM  CICS ARCHITECTURE                                       00007   
*********************************************************************** 00008   
        PRINT  NOGEN                                                    00009   
MBKM135 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES,             C00010   
               CTRL=(FREEKB)                                            00011   
MB135A  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),                   C00012   
               DSATTS=(COLOR,HILIGHT)                                   00013   
ADATE   DFHMDF POS=(01,02),LENGTH=10,ATTRB=(ASKIP,BRT),                C00014   
               COLOR=NEUTRAL                                            00015   
ATIME   DFHMDF POS=(01,14),LENGTH=08,ATTRB=(ASKIP,BRT),                C00016   
               COLOR=NEUTRAL                                            00017   
ATITLE  DFHMDF POS=(01,25),LENGTH=30,ATTRB=(ASKIP,BRT),                C00018   
               COLOR=NEUTRAL                                            00019   
ATERMID DFHMDF POS=(01,66),LENGTH=04,ATTRB=(ASKIP,BRT),                C00020   
               COLOR=NEUTRAL                                            00021   
APGMID  DFHMDF POS=(01,72),LENGTH=08,ATTRB=(ASKIP,BRT),                C00022   
               COLOR=NEUTRAL                                            00023   
*                                                                       00024   
        DFHMDF POS=(2,31),LENGTH=8,ATTRB=(ASKIP,BRT),                  C00025   
               INITIAL='COMPANY:'                                       00026   
AOPERCO DFHMDF POS=(2,41),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE        00027   
*                                                                       00028   
        DFHMDF POS=(4,13),LENGTH=23,ATTRB=(ASKIP,BRT),                 C00029**2
               INITIAL='MBS REALIGNMENT .......'                        00030   
        DFHMDF POS=(4,41),LENGTH=24,ATTRB=(ASKIP,BRT),                 C00031   
               INITIAL='GMA  DMA  DPT   MCL  SCL'                       00032   
*                                                                       00033   
        DFHMDF POS=(5,35),LENGTH=04,ATTRB=(ASKIP,BRT),                 C00034   
               INITIAL='OLD:'                                           00035   
AOGMA   DFHMDF POS=(5,41),LENGTH=02,ATTRB=(UNPROT,NUM),                C00036   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00037   
        DFHMDF POS=(5,44),LENGTH=01,ATTRB=ASKIP                         00038   
AODMA   DFHMDF POS=(5,46),LENGTH=02,ATTRB=(UNPROT,NUM),                C00039   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00040   
        DFHMDF POS=(5,49),LENGTH=01,ATTRB=ASKIP                         00041   
AODEPT  DFHMDF POS=(5,51),LENGTH=03,ATTRB=(UNPROT,NUM),                C00042   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00043   
        DFHMDF POS=(5,55),LENGTH=01,ATTRB=ASKIP                         00044   
AOMCLAS DFHMDF POS=(5,57),LENGTH=02,ATTRB=(UNPROT,NUM),                C00045   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00046   
        DFHMDF POS=(5,60),LENGTH=01,ATTRB=ASKIP                         00047   
AOSCLAS DFHMDF POS=(5,62),LENGTH=03,ATTRB=(UNPROT,NUM),                C00048   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00049   
        DFHMDF POS=(5,66),LENGTH=01,ATTRB=ASKIP                         00050   
*                                                                       00051   
        DFHMDF POS=(6,35),LENGTH=04,ATTRB=(ASKIP,BRT),                 C00052   
               INITIAL='NEW:'                                           00053   
ANGMA   DFHMDF POS=(6,41),LENGTH=02,ATTRB=(UNPROT,NUM),                C00054   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00055   
        DFHMDF POS=(6,44),LENGTH=01,ATTRB=ASKIP                         00056   
ANDMA   DFHMDF POS=(6,46),LENGTH=02,ATTRB=(UNPROT,NUM),                C00057   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00058   
        DFHMDF POS=(6,49),LENGTH=01,ATTRB=ASKIP                         00059   
ANDEPT  DFHMDF POS=(6,51),LENGTH=03,ATTRB=(UNPROT,NUM),                C00060   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00061   
        DFHMDF POS=(6,55),LENGTH=01,ATTRB=ASKIP                         00062   
ANMCLAS DFHMDF POS=(6,57),LENGTH=02,ATTRB=(UNPROT,NUM),                C00063   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00064   
        DFHMDF POS=(6,60),LENGTH=01,ATTRB=ASKIP                         00065   
ANSCLAS DFHMDF POS=(6,62),LENGTH=03,ATTRB=(UNPROT,NUM),                C00066   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00067   
        DFHMDF POS=(6,66),LENGTH=01,ATTRB=ASKIP                         00068   
*                                                                       00069   
        DFHMDF POS=(7,24),LENGTH=15,ATTRB=(ASKIP,BRT),                 C00070   
               INITIAL='EFFECTIVE DATE:'                                00071   
AEDATMM DFHMDF POS=(7,41),LENGTH=02,ATTRB=(UNPROT,NUM),                C00072   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00073   
AEDATDD DFHMDF POS=(7,44),LENGTH=02,ATTRB=(UNPROT,NUM),                C00074   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00075   
AEDATYY DFHMDF POS=(7,47),LENGTH=02,ATTRB=(UNPROT,NUM),                C00076   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00077   
        DFHMDF POS=(7,50),LENGTH=01,ATTRB=ASKIP                         00078   
*                                                                       00079   
        DFHMDF POS=(8,22),LENGTH=17,ATTRB=(ASKIP,BRT),                 C00080   
               INITIAL='NEW BUYER NUMBER:'                              00081   
ANBUYER DFHMDF POS=(8,41),LENGTH=03,ATTRB=(UNPROT,NUM),                C00082   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00083   
        DFHMDF POS=(8,45),LENGTH=01,ATTRB=ASKIP                         00084   
*                                                                       00085*10
        DFHMDF POS=(11,08),LENGTH=28,ATTRB=(ASKIP,BRT),                C00086*10
               INITIAL='BUYER NUMBER CHANGE ........'                   00087*10
        DFHMDF POS=(12,28),LENGTH=11,ATTRB=(ASKIP,BRT),                C00088**2
               INITIAL='DEPARTMENT:'                                    00089   
ABYRDPT DFHMDF POS=(12,41),LENGTH=03,ATTRB=(UNPROT,NUM),               C00090**2
               HILIGHT=UNDERLINE,COLOR=GREEN                            00091   
        DFHMDF POS=(12,45),LENGTH=01,ATTRB=ASKIP                        00092**2
        DFHMDF POS=(13,22),LENGTH=17,ATTRB=(ASKIP,BRT),                C00093**2
               INITIAL='NEW BUYER NUMBER:'                              00094   
ABYRNBR DFHMDF POS=(13,41),LENGTH=03,ATTRB=(UNPROT,NUM),               C00095**2
               HILIGHT=UNDERLINE,COLOR=GREEN                            00096   
        DFHMDF POS=(13,45),LENGTH=01,ATTRB=ASKIP                        00097**2
        DFHMDF POS=(14,24),LENGTH=15,ATTRB=(ASKIP,BRT),                C00098*10
               INITIAL='EFFECTIVE DATE:'                                00099*10
ABYRMM  DFHMDF POS=(14,41),LENGTH=02,ATTRB=(UNPROT,NUM),               C00100*10
               HILIGHT=UNDERLINE,COLOR=GREEN                            00101*10
ABYRDD  DFHMDF POS=(14,44),LENGTH=02,ATTRB=(UNPROT,NUM),               C00102*10
               HILIGHT=UNDERLINE,COLOR=GREEN                            00103*10
ABYRYY  DFHMDF POS=(14,47),LENGTH=02,ATTRB=(UNPROT,NUM),               C00104*10
               HILIGHT=UNDERLINE,COLOR=GREEN                            00105*10
        DFHMDF POS=(14,50),LENGTH=01,ATTRB=ASKIP                        00106*10
*                                                                       00107   
        DFHMDF POS=(17,3),LENGTH=33,ATTRB=(ASKIP,BRT),                 C00108*10
               INITIAL='MERCHANDISE AREA DATE CHANGE.....'              00109**2
        DFHMDF POS=(17,41),LENGTH=24,ATTRB=(ASKIP,BRT),                C00110*10
               INITIAL='GMA  DMA  DPT   MCL  SCL'                       00111   
*                                                                       00112   
        DFHMDF POS=(18,22),LENGTH=17,ATTRB=(ASKIP,BRT),                C00113*10
               INITIAL='MERCHANDISE AREA:'                              00114   
ADCGMA  DFHMDF POS=(18,41),LENGTH=02,ATTRB=(ASKIP,NORM),               C00115*10
               COLOR=BLUE                                               00116**7
        DFHMDF POS=(18,44),LENGTH=01,ATTRB=ASKIP                        00117*10
ADCDMA  DFHMDF POS=(18,46),LENGTH=02,ATTRB=(ASKIP,NORM),               C00118*10
               COLOR=BLUE                                               00119**7
        DFHMDF POS=(18,49),LENGTH=01,ATTRB=ASKIP                        00120*10
ADCDPT  DFHMDF POS=(18,51),LENGTH=03,ATTRB=(ASKIP,NORM),               C00121*10
               COLOR=BLUE                                               00122**7
        DFHMDF POS=(18,55),LENGTH=01,ATTRB=ASKIP                        00123*10
ADCMCL  DFHMDF POS=(18,57),LENGTH=02,ATTRB=(ASKIP,NORM),               C00124*10
               COLOR=BLUE                                               00125**7
        DFHMDF POS=(18,60),LENGTH=01,ATTRB=ASKIP                        00126*10
ADCSCL  DFHMDF POS=(18,62),LENGTH=03,ATTRB=(ASKIP,NORM),               C00127*10
               COLOR=BLUE                                               00128**7
*                                                                       00129   
        DFHMDF POS=(19,17),LENGTH=22,ATTRB=(ASKIP,BRT),                C00130**2
               INITIAL='MERCH AREA START DATE:'                         00131   
ADCNSMM DFHMDF POS=(19,41),LENGTH=02,ATTRB=(UNPROT,NUM),               C00132**9
               HILIGHT=UNDERLINE,COLOR=GREEN                            00133   
ADCNSDD DFHMDF POS=(19,44),LENGTH=02,ATTRB=(UNPROT,NUM),               C00134**9
               HILIGHT=UNDERLINE,COLOR=GREEN                            00135   
ADCNSYY DFHMDF POS=(19,47),LENGTH=02,ATTRB=(UNPROT,NUM),               C00136**9
               HILIGHT=UNDERLINE,COLOR=GREEN                            00137   
        DFHMDF POS=(19,50),LENGTH=01,ATTRB=ASKIP                        00138**9
*                                                                       00139   
        DFHMDF POS=(20,19),LENGTH=20,ATTRB=(ASKIP,BRT),                C00140**2
               INITIAL='MERCH AREA END DATE:'                           00141   
ADCNEMM DFHMDF POS=(20,41),LENGTH=02,ATTRB=(UNPROT,NUM),               C00142**9
               HILIGHT=UNDERLINE,COLOR=GREEN                            00143   
ADCNEDD DFHMDF POS=(20,44),LENGTH=02,ATTRB=(UNPROT,NUM),               C00144**9
               HILIGHT=UNDERLINE,COLOR=GREEN                            00145   
ADCNEYY DFHMDF POS=(20,47),LENGTH=02,ATTRB=(UNPROT,NUM),               C00146**9
               HILIGHT=UNDERLINE,COLOR=GREEN                            00147   
        DFHMDF POS=(20,50),LENGTH=01,ATTRB=ASKIP                        00148**9
*                                                                       00149   
AMSG    DFHMDF POS=(21,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=RED          00150   
        DFHMDF POS=(22,1),LENGTH=11,INITIAL='COMMAND==>',              C00151   
               ATTRB=(PROT,BRT)                                         00152   
ANAVCMD DFHMDF POS=(22,13),LENGTH=8,ATTRB=(UNPROT),                    C00153   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00154   
        DFHMDF POS=(22,22),LENGTH=1,ATTRB=(ASKIP)                       00155   
        DFHMDF POS=(22,24),LENGTH=7,INITIAL='KEY===>',ATTRB=(PROT,BRT)  00156   
ANAVKEY DFHMDF POS=(22,32),LENGTH=25,ATTRB=(UNPROT),                   C00157   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00158   
        DFHMDF POS=(22,58),LENGTH=1,ATTRB=(ASKIP)                       00159   
        DFHMDF POS=(22,63),LENGTH=16,INITIAL='PA2=OTHER FKEYS',        C00160   
               ATTRB=(PROT,BRT)                                         00161   
*                                                                       00162   
AFKLIN1 DFHMDF POS=(23,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00163   
AFKLIN2 DFHMDF POS=(24,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00164   
        DFHMSD TYPE=FINAL                                               00165   
        END                                                             00166   
