*          DATA SET MBKM126    AT LEVEL 011 AS OF 01/30/92                      
*********************************************************************** 00001**1
*       MAPSET  MBKM126                                                 00002**1
*       MAP     MB126A                                                  00003**1
*       PROGRAM MBKCS126 - APPLICATION SYSTEM ADD/DELETE/UPDATE         00004**1
*       TRANSID R126                                                    00005**1
*       SYSTEM  CICS ARCHITECTURE                                       00006**1
*********************************************************************** 00007**1
        PRINT  NOGEN                                                    00008**1
MBKM126 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES,             C00009**1
               CTRL=(FREEKB)                                            00010**1
MB126A  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),                   C00011**1
               DSATTS=(COLOR,HILIGHT)                                   00012**1
ADATE   DFHMDF POS=(01,02),LENGTH=10,ATTRB=(ASKIP,BRT),                C00013*11
               COLOR=NEUTRAL                                            00014**1
ATIME   DFHMDF POS=(01,14),LENGTH=08,ATTRB=(ASKIP,BRT),                C00015*11
               COLOR=NEUTRAL                                            00016**1
ATITLE  DFHMDF POS=(01,25),LENGTH=30,ATTRB=(ASKIP,BRT),                C00017**1
               COLOR=NEUTRAL                                            00018**1
ATERMID DFHMDF POS=(01,66),LENGTH=04,ATTRB=(ASKIP,BRT),                C00019*11
               COLOR=NEUTRAL                                            00020**1
APGMID  DFHMDF POS=(01,72),LENGTH=08,ATTRB=(ASKIP,BRT),                C00021*11
               COLOR=NEUTRAL                                            00022**1
*                                                                       00023**1
        DFHMDF POS=(2,31),LENGTH=8,ATTRB=(ASKIP,BRT),                  C00024**1
               INITIAL='COMPANY:'                                       00025**1
AOPERCO DFHMDF POS=(2,41),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE        00026*11
*                                                                       00027**1
        DFHMDF POS=(4,20),LENGTH=19,ATTRB=(ASKIP,BRT),                 C00028**1
               INITIAL='APPLICATION SYSTEM:'                            00029**1
AAPLSYS DFHMDF POS=(4,41),LENGTH=2,ATTRB=(ASKIP,NORM),COLOR=BLUE        00030*11
        DFHMDF POS=(4,44),LENGTH=1,ATTRB=(ASKIP)                        00031**1
        DFHMDF POS=(5,27),LENGTH=12,ATTRB=(ASKIP,BRT),                 C00032**1
               INITIAL='DESCRIPTION:'                                   00033**1
AAPLDES DFHMDF POS=(5,41),LENGTH=25,ATTRB=(UNPROT,NORM),               C00034**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00035**1
        DFHMDF POS=(5,67),LENGTH=1,ATTRB=(ASKIP)                        00036**1
        DFHMDF POS=(6,17),LENGTH=22,ATTRB=(ASKIP,BRT),                 C00037**1
               INITIAL='MERCHANDISE INDICATOR:'                         00038**1
AMDSIND DFHMDF POS=(6,41),LENGTH=01,ATTRB=(UNPROT,NORM),               C00039**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00040**1
        DFHMDF POS=(6,43),LENGTH=1,ATTRB=(ASKIP)                        00041**1
*                                                                       00042**1
        DFHMDF POS=(8,25),LENGTH=14,ATTRB=(ASKIP,BRT),                 C00043**1
               INITIAL='PARENT SYSTEM:'                                 00044**1
AAPLPRT DFHMDF POS=(8,41),LENGTH=2,ATTRB=(UNPROT,NORM),                C00045**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00046**3
        DFHMDF POS=(8,44),LENGTH=1,ATTRB=(ASKIP)                        00047**1
        DFHMDF POS=(9,27),LENGTH=12,ATTRB=(ASKIP,BRT),                 C00048**1
               INITIAL='DESCRIPTION:'                                   00049**1
APRTDES DFHMDF POS=(9,41),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE       00050*11
*                                                                       00051**5
ALIKEHD DFHMDF POS=(11,15),LENGTH=24,ATTRB=(ASKIP,BRT),                C00052**9
               INITIAL='LIKE APPLICATION SYSTEM:'                       00053**5
ALIKESY DFHMDF POS=(11,41),LENGTH=2,ATTRB=(UNPROT,NORM),               C00054**5
               HILIGHT=UNDERLINE,COLOR=GREEN                            00055**5
ALIKEDE DFHMDF POS=(11,44),LENGTH=25,ATTRB=(ASKIP,NORM),COLOR=BLUE      00056*11
*                                                                       00057**5
ASTRTHD DFHMDF POS=(12,18),LENGTH=21,ATTRB=(ASKIP,BRT),                C00058**9
               INITIAL='EFFECTIVE START DATE:'                          00059**5
ASTRTMM DFHMDF POS=(12,41),LENGTH=2,ATTRB=(UNPROT,NORM,NUM),           C00060*10
               HILIGHT=UNDERLINE,COLOR=GREEN                            00061**5
ASTRTDD DFHMDF POS=(12,44),LENGTH=2,ATTRB=(UNPROT,NORM,NUM),           C00062*10
               HILIGHT=UNDERLINE,COLOR=GREEN                            00063**5
ASTRTYY DFHMDF POS=(12,47),LENGTH=2,ATTRB=(UNPROT,NORM,NUM),           C00064*10
               HILIGHT=UNDERLINE,COLOR=GREEN                            00065**5
        DFHMDF POS=(12,50),LENGTH=1,ATTRB=(ASKIP)                       00066**8
*                                                                       00067**5
AMSG    DFHMDF POS=(21,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=RED          00068**1
        DFHMDF POS=(22,1),LENGTH=11,INITIAL='COMMAND==>',              C00069**1
               ATTRB=(PROT,BRT)                                         00070**1
ANAVCMD DFHMDF POS=(22,13),LENGTH=8,ATTRB=(UNPROT),                    C00071**1
               HILIGHT=UNDERLINE,COLOR=GREEN                            00072**1
        DFHMDF POS=(22,22),LENGTH=1,ATTRB=(ASKIP)                       00073**1
        DFHMDF POS=(22,24),LENGTH=7,INITIAL='KEY===>',ATTRB=(PROT,BRT)  00074**1
ANAVKEY DFHMDF POS=(22,32),LENGTH=25,ATTRB=(UNPROT),                   C00075**1
               HILIGHT=UNDERLINE,COLOR=GREEN                            00076**1
        DFHMDF POS=(22,58),LENGTH=1,ATTRB=(ASKIP)                       00077**1
        DFHMDF POS=(22,63),LENGTH=16,INITIAL='PA2=OTHER FKEYS',        C00078**1
               ATTRB=(PROT,BRT)                                         00079**1
*                                                                       00080**5
AFKLIN1 DFHMDF POS=(23,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00081**1
AFKLIN2 DFHMDF POS=(24,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00082**1
        DFHMSD TYPE=FINAL                                               00083**1
        END                                                             00084**1
