00001 ***************************************************************** 03/02/92
00002 *                                                               * MBWS018 
00003 *    THIS COPY BOOK IS USED IN THE MERCHANDISE BUSINESS         *    LV003
00004 *    STRUCTURE SYSTEM TO WRITE (FROM CICS) BATCH CONTROL        * MBWS018 
00005 *    RECORDS.  THEY ARE SUBSEQUENTLY READ AT NIGHT IN A         * MBWS018 
00006 *    BATCH PROGRAM WHICH UPDATES THE MBS DATABASE.              * MBWS018 
00007 *                                                               * MBWS018 
00008 *    RECORD LENGTH = 100, KEY LENGTH = 30, VSAM.                * MBWS018 
00009 *                                                               * MBWS018 
00010 ***************************************************************** MBWS018 
00011                                                                      CL**2
00012  01  MB018-BATCH-CNTL-RECORD.                                     MBWS018 
00013      05  MB018-BCR-KEY                   PIC X(30)   VALUE SPACE. MBWS018 
00014      05  MB018-BCR-DETAIL.                                           CL**2
00015          10  FILLER                      PIC X(62)   VALUE SPACE.    CL**2
00016          10  MB018-USERID                PIC X(8)    VALUE SPACE.    CL**2
00017                                                                   MBWS018 
00018  01  MB018-BATCH-CNTL-RECORD-005         REDEFINES                MBWS018 
00019      MB018-BATCH-CNTL-RECORD.                                     MBWS018 
00020      05  MB018-BCR-KEY-005.                                       MBWS018 
00021          10  MB018-RECORD-ID-005         PIC X(8).                MBWS018 
00022              88  MB018-CREAT-NEW-APPL-SYS-AVAIL      VALUE        MBWS018 
00023                                                      'MBKUT005'.  MBWS018 
00024          10  MB018-OPERATING-CO-005      PIC X(2).                MBWS018 
00025          10  MB018-NEW-APPL-SYS-CODE-005 PIC X(2).                MBWS018 
00026          10  FILLER                      PIC X(18).               MBWS018 
00027      05  MB018-BCR-DETAIL-005.                                    MBWS018 
00028          10  MB018-LIKE-APPL-SYS-CODE-005                         MBWS018 
00029                                          PIC X(2).                MBWS018 
00030          10  MB018-EFFECTIVE-START-DATE-005                       MBWS018 
00031                                          PIC X(10).               MBWS018 
00032          10  FILLER                      PIC X(58).               MBWS018 
00033                                                                      CL**2
00034  01  MB018-BATCH-CNTL-RECORD-006         REDEFINES                MBWS018 
00035      MB018-BATCH-CNTL-RECORD.                                     MBWS018 
00036      05  MB018-BCR-KEY-006.                                       MBWS018 
00037          10  MB018-RECORD-ID-006         PIC X(8).                MBWS018 
00038              88  MB018-ASSIGN-BUYER-NUMBER           VALUE        MBWS018 
00039                                                      'MBKUT006'.  MBWS018 
00040          10  MB018-OPERATING-CO-006      PIC X(2).                MBWS018 
00041          10  MB018-DEPARTMENT-NUMBER-006 PIC X(3).                MBWS018 
00042          10  FILLER                      PIC X(17).               MBWS018 
00043      05  MB018-BCR-DETAIL-006.                                    MBWS018 
00044          10  MB018-NEW-BUYER-NUMBER-006  PIC X(3).                MBWS018 
00045          10  MB018-NEW-BUYER-DATE-006    PIC X(10).                  CL**3
00046          10  FILLER                      PIC X(57).                  CL**3
00047                                                                      CL**2
00048  01  MB018-BATCH-CNTL-RECORD-007         REDEFINES                MBWS018 
00049      MB018-BATCH-CNTL-RECORD.                                     MBWS018 
00050      05  MB018-BCR-KEY-007.                                       MBWS018 
00051          10  MB018-RECORD-ID-007         PIC X(8).                MBWS018 
00052              88  MB018-MBS-REALIGNMENT               VALUE        MBWS018 
00053                                                      'MBKUT007'.  MBWS018 
00054          10  MB018-OPERATING-CO-007      PIC X(2).                MBWS018 
00055          10  MB018-OLD-MERCH-AREA-007.                            MBWS018 
00056              15  MB018-OLD-GMA-007       PIC X(2).                MBWS018 
00057              15  MB018-OLD-DMA-007       PIC X(2).                MBWS018 
00058              15  MB018-OLD-DEPT-007      PIC X(3).                MBWS018 
00059              15  MB018-OLD-MAJ-CL-007    PIC X(2).                MBWS018 
00060              15  MB018-OLD-SUB-CL-007    PIC X(3).                MBWS018 
00061          10  FILLER                      PIC X(8).                MBWS018 
00062      05  MB018-BCR-DETAIL-007.                                    MBWS018 
00063          10  MB018-NEW-MERCH-AREA-007.                            MBWS018 
00064              15  MB018-NEW-GMA-007       PIC X(2).                MBWS018 
00065              15  MB018-NEW-DMA-007       PIC X(2).                MBWS018 
00066              15  MB018-NEW-DEPT-007      PIC X(3).                MBWS018 
00067              15  MB018-NEW-MAJ-CL-007    PIC X(2).                MBWS018 
00068              15  MB018-NEW-SUB-CL-007    PIC X(3).                MBWS018 
00069          10  MB018-NEW-START-DATE-007    PIC X(10).               MBWS018 
00070          10  MB018-NEW-BUYER-NUMBER-007  PIC X(3).                MBWS018 
00071          10  FILLER                      PIC X(32).               MBWS018 
00072                                                                      CL**2
00073  01  MB018-BATCH-CNTL-RECORD-008         REDEFINES                MBWS018 
00074      MB018-BATCH-CNTL-RECORD.                                     MBWS018 
00075      05  MB018-BCR-KEY-008.                                       MBWS018 
00076          10  MB018-RECORD-ID-008         PIC X(8).                MBWS018 
00077              88  MB018-MBS-DATE-CHANGE               VALUE        MBWS018 
00078                                                      'MBKUT008'.  MBWS018 
00079          10  MB018-OPERATING-CO-008      PIC X(2).                MBWS018 
00080          10  MB018-MERCH-AREA-008.                                MBWS018 
00081              15  MB018-GMA-008           PIC X(2).                MBWS018 
00082              15  MB018-DMA-008           PIC X(2).                MBWS018 
00083              15  MB018-DEPT-008          PIC X(3).                MBWS018 
00084              15  MB018-MAJ-CL-008        PIC X(2).                MBWS018 
00085              15  MB018-SUB-CL-008        PIC X(3).                MBWS018 
00086          10  FILLER                      PIC X(8).                MBWS018 
00087      05  MB018-BCR-DETAIL-008.                                    MBWS018 
00088          10  MB018-NEW-START-DATE-008    PIC X(10).               MBWS018 
00089          10  MB018-NEW-END-DATE-008      PIC X(10).               MBWS018 
00090          10  FILLER                      PIC X(50).               MBWS018 
