00001 ******************************************************************10/30/91
00002 *                         MBWS012                                *MBWS012 
00003 *                                                                *   LV049
00004 *   THIS IS THE APPLICATION SPECIFIC COMMUNICATION AREA FOR      *MBWS012 
00005 *   PROGRAM MBKCS112.                                            *   CL*41
00006 *                                                                *MBWS012 
00007 *   LENGTH:  2865 BYTES                                          *MBWS012 
00008 ******************************************************************MBWS012 
00009          10  MB012-SPECIFIC-COMMAREA.                                CL*36
00010              15  FILLER                               PIC X(02).     CL*18
00011              15  MB012-CO-NUMBER                      PIC X(02).     CL*36
00012              15  MB012-REQUEST-DATA.                                 CL*42
00013                  20  MB012-GMA-NUMBER                 PIC X(02).     CL*42
00014                      88  MB012-ALL-GMAS               VALUE '* ',    CL*42
00015                                                             '**',    CL*18
00016                                                             ' *'.    CL*18
00017                  20  MB012-DMA-NUMBER                 PIC X(02).     CL*42
00018                      88  MB012-ALL-DMAS               VALUE '* ',    CL*42
00019                                                             '**',    CL*18
00020                                                             ' *'.    CL*18
00021                  20  MB012-DEPT-NUMBER                PIC X(03).     CL*42
00022                      88  MB012-ALL-DEPARTMENTS        VALUE '*  ',   CL*42
00023                                                             '** ',   CL*18
00024                                                             '***',   CL*18
00025                                                             ' **',   CL*18
00026                                                             '  *'.   CL*18
00027                  20  MB012-HISTORY-FLAG               PIC X(01).     CL*44
00028              15  MB012-BLOCK-ARRAY.                                  CL*36
00029                  20  MB012-BLOCK-ENTRIES OCCURS 2 TIMES.             CL*36
00030                      25  MB012-BLOCK-MODIFIED-SW      PIC X(01).     CL*36
00031                          88  MB012-BLOCK-MODIFIED     VALUE 'Y'.     CL*36
00032                          88  MB012-BLOCK-NOT-MODIFIED VALUE 'N'.     CL*36
00033                      25  MB012-ITEM-ARRAY.                           CL*36
00034                          30  MB012-ITEM-ENTRIES OCCURS 18 TIMES.     CL*36
00035                              35  MB012-LIST-ITEM-NUMBER              CL*36
00036                                                       PIC S9(09)     CL*18
00037                                                           COMP-3.    CL*18
00038                              35  MB012-SELECTED-SW    PIC X(01).     CL*36
00039                                  88  MB012-NO-SELECT  VALUE ' '.     CL*36
00040                                  88  MB012-SELECT     VALUE 'S'.     CL*36
00041                                  88  MB012-BEGIN      VALUE 'B'.     CL*36
00042                                  88  MB012-END        VALUE 'E'.     CL*36
00043                            33    MB012-KEY-DATA.                     CL*49
00044                              35  MB012-ITEM-GMA       PIC X(02).     CL*49
00045                              35  MB012-ITEM-DMA       PIC X(02).     CL*36
00046                              35  MB012-ITEM-DEPT      PIC X(03).     CL*36
00047                            33    MB012-KEY-DATA-END.                 CL*49
00048                              35  MB012-ITEM-DESC      PIC X(25).     CL*36
00049                              35  MB012-ITEM-ACTION    PIC X(07).     CL*36
00050                              35  MB012-COLOR          PIC X(01).     CL*48
00051                                                                      CL*20
00052              15  MB012-BLOCK-SUB                      PIC S9(04)     CL*36
00053                                                           COMP       CL*18
00054                                                           SYNC.      CL*18
00055              15  MB012-ITEM-SUB                       PIC S9(04)     CL*36
00056                                                           COMP       CL*18
00057                                                           SYNC.      CL*18
00058              15  MB012-NUMBER-OF-ITEMS-READ           PIC S9(09)     CL*36
00059                                                           COMP-3.    CL*18
00060              15  MB012-NUMBER-OF-ITEMS-SELECTED       PIC S9(09)     CL*36
00061                                                           COMP-3.    CL*18
00062              15  MB012-ITEM-AT-TOP-OF-PANEL           PIC S9(09)     CL*36
00063                                                           COMP-3.    CL*18
00064              15  MB012-HIGHEST-BLOCK-WRITTEN          PIC S9(04)     CL*36
00065                                                           COMP       CL*18
00066                                                           SYNC.      CL*18
00067              15  MB012-START-OF-SELECTED-RANGE        PIC S9(09)     CL*36
00068                                                           COMP-3.    CL*18
00069              15  MB012-END-OF-SELECTED-RANGE          PIC S9(09)     CL*36
00070                                                           COMP-3.    CL*18
00071              15  MB012-DB2-CURRENT-DATE               PIC X(10).     CL*49
00072              15  MB012-ITEMS-LEFT-ON-DB-SW            PIC X(01).     CL*49
00073                  88  MB012-ITEMS-LEFT-ON-DB           VALUE 'Y'.     CL*36
00074                  88  MB012-NO-ITEMS-LEFT-ON-DB        VALUE 'N'.     CL*36
00075              15  MB012-TSQUEUE-UPDATE-SW              PIC X(01).     CL*49
00076                  88  WE-MUST-UPDATE-TSQ               VALUE 'Y'.     CL*49
00077                  88  NO-UPDATE-TO-TSQ                 VALUE 'N'.     CL*49
00078              15  MB012-LIST-QUEUE-NAME                PIC X(8).      CL*48
00079              15  MB012-TEMP-QUEUE-NAME.                              CL*48
00080                  20  MB012-TERM-ID                    PIC X(04).     CL*36
00081                  20  MB012-TASK-NUMBER                PIC S9(07)     CL*36
00082                                                           COMP-3.    CL*18
00083              15  MB012-SAVE-LEVEL-CODE.                              CL*36
00084                  20  MB012-SAVE-GMA                   PIC X(03).     CL*36
00085                  20  MB012-SAVE-DMA                   PIC X(03).     CL*36
00086                  20  MB012-SAVE-DPT                   PIC X(03).     CL*36
00087                  20  MB012-SAVE-MCL                   PIC X(03).     CL*36
00088                  20  MB012-SAVE-SCL                   PIC X(03).     CL*36
00089              15  MB012-SAVE-KEY.                                     CL*36
00090                  20  MB012-SAVE-SEQ-NBR               PIC S9(15)     CL*43
00091                                                       COMP-3.        CL*43
00092                  20  MB012-SAVE-CUR-DATE              PIC X(10).     CL*39
00093                  20  MB012-SAVE-GMA-NBR               PIC X(02).     CL*39
00094                  20  MB012-SAVE-DMA-NBR               PIC X(02).     CL*36
00095                  20  MB012-SAVE-DPT-NBR               PIC X(03).     CL*36
00096                                                                      CL*29
00097              15  MB012-OPEN-CURSOR-SW                 PIC X(01).     CL*36
00098                  88  MB012-NO-CURSOR-OPEN             VALUE '0'.     CL*36
00099                  88  MB012-OPEN-MERCH-CURSOR          VALUE '1'.     CL*36
00100                  88  MB012-OPEN-GMA-CURSOR            VALUE '2'.     CL*36
00101                  88  MB012-OPEN-DMA-CURSOR            VALUE '3'.     CL*36
00102                  88  MB012-OPEN-DPT-CURSOR            VALUE '4'.     CL*36
00103                                                                      CL*29
00104              15  FILLER                             PIC X(1093).     CL*49
