00001 ******************************************************************10/03/91
00002 *                         MBWS001                                *MBWS001 
00003 *                                                                *   LV021
00004 *   THIS IS THE APPLICATION SPECIFIC COMMUNICATION AREA FOR      *MBWS001 
00005 *   PROGRAM MBKCS101.                                            *   CL*14
00006 *                                                                *MBWS001 
00007 *   LENGTH:  2865 BYTES                                          *MBWS001 
00008 ******************************************************************MBWS001 
00009          10  MB001-SPECIFIC-COMMAREA.                                CL**8
00010              15  FILLER                      PIC X(02).              CL**5
00011              15  MB001-CO-NUMBER-X           PIC X(02).              CL**8
00012              15  MB001-GMA-NUMBER-X          PIC X(02).              CL**8
00013                  88  MB001-ALL-GMAS          VALUE '* ',             CL**8
00014                                                    '**',             CL**8
00015                                                    ' *'.             CL**8
00016              15  FILLER REDEFINES MB001-GMA-NUMBER-X.                CL**8
00017                  20  MB001-GMA-NUMBER        PIC 9(02).              CL**8
00018                      88  MB001-GMA-NUMERIC   VALUE 01 THRU 99.       CL**8
00019              15  MB001-DMA-NUMBER-X          PIC X(02).              CL**8
00020                  88  MB001-ALL-DMAS          VALUE '* ',             CL**8
00021                                                    '**',             CL**8
00022                                                    ' *'.             CL**8
00023              15  FILLER REDEFINES MB001-DMA-NUMBER-X.                CL**8
00024                  20  MB001-DMA-NUMBER        PIC 9(02).              CL**8
00025                      88  MB001-DMA-NUMERIC   VALUE 01 THRU 99.       CL**8
00026              15  MB001-DEPT-NUMBER-X         PIC X(03).              CL**8
00027                  88  MB001-ALL-DEPARTMENTS   VALUE '*  ',            CL**8
00028                                                    '** ',            CL*13
00029                                                    '***',            CL*13
00030                                                    ' **',            CL*13
00031                                                    '  *'.            CL*13
00032              15  FILLER REDEFINES MB001-DEPT-NUMBER-X.               CL**8
00033                  20  MB001-DEPT-NUMBER       PIC 9(03).              CL**8
00034                      88  MB001-DEPT-NUMERIC  VALUE 001 THRU 999.     CL**8
00035              15  MB001-MCLASS-NUMBER-X       PIC X(02).              CL**8
00036                  88  MB001-ALL-MCLASSES      VALUE '* ',             CL**8
00037                                                    '**',             CL**6
00038                                                    ' *'.             CL**6
00039              15  FILLER REDEFINES MB001-MCLASS-NUMBER-X.             CL**8
00040                  20  MB001-MCLASS-NUMBER     PIC 9(02).              CL*10
00041                      88  MB001-MCL-NUMERIC   VALUE 01 THRU 99.       CL**8
00042              15  MB001-SCLASS-NUMBER-X       PIC X(03).              CL**8
00043                  88  MB001-ALL-SCLASSES      VALUE '*  ',            CL**8
00044                                                    '** ',            CL*13
00045                                                    '***',            CL*13
00046                                                    ' **',            CL*13
00047                                                    '  *'.            CL**8
00048              15  FILLER REDEFINES MB001-SCLASS-NUMBER-X.             CL**8
00049                  20  MB001-SCLASS-NUMBER-R   PIC 9(03).              CL*11
00050                      88  MB001-SCL-NUMERIC   VALUE 001 THRU 999.     CL**8
00051              15  MB001-GMA-EDIT-IND          PIC X(01).              CL*18
00052                  88  MB001-GMA-NEED-EDIT     VALUE 'Y'.              CL*18
00053                  88  MB001-GMA-PASS-EDIT     VALUE 'N'.              CL*18
00054              15  MB001-DMA-EDIT-IND          PIC X(01).              CL*18
00055                  88  MB001-DMA-NEED-EDIT     VALUE 'Y'.              CL*18
00056                  88  MB001-DMA-PASS-EDIT     VALUE 'N'.              CL*18
00057              15  MB001-DPT-EDIT-IND          PIC X(01).              CL*18
00058                  88  MB001-DPT-NEED-EDIT     VALUE 'Y'.              CL*18
00059                  88  MB001-DPT-PASS-EDIT     VALUE 'N'.              CL*18
00060              15  MB001-MCL-EDIT-IND          PIC X(01).              CL*18
00061                  88  MB001-MCL-NEED-EDIT     VALUE 'Y'.              CL*18
00062                  88  MB001-MCL-PASS-EDIT     VALUE 'N'.              CL*18
00063              15  MB001-SCL-EDIT-IND          PIC X(01).              CL*18
00064                  88  MB001-SCL-NEED-EDIT     VALUE 'Y'.              CL*18
00065                  88  MB001-SCL-PASS-EDIT     VALUE 'N'.              CL*18
00066              15  MB001-HIST-FLAG             PIC X(01).              CL*19
00067                  88  MB001-DISPLAY-HIST      VALUE 'Y'.              CL*19
00068                  88  MB001-NO-DISPLAY-HIST   VALUE 'N'.              CL*19
00069                  88  MB001-HIST-SPACE        VALUE ' '.              CL*19
00070                  88  MB001-HIST-VALID-VALUES VALUE 'Y',              CL*19
00071                                                    'N'.              CL*21
00072              15  FILLER                      PIC X(2843).            CL*19
