00001 ******************************************************************07/22/92
00002 *                         MBWS005                                *MBWS005 
00003 *                                                                *   LV002
00004 *   THIS IS THE INTER APPLICATION COMMAREA FOR: MBKCS101         *MBWS005 
00005 *                                      THROUGH  MBKCS134.        *MBWS005 
00006 *                                                                *MBWS005 
00007 *   LENGTH:  200  BYTES                                          *MBWS005 
00008 ******************************************************************MBWS005 
00009          10  MB005-INTER-APPL-COMMAREA REDEFINES                  MBWS005 
00010              INTER-APPL-COMM-AREA.                                MBWS005 
00011              15  FILLER                         PIC X(01).        MBWS005 
00012              15  MB005-INTER-APPL-FORMAT-CODE   PIC X(04).        MBWS005 
00013              15  MB005-INTER-APPL-ACKNLG-CODE   PIC X(04).        MBWS005 
00014              15  MB005-CO-NUMBER                PIC X(02).        MBWS005 
00015              15  MB005-REQUEST-DATA.                              MBWS005 
00016                  20  MB005-GMA-NUMBER           PIC X(02).        MBWS005 
00017                  20  MB005-DMA-NUMBER           PIC X(02).        MBWS005 
00018                  20  MB005-DEPT-NUMBER          PIC X(03).        MBWS005 
00019                  20  MB005-MCLASS-NUMBER        PIC X(02).        MBWS005 
00020                  20  MB005-SCLASS-NUMBER        PIC X(03).        MBWS005 
00021                  20  MB005-MDSEAR-LEVEL         PIC X(03).        MBWS005 
00022                  20  MB005-APPL-SYS-CODE        PIC X(02).        MBWS005 
00023                  20  MB005-USERID               PIC X(08).        MBWS005 
00024                  20  MB005-HISTORY-INDICATOR.                     MBWS005 
00025                      25  MB005-HISTORY-FLAG     PIC X(01).        MBWS005 
00026                          88  MB005-INCLUDE-HISTORY      VALUE 'Y'.MBWS005 
00027                          88  MB005-DONT-INCLUDE-HISTORY VALUE 'N'.MBWS005 
00028              15  MB005-NUMBER-OF-SELECTED-ITEMS PIC S9(09)        MBWS005 
00029                                                     COMP-3.       MBWS005 
00030              15  MB005-NUMBER-PROCESSED-ITEMS   PIC S9(09)        MBWS005 
00031                                                     COMP-3.       MBWS005 
00032              15  MB005-LIST-QUEUE-NAME          PIC X(8).         MBWS005 
00033              15  MB005-LIST-QUEUE-LENGTH        PIC S9(4)         MBWS005 
00034                                                     COMP.         MBWS005 
00035              15  MB005-RECORD-UPDATED-SW        PIC X(1).         MBWS005 
00036                  88 MB005-RECORD-UPDATED        VALUE 'Y'.        MBWS005 
00037                  88 MB005-RECORD-NOT-UPDATED    VALUE 'N'.        MBWS005 
00038              15  MB005-DATE-UPDATE-SW           PIC X(1).         MBWS005 
00039                  88 MB005-DATE-UPDATE           VALUE 'Y'.        MBWS005 
00040                  88 MB005-NO-DATE-UPDATE        VALUE 'N'.        MBWS005 
00041              15  FILLER                         PIC X(141).          CL**2
