00001 ******************************************************************11/12/91
00002 *                         MBWS003                                *MBWS003 
00003 *                                                                *   LV043
00004 *   THIS IS TS QUEUE RECORD LAYOUT USED IN MBKCS102 AND PASSED   *   CL*38
00005 *   TO MBKCS103 (MERCH AREA INQUIRY), MBKCS105 (MERCH AREA       *   CL*38
00006 *   UPDATE), MBKCS132 (MERCH RESPBL INQUIRY), OR MBKCS131 (MERCH)*   CL*38
00007 *   RESPBL UPDATE).                                              *   CL*38
00008 *                                                                *   CL*38
00009 *   NOTE!  THERE IS NO 01 LEVEL DEFINED HERE.                    *   CL*38
00010 *                                                                *   CL*38
00011 ******************************************************************MBWS003 
00012        05  MB003-SELECTED-ITEMS            PIC 999    VALUE ZERO.    CL*43
00013        05  MB003-MAX-ITEMS                 PIC 999    VALUE 100.     CL*43
00014        05  MB003-ACTION                    PIC X.                    CL*43
00015            88  MB003-INQUIRY                          VALUE 'I'.     CL*43
00016            88  MB003-UPDATE                           VALUE 'U'.     CL*43
00017        05  MB003-SELECTED-ITEM-ARRAY       OCCURS 100 TIMES          CL*43
00018                                            INDEXED BY MB003-IDX.     CL*43
00019            10  MB003-ITEM                             PIC S9(09)     CL*43
00020                                                       COMP-3.        CL*42
00021            10  MB003-KEY-DATA.                                       CL*43
00022                15  MB003-GMA-NUMBER                   PIC X(02).     CL*43
00023                15  MB003-DMA-NUMBER                   PIC X(02).     CL*43
00024                15  MB003-DEPT-NUMBER                  PIC X(03).     CL*43
00025                15  MB003-MCLASS-NUMBER                PIC X(02).     CL*43
00026                15  MB003-SCLASS-NUMBER                PIC X(03).     CL*43
00027                15  MB003-MDSELV-NUMBER                PIC X(03).     CL*43
