000100******************************************************************06/23/95
000200*                         MBWS104                                *MBWS104 
000300*                                                                *   LV003
000400*   THIS IS THE TEMPORARY STORAGE QUEUE USED IN PROGRAMS:        *MBWS104 
000500*   MBKCS104 MDSEAR MAINT                                        *MBWS104 
000800*   MBKCS106 RESPBL AREA                                         *MBWS104 
000700*   MBKCS110 SUB CLASS MAINT                                     *MBWS104 
000600*   MBKCS114 DEPT MAINT                                          *MBWS104 
000900*                                                                *MBWS104 
001000*   LENGTH:  275  BYTES                                          *MBWS104 
001100*                                                                *MBWS104 
001200*   MODIFIED 4/93 BY M. FURLICK: EXPAND TO 250 BYTES (AND ADD    *MBWS104 
001300*                                SOME FILLER FOR NEXT TIME!!)    *MBWS104 
001400*                                                                *MBWS104 
001500*   MODIFIED 6/93 BY M. FURLICK: USED SOME OF THAT FILLER.       *MBWS104 
001600*                                                                *MBWS104 
001700*   MODIFIED 6/94 BY A. REILAND: REMOVED THE GROUP PRICE         *MBWS104 
001800*                                OWNERSHIP ID.                   *MBWS104 
001900*                                                                *MBWS104 
002000*   MODIFIED 6/95 BY D. HOPPA:   ADDED SHRINK FISCAL PERIOD      *MBWS104 
001900*                                                                *MBWS104 
002000*   MODIFIED 11/98 BY D.METZGER: REMOVED 1 BYTE OF FILLER AND    *MBWS104 
002000*                                MB104-SHRINK-YR-IND.  RENAMED   *MBWS104 
002000*                                MB104-SHRINK-FISCAL-NBR TO      *MBWS104 
002000*                                MB104-CAL-MN-NBR.  ADDED        *MBWS104 
002000*                                MB104-SHNK-FSCL-YR-NBR AND 25   *MBWS104 
002000*                                BYTES OF FILLER EXPANDING THE   *MBWS104 
002000*                                COPYBOOK TO 275 BYTES.          *MBWS104 
001900*                                                                *MBWS104 
C14666*   MODIFIED 07/10 BY R.GUNTHA : 1) CHANGED VARIABLE NAME FROM   *MBWS104 
C14666*                                MB104-SHRINK-PERCENTNT TO       *MBWS104 
C14666*                                MB104-BM-SHRINK-PERCENT.        *MBWS104 
C14666*                                2) ADDED NEW VARIABLE           *MBWS104 
C14666*                                MB104-ECOM-SHRINK-PERCENT FOR   *MBWS104 
C14666*                                ECOM SHRINK PERCENT             *MBWS104 
C14666*                                3) CHANGED PRECESION OF SHRINK  *MBWS104 
C14666*                                PERCENT FROM SV999 TO SV9999    *MBWS104 
002100******************************************************************MBWS104 
002200 01  MB104-MDSEAR-ADD-TSQUEUE.                                    MBWS104 
002300     05  MB104-CO-NUMBER               PIC X(02).                 MBWS104 
002400     05  MB104-GMA-NUMBER              PIC X(02).                 MBWS104 
002500     05  MB104-GMA-DESCRIP             PIC X(25).                 MBWS104 
002600     05  MB104-DMA-NUMBER              PIC X(02).                 MBWS104 
002700     05  MB104-DMA-DESCRIP             PIC X(25).                 MBWS104 
002800     05  MB104-DEPT-NUMBER             PIC X(03).                 MBWS104 
002900     05  MB104-DEPT-DESCRIP            PIC X(25).                 MBWS104 
003000     05  MB104-MCLASS-NUMBER           PIC X(02).                 MBWS104 
003100     05  MB104-MCLASS-DESCRIP          PIC X(25).                 MBWS104 
003200     05  MB104-SCLASS-NUMBER           PIC X(03).                 MBWS104 
003300     05  MB104-SCLASS-DESCRIP          PIC X(25).                 MBWS104 
003400     05  MB104-MDSE-LEVEL              PIC 9(01).                 MBWS104 
003500     05  MB104-MERCH-AREA-DESC         PIC X(25).                 MBWS104 
003600     05  MB104-START-DATE              PIC 9(08).                 MBWS104 
003700     05  MB104-END-DATE                PIC 9(08).                 MBWS104 
003800     05  MB104-MERCH-TYPE              PIC X(01).                 MBWS104 
003900     05  MB104-BUYER-NUMBER            PIC X(03).                 MBWS104 
004000     05  MB104-BUS-GROUP               PIC X(03).                 MBWS104 
004100     05  MB104-DEPT-DISCOUNT           PIC X(02).                 MBWS104 
004200     05  MB104-AR-DESCRIP              PIC X(14).                 MBWS104 
004300     05  MB104-POS-DESCRIP             PIC X(17).                 MBWS104 
004400     05  MB104-TAX-DEFLT-IND           PIC X(01).                 MBWS104 
004500     05  MB104-CONSIGN-IND             PIC X(01).                 MBWS104 
004600     05  MB104-PARENT-MDSEAR-DKEY      PIC S9(6)V COMP-3.         MBWS104 
004700     05  MB104-FREIGHT-PERCENT         PIC SV999  COMP-3.         MBWS104 
C14666     05  MB104-BM-SHRINK-PERCENT       PIC SV9999 COMP-3.         MBWS104 
C14666     05  MB104-ECOM-SHRINK-PERCENT     PIC SV9999 COMP-3.         MBWS104 
005000     05  MB104-CAL-MN-NBR              PIC 99.                    MBWS104 
005100     05  MB104-SKU-LVL-UPD-IND         PIC X.                     MBWS104 
005300     05  MB104-DAYS-BEF-SHIP-NBR       PIC X(03).                    CL**3
005400     05  MB104-DAYS-AFT-CLR-NBR        PIC X(03).                    CL**3
005500     05  MB104-STR-ZN-ID               PIC X(05).                    CL**3
005500     05  MB104-SHNK-FSCL-YR-NBR        PIC X(04).                    CL**3
C14666     05  FILLER                        PIC X(22).                    CL**3
