00001 ******************************************************************11/04/91
00002 *                         MBWS009                                *MBWS009 
00003 *                                                                *   LV051
00004 *   THIS IS THE APPLICATION SPECIFIC COMMUNICATION AREA FOR      *MBWS009 
00005 *   PROGRAM MBKCS108.                                            *   CL*38
00006 *                                                                *MBWS009 
00007 *   LENGTH:  2865 BYTES                                          *MBWS009 
00008 ******************************************************************MBWS009 
00009          10  MB009-SPECIFIC-COMMAREA.                                CL*36
00010              15  FILLER                               PIC X(02).     CL*18
00011              15  MB009-CO-NUMBER                      PIC X(02).     CL*36
00012              15  MB009-REQUEST-DATA.                                 CL*41
00013                  20  MB009-DEPT-NUMBER                PIC X(03).     CL*41
00014                      88  MB009-ALL-DEPARTMENTS        VALUE '*  ',   CL*41
00015                                                             '** ',   CL*18
00016                                                             '***',   CL*18
00017                                                             ' **',   CL*18
00018                                                             '  *'.   CL*18
00019                  20  MB009-MCLASS-NUMBER              PIC X(02).     CL*41
00020                      88  MB009-ALL-MCLASSES           VALUE '* ',    CL*41
00021                                                             '**',    CL*18
00022                                                             ' *'.    CL*18
00023                  20  MB009-SCLASS-NUMBER              PIC X(03).     CL*41
00024                      88  MB009-ALL-SCLASSES           VALUE '*  ',   CL*41
00025                                                             '** ',   CL*18
00026                                                             '***',   CL*18
00027                                                             ' **',   CL*18
00028                                                             '  *'.   CL*18
00029                  20  MB009-HISTORY-FLAG               PIC X.         CL*49
00030                      88 MB009-HISTORY                 VALUE 'Y'.     CL*49
00031                      88 MB009-NO-HISTORY              VALUE 'N'.     CL*49
00032              15  MB009-BLOCK-ARRAY.                                  CL*36
00033                  20  MB009-BLOCK-ENTRIES OCCURS 2 TIMES.             CL*36
00034                      25  MB009-BLOCK-MODIFIED-SW      PIC X(01).     CL*36
00035                          88  MB009-BLOCK-MODIFIED     VALUE 'Y'.     CL*36
00036                          88  MB009-BLOCK-NOT-MODIFIED VALUE 'N'.     CL*36
00037                      25  MB009-ITEM-ARRAY.                           CL*36
00038                          30  MB009-ITEM-ENTRIES OCCURS 18 TIMES.     CL*36
00039                              35  MB009-LIST-ITEM-NUMBER              CL*36
00040                                                       PIC S9(09)     CL*18
00041                                                           COMP-3.    CL*18
00042                              35  MB009-SELECTED-SW    PIC X(01).     CL*36
00043                                  88  MB009-NO-SELECT  VALUE ' '.     CL*36
00044                                  88  MB009-SELECT     VALUE 'S'.     CL*36
00045                                  88  MB009-BEGIN      VALUE 'B'.     CL*36
00046                                  88  MB009-END        VALUE 'E'.     CL*36
00047                            33    MB009-KEY-DATA.                     CL*43
00048                              35  MB009-ITEM-GMA       PIC X(02).     CL*43
00049                              35  MB009-ITEM-DMA       PIC X(02).     CL*36
00050                              35  MB009-ITEM-DEPT      PIC X(03).     CL*36
00051                              35  MB009-ITEM-MCLASS    PIC X(02).     CL*36
00052                              35  MB009-ITEM-SCLASS    PIC X(03).     CL*36
00053                            33    MB009-KEY-DATA-END.                 CL*43
00054                              35  MB009-ITEM-DESC      PIC X(25).     CL*36
00055                              35  MB009-ITEM-POSDESC   PIC X(17).     CL*37
00056                              35  MB009-ITEM-TAXD      PIC X(01).     CL*37
00057                              35  MB009-ITEM-ACTION    PIC X(07).     CL*36
00058                              35  MB009-COLOR          PIC X(01).     CL*48
00059                                                                      CL*20
00060              15  MB009-BLOCK-SUB                      PIC S9(04)     CL*36
00061                                                           COMP       CL*18
00062                                                           SYNC.      CL*18
00063              15  MB009-ITEM-SUB                       PIC S9(04)     CL*36
00064                                                           COMP       CL*18
00065                                                           SYNC.      CL*18
00066              15  MB009-NUMBER-OF-ITEMS-READ           PIC S9(09)     CL*36
00067                                                           COMP-3.    CL*18
00068              15  MB009-NUMBER-OF-ITEMS-SELECTED       PIC S9(09)     CL*36
00069                                                           COMP-3.    CL*18
00070              15  MB009-ITEM-AT-TOP-OF-PANEL           PIC S9(09)     CL*36
00071                                                           COMP-3.    CL*18
00072              15  MB009-HIGHEST-BLOCK-WRITTEN          PIC S9(04)     CL*36
00073                                                           COMP       CL*18
00074                                                           SYNC.      CL*18
00075              15  MB009-START-OF-SELECTED-RANGE        PIC S9(09)     CL*36
00076                                                           COMP-3.    CL*18
00077              15  MB009-DB2-HISTORY-DATE               PIC X(10).     CL*50
00078              15  MB009-DB2-CURRENT-DATE               PIC X(10).     CL*50
00079              15  MB009-END-OF-SELECTED-RANGE          PIC S9(09)     CL*36
00080                                                           COMP-3.    CL*18
00081              15  MB009-ITEMS-LEFT-ON-DB-SW            PIC X(01).     CL*36
00082                  88  MB009-ITEMS-LEFT-ON-DB           VALUE 'Y'.     CL*36
00083                  88  MB009-NO-ITEMS-LEFT-ON-DB        VALUE 'N'.     CL*36
00084              15  MB009-TEMP-QUEUE-UPDATE-SW           PIC X(01).     CL*42
00085                  88  WE-MUST-UPDATE-TSQ               VALUE 'Y'.     CL*42
00086                  88  NO-UPDATE-TO-TSQ                 VALUE 'N'.     CL*42
00087              15  MB009-LIST-QUEUE-NAME                PIC X(8).      CL*43
00088              15  MB009-TEMP-QUEUE-NAME.                              CL*43
00089                  20  MB009-TERM-ID                    PIC X(04).     CL*36
00090                  20  MB009-TASK-NUMBER                PIC S9(07)     CL*36
00091                                                           COMP-3.    CL*18
00092              15  MB009-SAVE-LEVEL-CODE.                              CL*36
00093                  20  MB009-SAVE-GMA                   PIC X(03).     CL*36
00094                  20  MB009-SAVE-DMA                   PIC X(03).     CL*36
00095                  20  MB009-SAVE-DPT                   PIC X(03).     CL*36
00096                  20  MB009-SAVE-MCL                   PIC X(03).     CL*36
00097                  20  MB009-SAVE-SCL                   PIC X(03).     CL*36
00098              15  MB009-SAVE-KEY.                                     CL*36
00099                  20  MB009-SAVE-SEQ-NBR               PIC S9(15)     CL*45
00100                                                       COMP-3.        CL*45
00101                  20  MB009-SAVE-CUR-DATE              PIC X(10).     CL*39
00102                  20  MB009-SAVE-GMA-NBR               PIC X(02).     CL*39
00103                  20  MB009-SAVE-DMA-NBR               PIC X(02).     CL*36
00104                  20  MB009-SAVE-DPT-NBR               PIC X(03).     CL*36
00105                  20  MB009-SAVE-MCL-NBR               PIC X(02).     CL*36
00106                  20  MB009-SAVE-SCL-NBR               PIC X(03).     CL*36
00107                                                                      CL*29
00108              15  MB009-OPEN-CURSOR-SW                 PIC X(01).     CL*36
00109                  88  MB009-NO-CURSOR-OPEN             VALUE '0'.     CL*36
00110                  88  MB009-OPEN-MERCH-CURSOR          VALUE '1'.     CL*36
00111                  88  MB009-OPEN-GMA-CURSOR            VALUE '2'.     CL*36
00112                  88  MB009-OPEN-DMA-CURSOR            VALUE '3'.     CL*36
00113                  88  MB009-OPEN-DPT-CURSOR            VALUE '4'.     CL*36
00114                  88  MB009-OPEN-MCL-CURSOR            VALUE '5'.     CL*36
00115                  88  MB009-OPEN-SCL-CURSOR            VALUE '6'.     CL*36
00116                                                                      CL*29
00117              15  FILLER                               PIC X(250).    CL*51
