00001 ******************************************************************01/10/92
00002 *                         MBWS014                                *MBWS014 
00003 *                                                                *   LV023
00004 *   THIS IS THE APPLICATION SPECIFIC COMMUNICATION AREA FOR      *MBWS014 
00005 *   PROGRAM MBKCS115.                                            *   CL*18
00006 *                                                                *MBWS014 
00007 *   LENGTH:  2865 BYTES                                          *MBWS014 
00008 ******************************************************************MBWS014 
00009          10  MB014-SPECIFIC-COMMAREA.                                CL*18
00010              15  FILLER                      PIC X(02).              CL**5
00011              15  MB014-APLS-NUMBER-X         PIC X(02).              CL*19
00012                  88  MB014-ALL-APLS          VALUE '* ',             CL*22
00013                                                    '**',             CL*22
00014                                                    ' *'.             CL*22
00015              15  MB014-CO-NUMBER-X           PIC X(02).              CL*18
00016              15  MB014-GMA-NUMBER-X          PIC X(02).              CL*18
00017                  88  MB014-ALL-GMAS          VALUE '* ',             CL*18
00018                                                    '**',             CL**8
00019                                                    ' *'.             CL**8
00020              15  FILLER REDEFINES MB014-GMA-NUMBER-X.                CL*18
00021                  20  MB014-GMA-NUMBER        PIC 9(02).              CL*18
00022                      88  MB014-GMA-NUMERIC   VALUE 01 THRU 99.       CL*18
00023              15  MB014-DMA-NUMBER-X          PIC X(02).              CL*18
00024                  88  MB014-ALL-DMAS          VALUE '* ',             CL*18
00025                                                    '**',             CL**8
00026                                                    ' *'.             CL**8
00027              15  FILLER REDEFINES MB014-DMA-NUMBER-X.                CL*18
00028                  20  MB014-DMA-NUMBER        PIC 9(02).              CL*18
00029                      88  MB014-DMA-NUMERIC   VALUE 01 THRU 99.       CL*18
00030              15  MB014-DEPT-NUMBER-X         PIC X(03).              CL*18
00031                  88  MB014-ALL-DEPARTMENTS   VALUE '*  ',            CL*18
00032                                                    '** ',            CL*13
00033                                                    '***',            CL*13
00034                                                    ' **',            CL*13
00035                                                    '  *'.            CL*13
00036              15  FILLER REDEFINES MB014-DEPT-NUMBER-X.               CL*18
00037                  20  MB014-DEPT-NUMBER       PIC 9(03).              CL*18
00038                      88  MB014-DEPT-NUMERIC  VALUE 001 THRU 999.     CL*18
00039              15  MB014-MCLASS-NUMBER-X       PIC X(02).              CL*18
00040                  88  MB014-ALL-MCLASSES      VALUE '* ',             CL*18
00041                                                    '**',             CL**6
00042                                                    ' *'.             CL**6
00043              15  FILLER REDEFINES MB014-MCLASS-NUMBER-X.             CL*18
00044                  20  MB014-MCLASS-NUMBER     PIC 9(02).              CL*18
00045                      88  MB014-MCL-NUMERIC   VALUE 01 THRU 99.       CL*18
00046              15  MB014-SCLASS-NUMBER-X       PIC X(03).              CL*18
00047                  88  MB014-ALL-SCLASSES      VALUE '*  ',            CL*18
00048                                                    '** ',            CL*13
00049                                                    '***',            CL*13
00050                                                    ' **',            CL*13
00051                                                    '  *'.            CL**8
00052              15  FILLER REDEFINES MB014-SCLASS-NUMBER-X.             CL*18
00053                  20  MB014-SCLASS-NUMBER     PIC 9(03).              CL*23
00054                      88  MB014-SCL-NUMERIC   VALUE 001 THRU 999.     CL*18
00055              15  MB014-HISTORY-INDICATOR     PIC X.                  CL*21
00056                  88  MB014-VALID-HISTORY     VALUE 'N', 'Y'.         CL*21
00057              15  FILLER                      PIC X(2846).            CL*21
