00001 *******************************************************           10/29/91
00002 *    THIS DSECT REDEFINES MAP MBKM102.                            MBWS004 
00003 *******************************************************              LV023
00004  01  MB004I-DSECT REDEFINES MB102AI.                                 CL*18
00005      05  FILLER                 PIC X(12).                        MBWS004 
00006      05  MB004I-ADATEL          PIC S9(04) COMP.                     CL**9
00007      05  MB004I-ADATEA          PIC X(01).                           CL**9
00008      05  FILLER                 PIC X(02).                        MBWS004 
00009      05  MB004I-ADATEI          PIC X(10).                           CL**9
00010      05  MB004I-ATIMEL          PIC S9(04) COMP.                     CL**9
00011      05  MB004I-ATIMEA          PIC X(01).                           CL**9
00012      05  FILLER                 PIC X(02).                        MBWS004 
00013      05  MB004I-ATIMEI          PIC X(08).                           CL**9
00014      05  MB004I-ATITLEL         PIC S9(04) COMP.                     CL**9
00015      05  MB004I-ATITLEA         PIC X(01).                           CL**9
00016      05  FILLER                 PIC X(02).                        MBWS004 
00017      05  MB004I-ATITLEI         PIC X(30).                           CL**9
00018      05  MB004I-ATERMIDL        PIC S9(04) COMP.                     CL**9
00019      05  MB004I-ATERMIDA        PIC X(01).                           CL**9
00020      05  FILLER                 PIC X(02).                        MBWS004 
00021      05  MB004I-ATERMIDI        PIC X(04).                           CL**9
00022      05  MB004I-APGMIDL         PIC S9(04) COMP.                     CL**9
00023      05  MB004I-APGMIDA         PIC X(01).                           CL**9
00024      05  FILLER                 PIC X(02).                        MBWS004 
00025      05  MB004I-APGMIDI         PIC X(08).                           CL**9
00026      05  MB004I-AOPERCOL        PIC S9(04) COMP.                     CL*15
00027      05  MB004I-AOPERCPA        PIC X(01).                           CL*15
00028      05  FILLER                 PIC X(02).                        MBWS004 
00029      05  MB004I-AOPERCOI        PIC X(02).                           CL*15
00030      05  MB004I-ABEGITML        PIC S9(04) COMP.                     CL*15
00031      05  MB004I-ABEGITMA        PIC X(01).                           CL*15
00032      05  FILLER                 PIC X(02).                           CL*15
00033      05  MB004I-ABEGITMI        PIC 9(06).                           CL*19
00034      05  MB004I-AENDITML        PIC S9(04) COMP.                     CL**9
00035      05  MB004I-AENDITMA        PIC X(01).                           CL**9
00036      05  FILLER                 PIC X(02).                        MBWS004 
00037      05  MB004I-AENDITMI        PIC X(06).                           CL*19
00038      05  MB004I-AOFL            PIC S9(04) COMP.                     CL*10
00039      05  MB004I-AOFA            PIC X(01).                           CL*10
00040      05  FILLER                 PIC X(02).                        MBWS004 
00041      05  MB004I-AOFI            PIC X(02).                           CL*10
00042      05  MB004I-ATOTITML        PIC S9(04) COMP.                     CL*10
00043      05  MB004I-ATOTITMA        PIC X(01).                           CL*10
00044      05  FILLER                 PIC X(02).                        MBWS004 
00045      05  MB004I-ATOTITMI        PIC X(06).                           CL*19
00046      05  MB004I-ASELCTI.                                             CL*10
00047          10  MB004I-SELECTION-ENTRIES OCCURS 14 TIMES.               CL*10
00048              15  MB004I-ASELL   PIC S9(04) COMP.                     CL*10
00049              15  MB004I-ASELA   PIC X(01).                           CL*10
00050              15  FILLER         PIC X(02).                           CL*23
00051              15  MB004I-ASELI   PIC X(01).                           CL*10
00052              15  MB004I-AGMAL   PIC S9(04) COMP.                     CL*10
00053              15  MB004I-AGMAA   PIC X(01).                           CL*10
00054              15  FILLER         PIC X(02).                           CL*23
00055              15  MB004I-AGMAI   PIC X(02).                           CL*10
00056              15  MB004I-ADMAL   PIC S9(04) COMP.                     CL*10
00057              15  MB004I-ADMAA   PIC X(01).                           CL*10
00058              15  FILLER         PIC X(02).                           CL*23
00059              15  MB004I-ADMAI   PIC X(02).                           CL*10
00060              15  MB004I-ADEPTL  PIC S9(04) COMP.                     CL*10
00061              15  MB004I-ADEPTA  PIC X(01).                           CL*10
00062              15  FILLER         PIC X(02).                           CL*23
00063              15  MB004I-ADEPTI  PIC X(03).                           CL*10
00064              15  MB004I-AMCLSL  PIC S9(04) COMP.                     CL*13
00065              15  MB004I-AMCLSA  PIC X(01).                           CL*13
00066              15  FILLER         PIC X(02).                           CL*23
00067              15  MB004I-AMCLSI  PIC X(02).                           CL*13
00068              15  MB004I-ASCLSL  PIC S9(04) COMP.                     CL*13
00069              15  MB004I-ASCLSA  PIC X(01).                           CL*13
00070              15  FILLER         PIC X(02).                           CL*23
00071              15  MB004I-ASCLSI  PIC X(03).                           CL*13
00072              15  MB004I-ALVLCL  PIC S9(04) COMP.                     CL*14
00073              15  MB004I-ALVLCA  PIC X(01).                           CL*14
00074              15  FILLER         PIC X(02).                           CL*23
00075              15  MB004I-ALVLCI  PIC X(03).                           CL*14
00076              15  MB004I-ADESCL  PIC S9(04) COMP.                     CL*10
00077              15  MB004I-ADESCA  PIC X(01).                           CL*10
00078              15  FILLER         PIC X(02).                           CL*23
00079              15  MB004I-ADESCI  PIC X(25).                           CL*10
00080              15  MB004I-ASDATL  PIC S9(04) COMP.                     CL*11
00081              15  MB004I-ASDATA  PIC X(01).                           CL*11
00082              15  FILLER         PIC X(02).                           CL*23
00083              15  MB004I-ASDATI  PIC X(08).                           CL*11
00084              15  MB004I-AEDATL  PIC S9(04) COMP.                     CL*11
00085              15  MB004I-AEDATA  PIC X(01).                           CL*11
00086              15  FILLER         PIC X(02).                           CL*23
00087              15  MB004I-AEDATI  PIC X(08).                           CL*11
00088              15  MB004I-AACTNL  PIC S9(04) COMP.                     CL*11
00089              15  MB004I-AACTNA  PIC X(01).                           CL*11
00090              15  FILLER         PIC X(02).                           CL*23
00091              15  MB004I-AACTNI  PIC X(07).                           CL*11
00092      05  MB004I-ATOTSELL        PIC S9(04) COMP.                     CL*11
00093      05  MB004I-ATOTSELA        PIC X(01).                           CL*11
00094      05  FILLER                 PIC X(02).                        MBWS004 
00095      05  MB004I-ATOTSELI        PIC X(07).                           CL*11
00096      05  MB004I-AMSGL           PIC S9(04) COMP.                     CL*11
00097      05  MB004I-AMSGA           PIC X(01).                           CL*11
00098      05  FILLER                 PIC X(02).                        MBWS004 
00099      05  MB004I-AMSGI           PIC X(78).                           CL*11
00100      05  MB004I-ANAVCMDL        PIC S9(04) COMP.                     CL*11
00101      05  MB004I-ANAVCMDA        PIC X(01).                           CL*11
00102      05  FILLER                 PIC X(02).                        MBWS004 
00103      05  MB004I-ANAVCMDI        PIC X(08).                           CL*11
00104      05  MB004I-ANAVKEYL        PIC S9(04) COMP.                     CL*11
00105      05  MB004I-ANAVKEYA        PIC X(01).                           CL*11
00106      05  FILLER                 PIC X(02).                        MBWS004 
00107      05  MB004I-ANAVKEYI        PIC X(25).                           CL*11
00108      05  MB004I-AFKLIN1L        PIC S9(04) COMP.                     CL*11
00109      05  MB004I-AFKLIN1A        PIC X(01).                           CL*11
00110      05  FILLER                 PIC X(02).                        MBWS004 
00111      05  MB004I-AFKLIN1I        PIC X(78).                           CL*11
00112      05  MB004I-AFKLIN2L        PIC S9(04) COMP.                     CL*11
00113      05  MB004I-AFKLIN2A        PIC X(01).                           CL*11
00114      05  FILLER                 PIC X(02).                        MBWS004 
00115      05  MB004I-AFKLIN2I        PIC X(78).                           CL*11
00116  01  MD-MAP-DATA-AREA REDEFINES MB004I-DSECT.                        CL*11
00117      05  FILLER                 PIC X(12).                        MBWS004 
00118      05  FILLER                 PIC X(03).                        MBWS004 
00119      05  MB004O-ADATEC          PIC X(01).                           CL*11
00120      05  MB004O-ADATEH          PIC X(01).                           CL*11
00121      05  MB004O-ADATEO          PIC X(10).                           CL*11
00122      05  FILLER                 PIC X(03).                        MBWS004 
00123      05  MB004O-ATIMEC          PIC X(01).                           CL*11
00124      05  MB004O-ATIMEH          PIC X(01).                           CL*11
00125      05  MB004O-ATIMEO          PIC X(08).                           CL*11
00126      05  FILLER                 PIC X(03).                        MBWS004 
00127      05  MB004O-ATITLEC         PIC X(01).                           CL*11
00128      05  MB004O-ATITLEH         PIC X(01).                           CL*11
00129      05  MB004O-ATITLEO         PIC X(30).                           CL*11
00130      05  FILLER                 PIC X(03).                        MBWS004 
00131      05  MB004O-ATERMIDC        PIC X(01).                           CL*11
00132      05  MB004O-ATERMIDH        PIC X(01).                           CL*11
00133      05  MB004O-ATERMIDO        PIC X(04).                           CL*11
00134      05  FILLER                 PIC X(03).                        MBWS004 
00135      05  MB004O-APGMIDC         PIC X(01).                           CL*11
00136      05  MB004O-APGMIDH         PIC X(01).                           CL*11
00137      05  MB004O-APGMIDO         PIC X(08).                           CL*11
00138      05  FILLER                 PIC X(03).                        MBWS004 
00139      05  MB004O-AOPERCOC        PIC X(01).                           CL*15
00140      05  MB004O-AOPERCOH        PIC X(01).                           CL*15
00141      05  MB004O-AOPERCOO        PIC X(02).                           CL*16
00142      05  FILLER                 PIC X(03).                           CL*15
00143      05  MB004O-ABEGITMC        PIC X(01).                           CL*15
00144      05  MB004O-ABEGITMH        PIC X(01).                           CL*15
00145      05  MB004O-ABEGITMO        PIC ZZZZZ9.                          CL*20
00146      05  FILLER                 PIC X(03).                        MBWS004 
00147      05  MB004O-AENDITMC        PIC X(01).                           CL*11
00148      05  MB004O-AENDITMH        PIC X(01).                           CL*11
00149      05  MB004O-AENDITMO        PIC ZZZZZ9.                          CL*20
00150      05  FILLER                 PIC X(03).                        MBWS004 
00151      05  MB004O-AOFC            PIC X(01).                           CL*11
00152      05  MB004O-AOFH            PIC X(01).                           CL*11
00153      05  MB004O-AOFO            PIC X(02).                           CL*11
00154      05  FILLER                 PIC X(03).                        MBWS004 
00155      05  MB004O-ATOTITMC        PIC X(01).                           CL*11
00156      05  MB004O-ATOTITMH        PIC X(01).                           CL*11
00157      05  MB004O-ATOTITMO        PIC ZZZZZZ.                          CL*20
00158      05  MB004O-ASELCTO.                                             CL*11
00159          10  MB004O-SELECTION-ENTRIES OCCURS 14 TIMES.               CL*11
00160              15  FILLER         PIC X(03).                        MBWS004 
00161              15  MB004O-ASELC   PIC X(01).                           CL*11
00162              15  MB004O-ASELH   PIC X(01).                           CL*11
00163              15  MB004O-ASELO   PIC X(01).                           CL*11
00164              15  FILLER         PIC X(03).                        MBWS004 
00165              15  MB004O-AGMAC   PIC X(01).                           CL*11
00166              15  MB004O-AGMAH   PIC X(01).                           CL*11
00167              15  MB004O-AGMAO   PIC X(02).                           CL*11
00168              15  FILLER         PIC X(03).                        MBWS004 
00169              15  MB004O-ADMAC   PIC X(01).                           CL*22
00170              15  MB004O-ADMAH   PIC X(01).                           CL*11
00171              15  MB004O-ADMAO   PIC X(02).                           CL*11
00172              15  FILLER         PIC X(03).                        MBWS004 
00173              15  MB004O-ADEPTC  PIC X(01).                           CL*11
00174              15  MB004O-ADEPTH  PIC X(01).                           CL*11
00175              15  MB004O-ADEPTO  PIC X(03).                           CL*13
00176              15  FILLER         PIC X(03).                           CL*13
00177              15  MB004O-AMCLSC  PIC X(01).                           CL*13
00178              15  MB004O-AMCLSH  PIC X(01).                           CL*13
00179              15  MB004O-AMCLSO  PIC X(02).                           CL*13
00180              15  FILLER         PIC X(03).                           CL*11
00181              15  MB004O-ASCLSC  PIC X(01).                           CL*13
00182              15  MB004O-ASCLSH  PIC X(01).                           CL*13
00183              15  MB004O-ASCLSO  PIC X(03).                           CL*13
00184              15  FILLER         PIC X(03).                           CL*14
00185              15  MB004O-ALVLCC  PIC X(01).                           CL*14
00186              15  MB004O-ALVLCH  PIC X(01).                           CL*14
00187              15  MB004O-ALVLCO  PIC X(03).                           CL*14
00188              15  FILLER         PIC X(03).                           CL*13
00189              15  MB004O-ADESCC  PIC X(01).                           CL*11
00190              15  MB004O-ADESCH  PIC X(01).                           CL*11
00191              15  MB004O-ADESCO  PIC X(25).                           CL*13
00192              15  FILLER         PIC X(03).                        MBWS004 
00193              15  MB004O-ASDATC  PIC X(01).                           CL*12
00194              15  MB004O-ASDATH  PIC X(01).                           CL*12
00195              15  MB004O-ASDATO  PIC X(08).                           CL*12
00196              15  FILLER         PIC X(03).                           CL*12
00197              15  MB004O-AEDATC  PIC X(01).                           CL*12
00198              15  MB004O-AEDATH  PIC X(01).                           CL*12
00199              15  MB004O-AEDATO  PIC X(08).                           CL*12
00200              15  FILLER         PIC X(03).                        MBWS004 
00201              15  MB004O-AACTNC  PIC X(01).                           CL*12
00202              15  MB004O-AACTNH  PIC X(01).                           CL*12
00203              15  MB004O-AACTNO  PIC X(07).                           CL*12
00204      05  FILLER                 PIC X(03).                        MBWS004 
00205      05  MB004O-ATOTSELC        PIC X(01).                           CL*12
00206      05  MB004O-ATOTSELH        PIC X(01).                           CL*12
00207      05  MB004O-ATOTSELO        PIC X(07).                           CL*17
00208      05  FILLER                 PIC X(03).                        MBWS004 
00209      05  MB004O-AMSGC           PIC X(01).                           CL*12
00210      05  MB004O-AMSGH           PIC X(01).                           CL*12
00211      05  MB004O-AMSGO           PIC X(78).                           CL*12
00212      05  FILLER                 PIC X(03).                        MBWS004 
00213      05  MB004O-ANAVCMDC        PIC X(01).                           CL*12
00214      05  MB004O-ANAVCMDH        PIC X(01).                           CL*12
00215      05  MB004O-ANAVCMDO        PIC X(08).                           CL*12
00216      05  FILLER                 PIC X(03).                        MBWS004 
00217      05  MB004O-ANAVKEYC        PIC X(01).                           CL*12
00218      05  MB004O-ANAVKEYH        PIC X(01).                           CL*12
00219      05  MB004O-ANAVKEYO        PIC X(25).                           CL*12
00220      05  FILLER                 PIC X(03).                        MBWS004 
00221      05  MB004O-AFKLIN1C        PIC X(01).                           CL*12
00222      05  MB004O-AFKLIN1H        PIC X(01).                           CL*12
00223      05  MB004O-AFKLIN1O        PIC X(78).                           CL*12
00224      05  FILLER                 PIC X(03).                        MBWS004 
00225      05  MB004O-AFKLIN2C        PIC X(01).                           CL*12
00226      05  MB004O-AFKLIN2H        PIC X(01).                           CL*12
00227      05  MB004O-AFKLIN2O        PIC X(78).                           CL*12
