00001 ***************************************************************   10/17/91
00002 *                                                             *   MBWS125 
00003 *     THIS IS THE LAYOUT FOR THE TS QUEUE RECORD(S) THAT ARE  *      LV003
00004 *     CREATED IN MBKCS125 - APPLICATION SYSTEM LIST.  THESE   *      CL**1
00005 *     RECORDS ARE PASSED TO MBKCS126 (APPLICATIONS SYSTEM ADD *      CL**1
00006 *     UPDATE OR DELETE).                                      *      CL**1
00007 *                                                             *      CL**1
00008 *     NOTE:  THIS MEMBER HAS NO 01 LEVEL!!                    *      CL**1
00009 *                                                             *      CL**1
00010 ***************************************************************      CL**1
00011       05  MBWS125-FIRST-APLSYS-CODE                                  CL**1
00012                                    PIC XX.                           CL**1
00013       05  MBWS125-LAST-APLSYS-CODE PIC XX.                           CL**1
00014       05  MBWS125-SELECTED-APLSYS-CODES                              CL**1
00015                                    PIC 999            VALUE 0.       CL**1
00016       05  MBWS125-MAX-APLSYS-CODES PIC S9(3)  COMP-3  VALUE 200.     CL**1
00017       05  MBWS125-ACTION           PIC X.                            CL**2
00018           88  MBWS125-UPDATE                          VALUE 'U'.     CL**2
00019           88  MBWS125-DELETE                          VALUE 'D'.     CL**2
00020       05  MBWS125-APLSYS-ARRAY     OCCURS 200 TIMES                  CL**1
00021                                    INDEXED BY MBWS125-IDX.           CL**1
00022           10  MBWS125-APLSYS-CODE  PIC XX.                           CL**1
00023           10  MBWS125-ITEM         PIC S9(9)  COMP-3.                CL**3
00024 *                                                                    CL**1
