*********************************************************************** 00002   
*                                                                       00003   
*   THIS IS THE MAPSET FOR THE MERCHANDISE INQUIRY SKU/STORE            00004   
*   INQUIRY SCREEN.                                                     00004   
*                                                                       00005   
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00008   
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00009   
*********************************************************************** 00010   
*  CHANGE LOG:                                                          00010   
*                                                                       00010   
*  08/10/04 - MARIA KLAMIK                                              00010   
*             (WR #26354) NEW MAP FOR MERCH INQUIRY SCREEN.             00010   
*  06/01/06 - JILL LIN                                                  00010   
*             (WR #30667) ADD STORE EXPECTED QTY AND BRAND NAME FIELDS. 00010   
*  04/14/08 - D. THEEL                                                  00010   
*             (WR #26481) ADD RECLASS DEPT AND SCL FIELDS.              00010   
*********************************************************************** 00010   
        PRINT NOGEN                                                     00011   
MHKM803 DFHMSD TYPE=MAP,                                               X00012   
               MODE=INOUT,                                             X00013   
               LANG=COBOL,                                             X00014   
               TIOAPFX=YES                                              00015   
MH803A  DFHMDI SIZE=(19,80),                                           X00016   
               CTRL=(FREEKB,FRSET),                                    X00017   
               LINE=2,                                                 X00018   
               COLUMN=1,                                               X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*********************************************************************** 00010   
        DFHMDF POS=(2,01),                                             X00022   
               LENGTH=12,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='DEPARTMENT.:'                                   00026   
DEPT    DFHMDF POS=(2,14),                                             X00027   
               LENGTH=3,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(2,25),                                             X00022   
               LENGTH=12,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='MAJOR CLASS:'                                   00026   
MCL     DFHMDF POS=(2,38),                                             X00027   
               LENGTH=2,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(2,44),                                             X00022   
               LENGTH=09,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='SUBCLASS:'                                      00026   
SCL     DFHMDF POS=(2,54),                                             X00027   
               LENGTH=2,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
*********************************************************************** 00010   
        DFHMDF POS=(3,01),                                             X00022   
               LENGTH=12,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='SKU........:'                                   00026   
SKU     DFHMDF POS=(3,14),                                             X00027   
               LENGTH=8,                                               X00053   
               ATTRB=(UNPROT,NORM),                                    X00054   
               HILIGHT=UNDERLINE,                                      X00055   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(3,23),LENGTH=1,ATTRB=ASKIP                          00046   
        DFHMDF POS=(3,25),                                             X00022   
               LENGTH=12,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='STORE......:'                                   00026   
STORE   DFHMDF POS=(3,38),                                             X00066   
               LENGTH=5,                                               X00067   
               ATTRB=(UNPROT,NORM),                                    X00068   
               HILIGHT=UNDERLINE,                                      X00069   
               COLOR=GREEN                                              00070   
STDESC  DFHMDF POS=(3,44),                                             X00071   
               LENGTH=25,                                              X00072   
               ATTRB=(ASKIP,NORM),                                     X00073   
               COLOR=BLUE                                               00074   
*********************************************************************** 00010   
        DFHMDF POS=(4,01),                                             X00022   
               LENGTH=12,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='DESCRIPTION:'                                   00026   
SKUDSC  DFHMDF POS=(4,14),                                             X00027   
               LENGTH=25,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(4,40),                                             X00022   
               LENGTH=6,                                               X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='SIZE.:'                                         00026   
SIZE    DFHMDF POS=(4,47),                                             X00027   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(4,61),                                             X00022   
               LENGTH=8,                                               X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='NRF CDE:'                                       00026   
SIZECD  DFHMDF POS=(4,70),                                             X00027   
               LENGTH=5,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
*********************************************************************** 00010   
RCLDPT  DFHMDF POS=(5,01),                                             X00022   
               LENGTH=18,                                              X00023   
               ATTRB=(ASKIP,NORM),                                     X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='RECLASS FROM DEPT:'                             00026   
RCLDPL  DFHMDF POS=(5,20),                                             X00027   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
RCLSCT  DFHMDF POS=(5,28),                                             X00022   
               LENGTH=04,                                              X00023   
               ATTRB=(ASKIP,NORM),                                     X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='SCL:'                                           00026   
RCLSCL  DFHMDF POS=(5,33),                                             X00027   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(5,40),                                             X00022   
               LENGTH=6,                                               X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='COLOR:'                                         00026   
COLOR   DFHMDF POS=(5,47),                                             X00027   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(5,61),                                             X00022   
               LENGTH=8,                                               X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='NRF CDE:'                                       00026   
COLRCD  DFHMDF POS=(5,70),                                             X00027   
               LENGTH=3,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
*********************************************************************** 00010   
        DFHMDF POS=(7,01),                                             X00022   
               LENGTH=16,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='ONHAND QTY.....:'                               00026   
ONHAND  DFHMDF POS=(7,18),                                             X00027   
               LENGTH=8,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(7,28),                                             X00022   
               LENGTH=17,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='STR ONHAND QTY..:'                              00026   
STROH   DFHMDF POS=(7,46),                                             X00027   
               LENGTH=8,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(7,56),                                             X00022   
               LENGTH=14,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='INTRANSIT QTY:'                                 00026   
INTQTY  DFHMDF POS=(7,71),                                             X00027   
               LENGTH=8,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
*********************************************************************** 00010   
        DFHMDF POS=(8,01),                                             X00022   
               LENGTH=16,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='ON ORDER QTY...:'                               00026   
ONORDR  DFHMDF POS=(8,18),                                             X00027   
               LENGTH=8,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(8,28),                                             X00022   
               LENGTH=17,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='STR EXPECTED QTY:'                              00026   
STREPT  DFHMDF POS=(8,46),                                             X00027   
               LENGTH=8,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
*********************************************************************** 00010   
        DFHMDF POS=(10,01),                                            X00022   
               LENGTH=16,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='STATUS.........:'                               00026   
STATUS  DFHMDF POS=(10,18),                                            X00027   
               LENGTH=2,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
STADSC  DFHMDF POS=(10,22),                                            X00027   
               LENGTH=6,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(10,31),                                            X00022   
               LENGTH=14,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='BRAND NAME...:'                                 00026   
BNDNME  DFHMDF POS=(10,46),                                            X00027   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
*********************************************************************** 00010   
        DFHMDF POS=(11,01),                                            X00022   
               LENGTH=16,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='TICKET COLOR...:'                               00026   
TKTCLR  DFHMDF POS=(11,18),                                            X00027   
               LENGTH=6,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(11,31),                                            X00022   
               LENGTH=14,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='VENDOR NAME..:'                                 00026   
VNDNME  DFHMDF POS=(11,46),                                            X00027   
               LENGTH=30,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
*********************************************************************** 00010   
        DFHMDF POS=(12,01),                                            X00022   
               LENGTH=16,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='STATUS CHANGED.:'                               00026   
STCHDT  DFHMDF POS=(12,18),                                            X00027   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(12,31),                                            X00022   
               LENGTH=14,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='VENDOR STYLE.:'                                 00026   
VNDSTY  DFHMDF POS=(12,46),                                            X00027   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
*********************************************************************** 00010   
        DFHMDF POS=(13,31),                                            X00022   
               LENGTH=14,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='VENDOR NBR...:'                                 00026   
VNDNBR  DFHMDF POS=(13,46),                                            X00027   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
*********************************************************************** 00010   
        DFHMDF POS=(14,01),                                            X00022   
               LENGTH=16,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='CURRENT RETAIL.:'                               00026   
CURRTL  DFHMDF POS=(14,18),                                            X00027   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(14,31),                                            X00022   
               LENGTH=14,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='SETUP DATE...:'                                 00026   
SETDTE  DFHMDF POS=(14,46),                                            X00027   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(14,57),                                            X00022   
               LENGTH=12,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='GROUP CODE.:'                                   00026   
GRPCDE  DFHMDF POS=(14,71),                                            X00027   
               LENGTH=3,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
*********************************************************************** 00010   
        DFHMDF POS=(15,01),                                            X00022   
               LENGTH=16,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='GROUP RETAIL...:'                               00026   
GRPRTL  DFHMDF POS=(15,18),                                            X00027   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(15,31),                                            X00022   
               LENGTH=14,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='PRICE CHANGED:'                                 00026   
PRCDTE  DFHMDF POS=(15,46),                                            X00027   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(15,57),                                            X00022   
               LENGTH=12,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='STICKER NBR:'                                   00026   
STKNBR  DFHMDF POS=(15,71),                                            X00027   
               LENGTH=3,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
*********************************************************************** 00010   
        DFHMDF POS=(16,01),                                            X00022   
               LENGTH=16,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='ORIGINAL RETAIL:'                               00026   
ORGRTL  DFHMDF POS=(16,18),                                            X00027   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(16,31),                                            X00022   
               LENGTH=14,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='CURRENT COST.:'                                 00026   
CURCST  DFHMDF POS=(16,46),                                            X00027   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(16,57),                                            X00022   
               LENGTH=12,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='FIRST COST.:'                                   00026   
FIRCST  DFHMDF POS=(16,71),                                            X00027   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
*********************************************************************** 00010   
        DFHMDF POS=(18,01),                                            X00022   
               LENGTH=16,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='FIRST SALE.....:'                               00026   
FIRSAL  DFHMDF POS=(18,18),                                            X00027   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(18,31),                                            X00022   
               LENGTH=14,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='FIRST RECEIPT:'                                 00026   
FIRRCT  DFHMDF POS=(18,46),                                            X00027   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(18,57),                                            X00022   
               LENGTH=13,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='INNER PK QTY:'                                  00026   
INPQTY  DFHMDF POS=(18,72),                                            X00027   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
*********************************************************************** 00010   
        DFHMDF POS=(19,01),                                            X00022   
               LENGTH=16,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='LAST SALE......:'                               00026   
LSTSAL  DFHMDF POS=(19,18),                                            X00027   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(19,31),                                            X00022   
               LENGTH=14,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='LAST RECEIPT.:'                                 00026   
LSTRCT  DFHMDF POS=(19,46),                                            X00027   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
        DFHMDF POS=(19,57),                                            X00022   
               LENGTH=13,                                              X00023   
               ATTRB=(ASKIP,BRT),                                      X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='OUTER PK QTY:'                                  00026   
OTPQTY  DFHMDF POS=(19,72),                                            X00027   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
*********************************************************************** 00010   
        DFHMSD TYPE=FINAL                                               00075   
        PRINT NOGEN                                                     00076   
        END                                                             00077   
