***********************************************************************         
*   THIS IS THE MAPSET FOR THE REGIONAL CLEARANCE PRICE INQUIRY SCREEN.         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT  NOGEN                                                            
MHKM804 DFHMSD TYPE=DSECT,                                             X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               STORAGE=AUTO,                                           X        
               TERM=3270-2,                                            X        
               TIOAPFX=YES                                                      
****************************************************************                
MH804A  DFHMDI LINE=2,COLUMN=1,                                        X        
               SIZE=(19,80),                                           X        
               CTRL=(FREEKB),                                          X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
****************************************************************                
* LINE 1                                                                        
****************************************************************                
        DFHMDF POS=(01,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=NEUTRAL,INITIAL='ITEMS'                                    
ASTRTIT DFHMDF POS=(01,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(01,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(01,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(01,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(01,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
****************************************************************                
* LINE 2                                                                        
****************************************************************                
        DFHMDF POS=(02,02),LENGTH=11,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='DEPARTMENT:'                                            
ADEPT   DFHMDF POS=(02,14),LENGTH=03,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
        DFHMDF POS=(02,23),LENGTH=12,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='MAJOR CLASS:'                                           
AMJCLS  DFHMDF POS=(02,36),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
        DFHMDF POS=(02,49),LENGTH=12,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SUBCLASS...:'                                           
ASBCLS  DFHMDF POS=(02,62),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
****************************************************************                
* LINE 3                                                                        
****************************************************************                
        DFHMDF POS=(03,02),LENGTH=11,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SKU.......:'                                            
ASKU    DFHMDF POS=(03,14),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKUDSC DFHMDF POS=(03,23),LENGTH=25,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
        DFHMDF POS=(03,49),LENGTH=12,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='REG RTL AMT:'                                           
ARRAMT  DFHMDF POS=(03,62),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
****************************************************************                
* LINE 4                                                                        
* BLANK LINE                                                                    
****************************************************************                
****************************************************************                
* LINE 5                                                                        
****************************************************************                
        DFHMDF POS=(05,02),LENGTH=09,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CLEARANCE'                                              
        DFHMDF POS=(05,19),LENGTH=09,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CLEARANCE'                                              
        DFHMDF POS=(05,52),LENGTH=06,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='MARKET'                                                 
        DFHMDF POS=(05,69),LENGTH=09,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='EFFECTIVE'                                              
****************************************************************                
* LINE 6                                                                        
****************************************************************                
        DFHMDF POS=(06,02),LENGTH=05,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='STORE'                                                  
        DFHMDF POS=(06,19),LENGTH=07,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='RTL AMT'                                                
        DFHMDF POS=(06,31),LENGTH=10,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='METRO AREA'                                             
        DFHMDF POS=(06,48),LENGTH=02,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='ST'                                                     
        DFHMDF POS=(06,52),LENGTH=07,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CLUSTER'                                                
        DFHMDF POS=(06,69),LENGTH=04,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='DATE'                                                   
****************************************************************                
* LINE 7 - OCCURANCE 1                                                          
****************************************************************                
ASTR01  DFHMDF POS=(07,02),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASTNM01 DFHMDF POS=(07,08),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ARTL01  DFHMDF POS=(07,19),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMET01  DFHMDF POS=(07,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AST01   DFHMDF POS=(07,48),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMKCL01 DFHMDF POS=(07,52),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AEFDT01 DFHMDF POS=(07,69),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
****************************************************************                
* LINE 8 - OCCURANCE 2                                                          
****************************************************************                
ASTR02  DFHMDF POS=(08,02),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASTNM02 DFHMDF POS=(08,08),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ARTL02  DFHMDF POS=(08,19),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMET02  DFHMDF POS=(08,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AST02   DFHMDF POS=(08,48),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMKCL02 DFHMDF POS=(08,52),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AEFDT02 DFHMDF POS=(08,69),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
****************************************************************                
* LINE 9 - OCCURANCE 3                                                          
****************************************************************                
ASTR03  DFHMDF POS=(09,02),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASTNM03 DFHMDF POS=(09,08),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ARTL03  DFHMDF POS=(09,19),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMET03  DFHMDF POS=(09,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AST03   DFHMDF POS=(09,48),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMKCL03 DFHMDF POS=(09,52),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AEFDT03 DFHMDF POS=(09,69),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
****************************************************************                
* LINE 10- OCCURANCE 4                                                          
****************************************************************                
ASTR04  DFHMDF POS=(10,02),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASTNM04 DFHMDF POS=(10,08),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ARTL04  DFHMDF POS=(10,19),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMET04  DFHMDF POS=(10,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AST04   DFHMDF POS=(10,48),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMKCL04 DFHMDF POS=(10,52),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AEFDT04 DFHMDF POS=(10,69),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
****************************************************************                
* LINE 11- OCCURANCE 5                                                          
****************************************************************                
ASTR05  DFHMDF POS=(11,02),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASTNM05 DFHMDF POS=(11,08),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ARTL05  DFHMDF POS=(11,19),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMET05  DFHMDF POS=(11,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AST05   DFHMDF POS=(11,48),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMKCL05 DFHMDF POS=(11,52),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AEFDT05 DFHMDF POS=(11,69),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
****************************************************************                
* LINE 12- OCCURANCE 6                                                          
****************************************************************                
ASTR06  DFHMDF POS=(12,02),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASTNM06 DFHMDF POS=(12,08),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ARTL06  DFHMDF POS=(12,19),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMET06  DFHMDF POS=(12,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AST06   DFHMDF POS=(12,48),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMKCL06 DFHMDF POS=(12,52),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AEFDT06 DFHMDF POS=(12,69),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
****************************************************************                
* LINE 13- OCCURANCE 7                                                          
****************************************************************                
ASTR07  DFHMDF POS=(13,02),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASTNM07 DFHMDF POS=(13,08),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ARTL07  DFHMDF POS=(13,19),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMET07  DFHMDF POS=(13,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AST07   DFHMDF POS=(13,48),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMKCL07 DFHMDF POS=(13,52),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AEFDT07 DFHMDF POS=(13,69),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
****************************************************************                
* LINE 14- OCCURANCE 8                                                          
****************************************************************                
ASTR08  DFHMDF POS=(14,02),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASTNM08 DFHMDF POS=(14,08),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ARTL08  DFHMDF POS=(14,19),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMET08  DFHMDF POS=(14,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AST08   DFHMDF POS=(14,48),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMKCL08 DFHMDF POS=(14,52),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AEFDT08 DFHMDF POS=(14,69),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
****************************************************************                
* LINE 15- OCCURANCE 9                                                          
****************************************************************                
ASTR09  DFHMDF POS=(15,02),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASTNM09 DFHMDF POS=(15,08),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ARTL09  DFHMDF POS=(15,19),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMET09  DFHMDF POS=(15,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AST09   DFHMDF POS=(15,48),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMKCL09 DFHMDF POS=(15,52),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AEFDT09 DFHMDF POS=(15,69),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
****************************************************************                
* LINE 16- OCCURANCE 10                                                         
****************************************************************                
ASTR10  DFHMDF POS=(16,02),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASTNM10 DFHMDF POS=(16,08),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ARTL10  DFHMDF POS=(16,19),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMET10  DFHMDF POS=(16,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AST10   DFHMDF POS=(16,48),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMKCL10 DFHMDF POS=(16,52),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AEFDT10 DFHMDF POS=(16,69),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
****************************************************************                
* LINE 17- OCCURANCE 11                                                         
****************************************************************                
ASTR11  DFHMDF POS=(17,02),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASTNM11 DFHMDF POS=(17,08),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ARTL11  DFHMDF POS=(17,19),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMET11  DFHMDF POS=(17,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AST11   DFHMDF POS=(17,48),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMKCL11 DFHMDF POS=(17,52),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AEFDT11 DFHMDF POS=(17,69),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
****************************************************************                
* LINE 18- OCCURANCE 12                                                         
****************************************************************                
ASTR12  DFHMDF POS=(18,02),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASTNM12 DFHMDF POS=(18,08),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ARTL12  DFHMDF POS=(18,19),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMET12  DFHMDF POS=(18,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AST12   DFHMDF POS=(18,48),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMKCL12 DFHMDF POS=(18,52),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AEFDT12 DFHMDF POS=(18,69),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
****************************************************************                
* LINE 19- OCCURANCE 13                                                         
****************************************************************                
ASTR13  DFHMDF POS=(19,02),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASTNM13 DFHMDF POS=(19,08),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ARTL13  DFHMDF POS=(19,19),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMET13  DFHMDF POS=(19,31),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AST13   DFHMDF POS=(19,48),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AMKCL13 DFHMDF POS=(19,52),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AEFDT13 DFHMDF POS=(19,69),LENGTH=10,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
**************                                                                  
        DFHMSD TYPE=FINAL                                                       
**************                                                                  
        END                                                                     
