***********************************************************************         
*   THIS IS THE MAPSET FOR THE MERCHANDISE INQUIRY SKU SELECTION LIST           
*   SCREEN.                                                                     
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT  NOGEN                                                            
MHKM802 DFHMSD TYPE=DSECT,                                             X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               STORAGE=AUTO,                                           X        
               TERM=3270-2,                                            X        
               TIOAPFX=YES                                                      
**************                                                                  
MH802A  DFHMDI LINE=2,COLUMN=1,                                        X        
               SIZE=(19,80),                                           X        
               CTRL=(FREEKB),                                          X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
**************                                                                  
        DFHMDF POS=(01,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=NEUTRAL,INITIAL='ITEMS'                                    
ASTRTIT DFHMDF POS=(01,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(01,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(01,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(01,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(01,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
*                                                                               
        DFHMDF POS=(02,02),LENGTH=11,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='DEPARTMENT:'                                            
ADEPT   DFHMDF POS=(02,14),LENGTH=03,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ADPTDSC DFHMDF POS=(02,18),LENGTH=25,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
        DFHMDF POS=(02,44),LENGTH=12,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='MAJOR CLASS:'                                           
AMJCLS  DFHMDF POS=(02,57),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
        DFHMDF POS=(03,40),LENGTH=37,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='-------- VENDOR INFORMATION ---------'                  
*                                                                               
        DFHMDF POS=(04,01),LENGTH=01,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='S'                                                      
        DFHMDF POS=(04,03),LENGTH=02,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SC'                                                     
        DFHMDF POS=(04,06),LENGTH=08,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SKU'                                                    
        DFHMDF POS=(04,15),LENGTH=11,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='DESCRIPTION'                                            
        DFHMDF POS=(04,32),LENGTH=07,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CUR RTL'                                                
        DFHMDF POS=(04,40),LENGTH=04,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='NAME'                                                   
        DFHMDF POS=(04,59),LENGTH=05,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='STYLE'                                                  
        DFHMDF POS=(04,78),LENGTH=02,ATTRB=(PROT,NORM),                X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='ST'                                                     
*                                                                               
ASEL01  DFHMDF POS=(05,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
ASCL01  DFHMDF POS=(05,03),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKU01  DFHMDF POS=(05,06),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKDS01 DFHMDF POS=(05,15),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ACRTL01 DFHMDF POS=(05,31),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVNAM01 DFHMDF POS=(05,40),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVSTY01 DFHMDF POS=(05,59),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASTAT01 DFHMDF POS=(05,78),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASEL02  DFHMDF POS=(06,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
ASCL02  DFHMDF POS=(06,03),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKU02  DFHMDF POS=(06,06),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKDS02 DFHMDF POS=(06,15),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ACRTL02 DFHMDF POS=(06,31),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVNAM02 DFHMDF POS=(06,40),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVSTY02 DFHMDF POS=(06,59),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASTAT02 DFHMDF POS=(06,78),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASEL03  DFHMDF POS=(07,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
ASCL03  DFHMDF POS=(07,03),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKU03  DFHMDF POS=(07,06),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKDS03 DFHMDF POS=(07,15),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ACRTL03 DFHMDF POS=(07,31),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVNAM03 DFHMDF POS=(07,40),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVSTY03 DFHMDF POS=(07,59),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASTAT03 DFHMDF POS=(07,78),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASEL04  DFHMDF POS=(08,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
ASCL04  DFHMDF POS=(08,03),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKU04  DFHMDF POS=(08,06),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKDS04 DFHMDF POS=(08,15),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ACRTL04 DFHMDF POS=(08,31),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVNAM04 DFHMDF POS=(08,40),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVSTY04 DFHMDF POS=(08,59),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASTAT04 DFHMDF POS=(08,78),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASEL05  DFHMDF POS=(09,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
ASCL05  DFHMDF POS=(09,03),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKU05  DFHMDF POS=(09,06),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKDS05 DFHMDF POS=(09,15),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ACRTL05 DFHMDF POS=(09,31),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVNAM05 DFHMDF POS=(09,40),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVSTY05 DFHMDF POS=(09,59),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASTAT05 DFHMDF POS=(09,78),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASEL06  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
ASCL06  DFHMDF POS=(10,03),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKU06  DFHMDF POS=(10,06),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKDS06 DFHMDF POS=(10,15),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ACRTL06 DFHMDF POS=(10,31),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVNAM06 DFHMDF POS=(10,40),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVSTY06 DFHMDF POS=(10,59),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASTAT06 DFHMDF POS=(10,78),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASEL07  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
ASCL07  DFHMDF POS=(11,03),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKU07  DFHMDF POS=(11,06),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKDS07 DFHMDF POS=(11,15),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ACRTL07 DFHMDF POS=(11,31),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVNAM07 DFHMDF POS=(11,40),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVSTY07 DFHMDF POS=(11,59),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASTAT07 DFHMDF POS=(11,78),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASEL08  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
ASCL08  DFHMDF POS=(12,03),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKU08  DFHMDF POS=(12,06),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKDS08 DFHMDF POS=(12,15),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ACRTL08 DFHMDF POS=(12,31),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVNAM08 DFHMDF POS=(12,40),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVSTY08 DFHMDF POS=(12,59),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASTAT08 DFHMDF POS=(12,78),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASEL09  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
ASCL09  DFHMDF POS=(13,03),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKU09  DFHMDF POS=(13,06),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKDS09 DFHMDF POS=(13,15),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ACRTL09 DFHMDF POS=(13,31),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVNAM09 DFHMDF POS=(13,40),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVSTY09 DFHMDF POS=(13,59),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASTAT09 DFHMDF POS=(13,78),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASEL10  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
ASCL10  DFHMDF POS=(14,03),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKU10  DFHMDF POS=(14,06),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKDS10 DFHMDF POS=(14,15),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ACRTL10 DFHMDF POS=(14,31),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVNAM10 DFHMDF POS=(14,40),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVSTY10 DFHMDF POS=(14,59),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASTAT10 DFHMDF POS=(14,78),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASEL11  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
ASCL11  DFHMDF POS=(15,03),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKU11  DFHMDF POS=(15,06),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKDS11 DFHMDF POS=(15,15),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ACRTL11 DFHMDF POS=(15,31),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVNAM11 DFHMDF POS=(15,40),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVSTY11 DFHMDF POS=(15,59),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASTAT11 DFHMDF POS=(15,78),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASEL12  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
ASCL12  DFHMDF POS=(16,03),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKU12  DFHMDF POS=(16,06),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKDS12 DFHMDF POS=(16,15),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ACRTL12 DFHMDF POS=(16,31),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVNAM12 DFHMDF POS=(16,40),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVSTY12 DFHMDF POS=(16,59),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASTAT12 DFHMDF POS=(16,78),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASEL13  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
ASCL13  DFHMDF POS=(17,03),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKU13  DFHMDF POS=(17,06),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKDS13 DFHMDF POS=(17,15),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ACRTL13 DFHMDF POS=(17,31),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVNAM13 DFHMDF POS=(17,40),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVSTY13 DFHMDF POS=(17,59),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASTAT13 DFHMDF POS=(17,78),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASEL14  DFHMDF POS=(18,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
ASCL14  DFHMDF POS=(18,03),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKU14  DFHMDF POS=(18,06),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ASKDS14 DFHMDF POS=(18,15),LENGTH=15,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
ACRTL14 DFHMDF POS=(18,31),LENGTH=08,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVNAM14 DFHMDF POS=(18,40),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
AVSTY14 DFHMDF POS=(18,59),LENGTH=18,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
ASTAT14 DFHMDF POS=(18,78),LENGTH=02,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE                                                       
*                                                                               
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               X        
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'                
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               X        
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                                      
**************                                                                  
        DFHMSD TYPE=FINAL                                                       
**************                                                                  
        END                                                                     
