014200******************************************************            00010000
014201*  OUTPUT RECORD FOR SVC LEVEL DATA                               00020000
014202*  NOTE: THIS COPYBOOK HAS 2 MORE FIELDS THAN THE                 00030000
014203*  MHRD006 COPYBOOK - AS IT INCLUDES UPC STAT CDE                 00040002
014204*  AND INTR-UPC-ID                                                00050000
014204*  RECORD LENGTH = 40                                             00060002
014205******************************************************            00070000
014210 01  MH007-SVC-LVL-FINAL-RECORD.                                  00080001
014211     05  MH007-ITEM-NBR          PIC  S9(15)V COMP-3.             00090001
014213     05  MH007-LOC-NBR           PIC  S9(4) COMP.                 00100001
014215     05  MH007-ONHAND-QTY        PIC  S9(7)V COMP-3.              00110001
014216     05  MH007-INTR-UPC-ID       PIC  S9(09) COMP.                00120001
014217     05  MH007-UPC-STAT-CDE      PIC  X(02).                      00130001
014218     05  MH007-FT-CDE            PIC  X(1).                       00140001
014220     05  MH007-CSTOCK-QTY        PIC  S9(9)V COMP-3.              00150001
014230     05  MH007-USERMIN-QTY       PIC  S9(7)V COMP-3.              00160001
014251     05  MH007-MR-IND            PIC  X(1).                       00170001
035200         88  MH007-REPLENISHMENT-ITEM        VALUE 'Y'.           00180003
035300         88  MH007-NOT-REPLENISHMENT-ITEM    VALUE 'N'.           00190003
014251     05  FILLER                  PIC  X(9).                       00200002
014290*                                                                 00210000
