014200******************************************************            00010000
014201*  RECORD LAYOUT FOR DAILY EXTRACT PROCESS                        00020000
      *                                                                 00030000
014201*  RECORD LENGTH = 35                                             00040000
014202******************************************************            00050000
014210 01  MH006-SVC-LVL-DAILY-RECORD.                                  00060000
014211     05  MH006-ITEM-NBR          PIC  S9(15)V COMP-3.             00070000
014212     05  MH006-LOC-NBR           PIC  S9(5).                      00080003
014213     05  MH006-ONHAND-QTY        PIC  S9(7)V COMP-3.              00090000
014216     05  MH006-FT-CDE            PIC  X(01).                      00100000
014217     05  MH006-CSTOCK-QTY        PIC  S9(9)V COMP-3.              00110000
014218     05  MH006-USERMIN-QTY       PIC  S9(7)V COMP-3.              00120000
014219     05  MH006-MR-IND            PIC  X(01).                      00130000
014219     05  MH006-DAYS-OUT-STOCK    PIC  S9(3) COMP-3.               00140002
014219     05  MH006-DAYS-BELOW-MIN    PIC  S9(3) COMP-3.               00150002
014219     05  MH006-SKU-STATUS        PIC  X(02).                      00160000
014219     05  FILLER                  PIC  X(01).                      00170003
