014200******************************************************            00010000
014201*  OUTPUT RECORD FOR SERVICE LEVEL ITEM STORE LIST                00020005
014204*  RECORD LENGTH = 40                                             00030004
014205******************************************************            00040000
014210 01  MH008-SVC-LEVEL-DATA-RECORD.                                 00050005
 14211     05  MH008-ITEM-NBR          PIC  S9(15)V COMP-3.             00060001
014213     05  MH008-LOC-NBR           PIC  S9(5).                      00070003
014216     05  MH008-CW-SKU-ID         PIC  9(10).                      00080000
014218     05  MH008-CW-LOC-ID         PIC  9(10).                      00090000
014217     05  MH008-STATUS-CODE       PIC  X(02).                      00100000
014230     05  MH008-REPLNMT-IND       PIC  X(01).                      00110000
014251     05  MH008-DAYS-OUT-STOCK    PIC  S9(3) COMP-3.               00120004
014251     05  MH008-DAYS-BELOW-MIN    PIC  S9(3) COMP-3.               00130004
014290*                                                                 00140000
