000100******************************************************************00010000
000200*  INPUT RECORD FOR TMRITST/TMRITEM UNLOAD FILE                   00020000
000300******************************************************************00030000
001297 01  MH005-MR-UNLOAD-RECORD.                                      00040002
001299     05  MH005-ITEM-NBR    PIC  S9(15)V COMP-3.                   00050001
001300     05  MH005-STR-NBR     PIC  S9(4) COMP.                       00060001
001301     05  MH005-FT-CDE      PIC  X(01).                            00070001
001302     05  MH005-CSTOCK-QTY  PIC  S9(9)V COMP-3.                    00080001
001303     05  MH005-USERMIN-QTY PIC  S9(7)V COMP-3.                    00090001
001304     05  MH005-RT-NBR      PIC  S9(3)V COMP-3.                    00100001
001305     05  MH005-RT-DAY-NBR  PIC  S9(3)V COMP-3.                    00110001
001306*                                                                 00120000
