           EJECT                                                                
      *****************************************************************         
      *                        MHWS000                                *         
      *****************************************************************         
      *  THIS COPYBOOK CONTAINS THE COMMON DATA TO BE SHARED BY ALL   *         
      *  MODULES IN THE MERCHANDISE INQUIRY SYSTEMS.                  *         
      *                                                               *         
      *****************************************************************         
      *  CHANGE LOG:                                                  *         
      *                                                               *         
      *  07/29/04 - MARIA KLAMIK                                      *         
      *             (WR #26354) NEW APPLICATION SPECIFIC COMMAREA.    *         
      *                                                               *         
      *****************************************************************         
           05  MH000-CA-RDF REDEFINES DP020-VARIABLE-COMMAREA.                  
                                                                                
               10  MH000-INTER-APPL-COMMAREA       PIC X(200).                  
                                                                                
               10  MH000-MERCHANDISE-COMMAREA REDEFINES                         
                   MH000-INTER-APPL-COMMAREA.                                   
                   15  MH000-DP020-FILLER          PIC X(1).                    
                   15  MH000-SKU-STORE             PIC X(20).                   
                   15  MH000-SKU-STORE-RDF   REDEFINES MH000-SKU-STORE.         
                     20  MH000-DEPT-NUMBER-X       PIC X(3).                    
                     20  MH000-DEPT-NUMBER-9 REDEFINES                          
                          MH000-DEPT-NUMBER-X      PIC 9(3).                    
                     20  MH000-MCL-NUMBER-X        PIC X(2).                    
                     20  MH000-MCL-NUMBER-9  REDEFINES                          
                          MH000-MCL-NUMBER-X       PIC 9(2).                    
                     20  MH000-SCL-NUMBER-X        PIC X(2).                    
                     20  MH000-SCL-NUMBER-9  REDEFINES                          
                          MH000-SCL-NUMBER-X       PIC 9(2).                    
                     20  MH000-SKU-NUMBER-X        PIC X(8).                    
                     20  MH000-SKU-NUMBER-9 REDEFINES                           
                          MH000-SKU-NUMBER-X       PIC 9(8).                    
                     20  MH000-STORE-NUMBER-X      PIC X(5).                    
                     20  MH000-STORE-NUMBER-9 REDEFINES                         
                         MH000-STORE-NUMBER-X      PIC 9(5).                    
                   15  MH000-UPC-NUMBER-X          PIC X(14).                   
                   15  MH000-UPC-NUMBER REDEFINES                               
                       MH000-UPC-NUMBER-X          PIC 9(14).                   
                   15  MH000-ITEM-NUMBER           PIC S9(15) COMP-3.           
                   15  MH000-DEPT-NAME             PIC X(25).                   
                   15  MH000-CLASS-DESCRIPTION     PIC X(25).                   
                   15  MH000-SKU-DESCRIPTION       PIC X(25).                   
                   15  MH000-STORE-NAME            PIC X(25).                   
                   15  MH000-STORE-SHORT-NAME      PIC X(10).                   
      *-->         THIS IS THE AREA THAT IS POPULATED BY LIST PROGRAMS          
      *-->         AND READ BY DETAIL PROGRAMS.                                 
                   15  MH000-TS-SELECTION-DATA.                                 
                       20  MH000-SEL-QUEUE-NAME    PIC X(8).                    
                       20  MH000-SEL-QUEUE-RDF REDEFINES                        
                            MH000-SEL-QUEUE-NAME.                               
                           25  MH000-TS-TERM-ID    PIC X(04).                   
                           25  MH000-TS-TASK-NMBR  PIC S9(05) COMP-3.           
                           25  MH000-TS-SEQ        PIC 9(01).                   
      *-->                     1=USED INTERNALLY BE LIST PROGRAMS               
                               88  MH000-TS-LIST-QUEUE     VALUE 1.             
      *-->                     2=USED BY DETAIL SCREENS.  CONTAINS ITEMS        
      *-->                       SELECTED IN LIST PROGRAM                       
                               88  MH000-TS-SELECTED-ITEMS VALUE 2.             
      *-->                     3=COMMON DATA PASSED FROM PGM TO PGM             
                               88  MH000-TS-SHARED-DATA    VALUE 3.             
      *-->                     4=THE ORIGINAL KEY ENTERED ON A CRITERIA         
      *-->                       SCREEN.                                        
                               88  MH000-TS-MHWS000-KEY    VALUE 4.             
                       20  MH000-NUMBER-OF-SELECTED-ITEMS                       
                                                   PIC S9(04) COMP.             
                       20  MH000-NUMBER-OF-TS-ITEMS                             
                                                   PIC S9(04) COMP.             
                       20  MH000-TS-ITEM-NUMBER    PIC S9(04) COMP.             
                       20  MH000-MH001-IDX         PIC S9(04) COMP.             
      *-->             KEEP THIS FIELD SEPARATE FROM DP020-INT-APPL-            
      *-->             FORMAT-IND.  WHEN DP020-NEXT-ACT-INITIAL, MOVE           
      *-->             DP020-INT-APPL-FORMAT-IND TO THIS FIELD, OTHER-          
      *-->             WISE, LEAVE IT ALONE.                                    
                   15  MH000-DP020-FORMAT-IND      PIC X(1).                    
                   15  FILLER                      PIC X(30).                   
      *****************************************************************         
      *                                                               *         
      *   PLACE COMMAREA SPECIFIC TO YOUR PROGRAM/SUBSYSTEM HERE.     *         
      *   THE GROUP LEVEL(S) MUST BE '10'.  THERE ARE 2,663 BYTES     *         
      *   AVAILABLE FOR PROGRAM SPECIFIC COMMAREA.                    *         
      *                                                               *         
      *****************************************************************         
