000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.         MLKRP800.                                    00020000
000300 AUTHOR.             PAUL KEBER - STRATAGEM.                      00030000
000400 INSTALLATION.       KOHLS DEPARTMENT STORE.                      00040000
000500 DATE-WRITTEN.       05-07-99.                                    00050000
000600 DATE-COMPILED.                                                   00060000
000700******************************************************************00070000
000800*   MLKRP800 - PRODUCE THE VENDOR ANALYSIS DETAIL REPORT BY      *00080000
000900*              DEPARTMENT/VENDOR/MAJOR CLASS.                    *00090000
001000*   WR# 10587                                                    *00100000
001100******************************************************************00110000
001200*   READ THE DETAIL REPORT DATA FILE AND PRINT THE DETAIL REPORT.*00120000
001300*   THE FILE WILL CONTAIN VENDOR DATA BETWEEN THE FIRST MONTH    *00130000
001400*   OF THE CURRENT FISCAL SEASON AND THE CURRENT FISCAL MONTH OF *00140000
001500*   THE CURRENT FISCAL YEAR.  AN INPUT CONTROL CARD CONTAINING   *00150000
001600*   THE END FISCAL MONTH DATE MAY BE USED TO OVERRIDE THE        *00160000
001700*   TMLCNTL AND TDTATTR CURRENT MONTH INFO.                      *00170000
001800*                                                                *00180000
001900*   THE PAGE HEADER WILL DISPLAY THE CALENDAR MONTHS DATE RANGE  *00190000
002000*   (I.E. 02/1999 THRU 05/1999).  THIS REPORT USES 1 PAGE PER    *00200000
002100*   DEPARTMENT VENDOR#.  DATA FOR THE WHOLE DATE-RANGE (SEASON-  *00210000
002200*   -TO-DATE) WILL BE PRINTED ON THE FIRST PAGE, WHILE THE DATA  *00220000
002300*   FOR THE CURRENT MONTH WILL BE PRINTED ON THE FOLLOWING PAGE. *00230000
002400*   FORMAT-WISE, BOTH YEAR-TO-DATE AND CURRENT MONTH PAGES WILL  *00240000
002500*   BE THE SAME.  BOTH WILL HAVE DATA FOR ITS CORRESPONDING      *00250000
002600*   PERIOD FROM THE PREVIOUS YEAR.                               *00260000
002700*                                                                *00270000
002800*   AT THE END OF THE REPORT, A TOTAL REPORT PAGE WILL BE        *00280000
002900*   PRINTED.                                                     *00290000
003000******************************************************************00300000
003100*   DATE: 06/17/99       CHANGE ID: WR10587    WHO: P. KEBER      00310000
003200*   REASON FOR CHANGE : CHANGED FROM YEAR-TO-DATE TO SEASON-TO-   00320000
003300*                       DATE REPORTING.                           00330000
003400*                                                                 00340000
003500*   DATE: 07/23/99       CHANGE ID: WR10587    WHO: P. KEBER      00350000
003600*   REASON FOR CHANGE : REMOVE DISCOUNT COST; PLACE FREIGHT COST  00360000
003700*                       WITH COST PURCHASE ADJUSTMENT; REPORT     00370000
003800*                       VENDORS WITH THIS YEAR AND LAST YEAR TOTAL00380000
003900*                       SALES $5000 AND UNDER ON THE MISCELLANEOUS00390000
004000*                       VENDOR REPORT PAGES.                      00400000
004100*                                                                 00410000
004200*   DATE: 08/19/1999     CHANGE ID: WR10587    WHO: B.MCASEY     *00420000
004300*   REASON FOR CHANGE : CHANGED REPORT TO SHOW RECEIPT COST/RTL  *00430000
004400*   AND PURCHASE ADJ COST/RTL INSTEAD OF GROSS COST, COST PURCH  *00440000
004500*   ADJ, NET COST AND RETAIL PURCHASES.                          *00450000
004600*                                                                *00460000
004700*   DATE: 09/09/1999     CHANGE ID: WR10587    WHO: B.MCASEY     *00470000
004800*   REASON FOR CHANGE : CHANGED REPORT TOTALS TO NOT INCLUDE THE *00480000
004900*   UNKNOWN VENDOR IN THE GROSS MARGIN, CUM MARKUP.              *00490000
005000*                                                                *00500000
005100*   DATE: 10/18/1999     CHANGE ID:            WHO: B.MCASEY     *00510000
005200*   REASON FOR CHANGE : CHANGED REPORT TO NOT INCLUDE UNKNOWN    *00520000
005300*   VENDOR IN THE MISCELLANEOUS TOTALS.                          *00530000
005400*                                                                *00540000
005500*   DATE: 01/06/2000     CHANGE ID:            WHO: B.MCASEY     *00550000
005600*   REASON FOR CHANGE : CHANGED REPORT TO ONLY INCLUDE 1999 DATA *00560000
005700*   UNDER THE LAST YEAR COLUMN TOTALS FOR RECEIPTS AND SALES     *00570000
005800*                                                                *00580000
005900*   DATE: 01/25/2000     CHANGE ID:            WHO: J.SHIFF 0101 *00590000
006000*   REASON FOR CHANGE : CREATE A NEW TOTAL PAGE AT END OF REPORT *00600000
006100*   FOR CURRENT MONTH. REMOVE MARKON PERCENT IN OTHER INFO CLASS.*00610000
006200*                                                                *00620000
006300*   DATE: 03/10/2000     CHANGE ID:            WHO: B MCASEY     *00630000
006400*   REASON FOR CHANGE : PROGRAM WAS NOT ALWAYS PRINTING OUT THE  *00640000
006500*   FIRST CLASS WITHIN A VENDOR. MODIFIED LOGIC IN 2000 TO       *00650000
006600*   CORRECT THIS.                                                *00660000
006610*                                                                *00661000
006620*   DATE: 01/09/2001     CHANGE ID:            WHO: D METZGER    *00662000
006630*   REASON FOR CHANGE : PROGRAM WAS NOT GETTING A VALID LY THIS  *00663000
006640*   DAY DATE WHEN THE CURRENT YR HAD 53 WEEKS AND WE WERE IN THE *00664000
006650*   LAST MONTH OR THE YEAR.  ADDED 7125- TO GET THE VALID        *00665000
006651*   LY-THIS-DAY WHEN THE LY-THIS-DAY DATE IS 9999-09-09 FROM     *00665100
006652*   7100- CALL.                                                  *00665200
W02191*                                                                *00665300
  |   *   DATE: 02/19/2001     CHANGE ID: 99999      WHO: ROD JANSSEN  *00665400
  |   * CHANGE DATE CONTROL LOGIC TO USE THE POSTING FISCAL MTH DATE   *00665500
  |   * IN PLACE OF THE OPEN FISCAL MTH DATE.                          *00665600
C14666*                                                                *00665701
C14666* DATE: 07/10/2012  CHANGE ID: CRQ000000014666  WHO: RAVI GUNTHA *00665805
C14666* REASON FOR CHANGE : CHANGES MADE TO SHOW SHRINK PERCENTAGE     *00666001
C14666* WITH 2 DECIMAL POSITIONS AND REDUCED 1 SPACE IN THE REPORT     *00666104
C14666* AFTER 'SHRINK PERCENT'                                         *00666204
W02191******************************************************************00666501
006800                                                                  00666601
006900 ENVIRONMENT DIVISION.                                            00666701
007000 CONFIGURATION SECTION.                                           00666801
007100 SOURCE-COMPUTER.    IBM-3090.                                    00667000
007200 OBJECT-COMPUTER.    IBM-3090.                                    00668000
007300                                                                  00669000
007400 INPUT-OUTPUT SECTION.                                            00670000
007500 FILE-CONTROL.                                                    00680000
007600                                                                  00690000
007700     SELECT VA-REPORT-EXTRACT-FILE                                00700000
007800         ASSIGN TO INP01.                                         00710000
007900     SELECT REPORT-FILE                                           00720000
008000         ASSIGN TO RPT01.                                         00730000
008100/                                                                 00740000
008200 DATA DIVISION.                                                   00750000
008300                                                                  00760000
008400 FILE SECTION.                                                    00770000
008500                                                                  00780000
008600 FD  VA-REPORT-EXTRACT-FILE                                       00790000
008700     RECORDING MODE IS F                                          00800000
008800     LABEL RECORDS ARE STANDARD                                   00810000
008900     RECORD CONTAINS 660 CHARACTERS                               00820000
009000     BLOCK CONTAINS 0  RECORDS                                    00830000
009100     DATA RECORD IS VA-REPORT-EXTRACT-RECORD.                     00840000
009200 01  VA-REPORT-EXTRACT-RECORD      PIC X(660).                    00850000
009300                                                                  00860000
009400 FD  REPORT-FILE                                                  00870000
009500     RECORDING MODE IS F                                          00880000
009600     LABEL RECORDS ARE STANDARD                                   00890000
009700     RECORD CONTAINS 200 CHARACTERS                               00900000
009800     BLOCK CONTAINS 0  RECORDS                                    00910000
009900     DATA RECORD IS RR-REPORT-RECORD.                             00920000
010000 01  RR-REPORT-RECORD              PIC X(200).                    00930000
010100                                                                  00940000
010200/                                                                 00950000
010300 WORKING-STORAGE SECTION.                                         00960000
010400                                                                  00970000
010500 01  PA-PROGRAM-ACCUMULATORS.                                     00980000
010600     05  PA-IN-COUNT               PIC S9(9)     VALUE 0          00990000
010700                                                 COMP-3.          01000000
010800     05  PA-LINE-COUNT             PIC S9(3)     VALUE 0          01010000
010900                                                 COMP-3.          01020000
011000     05  PA-LINE-NO                PIC S9(3)     VALUE 0          01030000
011100                                                 COMP-3.          01040000
011200     05  PA-PAGE-COUNT             PIC S9(5)     VALUE 0          01050000
011300                                                 COMP-3.          01060000
011400     05  PA-SUB                    PIC S9(3)     VALUE 0          01070000
011500                                                 COMP-3.          01080000
011600     05  PA-DEPT-SUB               PIC S9(3)     VALUE 0          01090000
011700                                                 COMP-3.          01100000
011800                                                                  01110000
011900 01  PC-PROGRAM-CONSTANTS.                                        01120000
012000     05  PC-PROGRAM-NAME           PIC X(10)   VALUE 'MLKRP800  '.01130000
012100     05  PC-MAX-LINE               PIC 99        VALUE 55.        01140000
012200     05  PC-100                    PIC S9(3)V99  VALUE +100.00.   01150000
012300     05  PC-1000                   PIC S9(4)V99  VALUE +1000.00.  01160000
012400     05  PC-MIN-TOTAL-SALES        PIC S9(11)V99 VALUE +5000      01170000
012500                                                 COMP-3.          01180000
012600     05  PC-UNKNOWN-VENDOR         PIC S9(09)    VALUE 5161       01190000
012700                                                 COMP.            01200000
012800     05  PC-TOTAL                  PIC X(20)   VALUE              01210000
012900         '               TOTAL'.                                  01220000
013000     05  PC-END-OF-REPORT          PIC X(13)   VALUE              01230000
013100         'END OF REPORT'.                                         01240000
013200     05  PC-REPORT-TOTAL           PIC X(13)   VALUE              01250000
013300         'REPORT TOTAL '.                                         01260000
013400     05  PC-REPORT-MONTH           PIC X(26)   VALUE              01270000
013500         'CURRENT MONTH REPORT TOTAL'.                            01280000
013600     05  PC-1998                   PIC 9(04)   VALUE              01290000
013700         1998.                                                    01300000
013800     05  PC-1999                   PIC 9(04)   VALUE              01310000
013900         1999.                                                    01320000
014000/                                                                 01330000
014100 01  PI-PROGRAM-INDICATORS.                                       01340000
014200     05  PI-INPUT-EOF-IND          PIC X(01)   VALUE 'N'.         01350000
014300         88  PI-INPUT-EOF                      VALUE 'Y'.         01360000
014400     05  PI-FIRST-TIME-IND         PIC X(01)   VALUE 'Y'.         01370000
014500         88  PI-NOT-FIRST-TIME                 VALUE 'N'.         01380000
014600     05  PI-PRINT-IND              PIC X(01)   VALUE 'F'.         01390000
014700         88  PI-PRINT-BACK                     VALUE 'B'.         01400000
014800         88  PI-PRINT-FRONT                    VALUE 'F'.         01410000
014900         88  PI-PRINT-BOTH                     VALUE 'H'.         01420000
015000     05  PI-PRINT-DETAIL-IND       PIC X(01)   VALUE 'Y'.         01430000
015100         88  PI-PRINT-DETAIL                   VALUE 'Y'.         01440000
015200         88  PI-NO-PRINT-DETAIL                VALUE 'N'.         01450000
015300                                                                  01460000
015400 01  PT-PROGRAM-TABLE.                                            01470000
015500     05  PT-REPORT-LINES.                                         01480000
015600         10  PT-REPORT-LINE        PIC X(200)  OCCURS 80.         01490000
015700*                                                                 01500000
015800 01  PV-PROGRAM-VARIABLES.                                        01510000
015900     05  PV-HDG-DATE-TY.                                          01520000
016000         10  FILLER                PIC X(01)   VALUE ' '.         01530000
016100         10  PV-HDG-START-MM-TY    PIC 9(02)   VALUE 0.           01540000
016200         10  FILLER                PIC X(01)   VALUE '/'.         01550000
016300         10  PV-HDG-START-CCYY-TY  PIC 9(04)   VALUE 0.           01560000
016400         10  FILLER                PIC X(06)   VALUE ' THRU '.    01570000
016500         10  PV-HDG-END-MM-TY      PIC 9(02)   VALUE 0.           01580000
016600         10  FILLER                PIC X(01)   VALUE '/'.         01590000
016700         10  PV-HDG-END-CCYY-TY    PIC 9(04)   VALUE 0.           01600000
016800         10  FILLER                PIC X(02)   VALUE ' -'.        01610000
016900     05  PV-HDG-DATE-LY.                                          01620000
017000         10  FILLER                PIC X(1)    VALUE ' '.         01630000
017100         10  PV-HDG-START-MM-LY    PIC 9(02)   VALUE 0.           01640000
017200         10  FILLER                PIC X(01)   VALUE '/'.         01650000
017300         10  PV-HDG-START-CCYY-LY  PIC 9(04)   VALUE 0.           01660000
017400         10  FILLER                PIC X(06)   VALUE ' THRU '.    01670000
017500         10  PV-HDG-END-MM-LY      PIC 9(02)   VALUE 0.           01680000
017600         10  FILLER                PIC X(01)   VALUE '/'.         01690000
017700         10  PV-HDG-END-CCYY-LY    PIC 9(04)   VALUE 0.           01700000
017800         10  FILLER                PIC X(02)   VALUE ' -'.        01710000
017900     05  PV-MON-DATE-TY.                                          01720000
018000         10  FILLER                PIC X(01)   VALUE ' '.         01730000
018100         10  PV-MON-START-MM-TY    PIC 9(02)   VALUE 0.           01740000
018200         10  FILLER                PIC X(01)   VALUE '/'.         01750000
018300         10  PV-MON-START-CCYY-TY  PIC 9(04)   VALUE 0.           01760000
018400         10  FILLER                PIC X(06)   VALUE ' THRU '.    01770000
018500         10  PV-MON-END-MM-TY      PIC 9(02)   VALUE 0.           01780000
018600         10  FILLER                PIC X(01)   VALUE '/'.         01790000
018700         10  PV-MON-END-CCYY-TY    PIC 9(04)   VALUE 0.           01800000
018800         10  FILLER                PIC X(02)   VALUE ' -'.        01810000
018900     05  PV-MON-DATE-LY.                                          01820000
019000         10  FILLER                PIC X(1)    VALUE ' '.         01830000
019100         10  PV-MON-START-MM-LY    PIC 9(02)   VALUE 0.           01840000
019200         10  FILLER                PIC X(01)   VALUE '/'.         01850000
019300         10  PV-MON-START-CCYY-LY  PIC 9(04)   VALUE 0.           01860000
019400         10  FILLER                PIC X(06)   VALUE ' THRU '.    01870000
019500         10  PV-MON-END-MM-LY      PIC 9(02)   VALUE 0.           01880000
019600         10  FILLER                PIC X(01)   VALUE '/'.         01890000
019700         10  PV-MON-END-CCYY-LY    PIC 9(04)   VALUE 0.           01900000
019800         10  FILLER                PIC X(02)   VALUE ' -'.        01910000
019900     05  PV-CAL-LY-END-CCYY        PIC 9(04)   VALUE  0.          01920000
020000     05  PV-CAL-LY-END-MONTH       PIC 9(02)   VALUE  0.          01930000
020100     05  PV-CAL-TY-BEG-MONTH       PIC 9(02)   VALUE  0.          01940000
020200     05  PV-CAL-TY-END-CCYY        PIC 9(04)   VALUE  0.          01950000
020300     05  PV-CAL-TY-END-MONTH       PIC 9(02)   VALUE  0.          01960000
020400     05  PV-FISCAL-LY-CCYY         PIC 9(04)   VALUE  0.          01970000
020500     05  PV-FISCAL-LY-END-MONTH    PIC 9(02)   VALUE  0.          01980000
020600     05  PV-FISCAL-TY-BEG-MONTH    PIC 9(02)   VALUE  0.          01990000
020700     05  PV-FISCAL-TY-CCYY         PIC 9(04)   VALUE  0.          02000000
020800     05  PV-FISCAL-TY-END-MONTH    PIC 9(02)   VALUE  0.          02010000
020900     05  PV-INPUT-MONTH            PIC 9(02)   VALUE  0.          02020000
021000     05  PV-PERCENT                PIC S9(4)V9 VALUE  0.          02030000
C14666     05  PV-SHK-PERCENT            PIC S9(4)V99  VALUE  0.        02031001
021100     05  PV-TOTAL-SALES-LY         PIC S9(11)V99 VALUE +0 COMP-3. 02040000
021200     05  PV-TOTAL-SALES-TY         PIC S9(11)V99 VALUE +0 COMP-3. 02050000
021300     05  PV-TOTAL-MKDN-LY          PIC S9(11)V99 VALUE +0 COMP-3. 02060000
021400     05  PV-TOTAL-MKDN-TY          PIC S9(11)V99 VALUE +0 COMP-3. 02070000
021500     05  PV-NET-COST-LY            PIC S9(11)V99 VALUE +0 COMP-3. 02080000
021600     05  PV-NET-COST-TY            PIC S9(11)V99 VALUE +0 COMP-3. 02090000
021700     05  PV-RETAIL-PURCH-LY        PIC S9(11)V99 VALUE +0 COMP-3. 02100000
021800     05  PV-RETAIL-PURCH-TY        PIC S9(11)V99 VALUE +0 COMP-3. 02110000
021900     05  PV-PURCH-ADJ-RTL-TY       PIC S9(11)V99 VALUE +0 COMP-3. 02120000
022000     05  PV-PURCH-ADJ-RTL-LY       PIC S9(11)V99 VALUE +0 COMP-3. 02130000
022100     05  PV-CUM-TO-DATE-PURCH-RETAIL-TY                           02140000
022200                                   PIC S9(11)V99 VALUE +0 COMP-3. 02150000
022300     05  PV-CUM-TO-DATE-PURCH-RETAIL-LY                           02160000
022400                                   PIC S9(11)V99 VALUE +0 COMP-3. 02170000
022500     05  PV-CUM-TO-DATE-PURCH-COST-TY                             02180000
022600                                   PIC S9(11)V99 VALUE +0 COMP-3. 02190000
022700     05  PV-CUM-TO-DATE-PURCH-COST-LY                             02200000
022800                                   PIC S9(11)V99 VALUE +0 COMP-3. 02210000
022900     05  PV-OPN-FSCL-MN-DTE        PIC X(10)   VALUE  SPACES.     02220000
023000/                                                                 02230000
023100 01  SA-SAVE-AREA.                                                02240000
023200     05  SA-CLASS.                                                02250000
023300         10  SA-MJ-CLS            PIC 9      VALUE ZERO.          02260000
023400         10  FILLER               PIC X      VALUE ZERO.          02270000
023500     05  SA-DEPT-NMBR             PIC 9(03)  VALUE ZERO.          02280000
023600     05  SA-ENT-ID                PIC S9(9)  VALUE +0 COMP.       02290000
023700     05  SAVE-DEPT-NMBR           PIC 9(03)  VALUE ZERO.          02300000
023800                                                                  02310000
023900 01  CC-CONTROL-CARD.                                             02320000
024000     05  CC-FISCAL-END-DATE                    VALUE SPACES.      02330000
024100         10  CC-FISCAL-END-YEAR    PIC 9(04).                     02340000
024200         10  CC-FISCAL-END-DSH1    PIC X(01).                     02350000
024300         10  CC-FISCAL-END-MONTH   PIC 9(02).                     02360000
024400         10  CC-FISCAL-END-DSH2    PIC X(01).                     02370000
024500         10  CC-FISCAL-END-DAY     PIC 9(02).                     02380000
024600     05  FILLER                    PIC X(70)   VALUE SPACES.      02390000
024700*                                                                 02400000
024800*   DETAIL REPORT FILE LAYOUT                                     02410000
024900     COPY MLRD202.                                                02420000
025000/                                                                 02430000
025100*  KOHL'S STANDARD FIRST HEADING LINE                             02440000
025200     COPY DPWS200O.                                               02450000
025300*                                                                 02460000
025400 01  H2-HEADING2A.                                                02470000
025500     05  FILLER                    PIC X(92)   VALUE SPACES.      02480000
025600     05  FILLER                    PIC X(15)   VALUE              02490000
025700     'VENDOR ANALYSIS'.                                           02500000
025800     05  FILLER                    PIC X(93)   VALUE SPACES.      02510000
025900*                                                                 02520000
026000 01  H2-HEADING2B.                                                02530000
026100     05  FILLER                    PIC X(82)   VALUE SPACES.      02540000
026200     05  FILLER                    PIC X(36)   VALUE              02550000
026300     'DETAIL VENDOR ANALYSIS BY DEPARTMENT'.                      02560000
026400     05  FILLER                    PIC X(82)   VALUE SPACES.      02570000
026500*                                                                 02580000
026600 01  H3-HEADING3.                                                 02590000
026700     05  FILLER                    PIC X(83)   VALUE SPACES.      02600000
026800     05  FILLER                    PIC X(36)   VALUE              02610000
026900     'MANAGER/BUYER/DEPT/VENDOR NAME SEQ'.                        02620000
027000     05  FILLER                    PIC X(81)   VALUE SPACES.      02630000
027100*                                                                 02640000
027200*                                                                 02650000
027300/                                                                 02660000
027400 01  H4-HEADING4A.                                                02670000
027500     05  FILLER                    PIC X(17)   VALUE              02680000
027600         'MANAGER        : '.                                     02690000
027700     05  H4-MANAGER-NMBR           PIC X(02)   VALUE SPACES.      02700000
027800     05  FILLER                    PIC X(03)   VALUE ' - '.       02710000
027900     05  H4-MANAGER-NAME           PIC X(30)   VALUE SPACES.      02720000
028000     05  FILLER                    PIC X(39)   VALUE SPACES.      02730000
028100     05  FILLER                    PIC X(17)   VALUE              02740000
028200         'DEPARTMENT REPORT'.                                     02750000
028300     05  FILLER                    PIC X(92)   VALUE SPACES.      02760000
028400*                                                                 02770000
028500 01  H4-HEADING4B.                                                02780000
028600     05  FILLER                    PIC X(17)   VALUE              02790000
028700         'BUYER          : '.                                     02800000
028800     05  H4-BUYER-NMBR             PIC X(03)   VALUE SPACES.      02810000
028900     05  FILLER                    PIC X(03)   VALUE ' - '.       02820000
029000     05  H4-BUYER-NAME             PIC X(30)   VALUE SPACES.      02830000
029100     05  FILLER                    PIC X(147)  VALUE SPACES.      02840000
029200*                                                                 02850000
029300 01  H4-HEADING4C.                                                02860000
029400     05  FILLER                    PIC X(17)   VALUE              02870000
029500         'DEPARTMENT     : '.                                     02880000
029600     05  H4-DEPT-NMBR              PIC X(03)   VALUE SPACES.      02890000
029700     05  FILLER                    PIC X(03)   VALUE ' - '.       02900000
029800     05  H4-DEPT-DESC              PIC X(25)   VALUE SPACES.      02910000
029900     05  FILLER                    PIC X(152)  VALUE SPACES.      02920000
030000*                                                                 02930000
030100 01  H5-HEADING5.                                                 02940000
030200     05  FILLER                    PIC X(17)   VALUE              02950000
030300         'VENDOR         : '.                                     02960000
030400     05  H5-VENDOR-NAME            PIC X(30)   VALUE SPACES.      02970000
030500     05  FILLER                    PIC X(126)  VALUE SPACES.      02980000
030600*                                                                 02990000
030700 01  H6-HEADING6.                                                 03000000
030800     05  FILLER                    PIC X(15)   VALUE SPACES.      03010000
030900     05  FILLER                    PIC X(40)   VALUE              03020000
031000         '      |---------------------------------'.              03030000
031100     05  H6-DATE-RANGE-TY          PIC X(23).                     03040000
031200     05  FILLER                    PIC X(40)   VALUE              03050000
031300         '----------------------------------------'.              03060000
031400     05  FILLER                    PIC X(36)   VALUE              03070000
031500         '--------|---------------------------'.                  03080000
031600     05  H6-DATE-RANGE-LY          PIC X(23).                     03090000
031700     05  FILLER                    PIC X(23)   VALUE              03100000
031800         '----------------------|'.                               03110000
031900/                                                                 03120000
032000 01  H7-HEADING7A.                                                03130000
032100     05  FILLER                    PIC X(23)   VALUE              03140000
032200         'PURCHASES        '.                                     03150000
032300*    05  FILLER                    PIC X(10)   VALUE              03160000
032400*        '  GROSS   '.                                            03170000
032500*    05  FILLER                    PIC X(10)   VALUE              03180000
032600*        '  COST    '.                                            03190000
032700*    05  FILLER                    PIC X(10)   VALUE              03200000
032800*        '   NET    '.                                            03210000
032900*    05  FILLER                    PIC X(10)   VALUE              03220000
033000*        '  RETAIL  '.                                            03230000
033100     05  FILLER                    PIC X(05) VALUE                03240000
033200         '<----'.                                                 03250000
033300     05  FILLER                    PIC X(08) VALUE                03260000
033400         'RECEIPTS'.                                              03270000
033500     05  FILLER                    PIC X(05) VALUE                03280000
033600         '---->'.                                                 03290000
033700     05  FILLER                    PIC X(04) VALUE                03300000
033800         '<---'.                                                  03310000
033900     05  FILLER                    PIC X(09) VALUE                03320000
034000         'PURCHASE '.                                             03330000
034100     05  FILLER                    PIC X(03) VALUE                03340000
034200         'ADJ'.                                                   03350000
034300     05  FILLER                    PIC X(06) VALUE                03360000
034400         '--->  '.                                                03370000
034500     05  FILLER                    PIC X(10)   VALUE              03380000
034600         '  INITIAL '.                                            03390000
034700     05  FILLER                    PIC X(10)   VALUE              03400000
034800         '     NET  '.                                            03410000
034900*    05  FILLER                    PIC X(10)   VALUE              03420000
035000*        ' PURCH ADJ'.                                            03430000
035100*    05  FILLER                    PIC X(33)   VALUE SPACES.      03440000
035200     05  FILLER                    PIC X(43)   VALUE SPACES.      03450000
035300     05  FILLER                    PIC X(01)   VALUE '|'.         03460000
035400     05  FILLER                    PIC X(04)   VALUE SPACES.      03470000
035500*    05  FILLER                    PIC X(10)   VALUE              03480000
035600*        '   COST   '.                                            03490000
035700*    05  FILLER                    PIC X(10)   VALUE              03500000
035800*        '      NET '.                                            03510000
035900*    05  FILLER                    PIC X(10)   VALUE              03520000
036000*        '   RETAIL '.                                            03530000
036100     05  FILLER                    PIC X(05) VALUE                03540000
036200         '<----'.                                                 03550000
036300     05  FILLER                    PIC X(08) VALUE                03560000
036400         'RECEIPTS'.                                              03570000
036500     05  FILLER                    PIC X(05) VALUE                03580000
036600         '---->'.                                                 03590000
036700     05  FILLER                    PIC X(04) VALUE                03600000
036800         '<---'.                                                  03610000
036900     05  FILLER                    PIC X(09) VALUE                03620000
037000         'PURCHASE '.                                             03630000
037100     05  FILLER                    PIC X(03) VALUE                03640000
037200         'ADJ'.                                                   03650000
037300     05  FILLER                    PIC X(05) VALUE                03660000
037400         '---> '.                                                 03670000
037500     05  FILLER                    PIC X(02)   VALUE SPACES.      03680000
037600     05  FILLER                    PIC X(10)   VALUE              03690000
037700         '  INITIAL '.                                            03700000
037800     05  FILLER                    PIC X(10)   VALUE              03710000
037900         '     NET  '.                                            03720000
038000     05  FILLER                    PIC X(20)   VALUE SPACES.      03730000
038100*                                                                 03740000
038200 01  H7-HEADING7B.                                                03750000
038300     05  FILLER                    PIC X(23)   VALUE              03760000
038400         ' CLASS           '.                                     03770000
038500*    05  FILLER                    PIC X(10)   VALUE              03780000
038600*        '  COST    '.                                            03790000
038700*    05  FILLER                    PIC X(10)   VALUE              03800000
038800*        'PURCH ADJ '.                                            03810000
038900*    05  FILLER                    PIC X(10)   VALUE              03820000
039000*        '   COST   '.                                            03830000
039100*    05  FILLER                    PIC X(10)   VALUE              03840000
039200*        'PURCHASES '.                                            03850000
039300     05  FILLER                    PIC X(04) VALUE 'COST'.        03860000
039400     05  FILLER                    PIC X(07) VALUE SPACE.         03870000
039500     05  FILLER                    PIC X(06) VALUE 'RETAIL'.      03880000
039600     05  FILLER                    PIC X(04) VALUE SPACE.         03890000
039700     05  FILLER                    PIC X(04) VALUE 'COST'.        03900000
039800     05  FILLER                    PIC X(06) VALUE SPACE.         03910000
039900     05  FILLER                    PIC X(06) VALUE 'RETAIL'.      03920000
040000     05  FILLER                    PIC X(03) VALUE SPACE.         03930000
040100     05  FILLER                    PIC X(10)   VALUE              03940000
040200         '  MKUP %  '.                                            03950000
040300     05  FILLER                    PIC X(10)   VALUE              03960000
040400         '   MKUP%  '.                                            03970000
040500*    05  FILLER                    PIC X(10)   VALUE              03980000
040600*        '  RETAIL  '.                                            03990000
040700*    05  FILLER                    PIC X(33)   VALUE SPACES.      04000000
040800     05  FILLER                    PIC X(43)   VALUE SPACES.      04010000
040900     05  FILLER                    PIC X(01)   VALUE '|'.         04020000
041000     05  FILLER                    PIC X(03)   VALUE SPACES.      04030000
041100*    05  FILLER                    PIC X(10)   VALUE              04040000
041200*        ' PURCH ADJ'.                                            04050000
041300*    05  FILLER                    PIC X(10)   VALUE              04060000
041400*        '      COST'.                                            04070000
041500*    05  FILLER                    PIC X(10)   VALUE              04080000
041600*        '     PURCH'.                                            04090000
041700*** CHANGED HEADING                                               04100000
041800     05  FILLER                    PIC X(03)   VALUE SPACES.      04110000
041900     05  FILLER                    PIC X(04) VALUE 'COST'.        04120000
042000     05  FILLER                    PIC X(06) VALUE SPACE.         04130000
042100     05  FILLER                    PIC X(06) VALUE 'RETAIL'.      04140000
042200     05  FILLER                    PIC X(04) VALUE SPACE.         04150000
042300     05  FILLER                    PIC X(04) VALUE 'COST'.        04160000
042400     05  FILLER                    PIC X(06) VALUE SPACE.         04170000
042500     05  FILLER                    PIC X(06) VALUE 'RETAIL'.      04180000
042600     05  FILLER                    PIC X(03) VALUE SPACE.         04190000
042700     05  FILLER                    PIC X(10)   VALUE              04200000
042800         '    MKUP% '.                                            04210000
042900     05  FILLER                    PIC X(10)   VALUE              04220000
043000         '    MARKUP'.                                            04230000
043100*    05  FILLER                    PIC X(20)   VALUE SPACES.      04240000
043200/                                                                 04250000
043300 01  H8-HEADING8A.                                                04260000
043400     05  FILLER                    PIC X(23)   VALUE              04270000
043500         'SALES            '.                                     04280000
043600     05  FILLER                    PIC X(10)   VALUE              04290000
043700         '  TOTAL   '.                                            04300000
043800     05  FILLER                    PIC X(10)   VALUE              04310000
043900         '  REGULAR '.                                            04320000
044000     05  FILLER                    PIC X(10)   VALUE              04330000
044100         '   PROMO  '.                                            04340000
044200     05  FILLER                    PIC X(10)   VALUE              04350000
044300         ' GOLDSTAR '.                                            04360000
044400     05  FILLER                    PIC X(10)   VALUE              04370000
044500         '   CLEAR  '.                                            04380000
044600     05  FILLER                    PIC X(10)   VALUE              04390000
044700         '  UNKNOWN '.                                            04400000
044800     05  FILLER                    PIC X(10)   VALUE              04410000
044900         '          '.                                            04420000
045000     05  FILLER                    PIC X(10)   VALUE              04430000
045100         '          '.                                            04440000
045200     05  FILLER                    PIC X(10)   VALUE              04450000
045300         '          '.                                            04460000
045400     05  FILLER                    PIC X(10)   VALUE              04470000
045500         '          '.                                            04480000
045600     05  FILLER                    PIC X(03)   VALUE SPACES.      04490000
045700     05  FILLER                    PIC X(01)   VALUE '|'.         04500000
045800     05  FILLER                    PIC X(04)   VALUE SPACES.      04510000
045900     05  FILLER                    PIC X(10)   VALUE              04520000
046000         '    TOTAL '.                                            04530000
046100     05  FILLER                    PIC X(10)   VALUE              04540000
046200         '   REGULAR'.                                            04550000
046300     05  FILLER                    PIC X(10)   VALUE              04560000
046400         '    PROMO '.                                            04570000
046500     05  FILLER                    PIC X(10)   VALUE              04580000
046600         ' GOLDSTAR '.                                            04590000
046700     05  FILLER                    PIC X(10)   VALUE              04600000
046800         '    CLEAR '.                                            04610000
046900     05  FILLER                    PIC X(10)   VALUE              04620000
047000         '   UNKNOWN'.                                            04630000
047100     05  FILLER                    PIC X(10)   VALUE SPACES.      04640000
047200*                                                                 04650000
047300 01  H8-HEADING8B.                                                04660000
047400     05  FILLER                    PIC X(23)   VALUE              04670000
047500         ' CLASS           '.                                     04680000
047600     05  FILLER                    PIC X(10)   VALUE              04690000
047700         '  SALES   '.                                            04700000
047800     05  FILLER                    PIC X(10)   VALUE              04710000
047900         '   SALES  '.                                            04720000
048000     05  FILLER                    PIC X(10)   VALUE              04730000
048100         '   SALES  '.                                            04740000
048200     05  FILLER                    PIC X(10)   VALUE              04750000
048300         '   SALES  '.                                            04760000
048400     05  FILLER                    PIC X(10)   VALUE              04770000
048500         '   SALES  '.                                            04780000
048600     05  FILLER                    PIC X(10)   VALUE              04790000
048700         '   SALES  '.                                            04800000
048800     05  FILLER                    PIC X(43)   VALUE SPACES.      04810000
048900     05  FILLER                    PIC X(01)   VALUE '|'.         04820000
049000     05  FILLER                    PIC X(03)   VALUE SPACES.      04830000
049100     05  FILLER                    PIC X(10)   VALUE              04840000
049200         '     SALES'.                                            04850000
049300     05  FILLER                    PIC X(10)   VALUE              04860000
049400         '     SALES'.                                            04870000
049500     05  FILLER                    PIC X(10)   VALUE              04880000
049600         '     SALES'.                                            04890000
049700     05  FILLER                    PIC X(10)   VALUE              04900000
049800         '     SALES'.                                            04910000
049900     05  FILLER                    PIC X(10)   VALUE              04920000
050000         '     SALES'.                                            04930000
050100     05  FILLER                    PIC X(10)   VALUE              04940000
050200         '     SALES'.                                            04950000
050300     05  FILLER                    PIC X(10)   VALUE SPACES.      04960000
050400/                                                                 04970000
050500 01  H9-HEADING9A.                                                04980000
050600     05  FILLER                    PIC X(23)   VALUE              04990000
050700         'PRICE CHANGES    '.                                     05000000
050800     05  FILLER                    PIC X(10)   VALUE              05010000
050900         '  TOTAL   '.                                            05020000
051000     05  FILLER                    PIC X(10)   VALUE              05030000
051100         '  STORE   '.                                            05040000
051200     05  FILLER                    PIC X(10)   VALUE              05050000
051300         '  BUYER   '.                                            05060000
051400     05  FILLER                    PIC X(10)   VALUE              05070000
051500         '   PLU    '.                                            05080000
051600     05  FILLER                    PIC X(10)   VALUE              05090000
051700         ' REGISTER '.                                            05100000
051800     05  FILLER                    PIC X(10)   VALUE              05110000
051900         '   OTHER  '.                                            05120000
052000     05  FILLER                    PIC X(10)   VALUE              05130000
052100         '     % OF '.                                            05140000
052200     05  FILLER                    PIC X(10)   VALUE              05150000
052300         '  MARKUP  '.                                            05160000
052400     05  FILLER                    PIC X(10)   VALUE              05170000
052500         '  DEBIT   '.                                            05180000
052600     05  FILLER                    PIC X(10)   VALUE              05190000
052700         '          '.                                            05200000
052800     05  FILLER                    PIC X(03)   VALUE SPACES.      05210000
052900     05  FILLER                    PIC X(01)   VALUE '|'.         05220000
053000     05  FILLER                    PIC X(04)   VALUE SPACES.      05230000
053100     05  FILLER                    PIC X(10)   VALUE              05240000
053200         '    TOTAL '.                                            05250000
053300     05  FILLER                    PIC X(10)   VALUE              05260000
053400         '     % OF '.                                            05270000
053500     05  FILLER                    PIC X(10)   VALUE              05280000
053600         '     PLU  '.                                            05290000
053700     05  FILLER                    PIC X(10)   VALUE              05300000
053800         '     PERM '.                                            05310000
053900     05  FILLER                    PIC X(10)   VALUE              05320000
054000         '    OTHER '.                                            05330000
054100     05  FILLER                    PIC X(10)   VALUE              05340000
054200         '    TOTAL '.                                            05350000
054300     05  FILLER                    PIC X(10)   VALUE SPACES.      05360000
054400*                                                                 05370000
054500 01  H9-HEADING9B.                                                05380000
054600     05  FILLER                    PIC X(23)   VALUE              05390000
054700         ' CLASS           '.                                     05400000
054800     05  FILLER                    PIC X(10)   VALUE              05410000
054900         '   MKDN   '.                                            05420000
055000     05  FILLER                    PIC X(10)   VALUE              05430000
055100         '   MKDN   '.                                            05440000
055200     05  FILLER                    PIC X(10)   VALUE              05450000
055300         '   MKDN   '.                                            05460000
055400     05  FILLER                    PIC X(10)   VALUE              05470000
055500         '   MKDN   '.                                            05480000
055600     05  FILLER                    PIC X(10)   VALUE              05490000
055700         '   MKDN   '.                                            05500000
055800     05  FILLER                    PIC X(10)   VALUE              05510000
055900         '   MKDN   '.                                            05520000
056000     05  FILLER                    PIC X(10)   VALUE              05530000
056100         '    SALES '.                                            05540000
056200     05  FILLER                    PIC X(10)   VALUE              05550000
056300         '  DOLLARS '.                                            05560000
056400     05  FILLER                    PIC X(10)   VALUE              05570000
056500         '  ALLOW   '.                                            05580000
056600     05  FILLER                    PIC X(10)   VALUE              05590000
056700         '          '.                                            05600000
056800     05  FILLER                    PIC X(03)   VALUE SPACES.      05610000
056900     05  FILLER                    PIC X(01)   VALUE '|'.         05620000
057000     05  FILLER                    PIC X(04)   VALUE SPACES.      05630000
057100     05  FILLER                    PIC X(10)   VALUE              05640000
057200         '     MKDN '.                                            05650000
057300     05  FILLER                    PIC X(10)   VALUE              05660000
057400         '    SALES '.                                            05670000
057500     05  FILLER                    PIC X(10)   VALUE              05680000
057600         '     MKDN '.                                            05690000
057700     05  FILLER                    PIC X(10)   VALUE              05700000
057800         '     MKDN '.                                            05710000
057900     05  FILLER                    PIC X(10)   VALUE              05720000
058000         '     MKDN '.                                            05730000
058100     05  FILLER                    PIC X(10)   VALUE              05740000
058200         '     MKUP '.                                            05750000
058300     05  FILLER                    PIC X(10)   VALUE SPACES.      05760000
058400/                                                                 05770000
058500 01  H10-HEADING10A.                                              05780000
058600     05  FILLER                    PIC X(23)   VALUE              05790000
058700         'OTHER INFO       '.                                     05800000
058800     05  FILLER                    PIC X(10)   VALUE              05810000
058900         '  GROSS   '.                                            05820000
059000     05  FILLER                    PIC X(10)   VALUE              05830000
059100         '  GROSS   '.                                            05840000
059200*    05  FILLER                    PIC X(10)   VALUE              05850000
059300*        '  MARKON  '.                                            05860000
059400     05  FILLER                    PIC X(10)   VALUE              05870000
059500         'END INVEN '.                                            05880000
059600     05  FILLER                    PIC X(10)   VALUE              05890000
059700         ' END INVEN'.                                            05900000
059800     05  FILLER                    PIC X(10)   VALUE              05910000
059900         '  SHRINK  '.                                            05920000
060000     05  FILLER                    PIC X(10)   VALUE              05930000
060100         '  SHRINK  '.                                            05940000
060200     05  FILLER                    PIC X(10)   VALUE              05950000
060300         '  INVEN   '.                                            05960000
060400     05  FILLER                    PIC X(10)   VALUE              05970000
060500         '  RETURN  '.                                            05980000
060600     05  FILLER                    PIC X(23)   VALUE SPACES.      05990000
060700     05  FILLER                    PIC X(01)   VALUE '|'.         06000000
060800     05  FILLER                    PIC X(04)   VALUE SPACES.      06010000
060900     05  FILLER                    PIC X(10)   VALUE              06020000
061000         '  GROSS   '.                                            06030000
061100     05  FILLER                    PIC X(10)   VALUE              06040000
061200         '  GROSS   '.                                            06050000
061300     05  FILLER                    PIC X(10)   VALUE              06060000
061400         'END INVEN '.                                            06070000
061500     05  FILLER                    PIC X(10)   VALUE              06080000
061600         '  SHRINK  '.                                            06090000
061700     05  FILLER                    PIC X(10)   VALUE              06100000
061800         '   INVEN  '.                                            06110000
061900     05  FILLER                    PIC X(20)   VALUE SPACES.      06120000
062000*                                                                 06130000
062100 01  H10-HEADING10B.                                              06140000
062200     05  FILLER                    PIC X(23)   VALUE              06150000
062300         ' CLASS           '.                                     06160000
062400     05  FILLER                    PIC X(10)   VALUE              06170000
062500         '  MARGN $ '.                                            06180000
062600     05  FILLER                    PIC X(10)   VALUE              06190000
062700         '  MARGN % '.                                            06200000
062800*    05  FILLER                    PIC X(10)   VALUE              06210000
062900*        '  PERCENT '.                                            06220000
063000     05  FILLER                    PIC X(10)   VALUE              06230000
063100         '   COST   '.                                            06240000
063200     05  FILLER                    PIC X(10)   VALUE              06250000
063300         '  RETAIL  '.                                            06260000
063400     05  FILLER                    PIC X(10)   VALUE              06270000
063500         '  DOLLARS '.                                            06280000
063600     05  FILLER                    PIC X(10)   VALUE              06290000
063700         '  PERCENT '.                                            06300000
063800     05  FILLER                    PIC X(10)   VALUE              06310000
063900         '  ADJUST  '.                                            06320000
064000     05  FILLER                    PIC X(10)   VALUE              06330000
064100         'TO VENDOR '.                                            06340000
064200     05  FILLER                    PIC X(23)   VALUE SPACES.      06350000
064300     05  FILLER                    PIC X(01)   VALUE '|'.         06360000
064400     05  FILLER                    PIC X(04)   VALUE SPACES.      06370000
064500     05  FILLER                    PIC X(10)   VALUE              06380000
064600         '  MARGN $ '.                                            06390000
064700     05  FILLER                    PIC X(10)   VALUE              06400000
064800         '  MARGN % '.                                            06410000
064900     05  FILLER                    PIC X(10)   VALUE              06420000
065000         ' RETAIL $ '.                                            06430000
065100     05  FILLER                    PIC X(10)   VALUE              06440000
065200         '  DOLLARS '.                                            06450000
065300     05  FILLER                    PIC X(10)   VALUE              06460000
065400         '   ADJUST '.                                            06470000
065500     05  FILLER                    PIC X(20)   VALUE SPACES.      06480000
065600*                                                                 06490000
065700/                                                                 06500000
065800 01  H11-HEADING11A.                                              06510000
065900     05  FILLER                    PIC X(23)   VALUE              06520000
066000         'SUMMARY RECAP    '.                                     06530000
066100*    05  FILLER                    PIC X(10)   VALUE              06540000
066200*        '  GROSS   '.                                            06550000
066300*    05  FILLER                    PIC X(10)   VALUE              06560000
066400*        '  COST    '.                                            06570000
066500*    05  FILLER                    PIC X(10)   VALUE              06580000
066600*        '   NET    '.                                            06590000
066700*    05  FILLER                    PIC X(10)   VALUE              06600000
066800*        ' RETAIL   '.                                            06610000
066900     05  FILLER                    PIC X(05) VALUE                06620000
067000         '<----'.                                                 06630000
067100     05  FILLER                    PIC X(08) VALUE                06640000
067200         'RECEIPTS'.                                              06650000
067300     05  FILLER                    PIC X(05) VALUE                06660000
067400         '---->'.                                                 06670000
067500     05  FILLER                    PIC X(04) VALUE                06680000
067600         '<---'.                                                  06690000
067700     05  FILLER                    PIC X(09) VALUE                06700000
067800         'PURCHASE '.                                             06710000
067900     05  FILLER                    PIC X(03) VALUE                06720000
068000         'ADJ'.                                                   06730000
068100     05  FILLER                    PIC X(06) VALUE                06740000
068200         '--->  '.                                                06750000
068300     05  FILLER                    PIC X(10)   VALUE              06760000
068400         '  CUMM    '.                                            06770000
068500     05  FILLER                    PIC X(10)   VALUE              06780000
068600         '  TOTAL   '.                                            06790000
068700     05  FILLER                    PIC X(10)   VALUE              06800000
068800         '  TOTAL   '.                                            06810000
068900     05  FILLER                    PIC X(10)   VALUE              06820000
069000         '  TOTAL   '.                                            06830000
069100     05  FILLER                    PIC X(10)   VALUE              06840000
069200         '  GROSS   '.                                            06850000
069300     05  FILLER                    PIC X(10)   VALUE              06860000
069400         'END INVEN '.                                            06870000
069500     05  FILLER                    PIC X(03)   VALUE SPACES.      06880000
069600     05  FILLER                    PIC X(01)   VALUE '|'.         06890000
069700     05  FILLER                    PIC X(04)   VALUE SPACES.      06900000
069800     05  FILLER                    PIC X(10)   VALUE              06910000
069900         '    NET   '.                                            06920000
070000     05  FILLER                    PIC X(10)   VALUE              06930000
070100         '  RETAIL  '.                                            06940000
070200     05  FILLER                    PIC X(10)   VALUE              06950000
070300         '   CUMM   '.                                            06960000
070400     05  FILLER                    PIC X(10)   VALUE              06970000
070500         '   TOTAL  '.                                            06980000
070600     05  FILLER                    PIC X(10)   VALUE              06990000
070700         '   TOTAL  '.                                            07000000
070800     05  FILLER                    PIC X(10)   VALUE              07010000
070900         '  GROSS   '.                                            07020000
071000     05  FILLER                    PIC X(10)   VALUE              07030000
071100         'END INVEN '.                                            07040000
071200     05  FILLER                    PIC X(02)   VALUE SPACES.      07050000
071300                                                                  07060000
071400 01  H11-HEADING11B.                                              07070000
071500     05  FILLER                    PIC X(23)   VALUE              07080000
071600         ' CLASS           '.                                     07090000
071700*    05  FILLER                    PIC X(10)   VALUE              07100000
071800*        '  COST    '.                                            07110000
071900*    05  FILLER                    PIC X(10)   VALUE              07120000
072000*        'PURCH ADJ '.                                            07130000
072100*    05  FILLER                    PIC X(10)   VALUE              07140000
072200*        '  COST    '.                                            07150000
072300*    05  FILLER                    PIC X(10)   VALUE              07160000
072400*        'PURCHASES '.                                            07170000
072500     05  FILLER                    PIC X(02) VALUE SPACE.         07180000
072600     05  FILLER                    PIC X(04) VALUE 'COST'.        07190000
072700     05  FILLER                    PIC X(05) VALUE SPACE.         07200000
072800     05  FILLER                    PIC X(06) VALUE 'RETAIL'.      07210000
072900     05  FILLER                    PIC X(04) VALUE SPACE.         07220000
073000     05  FILLER                    PIC X(04) VALUE 'COST'.        07230000
073100     05  FILLER                    PIC X(06) VALUE SPACE.         07240000
073200     05  FILLER                    PIC X(06) VALUE 'RETAIL'.      07250000
073300     05  FILLER                    PIC X(03) VALUE SPACE.         07260000
073400     05  FILLER                    PIC X(10)   VALUE              07270000
073500         '  MKUP %  '.                                            07280000
073600     05  FILLER                    PIC X(10)   VALUE              07290000
073700         '  SALES   '.                                            07300000
073800     05  FILLER                    PIC X(10)   VALUE              07310000
073900         '  MKDN $  '.                                            07320000
074000     05  FILLER                    PIC X(10)   VALUE              07330000
074100         '  MKDN %  '.                                            07340000
074200     05  FILLER                    PIC X(10)   VALUE              07350000
074300         ' MARGN %  '.                                            07360000
074400     05  FILLER                    PIC X(10)   VALUE              07370000
074500         ' RETAIL   '.                                            07380000
074600     05  FILLER                    PIC X(03)   VALUE SPACES.      07390000
074700     05  FILLER                    PIC X(01)   VALUE '|'.         07400000
074800     05  FILLER                    PIC X(04)   VALUE SPACES.      07410000
074900     05  FILLER                    PIC X(10)   VALUE              07420000
075000         '   COST   '.                                            07430000
075100     05  FILLER                    PIC X(10)   VALUE              07440000
075200         ' PURCHASES'.                                            07450000
075300     05  FILLER                    PIC X(10)   VALUE              07460000
075400         '   MKUP % '.                                            07470000
075500     05  FILLER                    PIC X(10)   VALUE              07480000
075600         '   SALES  '.                                            07490000
075700     05  FILLER                    PIC X(10)   VALUE              07500000
075800         '   MKDN $ '.                                            07510000
075900     05  FILLER                    PIC X(10)   VALUE              07520000
076000         '  MARGN % '.                                            07530000
076100     05  FILLER                    PIC X(10)   VALUE              07540000
076200         '  RETAIL  '.                                            07550000
076300     05  FILLER                    PIC X(02)   VALUE SPACES.      07560000
076400                                                                  07570000
076500/                                                                 07580000
076600 01  BL-BAR-LINE.                                                 07590000
076700     05  FILLER                    PIC X(126)  VALUE SPACES.      07600000
076800     05  FILLER                    PIC X(01)   VALUE '|'.         07610000
076900     05  FILLER                    PIC X(078)  VALUE SPACES.      07620000
077000                                                                  07630000
077100***** PURCHASES DETAIL DATA                                       07640000
077200 01  DL-AP-DETAIL-LINE.                                           07650000
077300***** THIS YEAR DATA                                              07660000
077400     05  FILLER                    PIC X(01)   VALUE SPACES.      07670000
077500     05  DL-AP-TOTAL                   PIC X(20)   VALUE SPACES.  07680000
077600     05  DL-AP-CLASS-GROUP REDEFINES DL-AP-TOTAL.                 07690000
077700         10  DL-AP-CLASS               PIC 9(02).                 07700000
077800         10  FILLER                    PIC X(01).                 07710000
077900         10  DL-AP-CLASS-DESC          PIC X(17).                 07720000
078000* - ELIMINATED COMMA AND ADDED DECIMAL POSITION DUE TO TRUNC      07730000
078100     05  FILLER                        PIC X(01)   VALUE SPACES.  07740000
078200*    05  DL-AP-GROSS-COST              PIC ZZZZZZZ.Z-.            07750000
078300*    05  DL-AP-PURCH-ADJ-COST-TY       PIC ZZZZZZZ.Z-.            07760000
078400*    05  DL-AP-NET-COST-TY             PIC ZZZZZZZ.Z-.            07770000
078500*    05  DL-AP-RTL-PURCH-TY            PIC ZZZZZZZ.Z-.            07780000
078600     05  DL-AP-RECEIPTS-COST-TY        PIC ZZZZZZZ.Z-.            07790000
078700     05  DL-AP-RECEIPTS-RETAIL-TY      PIC ZZZZZZZ.Z-.            07800000
078800     05  DL-AP-PURCHASE-ADJ-COST-TY    PIC ZZZZZZZ.Z-.            07810000
078900     05  DL-AP-PURCHASE-ADJ-RETAIL-TY  PIC ZZZZZZZ.Z-.            07820000
079000     05  DL-AP-INIT-MARKON-TY          PIC ZZZZZZZ.Z-.            07830000
079100     05  DL-AP-NET-MARKON-TY           PIC ZZZZZZZ.Z-.            07840000
079200     05  DL-AP-PURCH-ADJ-RETAIL        PIC ZZZZZZZ.Z-.            07850000
079300     05  FILLER                        PIC X(34)   VALUE SPACES.  07860000
079400     05  FILLER                        PIC X(01)   VALUE '|'.     07870000
079500*    05  FILLER                        PIC X(04)   VALUE SPACES.  07880000
079600     05  FILLER                        PIC X(02)   VALUE SPACES.  07890000
079700***** LAST YEAR DATA                                              07900000
079800*    05  DL-AP-PURCH-ADJ-COST-LY       PIC ZZZZZZZ.Z-.            07910000
079900*    05  DL-AP-NET-COST-LY             PIC ZZZZZZZ.Z-.            07920000
080000*    05  DL-AP-RTL-PURCH-LY            PIC ZZZZZZZ.Z-.            07930000
080100     05  DL-AP-RECEIPTS-COST-LY        PIC ZZZZZZZ.Z-.            07940000
080200     05  DL-AP-RECEIPTS-RETAIL-LY      PIC ZZZZZZZ.Z-.            07950000
080300     05  DL-AP-PURCHASE-ADJ-COST-LY    PIC ZZZZZZZ.Z-.            07960000
080400     05  DL-AP-PURCHASE-ADJ-RETAIL-LY  PIC ZZZZZZZ.Z-.            07970000
080500     05  FILLER                        PIC X(02)   VALUE SPACES.  07980000
080600     05  DL-AP-INIT-MARKON-LY          PIC ZZZZZZZ.Z-.            07990000
080700     05  DL-AP-NET-MARKON-LY           PIC ZZZZZZZ.Z-.            08000000
080800/                                                                 08010000
080900 01  DL-AP-NO-DETAIL.                                             08020000
081000     05  FILLER                    PIC X(01) VALUE SPACES.        08030000
081100     05  FILLER                    PIC X(49) VALUE                08040000
081200           ' $0 PURCHASE DOLLARS                             '.   08050000
081300     05  FILLER                    PIC X(76) VALUE SPACES.        08060000
081400     05  FILLER                    PIC X(01) VALUE '|'.           08070000
081500     05  FILLER                    PIC X(78) VALUE SPACES.        08080000
081600                                                                  08090000
081700***** SALES DETAIL DATA                                           08100000
081800 01  DL-SL-DETAIL-LINE.                                           08110000
081900***** THIS YEAR DATA                                              08120000
082000     05  FILLER                    PIC X(01)   VALUE SPACES.      08130000
082100     05  DL-SL-TOTAL               PIC X(20)   VALUE SPACES.      08140000
082200     05  DL-SL-CLASS-GROUP REDEFINES DL-SL-TOTAL.                 08150000
082300         10  DL-SL-CLASS           PIC 9(02).                     08160000
082400         10  FILLER                PIC X(01).                     08170000
082500         10  DL-SL-CLASS-DESC      PIC X(17).                     08180000
082600* - ELIMINATED COMMA AND ADDED DECIMAL POSITION DUE TO TRUNC      08190000
082700     05  FILLER                    PIC X(01)   VALUE SPACES.      08200000
082800     05  DL-SL-TOTAL-SALES-TY      PIC ZZZZZZZ.Z-.                08210000
082900     05  DL-SL-REGULAR-SALES-TY    PIC ZZZZZZZ.Z-.                08220000
083000     05  DL-SL-PROMO-SALES-TY      PIC ZZZZZZZ.Z-.                08230000
083100     05  DL-SL-GOLDSTAR-SALES-TY   PIC ZZZZZZZ.Z-.                08240000
083200     05  DL-SL-CLEAR-SALES-TY      PIC ZZZZZZZ.Z-.                08250000
083300     05  DL-SL-UNKWN-SALES-TY      PIC ZZZZZZZ.Z-.                08260000
083400     05  FILLER                    PIC X(44)   VALUE SPACES.      08270000
083500     05  FILLER                    PIC X(01)   VALUE '|'.         08280000
083600     05  FILLER                    PIC X(04)   VALUE SPACES.      08290000
083700***** LAST YEAR DATA                                              08300000
083800     05  DL-SL-TOTAL-SALES-LY      PIC ZZZZZZZ.Z-.                08310000
083900     05  DL-SL-REGULAR-SALES-LY    PIC ZZZZZZZ.Z-.                08320000
084000     05  DL-SL-PROMO-SALES-LY      PIC ZZZZZZZ.Z-.                08330000
084100     05  DL-SL-GOLDSTAR-SALES-LY   PIC ZZZZZZZ.Z-.                08340000
084200     05  DL-SL-CLEAR-SALES-LY      PIC ZZZZZZZ.Z-.                08350000
084300     05  DL-SL-UNKWN-SALES-LY      PIC ZZZZZZZ.Z-.                08360000
084400/                                                                 08370000
084500 01  DL-SALES-NO-DETAIL.                                          08380000
084600     05  FILLER                    PIC X(01) VALUE SPACES.        08390000
084700     05  FILLER                    PIC X(49) VALUE                08400000
084800           ' $0 SALES DOLLARS                                '.   08410000
084900     05  FILLER                    PIC X(76) VALUE SPACES.        08420000
085000     05  FILLER                    PIC X(01) VALUE '|'.           08430000
085100     05  FILLER                    PIC X(78) VALUE SPACES.        08440000
085200                                                                  08450000
085300 01  DL-PC-DETAIL-LINE.                                           08460000
085400***** THIS YEAR DATA                                              08470000
085500     05  FILLER                    PIC X(01)   VALUE SPACES.      08480000
085600     05  DL-PC-TOTAL               PIC X(20)   VALUE SPACES.      08490000
085700     05  DL-PC-CLASS-GROUP REDEFINES DL-PC-TOTAL.                 08500000
085800         10  DL-PC-CLASS           PIC 9(02).                     08510000
085900         10  FILLER                PIC X(01).                     08520000
086000         10  DL-PC-CLASS-DESC      PIC X(17).                     08530000
086100* - ELIMINATED COMMA AND ADDED DECIMAL POSITION DUE TO TRUNC      08540000
086200     05  FILLER                    PIC X(01)   VALUE SPACES.      08550000
086300     05  DL-PC-TOTAL-MKDN-TY       PIC ZZZZZZZ.Z-.                08560000
086400     05  DL-PC-STORE-MKDN-TY       PIC ZZZZZZZ.Z-.                08570000
086500     05  DL-PC-BUYER-MKDN-TY       PIC ZZZZZZZ.Z-.                08580000
086600     05  DL-PC-PLU-MKDN-TY         PIC ZZZZZZZ.Z-.                08590000
086700     05  DL-PC-PERM-MKDN-TY        PIC ZZZZZZZ.Z-.                08600000
086800     05  DL-PC-OTHER-MKDN-TY       PIC ZZZZZZZ.Z-.                08610000
086900     05  DL-PC-MKDN-PCT-SLS-TY     PIC ZZZZZZZ.Z-.                08620000
087000     05  DL-PC-TOTAL-MKUP-TY       PIC ZZZZZZZ.Z-.                08630000
087100     05  DL-PC-DEBIT-ALLOW-TY      PIC ZZZZZZZ.Z-.                08640000
087200     05  FILLER                    PIC X(14)   VALUE SPACES.      08650000
087300     05  FILLER                    PIC X(01)   VALUE '|'.         08660000
087400     05  FILLER                    PIC X(04)   VALUE SPACES.      08670000
087500***** LAST YEAR DATA                                              08680000
087600     05  DL-PC-TOTAL-MKDN-LY       PIC ZZZZZZZ.Z-.                08690000
087700     05  DL-PC-MKDN-PCT-SLS-LY     PIC ZZZZZZZ.Z-.                08700000
087800     05  DL-PC-PLU-MKDN-LY         PIC ZZZZZZZ.Z-.                08710000
087900     05  DL-PC-PERM-MKDN-LY        PIC ZZZZZZZ.Z-.                08720000
088000     05  DL-PC-OTHER-MKDN-LY       PIC ZZZZZZZ.Z-.                08730000
088100     05  DL-PC-TOTAL-MKUP-LY       PIC ZZZZZZZ.Z-.                08740000
088200/                                                                 08750000
088300 01  DL-PC-NO-DETAIL.                                             08760000
088400     05  FILLER                    PIC X(01) VALUE SPACES.        08770000
088500     05  FILLER                    PIC X(49) VALUE                08780000
088600           ' $0 PRICE CHANGE DOLLARS                         '.   08790000
088700     05  FILLER                    PIC X(76) VALUE SPACES.        08800000
088800     05  FILLER                    PIC X(01) VALUE '|'.           08810000
088900     05  FILLER                    PIC X(78) VALUE SPACES.        08820000
089000                                                                  08830000
089100 01  DL-MI-DETAIL-LINE.                                           08840000
089200***** THIS YEAR DATA                                              08850000
089300     05  FILLER                    PIC X(01)   VALUE SPACES.      08860000
089400     05  DL-MI-TOTAL               PIC X(20)   VALUE SPACES.      08870000
089500     05  DL-MI-CLASS-GROUP REDEFINES DL-MI-TOTAL.                 08880000
089600         10  DL-MI-CLASS           PIC 9(02).                     08890000
089700         10  FILLER                PIC X(01).                     08900000
089800         10  DL-MI-CLASS-DESC      PIC X(17).                     08910000
089900* - ELIMINATED COMMA AND ADDED DECIMAL POSITION DUE TO TRUNC      08920000
090000     05  FILLER                    PIC X(01)   VALUE SPACES.      08930000
090100     05  DL-MI-GROSS-MARGN-TY      PIC ZZZZZZZ.Z-.                08940000
090200     05  DL-MI-GR-MARGN-PCT-TY     PIC ZZZZZZZ.Z-.                08950000
090300*    05  DL-MI-MARKON-PCT-TY       PIC ZZZZZZZ.Z-.                08960000
090400     05  DL-MI-END-INV-COST-TY     PIC ZZZZZZZ.Z-.                08970000
090500     05  DL-MI-END-INV-RTL-TY      PIC ZZZZZZZ.Z-.                08980000
090600     05  DL-MI-SHRINK-DLR-TY       PIC ZZZZZZZ.Z-.                08990000
C14666     05  DL-MI-SHRINK-PCT-TY       PIC ZZZZZZZ.ZZ-.               09000001
090800     05  DL-MI-INV-ADJ-TY          PIC ZZZZZZZ.Z-.                09010000
090900     05  DL-MI-RET-TO-VENDR-TY     PIC ZZZZZZZ.Z-.                09020000
C14666     05  FILLER                    PIC X(23)   VALUE SPACES.      09030002
091100     05  FILLER                    PIC X(01)   VALUE '|'.         09040000
091200     05  FILLER                    PIC X(04)   VALUE SPACES.      09050000
091300***** LAST YEAR DATA                                              09060000
091400     05  DL-MI-GROSS-MARGN-LY      PIC ZZZZZZZ.Z-.                09070000
091500     05  DL-MI-GR-MARGN-PCT-LY     PIC ZZZZZZZ.Z-.                09080000
091600     05  DL-MI-END-INV-RTL-LY      PIC ZZZZZZZ.Z-.                09090000
091700     05  DL-MI-SHRINK-DLR-LY       PIC ZZZZZZZ.Z-.                09100000
091800     05  DL-MI-INV-ADJ-LY          PIC ZZZZZZZ.Z-.                09110000
091900/                                                                 09120000
092000 01  DL-MISC-NO-DETAIL.                                           09130000
092100     05  FILLER                    PIC X(01) VALUE SPACES.        09140000
092200     05  FILLER                    PIC X(49) VALUE                09150000
092300           ' $0 OTHER INFO DOLLARS                           '.   09160000
092400     05  FILLER                    PIC X(76) VALUE SPACES.        09170000
092500     05  FILLER                    PIC X(01) VALUE '|'.           09180000
092600     05  FILLER                    PIC X(78) VALUE SPACES.        09190000
092700                                                                  09200000
092800 01  DL-SR-DETAIL-LINE.                                           09210000
092900***** THIS YEAR DATA                                              09220000
093000     05  FILLER                        PIC X(01)   VALUE SPACES.  09230000
093100     05  DL-SR-TOTAL                   PIC X(20)   VALUE SPACES.  09240000
093200     05  DL-SR-CLASS-GROUP REDEFINES DL-SR-TOTAL.                 09250000
093300         10  DL-SR-CLASS               PIC 9(02).                 09260000
093400         10  FILLER                    PIC X(01).                 09270000
093500         10  DL-SR-CLASS-DESC          PIC X(17).                 09280000
093600* - ELIMINATED COMMA AND ADDED DECIMAL POSITION DUE TO TRUNC      09290000
093700     05  FILLER                        PIC X(01)   VALUE SPACES.  09300000
093800*    05  DL-SR-GROSS-COST              PIC ZZZZZZZ.Z-.            09310000
093900*    05  DL-SR-PURCH-ADJ-COST-TY       PIC ZZZZZZZ.Z-.            09320000
094000*    05  DL-SR-NET-COST-TY             PIC ZZZZZZZ.Z-.            09330000
094100*    05  DL-SR-RETAIL-PURCH-TY         PIC ZZZZZZZ.Z-.            09340000
094200     05  DL-SR-RECEIPTS-COST-TY        PIC ZZZZZZZ.Z-.            09350000
094300     05  DL-SR-RECEIPTS-RETAIL-TY      PIC ZZZZZZZ.Z-.            09360000
094400     05  DL-SR-PURCHASE-ADJ-COST-TY    PIC ZZZZZZZ.Z-.            09370000
094500     05  DL-SR-PURCHASE-ADJ-RETAIL-TY  PIC ZZZZZZZ.Z-.            09380000
094600     05  DL-SR-CUMM-MARKUP-PCT-TY      PIC ZZZZZZZ.Z-.            09390000
094700     05  DL-SR-TOTAL-SALES-TY          PIC ZZZZZZZ.Z-.            09400000
094800     05  DL-SR-TOTAL-MKDN-TY           PIC ZZZZZZZ.Z-.            09410000
094900     05  DL-SR-TOTAL-MKDN-PCT-TY       PIC ZZZZZZZ.Z-.            09420000
095000     05  DL-SR-GROSS-MARGN-PCT-TY      PIC ZZZZZZZ.Z-.            09430000
095100     05  DL-SR-END-INV-RTL-TY          PIC ZZZZZZZ.Z-.            09440000
095200     05  FILLER                        PIC X(04)   VALUE SPACES.  09450000
095300     05  FILLER                        PIC X(01)   VALUE '|'.     09460000
095400     05  FILLER                        PIC X(03)   VALUE SPACES.  09470000
095500***** LAST YEAR DATA                                              09480000
095600     05  DL-SR-NET-COST-LY         PIC ZZZZZZZ.Z-.                09490000
095700     05  DL-SR-RETAIL-PURCH-LY     PIC ZZZZZZZ.Z-.                09500000
095800     05  DL-SR-CUMM-MARKUP-PCT-LY  PIC ZZZZZZZ.Z-.                09510000
095900     05  DL-SR-TOTAL-SALES-LY      PIC ZZZZZZZ.Z-.                09520000
096000     05  DL-SR-TOTAL-MKDN-LY       PIC ZZZZZZZ.Z-.                09530000
096100     05  DL-SR-GROSS-MARGN-PCT-LY  PIC ZZZZZZZ.Z-.                09540000
096200     05  DL-SR-END-INV-RTL-LY      PIC ZZZZZZZ.Z-.                09550000
096300/                                                                 09560000
096400                                                                  09570000
096500******************************************************************09580000
096600*    AREA TO SAVE RECORDS FOR CURRENT-MONTH.THIS AREA WILL BE     09590000
096700*    PRINTED AT THE BACK OF EACH PAGE.                            09600000
096800******************************************************************09610000
096900 01  CM-CURRENT-MONTH-TABLE.                                      09620000
097000     05  CM-AP-DATA                OCCURS 9.                      09630000
097100         10  CM-GROSS-COST            PIC S9(11)V99 COMP-3.       09640000
097200         10  CM-PURCH-ADJ-COST-TY     PIC S9(11)V99 COMP-3.       09650000
097300         10  CM-PURCH-ADJ-COST-LY     PIC S9(11)V99 COMP-3.       09660000
097400         10  CM-PURCH-ADJ-RETAIL      PIC S9(11)V99 COMP-3.       09670000
097500         10  CM-NET-COST-TY           PIC S9(11)V99 COMP-3.       09680000
097600         10  CM-NET-COST-LY           PIC S9(11)V99 COMP-3.       09690000
097700         10  CM-RETAIL-PURCH-TY       PIC S9(11)V99 COMP-3.       09700000
097800         10  CM-RETAIL-PURCH-LY       PIC S9(11)V99 COMP-3.       09710000
097900         10  CM-INITIAL-MARKON-TY     PIC S9(11)V99 COMP-3.       09720000
098000         10  CM-INITIAL-MARKON-LY     PIC S9(11)V99 COMP-3.       09730000
098100         10  CM-NET-MARKON-TY         PIC S9(11)V99 COMP-3.       09740000
098200         10  CM-NET-MARKON-LY         PIC S9(11)V99 COMP-3.       09750000
098300         10  CM-AP-CLASS              PIC 99.                     09760000
098400         10  CM-AP-CLASS-DESC         PIC X(30).                  09770000
098500         10  CM-RECEIPTS-COST-TY      PIC S9(11)V99 COMP-3.       09780000
098600         10  CM-RECEIPTS-RTL-TY       PIC S9(11)V99 COMP-3.       09790000
098700         10  CM-PURCH-ADJ-RTL-TY      PIC S9(11)V99 COMP-3.       09800000
098800         10  CM-RECEIPTS-COST-LY      PIC S9(11)V99 COMP-3.       09810000
098900         10  CM-RECEIPTS-RTL-LY       PIC S9(11)V99 COMP-3.       09820000
099000         10  CM-PURCH-ADJ-RTL-LY      PIC S9(11)V99 COMP-3.       09830000
099100     05  CM-SALES-DATA             OCCURS 9.                      09840000
099200         10  CM-TOTAL-SALES-TY        PIC S9(11)V99 COMP-3.       09850000
099300         10  CM-TOTAL-SALES-LY        PIC S9(11)V99 COMP-3.       09860000
099400         10  CM-REGULAR-SALES-TY      PIC S9(11)V99 COMP-3.       09870000
099500         10  CM-REGULAR-SALES-LY      PIC S9(11)V99 COMP-3.       09880000
099600         10  CM-PROMO-SALES-TY        PIC S9(11)V99 COMP-3.       09890000
099700         10  CM-PROMO-SALES-LY        PIC S9(11)V99 COMP-3.       09900000
099800         10  CM-GOLDSTAR-SALES-TY     PIC S9(11)V99 COMP-3.       09910000
099900         10  CM-GOLDSTAR-SALES-LY     PIC S9(11)V99 COMP-3.       09920000
100000         10  CM-CLEAR-SALES-TY        PIC S9(11)V99 COMP-3.       09930000
100100         10  CM-CLEAR-SALES-LY        PIC S9(11)V99 COMP-3.       09940000
100200         10  CM-UNKWN-SALES-TY        PIC S9(11)V99 COMP-3.       09950000
100300         10  CM-UNKWN-SALES-LY        PIC S9(11)V99 COMP-3.       09960000
100400         10  CM-SALES-CLASS           PIC 99.                     09970000
100500         10  CM-SALES-CLASS-DESC      PIC X(30).                  09980000
100600     05  CM-PC-DATA                OCCURS 9.                      09990000
100700         10  CM-TOTAL-MKDN-TY      PIC S9(11)V99 COMP-3.          10000000
100800         10  CM-TOTAL-MKDN-LY      PIC S9(11)V99 COMP-3.          10010000
100900         10  CM-TOTAL-MKUP-TY      PIC S9(11)V99 COMP-3.          10020000
101000         10  CM-TOTAL-MKUP-LY      PIC S9(11)V99 COMP-3.          10030000
101100         10  CM-STORE-MKDN-TY      PIC S9(11)V99 COMP-3.          10040000
101200         10  CM-BUYER-MKDN-TY      PIC S9(11)V99 COMP-3.          10050000
101300         10  CM-PLU-MKDN-TY        PIC S9(11)V99 COMP-3.          10060000
101400         10  CM-PLU-MKDN-LY        PIC S9(11)V99 COMP-3.          10070000
101500         10  CM-PERM-MKDN-TY       PIC S9(11)V99 COMP-3.          10080000
101600         10  CM-PERM-MKDN-LY       PIC S9(11)V99 COMP-3.          10090000
101700         10  CM-OTHER-MKDN-TY      PIC S9(11)V99 COMP-3.          10100000
101800         10  CM-OTHER-MKDN-LY      PIC S9(11)V99 COMP-3.          10110000
101900         10  CM-DEBIT-ALLOW-TY     PIC S9(11)V99 COMP-3.          10120000
102000         10  CM-PC-CLASS           PIC 99.                        10130000
102100         10  CM-PC-CLASS-DESC      PIC X(30).                     10140000
102200     05  CM-MISC-DATA              OCCURS 9.                      10150000
102300         10  CM-GROSS-MARGN-TY     PIC S9(11)V99 COMP-3.          10160000
102400         10  CM-GROSS-MARGN-LY     PIC S9(11)V99 COMP-3.          10170000
102500         10  CM-SHRINK-DLR-TY      PIC S9(11)V99 COMP-3.          10180000
102600         10  CM-SHRINK-DLR-LY      PIC S9(11)V99 COMP-3.          10190000
102700         10  CM-END-INV-RTL-TY     PIC S9(11)V99 COMP-3.          10200000
102800         10  CM-END-INV-RTL-LY     PIC S9(11)V99 COMP-3.          10210000
102900         10  CM-END-INV-COST-TY    PIC S9(11)V99 COMP-3.          10220000
103000         10  CM-INV-ADJ-TY         PIC S9(11)V99 COMP-3.          10230000
103100         10  CM-INV-ADJ-LY         PIC S9(11)V99 COMP-3.          10240000
103200         10  CM-RET-TO-VENDR-TY    PIC S9(11)V99 COMP-3.          10250000
103300         10  CM-MISC-CLASS-DESC    PIC X(30).                     10260000
103400         10  CM-MISC-CLASS         PIC 99.                        10270000
103500     05  CM-SUMM-RECAP-DATA        OCCURS 9.                      10280000
103600         10  CM-CUM-TO-DTE-PURCH-RETAIL-TY                        10290000
103700                                   PIC S9(11)V99 COMP-3.          10300000
103800         10  CM-CUM-TO-DTE-PURCH-RETAIL-LY                        10310000
103900                                   PIC S9(11)V99 COMP-3.          10320000
104000         10  CM-CUM-TO-DATE-PURCH-COST-TY                         10330000
104100                                   PIC S9(11)V99 COMP-3.          10340000
104200         10  CM-CUM-TO-DATE-PURCH-COST-LY                         10350000
104300                                   PIC S9(11)V99 COMP-3.          10360000
104400/                                                                 10370000
104500******************************************************************10380000
104600*    CURRENT-MONTH TOTAL AREA.  THIS IS THE TOTAL OF ALL THE      10390000
104700*    RECORDS SAVED AT THE CURRENT-MONTH-TABLE.  THIS AREA IS USED 10400000
104800*    TO PRINT THE CURRENT-MONTH-TABLE AT THE BACK OF EACH PAGE.   10410000
104900******************************************************************10420000
105000 01  CMT-CURRENT-MONTH-TOTALS.                                    10430000
105100     05  CMT-AP-DATA.                                             10440000
105200         10  CMT-GROSS-COST          PIC S9(11)V99 COMP-3.        10450000
105300         10  CMT-PURCH-ADJ-COST-TY   PIC S9(11)V99 COMP-3.        10460000
105400         10  CMT-PURCH-ADJ-COST-LY   PIC S9(11)V99 COMP-3.        10470000
105500         10  CMT-PURCH-ADJ-RETAIL    PIC S9(11)V99 COMP-3.        10480000
105600         10  CMT-NET-COST-TY         PIC S9(11)V99 COMP-3.        10490000
105700         10  CMT-NET-COST-LY         PIC S9(11)V99 COMP-3.        10500000
105800         10  CMT-RETAIL-PURCH-TY     PIC S9(11)V99 COMP-3.        10510000
105900         10  CMT-RETAIL-PURCH-LY     PIC S9(11)V99 COMP-3.        10520000
106000         10  CMT-INITIAL-MARKON-TY                                10530000
106100                                     PIC S9(11)V99 COMP-3.        10540000
106200         10  CMT-INITIAL-MARKON-LY                                10550000
106300                                     PIC S9(11)V99 COMP-3.        10560000
106400         10  CMT-NET-MARKON-TY       PIC S9(11)V99 COMP-3.        10570000
106500         10  CMT-NET-MARKON-LY       PIC S9(11)V99 COMP-3.        10580000
106600         10  CMT-RECEIPTS-COST-TY    PIC S9(11)V99 COMP-3.        10590000
106700         10  CMT-RECEIPTS-RTL-TY     PIC S9(11)V99 COMP-3.        10600000
106800         10  CMT-PURCH-ADJ-RTL-TY    PIC S9(11)V99 COMP-3.        10610000
106900         10  CMT-RECEIPTS-COST-LY    PIC S9(11)V99 COMP-3.        10620000
107000         10  CMT-RECEIPTS-RTL-LY     PIC S9(11)V99 COMP-3.        10630000
107100         10  CMT-PURCH-ADJ-RTL-LY    PIC S9(11)V99 COMP-3.        10640000
107200     05  CMT-SALES-DATA.                                          10650000
107300         10  CMT-TOTAL-SALES-TY    PIC S9(11)V99 COMP-3.          10660000
107400         10  CMT-TOTAL-SALES-LY    PIC S9(11)V99 COMP-3.          10670000
107500         10  CMT-REGULAR-SALES-TY                                 10680000
107600                                   PIC S9(11)V99 COMP-3.          10690000
107700         10  CMT-REGULAR-SALES-LY                                 10700000
107800                                   PIC S9(11)V99 COMP-3.          10710000
107900         10  CMT-PROMO-SALES-TY    PIC S9(11)V99 COMP-3.          10720000
108000         10  CMT-PROMO-SALES-LY    PIC S9(11)V99 COMP-3.          10730000
108100         10  CMT-GOLDSTAR-SALES-TY PIC S9(11)V99 COMP-3.          10740000
108200         10  CMT-GOLDSTAR-SALES-LY PIC S9(11)V99 COMP-3.          10750000
108300         10  CMT-CLEAR-SALES-TY    PIC S9(11)V99 COMP-3.          10760000
108400         10  CMT-CLEAR-SALES-LY    PIC S9(11)V99 COMP-3.          10770000
108500         10  CMT-UNKWN-SALES-TY    PIC S9(11)V99 COMP-3.          10780000
108600         10  CMT-UNKWN-SALES-LY    PIC S9(11)V99 COMP-3.          10790000
108700     05  CMT-PC-DATA.                                             10800000
108800         10  CMT-TOTAL-MKDN-TY     PIC S9(11)V99 COMP-3.          10810000
108900         10  CMT-TOTAL-MKDN-LY     PIC S9(11)V99 COMP-3.          10820000
109000         10  CMT-TOTAL-MKUP-TY     PIC S9(11)V99 COMP-3.          10830000
109100         10  CMT-TOTAL-MKUP-LY     PIC S9(11)V99 COMP-3.          10840000
109200         10  CMT-STORE-MKDN-TY     PIC S9(11)V99 COMP-3.          10850000
109300         10  CMT-BUYER-MKDN-TY     PIC S9(11)V99 COMP-3.          10860000
109400         10  CMT-PLU-MKDN-TY       PIC S9(11)V99 COMP-3.          10870000
109500         10  CMT-PLU-MKDN-LY       PIC S9(11)V99 COMP-3.          10880000
109600         10  CMT-PERM-MKDN-TY      PIC S9(11)V99 COMP-3.          10890000
109700         10  CMT-PERM-MKDN-LY      PIC S9(11)V99 COMP-3.          10900000
109800         10  CMT-OTHER-MKDN-TY     PIC S9(11)V99 COMP-3.          10910000
109900         10  CMT-OTHER-MKDN-LY     PIC S9(11)V99 COMP-3.          10920000
110000         10  CMT-DEBIT-ALLOW-TY    PIC S9(11)V99 COMP-3.          10930000
110100     05  CMT-MISC-DATA.                                           10940000
110200         10  CMT-GROSS-MARGN-TY    PIC S9(11)V99 COMP-3.          10950000
110300         10  CMT-GROSS-MARGN-LY    PIC S9(11)V99 COMP-3.          10960000
110400         10  CMT-SHRINK-DLR-TY     PIC S9(11)V99 COMP-3.          10970000
110500         10  CMT-SHRINK-DLR-LY     PIC S9(11)V99 COMP-3.          10980000
110600         10  CMT-END-INV-RTL-TY    PIC S9(11)V99 COMP-3.          10990000
110700         10  CMT-END-INV-RTL-LY    PIC S9(11)V99 COMP-3.          11000000
110800         10  CMT-END-INV-COST-TY   PIC S9(11)V99 COMP-3.          11010000
110900         10  CMT-INV-ADJ-TY        PIC S9(11)V99 COMP-3.          11020000
111000         10  CMT-INV-ADJ-LY        PIC S9(11)V99 COMP-3.          11030000
111100         10  CMT-RET-TO-VENDR-TY   PIC S9(11)V99 COMP-3.          11040000
111200     05  CMT-SUMM-RECAP-DATA.                                     11050000
111300         10  CMT-CUM-TO-DATE-PURCH-RTL-TY                         11060000
111400                                   PIC S9(11)V99 COMP-3.          11070000
111500         10  CMT-CUM-TO-DATE-PURCH-RTL-LY                         11080000
111600                                   PIC S9(11)V99 COMP-3.          11090000
111700         10  CMT-CUM-TO-DATE-PURCH-COST-TY                        11100000
111800                                   PIC S9(11)V99 COMP-3.          11110000
111900         10  CMT-CUM-TO-DATE-PURCH-COST-LY                        11120000
112000                                   PIC S9(11)V99 COMP-3.          11130000
112100/                                                                 11140000
112200******************************************************************11150000
112300*    CURRENT-MONTH TOTAL AREA.  THIS IS THE TOTAL OF ALL THE      11160000
112400*    RECORDS SAVED AT THE CURRENT-MONTH-TABLE.  THIS AREA IS USED 11170000
112500*    TO PRINT THE CURRENT-MONTH-TABLE AT THE BACK OF EACH PAGE.   11180000
112600******************************************************************11190000
112700 01 TCMT-CURRENT-MONTH-TOTALS.                                    11200000
112800     05  TCMT-AP-DATA.                                            11210000
112900         10  TCMT-GROSS-COST          PIC S9(11)V99 COMP-3.       11220000
113000         10  TCMT-PURCH-ADJ-COST-TY   PIC S9(11)V99 COMP-3.       11230000
113100         10  TCMT-PURCH-ADJ-COST-LY   PIC S9(11)V99 COMP-3.       11240000
113200         10  TCMT-PURCH-ADJ-RETAIL    PIC S9(11)V99 COMP-3.       11250000
113300         10  TCMT-NET-COST-TY         PIC S9(11)V99 COMP-3.       11260000
113400         10  TCMT-NET-COST-LY         PIC S9(11)V99 COMP-3.       11270000
113500         10  TCMT-RETAIL-PURCH-TY     PIC S9(11)V99 COMP-3.       11280000
113600         10  TCMT-RETAIL-PURCH-LY     PIC S9(11)V99 COMP-3.       11290000
113700         10  TCMT-INITIAL-MARKON-TY                               11300000
113800                                      PIC S9(11)V99 COMP-3.       11310000
113900         10  TCMT-INITIAL-MARKON-LY                               11320000
114000                                      PIC S9(11)V99 COMP-3.       11330000
114100         10  TCMT-NET-MARKON-TY       PIC S9(11)V99 COMP-3.       11340000
114200         10  TCMT-NET-MARKON-LY       PIC S9(11)V99 COMP-3.       11350000
114300         10  TCMT-RECEIPTS-COST-TY    PIC S9(11)V99 COMP-3.       11360000
114400         10  TCMT-RECEIPTS-RTL-TY     PIC S9(11)V99 COMP-3.       11370000
114500         10  TCMT-PURCH-ADJ-RTL-TY    PIC S9(11)V99 COMP-3.       11380000
114600         10  TCMT-RECEIPTS-COST-LY    PIC S9(11)V99 COMP-3.       11390000
114700         10  TCMT-RECEIPTS-RTL-LY     PIC S9(11)V99 COMP-3.       11400000
114800         10  TCMT-PURCH-ADJ-RTL-LY    PIC S9(11)V99 COMP-3.       11410000
114900     05  TCMT-SALES-DATA.                                         11420000
115000         10  TCMT-TOTAL-SALES-TY    PIC S9(11)V99 COMP-3.         11430000
115100         10  TCMT-TOTAL-SALES-LY    PIC S9(11)V99 COMP-3.         11440000
115200         10  TCMT-REGULAR-SALES-TY                                11450000
115300                                    PIC S9(11)V99 COMP-3.         11460000
115400         10  TCMT-REGULAR-SALES-LY                                11470000
115500                                    PIC S9(11)V99 COMP-3.         11480000
115600         10  TCMT-PROMO-SALES-TY    PIC S9(11)V99 COMP-3.         11490000
115700         10  TCMT-PROMO-SALES-LY    PIC S9(11)V99 COMP-3.         11500000
115800         10  TCMT-GOLDSTAR-SALES-TY PIC S9(11)V99 COMP-3.         11510000
115900         10  TCMT-GOLDSTAR-SALES-LY PIC S9(11)V99 COMP-3.         11520000
116000         10  TCMT-CLEAR-SALES-TY    PIC S9(11)V99 COMP-3.         11530000
116100         10  TCMT-CLEAR-SALES-LY    PIC S9(11)V99 COMP-3.         11540000
116200         10  TCMT-UNKWN-SALES-TY    PIC S9(11)V99 COMP-3.         11550000
116300         10  TCMT-UNKWN-SALES-LY    PIC S9(11)V99 COMP-3.         11560000
116400     05  TCMT-PC-DATA.                                            11570000
116500         10  TCMT-TOTAL-MKDN-TY     PIC S9(11)V99 COMP-3.         11580000
116600         10  TCMT-TOTAL-MKDN-LY     PIC S9(11)V99 COMP-3.         11590000
116700         10  TCMT-TOTAL-MKUP-TY     PIC S9(11)V99 COMP-3.         11600000
116800         10  TCMT-TOTAL-MKUP-LY     PIC S9(11)V99 COMP-3.         11610000
116900         10  TCMT-STORE-MKDN-TY     PIC S9(11)V99 COMP-3.         11620000
117000         10  TCMT-BUYER-MKDN-TY     PIC S9(11)V99 COMP-3.         11630000
117100         10  TCMT-PLU-MKDN-TY       PIC S9(11)V99 COMP-3.         11640000
117200         10  TCMT-PLU-MKDN-LY       PIC S9(11)V99 COMP-3.         11650000
117300         10  TCMT-PERM-MKDN-TY      PIC S9(11)V99 COMP-3.         11660000
117400         10  TCMT-PERM-MKDN-LY      PIC S9(11)V99 COMP-3.         11670000
117500         10  TCMT-OTHER-MKDN-TY     PIC S9(11)V99 COMP-3.         11680000
117600         10  TCMT-OTHER-MKDN-LY     PIC S9(11)V99 COMP-3.         11690000
117700         10  TCMT-DEBIT-ALLOW-TY    PIC S9(11)V99 COMP-3.         11700000
117800     05  TCMT-MISC-DATA.                                          11710000
117900         10  TCMT-GROSS-MARGN-TY    PIC S9(11)V99 COMP-3.         11720000
118000         10  TCMT-GROSS-MARGN-LY    PIC S9(11)V99 COMP-3.         11730000
118100         10  TCMT-SHRINK-DLR-TY     PIC S9(11)V99 COMP-3.         11740000
118200         10  TCMT-SHRINK-DLR-LY     PIC S9(11)V99 COMP-3.         11750000
118300         10  TCMT-END-INV-RTL-TY    PIC S9(11)V99 COMP-3.         11760000
118400         10  TCMT-END-INV-RTL-LY    PIC S9(11)V99 COMP-3.         11770000
118500         10  TCMT-END-INV-COST-TY   PIC S9(11)V99 COMP-3.         11780000
118600         10  TCMT-INV-ADJ-TY        PIC S9(11)V99 COMP-3.         11790000
118700         10  TCMT-INV-ADJ-LY        PIC S9(11)V99 COMP-3.         11800000
118800         10  TCMT-RET-TO-VENDR-TY   PIC S9(11)V99 COMP-3.         11810000
118900     05  TCMT-SUMM-RECAP-DATA.                                    11820000
119000         10  TCMT-CUM-TO-DATE-PURCH-RTL-TY                        11830000
119100                                    PIC S9(11)V99 COMP-3.         11840000
119200         10  TCMT-CUM-TO-DATE-PURCH-RTL-LY                        11850000
119300                                    PIC S9(11)V99 COMP-3.         11860000
119400         10  TCMT-CUM-TO-DATE-PURCH-COST-TY                       11870000
119500                                    PIC S9(11)V99 COMP-3.         11880000
119600         10  TCMT-CUM-TO-DATE-PURCH-COST-LY                       11890000
119700                                    PIC S9(11)V99 COMP-3.         11900000
119800**--- USED IN CALCULATING MARKDOWN PCT  FOR UNKNOWN VENDOR        11910000
119900     05  TUVRT-SALES-DATA.                                        11920000
120000         10  TUVRT-TOTAL-SALES-TY   PIC S9(11)V99 COMP-3.         11930000
120100         10  TUVRT-TOTAL-SALES-LY   PIC S9(11)V99 COMP-3.         11940000
120200*--UNKNOWN VENDOR REPORT TOTAL AMOUNTS                            11950000
120300     05  TUVRT-MISC-DATA.                                         11960000
120400         10  TUVRT-GROSS-MARGN-TY   PIC S9(11)V99 COMP-3.         11970000
120500         10  TUVRT-GROSS-MARGN-LY   PIC S9(11)V99 COMP-3.         11980000
120600*--UNKNOWN VENDOR REPORT TOTAL AMOUNTS                            11990000
120700     05  TUVRT-SUMM-RECAP-DATA.                                   12000000
120800         10 TUVRT-STD-PURCH-RETAIL-TY PIC S9(11)V99 COMP-3.       12010000
120900         10 TUVRT-STD-PURCH-RETAIL-LY PIC S9(11)V99 COMP-3.       12020000
121000         10 TUVRT-STD-PURCH-COST-TY   PIC S9(11)V99 COMP-3.       12030000
121100         10 TUVRT-STD-PURCH-COST-LY   PIC S9(11)V99 COMP-3.       12040000
121200/                                                                 12050000
121300******************************************************************12060000
121400*    MISCELLANEOUS CURRENT-MONTH TOTAL AREA.  THIS IS THE TOTAL OF12070000
121500*    ALL THE RECORDS FOR A MISCELLANEOUS VENDOR FOR THE CURRENT   12080000
121600*    MONTH.  THIS AREA IS USED TO PRINT THE CURRENT-MONTH-TABLE   12090000
121700*    AT THE BACK OF EACH PAGE FOR A MISCELLANEOUS VENDOR.         12100000
121800******************************************************************12110000
121900 01  MCMT-MISC-CURRENT-MONTH-TOTALS.                              12120000
122000     05  MCMT-AP-DATA.                                            12130000
122100         10  MCMT-GROSS-COST         PIC S9(11)V99 COMP-3.        12140000
122200         10  MCMT-PURCH-ADJ-COST-TY  PIC S9(11)V99 COMP-3.        12150000
122300         10  MCMT-PURCH-ADJ-COST-LY  PIC S9(11)V99 COMP-3.        12160000
122400         10  MCMT-PURCH-ADJ-RETAIL   PIC S9(11)V99 COMP-3.        12170000
122500         10  MCMT-NET-COST-TY        PIC S9(11)V99 COMP-3.        12180000
122600         10  MCMT-NET-COST-LY        PIC S9(11)V99 COMP-3.        12190000
122700         10  MCMT-RETAIL-PURCH-TY    PIC S9(11)V99 COMP-3.        12200000
122800         10  MCMT-RETAIL-PURCH-LY    PIC S9(11)V99 COMP-3.        12210000
122900         10  MCMT-INITIAL-MARKON-TY                               12220000
123000                                     PIC S9(11)V99 COMP-3.        12230000
123100         10  MCMT-INITIAL-MARKON-LY                               12240000
123200                                     PIC S9(11)V99 COMP-3.        12250000
123300         10  MCMT-NET-MARKON-TY      PIC S9(11)V99 COMP-3.        12260000
123400         10  MCMT-NET-MARKON-LY      PIC S9(11)V99 COMP-3.        12270000
123500         10  MCMT-RECEIPTS-COST-TY   PIC S9(11)V99 COMP-3.        12280000
123600         10  MCMT-RECEIPTS-RTL-TY    PIC S9(11)V99 COMP-3.        12290000
123700         10  MCMT-PURCH-ADJ-RTL-TY   PIC S9(11)V99 COMP-3.        12300000
123800         10  MCMT-RECEIPTS-COST-LY   PIC S9(11)V99 COMP-3.        12310000
123900         10  MCMT-RECEIPTS-RTL-LY    PIC S9(11)V99 COMP-3.        12320000
124000         10  MCMT-PURCH-ADJ-RTL-LY   PIC S9(11)V99 COMP-3.        12330000
124100     05  MCMT-SALES-DATA.                                         12340000
124200         10  MCMT-TOTAL-SALES-TY    PIC S9(11)V99 COMP-3.         12350000
124300         10  MCMT-TOTAL-SALES-LY    PIC S9(11)V99 COMP-3.         12360000
124400         10  MCMT-REGULAR-SALES-TY                                12370000
124500                                    PIC S9(11)V99 COMP-3.         12380000
124600         10  MCMT-REGULAR-SALES-LY                                12390000
124700                                    PIC S9(11)V99 COMP-3.         12400000
124800         10  MCMT-PROMO-SALES-TY    PIC S9(11)V99 COMP-3.         12410000
124900         10  MCMT-PROMO-SALES-LY    PIC S9(11)V99 COMP-3.         12420000
125000         10  MCMT-GOLDSTAR-SALES-TY PIC S9(11)V99 COMP-3.         12430000
125100         10  MCMT-GOLDSTAR-SALES-LY PIC S9(11)V99 COMP-3.         12440000
125200         10  MCMT-CLEAR-SALES-TY    PIC S9(11)V99 COMP-3.         12450000
125300         10  MCMT-CLEAR-SALES-LY    PIC S9(11)V99 COMP-3.         12460000
125400         10  MCMT-UNKWN-SALES-TY    PIC S9(11)V99 COMP-3.         12470000
125500         10  MCMT-UNKWN-SALES-LY    PIC S9(11)V99 COMP-3.         12480000
125600     05  MCMT-PC-DATA.                                            12490000
125700         10  MCMT-TOTAL-MKDN-TY    PIC S9(11)V99 COMP-3.          12500000
125800         10  MCMT-TOTAL-MKDN-LY    PIC S9(11)V99 COMP-3.          12510000
125900         10  MCMT-TOTAL-MKUP-TY    PIC S9(11)V99 COMP-3.          12520000
126000         10  MCMT-TOTAL-MKUP-LY    PIC S9(11)V99 COMP-3.          12530000
126100         10  MCMT-STORE-MKDN-TY    PIC S9(11)V99 COMP-3.          12540000
126200         10  MCMT-BUYER-MKDN-TY    PIC S9(11)V99 COMP-3.          12550000
126300         10  MCMT-PLU-MKDN-TY      PIC S9(11)V99 COMP-3.          12560000
126400         10  MCMT-PLU-MKDN-LY      PIC S9(11)V99 COMP-3.          12570000
126500         10  MCMT-PERM-MKDN-TY     PIC S9(11)V99 COMP-3.          12580000
126600         10  MCMT-PERM-MKDN-LY     PIC S9(11)V99 COMP-3.          12590000
126700         10  MCMT-OTHER-MKDN-TY    PIC S9(11)V99 COMP-3.          12600000
126800         10  MCMT-OTHER-MKDN-LY    PIC S9(11)V99 COMP-3.          12610000
126900         10  MCMT-DEBIT-ALLOW-TY   PIC S9(11)V99 COMP-3.          12620000
127000     05  MCMT-MISC-DATA.                                          12630000
127100         10  MCMT-GROSS-MARGN-TY   PIC S9(11)V99 COMP-3.          12640000
127200         10  MCMT-GROSS-MARGN-LY   PIC S9(11)V99 COMP-3.          12650000
127300         10  MCMT-SHRINK-DLR-TY    PIC S9(11)V99 COMP-3.          12660000
127400         10  MCMT-SHRINK-DLR-LY    PIC S9(11)V99 COMP-3.          12670000
127500         10  MCMT-END-INV-RTL-TY   PIC S9(11)V99 COMP-3.          12680000
127600         10  MCMT-END-INV-RTL-LY   PIC S9(11)V99 COMP-3.          12690000
127700         10  MCMT-END-INV-COST-TY  PIC S9(11)V99 COMP-3.          12700000
127800         10  MCMT-INV-ADJ-TY       PIC S9(11)V99 COMP-3.          12710000
127900         10  MCMT-INV-ADJ-LY       PIC S9(11)V99 COMP-3.          12720000
128000         10  MCMT-RET-TO-VENDR-TY  PIC S9(11)V99 COMP-3.          12730000
128100     05  MCMT-SUMM-RECAP-DATA.                                    12740000
128200         10  MCMT-CUM-TO-DATE-PURCH-RTL-TY                        12750000
128300                                   PIC S9(11)V99 COMP-3.          12760000
128400         10  MCMT-CUM-TO-DATE-PURCH-RTL-LY                        12770000
128500                                   PIC S9(11)V99 COMP-3.          12780000
128600         10  MCMT-CUM-TO-DATE-PURCH-COST-TY                       12790000
128700                                   PIC S9(11)V99 COMP-3.          12800000
128800         10  MCMT-CUM-TO-DATE-PURCH-COST-LY                       12810000
128900                                   PIC S9(11)V99 COMP-3.          12820000
129000/                                                                 12830000
129100******************************************************************12840000
129200*    CLASS TOTAL AREA. USED FOR SEASON-TO-DATE TOTALS WITHIN THE  12850000
129300*    CLASS. THIS IS THE TOTAL OF SIMILAR RECORDS (I.E., THE SAME  12860000
129400*    REQ#, DEPT, ENT ID, CLASS ,ETC) BUT DIFFERENT DATES.         12870000
129500******************************************************************12880000
129600 01  CT-CLASS-TOTALS.                                             12890000
129700     05  CT-AP-DATA                OCCURS 9.                      12900000
129800         10  CT-GROSS-COST           PIC S9(11)V99 COMP-3.        12910000
129900         10  CT-PURCH-ADJ-COST-TY    PIC S9(11)V99 COMP-3.        12920000
130000         10  CT-PURCH-ADJ-COST-LY    PIC S9(11)V99 COMP-3.        12930000
130100         10  CT-PURCH-ADJ-RETAIL     PIC S9(11)V99 COMP-3.        12940000
130200         10  CT-NET-COST-TY          PIC S9(11)V99 COMP-3.        12950000
130300         10  CT-NET-COST-LY          PIC S9(11)V99 COMP-3.        12960000
130400         10  CT-RETAIL-PURCH-TY      PIC S9(11)V99 COMP-3.        12970000
130500         10  CT-RETAIL-PURCH-LY      PIC S9(11)V99 COMP-3.        12980000
130600         10  CT-INITIAL-MARKON-TY    PIC S9(11)V99 COMP-3.        12990000
130700         10  CT-INITIAL-MARKON-LY    PIC S9(11)V99 COMP-3.        13000000
130800         10  CT-NET-MARKON-TY        PIC S9(11)V99 COMP-3.        13010000
130900         10  CT-NET-MARKON-LY        PIC S9(11)V99 COMP-3.        13020000
131000         10  CT-AP-CLASS             PIC 99.                      13030000
131100         10  CT-AP-CLASS-DESC        PIC X(30).                   13040000
131200         10  CT-RECEIPTS-COST-TY     PIC S9(11)V99 COMP-3.        13050000
131300         10  CT-RECEIPTS-RTL-TY      PIC S9(11)V99 COMP-3.        13060000
131400         10  CT-PURCH-ADJ-RTL-TY     PIC S9(11)V99 COMP-3.        13070000
131500         10  CT-RECEIPTS-COST-LY     PIC S9(11)V99 COMP-3.        13080000
131600         10  CT-RECEIPTS-RTL-LY      PIC S9(11)V99 COMP-3.        13090000
131700         10  CT-PURCH-ADJ-RTL-LY     PIC S9(11)V99 COMP-3.        13100000
131800     05  CT-SALES-DATA             OCCURS 9.                      13110000
131900         10  CT-TOTAL-SALES-TY     PIC S9(11)V99 COMP-3.          13120000
132000         10  CT-TOTAL-SALES-LY     PIC S9(11)V99 COMP-3.          13130000
132100         10  CT-REGULAR-SALES-TY                                  13140000
132200                                   PIC S9(11)V99 COMP-3.          13150000
132300         10  CT-REGULAR-SALES-LY                                  13160000
132400                                   PIC S9(11)V99 COMP-3.          13170000
132500         10  CT-PROMO-SALES-TY     PIC S9(11)V99 COMP-3.          13180000
132600         10  CT-PROMO-SALES-LY     PIC S9(11)V99 COMP-3.          13190000
132700         10  CT-GOLDSTAR-SALES-TY  PIC S9(11)V99 COMP-3.          13200000
132800         10  CT-GOLDSTAR-SALES-LY  PIC S9(11)V99 COMP-3.          13210000
132900         10  CT-CLEAR-SALES-TY     PIC S9(11)V99 COMP-3.          13220000
133000         10  CT-CLEAR-SALES-LY     PIC S9(11)V99 COMP-3.          13230000
133100         10  CT-UNKWN-SALES-TY     PIC S9(11)V99 COMP-3.          13240000
133200         10  CT-UNKWN-SALES-LY     PIC S9(11)V99 COMP-3.          13250000
133300         10  CT-SALES-CLASS        PIC 99.                        13260000
133400         10  CT-SALES-CLASS-DESC   PIC X(30).                     13270000
133500     05  CT-PC-DATA                OCCURS 9.                      13280000
133600         10  CT-TOTAL-MKDN-TY      PIC S9(11)V99 COMP-3.          13290000
133700         10  CT-TOTAL-MKDN-LY      PIC S9(11)V99 COMP-3.          13300000
133800         10  CT-TOTAL-MKUP-TY      PIC S9(11)V99 COMP-3.          13310000
133900         10  CT-TOTAL-MKUP-LY      PIC S9(11)V99 COMP-3.          13320000
134000         10  CT-STORE-MKDN-TY      PIC S9(11)V99 COMP-3.          13330000
134100         10  CT-BUYER-MKDN-TY      PIC S9(11)V99 COMP-3.          13340000
134200         10  CT-PLU-MKDN-TY        PIC S9(11)V99 COMP-3.          13350000
134300         10  CT-PLU-MKDN-LY        PIC S9(11)V99 COMP-3.          13360000
134400         10  CT-PERM-MKDN-TY       PIC S9(11)V99 COMP-3.          13370000
134500         10  CT-PERM-MKDN-LY       PIC S9(11)V99 COMP-3.          13380000
134600         10  CT-OTHER-MKDN-TY      PIC S9(11)V99 COMP-3.          13390000
134700         10  CT-OTHER-MKDN-LY      PIC S9(11)V99 COMP-3.          13400000
134800         10  CT-DEBIT-ALLOW-TY     PIC S9(11)V99 COMP-3.          13410000
134900         10  CT-PC-CLASS           PIC 99.                        13420000
135000         10  CT-PC-CLASS-DESC      PIC X(30).                     13430000
135100     05  CT-MISC-DATA              OCCURS 9.                      13440000
135200         10  CT-GROSS-MARGN-TY     PIC S9(11)V99 COMP-3.          13450000
135300         10  CT-GROSS-MARGN-LY     PIC S9(11)V99 COMP-3.          13460000
135400         10  CT-SHRINK-DLR-TY      PIC S9(11)V99 COMP-3.          13470000
135500         10  CT-SHRINK-DLR-LY      PIC S9(11)V99 COMP-3.          13480000
135600         10  CT-END-INV-RTL-TY     PIC S9(11)V99 COMP-3.          13490000
135700         10  CT-END-INV-RTL-LY     PIC S9(11)V99 COMP-3.          13500000
135800         10  CT-END-INV-COST-TY    PIC S9(11)V99 COMP-3.          13510000
135900         10  CT-INV-ADJ-TY         PIC S9(11)V99 COMP-3.          13520000
136000         10  CT-INV-ADJ-LY         PIC S9(11)V99 COMP-3.          13530000
136100         10  CT-RET-TO-VENDR-TY    PIC S9(11)V99 COMP-3.          13540000
136200         10  CT-MISC-CLASS-DESC    PIC X(30).                     13550000
136300         10  CT-MISC-CLASS         PIC 99.                        13560000
136400     05  CT-SUMM-RECAP-DATA        OCCURS 9.                      13570000
136500         10  CT-CUM-TO-DATE-PURCH-RETAIL-TY                       13580000
136600                                   PIC S9(11)V99 COMP-3.          13590000
136700         10  CT-CUM-TO-DATE-PURCH-RETAIL-LY                       13600000
136800                                   PIC S9(11)V99 COMP-3.          13610000
136900         10  CT-CUM-TO-DATE-PURCH-COST-TY                         13620000
137000                                   PIC S9(11)V99 COMP-3.          13630000
137100         10  CT-CUM-TO-DATE-PURCH-COST-LY                         13640000
137200                                   PIC S9(11)V99 COMP-3.          13650000
137300/                                                                 13660000
137400******************************************************************13670000
137500*    VENDOR TOTAL AREA.                                           13680000
137600******************************************************************13690000
137700 01  VT-VENDOR-TOTALS.                                            13700000
137800     05  VT-AP-DATA.                                              13710000
137900         10  VT-GROSS-COST         PIC S9(11)V99 COMP-3.          13720000
138000         10  VT-PURCH-ADJ-COST-TY  PIC S9(11)V99 COMP-3.          13730000
138100         10  VT-PURCH-ADJ-COST-LY  PIC S9(11)V99 COMP-3.          13740000
138200         10  VT-PURCH-ADJ-RETAIL   PIC S9(11)V99 COMP-3.          13750000
138300         10  VT-NET-COST-TY        PIC S9(11)V99 COMP-3.          13760000
138400         10  VT-NET-COST-LY        PIC S9(11)V99 COMP-3.          13770000
138500         10  VT-RETAIL-PURCH-TY    PIC S9(11)V99 COMP-3.          13780000
138600         10  VT-RETAIL-PURCH-LY    PIC S9(11)V99 COMP-3.          13790000
138700         10  VT-INITIAL-MARKON-TY  PIC S9(11)V99 COMP-3.          13800000
138800         10  VT-INITIAL-MARKON-LY  PIC S9(11)V99 COMP-3.          13810000
138900         10  VT-NET-MARKON-TY      PIC S9(11)V99 COMP-3.          13820000
139000         10  VT-NET-MARKON-LY      PIC S9(11)V99 COMP-3.          13830000
139100         10  VT-RECEIPTS-COST-TY   PIC S9(11)V99 COMP-3.          13840000
139200         10  VT-RECEIPTS-RTL-TY    PIC S9(11)V99 COMP-3.          13850000
139300         10  VT-PURCH-ADJ-RTL-TY   PIC S9(11)V99 COMP-3.          13860000
139400         10  VT-RECEIPTS-COST-LY   PIC S9(11)V99 COMP-3.          13870000
139500         10  VT-RECEIPTS-RTL-LY    PIC S9(11)V99 COMP-3.          13880000
139600         10  VT-PURCH-ADJ-RTL-LY   PIC S9(11)V99 COMP-3.          13890000
139700     05  VT-SALES-DATA.                                           13900000
139800         10  VT-TOTAL-SALES-TY     PIC S9(11)V99 COMP-3.          13910000
139900         10  VT-TOTAL-SALES-LY     PIC S9(11)V99 COMP-3.          13920000
140000         10  VT-REGULAR-SALES-TY                                  13930000
140100                                   PIC S9(11)V99 COMP-3.          13940000
140200         10  VT-REGULAR-SALES-LY                                  13950000
140300                                   PIC S9(11)V99 COMP-3.          13960000
140400         10  VT-PROMO-SALES-TY     PIC S9(11)V99 COMP-3.          13970000
140500         10  VT-PROMO-SALES-LY     PIC S9(11)V99 COMP-3.          13980000
140600         10  VT-GOLDSTAR-SALES-TY  PIC S9(11)V99 COMP-3.          13990000
140700         10  VT-GOLDSTAR-SALES-LY  PIC S9(11)V99 COMP-3.          14000000
140800         10  VT-CLEAR-SALES-TY     PIC S9(11)V99 COMP-3.          14010000
140900         10  VT-CLEAR-SALES-LY     PIC S9(11)V99 COMP-3.          14020000
141000         10  VT-UNKWN-SALES-TY     PIC S9(11)V99 COMP-3.          14030000
141100         10  VT-UNKWN-SALES-LY     PIC S9(11)V99 COMP-3.          14040000
141200     05  VT-PC-DATA.                                              14050000
141300         10  VT-TOTAL-MKDN-TY      PIC S9(11)V99 COMP-3.          14060000
141400         10  VT-TOTAL-MKDN-LY      PIC S9(11)V99 COMP-3.          14070000
141500         10  VT-TOTAL-MKUP-TY      PIC S9(11)V99 COMP-3.          14080000
141600         10  VT-TOTAL-MKUP-LY      PIC S9(11)V99 COMP-3.          14090000
141700         10  VT-STORE-MKDN-TY      PIC S9(11)V99 COMP-3.          14100000
141800         10  VT-BUYER-MKDN-TY      PIC S9(11)V99 COMP-3.          14110000
141900         10  VT-PLU-MKDN-TY        PIC S9(11)V99 COMP-3.          14120000
142000         10  VT-PLU-MKDN-LY        PIC S9(11)V99 COMP-3.          14130000
142100         10  VT-PERM-MKDN-TY       PIC S9(11)V99 COMP-3.          14140000
142200         10  VT-PERM-MKDN-LY       PIC S9(11)V99 COMP-3.          14150000
142300         10  VT-OTHER-MKDN-TY      PIC S9(11)V99 COMP-3.          14160000
142400         10  VT-OTHER-MKDN-LY      PIC S9(11)V99 COMP-3.          14170000
142500         10  VT-DEBIT-ALLOW-TY     PIC S9(11)V99 COMP-3.          14180000
142600     05  VT-MISC-DATA.                                            14190000
142700         10  VT-GROSS-MARGN-TY     PIC S9(11)V99 COMP-3.          14200000
142800         10  VT-GROSS-MARGN-LY     PIC S9(11)V99 COMP-3.          14210000
142900         10  VT-SHRINK-DLR-TY      PIC S9(11)V99 COMP-3.          14220000
143000         10  VT-SHRINK-DLR-LY      PIC S9(11)V99 COMP-3.          14230000
143100         10  VT-END-INV-RTL-TY     PIC S9(11)V99 COMP-3.          14240000
143200         10  VT-END-INV-RTL-LY     PIC S9(11)V99 COMP-3.          14250000
143300         10  VT-END-INV-COST-TY    PIC S9(11)V99 COMP-3.          14260000
143400         10  VT-INV-ADJ-TY         PIC S9(11)V99 COMP-3.          14270000
143500         10  VT-INV-ADJ-LY         PIC S9(11)V99 COMP-3.          14280000
143600         10  VT-RET-TO-VENDR-TY    PIC S9(11)V99 COMP-3.          14290000
143700     05  VT-SUMM-RECAP-DATA.                                      14300000
143800         10  VT-CUM-TO-DATE-PURCH-RETAIL-TY                       14310000
143900                                   PIC S9(11)V99 COMP-3.          14320000
144000         10  VT-CUM-TO-DATE-PURCH-RETAIL-LY                       14330000
144100                                   PIC S9(11)V99 COMP-3.          14340000
144200         10  VT-CUM-TO-DATE-PURCH-COST-TY                         14350000
144300                                   PIC S9(11)V99 COMP-3.          14360000
144400         10  VT-CUM-TO-DATE-PURCH-COST-LY                         14370000
144500                                   PIC S9(11)V99 COMP-3.          14380000
144600/                                                                 14390000
144700******************************************************************14400000
144800*    MISCELLANEOUS VENDOR TOTAL AREA.                             14410000
144900******************************************************************14420000
145000 01  MVT-MISC-VENDOR-TOTALS.                                      14430000
145100     05  MVT-AP-DATA.                                             14440000
145200         10  MVT-GROSS-COST        PIC S9(11)V99 COMP-3.          14450000
145300         10  MVT-PURCH-ADJ-COST-TY PIC S9(11)V99 COMP-3.          14460000
145400         10  MVT-PURCH-ADJ-COST-LY PIC S9(11)V99 COMP-3.          14470000
145500         10  MVT-PURCH-ADJ-RETAIL  PIC S9(11)V99 COMP-3.          14480000
145600         10  MVT-NET-COST-TY       PIC S9(11)V99 COMP-3.          14490000
145700         10  MVT-NET-COST-LY       PIC S9(11)V99 COMP-3.          14500000
145800         10  MVT-RETAIL-PURCH-TY   PIC S9(11)V99 COMP-3.          14510000
145900         10  MVT-RETAIL-PURCH-LY   PIC S9(11)V99 COMP-3.          14520000
146000         10  MVT-INITIAL-MARKON-TY PIC S9(11)V99 COMP-3.          14530000
146100         10  MVT-INITIAL-MARKON-LY PIC S9(11)V99 COMP-3.          14540000
146200         10  MVT-NET-MARKON-TY     PIC S9(11)V99 COMP-3.          14550000
146300         10  MVT-NET-MARKON-LY     PIC S9(11)V99 COMP-3.          14560000
146400         10  MVT-RECEIPTS-COST-TY  PIC S9(11)V99 COMP-3.          14570000
146500         10  MVT-RECEIPTS-RTL-TY   PIC S9(11)V99 COMP-3.          14580000
146600         10  MVT-PURCH-ADJ-RTL-TY  PIC S9(11)V99 COMP-3.          14590000
146700         10  MVT-RECEIPTS-COST-LY  PIC S9(11)V99 COMP-3.          14600000
146800         10  MVT-RECEIPTS-RTL-LY   PIC S9(11)V99 COMP-3.          14610000
146900         10  MVT-PURCH-ADJ-RTL-LY  PIC S9(11)V99 COMP-3.          14620000
147000     05  MVT-SALES-DATA.                                          14630000
147100         10  MVT-TOTAL-SALES-TY    PIC S9(11)V99 COMP-3.          14640000
147200         10  MVT-TOTAL-SALES-LY    PIC S9(11)V99 COMP-3.          14650000
147300         10  MVT-REGULAR-SALES-TY                                 14660000
147400                                   PIC S9(11)V99 COMP-3.          14670000
147500         10  MVT-REGULAR-SALES-LY                                 14680000
147600                                   PIC S9(11)V99 COMP-3.          14690000
147700         10  MVT-PROMO-SALES-TY    PIC S9(11)V99 COMP-3.          14700000
147800         10  MVT-PROMO-SALES-LY    PIC S9(11)V99 COMP-3.          14710000
147900         10  MVT-GOLDSTAR-SALES-TY PIC S9(11)V99 COMP-3.          14720000
148000         10  MVT-GOLDSTAR-SALES-LY PIC S9(11)V99 COMP-3.          14730000
148100         10  MVT-CLEAR-SALES-TY    PIC S9(11)V99 COMP-3.          14740000
148200         10  MVT-CLEAR-SALES-LY    PIC S9(11)V99 COMP-3.          14750000
148300         10  MVT-UNKWN-SALES-TY    PIC S9(11)V99 COMP-3.          14760000
148400         10  MVT-UNKWN-SALES-LY    PIC S9(11)V99 COMP-3.          14770000
148500     05  MVT-PC-DATA.                                             14780000
148600         10  MVT-TOTAL-MKDN-TY     PIC S9(11)V99 COMP-3.          14790000
148700         10  MVT-TOTAL-MKDN-LY     PIC S9(11)V99 COMP-3.          14800000
148800         10  MVT-TOTAL-MKUP-TY     PIC S9(11)V99 COMP-3.          14810000
148900         10  MVT-TOTAL-MKUP-LY     PIC S9(11)V99 COMP-3.          14820000
149000         10  MVT-STORE-MKDN-TY     PIC S9(11)V99 COMP-3.          14830000
149100         10  MVT-BUYER-MKDN-TY     PIC S9(11)V99 COMP-3.          14840000
149200         10  MVT-PLU-MKDN-TY       PIC S9(11)V99 COMP-3.          14850000
149300         10  MVT-PLU-MKDN-LY       PIC S9(11)V99 COMP-3.          14860000
149400         10  MVT-PERM-MKDN-TY      PIC S9(11)V99 COMP-3.          14870000
149500         10  MVT-PERM-MKDN-LY      PIC S9(11)V99 COMP-3.          14880000
149600         10  MVT-OTHER-MKDN-TY     PIC S9(11)V99 COMP-3.          14890000
149700         10  MVT-OTHER-MKDN-LY     PIC S9(11)V99 COMP-3.          14900000
149800         10  MVT-DEBIT-ALLOW-TY    PIC S9(11)V99 COMP-3.          14910000
149900     05  MVT-MISC-DATA.                                           14920000
150000         10  MVT-GROSS-MARGN-TY    PIC S9(11)V99 COMP-3.          14930000
150100         10  MVT-GROSS-MARGN-LY    PIC S9(11)V99 COMP-3.          14940000
150200         10  MVT-SHRINK-DLR-TY     PIC S9(11)V99 COMP-3.          14950000
150300         10  MVT-SHRINK-DLR-LY     PIC S9(11)V99 COMP-3.          14960000
150400         10  MVT-END-INV-RTL-TY    PIC S9(11)V99 COMP-3.          14970000
150500         10  MVT-END-INV-RTL-LY    PIC S9(11)V99 COMP-3.          14980000
150600         10  MVT-END-INV-COST-TY   PIC S9(11)V99 COMP-3.          14990000
150700         10  MVT-INV-ADJ-TY        PIC S9(11)V99 COMP-3.          15000000
150800         10  MVT-INV-ADJ-LY        PIC S9(11)V99 COMP-3.          15010000
150900         10  MVT-RET-TO-VENDR-TY   PIC S9(11)V99 COMP-3.          15020000
151000     05  MVT-SUMM-RECAP-DATA.                                     15030000
151100         10  MVT-CUM-TO-DATE-PURCH-RTL-TY                         15040000
151200                                   PIC S9(11)V99 COMP-3.          15050000
151300         10  MVT-CUM-TO-DATE-PURCH-RTL-LY                         15060000
151400                                   PIC S9(11)V99 COMP-3.          15070000
151500         10  MVT-CUM-TO-DATE-PURCH-COST-TY                        15080000
151600                                   PIC S9(11)V99 COMP-3.          15090000
151700         10  MVT-CUM-TO-DATE-PURCH-COST-LY                        15100000
151800                                   PIC S9(11)V99 COMP-3.          15110000
151900******************************************************************15120000
152000*    REPORT TOTAL AREA.  RECORDS WITHIN A REQUEST ARE ACCUMULATED 15130000
152100*    IN THIS AREA.  AT BREAK OF REQUEST # (OR AT EOF) THIS AREA   15140000
152200*    IS PRINTED AND INITIALIZED.                                  15150000
152300******************************************************************15160000
152400 01  RT-REPORT-TOTALS.                                            15170000
152500     05  RT-AP-DATA.                                              15180000
152600         10  RT-GROSS-COST         PIC S9(11)V99 COMP-3.          15190000
152700         10  RT-PURCH-ADJ-COST-TY  PIC S9(11)V99 COMP-3.          15200000
152800         10  RT-PURCH-ADJ-COST-LY  PIC S9(11)V99 COMP-3.          15210000
152900         10  RT-PURCH-ADJ-RETAIL   PIC S9(11)V99 COMP-3.          15220000
153000         10  RT-NET-COST-TY        PIC S9(11)V99 COMP-3.          15230000
153100         10  RT-NET-COST-LY        PIC S9(11)V99 COMP-3.          15240000
153200         10  RT-RETAIL-PURCH-TY    PIC S9(11)V99 COMP-3.          15250000
153300         10  RT-RETAIL-PURCH-LY    PIC S9(11)V99 COMP-3.          15260000
153400         10  RT-INITIAL-MARKON-TY  PIC S9(11)V99 COMP-3.          15270000
153500         10  RT-INITIAL-MARKON-LY  PIC S9(11)V99 COMP-3.          15280000
153600         10  RT-NET-MARKON-TY      PIC S9(11)V99 COMP-3.          15290000
153700         10  RT-NET-MARKON-LY      PIC S9(11)V99 COMP-3.          15300000
153800         10  RT-RECEIPTS-COST-TY   PIC S9(11)V99 COMP-3.          15310000
153900         10  RT-RECEIPTS-RTL-TY    PIC S9(11)V99 COMP-3.          15320000
154000         10  RT-PURCH-ADJ-RTL-TY   PIC S9(11)V99 COMP-3.          15330000
154100         10  RT-RECEIPTS-COST-LY   PIC S9(11)V99 COMP-3.          15340000
154200         10  RT-RECEIPTS-RTL-LY    PIC S9(11)V99 COMP-3.          15350000
154300         10  RT-PURCH-ADJ-RTL-LY   PIC S9(11)V99 COMP-3.          15360000
154400     05  RT-SALES-DATA.                                           15370000
154500         10  RT-TOTAL-SALES-TY     PIC S9(11)V99 COMP-3.          15380000
154600         10  RT-TOTAL-SALES-LY     PIC S9(11)V99 COMP-3.          15390000
154700         10  RT-REGULAR-SALES-TY                                  15400000
154800                                   PIC S9(11)V99 COMP-3.          15410000
154900         10  RT-REGULAR-SALES-LY                                  15420000
155000                                   PIC S9(11)V99 COMP-3.          15430000
155100         10  RT-PROMO-SALES-TY     PIC S9(11)V99 COMP-3.          15440000
155200         10  RT-PROMO-SALES-LY     PIC S9(11)V99 COMP-3.          15450000
155300         10  RT-GOLDSTAR-SALES-TY  PIC S9(11)V99 COMP-3.          15460000
155400         10  RT-GOLDSTAR-SALES-LY  PIC S9(11)V99 COMP-3.          15470000
155500         10  RT-CLEAR-SALES-TY     PIC S9(11)V99 COMP-3.          15480000
155600         10  RT-CLEAR-SALES-LY     PIC S9(11)V99 COMP-3.          15490000
155700         10  RT-UNKWN-SALES-TY     PIC S9(11)V99 COMP-3.          15500000
155800         10  RT-UNKWN-SALES-LY     PIC S9(11)V99 COMP-3.          15510000
155900**--- USED IN CALCULATING MARKDOWN PCT  FOR UNKNOWN VENDOR        15520000
156000     05  UVRT-SALES-DATA.                                         15530000
156100         10  UVRT-TOTAL-SALES-TY   PIC S9(11)V99 COMP-3.          15540000
156200         10  UVRT-TOTAL-SALES-LY   PIC S9(11)V99 COMP-3.          15550000
156300     05  RT-PC-DATA.                                              15560000
156400         10  RT-TOTAL-MKDN-TY      PIC S9(11)V99 COMP-3.          15570000
156500         10  RT-TOTAL-MKDN-LY      PIC S9(11)V99 COMP-3.          15580000
156600         10  RT-TOTAL-MKUP-TY      PIC S9(11)V99 COMP-3.          15590000
156700         10  RT-TOTAL-MKUP-LY      PIC S9(11)V99 COMP-3.          15600000
156800         10  RT-STORE-MKDN-TY      PIC S9(11)V99 COMP-3.          15610000
156900         10  RT-BUYER-MKDN-TY      PIC S9(11)V99 COMP-3.          15620000
157000         10  RT-PLU-MKDN-TY        PIC S9(11)V99 COMP-3.          15630000
157100         10  RT-PLU-MKDN-LY        PIC S9(11)V99 COMP-3.          15640000
157200         10  RT-PERM-MKDN-TY       PIC S9(11)V99 COMP-3.          15650000
157300         10  RT-PERM-MKDN-LY       PIC S9(11)V99 COMP-3.          15660000
157400         10  RT-OTHER-MKDN-TY      PIC S9(11)V99 COMP-3.          15670000
157500         10  RT-OTHER-MKDN-LY      PIC S9(11)V99 COMP-3.          15680000
157600         10  RT-DEBIT-ALLOW-TY     PIC S9(11)V99 COMP-3.          15690000
157700     05  RT-MISC-DATA.                                            15700000
157800         10  RT-GROSS-MARGN-TY     PIC S9(11)V99 COMP-3.          15710000
157900         10  RT-GROSS-MARGN-LY     PIC S9(11)V99 COMP-3.          15720000
158000         10  RT-SHRINK-DLR-TY      PIC S9(11)V99 COMP-3.          15730000
158100         10  RT-SHRINK-DLR-LY      PIC S9(11)V99 COMP-3.          15740000
158200         10  RT-END-INV-RTL-TY     PIC S9(11)V99 COMP-3.          15750000
158300         10  RT-END-INV-RTL-LY     PIC S9(11)V99 COMP-3.          15760000
158400         10  RT-END-INV-COST-TY    PIC S9(11)V99 COMP-3.          15770000
158500         10  RT-INV-ADJ-TY         PIC S9(11)V99 COMP-3.          15780000
158600         10  RT-INV-ADJ-LY         PIC S9(11)V99 COMP-3.          15790000
158700         10  RT-RET-TO-VENDR-TY    PIC S9(11)V99 COMP-3.          15800000
158800*--UNKNOWN VENDOR REPORT TOTAL AMOUNTS                            15810000
158900     05  UVRT-MISC-DATA.                                          15820000
159000         10  UVRT-GROSS-MARGN-TY   PIC S9(11)V99 COMP-3.          15830000
159100         10  UVRT-GROSS-MARGN-LY   PIC S9(11)V99 COMP-3.          15840000
159200     05  RT-SUMM-RECAP-DATA.                                      15850000
159300         10  RT-CUM-TO-DATE-PURCH-RETAIL-TY                       15860000
159400                                   PIC S9(11)V99 COMP-3.          15870000
159500         10  RT-CUM-TO-DATE-PURCH-RETAIL-LY                       15880000
159600                                   PIC S9(11)V99 COMP-3.          15890000
159700         10  RT-CUM-TO-DATE-PURCH-COST-TY                         15900000
159800                                   PIC S9(11)V99 COMP-3.          15910000
159900         10  RT-CUM-TO-DATE-PURCH-COST-LY                         15920000
160000                                   PIC S9(11)V99 COMP-3.          15930000
160100*--UNKNOWN VENDOR REPORT TOTAL AMOUNTS                            15940000
160200     05  UVRT-SUMM-RECAP-DATA.                                    15950000
160300         10  UVRT-STD-PURCH-RETAIL-TY PIC S9(11)V99 COMP-3.       15960000
160400         10  UVRT-STD-PURCH-RETAIL-LY PIC S9(11)V99 COMP-3.       15970000
160500         10  UVRT-STD-PURCH-COST-TY   PIC S9(11)V99 COMP-3.       15980000
160600         10  UVRT-STD-PURCH-COST-LY   PIC S9(11)V99 COMP-3.       15990000
160700                                                                  16000000
160800 01 ABEND-AREAS.                                                  16010000
160900     05 ABEND-CODE               PIC S9(04)  VALUE ZERO           16020000
161000                                             COMP SYNC.           16030000
161100         88  AC-BAD-CONTROL-CARD             VALUE +4003.         16040000
161200         88  AC-DB2-ERROR                    VALUE +4013.         16050000
161300     05  AA-ABEND-LIT            PIC X(40)   VALUE                16060000
161400           '*****       ABEND'.                                   16070000
161500     05  AA-PROGRAM-LIT          PIC X(40)   VALUE                16080000
161600             '*****   PROGRAM: MLKRP800'.                         16090000
161700     05  AA-PARAGRAPH-LIT.                                        16100000
161800         10  FILLER              PIC X(17)   VALUE                16110000
161900             '***** PARAGRAPH: '.                                 16120000
162000         10  AA-PARAGRAPH-NAME   PIC X(35)   VALUE SPACES.        16130000
162100     05  AA-MESSAGE-LINE.                                         16140000
162200         10  FILLER              PIC X(06)   VALUE '*****'.       16150000
162300         10  AA-MESSAGE          PIC X(127)  VALUE SPACES.        16160000
162400     05  AA-DB2-ERROR-LIT        PIC X(40)   VALUE                16170000
162500             '*****    DB2 ERROR'.                                16180000
162600     05  AA-DB2-OPERATION-LIT.                                    16190000
162700         10  FILLER              PIC X(17)   VALUE                16200000
162800             '***** OPERATION: '.                                 16210000
162900         10  AA-DB2-OPERATION.                                    16220000
163000             15  AA-DB2-OP-1     PIC X(25)   VALUE SPACES.        16230000
163100             15  AA-DB2-OP-2     PIC X(25)   VALUE SPACES.        16240000
163200     05  AA-DB2-TABLE-1          PIC X(08)   VALUE SPACES.        16250000
163300     05  AA-DB2-TABLE-2          PIC X(08)   VALUE SPACES.        16260000
163400     05  AA-DB2-TABLE-3          PIC X(08)   VALUE SPACES.        16270000
163500     05  AA-DB2-TABLE-4          PIC X(08)   VALUE SPACES.        16280000
163600                                                                  16290000
163700 EJECT                                                            16300000
163800                                                                  16310000
163900******************************************************************16320000
164000*  DB2 ERROR MESSAGES FORMAT AREA.                                16330000
164100******************************************************************16340000
164200     COPY DPWS004.                                                16350000
164300                                                                  16360000
164400******************************************************************16370000
164500*  DB2 ERRORS                                                     16380000
164600******************************************************************16390000
164700     COPY SQLCA2.                                                 16400000
164800                                                                  16410000
164900******************************************************************16420000
165000*  DB2 MLCNTL TABLE LAYOUT                                        16430000
165100******************************************************************16440000
165200     EXEC SQL                                                     16450000
165300          INCLUDE TMLCNTL                                         16460000
165400     END-EXEC.                                                    16470000
165500                                                                  16480000
165600******************************************************************16490000
165700*  DB2 DTATTR TABLE LAYOUT                                        16500000
165800******************************************************************16510000
165900     EXEC SQL                                                     16520000
166000          INCLUDE TDTATTR                                         16530000
166100     END-EXEC.                                                    16540000
166200                                                                  16550000
166300******************************************************************16560000
166400*  DB2 COMMUNICATION AREA                                         16570000
166500******************************************************************16580000
166600     EXEC SQL                                                     16590000
166700          INCLUDE SQLCA                                           16600000
166800     END-EXEC.                                                    16610000
166900                                                                  16620000
167000 PROCEDURE DIVISION.                                              16630000
167100                                                                  16640000
167200 0000-MAINLINE-PROCESSING.                                        16650000
167300******************************************************************16660000
167400*   0000-MAINLINE-PROCESSING                                     *16670000
167500*   MAIN MODULE.  PERFORMS:  1.  HOUSEKEEPING                    *16680000
167600*                            2.  MAIN ROUTINE UNTIL EOF          *16690000
167700*                            3.  END PROCESSING                  *16700000
167800******************************************************************16710000
167900                                                                  16720000
168000     PERFORM 1000-HOUSEKEEPING.                                   16730000
168100     PERFORM 2000-MAIN-ROUTINE                                    16740000
168200         UNTIL PI-INPUT-EOF.                                      16750000
168300     PERFORM 4000-EOF-ROUTINE.                                    16760000
168400     STOP RUN.                                                    16770000
168500/                                                                 16780000
168600 1000-HOUSEKEEPING.                                               16790000
168700******************************************************************16800000
168800*   1000-HOUSEKEEPING                                            *16810000
168900*   DOES THE FOLLOWING:                                          *16820000
169000*      1.  OPEN INPUT AND OUTPUT FILES                           *16830000
169100*      2.  ACCEPT SYSTEM DATE                                    *16840000
169200*      3.  CONTROL CARD                                          *16850000
169300*                                                                *16860000
169400*   PERFORMED BY: 0000-MAINLINE-PROCESSING                       *16870000
169500******************************************************************16880000
169600                                                                  16890000
169700     OPEN INPUT  VA-REPORT-EXTRACT-FILE                           16900000
169800          OUTPUT REPORT-FILE.                                     16910000
169900                                                                  16920000
170000     INITIALIZE PT-PROGRAM-TABLE                                  16930000
170100                CM-CURRENT-MONTH-TABLE                            16940000
170200                CMT-CURRENT-MONTH-TOTALS                          16950000
170300                TCMT-CURRENT-MONTH-TOTALS                         16960000
170400                MCMT-MISC-CURRENT-MONTH-TOTALS                    16970000
170500                RT-REPORT-TOTALS                                  16980000
170600                CT-CLASS-TOTALS                                   16990000
170700                VT-VENDOR-TOTALS                                  17000000
170800                MVT-MISC-VENDOR-TOTALS.                           17010000
170900                                                                  17020000
171000     MOVE FUNCTION CURRENT-DATE (3:2) TO DP200O-RUN-YEAR.         17030000
171100     MOVE FUNCTION CURRENT-DATE (5:2) TO DP200O-RUN-MONTH.        17040000
171200     MOVE FUNCTION CURRENT-DATE (7:2) TO DP200O-RUN-DAY.          17050000
171300     MOVE FUNCTION CURRENT-DATE (9:2) TO DP200O-RUN-HOUR.         17060000
171400     MOVE FUNCTION CURRENT-DATE (11:2) TO DP200O-RUN-MINUTE.      17070000
171500     MOVE PC-PROGRAM-NAME TO DP200O-PROGRAM-NAME.                 17080000
171600     MOVE 1 TO DP200O-REPORT-NUMBER.                              17090000
171700                                                                  17100000
171800     ACCEPT CC-CONTROL-CARD.                                      17110000
171900     IF CC-FISCAL-END-DATE = SPACES                               17120000
172000         PERFORM 7000-SELECT-TMLCNTL                              17130000
W02191******   DISPLAY 'USING TMLCNTL OPEN FISCAL MONTH END DATE: '     17140000
W02191         DISPLAY 'USING TMLCNTL PSTG FISCAL MONTH END DATE: '     17150000
172200                  PV-OPN-FSCL-MN-DTE                              17160000
172300     ELSE                                                         17170000
172400         DISPLAY 'USING INPUT CONTROL CARD FISCAL END DATE: '     17180000
172500                  CC-CONTROL-CARD                                 17190000
172600         IF CC-FISCAL-END-YEAR IS NUMERIC                         17200000
172700           AND CC-FISCAL-END-DSH1 = '-'                           17210000
172800           AND CC-FISCAL-END-MONTH IS NUMERIC                     17220000
172900           AND CC-FISCAL-END-DSH2 = '-'                           17230000
173000           AND CC-FISCAL-END-DAY IS NUMERIC                       17240000
173100             MOVE CC-FISCAL-END-DATE TO PV-OPN-FSCL-MN-DTE        17250000
173200         ELSE                                                     17260000
173300             SET AC-BAD-CONTROL-CARD TO TRUE                      17270000
173400             DISPLAY 'INVALID INPUT CONTROL CARD FISCAL END DATE' 17280000
173500             DISPLAY '** ABEND IN PGM  ', PC-PROGRAM-NAME         17290000
173600             CALL 'ILBOABN0' USING ABEND-CODE                     17300000
173700         END-IF                                                   17310000
173800     END-IF.                                                      17320000
173900                                                                  17330000
174000     PERFORM 7100-SELECT-CURR-YR-TDTATTR.                         17340000
174100                                                                  17350000
174200*    THIS YEAR HAS 53 WEEKS AND WE ARE IN THE LAST MONTH OF YR    17360000
174201*    SO LAST YEAR THIS DAY WAS NOT FOUND (52 WEEK YR LAST YR)     17370000
174210*    SO WE MUST GET LY-THIS-DAY BASED ON OPN-FSCL-MN - 7 DAYS     17380000
174300     IF DTATTR-LY-THIS-DAY-KY-DTE = '9999-09-09' THEN             17390000
174400        PERFORM 7125-GET-LY-THIS-DAY-MIN-7DAYS                    17400000
174500     END-IF.                                                      17410000
174600                                                                  17420000
174700     DISPLAY '*** CURRENT FISCAL YEAR NUMBER IS:  '               17430000
174800           DTATTR-FSCL-YR-NBR.                                    17440000
174900     DISPLAY '*** CURRENT FISCAL MONTH NUMBER IS: '               17450000
175000           DTATTR-FSCL-MN-NBR.                                    17460000
175100                                                                  17470000
175200     PERFORM 7150-SELECT-TY-SEA-BEG-TDTATTR.                      17480000
175300     DISPLAY '*** CURRENT SEASON FISCAL MONTH NUMBER IS: '        17490000
175400           DTATTR-FSCL-MN-NBR.                                    17500000
175500                                                                  17510000
175600     PERFORM 7200-SELECT-LAST-YR-TDTATTR.                         17520000
175700     DISPLAY '*** LAST FISCAL YEAR NUMBER IS:  '                  17530000
175800           DTATTR-FSCL-YR-NBR.                                    17540000
175900     DISPLAY '*** LAST FISCAL MONTH NUMBER IS: '                  17550000
176000           DTATTR-FSCL-MN-NBR.                                    17560000
176100                                                                  17570000
176200     PERFORM 1100-MONTHLY-RUN-HSKPG.                              17580000
176300                                                                  17590000
176400     PERFORM 8000-READ-INPUT.                                     17600000
176500                                                                  17610000
176600/                                                                 17620000
176700 1100-MONTHLY-RUN-HSKPG.                                          17630000
176800******************************************************************17640000
176900*   1100-MONTH-RUN-HSPKG.                                        *17650000
177000*   DOES THE FOLLOWING:                                          *17660000
177100*      1.  SET-UP HEADING LINE                                   *17670000
177200*                                                                *17680000
177300*   PERFORMED BY: 1000-HOUSEKEEPING                              *17690000
177400******************************************************************17700000
177500                                                                  17710000
177600     ADD 1 TO PV-FISCAL-TY-END-MONTH                              17720000
177700           GIVING PV-CAL-TY-END-MONTH.                            17730000
177800     IF PV-CAL-TY-END-MONTH = 13                                  17740000
177900         MOVE 1 TO PV-CAL-TY-END-MONTH                            17750000
178000         ADD 1 TO PV-FISCAL-TY-CCYY                               17760000
178100               GIVING PV-CAL-TY-END-CCYY                          17770000
178200     ELSE                                                         17780000
178300         MOVE PV-FISCAL-TY-CCYY TO PV-CAL-TY-END-CCYY             17790000
178400     END-IF.                                                      17800000
178500                                                                  17810000
178600     ADD 1 TO PV-FISCAL-TY-BEG-MONTH                              17820000
178700           GIVING PV-CAL-TY-BEG-MONTH.                            17830000
178800                                                                  17840000
178900     ADD 1 TO PV-FISCAL-LY-END-MONTH                              17850000
179000           GIVING PV-CAL-LY-END-MONTH.                            17860000
179100     IF PV-CAL-LY-END-MONTH = 13                                  17870000
179200         MOVE 1 TO PV-CAL-LY-END-MONTH                            17880000
179300         ADD 1 TO PV-FISCAL-LY-CCYY                               17890000
179400               GIVING PV-CAL-LY-END-CCYY                          17900000
179500     ELSE                                                         17910000
179600         MOVE PV-FISCAL-LY-CCYY TO PV-CAL-LY-END-CCYY             17920000
179700     END-IF.                                                      17930000
179800                                                                  17940000
179900     MOVE PV-CAL-TY-BEG-MONTH      TO PV-HDG-START-MM-TY          17950000
180000                                      PV-HDG-START-MM-LY.         17960000
180100     MOVE PV-FISCAL-TY-CCYY        TO PV-HDG-START-CCYY-TY        17970000
180200     MOVE PV-FISCAL-LY-CCYY        TO PV-HDG-START-CCYY-LY.       17980000
180300                                                                  17990000
180400     MOVE PV-CAL-TY-END-MONTH      TO PV-HDG-END-MM-TY            18000000
180500                                      PV-MON-END-MM-TY            18010000
180600                                      PV-MON-START-MM-TY.         18020000
180700     MOVE PV-CAL-LY-END-MONTH      TO PV-HDG-END-MM-LY            18030000
180800                                      PV-MON-END-MM-LY            18040000
180900                                      PV-MON-START-MM-LY.         18050000
181000     MOVE PV-CAL-TY-END-CCYY       TO PV-HDG-END-CCYY-TY          18060000
181100                                      PV-MON-END-CCYY-TY          18070000
181200                                      PV-MON-START-CCYY-TY        18080000
181300     MOVE PV-CAL-LY-END-CCYY       TO PV-HDG-END-CCYY-LY          18090000
181400                                      PV-MON-END-CCYY-LY          18100000
181500                                      PV-MON-START-CCYY-LY.       18110000
181600     MOVE PV-HDG-DATE-TY           TO H6-DATE-RANGE-TY.           18120000
181700     MOVE PV-HDG-DATE-LY           TO H6-DATE-RANGE-LY.           18130000
181800                                                                  18140000
181900/                                                                 18150000
182000 2000-MAIN-ROUTINE.                                               18160000
182100******************************************************************18170000
182200*   2000-MAIN-ROUTINE.                                           *18180000
182300*   THIS PARAGRAPH IS PERFORMED UNTIL EOF.                       *18190000
182400*   PERFORMS RECORD PROCESSING.  AT BREAK OF DEPT# OR ENT ID#    *18200000
182500*   PERFORMS THE LOWER LEVEL OF BREAK PROCESSING WHICH PRINTS    *18210000
182600*   THE YEAR TO DATE LINES, THE SUMMARY LINES, AND THE BACK OF   *18220000
182700*   THE PAGE.                                                    *18230000
182800*   READS NEXT RECORD.                                           *18240000
182900*                                                                *18250000
183000*   PERFORMED BY: 0000-MAINLINE-PROCESSING                       *18260000
183100******************************************************************18270000
183200                                                                  18280000
183300     IF ML202-DEPT-NBR NOT = SA-DEPT-NMBR                         18290000
183400       OR ML202-ENT-ID NOT = SA-ENT-ID                            18300000
183500         IF PI-NOT-FIRST-TIME                                     18310000
183600             PERFORM 2800-VENDOR-BREAK-PROCESS                    18320000
183700         END-IF                                                   18330000
183800         MOVE ML202-DEPT-NBR    TO SA-DEPT-NMBR                   18340000
183900         MOVE ML202-ENT-ID      TO SA-ENT-ID                      18350000
184000         MOVE ML202-DMM         TO H4-MANAGER-NMBR                18360000
184100         MOVE ML202-NAME-DMM    TO H4-MANAGER-NAME                18370000
184200         MOVE ML202-BUYER       TO H4-BUYER-NMBR                  18380000
184300         MOVE ML202-NAME-BUYER  TO H4-BUYER-NAME                  18390000
184400         MOVE ML202-DEPT-NBR    TO H4-DEPT-NMBR                   18400000
184500         MOVE ML202-NAME-DEPT   TO H4-DEPT-DESC                   18410000
184600         MOVE ML202-NAME-VENDOR TO H5-VENDOR-NAME                 18420000
184700         MOVE ML202-MAJ-CL-NBR  TO SA-CLASS                       18430000
184800                                   CT-AP-CLASS (SA-MJ-CLS)        18440000
184900                                   CT-SALES-CLASS (SA-MJ-CLS)     18450000
185000                                   CT-PC-CLASS (SA-MJ-CLS)        18460000
185100                                   CT-MISC-CLASS (SA-MJ-CLS)      18470000
185200         MOVE ML202-NAME-MCL    TO CT-AP-CLASS-DESC (SA-MJ-CLS)   18480000
185300                                  CT-SALES-CLASS-DESC (SA-MJ-CLS) 18490000
185400                                   CT-PC-CLASS-DESC (SA-MJ-CLS)   18500000
185500                                   CT-MISC-CLASS-DESC (SA-MJ-CLS) 18510000
185600         SET PI-NOT-FIRST-TIME  TO TRUE                           18520000
185700     END-IF.                                                      18530000
185800                                                                  18540000
185900     IF ML202-MAJ-CL-NBR NOT = SA-CLASS                           18550000
186000         MOVE ML202-MAJ-CL-NBR TO SA-CLASS                        18560000
186100                                  CT-AP-CLASS (SA-MJ-CLS)         18570000
186200                                  CT-SALES-CLASS (SA-MJ-CLS)      18580000
186300                                  CT-PC-CLASS (SA-MJ-CLS)         18590000
186400                                  CT-MISC-CLASS (SA-MJ-CLS)       18600000
186500         MOVE ML202-NAME-MCL   TO CT-AP-CLASS-DESC (SA-MJ-CLS)    18610000
186600                                  CT-SALES-CLASS-DESC (SA-MJ-CLS) 18620000
186700                                  CT-PC-CLASS-DESC (SA-MJ-CLS)    18630000
186800                                  CT-MISC-CLASS-DESC (SA-MJ-CLS)  18640000
186900     END-IF.                                                      18650000
187000                                                                  18660000
187100     PERFORM 2300-PROCESS-AP.                                     18670000
187200     PERFORM 2400-PROCESS-SALES.                                  18680000
187300     PERFORM 2500-PROCESS-PC.                                     18690000
187400     PERFORM 2600-PROCESS-MISC.                                   18700000
187500     PERFORM 2700-PROCESS-SUMM-RECAP.                             18710000
187600                                                                  18720000
187700     PERFORM 8000-READ-INPUT.                                     18730000
187800                                                                  18740000
187900/                                                                 18750000
188000 2200-PROCESS-NAMES.                                              18760000
188100******************************************************************18770000
188200*   2200-PROCESS-NAMES                                           *18780000
188300*     FORMAT SUB-HEADING LINES FOR DEPARTMENT AND VENDOR         *18790000
188400*     NAMES.                                                     *18800000
188500*     THESE LINES ARE FIRST PRINTED (FOR THE FRONT OF THE PAGE)  *18810000
188600*     THEN, SAVED TO A TABLE FOR PRINTING AT THE BACK OF THE     *18820000
188700*     PAGE LATER.                                                *18830000
188800*                                                                *18840000
188900*   PERFORMED BY 2000-MAIN-ROUTINE.                              *18850000
189000******************************************************************18860000
189100                                                                  18870000
189200     PERFORM 4110-HEADING-RTN.                                    18880000
189300                                                                  18890000
189400     MOVE 1 TO PA-LINE-NO.                                        18900000
189500     MOVE H4-HEADING4A           TO RR-REPORT-RECORD.             18910000
189600     PERFORM 5000-WRITE-REPORT-LINE.                              18920000
189700                                                                  18930000
189800     MOVE 1 TO PA-LINE-NO.                                        18940000
189900     MOVE H4-HEADING4B           TO RR-REPORT-RECORD.             18950000
190000     PERFORM 5000-WRITE-REPORT-LINE.                              18960000
190100                                                                  18970000
190200     SET PI-PRINT-BOTH TO TRUE.                                   18980000
190300     MOVE 1 TO PA-LINE-NO.                                        18990000
190400     MOVE H4-HEADING4C           TO RR-REPORT-RECORD.             19000000
190500     PERFORM 5000-WRITE-REPORT-LINE.                              19010000
190600                                                                  19020000
190700     MOVE 1 TO PA-LINE-NO.                                        19030000
190800     MOVE H5-HEADING5            TO RR-REPORT-RECORD.             19040000
190900     PERFORM 5000-WRITE-REPORT-LINE.                              19050000
191000                                                                  19060000
191100     SET PI-PRINT-FRONT TO TRUE.                                  19070000
191200     MOVE PV-HDG-DATE-TY         TO H6-DATE-RANGE-TY.             19080000
191300     MOVE PV-HDG-DATE-LY         TO H6-DATE-RANGE-LY.             19090000
191400     MOVE H6-HEADING6            TO RR-REPORT-RECORD.             19100000
191500     MOVE 1 TO PA-LINE-NO.                                        19110000
191600     PERFORM 5000-WRITE-REPORT-LINE.                              19120000
191700     SET PI-PRINT-BACK TO TRUE.                                   19130000
191800     MOVE PV-MON-DATE-TY         TO H6-DATE-RANGE-TY.             19140000
191900     MOVE PV-MON-DATE-LY         TO H6-DATE-RANGE-LY.             19150000
192000     MOVE H6-HEADING6            TO RR-REPORT-RECORD.             19160000
192100     MOVE 1 TO PA-LINE-NO.                                        19170000
192200     PERFORM 5000-WRITE-REPORT-LINE.                              19180000
192300                                                                  19190000
192400     SET PI-PRINT-BOTH TO TRUE.                                   19200000
192500     MOVE BL-BAR-LINE            TO RR-REPORT-RECORD.             19210000
192600     MOVE 1                      TO PA-LINE-NO.                   19220000
192700     PERFORM 5000-WRITE-REPORT-LINE.                              19230000
192800                                                                  19240000
192900/                                                                 19250000
193000 2300-PROCESS-AP.                                                 19260000
193100******************************************************************19270000
193200*   2300-PROCESS-AP                                              *19280000
193300*     ACCUMULATE AMOUNTS FOR THE WHOLE DATE-RANGE.               *19290000
193400*     PERFORMS TO ACCUMULATE AMOUNTS CURRENT-MONTH ONLY.         *19300000
193500*                                                                *19310000
193600*   PERFORMED BY:  2000-MAIN-ROUTINE.                            *19320000
193700******************************************************************19330000
193800                                                                  19340000
193900     ADD ML202-TY-RCPT-GRO-COST-AMT TO CT-GROSS-COST (SA-MJ-CLS)  19350000
194000                                   RT-GROSS-COST                  19360000
194100                                   VT-GROSS-COST.                 19370000
194200*-- PURCHASE ADJ - COST                                           19380000
194300     ADD ML202-TY-PADJ-NET-COST-AMT                               19390000
194400                               TO CT-PURCH-ADJ-COST-TY (SA-MJ-CLS)19400000
194500                                  RT-PURCH-ADJ-COST-TY            19410000
194600                                  VT-PURCH-ADJ-COST-TY.           19420000
194700                                                                  19430000
194800     COMPUTE PV-NET-COST-TY = ML202-TY-RCPT-NET-COST-AMT          19440000
194900                            + ML202-TY-PADJ-NET-COST-AMT          19450000
195000     ADD PV-NET-COST-TY         TO CT-NET-COST-TY (SA-MJ-CLS)     19460000
195100                                   RT-NET-COST-TY                 19470000
195200                                   VT-NET-COST-TY.                19480000
195300                                                                  19490000
195400*-- RECEIPTS - COST                                               19500000
195500     ADD ML202-TY-RCPT-NET-COST-AMT                               19510000
195600                                TO CT-RECEIPTS-COST-TY (SA-MJ-CLS)19520000
195700                                   RT-RECEIPTS-COST-TY            19530000
195800                                   VT-RECEIPTS-COST-TY.           19540000
195900                                                                  19550000
196000*-- RECEIPTS - RETAIL                                             19560000
196100     ADD ML202-TY-RCPT-RTL-AMT  TO CT-RECEIPTS-RTL-TY (SA-MJ-CLS) 19570000
196200                                   RT-RECEIPTS-RTL-TY             19580000
196300                                   VT-RECEIPTS-RTL-TY.            19590000
196400                                                                  19600000
196500*-- PURCHASE ADJUSTMENTS - RETAIL                                 19610000
196600     COMPUTE PV-PURCH-ADJ-RTL-TY =                                19620000
196700           ( ML202-TY-PADJ-RTL-AMT                                19630000
196800           + ML202-TY-MKUP-RTL-AMT                                19640000
196900           + ML202-TY-XFER-IN-RTL-AMT                             19650000
197000           - ML202-TY-XFER-OUT-RTL-AMT).                          19660000
197100     ADD PV-PURCH-ADJ-RTL-TY TO CT-PURCH-ADJ-RTL-TY (SA-MJ-CLS)   19670000
197200                                RT-PURCH-ADJ-RTL-TY               19680000
197300                                VT-PURCH-ADJ-RTL-TY.              19690000
197400                                                                  19700000
197500     COMPUTE PV-RETAIL-PURCH-TY = ML202-TY-RCPT-RTL-AMT           19710000
197600                                + ML202-TY-PADJ-RTL-AMT           19720000
197700                                + ML202-TY-MKUP-RTL-AMT           19730000
197800                                + ML202-TY-XFER-IN-RTL-AMT        19740000
197900                                - ML202-TY-XFER-OUT-RTL-AMT.      19750000
198000     ADD PV-RETAIL-PURCH-TY     TO CT-RETAIL-PURCH-TY (SA-MJ-CLS) 19760000
198100                                   RT-RETAIL-PURCH-TY             19770000
198200                                   VT-RETAIL-PURCH-TY.            19780000
198300     ADD ML202-TY-MKUP-INIT-AMT                                   19790000
198400                               TO CT-INITIAL-MARKON-TY (SA-MJ-CLS)19800000
198500                                   RT-INITIAL-MARKON-TY           19810000
198600                                   VT-INITIAL-MARKON-TY.          19820000
198700     ADD ML202-TY-MKUP-NET-AMT  TO CT-NET-MARKON-TY (SA-MJ-CLS)   19830000
198800                                   RT-NET-MARKON-TY               19840000
198900                                   VT-NET-MARKON-TY.              19850000
199000     ADD ML202-TY-PADJ-RTL-AMT  TO CT-PURCH-ADJ-RETAIL (SA-MJ-CLS)19860000
199100                                   RT-PURCH-ADJ-RETAIL            19870000
199200                                   VT-PURCH-ADJ-RETAIL.           19880000
199300                                                                  19890000
199400*-- LAST YEAR --*                                                 19900000
199500*-- RECEIPTS - COST - LAST YEAR                                   19910000
199600     ADD ML202-LY-RCPT-NET-COST-AMT                               19920000
199700                                TO CT-RECEIPTS-COST-LY (SA-MJ-CLS)19930000
199800                                   RT-RECEIPTS-COST-LY            19940000
199900                                   VT-RECEIPTS-COST-LY.           19950000
200000*-- RECEIPTS - RETAIL                                             19960000
200100     ADD ML202-LY-RCPT-RTL-AMT  TO CT-RECEIPTS-RTL-LY (SA-MJ-CLS) 19970000
200200                                   RT-RECEIPTS-RTL-LY             19980000
200300                                   VT-RECEIPTS-RTL-LY.            19990000
200400                                                                  20000000
200500*-- PURCHASE ADJUSTMENTS - COST                                   20010000
200600     ADD ML202-LY-PADJ-NET-COST-AMT                               20020000
200700                               TO CT-PURCH-ADJ-COST-LY (SA-MJ-CLS)20030000
200800                                  RT-PURCH-ADJ-COST-LY            20040000
200900                                  VT-PURCH-ADJ-COST-LY.           20050000
201000                                                                  20060000
201100*-- PURCHASE ADJUSTMENTS - RETAIL                                 20070000
201200     COMPUTE PV-PURCH-ADJ-RTL-LY =                                20080000
201300           ( ML202-LY-PADJ-RTL-AMT                                20090000
201400           + ML202-LY-MKUP-RTL-AMT                                20100000
201500           + ML202-LY-XFER-IN-RTL-AMT                             20110000
201600           - ML202-LY-XFER-OUT-RTL-AMT).                          20120000
201700     ADD PV-PURCH-ADJ-RTL-LY TO CT-PURCH-ADJ-RTL-LY (SA-MJ-CLS)   20130000
201800                                RT-PURCH-ADJ-RTL-LY               20140000
201900                                VT-PURCH-ADJ-RTL-LY.              20150000
202000                                                                  20160000
202100     COMPUTE PV-NET-COST-LY = ML202-LY-RCPT-NET-COST-AMT          20170000
202200                            + ML202-LY-PADJ-NET-COST-AMT          20180000
202300     ADD PV-NET-COST-LY         TO CT-NET-COST-LY (SA-MJ-CLS)     20190000
202400                                   RT-NET-COST-LY                 20200000
202500                                   VT-NET-COST-LY.                20210000
202600                                                                  20220000
202700     COMPUTE PV-RETAIL-PURCH-LY = ML202-LY-RCPT-RTL-AMT           20230000
202800                                + ML202-LY-PADJ-RTL-AMT           20240000
202900                                + ML202-LY-MKUP-RTL-AMT           20250000
203000                                + ML202-LY-XFER-IN-RTL-AMT        20260000
203100                                - ML202-LY-XFER-OUT-RTL-AMT.      20270000
203200     ADD PV-RETAIL-PURCH-LY     TO CT-RETAIL-PURCH-LY (SA-MJ-CLS) 20280000
203300                                   RT-RETAIL-PURCH-LY             20290000
203400                                   VT-RETAIL-PURCH-LY.            20300000
203500     ADD ML202-LY-MKUP-INIT-AMT                                   20310000
203600                               TO CT-INITIAL-MARKON-LY (SA-MJ-CLS)20320000
203700                                   RT-INITIAL-MARKON-LY           20330000
203800                                   VT-INITIAL-MARKON-LY.          20340000
203900     ADD ML202-LY-MKUP-NET-AMT  TO CT-NET-MARKON-LY (SA-MJ-CLS)   20350000
204000                                   RT-NET-MARKON-LY               20360000
204100                                   VT-NET-MARKON-LY.              20370000
204200                                                                  20380000
204300     MOVE ML202-FSCL-MN-NBR         TO PV-INPUT-MONTH.            20390000
204400     IF PV-INPUT-MONTH = PV-FISCAL-TY-END-MONTH                   20400000
204500*     FORMAT THE A/P DETAIL LINE FOR THE CURRENT-MONTH ONLY       20410000
204600         MOVE ML202-MAJ-CL-NBR      TO CM-AP-CLASS (SA-MJ-CLS)    20420000
204700         MOVE ML202-NAME-MCL        TO CM-AP-CLASS-DESC           20430000
204800                                                    (SA-MJ-CLS)   20440000
204900         MOVE ML202-TY-RCPT-GRO-COST-AMT                          20450000
205000                              TO CM-GROSS-COST (SA-MJ-CLS)        20460000
205100*-- PURCHASE ADJ - COST                                           20470000
205200         MOVE ML202-TY-PADJ-NET-COST-AMT                          20480000
205300                              TO CM-PURCH-ADJ-COST-TY (SA-MJ-CLS) 20490000
205400         MOVE PV-NET-COST-TY  TO CM-NET-COST-TY (SA-MJ-CLS)       20500000
205500         MOVE PV-RETAIL-PURCH-TY                                  20510000
205600                              TO CM-RETAIL-PURCH-TY (SA-MJ-CLS)   20520000
205700                                                                  20530000
205800*-- RECEIPTS - COST                                               20540000
205900         MOVE ML202-TY-RCPT-NET-COST-AMT                          20550000
206000                               TO CM-RECEIPTS-COST-TY (SA-MJ-CLS) 20560000
206100*-- RECEIPTS - RETAIL                                             20570000
206200         MOVE ML202-TY-RCPT-RTL-AMT                               20580000
206300                               TO CM-RECEIPTS-RTL-TY (SA-MJ-CLS)  20590000
206400*-- PURCHASE ADJ - RETAIL                                         20600000
206500         MOVE PV-PURCH-ADJ-RTL-TY TO                              20610000
206600                                  CM-PURCH-ADJ-RTL-TY (SA-MJ-CLS) 20620000
206700                                                                  20630000
206800         MOVE ML202-TY-MKUP-INIT-AMT                              20640000
206900                              TO CM-INITIAL-MARKON-TY (SA-MJ-CLS) 20650000
207000         MOVE ML202-TY-MKUP-NET-AMT                               20660000
207100                              TO CM-NET-MARKON-TY (SA-MJ-CLS)     20670000
207200         MOVE ML202-TY-PADJ-RTL-AMT                               20680000
207300                              TO CM-PURCH-ADJ-RETAIL (SA-MJ-CLS)  20690000
207400         ADD ML202-TY-RCPT-GRO-COST-AMT                           20700000
207500                                    TO CMT-GROSS-COST             20710000
207600                                       TCMT-GROSS-COST            20720000
207700         ADD ML202-TY-PADJ-NET-COST-AMT                           20730000
207800                                    TO CMT-PURCH-ADJ-COST-TY      20740000
207900                                       TCMT-PURCH-ADJ-COST-TY     20750000
208000*-- RECEIPTS - COST                                               20760000
208100         ADD ML202-TY-RCPT-NET-COST-AMT                           20770000
208200                               TO CMT-RECEIPTS-COST-TY            20780000
208300                                  TCMT-RECEIPTS-COST-TY           20790000
208400*-- RECEIPTS - RETAIL                                             20800000
208500         ADD ML202-TY-RCPT-RTL-AMT                                20810000
208600                               TO CMT-RECEIPTS-RTL-TY             20820000
208700                                  TCMT-RECEIPTS-RTL-TY            20830000
208800*-- PURCHASE ADJ - RETAIL                                         20840000
208900         ADD PV-PURCH-ADJ-RTL-TY TO CMT-PURCH-ADJ-RTL-TY          20850000
209000                                    TCMT-PURCH-ADJ-RTL-TY         20860000
209100                                                                  20870000
209200         ADD PV-NET-COST-TY         TO CMT-NET-COST-TY            20880000
209300                                       TCMT-NET-COST-TY           20890000
209400         ADD PV-RETAIL-PURCH-TY     TO CMT-RETAIL-PURCH-TY        20900000
209500                                       TCMT-RETAIL-PURCH-TY       20910000
209600         ADD ML202-TY-MKUP-INIT-AMT TO CMT-INITIAL-MARKON-TY      20920000
209700                                       TCMT-INITIAL-MARKON-TY     20930000
209800         ADD ML202-TY-MKUP-NET-AMT  TO CMT-NET-MARKON-TY          20940000
209900                                       TCMT-NET-MARKON-TY         20950000
210000         ADD ML202-TY-PADJ-RTL-AMT  TO CMT-PURCH-ADJ-RETAIL       20960000
210100                                       TCMT-PURCH-ADJ-RETAIL      20970000
210200*-- LAST YEAR                                                     20980000
210300         MOVE ML202-LY-PADJ-NET-COST-AMT                          20990000
210400                              TO CM-PURCH-ADJ-COST-LY (SA-MJ-CLS) 21000000
210500         MOVE PV-NET-COST-LY  TO CM-NET-COST-LY (SA-MJ-CLS)       21010000
210600         MOVE PV-RETAIL-PURCH-LY                                  21020000
210700                              TO CM-RETAIL-PURCH-LY (SA-MJ-CLS)   21030000
210800*-- RECEIPTS - COST                                               21040000
210900         MOVE ML202-LY-RCPT-NET-COST-AMT                          21050000
211000                                TO CM-RECEIPTS-COST-LY (SA-MJ-CLS)21060000
211100*-- RECEIPTS - RETAIL                                             21070000
211200         MOVE ML202-LY-RCPT-RTL-AMT                               21080000
211300                                TO CM-RECEIPTS-RTL-LY (SA-MJ-CLS) 21090000
211400*-- PURCHASE ADJ - RETAIL                                         21100000
211500         MOVE PV-PURCH-ADJ-RTL-LY TO                              21110000
211600                                  CM-PURCH-ADJ-RTL-LY (SA-MJ-CLS) 21120000
211700                                                                  21130000
211800         MOVE ML202-LY-MKUP-INIT-AMT                              21140000
211900                              TO CM-INITIAL-MARKON-LY (SA-MJ-CLS) 21150000
212000         MOVE ML202-LY-MKUP-NET-AMT                               21160000
212100                              TO CM-NET-MARKON-LY (SA-MJ-CLS)     21170000
212200         ADD ML202-LY-PADJ-NET-COST-AMT                           21180000
212300                              TO CMT-PURCH-ADJ-COST-LY            21190000
212400                                 TCMT-PURCH-ADJ-COST-LY           21200000
212500         ADD PV-NET-COST-LY         TO CMT-NET-COST-LY            21210000
212600                                       TCMT-NET-COST-LY           21220000
212700         ADD PV-RETAIL-PURCH-LY     TO CMT-RETAIL-PURCH-LY        21230000
212800                                       TCMT-RETAIL-PURCH-LY       21240000
212900*-- RECEIPTS - COST                                               21250000
213000         ADD ML202-LY-RCPT-NET-COST-AMT                           21260000
213100                               TO CMT-RECEIPTS-COST-LY            21270000
213200                                  TCMT-RECEIPTS-COST-LY           21280000
213300*-- RECEIPTS - RETAIL                                             21290000
213400         ADD ML202-LY-RCPT-RTL-AMT                                21300000
213500                               TO CMT-RECEIPTS-RTL-LY             21310000
213600                                  TCMT-RECEIPTS-RTL-LY            21320000
213700*-- PURCHASE ADJ - RETAIL                                         21330000
213800         ADD PV-PURCH-ADJ-RTL-LY TO CMT-PURCH-ADJ-RTL-LY          21340000
213900                                    TCMT-PURCH-ADJ-RTL-LY         21350000
214000                                                                  21360000
214100         ADD ML202-LY-MKUP-INIT-AMT TO CMT-INITIAL-MARKON-LY      21370000
214200                                       TCMT-INITIAL-MARKON-LY     21380000
214300         ADD ML202-LY-MKUP-NET-AMT  TO CMT-NET-MARKON-LY          21390000
214400                                       TCMT-NET-MARKON-LY         21400000
214500     END-IF.                                                      21410000
214600                                                                  21420000
214700/                                                                 21430000
214800 2400-PROCESS-SALES.                                              21440000
214900******************************************************************21450000
215000*   2400-PROCESS-SALES                                           *21460000
215100*     ACCUMULATE AMOUNTS FOR THE WHOLE DATE-RANGE.               *21470000
215200*     PERFORMS TO ACCUMULATE AMOUNTS CURRENT-MONTH ONLY.         *21480000
215300*                                                                *21490000
215400*   PERFORMED BY:  2000-MAIN-ROUTINE.                            *21500000
215500******************************************************************21510000
215600                                                                  21520000
215700     COMPUTE PV-TOTAL-SALES-TY = ML202-TY-SLS-REG-RTL-AMT         21530000
215800                               + ML202-TY-SLS-PROMO-RTL-AMT       21540000
215900                               + ML202-TY-SLS-PROCLR-RTL-AMT      21550000
216000                               + ML202-TY-SLS-CLR-RTL-AMT         21560000
216100                               + ML202-TY-SLS-OTH-RTL-AMT.        21570000
216200     COMPUTE PV-TOTAL-SALES-LY = ML202-LY-SLS-REG-RTL-AMT         21580000
216300                               + ML202-LY-SLS-PROMO-RTL-AMT       21590000
216400                               + ML202-LY-SLS-PROCLR-RTL-AMT      21600000
216500                               + ML202-LY-SLS-CLR-RTL-AMT         21610000
216600                               + ML202-LY-SLS-OTH-RTL-AMT.        21620000
216700*-- SEGREGATE UKNOWN VENDOR SALES OUT TO ALLOW FOR "MORE CORRECT" 21630000
216800*-- GROSS MARGIN % CALC                                           21640000
216900     IF ML202-ENT-ID = PC-UNKNOWN-VENDOR                          21650000
217000         ADD PV-TOTAL-SALES-TY   TO UVRT-TOTAL-SALES-TY           21660000
217100     END-IF.                                                      21670000
217200                                                                  21680000
217300     ADD PV-TOTAL-SALES-TY       TO CT-TOTAL-SALES-TY (SA-MJ-CLS) 21690000
217400                                    RT-TOTAL-SALES-TY             21700000
217500                                    VT-TOTAL-SALES-TY.            21710000
217600     ADD ML202-TY-SLS-REG-RTL-AMT                                 21720000
217700                                TO CT-REGULAR-SALES-TY (SA-MJ-CLS)21730000
217800                                    RT-REGULAR-SALES-TY           21740000
217900                                    VT-REGULAR-SALES-TY.          21750000
218000     ADD ML202-TY-SLS-PROMO-RTL-AMT                               21760000
218100                                 TO CT-PROMO-SALES-TY (SA-MJ-CLS) 21770000
218200                                    RT-PROMO-SALES-TY             21780000
218300                                    VT-PROMO-SALES-TY.            21790000
218400     ADD ML202-TY-SLS-PROCLR-RTL-AMT                              21800000
218500                               TO CT-GOLDSTAR-SALES-TY (SA-MJ-CLS)21810000
218600                                    RT-GOLDSTAR-SALES-TY          21820000
218700                                    VT-GOLDSTAR-SALES-TY.         21830000
218800     ADD ML202-TY-SLS-CLR-RTL-AMT                                 21840000
218900                                 TO CT-CLEAR-SALES-TY (SA-MJ-CLS) 21850000
219000                                    RT-CLEAR-SALES-TY             21860000
219100                                    VT-CLEAR-SALES-TY.            21870000
219200     ADD ML202-TY-SLS-OTH-RTL-AMT                                 21880000
219300                                 TO CT-UNKWN-SALES-TY (SA-MJ-CLS) 21890000
219400                                    RT-UNKWN-SALES-TY             21900000
219500                                    VT-UNKWN-SALES-TY.            21910000
219600                                                                  21920000
219700*-- SEGREGATE UKNOWN VENDOR SALES OUT TO ALLOW FOR "MORE CORRECT" 21930000
219800*-- GROSS MARGIN % CALC                                           21940000
219900     IF ML202-ENT-ID = PC-UNKNOWN-VENDOR                          21950000
220000         ADD PV-TOTAL-SALES-LY   TO UVRT-TOTAL-SALES-LY           21960000
220100     END-IF.                                                      21970000
220200                                                                  21980000
220300     ADD PV-TOTAL-SALES-LY       TO CT-TOTAL-SALES-LY (SA-MJ-CLS) 21990000
220400                                    RT-TOTAL-SALES-LY             22000000
220500                                    VT-TOTAL-SALES-LY.            22010000
220600     ADD ML202-LY-SLS-REG-RTL-AMT                                 22020000
220700                                TO CT-REGULAR-SALES-LY (SA-MJ-CLS)22030000
220800                                   RT-REGULAR-SALES-LY            22040000
220900                                   VT-REGULAR-SALES-LY.           22050000
221000     ADD ML202-LY-SLS-PROMO-RTL-AMT                               22060000
221100                                TO CT-PROMO-SALES-LY (SA-MJ-CLS)  22070000
221200                                   RT-PROMO-SALES-LY              22080000
221300                                   VT-PROMO-SALES-LY.             22090000
221400     ADD ML202-LY-SLS-PROCLR-RTL-AMT                              22100000
221500                               TO CT-GOLDSTAR-SALES-LY (SA-MJ-CLS)22110000
221600                                    RT-GOLDSTAR-SALES-LY          22120000
221700                                    VT-GOLDSTAR-SALES-LY.         22130000
221800     ADD ML202-LY-SLS-CLR-RTL-AMT                                 22140000
221900                                 TO CT-CLEAR-SALES-LY (SA-MJ-CLS) 22150000
222000                                    RT-CLEAR-SALES-LY             22160000
222100                                    VT-CLEAR-SALES-LY.            22170000
222200     ADD ML202-LY-SLS-OTH-RTL-AMT                                 22180000
222300                                 TO CT-UNKWN-SALES-LY (SA-MJ-CLS) 22190000
222400                                    RT-UNKWN-SALES-LY             22200000
222500                                    VT-UNKWN-SALES-LY.            22210000
222600                                                                  22220000
222700     MOVE ML202-FSCL-MN-NBR      TO PV-INPUT-MONTH.               22230000
222800     IF PV-INPUT-MONTH = PV-FISCAL-TY-END-MONTH                   22240000
222900*     FORMAT THE SALES DETAIL LINE FOR THE CURRENT-MONTH ONLY     22250000
223000         MOVE ML202-MAJ-CL-NBR   TO CM-SALES-CLASS                22260000
223100                                                (SA-MJ-CLS)       22270000
223200         MOVE ML202-NAME-MCL     TO CM-SALES-CLASS-DESC           22280000
223300                                                (SA-MJ-CLS)       22290000
223400         MOVE PV-TOTAL-SALES-TY  TO CM-TOTAL-SALES-TY  (SA-MJ-CLS)22300000
223500         MOVE ML202-TY-SLS-REG-RTL-AMT                            22310000
223600                               TO CM-REGULAR-SALES-TY  (SA-MJ-CLS)22320000
223700         MOVE ML202-TY-SLS-PROMO-RTL-AMT                          22330000
223800                                 TO CM-PROMO-SALES-TY  (SA-MJ-CLS)22340000
223900         MOVE ML202-TY-SLS-PROCLR-RTL-AMT                         22350000
224000                              TO CM-GOLDSTAR-SALES-TY  (SA-MJ-CLS)22360000
224100         MOVE ML202-TY-SLS-CLR-RTL-AMT                            22370000
224200                                 TO CM-CLEAR-SALES-TY  (SA-MJ-CLS)22380000
224300         MOVE ML202-TY-SLS-OTH-RTL-AMT                            22390000
224400                                 TO CM-UNKWN-SALES-TY  (SA-MJ-CLS)22400000
224500         ADD PV-TOTAL-SALES-TY   TO CMT-TOTAL-SALES-TY            22410000
224600                                    TCMT-TOTAL-SALES-TY           22420000
224700         ADD ML202-TY-SLS-REG-RTL-AMT                             22430000
224800                                 TO CMT-REGULAR-SALES-TY          22440000
224900                                    TCMT-REGULAR-SALES-TY         22450000
225000         ADD ML202-TY-SLS-PROMO-RTL-AMT                           22460000
225100                                 TO CMT-PROMO-SALES-TY            22470000
225200                                    TCMT-PROMO-SALES-TY           22480000
225300         ADD ML202-TY-SLS-PROCLR-RTL-AMT                          22490000
225400                                 TO CMT-GOLDSTAR-SALES-TY         22500000
225500                                    TCMT-GOLDSTAR-SALES-TY        22510000
225600         ADD ML202-TY-SLS-CLR-RTL-AMT                             22520000
225700                                 TO CMT-CLEAR-SALES-TY            22530000
225800                                    TCMT-CLEAR-SALES-TY           22540000
225900         ADD ML202-TY-SLS-OTH-RTL-AMT                             22550000
226000                                 TO CMT-UNKWN-SALES-TY            22560000
226100                                    TCMT-UNKWN-SALES-TY           22570000
226200         MOVE PV-TOTAL-SALES-LY  TO CM-TOTAL-SALES-LY  (SA-MJ-CLS)22580000
226300         MOVE ML202-LY-SLS-REG-RTL-AMT                            22590000
226400                               TO CM-REGULAR-SALES-LY  (SA-MJ-CLS)22600000
226500         MOVE ML202-LY-SLS-PROMO-RTL-AMT                          22610000
226600                                 TO CM-PROMO-SALES-LY  (SA-MJ-CLS)22620000
226700         MOVE ML202-LY-SLS-PROCLR-RTL-AMT                         22630000
226800                              TO CM-GOLDSTAR-SALES-LY  (SA-MJ-CLS)22640000
226900         MOVE ML202-LY-SLS-CLR-RTL-AMT                            22650000
227000                                 TO CM-CLEAR-SALES-LY  (SA-MJ-CLS)22660000
227100         MOVE ML202-LY-SLS-OTH-RTL-AMT                            22670000
227200                                 TO CM-UNKWN-SALES-LY  (SA-MJ-CLS)22680000
227300         ADD PV-TOTAL-SALES-LY   TO CMT-TOTAL-SALES-LY            22690000
227400                                    TCMT-TOTAL-SALES-LY           22700000
227500         ADD ML202-LY-SLS-REG-RTL-AMT                             22710000
227600                                 TO CMT-REGULAR-SALES-LY          22720000
227700                                    TCMT-REGULAR-SALES-LY         22730000
227800         ADD ML202-LY-SLS-PROMO-RTL-AMT                           22740000
227900                                 TO CMT-PROMO-SALES-LY            22750000
228000                                    TCMT-PROMO-SALES-LY           22760000
228100         ADD ML202-LY-SLS-PROCLR-RTL-AMT                          22770000
228200                                 TO CMT-GOLDSTAR-SALES-LY         22780000
228300                                    TCMT-GOLDSTAR-SALES-LY        22790000
228400         ADD ML202-LY-SLS-CLR-RTL-AMT                             22800000
228500                                 TO CMT-CLEAR-SALES-LY            22810000
228600                                    TCMT-CLEAR-SALES-LY           22820000
228700         ADD ML202-LY-SLS-OTH-RTL-AMT                             22830000
228800                                 TO CMT-UNKWN-SALES-LY            22840000
228900                                    TCMT-UNKWN-SALES-LY           22850000
229000         IF ML202-ENT-ID = PC-UNKNOWN-VENDOR                      22860000
229100             ADD PV-TOTAL-SALES-TY   TO TUVRT-TOTAL-SALES-TY      22870000
229200         END-IF                                                   22880000
229300         IF ML202-ENT-ID = PC-UNKNOWN-VENDOR                      22890000
229400             ADD PV-TOTAL-SALES-LY   TO TUVRT-TOTAL-SALES-LY      22900000
229500         END-IF                                                   22910000
229600     END-IF.                                                      22920000
229700                                                                  22930000
229800/                                                                 22940000
229900 2500-PROCESS-PC.                                                 22950000
230000******************************************************************22960000
230100*   2500-PROCESS-PC                                              *22970000
230200*     ACCUMULATE AMOUNTS FOR THE WHOLE DATE-RANGE.               *22980000
230300*     PERFORMS TO ACCUMULATE AMOUNTS CURRENT-MONTH ONLY.         *22990000
230400*                                                                *23000000
230500*   PERFORMED BY:  2000-MAIN-ROUTINE.                            *23010000
230600******************************************************************23020000
230700                                                                  23030000
230800     COMPUTE PV-TOTAL-MKDN-TY = ML202-TY-MKDN-PLU-RTL-AMT         23040000
230900                              + ML202-TY-MKDN-RGST-RTL-AMT        23050000
231000                              + ML202-TY-MKDN-UMTCH-RTL-AMT       23060000
231100                              + ML202-TY-MKDN-BYR-RTL-AMT         23070000
231200                              + ML202-TY-MKDN-STR-RTL-AMT.        23080000
231300     COMPUTE PV-TOTAL-MKDN-LY = ML202-LY-MKDN-PLU-RTL-AMT         23090000
231400                              + ML202-LY-MKDN-RGST-RTL-AMT        23100000
231500                              + ML202-LY-MKDN-UMTCH-RTL-AMT       23110000
231600                              + ML202-LY-MKDN-BYR-RTL-AMT         23120000
231700                              + ML202-LY-MKDN-STR-RTL-AMT.        23130000
231800                                                                  23140000
231900     ADD PV-TOTAL-MKDN-TY       TO CT-TOTAL-MKDN-TY (SA-MJ-CLS)   23150000
232000                                   RT-TOTAL-MKDN-TY               23160000
232100                                   VT-TOTAL-MKDN-TY.              23170000
232200     ADD ML202-TY-MKUP-RTL-AMT  TO CT-TOTAL-MKUP-TY (SA-MJ-CLS)   23180000
232300                                   RT-TOTAL-MKUP-TY               23190000
232400                                   VT-TOTAL-MKUP-TY.              23200000
232500     ADD ML202-TY-MKDN-STR-RTL-AMT                                23210000
232600                                TO CT-STORE-MKDN-TY (SA-MJ-CLS)   23220000
232700                                   RT-STORE-MKDN-TY               23230000
232800                                   VT-STORE-MKDN-TY.              23240000
232900     ADD ML202-TY-MKDN-BYR-RTL-AMT                                23250000
233000                                TO CT-BUYER-MKDN-TY (SA-MJ-CLS)   23260000
233100                                   RT-BUYER-MKDN-TY               23270000
233200                                   VT-BUYER-MKDN-TY.              23280000
233300     ADD ML202-TY-MKDN-PLU-RTL-AMT                                23290000
233400                                TO CT-PLU-MKDN-TY (SA-MJ-CLS)     23300000
233500                                   RT-PLU-MKDN-TY                 23310000
233600                                   VT-PLU-MKDN-TY.                23320000
233700     ADD ML202-TY-MKDN-RGST-RTL-AMT                               23330000
233800                                TO CT-PERM-MKDN-TY (SA-MJ-CLS)    23340000
233900                                   RT-PERM-MKDN-TY                23350000
234000                                   VT-PERM-MKDN-TY.               23360000
234100     ADD ML202-TY-MKDN-UMTCH-RTL-AMT                              23370000
234200                                TO CT-OTHER-MKDN-TY (SA-MJ-CLS)   23380000
234300                                   RT-OTHER-MKDN-TY               23390000
234400                                   VT-OTHER-MKDN-TY.              23400000
234500     ADD ML202-TY-DR-ALW-RTL-AMT                                  23410000
234600                                TO CT-DEBIT-ALLOW-TY (SA-MJ-CLS)  23420000
234700                                   RT-DEBIT-ALLOW-TY              23430000
234800                                   VT-DEBIT-ALLOW-TY.             23440000
234900     ADD PV-TOTAL-MKDN-LY       TO CT-TOTAL-MKDN-LY (SA-MJ-CLS)   23450000
235000                                   RT-TOTAL-MKDN-LY               23460000
235100                                   VT-TOTAL-MKDN-LY.              23470000
235200     ADD ML202-LY-MKUP-RTL-AMT  TO CT-TOTAL-MKUP-LY (SA-MJ-CLS)   23480000
235300                                   RT-TOTAL-MKUP-LY               23490000
235400                                   VT-TOTAL-MKUP-LY.              23500000
235500     ADD ML202-LY-MKDN-PLU-RTL-AMT                                23510000
235600                                TO CT-PLU-MKDN-LY (SA-MJ-CLS)     23520000
235700                                   RT-PLU-MKDN-LY                 23530000
235800                                   VT-PLU-MKDN-LY.                23540000
235900     ADD ML202-LY-MKDN-RGST-RTL-AMT                               23550000
236000                                TO CT-PERM-MKDN-LY (SA-MJ-CLS)    23560000
236100                                   RT-PERM-MKDN-LY                23570000
236200                                   VT-PERM-MKDN-LY.               23580000
236300     ADD ML202-LY-MKDN-UMTCH-RTL-AMT                              23590000
236400                                TO CT-OTHER-MKDN-LY (SA-MJ-CLS)   23600000
236500                                   RT-OTHER-MKDN-LY               23610000
236600                                   VT-OTHER-MKDN-LY.              23620000
236700                                                                  23630000
236800     MOVE ML202-FSCL-MN-NBR     TO PV-INPUT-MONTH.                23640000
236900     IF PV-INPUT-MONTH = PV-FISCAL-TY-END-MONTH                   23650000
237000*     FORMAT THE PC DETAIL LINE FOR THE CURRENT-MONTH ONLY        23660000
237100         MOVE ML202-MAJ-CL-NBR  TO CM-PC-CLASS                    23670000
237200                                                 (SA-MJ-CLS)      23680000
237300         MOVE ML202-NAME-MCL    TO CM-PC-CLASS-DESC               23690000
237400                                                 (SA-MJ-CLS)      23700000
237500         MOVE PV-TOTAL-MKDN-TY  TO CM-TOTAL-MKDN-TY (SA-MJ-CLS)   23710000
237600         MOVE ML202-TY-MKUP-RTL-AMT                               23720000
237700                                TO CM-TOTAL-MKUP-TY (SA-MJ-CLS)   23730000
237800         MOVE ML202-TY-MKDN-STR-RTL-AMT                           23740000
237900                                TO CM-STORE-MKDN-TY (SA-MJ-CLS)   23750000
238000         MOVE ML202-TY-MKDN-BYR-RTL-AMT                           23760000
238100                                TO CM-BUYER-MKDN-TY (SA-MJ-CLS)   23770000
238200         MOVE ML202-TY-MKDN-PLU-RTL-AMT                           23780000
238300                                TO CM-PLU-MKDN-TY (SA-MJ-CLS)     23790000
238400         MOVE ML202-TY-MKDN-RGST-RTL-AMT                          23800000
238500                                TO CM-PERM-MKDN-TY (SA-MJ-CLS)    23810000
238600         MOVE ML202-TY-MKDN-UMTCH-RTL-AMT                         23820000
238700                                TO CM-OTHER-MKDN-TY (SA-MJ-CLS)   23830000
238800         MOVE ML202-TY-DR-ALW-RTL-AMT                             23840000
238900                                TO CM-DEBIT-ALLOW-TY (SA-MJ-CLS)  23850000
239000         ADD PV-TOTAL-MKDN-TY   TO CMT-TOTAL-MKDN-TY              23860000
239100                                   TCMT-TOTAL-MKDN-TY             23870000
239200         ADD ML202-TY-MKUP-RTL-AMT                                23880000
239300                                TO CMT-TOTAL-MKUP-TY              23890000
239400                                   TCMT-TOTAL-MKUP-TY             23900000
239500         ADD ML202-TY-MKDN-STR-RTL-AMT                            23910000
239600                                TO CMT-STORE-MKDN-TY              23920000
239700                                   TCMT-STORE-MKDN-TY             23930000
239800         ADD ML202-TY-MKDN-BYR-RTL-AMT                            23940000
239900                                TO CMT-BUYER-MKDN-TY              23950000
240000                                   TCMT-BUYER-MKDN-TY             23960000
240100         ADD ML202-TY-MKDN-PLU-RTL-AMT                            23970000
240200                                TO CMT-PLU-MKDN-TY                23980000
240300                                   TCMT-PLU-MKDN-TY               23990000
240400         ADD ML202-TY-MKDN-RGST-RTL-AMT                           24000000
240500                                TO CMT-PERM-MKDN-TY               24010000
240600                                   TCMT-PERM-MKDN-TY              24020000
240700         ADD ML202-TY-MKDN-UMTCH-RTL-AMT                          24030000
240800                                TO CMT-OTHER-MKDN-TY              24040000
240900                                   TCMT-OTHER-MKDN-TY             24050000
241000         ADD ML202-TY-DR-ALW-RTL-AMT                              24060000
241100                                TO CMT-DEBIT-ALLOW-TY             24070000
241200                                   TCMT-DEBIT-ALLOW-TY            24080000
241300         MOVE PV-TOTAL-MKDN-LY  TO CM-TOTAL-MKDN-LY (SA-MJ-CLS)   24090000
241400         MOVE ML202-LY-MKUP-RTL-AMT                               24100000
241500                                TO CM-TOTAL-MKUP-LY (SA-MJ-CLS)   24110000
241600         MOVE ML202-LY-MKDN-PLU-RTL-AMT                           24120000
241700                                TO CM-PLU-MKDN-LY (SA-MJ-CLS)     24130000
241800         MOVE ML202-LY-MKDN-RGST-RTL-AMT                          24140000
241900                                TO CM-PERM-MKDN-LY (SA-MJ-CLS)    24150000
242000         MOVE ML202-LY-MKDN-UMTCH-RTL-AMT                         24160000
242100                                TO CM-OTHER-MKDN-LY (SA-MJ-CLS)   24170000
242200         ADD PV-TOTAL-MKDN-LY   TO CMT-TOTAL-MKDN-LY              24180000
242300                                   TCMT-TOTAL-MKDN-LY             24190000
242400         ADD ML202-LY-MKUP-RTL-AMT                                24200000
242500                                TO CMT-TOTAL-MKUP-LY              24210000
242600                                   TCMT-TOTAL-MKUP-LY             24220000
242700         ADD ML202-LY-MKDN-PLU-RTL-AMT                            24230000
242800                                TO CMT-PLU-MKDN-LY                24240000
242900                                   TCMT-PLU-MKDN-LY               24250000
243000         ADD ML202-LY-MKDN-RGST-RTL-AMT                           24260000
243100                                TO CMT-PERM-MKDN-LY               24270000
243200                                   TCMT-PERM-MKDN-LY              24280000
243300         ADD ML202-LY-MKDN-UMTCH-RTL-AMT                          24290000
243400                                TO CMT-OTHER-MKDN-LY              24300000
243500                                   TCMT-OTHER-MKDN-LY             24310000
243600     END-IF.                                                      24320000
243700                                                                  24330000
243800/                                                                 24340000
243900 2600-PROCESS-MISC.                                               24350000
244000******************************************************************24360000
244100*   2600-PROCESS-MISC                                            *24370000
244200*     ACCUMULATE AMOUNTS FOR THE WHOLE DATE-RANGE.               *24380000
244300*     PERFORMS TO ACCUMULATE AMOUNTS CURRENT-MONTH ONLY.         *24390000
244400*                                                                *24400000
244500*   PERFORMED BY:  2000-MAIN-ROUTINE.                            *24410000
244600******************************************************************24420000
244700                                                                  24430000
244800     IF ML202-ENT-ID = PC-UNKNOWN-VENDOR                          24440000
244900         ADD ML202-TY-GRO-MRGN-AMT TO UVRT-GROSS-MARGN-TY         24450000
245000     END-IF.                                                      24460000
245100                                                                  24470000
245200     ADD ML202-TY-GRO-MRGN-AMT TO CT-GROSS-MARGN-TY (SA-MJ-CLS)   24480000
245300                                  RT-GROSS-MARGN-TY               24490000
245400                                  VT-GROSS-MARGN-TY.              24500000
245500     ADD ML202-TY-SHNK-RTL-AMT TO CT-SHRINK-DLR-TY (SA-MJ-CLS)    24510000
245600                                  RT-SHRINK-DLR-TY                24520000
245700                                  VT-SHRINK-DLR-TY.               24530000
245800     ADD ML202-TY-INV-ADJ-RTL-AMT                                 24540000
245900                               TO CT-INV-ADJ-TY (SA-MJ-CLS)       24550000
246000                                  RT-INV-ADJ-TY                   24560000
246100                                  VT-INV-ADJ-TY.                  24570000
246200     ADD ML202-TY-RTV-RTL-AMT  TO CT-RET-TO-VENDR-TY (SA-MJ-CLS)  24580000
246300                                  RT-RET-TO-VENDR-TY              24590000
246400                                  VT-RET-TO-VENDR-TY.             24600000
246500     IF ML202-ENT-ID = PC-UNKNOWN-VENDOR                          24610000
246600         ADD ML202-LY-GRO-MRGN-AMT TO UVRT-GROSS-MARGN-LY         24620000
246700     END-IF.                                                      24630000
246800                                                                  24640000
246900     ADD ML202-LY-GRO-MRGN-AMT TO CT-GROSS-MARGN-LY (SA-MJ-CLS)   24650000
247000                                  RT-GROSS-MARGN-LY               24660000
247100                                  VT-GROSS-MARGN-LY.              24670000
247200     ADD ML202-LY-SHNK-RTL-AMT TO CT-SHRINK-DLR-LY (SA-MJ-CLS)    24680000
247300                                  RT-SHRINK-DLR-LY                24690000
247400                                  VT-SHRINK-DLR-LY.               24700000
247500     ADD ML202-LY-INV-ADJ-RTL-AMT                                 24710000
247600                               TO CT-INV-ADJ-LY (SA-MJ-CLS)       24720000
247700                                  RT-INV-ADJ-LY                   24730000
247800                                  VT-INV-ADJ-LY.                  24740000
247900                                                                  24750000
248000*****    GET INVEN-RTL OF THE LAST MONTH OF THE DATE-RANGE ONLY   24760000
248100*****        FOR PRINTING.                                        24770000
248200     MOVE ML202-FSCL-MN-NBR    TO PV-INPUT-MONTH.                 24780000
248300     IF PV-INPUT-MONTH = PV-FISCAL-TY-END-MONTH                   24790000
248400         ADD ML202-TY-END-INV-RTL-AMT                             24800000
248500                               TO CT-END-INV-RTL-TY (SA-MJ-CLS)   24810000
248600                                  RT-END-INV-RTL-TY               24820000
248700                                  VT-END-INV-RTL-TY               24830000
248800         ADD ML202-TY-END-INV-COST-AMT                            24840000
248900                               TO CT-END-INV-COST-TY (SA-MJ-CLS)  24850000
249000                                  RT-END-INV-COST-TY              24860000
249100                                  VT-END-INV-COST-TY              24870000
249200         ADD ML202-LY-END-INV-RTL-AMT                             24880000
249300                               TO CT-END-INV-RTL-LY (SA-MJ-CLS)   24890000
249400                                  RT-END-INV-RTL-LY               24900000
249500                                  VT-END-INV-RTL-LY               24910000
249600     END-IF.                                                      24920000
249700                                                                  24930000
249800     MOVE ML202-FSCL-MN-NBR    TO PV-INPUT-MONTH.                 24940000
249900     IF PV-INPUT-MONTH = PV-FISCAL-TY-END-MONTH                   24950000
250000*     FORMAT THE OTHER INFO DETAIL LINE FOR THE CURRENT MONTH ONLY24960000
250100         MOVE ML202-MAJ-CL-NBR TO CM-MISC-CLASS (SA-MJ-CLS)       24970000
250200         MOVE ML202-NAME-MCL   TO CM-MISC-CLASS-DESC (SA-MJ-CLS)  24980000
250300         MOVE ML202-TY-GRO-MRGN-AMT                               24990000
250400                               TO CM-GROSS-MARGN-TY (SA-MJ-CLS)   25000000
250500         MOVE ML202-TY-SHNK-RTL-AMT                               25010000
250600                               TO CM-SHRINK-DLR-TY (SA-MJ-CLS)    25020000
250700         MOVE ML202-TY-INV-ADJ-RTL-AMT                            25030000
250800                               TO CM-INV-ADJ-TY (SA-MJ-CLS)       25040000
250900         MOVE ML202-TY-END-INV-RTL-AMT                            25050000
251000                               TO CM-END-INV-RTL-TY (SA-MJ-CLS)   25060000
251100         MOVE ML202-TY-END-INV-COST-AMT                           25070000
251200                               TO CM-END-INV-COST-TY (SA-MJ-CLS)  25080000
251300         MOVE ML202-TY-RTV-RTL-AMT                                25090000
251400                               TO CM-RET-TO-VENDR-TY (SA-MJ-CLS)  25100000
251500         ADD ML202-TY-GRO-MRGN-AMT                                25110000
251600                               TO CMT-GROSS-MARGN-TY              25120000
251700                                  TCMT-GROSS-MARGN-TY             25130000
251800         ADD ML202-TY-SHNK-RTL-AMT                                25140000
251900                               TO CMT-SHRINK-DLR-TY               25150000
252000                                  TCMT-SHRINK-DLR-TY              25160000
252100         ADD ML202-TY-INV-ADJ-RTL-AMT                             25170000
252200                               TO CMT-INV-ADJ-TY                  25180000
252300                                  TCMT-INV-ADJ-TY                 25190000
252400         ADD ML202-TY-END-INV-RTL-AMT                             25200000
252500                               TO CMT-END-INV-RTL-TY              25210000
252600                                  TCMT-END-INV-RTL-TY             25220000
252700         ADD ML202-TY-END-INV-COST-AMT                            25230000
252800                               TO CMT-END-INV-COST-TY             25240000
252900                                  TCMT-END-INV-COST-TY            25250000
253000         ADD ML202-TY-RTV-RTL-AMT                                 25260000
253100                               TO CMT-RET-TO-VENDR-TY             25270000
253200                                  TCMT-RET-TO-VENDR-TY            25280000
253300         MOVE ML202-LY-GRO-MRGN-AMT                               25290000
253400                               TO CM-GROSS-MARGN-LY (SA-MJ-CLS)   25300000
253500         MOVE ML202-LY-SHNK-RTL-AMT                               25310000
253600                               TO CM-SHRINK-DLR-LY (SA-MJ-CLS)    25320000
253700         MOVE ML202-LY-INV-ADJ-RTL-AMT                            25330000
253800                               TO CM-INV-ADJ-LY (SA-MJ-CLS)       25340000
253900         MOVE ML202-LY-END-INV-RTL-AMT                            25350000
254000                               TO CM-END-INV-RTL-LY (SA-MJ-CLS)   25360000
254100         ADD ML202-LY-GRO-MRGN-AMT                                25370000
254200                               TO CMT-GROSS-MARGN-LY              25380000
254300                                  TCMT-GROSS-MARGN-LY             25390000
254400         ADD ML202-LY-SHNK-RTL-AMT                                25400000
254500                               TO CMT-SHRINK-DLR-LY               25410000
254600                                  TCMT-SHRINK-DLR-LY              25420000
254700         ADD ML202-LY-INV-ADJ-RTL-AMT                             25430000
254800                               TO CMT-INV-ADJ-LY                  25440000
254900                                  TCMT-INV-ADJ-LY                 25450000
255000         ADD ML202-LY-END-INV-RTL-AMT                             25460000
255100                               TO CMT-END-INV-RTL-LY              25470000
255200                                  TCMT-END-INV-RTL-LY             25480000
255300         IF ML202-ENT-ID = PC-UNKNOWN-VENDOR                      25490000
255400             ADD ML202-TY-GRO-MRGN-AMT TO TUVRT-GROSS-MARGN-TY    25500000
255500         END-IF                                                   25510000
255600         IF ML202-ENT-ID = PC-UNKNOWN-VENDOR                      25520000
255700             ADD ML202-LY-GRO-MRGN-AMT TO TUVRT-GROSS-MARGN-LY    25530000
255800         END-IF                                                   25540000
255900     END-IF.                                                      25550000
256000                                                                  25560000
256100 2700-PROCESS-SUMM-RECAP.                                         25570000
256200******************************************************************25580000
256300*   2700-PROCESS-SUMM-RECAP                                      *25590000
256400*     ACCUMULATE AMOUNTS FOR THE SUMMARY RECAP DETAIL LINES AND  *25600000
256500*     THE TOTAL LINES.                                           *25610000
256600*                                                                *25620000
256700*   PERFORMED BY:  2000-MAIN-ROUTINE.                            *25630000
256800******************************************************************25640000
256900                                                                  25650000
257000     COMPUTE PV-CUM-TO-DATE-PURCH-COST-TY =                       25660000
257100                                 ML202-TY-PREV-SEA-EI-COST        25670000
257200                               + ML202-TY-RCPT-NET-COST-AMT       25680000
257300                               + ML202-TY-PADJ-NET-COST-AMT.      25690000
257400     ADD PV-CUM-TO-DATE-PURCH-COST-TY                             25700000
257500                      TO CT-CUM-TO-DATE-PURCH-COST-TY (SA-MJ-CLS) 25710000
257600                         RT-CUM-TO-DATE-PURCH-COST-TY             25720000
257700                         VT-CUM-TO-DATE-PURCH-COST-TY.            25730000
257800                                                                  25740000
257900     COMPUTE PV-CUM-TO-DATE-PURCH-RETAIL-TY =                     25750000
258000                                 ML202-TY-PREV-SEA-EI-RTL         25760000
258100                               + ML202-TY-XFER-IN-RTL-AMT         25770000
258200                               - ML202-TY-XFER-OUT-RTL-AMT        25780000
258300                               + ML202-TY-RCPT-RTL-AMT            25790000
258400                               + ML202-TY-PADJ-RTL-AMT            25800000
258500                               + ML202-TY-MKUP-RTL-AMT.           25810000
258600     ADD PV-CUM-TO-DATE-PURCH-RETAIL-TY                           25820000
258700                     TO CT-CUM-TO-DATE-PURCH-RETAIL-TY (SA-MJ-CLS)25830000
258800                        RT-CUM-TO-DATE-PURCH-RETAIL-TY            25840000
258900                        VT-CUM-TO-DATE-PURCH-RETAIL-TY.           25850000
259000                                                                  25860000
259100     IF ML202-ENT-ID = PC-UNKNOWN-VENDOR                          25870000
259200         ADD PV-CUM-TO-DATE-PURCH-COST-TY TO                      25880000
259300             UVRT-STD-PURCH-COST-TY                               25890000
259400         ADD PV-CUM-TO-DATE-PURCH-COST-LY TO                      25900000
259500             UVRT-STD-PURCH-COST-LY                               25910000
259600         ADD PV-CUM-TO-DATE-PURCH-RETAIL-TY TO                    25920000
259700             UVRT-STD-PURCH-RETAIL-TY                             25930000
259800         ADD PV-CUM-TO-DATE-PURCH-RETAIL-LY TO                    25940000
259900             UVRT-STD-PURCH-RETAIL-LY                             25950000
260000     END-IF.                                                      25960000
260100                                                                  25970000
260200     COMPUTE PV-CUM-TO-DATE-PURCH-COST-LY =                       25980000
260300                                 ML202-LY-PREV-SEA-EI-COST        25990000
260400                               + ML202-LY-RCPT-NET-COST-AMT       26000000
260500                               + ML202-LY-PADJ-NET-COST-AMT.      26010000
260600     ADD PV-CUM-TO-DATE-PURCH-COST-LY                             26020000
260700                      TO CT-CUM-TO-DATE-PURCH-COST-LY (SA-MJ-CLS) 26030000
260800                         RT-CUM-TO-DATE-PURCH-COST-LY             26040000
260900                         VT-CUM-TO-DATE-PURCH-COST-LY.            26050000
261000                                                                  26060000
261100     COMPUTE PV-CUM-TO-DATE-PURCH-RETAIL-LY =                     26070000
261200                                 ML202-LY-PREV-SEA-EI-RTL         26080000
261300                               + ML202-LY-XFER-IN-RTL-AMT         26090000
261400                               - ML202-LY-XFER-OUT-RTL-AMT        26100000
261500                               + ML202-LY-RCPT-RTL-AMT            26110000
261600                               + ML202-LY-PADJ-RTL-AMT            26120000
261700                               + ML202-LY-MKUP-RTL-AMT.           26130000
261800     ADD PV-CUM-TO-DATE-PURCH-RETAIL-LY                           26140000
261900                     TO CT-CUM-TO-DATE-PURCH-RETAIL-LY (SA-MJ-CLS)26150000
262000                        RT-CUM-TO-DATE-PURCH-RETAIL-LY            26160000
262100                        VT-CUM-TO-DATE-PURCH-RETAIL-LY.           26170000
262200                                                                  26180000
262300     MOVE ML202-FSCL-MN-NBR    TO PV-INPUT-MONTH.                 26190000
262400     IF PV-INPUT-MONTH = PV-FISCAL-TY-END-MONTH                   26200000
262500*     FORMAT THE SUMM RECAP DETAIL LINE FOR THE CURRENT MONTH ONLY26210000
262600         MOVE PV-CUM-TO-DATE-PURCH-COST-TY                        26220000
262700                    TO CM-CUM-TO-DATE-PURCH-COST-TY  (SA-MJ-CLS)  26230000
262800         MOVE PV-CUM-TO-DATE-PURCH-RETAIL-TY                      26240000
262900                    TO CM-CUM-TO-DTE-PURCH-RETAIL-TY (SA-MJ-CLS)  26250000
263000         ADD PV-CUM-TO-DATE-PURCH-COST-TY                         26260000
263100                    TO CMT-CUM-TO-DATE-PURCH-COST-TY              26270000
263200                       TCMT-CUM-TO-DATE-PURCH-COST-TY             26280000
263300         ADD PV-CUM-TO-DATE-PURCH-RETAIL-TY                       26290000
263400                    TO CMT-CUM-TO-DATE-PURCH-RTL-TY               26300000
263500                       TCMT-CUM-TO-DATE-PURCH-RTL-TY              26310000
263600         MOVE PV-CUM-TO-DATE-PURCH-COST-LY                        26320000
263700                    TO CM-CUM-TO-DATE-PURCH-COST-LY  (SA-MJ-CLS)  26330000
263800         MOVE PV-CUM-TO-DATE-PURCH-RETAIL-LY                      26340000
263900                    TO CM-CUM-TO-DTE-PURCH-RETAIL-LY (SA-MJ-CLS)  26350000
264000         ADD PV-CUM-TO-DATE-PURCH-COST-LY                         26360000
264100                    TO CMT-CUM-TO-DATE-PURCH-COST-LY              26370000
264200                       TCMT-CUM-TO-DATE-PURCH-COST-LY             26380000
264300         ADD PV-CUM-TO-DATE-PURCH-RETAIL-LY                       26390000
264400                    TO CMT-CUM-TO-DATE-PURCH-RTL-LY               26400000
264500                       TCMT-CUM-TO-DATE-PURCH-RTL-LY              26410000
264600         IF ML202-ENT-ID = PC-UNKNOWN-VENDOR                      26420000
264700             ADD PV-CUM-TO-DATE-PURCH-COST-TY TO                  26430000
264800                TUVRT-STD-PURCH-COST-TY                           26440000
264900             ADD PV-CUM-TO-DATE-PURCH-COST-LY TO                  26450000
265000                TUVRT-STD-PURCH-COST-LY                           26460000
265100             ADD PV-CUM-TO-DATE-PURCH-RETAIL-TY TO                26470000
265200                TUVRT-STD-PURCH-RETAIL-TY                         26480000
265300             ADD PV-CUM-TO-DATE-PURCH-RETAIL-LY TO                26490000
265400                TUVRT-STD-PURCH-RETAIL-LY                         26500000
265500         END-IF                                                   26510000
265600     END-IF.                                                      26520000
265700                                                                  26530000
265800/                                                                 26540000
265900 2800-VENDOR-BREAK-PROCESS.                                       26550000
266000******************************************************************26560000
266100*   2800-VENDOR-BREAK-PROCESS                                    *26570000
266200*     PRINT ALL YEAR TO DATE DETAIL LINES AND TOTAL LINES IF     *26580000
266300*     THIS YEAR AND LAST YEAR TOTAL SALES IS GREATER THAN THE    *26590000
266400*     MINIMUM AMOUNT, ELSE ADD THE TOTALS TO THE MISCELLANEOUS   *26600000
266500*     VENDOR TOTAL AMOUNTS.                                      *26610000
266600*     FORMAT THE CURRENT-MONTH MISC INFO FOR BACK OF PAGE        *26620000
266700*     PRINT 'RECAP SUMMARY' LINES                                *26630000
266800*     PRINT THE BACK PAGE FROM TABLE.  THIS WILL PRINT THE       *26640000
266900*        ENTIRE BACK PAGE.                                       *26650000
267000*     PRINT THE MISCELLANEOUS VENDOR TOTALS PAGES.               *26660000
267100*     RE-INITIALIZE VARIOUS WS AREAS.                            *26670000
267200*                                                                *26680000
267300*   PERFORMED BY:  2000-MAIN-ROUTINE.                            *26690000
267400******************************************************************26700000
267500*-- IF LAST YEAR IS 1998, DO NOT CHECK LAST YEAR SALES            26710000
267600     IF PV-HDG-START-CCYY-LY = PC-1998                            26720000
267700         IF VT-TOTAL-SALES-TY > PC-MIN-TOTAL-SALES                26730000
267800         OR                                                       26740000
267900           (SA-ENT-ID  = PC-UNKNOWN-VENDOR)                       26750000
268000             PERFORM 2200-PROCESS-NAMES                           26760000
268100             PERFORM 3100-PRINT-AP-YTD                            26770000
268200             PERFORM 3200-PRINT-SALES-YTD                         26780000
268300             PERFORM 3300-PRINT-PC-YTD                            26790000
268400             PERFORM 3400-PRINT-MISC-YTD                          26800000
268500             PERFORM 2820-PRINT-RECAP                             26810000
268600             PERFORM 2830-PRINT-BACK-PAGE                         26820000
268700         ELSE                                                     26830000
268800             PERFORM 2810-ADD-TO-MISC-TOTALS                      26840000
268900         END-IF                                                   26850000
269000     ELSE                                                         26860000
269100         IF (VT-TOTAL-SALES-TY > PC-MIN-TOTAL-SALES               26870000
269200         OR  VT-TOTAL-SALES-LY > PC-MIN-TOTAL-SALES)              26880000
269300         OR                                                       26890000
269400            (SA-ENT-ID  = PC-UNKNOWN-VENDOR)                      26900000
269500             PERFORM 2200-PROCESS-NAMES                           26910000
269600             PERFORM 3100-PRINT-AP-YTD                            26920000
269700             PERFORM 3200-PRINT-SALES-YTD                         26930000
269800             PERFORM 3300-PRINT-PC-YTD                            26940000
269900             PERFORM 3400-PRINT-MISC-YTD                          26950000
270000             PERFORM 2820-PRINT-RECAP                             26960000
270100             PERFORM 2830-PRINT-BACK-PAGE                         26970000
270200         ELSE                                                     26980000
270300             PERFORM 2810-ADD-TO-MISC-TOTALS                      26990000
270400         END-IF                                                   27000000
270500     END-IF.                                                      27010000
270600                                                                  27020000
270700     INITIALIZE CM-CURRENT-MONTH-TABLE                            27030000
270800                CMT-CURRENT-MONTH-TOTALS                          27040000
270900                CT-CLASS-TOTALS                                   27050000
271000                VT-VENDOR-TOTALS.                                 27060000
271100                                                                  27070000
271200**  NEXT LINE SET TO PAGE EJECT WHEN WRITING THE NEXT             27080000
271300**  HEADING.                                                      27090000
271400      MOVE 0 TO PA-LINE-NO.                                       27100000
271500                                                                  27110000
271600**  CHECK FOR A NEW DEPARTMENT IN ORDER TO PRINT THE MISCELLANEOUS27120000
271700**  VENDOR TOTALS PAGES.                                          27130000
271800     IF ML202-DEPT-NBR NOT = SA-DEPT-NMBR                         27140000
271900         PERFORM 4200-PRINT-MISC-VENDOR                           27150000
272000         INITIALIZE MCMT-MISC-CURRENT-MONTH-TOTALS                27160000
272100                    MVT-MISC-VENDOR-TOTALS                        27170000
272200         MOVE 0 TO PA-LINE-NO                                     27180000
272300     END-IF.                                                      27190000
272400                                                                  27200000
272500/                                                                 27210000
272600 2810-ADD-TO-MISC-TOTALS.                                         27220000
272700******************************************************************27230000
272800*   2810-ADD-TO-MISC-TOTALS.                                     *27240000
272900*     ADD THE SEASON-TO-DATE AND CURRENT MONTH VENDOR TOTALS TO  *27250000
273000*     THE MISCELLANEOUS VENDOR TOTALS.                           *27260000
273100*                                                                *27270000
273200*   PERFORMED BY:  2800-VENDOR-BREAK-PROCESS                     *27280000
273300******************************************************************27290000
273400                                                                  27300000
273500     ADD VT-GROSS-COST        TO MVT-GROSS-COST.                  27310000
273600     ADD VT-PURCH-ADJ-COST-TY TO MVT-PURCH-ADJ-COST-TY.           27320000
273700     ADD VT-PURCH-ADJ-COST-LY TO MVT-PURCH-ADJ-COST-LY.           27330000
273800     ADD VT-PURCH-ADJ-RETAIL  TO MVT-PURCH-ADJ-RETAIL.            27340000
273900     ADD VT-RECEIPTS-COST-TY  TO MVT-RECEIPTS-COST-TY.            27350000
274000     ADD VT-RECEIPTS-RTL-TY   TO MVT-RECEIPTS-RTL-TY.             27360000
274100     ADD VT-PURCH-ADJ-RTL-TY  TO MVT-PURCH-ADJ-RTL-TY.            27370000
274200     ADD VT-RECEIPTS-COST-LY  TO MVT-RECEIPTS-COST-LY.            27380000
274300     ADD VT-RECEIPTS-RTL-LY   TO MVT-RECEIPTS-RTL-LY.             27390000
274400     ADD VT-PURCH-ADJ-RTL-LY  TO MVT-PURCH-ADJ-RTL-LY.            27400000
274500     ADD VT-NET-COST-TY       TO MVT-NET-COST-TY.                 27410000
274600     ADD VT-NET-COST-LY       TO MVT-NET-COST-LY.                 27420000
274700     ADD VT-RETAIL-PURCH-TY   TO MVT-RETAIL-PURCH-TY.             27430000
274800     ADD VT-RETAIL-PURCH-LY   TO MVT-RETAIL-PURCH-LY.             27440000
274900     ADD VT-INITIAL-MARKON-TY TO MVT-INITIAL-MARKON-TY.           27450000
275000     ADD VT-INITIAL-MARKON-LY TO MVT-INITIAL-MARKON-LY.           27460000
275100     ADD VT-NET-MARKON-TY     TO MVT-NET-MARKON-TY.               27470000
275200     ADD VT-NET-MARKON-LY     TO MVT-NET-MARKON-LY.               27480000
275300     ADD VT-TOTAL-SALES-TY    TO MVT-TOTAL-SALES-TY.              27490000
275400     ADD VT-TOTAL-SALES-LY    TO MVT-TOTAL-SALES-LY.              27500000
275500     ADD VT-REGULAR-SALES-TY  TO MVT-REGULAR-SALES-TY.            27510000
275600     ADD VT-REGULAR-SALES-LY  TO MVT-REGULAR-SALES-LY.            27520000
275700     ADD VT-PROMO-SALES-TY    TO MVT-PROMO-SALES-TY.              27530000
275800     ADD VT-PROMO-SALES-LY    TO MVT-PROMO-SALES-LY.              27540000
275900     ADD VT-GOLDSTAR-SALES-TY TO MVT-GOLDSTAR-SALES-TY.           27550000
276000     ADD VT-GOLDSTAR-SALES-LY TO MVT-GOLDSTAR-SALES-LY.           27560000
276100     ADD VT-CLEAR-SALES-TY    TO MVT-CLEAR-SALES-TY.              27570000
276200     ADD VT-CLEAR-SALES-LY    TO MVT-CLEAR-SALES-LY.              27580000
276300     ADD VT-UNKWN-SALES-TY    TO MVT-UNKWN-SALES-TY.              27590000
276400     ADD VT-UNKWN-SALES-LY    TO MVT-UNKWN-SALES-LY.              27600000
276500     ADD VT-TOTAL-MKDN-TY     TO MVT-TOTAL-MKDN-TY.               27610000
276600     ADD VT-TOTAL-MKDN-LY     TO MVT-TOTAL-MKDN-LY.               27620000
276700     ADD VT-TOTAL-MKUP-TY     TO MVT-TOTAL-MKUP-TY.               27630000
276800     ADD VT-TOTAL-MKUP-LY     TO MVT-TOTAL-MKUP-LY.               27640000
276900     ADD VT-STORE-MKDN-TY     TO MVT-STORE-MKDN-TY.               27650000
277000     ADD VT-BUYER-MKDN-TY     TO MVT-BUYER-MKDN-TY.               27660000
277100     ADD VT-PLU-MKDN-TY       TO MVT-PLU-MKDN-TY.                 27670000
277200     ADD VT-PLU-MKDN-LY       TO MVT-PLU-MKDN-LY.                 27680000
277300     ADD VT-PERM-MKDN-TY      TO MVT-PERM-MKDN-TY.                27690000
277400     ADD VT-PERM-MKDN-LY      TO MVT-PERM-MKDN-LY.                27700000
277500     ADD VT-OTHER-MKDN-TY     TO MVT-OTHER-MKDN-TY.               27710000
277600     ADD VT-OTHER-MKDN-LY     TO MVT-OTHER-MKDN-LY.               27720000
277700     ADD VT-DEBIT-ALLOW-TY    TO MVT-DEBIT-ALLOW-TY.              27730000
277800     ADD VT-GROSS-MARGN-TY    TO MVT-GROSS-MARGN-TY.              27740000
277900     ADD VT-GROSS-MARGN-LY    TO MVT-GROSS-MARGN-LY.              27750000
278000     ADD VT-SHRINK-DLR-TY     TO MVT-SHRINK-DLR-TY.               27760000
278100     ADD VT-SHRINK-DLR-LY     TO MVT-SHRINK-DLR-LY.               27770000
278200     ADD VT-END-INV-RTL-TY    TO MVT-END-INV-RTL-TY.              27780000
278300     ADD VT-END-INV-RTL-LY    TO MVT-END-INV-RTL-LY.              27790000
278400     ADD VT-END-INV-COST-TY   TO MVT-END-INV-COST-TY.             27800000
278500     ADD VT-INV-ADJ-TY        TO MVT-INV-ADJ-TY.                  27810000
278600     ADD VT-INV-ADJ-LY        TO MVT-INV-ADJ-LY.                  27820000
278700     ADD VT-RET-TO-VENDR-TY   TO MVT-RET-TO-VENDR-TY.             27830000
278800     ADD VT-CUM-TO-DATE-PURCH-RETAIL-TY                           27840000
278900                              TO MVT-CUM-TO-DATE-PURCH-RTL-TY.    27850000
279000     ADD VT-CUM-TO-DATE-PURCH-RETAIL-LY                           27860000
279100                              TO MVT-CUM-TO-DATE-PURCH-RTL-LY.    27870000
279200     ADD VT-CUM-TO-DATE-PURCH-COST-TY                             27880000
279300                              TO MVT-CUM-TO-DATE-PURCH-COST-TY.   27890000
279400     ADD VT-CUM-TO-DATE-PURCH-COST-LY                             27900000
279500                              TO MVT-CUM-TO-DATE-PURCH-COST-LY.   27910000
279600                                                                  27920000
279700     ADD CMT-GROSS-COST       TO MCMT-GROSS-COST.                 27930000
279800     ADD CMT-PURCH-ADJ-COST-TY TO MCMT-PURCH-ADJ-COST-TY.         27940000
279900     ADD CMT-PURCH-ADJ-COST-LY TO MCMT-PURCH-ADJ-COST-LY.         27950000
280000     ADD CMT-PURCH-ADJ-RETAIL TO MCMT-PURCH-ADJ-RETAIL.           27960000
280100     ADD CMT-NET-COST-TY      TO MCMT-NET-COST-TY.                27970000
280200     ADD CMT-NET-COST-LY      TO MCMT-NET-COST-LY.                27980000
280300     ADD CMT-RETAIL-PURCH-TY  TO MCMT-RETAIL-PURCH-TY.            27990000
280400     ADD CMT-RETAIL-PURCH-LY  TO MCMT-RETAIL-PURCH-LY.            28000000
280500     ADD CMT-INITIAL-MARKON-TY TO MCMT-INITIAL-MARKON-TY.         28010000
280600     ADD CMT-INITIAL-MARKON-LY TO MCMT-INITIAL-MARKON-LY.         28020000
280700     ADD CMT-NET-MARKON-TY    TO MCMT-NET-MARKON-TY.              28030000
280800     ADD CMT-NET-MARKON-LY    TO MCMT-NET-MARKON-LY.              28040000
280900     ADD CMT-TOTAL-SALES-TY   TO MCMT-TOTAL-SALES-TY.             28050000
281000     ADD CMT-TOTAL-SALES-LY   TO MCMT-TOTAL-SALES-LY.             28060000
281100     ADD CMT-REGULAR-SALES-TY TO MCMT-REGULAR-SALES-TY.           28070000
281200     ADD CMT-REGULAR-SALES-LY TO MCMT-REGULAR-SALES-LY.           28080000
281300     ADD CMT-PROMO-SALES-TY   TO MCMT-PROMO-SALES-TY.             28090000
281400     ADD CMT-PROMO-SALES-LY   TO MCMT-PROMO-SALES-LY.             28100000
281500     ADD CMT-GOLDSTAR-SALES-TY TO MCMT-GOLDSTAR-SALES-TY.         28110000
281600     ADD CMT-GOLDSTAR-SALES-LY TO MCMT-GOLDSTAR-SALES-LY.         28120000
281700     ADD CMT-CLEAR-SALES-TY   TO MCMT-CLEAR-SALES-TY.             28130000
281800     ADD CMT-CLEAR-SALES-LY   TO MCMT-CLEAR-SALES-LY.             28140000
281900     ADD CMT-UNKWN-SALES-TY   TO MCMT-UNKWN-SALES-TY.             28150000
282000     ADD CMT-UNKWN-SALES-LY   TO MCMT-UNKWN-SALES-LY.             28160000
282100     ADD CMT-TOTAL-MKDN-TY    TO MCMT-TOTAL-MKDN-TY.              28170000
282200     ADD CMT-TOTAL-MKDN-LY    TO MCMT-TOTAL-MKDN-LY.              28180000
282300     ADD CMT-TOTAL-MKUP-TY    TO MCMT-TOTAL-MKUP-TY.              28190000
282400     ADD CMT-TOTAL-MKUP-LY    TO MCMT-TOTAL-MKUP-LY.              28200000
282500     ADD CMT-STORE-MKDN-TY    TO MCMT-STORE-MKDN-TY.              28210000
282600     ADD CMT-BUYER-MKDN-TY    TO MCMT-BUYER-MKDN-TY.              28220000
282700     ADD CMT-PLU-MKDN-TY      TO MCMT-PLU-MKDN-TY.                28230000
282800     ADD CMT-PLU-MKDN-LY      TO MCMT-PLU-MKDN-LY.                28240000
282900     ADD CMT-PERM-MKDN-TY     TO MCMT-PERM-MKDN-TY.               28250000
283000     ADD CMT-PERM-MKDN-LY     TO MCMT-PERM-MKDN-LY.               28260000
283100     ADD CMT-OTHER-MKDN-TY    TO MCMT-OTHER-MKDN-TY.              28270000
283200     ADD CMT-OTHER-MKDN-LY    TO MCMT-OTHER-MKDN-LY.              28280000
283300     ADD CMT-DEBIT-ALLOW-TY   TO MCMT-DEBIT-ALLOW-TY.             28290000
283400     ADD CMT-GROSS-MARGN-TY   TO MCMT-GROSS-MARGN-TY.             28300000
283500     ADD CMT-GROSS-MARGN-LY   TO MCMT-GROSS-MARGN-LY.             28310000
283600     ADD CMT-SHRINK-DLR-TY    TO MCMT-SHRINK-DLR-TY.              28320000
283700     ADD CMT-SHRINK-DLR-LY    TO MCMT-SHRINK-DLR-LY.              28330000
283800     ADD CMT-END-INV-RTL-TY   TO MCMT-END-INV-RTL-TY.             28340000
283900     ADD CMT-END-INV-RTL-LY   TO MCMT-END-INV-RTL-LY.             28350000
284000     ADD CMT-END-INV-COST-TY  TO MCMT-END-INV-COST-TY.            28360000
284100     ADD CMT-INV-ADJ-TY       TO MCMT-INV-ADJ-TY.                 28370000
284200     ADD CMT-INV-ADJ-LY       TO MCMT-INV-ADJ-LY.                 28380000
284300     ADD CMT-RET-TO-VENDR-TY  TO MCMT-RET-TO-VENDR-TY.            28390000
284400     ADD CMT-CUM-TO-DATE-PURCH-RTL-TY                             28400000
284500                             TO MCMT-CUM-TO-DATE-PURCH-RTL-TY.    28410000
284600     ADD CMT-CUM-TO-DATE-PURCH-RTL-LY                             28420000
284700                             TO MCMT-CUM-TO-DATE-PURCH-RTL-LY.    28430000
284800     ADD CMT-CUM-TO-DATE-PURCH-COST-TY                            28440000
284900                              TO MCMT-CUM-TO-DATE-PURCH-COST-TY.  28450000
285000     ADD CMT-CUM-TO-DATE-PURCH-COST-LY                            28460000
285100                              TO MCMT-CUM-TO-DATE-PURCH-COST-LY.  28470000
285200                                                                  28480000
285300/                                                                 28490000
285400 2820-PRINT-RECAP.                                                28500000
285500******************************************************************28510000
285600*   2820-PRINT-RECAP.                                            *28520000
285700*     THE Y-T-D LINES WILL BE PRINTED FIRST AT THE FRONT OF THE  *28530000
285800*       PAGE, THEN THE CURRENT-MONTH LINES WILL BE FORMATTED     *28540000
285900*       AND MOVED TO THE TABLE.                                  *28550000
286000*                                                                *28560000
286100*   PERFORMED BY:  2800-VENDOR-BREAK-PROCESS                     *28570000
286200******************************************************************28580000
286300                                                                  28590000
286400      PERFORM 2821-PRINT-RECAP-HEADING.                           28600000
286500      SET PI-PRINT-FRONT      TO TRUE.                            28610000
286600      PERFORM 2822-PRINT-RECAP-CLASS.                             28620000
286700      PERFORM 2824-PRINT-RECAP-TOTAL.                             28630000
286800                                                                  28640000
286900      SET PI-PRINT-BACK       TO TRUE.                            28650000
287000      MOVE CM-CURRENT-MONTH-TABLE TO CT-CLASS-TOTALS.             28660000
287100      PERFORM 2822-PRINT-RECAP-CLASS.                             28670000
287200      MOVE CMT-AP-DATA   TO VT-AP-DATA.                           28680000
287300      MOVE CMT-SALES-DATA TO VT-SALES-DATA.                       28690000
287400      MOVE CMT-PC-DATA   TO VT-PC-DATA.                           28700000
287500      MOVE CMT-MISC-DATA TO VT-MISC-DATA.                         28710000
287600      MOVE CMT-SUMM-RECAP-DATA TO VT-SUMM-RECAP-DATA.             28720000
287700      PERFORM 2824-PRINT-RECAP-TOTAL.                             28730000
287800/                                                                 28740000
287900 2821-PRINT-RECAP-HEADING.                                        28750000
288000******************************************************************28760000
288100*   2821-PRINT-RECAP-HEADING                                     *28770000
288200*     PRINT/FORMAT RECAP SUB-HEADING LINE FOR BOTH FRONT AND     *28780000
288300*     BACK OF THE PAGE.                                          *28790000
288400*                                                                *28800000
288500*   PERFORMED BY:  2820-PRINT-RECAP.                             *28810000
288600******************************************************************28820000
288700                                                                  28830000
288800     SET PI-PRINT-FRONT           TO TRUE.                        28840000
288900     MOVE PV-HDG-DATE-TY          TO H6-DATE-RANGE-TY.            28850000
289000     MOVE PV-HDG-DATE-LY          TO H6-DATE-RANGE-LY.            28860000
289100     MOVE H6-HEADING6             TO RR-REPORT-RECORD.            28870000
289200     MOVE 1                       TO PA-LINE-NO.                  28880000
289300     PERFORM 5000-WRITE-REPORT-LINE.                              28890000
289400                                                                  28900000
289500     MOVE PV-MON-DATE-TY          TO H6-DATE-RANGE-TY.            28910000
289600     MOVE PV-MON-DATE-LY          TO H6-DATE-RANGE-LY.            28920000
289700     SET PI-PRINT-BACK            TO TRUE.                        28930000
289800     MOVE H6-HEADING6             TO RR-REPORT-RECORD.            28940000
289900     MOVE 1                       TO PA-LINE-NO.                  28950000
290000     PERFORM 5000-WRITE-REPORT-LINE.                              28960000
290100                                                                  28970000
290200     SET PI-PRINT-BOTH TO TRUE.                                   28980000
290300     MOVE BL-BAR-LINE             TO RR-REPORT-RECORD.            28990000
290400     MOVE 1                       TO PA-LINE-NO.                  29000000
290500     PERFORM 5000-WRITE-REPORT-LINE.                              29010000
290600     MOVE H11-HEADING11A          TO RR-REPORT-RECORD             29020000
290700     PERFORM 5000-WRITE-REPORT-LINE.                              29030000
290800     MOVE H11-HEADING11B          TO RR-REPORT-RECORD             29040000
290900     PERFORM 5000-WRITE-REPORT-LINE.                              29050000
291000                                                                  29060000
291100/                                                                 29070000
291200 2822-PRINT-RECAP-CLASS.                                          29080000
291300                                                                  29090000
291400******************************************************************29100000
291500*   2822-PRINT-RECAP-CLASS                                       *29110000
291600*     PERFORM TO PRINT THE RECAP DETAIL LINES.                   *29120000
291700*                                                                *29130000
291800*   PERFORMED BY:  2820-PRINT-RECAP.                             *29140000
291900******************************************************************29150000
292000                                                                  29160000
292100     PERFORM VARYING PA-SUB FROM 1 BY 1 UNTIL PA-SUB > 9          29170000
292200         IF CT-AP-CLASS (PA-SUB) = 0                              29180000
292300            AND CT-SALES-CLASS (PA-SUB) = 0                       29190000
292400            AND CT-PC-CLASS (PA-SUB) = 0                          29200000
292500            AND CT-MISC-CLASS (PA-SUB) = 0                        29210000
292600            CONTINUE                                              29220000
292700         ELSE                                                     29230000
292800             PERFORM 2823-PRINT-RECAP-CLASS                       29240000
292900         END-IF                                                   29250000
293000     END-PERFORM.                                                 29260000
293100                                                                  29270000
293200/                                                                 29280000
293300 2823-PRINT-RECAP-CLASS.                                          29290000
293400******************************************************************29300000
293500*   2823-PRINT-RECAP-CLASS                                       *29310000
293600*     FORMAT AND PRINT THE RECAP DETAIL LINE.                    *29320000
293700*                                                                *29330000
293800*   PERFORMED BY:  2822-PRINT-RECAP-CLASS                        *29340000
293900******************************************************************29350000
294000                                                                  29360000
294100     MOVE   CT-AP-CLASS (PA-SUB)             TO DL-SR-CLASS.      29370000
294200     MOVE   CT-AP-CLASS-DESC (PA-SUB)        TO DL-SR-CLASS-DESC. 29380000
294300                                                                  29390000
294400******************************************************************29400000
294500*    COMPUTE DL-SR-GROSS-COST ROUNDED =                           29410000
294600*                     CT-GROSS-COST (PA-SUB)  / 1000.00.          29420000
294700*    COMPUTE DL-SR-PURCH-ADJ-COST-TY ROUNDED =                    29430000
294800*                     CT-PURCH-ADJ-COST-TY (PA-SUB) / 1000.00.    29440000
294900*    COMPUTE DL-SR-NET-COST-TY ROUNDED =                          29450000
295000*                     CT-NET-COST-TY (PA-SUB) / 1000.00.          29460000
295100*    COMPUTE DL-SR-RETAIL-PURCH-TY ROUNDED =                      29470000
295200*                     CT-RETAIL-PURCH-TY (PA-SUB) / 1000.00.      29480000
295300     COMPUTE DL-SR-RECEIPTS-COST-TY ROUNDED =                     29490000
295400             CT-RECEIPTS-COST-TY (PA-SUB) / 1000.00.              29500000
295500     COMPUTE DL-SR-RECEIPTS-RETAIL-TY ROUNDED =                   29510000
295600             CT-RECEIPTS-RTL-TY (PA-SUB) / 1000.00.               29520000
295700     COMPUTE DL-SR-PURCHASE-ADJ-COST-TY ROUNDED =                 29530000
295800             CT-PURCH-ADJ-COST-TY (PA-SUB) / 1000.00.             29540000
295900     COMPUTE DL-SR-PURCHASE-ADJ-RETAIL-TY ROUNDED =               29550000
296000             CT-PURCH-ADJ-RTL-TY (PA-SUB) / 1000.00.              29560000
296100     COMPUTE PV-PERCENT ROUNDED =                                 29570000
296200             ( CT-CUM-TO-DATE-PURCH-RETAIL-TY (PA-SUB)            29580000
296300             - CT-CUM-TO-DATE-PURCH-COST-TY (PA-SUB)) * 100.00    29590000
296400             / CT-CUM-TO-DATE-PURCH-RETAIL-TY (PA-SUB)            29600000
296500                      ON SIZE ERROR MOVE 100 TO PV-PERCENT.       29610000
296600     MOVE PV-PERCENT             TO DL-SR-CUMM-MARKUP-PCT-TY.     29620000
296700     COMPUTE DL-SR-TOTAL-SALES-TY ROUNDED =                       29630000
296800                      CT-TOTAL-SALES-TY (PA-SUB) / 1000.00.       29640000
296900     COMPUTE DL-SR-TOTAL-MKDN-TY ROUNDED =                        29650000
297000                      CT-TOTAL-MKDN-TY (PA-SUB) / 1000.00.        29660000
297100     COMPUTE PV-PERCENT ROUNDED = CT-TOTAL-MKDN-TY (PA-SUB)       29670000
297200                      * PC-100 / CT-TOTAL-SALES-TY (PA-SUB)       29680000
297300                      ON SIZE ERROR MOVE 0 TO PV-PERCENT.         29690000
297400     MOVE PV-PERCENT             TO DL-SR-TOTAL-MKDN-PCT-TY.      29700000
297500     COMPUTE PV-PERCENT ROUNDED  = CT-GROSS-MARGN-TY (PA-SUB)     29710000
297600                           * PC-100 / CT-TOTAL-SALES-TY (PA-SUB)  29720000
297700                           ON SIZE ERROR MOVE 0 TO PV-PERCENT.    29730000
297800     MOVE PV-PERCENT                  TO DL-SR-GROSS-MARGN-PCT-TY.29740000
297900     COMPUTE DL-SR-END-INV-RTL-TY ROUNDED =                       29750000
298000                      CT-END-INV-RTL-TY (PA-SUB) / 1000.00.       29760000
298100                                                                  29770000
298200*****  LAST YEAR  ************************************************29780000
298300*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            29790000
298400     IF PV-HDG-START-CCYY-LY = PC-1998                            29800000
298500         CONTINUE                                                 29810000
298600     ELSE                                                         29820000
298700         COMPUTE DL-SR-NET-COST-LY ROUNDED =                      29830000
298800                 CT-NET-COST-LY (PA-SUB) / 1000.00                29840000
298900         COMPUTE DL-SR-RETAIL-PURCH-LY ROUNDED =                  29850000
299000                 CT-RETAIL-PURCH-LY (PA-SUB) / 1000.00            29860000
299100         COMPUTE DL-SR-TOTAL-SALES-LY ROUNDED =                   29870000
299200                 CT-TOTAL-SALES-LY (PA-SUB) / 1000.00             29880000
299300*-- DO NOT PRINT 1999 DATA (LAST YEAR)                            29890000
299400         IF PV-HDG-START-CCYY-LY = PC-1999                        29900000
299500             CONTINUE                                             29910000
299600         ELSE                                                     29920000
299700             COMPUTE PV-PERCENT ROUNDED =                         29930000
299800               ( CT-CUM-TO-DATE-PURCH-RETAIL-LY (PA-SUB)          29940000
299900               - CT-CUM-TO-DATE-PURCH-COST-LY (PA-SUB)) * PC-100  29950000
300000                   / CT-CUM-TO-DATE-PURCH-RETAIL-LY (PA-SUB)      29960000
300100                  ON SIZE ERROR MOVE 100 TO PV-PERCENT            29970000
300200             END-COMPUTE                                          29980000
300300             MOVE PV-PERCENT TO DL-SR-CUMM-MARKUP-PCT-LY          29990000
300400             COMPUTE DL-SR-TOTAL-MKDN-LY ROUNDED =                30000000
300500                     CT-TOTAL-MKDN-LY (PA-SUB) / 1000.00          30010000
300600             COMPUTE PV-PERCENT ROUNDED =                         30020000
300700                     CT-GROSS-MARGN-LY (PA-SUB) * PC-100          30030000
300800                   / CT-TOTAL-SALES-LY (PA-SUB)                   30040000
300900                  ON SIZE ERROR MOVE 0 TO PV-PERCENT              30050000
301000             END-COMPUTE                                          30060000
301100             MOVE PV-PERCENT TO DL-SR-GROSS-MARGN-PCT-LY          30070000
301200             COMPUTE DL-SR-END-INV-RTL-LY ROUNDED =               30080000
301300                     CT-END-INV-RTL-LY (PA-SUB) / 1000.00         30090000
301400         END-IF                                                   30100000
301500     END-IF.                                                      30110000
301600     MOVE DL-SR-DETAIL-LINE                TO RR-REPORT-RECORD.   30120000
301700     MOVE 1                                TO PA-LINE-NO.         30130000
301800                                                                  30140000
301900     PERFORM 6400-CHECK-SR-DETAIL-GT-ZERO.                        30150000
302000     IF PI-PRINT-DETAIL                                           30160000
302100         PERFORM 5000-WRITE-REPORT-LINE                           30170000
302200     END-IF.                                                      30180000
302300/                                                                 30190000
302400 2824-PRINT-RECAP-TOTAL.                                          30200000
302500******************************************************************30210000
302600*   2824-PRINT-RECAP-TOTAL                                       *30220000
302700*     FORMAT AND PRINT THE RECAP TOTAL LINE                      *30230000
302800*                                                                *30240000
302900*   PERFORMED BY:  2820-PRINT-RECAP                              *30250000
303000******************************************************************30260000
303100                                                                  30270000
303200     MOVE PC-TOTAL                 TO DL-SR-TOTAL.                30280000
303300*****  THIS YEAR  ************************************************30290000
303400*    COMPUTE DL-SR-GROSS-COST ROUNDED =                           30300000
303500*                       VT-GROSS-COST  / 1000.00.                 30310000
303600*    COMPUTE DL-SR-PURCH-ADJ-COST-TY ROUNDED =                    30320000
303700*                       VT-PURCH-ADJ-COST-TY / 1000.00.           30330000
303800*    COMPUTE DL-SR-NET-COST-TY ROUNDED =                          30340000
303900*                       VT-NET-COST-TY  / 1000.00.                30350000
304000*    COMPUTE DL-SR-RETAIL-PURCH-TY ROUNDED =                      30360000
304100*                       VT-RETAIL-PURCH-TY  / 1000.00.            30370000
304200     COMPUTE DL-SR-RECEIPTS-COST-TY ROUNDED =                     30380000
304300             VT-RECEIPTS-COST-TY  / 1000.00.                      30390000
304400     COMPUTE DL-SR-RECEIPTS-RETAIL-TY ROUNDED =                   30400000
304500             VT-RECEIPTS-RTL-TY   / 1000.00.                      30410000
304600     COMPUTE DL-SR-PURCHASE-ADJ-COST-TY ROUNDED =                 30420000
304700             VT-PURCH-ADJ-COST-TY / 1000.00.                      30430000
304800     COMPUTE DL-SR-PURCHASE-ADJ-RETAIL-TY ROUNDED =               30440000
304900             VT-PURCH-ADJ-RTL-TY  / 1000.00.                      30450000
305000                                                                  30460000
305100     COMPUTE PV-PERCENT ROUNDED =                                 30470000
305200                        ( VT-CUM-TO-DATE-PURCH-RETAIL-TY          30480000
305300                        - VT-CUM-TO-DATE-PURCH-COST-TY ) * 100.00 30490000
305400                        / VT-CUM-TO-DATE-PURCH-RETAIL-TY          30500000
305500                        ON SIZE ERROR MOVE 100 TO PV-PERCENT.     30510000
305600     MOVE PV-PERCENT               TO DL-SR-CUMM-MARKUP-PCT-TY.   30520000
305700     COMPUTE DL-SR-TOTAL-SALES-TY ROUNDED =                       30530000
305800                        VT-TOTAL-SALES-TY / 1000.00.              30540000
305900     COMPUTE DL-SR-TOTAL-MKDN-TY ROUNDED =                        30550000
306000                        VT-TOTAL-MKDN-TY / 1000.00.               30560000
306100     COMPUTE PV-PERCENT ROUNDED = VT-TOTAL-MKDN-TY * PC-100       30570000
306200                      / VT-TOTAL-SALES-TY                         30580000
306300            ON SIZE ERROR MOVE 0 TO PV-PERCENT.                   30590000
306400     MOVE PV-PERCENT               TO DL-SR-TOTAL-MKDN-PCT-TY.    30600000
306500     COMPUTE PV-PERCENT ROUNDED = VT-GROSS-MARGN-TY               30610000
306600                        * PC-100 / VT-TOTAL-SALES-TY              30620000
306700                        ON SIZE ERROR MOVE 0 TO PV-PERCENT.       30630000
306800     MOVE PV-PERCENT               TO DL-SR-GROSS-MARGN-PCT-TY.   30640000
306900     COMPUTE DL-SR-END-INV-RTL-TY ROUNDED =                       30650000
307000                        VT-END-INV-RTL-TY   / 1000.00.            30660000
307100                                                                  30670000
307200*****  LAST YEAR  ************************************************30680000
307300*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            30690000
307400     IF PV-HDG-START-CCYY-LY = PC-1998                            30700000
307500         CONTINUE                                                 30710000
307600     ELSE                                                         30720000
307700         COMPUTE DL-SR-NET-COST-LY ROUNDED =                      30730000
307800                 VT-NET-COST-LY / 1000.00                         30740000
307900         COMPUTE DL-SR-RETAIL-PURCH-LY ROUNDED =                  30750000
308000                 VT-RETAIL-PURCH-LY / 1000.00                     30760000
308100         COMPUTE DL-SR-TOTAL-SALES-LY ROUNDED =                   30770000
308200                 VT-TOTAL-SALES-LY / 1000.00                      30780000
308300*-- DO NOT PRINT 1999 DATA (LAST YEAR)                            30790000
308400         IF PV-HDG-START-CCYY-LY = PC-1999                        30800000
308500             CONTINUE                                             30810000
308600         ELSE                                                     30820000
308700             COMPUTE PV-PERCENT ROUNDED =                         30830000
308800                   ( VT-CUM-TO-DATE-PURCH-RETAIL-LY               30840000
308900                   - VT-CUM-TO-DATE-PURCH-COST-LY ) * 100.00      30850000
309000                   / VT-CUM-TO-DATE-PURCH-RETAIL-LY               30860000
309100                  ON SIZE ERROR MOVE 100 TO PV-PERCENT            30870000
309200             END-COMPUTE                                          30880000
309300             MOVE PV-PERCENT TO DL-SR-CUMM-MARKUP-PCT-LY          30890000
309400             COMPUTE DL-SR-TOTAL-MKDN-LY ROUNDED =                30900000
309500                     VT-TOTAL-MKDN-LY / 1000.00                   30910000
309600             COMPUTE PV-PERCENT ROUNDED = VT-GROSS-MARGN-LY       30920000
309700                   * PC-100 / VT-TOTAL-SALES-LY                   30930000
309800                  ON SIZE ERROR MOVE 0 TO PV-PERCENT              30940000
309900             END-COMPUTE                                          30950000
310000             MOVE PV-PERCENT TO DL-SR-GROSS-MARGN-PCT-LY          30960000
310100             COMPUTE DL-SR-END-INV-RTL-LY ROUNDED =               30970000
310200                     VT-END-INV-RTL-LY / 1000.00                  30980000
310300         END-IF                                                   30990000
310400     END-IF.                                                      31000000
310500                                                                  31010000
310600     MOVE DL-SR-DETAIL-LINE                TO RR-REPORT-RECORD.   31020000
310700     MOVE 1                                TO PA-LINE-NO.         31030000
310800     PERFORM 6400-CHECK-SR-DETAIL-GT-ZERO.                        31040000
310900     IF PI-PRINT-DETAIL                                           31050000
311000         PERFORM 5000-WRITE-REPORT-LINE                           31060000
311100     END-IF.                                                      31070000
311200                                                                  31080000
311300 2830-PRINT-BACK-PAGE.                                            31090000
311400******************************************************************31100000
311500*   2830-PRINT-BACK-PAGE                                         *31110000
311600*     PRINT THE BACK PAGE.  AT THIS POINT,  ALL THE LINES HAVE   *31120000
311700*     BEEN ALREADY FORMATTED.                                    *31130000
311800*                                                                *31140000
311900*   PERFORMED BY:  2820-PRINT-RECAP                              *31150000
312000******************************************************************31160000
312100                                                                  31170000
312200     PERFORM VARYING PA-SUB FROM 1 BY 1                           31180000
312300             UNTIL PA-SUB > PA-LINE-COUNT                         31190000
312400        MOVE PT-REPORT-LINE (PA-SUB)   TO RR-REPORT-RECORD        31200000
312500        IF PA-SUB = 1                                             31210000
312600            WRITE RR-REPORT-RECORD AFTER ADVANCING PAGE           31220000
312700        ELSE                                                      31230000
312800            WRITE RR-REPORT-RECORD AFTER ADVANCING 1 LINES        31240000
312900        END-IF                                                    31250000
313000     END-PERFORM.                                                 31260000
313100                                                                  31270000
313200     INITIALIZE PT-REPORT-LINES.                                  31280000
313300                                                                  31290000
313400/                                                                 31300000
313500 3100-PRINT-AP-YTD.                                               31310000
313600******************************************************************31320000
313700*   3100-PRINT-AP-YTD                                            *31330000
313800*     PERFORM TO FORMAT/PRINT THE A/P HEADER LINES, THEN         *31340000
313900*     A/P DETAIL LINES, THEN THE A/P TOTAL LINE.                 *31350000
314000*     FORMAT THE CURRENT-MONTH INFO TO TABLE FOR PRINTING        *31360000
314100*       AT THE BACK OF THE PAGE LATER.                           *31370000
314200*                                                                *31380000
314300*   PERFORMED BY:  2400-PROCESS-SALES                            *31390000
314400******************************************************************31400000
314500                                                                  31410000
314600     SET PI-PRINT-BOTH               TO TRUE.                     31420000
314700     MOVE 1                          TO PA-LINE-NO.               31430000
314800     MOVE  H7-HEADING7A              TO RR-REPORT-RECORD.         31440000
314900     PERFORM 5000-WRITE-REPORT-LINE.                              31450000
315000     MOVE  H7-HEADING7B              TO RR-REPORT-RECORD.         31460000
315100     PERFORM 5000-WRITE-REPORT-LINE.                              31470000
315200     MOVE 1                          TO PA-LINE-NO.               31480000
315300                                                                  31490000
315400     MOVE 0 TO PA-SUB.                                            31500000
315500     PERFORM VARYING PA-SUB FROM 1 BY 1 UNTIL PA-SUB > 9          31510000
315600         IF CT-AP-CLASS (PA-SUB) = 0                              31520000
315700            CONTINUE                                              31530000
315800         ELSE                                                     31540000
315900             MOVE CT-AP-CLASS (PA-SUB)        TO DL-AP-CLASS      31550000
316000             MOVE CT-AP-CLASS-DESC (PA-SUB)   TO DL-AP-CLASS-DESC 31560000
316100***** THIS YEAR **************************************************31570000
316200*            COMPUTE DL-AP-GROSS-COST ROUNDED =                   31580000
316300*                         CT-GROSS-COST (PA-SUB)   / 1000.00      31590000
316400*            COMPUTE DL-AP-PURCH-ADJ-COST-TY ROUNDED =            31600000
316500*                         CT-PURCH-ADJ-COST-TY (PA-SUB) / 1000.00 31610000
316600*            COMPUTE DL-AP-NET-COST-TY ROUNDED =                  31620000
316700*                         CT-NET-COST-TY (PA-SUB) / 1000.00       31630000
316800*            COMPUTE DL-AP-RTL-PURCH-TY ROUNDED =                 31640000
316900*                         CT-RETAIL-PURCH-TY (PA-SUB) / 1000.00   31650000
317000                                                                  31660000
317100             COMPUTE DL-AP-RECEIPTS-COST-TY ROUNDED =             31670000
317200                     CT-RECEIPTS-COST-TY (PA-SUB) / 1000.00       31680000
317300             COMPUTE DL-AP-RECEIPTS-RETAIL-TY ROUNDED =           31690000
317400                     CT-RECEIPTS-RTL-TY (PA-SUB) / 1000.00        31700000
317500             COMPUTE DL-AP-PURCHASE-ADJ-COST-TY ROUNDED =         31710000
317600                     CT-PURCH-ADJ-COST-TY (PA-SUB) / 1000.00      31720000
317700             COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-TY ROUNDED =       31730000
317800                     CT-PURCH-ADJ-RTL-TY (PA-SUB) / 1000.00       31740000
317900             COMPUTE PV-PERCENT ROUNDED =                         31750000
318000                          CT-INITIAL-MARKON-TY (PA-SUB) * PC-100  31760000
318100                        / CT-RECEIPTS-RTL-TY (PA-SUB)             31770000
318200*                       / CT-RETAIL-PURCH-TY (PA-SUB)             31780000
318300                          ON SIZE ERROR MOVE 0 TO PV-PERCENT      31790000
318400             END-COMPUTE                                          31800000
318500             MOVE PV-PERCENT      TO DL-AP-INIT-MARKON-TY         31810000
318600             COMPUTE PV-PERCENT ROUNDED =                         31820000
318700                          CT-NET-MARKON-TY (PA-SUB) * PC-100      31830000
318800                        / CT-RETAIL-PURCH-TY (PA-SUB)             31840000
318900                          ON SIZE ERROR MOVE 0 TO PV-PERCENT      31850000
319000             END-COMPUTE                                          31860000
319100             MOVE PV-PERCENT      TO DL-AP-NET-MARKON-TY          31870000
319200*            COMPUTE DL-AP-PURCH-ADJ-RETAIL ROUNDED =             31880000
319300*                          CT-PURCH-ADJ-RETAIL (PA-SUB) / 1000.00 31890000
319400******  LAST YEAR  ***********************************************31900000
319500*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            31910000
319600             IF PV-HDG-START-CCYY-LY = PC-1998                    31920000
319700                 CONTINUE                                         31930000
319800             ELSE                                                 31940000
319900*            COMPUTE DL-AP-PURCH-ADJ-COST-LY ROUNDED =            31950000
320000*                         CT-PURCH-ADJ-COST-LY (PA-SUB) / 1000.00 31960000
320100*            COMPUTE DL-AP-NET-COST-LY ROUNDED =                  31970000
320200*                         CT-NET-COST-LY (PA-SUB) / 1000.00       31980000
320300*            COMPUTE DL-AP-RTL-PURCH-LY ROUNDED =                 31990000
320400*                         CT-RETAIL-PURCH-LY (PA-SUB) / 1000.00   32000000
320500                 COMPUTE DL-AP-RECEIPTS-COST-LY ROUNDED =         32010000
320600                         CT-RECEIPTS-COST-LY (PA-SUB) / 1000.00   32020000
320700                 COMPUTE DL-AP-RECEIPTS-RETAIL-LY ROUNDED =       32030000
320800                         CT-RECEIPTS-RTL-LY (PA-SUB) / 1000.00    32040000
320900                 COMPUTE DL-AP-PURCHASE-ADJ-COST-LY ROUNDED =     32050000
321000                         CT-PURCH-ADJ-COST-LY (PA-SUB) / 1000.00  32060000
321100                 COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-LY ROUNDED =   32070000
321200                         CT-PURCH-ADJ-RTL-LY (PA-SUB) / 1000.00   32080000
321300                 COMPUTE PV-PERCENT ROUNDED =                     32090000
321400                         CT-INITIAL-MARKON-LY (PA-SUB) * PC-100   32100000
321500                       / CT-RECEIPTS-RTL-LY (PA-SUB)              32110000
321600*                      / CT-RETAIL-PURCH-LY (PA-SUB)              32120000
321700                      ON SIZE ERROR MOVE 0 TO PV-PERCENT          32130000
321800                 END-COMPUTE                                      32140000
321900                 MOVE PV-PERCENT  TO DL-AP-INIT-MARKON-LY         32150000
322000                 COMPUTE PV-PERCENT ROUNDED =                     32160000
322100                         CT-NET-MARKON-LY (PA-SUB) * PC-100       32170000
322200                       / CT-RETAIL-PURCH-LY (PA-SUB)              32180000
322300                      ON SIZE ERROR MOVE 0 TO PV-PERCENT          32190000
322400                 END-COMPUTE                                      32200000
322500                 MOVE PV-PERCENT     TO DL-AP-NET-MARKON-LY       32210000
322600             END-IF                                               32220000
322700             MOVE DL-AP-DETAIL-LINE  TO RR-REPORT-RECORD          32230000
322800             SET PI-PRINT-FRONT      TO TRUE                      32240000
322900             MOVE 1                  TO PA-LINE-NO                32250000
323000             PERFORM 6000-CHECK-AP-DETAIL-GT-ZERO                 32260000
323100             IF PI-PRINT-DETAIL                                   32270000
323200                 PERFORM 5000-WRITE-REPORT-LINE                   32280000
323300             END-IF                                               32290000
323400         END-IF                                                   32300000
323500     END-PERFORM.                                                 32310000
323600                                                                  32320000
323700     MOVE PC-TOTAL              TO DL-AP-TOTAL.                   32330000
323800                                                                  32340000
323900*****  THIS YEAR  ************************************************32350000
324000*    COMPUTE DL-AP-GROSS-COST ROUNDED =                           32360000
324100*                               VT-GROSS-COST  / 1000.00.         32370000
324200*    COMPUTE DL-AP-PURCH-ADJ-COST-TY ROUNDED =                    32380000
324300*                               VT-PURCH-ADJ-COST-TY / 1000.00.   32390000
324400*    COMPUTE DL-AP-NET-COST-TY ROUNDED =                          32400000
324500*                               VT-NET-COST-TY  / 1000.00.        32410000
324600*    COMPUTE DL-AP-RTL-PURCH-TY ROUNDED =                         32420000
324700*                               VT-RETAIL-PURCH-TY  / 1000.00.    32430000
324800                                                                  32440000
324900     COMPUTE DL-AP-RECEIPTS-COST-TY ROUNDED =                     32450000
325000             VT-RECEIPTS-COST-TY  / 1000.00.                      32460000
325100     COMPUTE DL-AP-RECEIPTS-RETAIL-TY ROUNDED =                   32470000
325200             VT-RECEIPTS-RTL-TY / 1000.00.                        32480000
325300     COMPUTE DL-AP-PURCHASE-ADJ-COST-TY ROUNDED =                 32490000
325400             VT-PURCH-ADJ-COST-TY / 1000.00.                      32500000
325500     COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-TY ROUNDED =               32510000
325600             VT-PURCH-ADJ-RTL-TY / 1000.00.                       32520000
325700                                                                  32530000
325800     COMPUTE PV-PERCENT ROUNDED =                                 32540000
325900             VT-INITIAL-MARKON-TY * PC-100                        32550000
326000           / VT-RECEIPTS-RTL-TY                                   32560000
326100*          / VT-RETAIL-PURCH-TY                                   32570000
326200          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     32580000
326300     MOVE PV-PERCENT           TO DL-AP-INIT-MARKON-TY.           32590000
326400     COMPUTE PV-PERCENT ROUNDED =                                 32600000
326500             VT-NET-MARKON-TY  * PC-100                           32610000
326600          /  VT-RETAIL-PURCH-TY                                   32620000
326700          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     32630000
326800     MOVE PV-PERCENT           TO DL-AP-NET-MARKON-TY.            32640000
326900                                                                  32650000
327000*    COMPUTE DL-AP-PURCH-ADJ-RETAIL ROUNDED =                     32660000
327100*                               VT-PURCH-ADJ-RETAIL / 1000.00.    32670000
327200*****  LAST YEAR  ************************************************32680000
327300*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            32690000
327400     IF PV-HDG-START-CCYY-LY = PC-1998                            32700000
327500         CONTINUE                                                 32710000
327600     ELSE                                                         32720000
327700*    COMPUTE DL-AP-PURCH-ADJ-COST-LY ROUNDED =                    32730000
327800*                               VT-PURCH-ADJ-COST-LY / 1000.00.   32740000
327900*    COMPUTE DL-AP-NET-COST-LY ROUNDED =                          32750000
328000*                               VT-NET-COST-LY  / 1000.00.        32760000
328100*    COMPUTE DL-AP-RTL-PURCH-LY ROUNDED =                         32770000
328200*                               VT-RETAIL-PURCH-LY  / 1000.00.    32780000
328300         COMPUTE DL-AP-RECEIPTS-COST-LY ROUNDED =                 32790000
328400                 VT-RECEIPTS-COST-LY / 1000.00                    32800000
328500         COMPUTE DL-AP-RECEIPTS-RETAIL-LY ROUNDED =               32810000
328600                 VT-RECEIPTS-RTL-LY / 1000.00                     32820000
328700         COMPUTE DL-AP-PURCHASE-ADJ-COST-LY ROUNDED =             32830000
328800                 VT-PURCH-ADJ-COST-LY / 1000.00                   32840000
328900         COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-LY ROUNDED =           32850000
329000                 VT-PURCH-ADJ-RTL-LY / 1000.00                    32860000
329100         COMPUTE PV-PERCENT ROUNDED =                             32870000
329200                 VT-INITIAL-MARKON-LY * PC-100                    32880000
329300               / VT-RECEIPTS-RTL-LY                               32890000
329400*              / VT-RETAIL-PURCH-LY                               32900000
329500              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  32910000
329600         END-COMPUTE                                              32920000
329700         MOVE PV-PERCENT       TO DL-AP-INIT-MARKON-LY            32930000
329800         COMPUTE PV-PERCENT ROUNDED =                             32940000
329900                 VT-NET-MARKON-LY * PC-100                        32950000
330000               / VT-RETAIL-PURCH-LY                               32960000
330100              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  32970000
330200         END-COMPUTE                                              32980000
330300         MOVE PV-PERCENT       TO DL-AP-NET-MARKON-LY             32990000
330400     END-IF.                                                      33000000
330500                                                                  33010000
330600     MOVE DL-AP-DETAIL-LINE          TO RR-REPORT-RECORD.         33020000
330700     SET PI-PRINT-FRONT              TO TRUE.                     33030000
330800     MOVE 1                          TO PA-LINE-NO.               33040000
330900                                                                  33050000
331000     PERFORM 6000-CHECK-AP-DETAIL-GT-ZERO.                        33060000
331100     IF PI-PRINT-DETAIL                                           33070000
331200         PERFORM 5000-WRITE-REPORT-LINE                           33080000
331300     ELSE                                                         33090000
331400         MOVE DL-AP-NO-DETAIL        TO RR-REPORT-RECORD          33100000
331500         PERFORM 5000-WRITE-REPORT-LINE                           33110000
331600     END-IF.                                                      33120000
331700     MOVE BL-BAR-LINE                TO RR-REPORT-RECORD.         33130000
331800     MOVE 1                          TO PA-LINE-NO.               33140000
331900     PERFORM 5000-WRITE-REPORT-LINE.                              33150000
332000     PERFORM 3110-PRINT-AP-CURR-MONTH.                            33160000
332100                                                                  33170000
332200 3110-PRINT-AP-CURR-MONTH.                                        33180000
332300******************************************************************33190000
332400*   3110-PRINT-AP-CURR-MONTH.                                    *33200000
332500*     FORMAT THE A/P DETAIL LINE FOR THE CURRENT-MONTH           *33210000
332600*     FORMAT THE A/P TOTAL LINE FOR THE CURRENT-MONTH            *33220000
332700*     BOTH LINES ARE MOVED TO THE PRINT TABLE FOR PRINTING       *33230000
332800*        AT THE BACK OF THE PAGE LATER.                          *33240000
332900*                                                                *33250000
333000*   PERFORMED BY:  3100-PRINT-AP-YTD                             *33260000
333100******************************************************************33270000
333200                                                                  33280000
333300     MOVE 0 TO PA-SUB.                                            33290000
333400     PERFORM VARYING PA-SUB FROM 1 BY 1 UNTIL PA-SUB > 9          33300000
333500         IF CM-AP-CLASS (PA-SUB) = 0                              33310000
333600            CONTINUE                                              33320000
333700         ELSE                                                     33330000
333800             MOVE CM-AP-CLASS (PA-SUB)        TO DL-AP-CLASS      33340000
333900             MOVE CM-AP-CLASS-DESC (PA-SUB)   TO DL-AP-CLASS-DESC 33350000
334000*            COMPUTE DL-AP-GROSS-COST ROUNDED =                   33360000
334100*                         CM-GROSS-COST (PA-SUB)   / 1000.00      33370000
334200*            COMPUTE DL-AP-PURCH-ADJ-COST-TY ROUNDED =            33380000
334300*                         CM-PURCH-ADJ-COST-TY (PA-SUB) /  1000.0033390000
334400*            COMPUTE DL-AP-NET-COST-TY ROUNDED =                  33400000
334500*                         CM-NET-COST-TY (PA-SUB)   / 1000.00     33410000
334600*            COMPUTE DL-AP-RTL-PURCH-TY ROUNDED =                 33420000
334700*                         CM-RETAIL-PURCH-TY (PA-SUB)   / 1000.00 33430000
334800                                                                  33440000
334900             COMPUTE DL-AP-RECEIPTS-COST-TY ROUNDED =             33450000
335000                     CM-RECEIPTS-COST-TY (PA-SUB) / 1000.00       33460000
335100             COMPUTE DL-AP-RECEIPTS-RETAIL-TY ROUNDED =           33470000
335200                     CM-RECEIPTS-RTL-TY (PA-SUB) / 1000.00        33480000
335300             COMPUTE DL-AP-PURCHASE-ADJ-COST-TY ROUNDED =         33490000
335400                     CM-PURCH-ADJ-COST-TY (PA-SUB) / 1000.00      33500000
335500             COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-TY ROUNDED =       33510000
335600                     CM-PURCH-ADJ-RTL-TY (PA-SUB) / 1000.00       33520000
335700                                                                  33530000
335800             COMPUTE PV-PERCENT ROUNDED =                         33540000
335900                     CM-INITIAL-MARKON-TY (PA-SUB) * PC-100       33550000
336000                   / CM-RECEIPTS-RTL-TY (PA-SUB)                  33560000
336100*                  / CM-RETAIL-PURCH-TY (PA-SUB)                  33570000
336200                  ON SIZE ERROR MOVE 0 TO PV-PERCENT              33580000
336300             END-COMPUTE                                          33590000
336400             MOVE PV-PERCENT      TO DL-AP-INIT-MARKON-TY         33600000
336500             COMPUTE PV-PERCENT ROUNDED =                         33610000
336600                     CM-NET-MARKON-TY (PA-SUB) * PC-100           33620000
336700                   / CM-RETAIL-PURCH-TY (PA-SUB)                  33630000
336800                  ON SIZE ERROR MOVE 0 TO PV-PERCENT              33640000
336900             END-COMPUTE                                          33650000
337000             MOVE PV-PERCENT      TO DL-AP-NET-MARKON-TY          33660000
337100*            COMPUTE DL-AP-PURCH-ADJ-RETAIL ROUNDED =             33670000
337200*                          CM-PURCH-ADJ-RETAIL (PA-SUB) / 1000.00 33680000
337300                                                                  33690000
337400******  LAST YEAR  ***********************************************33700000
337500*            COMPUTE DL-AP-PURCH-ADJ-COST-LY ROUNDED =            33710000
337600*                         CM-PURCH-ADJ-COST-LY (PA-SUB) / 1000.00 33720000
337700*            COMPUTE DL-AP-NET-COST-LY ROUNDED =                  33730000
337800*                         CM-NET-COST-LY (PA-SUB) / 1000.00       33740000
337900*            COMPUTE DL-AP-RTL-PURCH-LY ROUNDED =                 33750000
338000*                         CM-RETAIL-PURCH-LY (PA-SUB) / 1000.00   33760000
338100                                                                  33770000
338200*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            33780000
338300             IF PV-HDG-START-CCYY-LY = PC-1998                    33790000
338400                 CONTINUE                                         33800000
338500             ELSE                                                 33810000
338600                 COMPUTE DL-AP-RECEIPTS-COST-LY ROUNDED =         33820000
338700                         CM-RECEIPTS-COST-LY (PA-SUB) / 1000.00   33830000
338800                 COMPUTE DL-AP-RECEIPTS-RETAIL-LY ROUNDED =       33840000
338900                         CM-RECEIPTS-RTL-LY (PA-SUB) / 1000.00    33850000
339000                 COMPUTE DL-AP-PURCHASE-ADJ-COST-LY ROUNDED =     33860000
339100                         CM-PURCH-ADJ-COST-LY (PA-SUB) / 1000.00  33870000
339200                 COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-LY ROUNDED =   33880000
339300                         CM-PURCH-ADJ-RTL-LY (PA-SUB) / 1000.00   33890000
339400                 COMPUTE PV-PERCENT ROUNDED =                     33900000
339500                         CM-INITIAL-MARKON-LY (PA-SUB) * PC-100   33910000
339600                       / CM-RECEIPTS-RTL-LY (PA-SUB)              33920000
339700*                      / CM-RETAIL-PURCH-LY (PA-SUB)              33930000
339800                      ON SIZE ERROR MOVE 0 TO PV-PERCENT          33940000
339900                 END-COMPUTE                                      33950000
340000                 MOVE PV-PERCENT  TO DL-AP-INIT-MARKON-LY         33960000
340100                 COMPUTE PV-PERCENT ROUNDED =                     33970000
340200                         CM-NET-MARKON-LY (PA-SUB) * PC-100       33980000
340300                       / CM-RETAIL-PURCH-LY (PA-SUB)              33990000
340400                      ON SIZE ERROR MOVE 0 TO PV-PERCENT          34000000
340500                 END-COMPUTE                                      34010000
340600                 MOVE PV-PERCENT     TO DL-AP-NET-MARKON-LY       34020000
340700             END-IF                                               34030000
340800             MOVE DL-AP-DETAIL-LINE  TO RR-REPORT-RECORD          34040000
340900             SET PI-PRINT-BACK       TO TRUE                      34050000
341000             MOVE 1                  TO PA-LINE-NO                34060000
341100                                                                  34070000
341200             PERFORM 6000-CHECK-AP-DETAIL-GT-ZERO                 34080000
341300             IF PI-PRINT-DETAIL                                   34090000
341400                 PERFORM 5000-WRITE-REPORT-LINE                   34100000
341500             END-IF                                               34110000
341600         END-IF                                                   34120000
341700     END-PERFORM.                                                 34130000
341800                                                                  34140000
341900     MOVE PC-TOTAL                    TO DL-AP-TOTAL.             34150000
342000                                                                  34160000
342100******  THIS YEAR  ***********************************************34170000
342200*    COMPUTE DL-AP-GROSS-COST ROUNDED =                           34180000
342300*                               CMT-GROSS-COST  / 1000.00.        34190000
342400*    COMPUTE DL-AP-PURCH-ADJ-COST-TY ROUNDED =                    34200000
342500*                               CMT-PURCH-ADJ-COST-TY / 1000.00.  34210000
342600*    COMPUTE DL-AP-NET-COST-TY ROUNDED =                          34220000
342700*                               CMT-NET-COST-TY / 1000.00.        34230000
342800*    COMPUTE DL-AP-RTL-PURCH-TY ROUNDED =                         34240000
342900*                               CMT-RETAIL-PURCH-TY  / 1000.00.   34250000
343000     COMPUTE DL-AP-RECEIPTS-COST-TY ROUNDED =                     34260000
343100             CMT-RECEIPTS-COST-TY / 1000.00.                      34270000
343200     COMPUTE DL-AP-RECEIPTS-RETAIL-TY ROUNDED =                   34280000
343300             CMT-RECEIPTS-RTL-TY / 1000.00.                       34290000
343400     COMPUTE DL-AP-PURCHASE-ADJ-COST-TY ROUNDED =                 34300000
343500             CMT-PURCH-ADJ-COST-TY / 1000.00.                     34310000
343600     COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-TY ROUNDED =               34320000
343700             CMT-PURCH-ADJ-RTL-TY / 1000.00.                      34330000
343800                                                                  34340000
343900     COMPUTE PV-PERCENT ROUNDED =  CMT-INITIAL-MARKON-TY * PC-100 34350000
344000           / CMT-RECEIPTS-RTL-TY                                  34360000
344100*          / CMT-RETAIL-PURCH-TY                                  34370000
344200          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     34380000
344300     MOVE PV-PERCENT             TO DL-AP-INIT-MARKON-TY.         34390000
344400     COMPUTE PV-PERCENT ROUNDED =  CMT-NET-MARKON-TY * PC-100     34400000
344500           / CMT-RETAIL-PURCH-TY                                  34410000
344600          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     34420000
344700     MOVE PV-PERCENT             TO DL-AP-NET-MARKON-TY.          34430000
344800*    COMPUTE DL-AP-PURCH-ADJ-RETAIL ROUNDED =                     34440000
344900*                              CMT-PURCH-ADJ-RETAIL / 1000.00.    34450000
345000******  LAST YEAR  ***********************************************34460000
345100*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            34470000
345200     IF PV-HDG-START-CCYY-LY = PC-1998                            34480000
345300         CONTINUE                                                 34490000
345400     ELSE                                                         34500000
345500*    COMPUTE DL-AP-PURCH-ADJ-COST-LY ROUNDED =                    34510000
345600*                              CMT-PURCH-ADJ-COST-LY / 1000.00.   34520000
345700*    COMPUTE DL-AP-NET-COST-LY ROUNDED =                          34530000
345800*                              CMT-NET-COST-LY / 1000.00.         34540000
345900*    COMPUTE DL-AP-RTL-PURCH-LY ROUNDED =                         34550000
346000*                              CMT-RETAIL-PURCH-LY / 1000.00.     34560000
346100         COMPUTE DL-AP-RECEIPTS-COST-LY ROUNDED =                 34570000
346200                 CMT-RECEIPTS-COST-LY / 1000.00                   34580000
346300         COMPUTE DL-AP-RECEIPTS-RETAIL-LY ROUNDED =               34590000
346400                 CMT-RECEIPTS-RTL-LY / 1000.00                    34600000
346500         COMPUTE DL-AP-PURCHASE-ADJ-COST-LY ROUNDED =             34610000
346600                 CMT-PURCH-ADJ-COST-LY / 1000.00                  34620000
346700         COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-LY ROUNDED =           34630000
346800                 CMT-PURCH-ADJ-RTL-LY / 1000.00                   34640000
346900                                                                  34650000
347000         COMPUTE PV-PERCENT ROUNDED =                             34660000
347100                 CMT-INITIAL-MARKON-LY * PC-100                   34670000
347200               / CMT-RECEIPTS-RTL-LY                              34680000
347300*              / CMT-RETAIL-PURCH-LY                              34690000
347400              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  34700000
347500         END-COMPUTE                                              34710000
347600         MOVE PV-PERCENT              TO DL-AP-INIT-MARKON-LY     34720000
347700         COMPUTE PV-PERCENT ROUNDED = CMT-NET-MARKON-LY * PC-100  34730000
347800               / CMT-RETAIL-PURCH-LY                              34740000
347900              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  34750000
348000         END-COMPUTE                                              34760000
348100         MOVE PV-PERCENT         TO DL-AP-NET-MARKON-LY           34770000
348200     END-IF.                                                      34780000
348300                                                                  34790000
348400     MOVE DL-AP-DETAIL-LINE      TO RR-REPORT-RECORD.             34800000
348500     SET PI-PRINT-BACK           TO TRUE.                         34810000
348600     MOVE 1                      TO PA-LINE-NO.                   34820000
348700                                                                  34830000
348800     PERFORM 6000-CHECK-AP-DETAIL-GT-ZERO.                        34840000
348900     IF PI-PRINT-DETAIL                                           34850000
349000         PERFORM 5000-WRITE-REPORT-LINE                           34860000
349100     ELSE                                                         34870000
349200         MOVE DL-AP-NO-DETAIL    TO RR-REPORT-RECORD              34880000
349300         PERFORM 5000-WRITE-REPORT-LINE                           34890000
349400     END-IF.                                                      34900000
349500     MOVE BL-BAR-LINE            TO RR-REPORT-RECORD.             34910000
349600     MOVE 1                      TO PA-LINE-NO.                   34920000
349700     PERFORM 5000-WRITE-REPORT-LINE.                              34930000
349800/                                                                 34940000
349900 3200-PRINT-SALES-YTD.                                            34950000
350000******************************************************************34960000
350100*   3200-PRINT-SALES-YTD                                         *34970000
350200*     PERFORM TO FORMAT/PRINT THE SALES HEADER LINES, THEN       *34980000
350300*     SALES DETAIL LINES, THEN THE SALES TOTAL LINE.             *34990000
350400*     FORMAT THE CURRENT-MONTH INFO TO TABLE FOR PRINTING        *35000000
350500*       AT THE BACK OF THE PAGE LATER.                           *35010000
350600*    % SALES IS BASED ON TOTAL SALES AT THE DEPT LEVEL.          *35020000
350700*                                                                *35030000
350800*   PERFORMED BY:  2500-PROCESS-PC                               *35040000
350900******************************************************************35050000
351000                                                                  35060000
351100     SET PI-PRINT-BOTH               TO TRUE.                     35070000
351200     MOVE 1                          TO PA-LINE-NO.               35080000
351300     MOVE  H8-HEADING8A              TO RR-REPORT-RECORD.         35090000
351400     PERFORM 5000-WRITE-REPORT-LINE.                              35100000
351500     MOVE  H8-HEADING8B              TO RR-REPORT-RECORD.         35110000
351600     PERFORM 5000-WRITE-REPORT-LINE.                              35120000
351700     MOVE 1                          TO PA-LINE-NO.               35130000
351800                                                                  35140000
351900     PERFORM VARYING PA-SUB FROM 1 BY 1 UNTIL PA-SUB > 9          35150000
352000         IF CT-SALES-CLASS (PA-SUB) = 0                           35160000
352100            CONTINUE                                              35170000
352200         ELSE                                                     35180000
352300             MOVE CT-SALES-CLASS (PA-SUB)      TO DL-SL-CLASS     35190000
352400             MOVE CT-SALES-CLASS-DESC (PA-SUB) TO DL-SL-CLASS-DESC35200000
352500*****  THIS YEAR  ************************************************35210000
352600             COMPUTE DL-SL-TOTAL-SALES-TY ROUNDED =               35220000
352700                       CT-TOTAL-SALES-TY (PA-SUB) / 1000.00       35230000
352800             COMPUTE DL-SL-REGULAR-SALES-TY ROUNDED =             35240000
352900                       CT-REGULAR-SALES-TY (PA-SUB) / 1000.00     35250000
353000             COMPUTE DL-SL-PROMO-SALES-TY ROUNDED =               35260000
353100                       CT-PROMO-SALES-TY (PA-SUB) / 1000.00       35270000
353200             COMPUTE DL-SL-GOLDSTAR-SALES-TY ROUNDED =            35280000
353300                       CT-GOLDSTAR-SALES-TY (PA-SUB) / 1000.00    35290000
353400             COMPUTE DL-SL-CLEAR-SALES-TY ROUNDED =               35300000
353500                       CT-CLEAR-SALES-TY (PA-SUB) / 1000.00       35310000
353600             COMPUTE DL-SL-UNKWN-SALES-TY ROUNDED =               35320000
353700                       CT-UNKWN-SALES-TY (PA-SUB) / 1000.00       35330000
353800*****  LAST YEAR  ************************************************35340000
353900*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            35350000
354000             IF PV-HDG-START-CCYY-LY = PC-1998                    35360000
354100                 CONTINUE                                         35370000
354200             ELSE                                                 35380000
354300                 COMPUTE DL-SL-TOTAL-SALES-LY ROUNDED =           35390000
354400                         CT-TOTAL-SALES-LY (PA-SUB) / 1000.00     35400000
354500                 COMPUTE DL-SL-REGULAR-SALES-LY ROUNDED =         35410000
354600                         CT-REGULAR-SALES-LY (PA-SUB) / 1000.00   35420000
354700                 COMPUTE DL-SL-PROMO-SALES-LY ROUNDED =           35430000
354800                         CT-PROMO-SALES-LY (PA-SUB) / 1000.00     35440000
354900                 COMPUTE DL-SL-GOLDSTAR-SALES-LY ROUNDED =        35450000
355000                         CT-GOLDSTAR-SALES-LY (PA-SUB) / 1000.00  35460000
355100                 COMPUTE DL-SL-CLEAR-SALES-LY ROUNDED =           35470000
355200                         CT-CLEAR-SALES-LY (PA-SUB) / 1000.00     35480000
355300                 COMPUTE DL-SL-UNKWN-SALES-LY ROUNDED =           35490000
355400                         CT-UNKWN-SALES-LY (PA-SUB) / 1000.00     35500000
355500             END-IF                                               35510000
355600             MOVE DL-SL-DETAIL-LINE  TO RR-REPORT-RECORD          35520000
355700             SET PI-PRINT-FRONT      TO TRUE                      35530000
355800             MOVE 1                  TO PA-LINE-NO                35540000
355900             PERFORM 6100-CHECK-SL-DETAIL-GT-ZERO                 35550000
356000             IF PI-PRINT-DETAIL                                   35560000
356100                 PERFORM 5000-WRITE-REPORT-LINE                   35570000
356200             END-IF                                               35580000
356300         END-IF                                                   35590000
356400     END-PERFORM.                                                 35600000
356500                                                                  35610000
356600     MOVE PC-TOTAL                    TO DL-SL-TOTAL.             35620000
356700                                                                  35630000
356800*****  THIS YEAR  ************************************************35640000
356900     COMPUTE DL-SL-TOTAL-SALES-TY ROUNDED =                       35650000
357000                             VT-TOTAL-SALES-TY / 1000.00.         35660000
357100     COMPUTE DL-SL-REGULAR-SALES-TY ROUNDED =                     35670000
357200                             VT-REGULAR-SALES-TY / 1000.00.       35680000
357300     COMPUTE DL-SL-PROMO-SALES-TY ROUNDED =                       35690000
357400                             VT-PROMO-SALES-TY / 1000.00.         35700000
357500     COMPUTE DL-SL-GOLDSTAR-SALES-TY ROUNDED =                    35710000
357600                             VT-GOLDSTAR-SALES-TY / 1000.00.      35720000
357700     COMPUTE DL-SL-CLEAR-SALES-TY ROUNDED =                       35730000
357800                             VT-CLEAR-SALES-TY / 1000.00.         35740000
357900     COMPUTE DL-SL-UNKWN-SALES-TY ROUNDED =                       35750000
358000                             VT-UNKWN-SALES-TY / 1000.00.         35760000
358100                                                                  35770000
358200*****  LAST YEAR  ************************************************35780000
358300*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            35790000
358400     IF PV-HDG-START-CCYY-LY = PC-1998                            35800000
358500         CONTINUE                                                 35810000
358600     ELSE                                                         35820000
358700         COMPUTE DL-SL-TOTAL-SALES-LY ROUNDED =                   35830000
358800                 VT-TOTAL-SALES-LY / 1000.00                      35840000
358900         COMPUTE DL-SL-REGULAR-SALES-LY ROUNDED =                 35850000
359000                 VT-REGULAR-SALES-LY / 1000.00                    35860000
359100         COMPUTE DL-SL-PROMO-SALES-LY ROUNDED =                   35870000
359200                 VT-PROMO-SALES-LY / 1000.00                      35880000
359300         COMPUTE DL-SL-GOLDSTAR-SALES-LY ROUNDED =                35890000
359400                 VT-GOLDSTAR-SALES-LY / 1000.00                   35900000
359500         COMPUTE DL-SL-CLEAR-SALES-LY ROUNDED =                   35910000
359600                 VT-CLEAR-SALES-LY / 1000.00                      35920000
359700         COMPUTE DL-SL-UNKWN-SALES-LY ROUNDED =                   35930000
359800                 VT-UNKWN-SALES-LY / 1000.00                      35940000
359900     END-IF.                                                      35950000
360000                                                                  35960000
360100     MOVE DL-SL-DETAIL-LINE          TO RR-REPORT-RECORD.         35970000
360200     MOVE 1                          TO PA-LINE-NO.               35980000
360300                                                                  35990000
360400     PERFORM 6100-CHECK-SL-DETAIL-GT-ZERO.                        36000000
360500     IF PI-PRINT-DETAIL                                           36010000
360600         PERFORM 5000-WRITE-REPORT-LINE                           36020000
360700     ELSE                                                         36030000
360800         MOVE DL-SALES-NO-DETAIL     TO RR-REPORT-RECORD          36040000
360900         PERFORM 5000-WRITE-REPORT-LINE                           36050000
361000     END-IF.                                                      36060000
361100     MOVE BL-BAR-LINE                TO RR-REPORT-RECORD.         36070000
361200     MOVE 1                          TO PA-LINE-NO.               36080000
361300     PERFORM 5000-WRITE-REPORT-LINE.                              36090000
361400     PERFORM 3210-PRINT-SALES-CURR-MONTH.                         36100000
361500                                                                  36110000
361600 3210-PRINT-SALES-CURR-MONTH.                                     36120000
361700******************************************************************36130000
361800*   3210-PRINT-SALES-CURR-MONTH                                  *36140000
361900*     FORMAT THE SALES DETAIL LINE FOR THE CURRENT-MONTH         *36150000
362000*     FORMAT THE SALES TOTAL LINE FOR THE CURRENT-MONTH          *36160000
362100*     BOTH LINES ARE MOVED TO THE PRINT TABLE FOR PRINTING       *36170000
362200*        AT THE BACK OF THE PAGE LATER.                          *36180000
362300*                                                                *36190000
362400*   PERFORMED BY:  3200-PRINT-SALES-TOTAL                        *36200000
362500******************************************************************36210000
362600                                                                  36220000
362700     MOVE 0 TO PA-SUB.                                            36230000
362800     PERFORM VARYING PA-SUB FROM 1 BY 1 UNTIL PA-SUB > 9          36240000
362900         IF CM-SALES-CLASS ( PA-SUB) = 0                          36250000
363000             CONTINUE                                             36260000
363100         ELSE                                                     36270000
363200             PERFORM 3220-PRINT-SALES-CURR-MONTH                  36280000
363300         END-IF                                                   36290000
363400     END-PERFORM.                                                 36300000
363500                                                                  36310000
363600     MOVE PC-TOTAL                    TO DL-SL-TOTAL.             36320000
363700                                                                  36330000
363800***** THIS YEAR **************************************************36340000
363900     COMPUTE DL-SL-TOTAL-SALES-TY ROUNDED =                       36350000
364000                             CMT-TOTAL-SALES-TY / 1000.00.        36360000
364100     COMPUTE DL-SL-REGULAR-SALES-TY ROUNDED =                     36370000
364200                             CMT-REGULAR-SALES-TY / 1000.00.      36380000
364300     COMPUTE DL-SL-PROMO-SALES-TY ROUNDED =                       36390000
364400                             CMT-PROMO-SALES-TY / 1000.00.        36400000
364500     COMPUTE DL-SL-GOLDSTAR-SALES-TY ROUNDED =                    36410000
364600                             CMT-GOLDSTAR-SALES-TY / 1000.00.     36420000
364700     COMPUTE DL-SL-CLEAR-SALES-TY ROUNDED =                       36430000
364800                             CMT-CLEAR-SALES-TY / 1000.00.        36440000
364900     COMPUTE DL-SL-UNKWN-SALES-TY ROUNDED =                       36450000
365000                             CMT-UNKWN-SALES-TY / 1000.00.        36460000
365100                                                                  36470000
365200***** LAST YEAR **************************************************36480000
365300*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            36490000
365400     IF PV-HDG-START-CCYY-LY = PC-1998                            36500000
365500         CONTINUE                                                 36510000
365600     ELSE                                                         36520000
365700         COMPUTE DL-SL-TOTAL-SALES-LY ROUNDED =                   36530000
365800                 CMT-TOTAL-SALES-LY / 1000.00                     36540000
365900         COMPUTE DL-SL-REGULAR-SALES-LY ROUNDED =                 36550000
366000                 CMT-REGULAR-SALES-LY / 1000.00                   36560000
366100         COMPUTE DL-SL-PROMO-SALES-LY ROUNDED =                   36570000
366200                 CMT-PROMO-SALES-LY / 1000.00                     36580000
366300         COMPUTE DL-SL-GOLDSTAR-SALES-LY ROUNDED =                36590000
366400                 CMT-GOLDSTAR-SALES-LY / 1000.00                  36600000
366500         COMPUTE DL-SL-CLEAR-SALES-LY ROUNDED =                   36610000
366600                 CMT-CLEAR-SALES-LY / 1000.00                     36620000
366700         COMPUTE DL-SL-UNKWN-SALES-LY ROUNDED =                   36630000
366800                 CMT-UNKWN-SALES-LY / 1000.00                     36640000
366900     END-IF.                                                      36650000
367000                                                                  36660000
367100     MOVE DL-SL-DETAIL-LINE TO RR-REPORT-RECORD.                  36670000
367200     SET PI-PRINT-BACK TO TRUE.                                   36680000
367300     MOVE 1 TO PA-LINE-NO.                                        36690000
367400     PERFORM 6100-CHECK-SL-DETAIL-GT-ZERO.                        36700000
367500     IF PI-PRINT-DETAIL                                           36710000
367600         PERFORM 5000-WRITE-REPORT-LINE                           36720000
367700     ELSE                                                         36730000
367800         MOVE DL-SALES-NO-DETAIL TO RR-REPORT-RECORD              36740000
367900         PERFORM 5000-WRITE-REPORT-LINE                           36750000
368000     END-IF.                                                      36760000
368100     MOVE BL-BAR-LINE TO RR-REPORT-RECORD.                        36770000
368200     MOVE 1 TO PA-LINE-NO.                                        36780000
368300     PERFORM 5000-WRITE-REPORT-LINE.                              36790000
368400/                                                                 36800000
368500 3220-PRINT-SALES-CURR-MONTH.                                     36810000
368600******************************************************************36820000
368700*   3220-PRINT-SALES-CURR-MONTH                                  *36830000
368800*     FORMAT THE SALES DETAIL LINE FOR THE CURRENT-MONTH         *36840000
368900*                                                                *36850000
369000*   PERFORMED BY:  3210-PRINT-SALES-CURR-MONTH                   *36860000
369100******************************************************************36870000
369200                                                                  36880000
369300     MOVE CM-SALES-CLASS (PA-SUB)       TO DL-SL-CLASS.           36890000
369400     MOVE CM-SALES-CLASS-DESC (PA-SUB) TO DL-SL-CLASS-DESC.       36900000
369500                                                                  36910000
369600***** THIS YEAR ************************************************  36920000
369700     COMPUTE DL-SL-TOTAL-SALES-TY ROUNDED =                       36930000
369800                   CM-TOTAL-SALES-TY (PA-SUB) / 1000.00.          36940000
369900     COMPUTE DL-SL-REGULAR-SALES-TY ROUNDED =                     36950000
370000                       CM-REGULAR-SALES-TY (PA-SUB) / 1000.00.    36960000
370100     COMPUTE DL-SL-PROMO-SALES-TY ROUNDED =                       36970000
370200                       CM-PROMO-SALES-TY (PA-SUB) / 1000.00.      36980000
370300     COMPUTE DL-SL-GOLDSTAR-SALES-TY ROUNDED =                    36990000
370400                       CM-GOLDSTAR-SALES-TY (PA-SUB) / 1000.00.   37000000
370500     COMPUTE DL-SL-CLEAR-SALES-TY ROUNDED =                       37010000
370600                       CM-CLEAR-SALES-TY (PA-SUB) / 1000.00.      37020000
370700     COMPUTE DL-SL-UNKWN-SALES-TY ROUNDED =                       37030000
370800                       CM-UNKWN-SALES-TY (PA-SUB) / 1000.00.      37040000
370900                                                                  37050000
371000***** LAST YEAR ************************************************  37060000
371100*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            37070000
371200     IF PV-HDG-START-CCYY-LY = PC-1998                            37080000
371300         CONTINUE                                                 37090000
371400     ELSE                                                         37100000
371500         COMPUTE DL-SL-TOTAL-SALES-LY ROUNDED =                   37110000
371600                 CM-TOTAL-SALES-LY (PA-SUB) / 1000.00             37120000
371700         COMPUTE DL-SL-REGULAR-SALES-LY ROUNDED =                 37130000
371800                 CM-REGULAR-SALES-LY (PA-SUB) / 1000.00           37140000
371900         COMPUTE DL-SL-PROMO-SALES-LY ROUNDED =                   37150000
372000                 CM-PROMO-SALES-LY (PA-SUB) / 1000.00             37160000
372100         COMPUTE DL-SL-GOLDSTAR-SALES-LY ROUNDED =                37170000
372200                 CM-GOLDSTAR-SALES-LY (PA-SUB) / 1000.00          37180000
372300         COMPUTE DL-SL-CLEAR-SALES-LY ROUNDED =                   37190000
372400                 CM-CLEAR-SALES-LY (PA-SUB) / 1000.00             37200000
372500         COMPUTE DL-SL-UNKWN-SALES-LY ROUNDED =                   37210000
372600                 CM-UNKWN-SALES-LY (PA-SUB) / 1000.00             37220000
372700     END-IF.                                                      37230000
372800                                                                  37240000
372900     MOVE DL-SL-DETAIL-LINE             TO RR-REPORT-RECORD.      37250000
373000     SET PI-PRINT-BACK                  TO TRUE.                  37260000
373100     MOVE 1                             TO PA-LINE-NO.            37270000
373200     PERFORM 6100-CHECK-SL-DETAIL-GT-ZERO.                        37280000
373300     IF PI-PRINT-DETAIL                                           37290000
373400         PERFORM 5000-WRITE-REPORT-LINE                           37300000
373500     END-IF.                                                      37310000
373600/                                                                 37320000
373700 3300-PRINT-PC-YTD.                                               37330000
373800******************************************************************37340000
373900*   3300-PRINT-PC-YTD                                            *37350000
374000*     PERFORM TO FORMAT/PRINT THE PC HEADER LINES, THEN          *37360000
374100*     PC DETAIL LINES, THEN THE PC TOTAL LINE.                   *37370000
374200*     FORMAT THE CURRENT-MONTH INFO TO TABLE FOR PRINTING        *37380000
374300*       AT THE BACK OF THE PAGE LATER.                           *37390000
374400*                                                                *37400000
374500*   PERFORMED BY:  2600-PROCESS-MISC                             *37410000
374600******************************************************************37420000
374700                                                                  37430000
374800     SET PI-PRINT-BOTH               TO TRUE.                     37440000
374900     MOVE 1                          TO PA-LINE-NO.               37450000
375000     MOVE H9-HEADING9A               TO RR-REPORT-RECORD.         37460000
375100     PERFORM 5000-WRITE-REPORT-LINE.                              37470000
375200     MOVE H9-HEADING9B               TO RR-REPORT-RECORD.         37480000
375300     PERFORM 5000-WRITE-REPORT-LINE.                              37490000
375400     MOVE 1                          TO PA-LINE-NO.               37500000
375500                                                                  37510000
375600     MOVE 0 TO PA-SUB.                                            37520000
375700     PERFORM VARYING PA-SUB FROM 1 BY 1 UNTIL PA-SUB > 9          37530000
375800         IF CT-AP-CLASS (PA-SUB) = 0                              37540000
375900            CONTINUE                                              37550000
376000         ELSE                                                     37560000
376100             MOVE CT-PC-CLASS (PA-SUB)      TO DL-PC-CLASS        37570000
376200             MOVE CT-PC-CLASS-DESC (PA-SUB) TO DL-PC-CLASS-DESC   37580000
376300***** THIS YEAR **************************************************37590000
376400             COMPUTE DL-PC-TOTAL-MKDN-TY ROUNDED =                37600000
376500                  CT-TOTAL-MKDN-TY (PA-SUB) / 1000.00             37610000
376600             COMPUTE DL-PC-STORE-MKDN-TY ROUNDED =                37620000
376700                  CT-STORE-MKDN-TY (PA-SUB) / 1000.00             37630000
376800             COMPUTE DL-PC-BUYER-MKDN-TY ROUNDED =                37640000
376900                  CT-BUYER-MKDN-TY (PA-SUB) / 1000.00             37650000
377000             COMPUTE DL-PC-PLU-MKDN-TY ROUNDED =                  37660000
377100                  CT-PLU-MKDN-TY (PA-SUB) / 1000.00               37670000
377200             COMPUTE DL-PC-PERM-MKDN-TY ROUNDED =                 37680000
377300                  CT-PERM-MKDN-TY (PA-SUB) / 1000.00              37690000
377400             COMPUTE DL-PC-OTHER-MKDN-TY ROUNDED =                37700000
377500                  CT-OTHER-MKDN-TY (PA-SUB) / 1000.00             37710000
377600             COMPUTE PV-PERCENT ROUNDED =                         37720000
377700                  CT-TOTAL-MKDN-TY (PA-SUB)                       37730000
377800                  * PC-100 / CT-TOTAL-SALES-TY (PA-SUB)           37740000
377900                  ON SIZE ERROR MOVE 0 TO PV-PERCENT              37750000
378000             END-COMPUTE                                          37760000
378100             MOVE PV-PERCENT          TO DL-PC-MKDN-PCT-SLS-TY    37770000
378200             COMPUTE DL-PC-TOTAL-MKUP-TY ROUNDED =                37780000
378300                  CT-TOTAL-MKUP-TY (PA-SUB) / 1000.00             37790000
378400             COMPUTE DL-PC-DEBIT-ALLOW-TY ROUNDED =               37800000
378500                  CT-DEBIT-ALLOW-TY (PA-SUB) / 1000.00            37810000
378600                                                                  37820000
378700***** LAST YEAR **************************************************37830000
378800*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    37840000
378900*            IF PV-HDG-START-CCYY-LY = PC-1998                    37850000
379000             IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999         37860000
379100                 CONTINUE                                         37870000
379200             ELSE                                                 37880000
379300                 COMPUTE DL-PC-TOTAL-MKDN-LY ROUNDED =            37890000
379400                         CT-TOTAL-MKDN-LY (PA-SUB) / 1000.00      37900000
379500                 COMPUTE PV-PERCENT ROUNDED =                     37910000
379600                         CT-TOTAL-MKDN-LY (PA-SUB)                37920000
379700                       * PC-100 / CT-TOTAL-SALES-LY (PA-SUB)      37930000
379800                      ON SIZE ERROR MOVE 0 TO PV-PERCENT          37940000
379900                 END-COMPUTE                                      37950000
380000                 MOVE PV-PERCENT TO DL-PC-MKDN-PCT-SLS-LY         37960000
380100                 COMPUTE DL-PC-PLU-MKDN-LY ROUNDED =              37970000
380200                         CT-PLU-MKDN-LY (PA-SUB) / 1000.00        37980000
380300                 COMPUTE DL-PC-PERM-MKDN-LY ROUNDED =             37990000
380400                         CT-PERM-MKDN-LY (PA-SUB) / 1000.00       38000000
380500                 COMPUTE DL-PC-OTHER-MKDN-LY ROUNDED =            38010000
380600                         CT-OTHER-MKDN-LY (PA-SUB) / 1000.00      38020000
380700                 COMPUTE DL-PC-TOTAL-MKUP-LY ROUNDED =            38030000
380800                         CT-TOTAL-MKUP-LY (PA-SUB) / 1000.00      38040000
380900             END-IF                                               38050000
381000             MOVE DL-PC-DETAIL-LINE   TO RR-REPORT-RECORD         38060000
381100             SET PI-PRINT-FRONT       TO TRUE                     38070000
381200             MOVE 1                   TO PA-LINE-NO               38080000
381300             PERFORM 6200-CHECK-PC-DETAIL-GT-ZERO                 38090000
381400             IF PI-PRINT-DETAIL                                   38100000
381500                 PERFORM 5000-WRITE-REPORT-LINE                   38110000
381600             END-IF                                               38120000
381700         END-IF                                                   38130000
381800     END-PERFORM.                                                 38140000
381900                                                                  38150000
382000     MOVE PC-TOTAL                    TO DL-PC-TOTAL.             38160000
382100                                                                  38170000
382200******  THIS YEAR  ***********************************************38180000
382300     COMPUTE DL-PC-TOTAL-MKDN-TY ROUNDED =                        38190000
382400                           VT-TOTAL-MKDN-TY / 1000.00.            38200000
382500     COMPUTE DL-PC-STORE-MKDN-TY ROUNDED =                        38210000
382600                           VT-STORE-MKDN-TY / 1000.00.            38220000
382700     COMPUTE DL-PC-BUYER-MKDN-TY ROUNDED =                        38230000
382800                           VT-BUYER-MKDN-TY / 1000.00.            38240000
382900     COMPUTE DL-PC-PLU-MKDN-TY ROUNDED =                          38250000
383000                           VT-PLU-MKDN-TY / 1000.00.              38260000
383100     COMPUTE DL-PC-PERM-MKDN-TY ROUNDED =                         38270000
383200                           VT-PERM-MKDN-TY / 1000.00.             38280000
383300     COMPUTE DL-PC-OTHER-MKDN-TY ROUNDED =                        38290000
383400                           VT-OTHER-MKDN-TY / 1000.00.            38300000
383500     COMPUTE PV-PERCENT ROUNDED = VT-TOTAL-MKDN-TY                38310000
383600           * PC-100 / VT-TOTAL-SALES-TY                           38320000
383700          ON SIZE ERROR MOVE 0 TO PV-PERCENT                      38330000
383800     END-COMPUTE.                                                 38340000
383900     MOVE PV-PERCENT           TO DL-PC-MKDN-PCT-SLS-TY.          38350000
384000     COMPUTE DL-PC-TOTAL-MKUP-TY ROUNDED =                        38360000
384100                           VT-TOTAL-MKUP-TY / 1000.00.            38370000
384200     COMPUTE DL-PC-DEBIT-ALLOW-TY ROUNDED =                       38380000
384300                           VT-DEBIT-ALLOW-TY / 1000.00.           38390000
384400                                                                  38400000
384500******  LAST YEAR  ***********************************************38410000
384600*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    38420000
384700*    IF PV-HDG-START-CCYY-LY = PC-1998                            38430000
384800     IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                 38440000
384900         CONTINUE                                                 38450000
385000     ELSE                                                         38460000
385100         COMPUTE DL-PC-TOTAL-MKDN-LY ROUNDED =                    38470000
385200                 VT-TOTAL-MKDN-LY / 1000.00                       38480000
385300         COMPUTE PV-PERCENT ROUNDED = VT-TOTAL-MKDN-LY            38490000
385400               * PC-100 / VT-TOTAL-SALES-LY                       38500000
385500              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  38510000
385600         END-COMPUTE                                              38520000
385700         MOVE PV-PERCENT           TO DL-PC-MKDN-PCT-SLS-LY       38530000
385800         COMPUTE DL-PC-PLU-MKDN-LY ROUNDED =                      38540000
385900                 VT-PLU-MKDN-LY / 1000.00                         38550000
386000         COMPUTE DL-PC-PERM-MKDN-LY ROUNDED =                     38560000
386100                 VT-PERM-MKDN-LY / 1000.00                        38570000
386200         COMPUTE DL-PC-OTHER-MKDN-LY ROUNDED =                    38580000
386300                 VT-OTHER-MKDN-LY / 1000.00                       38590000
386400         COMPUTE DL-PC-TOTAL-MKUP-LY ROUNDED =                    38600000
386500                 VT-TOTAL-MKUP-LY / 1000.00                       38610000
386600     END-IF.                                                      38620000
386700                                                                  38630000
386800     MOVE DL-PC-DETAIL-LINE TO RR-REPORT-RECORD.                  38640000
386900     SET PI-PRINT-FRONT TO TRUE.                                  38650000
387000     MOVE 1 TO PA-LINE-NO.                                        38660000
387100                                                                  38670000
387200     PERFORM 6200-CHECK-PC-DETAIL-GT-ZERO.                        38680000
387300     IF PI-PRINT-DETAIL                                           38690000
387400         PERFORM 5000-WRITE-REPORT-LINE                           38700000
387500     ELSE                                                         38710000
387600         MOVE DL-PC-NO-DETAIL TO RR-REPORT-RECORD                 38720000
387700         PERFORM 5000-WRITE-REPORT-LINE                           38730000
387800     END-IF.                                                      38740000
387900     MOVE BL-BAR-LINE TO RR-REPORT-RECORD.                        38750000
388000     MOVE 1 TO PA-LINE-NO.                                        38760000
388100     PERFORM 5000-WRITE-REPORT-LINE.                              38770000
388200     PERFORM 3310-PRINT-PC-CURR-MONTH.                            38780000
388300                                                                  38790000
388400 3310-PRINT-PC-CURR-MONTH.                                        38800000
388500******************************************************************38810000
388600*   3310-PRINT-PC-CURR-MONTH                                     *38820000
388700*     FORMAT THE PC DETAIL LINE FOR THE CURRENT-MONTH            *38830000
388800*     FORMAT THE PCTOTAL LINE FOR THE CURRENT-MONTH              *38840000
388900*     BOTH LINES ARE MOVED TO THE PRINT TABLE FOR PRINTING       *38850000
389000*        AT THE BACK OF THE PAGE LATER.                          *38860000
389100*                                                                *38870000
389200*   PERFORMED BY:  3300-PRINT-PC-TOTAL                           *38880000
389300******************************************************************38890000
389400                                                                  38900000
389500     MOVE 0 TO PA-SUB.                                            38910000
389600     PERFORM VARYING PA-SUB FROM 1 BY 1 UNTIL PA-SUB > 9          38920000
389700         IF CM-PC-CLASS (PA-SUB) = 0                              38930000
389800             CONTINUE                                             38940000
389900         ELSE                                                     38950000
390000             PERFORM 3320-PRINT-PC-CURR-MONTH                     38960000
390100         END-IF                                                   38970000
390200     END-PERFORM.                                                 38980000
390300                                                                  38990000
390400     MOVE PC-TOTAL                    TO DL-PC-TOTAL.             39000000
390500                                                                  39010000
390600****** THIS YEAR ************************************************ 39020000
390700     COMPUTE DL-PC-TOTAL-MKDN-TY ROUNDED =                        39030000
390800                           CMT-TOTAL-MKDN-TY / 1000.00.           39040000
390900     COMPUTE DL-PC-STORE-MKDN-TY ROUNDED =                        39050000
391000                           CMT-STORE-MKDN-TY / 1000.00.           39060000
391100     COMPUTE DL-PC-BUYER-MKDN-TY ROUNDED =                        39070000
391200                           CMT-BUYER-MKDN-TY / 1000.00.           39080000
391300     COMPUTE DL-PC-PLU-MKDN-TY ROUNDED =                          39090000
391400                           CMT-PLU-MKDN-TY / 1000.00.             39100000
391500     COMPUTE DL-PC-PERM-MKDN-TY ROUNDED =                         39110000
391600                           CMT-PERM-MKDN-TY / 1000.00.            39120000
391700     COMPUTE DL-PC-OTHER-MKDN-TY ROUNDED =                        39130000
391800                           CMT-OTHER-MKDN-TY / 1000.00.           39140000
391900     COMPUTE PV-PERCENT ROUNDED = CMT-TOTAL-MKDN-TY               39150000
392000           * PC-100 / CMT-TOTAL-SALES-TY                          39160000
392100          ON SIZE ERROR MOVE 0 TO PV-PERCENT                      39170000
392200     END-COMPUTE.                                                 39180000
392300     MOVE PV-PERCENT                  TO DL-PC-MKDN-PCT-SLS-TY.   39190000
392400     COMPUTE DL-PC-TOTAL-MKUP-TY ROUNDED =                        39200000
392500             CMT-TOTAL-MKUP-TY / 1000.00.                         39210000
392600     COMPUTE DL-PC-DEBIT-ALLOW-TY ROUNDED =                       39220000
392700             CMT-DEBIT-ALLOW-TY / 1000.00.                        39230000
392800                                                                  39240000
392900****** LAST YEAR ************************************************ 39250000
393000*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    39260000
393100*     IF PV-HDG-START-CCYY-LY = PC-1998                           39270000
393200      IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                39280000
393300         CONTINUE                                                 39290000
393400     ELSE                                                         39300000
393500         COMPUTE DL-PC-TOTAL-MKDN-LY ROUNDED =                    39310000
393600                 CMT-TOTAL-MKDN-LY / 1000.00                      39320000
393700         COMPUTE PV-PERCENT ROUNDED = CMT-TOTAL-MKDN-LY           39330000
393800               * PC-100 / CMT-TOTAL-SALES-LY                      39340000
393900              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  39350000
394000         END-COMPUTE                                              39360000
394100         MOVE PV-PERCENT       TO DL-PC-MKDN-PCT-SLS-LY           39370000
394200         COMPUTE DL-PC-PLU-MKDN-LY ROUNDED =                      39380000
394300                 CMT-PLU-MKDN-LY / 1000.00                        39390000
394400         COMPUTE DL-PC-PERM-MKDN-LY ROUNDED =                     39400000
394500                 CMT-PERM-MKDN-LY / 1000.00                       39410000
394600         COMPUTE DL-PC-OTHER-MKDN-LY ROUNDED =                    39420000
394700                 CMT-OTHER-MKDN-LY / 1000.00                      39430000
394800         COMPUTE DL-PC-TOTAL-MKUP-LY ROUNDED =                    39440000
394900                 CMT-TOTAL-MKUP-LY / 1000.00                      39450000
395000     END-IF.                                                      39460000
395100                                                                  39470000
395200     MOVE DL-PC-DETAIL-LINE TO RR-REPORT-RECORD.                  39480000
395300     SET PI-PRINT-BACK TO TRUE.                                   39490000
395400     MOVE 1 TO PA-LINE-NO.                                        39500000
395500     PERFORM 6200-CHECK-PC-DETAIL-GT-ZERO.                        39510000
395600     IF PI-PRINT-DETAIL                                           39520000
395700         PERFORM 5000-WRITE-REPORT-LINE                           39530000
395800     ELSE                                                         39540000
395900         MOVE DL-PC-NO-DETAIL TO RR-REPORT-RECORD                 39550000
396000         PERFORM 5000-WRITE-REPORT-LINE                           39560000
396100     END-IF.                                                      39570000
396200     MOVE BL-BAR-LINE TO RR-REPORT-RECORD.                        39580000
396300     MOVE 1 TO PA-LINE-NO.                                        39590000
396400     PERFORM 5000-WRITE-REPORT-LINE.                              39600000
396500/                                                                 39610000
396600 3320-PRINT-PC-CURR-MONTH.                                        39620000
396700******************************************************************39630000
396800*   3320-PRINT-PC-CURR-MONTH                                     *39640000
396900*     FORMAT THE PC DETAIL LINE FOR THE CURRENT-MONTH            *39650000
397000*                                                                *39660000
397100*   PERFORMED BY:  3310-PRINT-PC-CURR-MONTH                      *39670000
397200******************************************************************39680000
397300                                                                  39690000
397400     MOVE CM-PC-CLASS (PA-SUB)              TO DL-PC-CLASS.       39700000
397500     MOVE CM-PC-CLASS-DESC (PA-SUB)         TO DL-PC-CLASS-DESC.  39710000
397600                                                                  39720000
397700                                                                  39730000
397800****** THIS YEAR ************************************************ 39740000
397900     COMPUTE DL-PC-TOTAL-MKDN-TY ROUNDED =                        39750000
398000             CM-TOTAL-MKDN-TY (PA-SUB) / 1000.00.                 39760000
398100     COMPUTE DL-PC-STORE-MKDN-TY ROUNDED =                        39770000
398200             CM-STORE-MKDN-TY (PA-SUB) / 1000.00.                 39780000
398300     COMPUTE DL-PC-BUYER-MKDN-TY ROUNDED =                        39790000
398400             CM-BUYER-MKDN-TY (PA-SUB) / 1000.00.                 39800000
398500     COMPUTE DL-PC-PLU-MKDN-TY ROUNDED =                          39810000
398600             CM-PLU-MKDN-TY (PA-SUB) / 1000.00.                   39820000
398700     COMPUTE DL-PC-PERM-MKDN-TY ROUNDED =                         39830000
398800             CM-PERM-MKDN-TY (PA-SUB) / 1000.00.                  39840000
398900     COMPUTE DL-PC-OTHER-MKDN-TY ROUNDED =                        39850000
399000             CM-OTHER-MKDN-TY (PA-SUB) / 1000.00.                 39860000
399100     COMPUTE PV-PERCENT ROUNDED = CM-TOTAL-MKDN-TY (PA-SUB)       39870000
399200           * PC-100 / CM-TOTAL-SALES-TY (PA-SUB)                  39880000
399300          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     39890000
399400     MOVE PV-PERCENT           TO DL-PC-MKDN-PCT-SLS-TY.          39900000
399500     COMPUTE DL-PC-TOTAL-MKUP-TY ROUNDED =                        39910000
399600             CM-TOTAL-MKUP-TY (PA-SUB) / 1000.00.                 39920000
399700     COMPUTE DL-PC-DEBIT-ALLOW-TY ROUNDED =                       39930000
399800             CM-DEBIT-ALLOW-TY (PA-SUB) / 1000.00.                39940000
399900                                                                  39950000
400000****** LAST YEAR ************************************************ 39960000
400100*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    39970000
400200*    IF PV-HDG-START-CCYY-LY = PC-1998                            39980000
400300     IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                 39990000
400400         CONTINUE                                                 40000000
400500     ELSE                                                         40010000
400600         COMPUTE DL-PC-TOTAL-MKDN-LY ROUNDED =                    40020000
400700                 CM-TOTAL-MKDN-LY (PA-SUB) / 1000.00              40030000
400800         COMPUTE PV-PERCENT ROUNDED =                             40040000
400900                 CM-TOTAL-MKDN-LY (PA-SUB)                        40050000
401000               * PC-100 / CM-TOTAL-SALES-LY (PA-SUB)              40060000
401100              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  40070000
401200         END-COMPUTE                                              40080000
401300         MOVE PV-PERCENT        TO DL-PC-MKDN-PCT-SLS-LY          40090000
401400         COMPUTE DL-PC-PLU-MKDN-LY ROUNDED =                      40100000
401500                 CM-PLU-MKDN-LY (PA-SUB) / 1000.00                40110000
401600         COMPUTE DL-PC-PERM-MKDN-LY ROUNDED =                     40120000
401700                 CM-PERM-MKDN-LY (PA-SUB) / 1000.00               40130000
401800         COMPUTE DL-PC-OTHER-MKDN-LY ROUNDED =                    40140000
401900                 CM-OTHER-MKDN-LY (PA-SUB) / 1000.00              40150000
402000         COMPUTE DL-PC-TOTAL-MKUP-LY ROUNDED =                    40160000
402100                 CM-TOTAL-MKUP-LY (PA-SUB) / 1000.00              40170000
402200     END-IF.                                                      40180000
402300                                                                  40190000
402400     MOVE DL-PC-DETAIL-LINE TO RR-REPORT-RECORD.                  40200000
402500     SET PI-PRINT-BACK TO TRUE.                                   40210000
402600     MOVE 1 TO PA-LINE-NO.                                        40220000
402700     PERFORM 6200-CHECK-PC-DETAIL-GT-ZERO.                        40230000
402800     IF PI-PRINT-DETAIL                                           40240000
402900         PERFORM 5000-WRITE-REPORT-LINE                           40250000
403000     END-IF.                                                      40260000
403100/                                                                 40270000
403200 3400-PRINT-MISC-YTD.                                             40280000
403300******************************************************************40290000
403400*   3400-PRINT-MISC-YTD                                          *40300000
403500*     PERFORM TO FORMAT/PRINT THE MISC HEADER LINES, THEN        *40310000
403600*     MISC DETAIL LINES, THEN THE MISC TOTAL LINE.               *40320000
403700*     FORMAT THE CURRENT-MONTH INFO TO TABLE FOR PRINTING        *40330000
403800*       AT THE BACK OF THE PAGE LATER.                           *40340000
403900*                                                                *40350000
404000*   PERFORMED BY:  2800-VENDOR-BREAK-PROCESS                     *40360000
404100******************************************************************40370000
404200                                                                  40380000
404300     SET PI-PRINT-BOTH               TO TRUE.                     40390000
404400     MOVE 1                          TO PA-LINE-NO.               40400000
404500     MOVE H10-HEADING10A             TO RR-REPORT-RECORD.         40410000
404600     PERFORM 5000-WRITE-REPORT-LINE.                              40420000
404700     MOVE H10-HEADING10B             TO RR-REPORT-RECORD.         40430000
404800     PERFORM 5000-WRITE-REPORT-LINE.                              40440000
404900     MOVE 1                          TO PA-LINE-NO.               40450000
405000                                                                  40460000
405100     MOVE 0 TO PA-SUB.                                            40470000
405200     PERFORM VARYING PA-SUB FROM 1 BY 1 UNTIL PA-SUB > 9          40480000
405300         IF CT-AP-CLASS (PA-SUB) = 0                              40490000
405400            CONTINUE                                              40500000
405500         ELSE                                                     40510000
405600             MOVE CT-MISC-CLASS (PA-SUB)      TO DL-MI-CLASS      40520000
405700             MOVE CT-MISC-CLASS-DESC (PA-SUB) TO DL-MI-CLASS-DESC 40530000
405800***** THIS YEAR **************************************************40540000
405900             COMPUTE DL-MI-GROSS-MARGN-TY ROUNDED =               40550000
406000                          CT-GROSS-MARGN-TY (PA-SUB) / 1000.00    40560000
406100             COMPUTE PV-PERCENT ROUNDED =                         40570000
406200                     CT-GROSS-MARGN-TY (PA-SUB)                   40580000
406300                   * PC-100 / CT-TOTAL-SALES-TY (PA-SUB)          40590000
406400                  ON SIZE ERROR MOVE 0 TO PV-PERCENT              40600000
406500             END-COMPUTE                                          40610000
406600             MOVE PV-PERCENT   TO DL-MI-GR-MARGN-PCT-TY           40620000
406700* J          COMPUTE PV-PERCENT ROUNDED =                         40630000
406800* J                 (CT-RETAIL-PURCH-TY (PA-SUB)                  40640000
406900* J                - CT-NET-COST-TY (PA-SUB))                     40650000
407000* J                * PC-100 / CT-RETAIL-PURCH-TY (PA-SUB)         40660000
407100* J               ON SIZE ERROR MOVE 0 TO PV-PERCENT              40670000
407200* J          END-COMPUTE                                          40680000
407300* J          MOVE PV-PERCENT   TO DL-MI-MARKON-PCT-TY             40690000
407400             COMPUTE DL-MI-END-INV-COST-TY ROUNDED =              40700000
407500                     CT-END-INV-COST-TY (PA-SUB) / 1000.00        40710000
407600             COMPUTE DL-MI-END-INV-RTL-TY ROUNDED =               40720000
407700                     CT-END-INV-RTL-TY (PA-SUB) / 1000.00         40730000
407800             COMPUTE DL-MI-SHRINK-DLR-TY ROUNDED =                40740000
407900                     CT-SHRINK-DLR-TY (PA-SUB) / 1000.00          40750000
C14666             COMPUTE PV-SHK-PERCENT ROUNDED =                     40760001
408100                     CT-SHRINK-DLR-TY (PA-SUB) * PC-100 /         40770000
408200                     CT-TOTAL-SALES-TY (PA-SUB)                   40780000
C14666                  ON SIZE ERROR MOVE ZERO TO PV-SHK-PERCENT       40790001
408400             END-COMPUTE                                          40800000
C14666             MOVE PV-SHK-PERCENT TO DL-MI-SHRINK-PCT-TY           40810001
408600             COMPUTE DL-MI-INV-ADJ-TY ROUNDED =                   40820000
408700                     CT-INV-ADJ-TY (PA-SUB) / 1000.00             40830000
408800             COMPUTE DL-MI-RET-TO-VENDR-TY ROUNDED =              40840000
408900                     CT-RET-TO-VENDR-TY (PA-SUB) / 1000.00        40850000
409000***** LAST YEAR **************************************************40860000
409100*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    40870000
409200*            IF PV-HDG-START-CCYY-LY = PC-1998                    40880000
409300             IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999         40890000
409400                 CONTINUE                                         40900000
409500             ELSE                                                 40910000
409600                 COMPUTE DL-MI-GROSS-MARGN-LY ROUNDED =           40920000
409700                         CT-GROSS-MARGN-LY (PA-SUB) / 1000.00     40930000
409800                 COMPUTE PV-PERCENT ROUNDED =                     40940000
409900                         CT-GROSS-MARGN-LY (PA-SUB)               40950000
410000                       * PC-100 / CT-TOTAL-SALES-LY (PA-SUB)      40960000
410100                      ON SIZE ERROR MOVE 0 TO PV-PERCENT          40970000
410200                 END-COMPUTE                                      40980000
410300                 MOVE PV-PERCENT TO DL-MI-GR-MARGN-PCT-LY         40990000
410400                 COMPUTE DL-MI-END-INV-RTL-LY ROUNDED =           41000000
410500                         CT-END-INV-RTL-LY (PA-SUB) / 1000.00     41010000
410600                 COMPUTE DL-MI-SHRINK-DLR-LY ROUNDED =            41020000
410700                         CT-SHRINK-DLR-LY (PA-SUB) / 1000.00      41030000
410800                 COMPUTE DL-MI-INV-ADJ-LY ROUNDED =               41040000
410900                         CT-INV-ADJ-LY (PA-SUB) / 1000.00         41050000
411000             END-IF                                               41060000
411100             MOVE DL-MI-DETAIL-LINE  TO RR-REPORT-RECORD          41070000
411200             SET PI-PRINT-FRONT      TO TRUE                      41080000
411300             MOVE 1                  TO PA-LINE-NO                41090000
411400             PERFORM 6300-CHECK-MI-DETAIL-GT-ZERO                 41100000
411500             IF PI-PRINT-DETAIL                                   41110000
411600                 PERFORM 5000-WRITE-REPORT-LINE                   41120000
411700             END-IF                                               41130000
411800         END-IF                                                   41140000
411900     END-PERFORM.                                                 41150000
412000                                                                  41160000
412100     MOVE PC-TOTAL                    TO DL-MI-TOTAL.             41170000
412200                                                                  41180000
412300*******  THIS YEAR  **********************************************41190000
412400     COMPUTE DL-MI-GROSS-MARGN-TY ROUNDED =                       41200000
412500             VT-GROSS-MARGN-TY / 1000.00.                         41210000
412600     COMPUTE PV-PERCENT ROUNDED = VT-GROSS-MARGN-TY               41220000
412700           * PC-100 / VT-TOTAL-SALES-TY                           41230000
412800          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     41240000
412900     MOVE PV-PERCENT           TO DL-MI-GR-MARGN-PCT-TY.          41250000
413000                                                                  41260000
413100* J  COMPUTE PV-PERCENT ROUNDED =                                 41270000
413200* J         (VT-RETAIL-PURCH-TY - VT-NET-COST-TY)                 41280000
413300* J        * PC-100 / VT-RETAIL-PURCH-TY                          41290000
413400* J       ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     41300000
413500* J  MOVE PV-PERCENT            TO DL-MI-MARKON-PCT-TY.           41310000
413600                                                                  41320000
413700     COMPUTE DL-MI-END-INV-COST-TY ROUNDED =                      41330000
413800             VT-END-INV-COST-TY / 1000.00.                        41340000
413900     COMPUTE DL-MI-END-INV-RTL-TY ROUNDED =                       41350000
414000             VT-END-INV-RTL-TY / 1000.00.                         41360000
414100     COMPUTE DL-MI-SHRINK-DLR-TY ROUNDED =                        41370000
414200             VT-SHRINK-DLR-TY / 1000.00.                          41380000
C14666     COMPUTE PV-SHK-PERCENT ROUNDED =                             41390001
414400             VT-SHRINK-DLR-TY * PC-100 /                          41400000
414500             VT-TOTAL-SALES-TY                                    41410000
C14666          ON SIZE ERROR MOVE ZERO TO PV-SHK-PERCENT.              41420001
C14666     MOVE PV-SHK-PERCENT          TO DL-MI-SHRINK-PCT-TY.         41430001
414800     COMPUTE DL-MI-INV-ADJ-TY ROUNDED =                           41440000
414900             VT-INV-ADJ-TY / 1000.00.                             41450000
415000     COMPUTE DL-MI-RET-TO-VENDR-TY ROUNDED =                      41460000
415100             VT-RET-TO-VENDR-TY / 1000.00.                        41470000
415200                                                                  41480000
415300*******  LAST YEAR  **********************************************41490000
415400*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    41500000
415500*    IF PV-HDG-START-CCYY-LY = PC-1998                            41510000
415600     IF PV-HDG-START-CCYY-LY = PC-1998 OR 1999                    41520000
415700         CONTINUE                                                 41530000
415800     ELSE                                                         41540000
415900         COMPUTE DL-MI-GROSS-MARGN-LY ROUNDED =                   41550000
416000                 VT-GROSS-MARGN-LY / 1000.00                      41560000
416100         COMPUTE PV-PERCENT ROUNDED = VT-GROSS-MARGN-LY           41570000
416200               * PC-100 / VT-TOTAL-SALES-LY                       41580000
416300              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  41590000
416400         END-COMPUTE                                              41600000
416500         MOVE PV-PERCENT       TO DL-MI-GR-MARGN-PCT-LY           41610000
416600         COMPUTE DL-MI-END-INV-RTL-LY ROUNDED =                   41620000
416700                 VT-END-INV-RTL-LY / 1000.00                      41630000
416800         COMPUTE DL-MI-SHRINK-DLR-LY ROUNDED =                    41640000
416900                 VT-SHRINK-DLR-LY / 1000.00                       41650000
417000         COMPUTE DL-MI-INV-ADJ-LY ROUNDED =                       41660000
417100                 VT-INV-ADJ-LY / 1000.00                          41670000
417200     END-IF.                                                      41680000
417300                                                                  41690000
417400     MOVE DL-MI-DETAIL-LINE           TO RR-REPORT-RECORD.        41700000
417500     SET PI-PRINT-FRONT               TO TRUE.                    41710000
417600     MOVE 1                           TO PA-LINE-NO.              41720000
417700     PERFORM 6300-CHECK-MI-DETAIL-GT-ZERO.                        41730000
417800     IF PI-PRINT-DETAIL                                           41740000
417900         PERFORM 5000-WRITE-REPORT-LINE                           41750000
418000     ELSE                                                         41760000
418100         MOVE DL-MISC-NO-DETAIL       TO RR-REPORT-RECORD         41770000
418200         PERFORM 5000-WRITE-REPORT-LINE                           41780000
418300     END-IF.                                                      41790000
418400     MOVE BL-BAR-LINE                 TO RR-REPORT-RECORD.        41800000
418500     MOVE 1                           TO PA-LINE-NO.              41810000
418600     PERFORM 5000-WRITE-REPORT-LINE.                              41820000
418700     PERFORM 3410-PRINT-MISC-CURR-MONTH.                          41830000
418800                                                                  41840000
418900 3410-PRINT-MISC-CURR-MONTH.                                      41850000
419000******************************************************************41860000
419100*   3410-PRINT-MISC-CURR-MONTH                                   *41870000
419200*     FORMAT THE MISC DETAIL LINE FOR THE CURRENT-MONTH          *41880000
419300*     FORMAT THE MISC TOTAL LINE FOR THE CURRENT-MONTH           *41890000
419400*     BOTH LINES ARE MOVED TO THE PRINT TABLE FOR PRINTING       *41900000
419500*        AT THE BACK OF THE PAGE LATER.                          *41910000
419600*                                                                *41920000
419700*   PERFORMED BY:  3400-PRINT-MISC.                              *41930000
419800******************************************************************41940000
419900                                                                  41950000
420000     MOVE 0 TO PA-SUB.                                            41960000
420100     PERFORM VARYING PA-SUB FROM 1 BY 1 UNTIL PA-SUB > 9          41970000
420200         IF CM-MISC-CLASS (PA-SUB) = 0                            41980000
420300             CONTINUE                                             41990000
420400         ELSE                                                     42000000
420500             PERFORM 3420-PRINT-MISC-CURR-MONTH                   42010000
420600         END-IF                                                   42020000
420700     END-PERFORM.                                                 42030000
420800                                                                  42040000
420900******  THIS YEAR *********************************************** 42050000
421000     MOVE PC-TOTAL                         TO DL-MI-TOTAL.        42060000
421100     COMPUTE DL-MI-GROSS-MARGN-TY ROUNDED =                       42070000
421200             CMT-GROSS-MARGN-TY / 1000.00.                        42080000
421300     COMPUTE PV-PERCENT ROUNDED = CMT-GROSS-MARGN-TY              42090000
421400           * PC-100 / CMT-TOTAL-SALES-TY                          42100000
421500          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     42110000
421600     MOVE PV-PERCENT           TO DL-MI-GR-MARGN-PCT-TY.          42120000
421700                                                                  42130000
421800* J  COMPUTE PV-PERCENT ROUNDED =                                 42140000
421900* J         (CMT-RETAIL-PURCH-TY - CMT-NET-COST-TY)               42150000
422000* J        * PC-100 / CMT-RETAIL-PURCH-TY                         42160000
422100* J       ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     42170000
422200* J  MOVE PV-PERCENT                  TO DL-MI-MARKON-PCT-TY.     42180000
422300                                                                  42190000
422400     COMPUTE DL-MI-END-INV-COST-TY ROUNDED =                      42200000
422500             CMT-END-INV-COST-TY / 1000.00.                       42210000
422600     COMPUTE DL-MI-END-INV-RTL-TY ROUNDED =                       42220000
422700             CMT-END-INV-RTL-TY / 1000.00.                        42230000
422800     COMPUTE DL-MI-SHRINK-DLR-TY ROUNDED =                        42240000
422900             CMT-SHRINK-DLR-TY / 1000.00.                         42250000
C14666     COMPUTE PV-SHK-PERCENT ROUNDED =                             42260001
423100             CMT-SHRINK-DLR-TY * PC-100 /                         42270000
423200             CMT-TOTAL-SALES-TY                                   42280000
C14666          ON SIZE ERROR MOVE ZERO TO PV-SHK-PERCENT.              42290001
C14666     MOVE PV-SHK-PERCENT               TO DL-MI-SHRINK-PCT-TY.    42300001
423500     COMPUTE DL-MI-INV-ADJ-TY ROUNDED =                           42310000
423600             CMT-INV-ADJ-TY / 1000.00.                            42320000
423700     COMPUTE DL-MI-RET-TO-VENDR-TY ROUNDED =                      42330000
423800             CMT-RET-TO-VENDR-TY / 1000.00.                       42340000
423900                                                                  42350000
424000******  LAST YEAR *********************************************** 42360000
424100*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    42370000
424200*    IF PV-HDG-START-CCYY-LY = PC-1998                            42380000
424300     IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                 42390000
424400         CONTINUE                                                 42400000
424500     ELSE                                                         42410000
424600         COMPUTE DL-MI-GROSS-MARGN-LY ROUNDED =                   42420000
424700                 CMT-GROSS-MARGN-LY / 1000.00                     42430000
424800         COMPUTE PV-PERCENT ROUNDED = CMT-GROSS-MARGN-LY          42440000
424900               * PC-100 / CMT-TOTAL-SALES-LY                      42450000
425000              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  42460000
425100         END-COMPUTE                                              42470000
425200         MOVE PV-PERCENT           TO DL-MI-GR-MARGN-PCT-LY       42480000
425300         COMPUTE DL-MI-END-INV-RTL-LY ROUNDED =                   42490000
425400                 CMT-END-INV-RTL-LY / 1000.00                     42500000
425500         COMPUTE DL-MI-SHRINK-DLR-LY ROUNDED =                    42510000
425600                 CMT-SHRINK-DLR-LY / 1000.00                      42520000
425700         COMPUTE DL-MI-INV-ADJ-LY ROUNDED =                       42530000
425800                 CMT-INV-ADJ-LY / 1000.00                         42540000
425900     END-IF.                                                      42550000
426000                                                                  42560000
426100     MOVE DL-MI-DETAIL-LINE             TO RR-REPORT-RECORD.      42570000
426200     SET PI-PRINT-BACK                  TO TRUE.                  42580000
426300     MOVE 1                             TO PA-LINE-NO.            42590000
426400     PERFORM 6300-CHECK-MI-DETAIL-GT-ZERO.                        42600000
426500     IF PI-PRINT-DETAIL                                           42610000
426600         PERFORM 5000-WRITE-REPORT-LINE                           42620000
426700     ELSE                                                         42630000
426800         MOVE DL-MISC-NO-DETAIL         TO RR-REPORT-RECORD       42640000
426900         PERFORM 5000-WRITE-REPORT-LINE                           42650000
427000     END-IF.                                                      42660000
427100     MOVE BL-BAR-LINE                   TO RR-REPORT-RECORD.      42670000
427200     MOVE 1                             TO PA-LINE-NO.            42680000
427300     PERFORM 5000-WRITE-REPORT-LINE.                              42690000
427400                                                                  42700000
427500 3420-PRINT-MISC-CURR-MONTH.                                      42710000
427600******************************************************************42720000
427700*   3420-PRINT-MISC-CURR-MONTH                                   *42730000
427800*     FORMAT THE MISC DETAIL LINE FOR THE CURRENT-MONTH          *42740000
427900*                                                                *42750000
428000*   PERFORMED BY:  3410-PRINT-MISC-CURR-MONTH                    *42760000
428100******************************************************************42770000
428200                                                                  42780000
428300******  THIS YEAR  ***********************************************42790000
428400     MOVE CM-MISC-CLASS (PA-SUB)            TO DL-MI-CLASS.       42800000
428500     MOVE CM-MISC-CLASS-DESC (PA-SUB)       TO DL-MI-CLASS-DESC.  42810000
428600     COMPUTE DL-MI-GROSS-MARGN-TY ROUNDED =                       42820000
428700             CM-GROSS-MARGN-TY (PA-SUB) / 1000.00.                42830000
428800     COMPUTE PV-PERCENT ROUNDED = CM-GROSS-MARGN-TY (PA-SUB)      42840000
428900           * PC-100 / CM-TOTAL-SALES-TY (PA-SUB)                  42850000
429000             ON SIZE ERROR MOVE 0 TO PV-PERCENT.                  42860000
429100     MOVE PV-PERCENT                  TO DL-MI-GR-MARGN-PCT-TY.   42870000
429200                                                                  42880000
429300* J  COMPUTE PV-PERCENT ROUNDED =                                 42890000
429400* J      (CM-RETAIL-PURCH-TY (PA-SUB) - CM-NET-COST-TY   (PA-SUB))42900000
429500* J      * PC-100 / CM-RETAIL-PURCH-TY (PA-SUB)                   42910000
429600* J        ON SIZE ERROR MOVE 0 TO PV-PERCENT.                    42920000
429700* J  MOVE PV-PERCENT                  TO DL-MI-MARKON-PCT-TY.     42930000
429800                                                                  42940000
429900     COMPUTE DL-MI-END-INV-COST-TY ROUNDED =                      42950000
430000             CM-END-INV-COST-TY (PA-SUB) / 1000.00.               42960000
430100     COMPUTE DL-MI-END-INV-RTL-TY ROUNDED =                       42970000
430200             CM-END-INV-RTL-TY (PA-SUB) / 1000.00.                42980000
430300     COMPUTE DL-MI-SHRINK-DLR-TY ROUNDED =                        42990000
430400             CM-SHRINK-DLR-TY (PA-SUB) / 1000.00.                 43000000
C14666     COMPUTE PV-SHK-PERCENT ROUNDED =                             43010001
430600             CM-SHRINK-DLR-TY (PA-SUB) * PC-100 /                 43020000
430700             CM-TOTAL-SALES-TY (PA-SUB)                           43030000
C14666          ON SIZE ERROR MOVE ZERO TO PV-SHK-PERCENT.              43040001
C14666     MOVE PV-SHK-PERCENT          TO DL-MI-SHRINK-PCT-TY.         43050001
431000     COMPUTE DL-MI-INV-ADJ-TY ROUNDED =                           43060000
431100             CM-INV-ADJ-TY (PA-SUB) / 1000.00.                    43070000
431200     COMPUTE DL-MI-RET-TO-VENDR-TY ROUNDED =                      43080000
431300             CM-RET-TO-VENDR-TY (PA-SUB) / 1000.00.               43090000
431400                                                                  43100000
431500******  LAST YEAR *********************************************** 43110000
431600*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    43120000
431700*    IF PV-HDG-START-CCYY-LY = PC-1998                            43130000
431800     IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                 43140000
431900         CONTINUE                                                 43150000
432000     ELSE                                                         43160000
432100         COMPUTE DL-MI-GROSS-MARGN-LY ROUNDED =                   43170000
432200                 CM-GROSS-MARGN-LY (PA-SUB) / 1000.00             43180000
432300         COMPUTE PV-PERCENT ROUNDED =                             43190000
432400                 CM-GROSS-MARGN-LY (PA-SUB)                       43200000
432500               * PC-100 / CM-TOTAL-SALES-LY (PA-SUB)              43210000
432600              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  43220000
432700         END-COMPUTE                                              43230000
432800         MOVE PV-PERCENT           TO DL-MI-GR-MARGN-PCT-LY       43240000
432900         COMPUTE DL-MI-END-INV-RTL-LY ROUNDED =                   43250000
433000                 CM-END-INV-RTL-LY (PA-SUB) / 1000.00             43260000
433100         COMPUTE DL-MI-SHRINK-DLR-LY ROUNDED =                    43270000
433200                 CM-SHRINK-DLR-LY (PA-SUB) / 1000.00              43280000
433300         COMPUTE DL-MI-INV-ADJ-LY ROUNDED =                       43290000
433400                 CM-INV-ADJ-LY (PA-SUB) / 1000.00                 43300000
433500     END-IF.                                                      43310000
433600                                                                  43320000
433700     MOVE DL-MI-DETAIL-LINE                 TO RR-REPORT-RECORD.  43330000
433800     SET PI-PRINT-BACK                      TO TRUE.              43340000
433900     MOVE 1                                 TO PA-LINE-NO.        43350000
434000     PERFORM 6300-CHECK-MI-DETAIL-GT-ZERO.                        43360000
434100     IF PI-PRINT-DETAIL                                           43370000
434200         PERFORM 5000-WRITE-REPORT-LINE                           43380000
434300     END-IF.                                                      43390000
434400/                                                                 43400000
434500 4000-EOF-ROUTINE.                                                43410000
434600******************************************************************43420000
434700*   4000-EOF-ROUTINE                                             *43430000
434800*   THIS PARAGRAPH DOES THE END-OF-INPUT PROCESSING BY:          *43440000
434900*       1.  PRINTING THE LAST DEPARTMENT/VENDOR PAGES            *43450000
435000*       2.  CLOSE ALL OPEN FILES                                 *43460000
435100*       3.  DISPLAY COUNTERS                                     *43470000
435200*                                                                *43480000
435300*   PERFORMED BY 0000-MAINLINE-PROCESSING.                       *43490000
435400******************************************************************43500000
435500                                                                  43510000
435600     IF PA-IN-COUNT > 0                                           43520000
435700         PERFORM 2800-VENDOR-BREAK-PROCESS                        43530000
435800         MOVE 0 TO PA-LINE-NO                                     43540000
435900         PERFORM 4100-PRINT-TOTAL-PAGE                            43550000
436000     END-IF.                                                      43560000
436100                                                                  43570000
436200     PERFORM 4400-VENDOR-TOTAL-CURRENT-MTH.                       43580000
436300*                                                                 43590000
436400     CLOSE VA-REPORT-EXTRACT-FILE                                 43600000
436500           REPORT-FILE.                                           43610000
436600                                                                  43620000
436700/                                                                 43630000
436800 4100-PRINT-TOTAL-PAGE.                                           43640000
436900******************************************************************43650000
437000*   4100-PRINT-TOTAL-PAGE                                        *43660000
437100*      PRINTS THE REPORT TOTAL PAGE                              *43670000
437200*                                                                *43680000
437300*   PERFORMED BY 4000-EOF-ROUTINE.                               *43690000
437400******************************************************************43700000
437500                                                                  43710000
437600     PERFORM 4110-HEADING-RTN.                                    43720000
437700                                                                  43730000
437800     MOVE SPACES                 TO H4-MANAGER-NMBR.              43740000
437900     MOVE PC-REPORT-TOTAL        TO H4-MANAGER-NAME.              43750000
438000     MOVE 1 TO PA-LINE-NO.                                        43760000
438100     MOVE  H4-HEADING4A          TO RR-REPORT-RECORD.             43770000
438200     PERFORM 5000-WRITE-REPORT-LINE.                              43780000
438300                                                                  43790000
438400     MOVE SPACES                 TO H4-BUYER-NMBR.                43800000
438500     MOVE SPACES                 TO H4-BUYER-NAME.                43810000
438600     MOVE 1 TO PA-LINE-NO.                                        43820000
438700     MOVE  H4-HEADING4B          TO RR-REPORT-RECORD.             43830000
438800     PERFORM 5000-WRITE-REPORT-LINE.                              43840000
438900                                                                  43850000
439000     MOVE SPACES                 TO H4-DEPT-NMBR.                 43860000
439100     MOVE SPACES                 TO H4-DEPT-DESC.                 43870000
439200     MOVE 1 TO PA-LINE-NO.                                        43880000
439300     MOVE  H4-HEADING4C          TO RR-REPORT-RECORD.             43890000
439400     PERFORM 5000-WRITE-REPORT-LINE.                              43900000
439500                                                                  43910000
439600     MOVE SPACES                 TO H5-VENDOR-NAME.               43920000
439700     MOVE 1 TO PA-LINE-NO.                                        43930000
439800     MOVE  H5-HEADING5           TO RR-REPORT-RECORD.             43940000
439900     PERFORM 5000-WRITE-REPORT-LINE.                              43950000
440000                                                                  43960000
440100     MOVE PV-HDG-DATE-TY         TO H6-DATE-RANGE-TY.             43970000
440200     MOVE PV-HDG-DATE-LY         TO H6-DATE-RANGE-LY.             43980000
440300     MOVE H6-HEADING6            TO RR-REPORT-RECORD.             43990000
440400     MOVE 1 TO PA-LINE-NO.                                        44000000
440500     PERFORM 5000-WRITE-REPORT-LINE.                              44010000
440600                                                                  44020000
440700     MOVE BL-BAR-LINE            TO RR-REPORT-RECORD.             44030000
440800     MOVE 1                      TO PA-LINE-NO.                   44040000
440900     PERFORM 5000-WRITE-REPORT-LINE.                              44050000
441000                                                                  44060000
441100     PERFORM 4120-PRINT-REPORT-AP-TOTAL.                          44070000
441200     PERFORM 4130-PRINT-REPORT-SALES-TOTAL.                       44080000
441300     PERFORM 4140-PRINT-REPORT-PC-TOTAL.                          44090000
441400     PERFORM 4150-PRINT-REPORT-MISC-TOTAL.                        44100000
441500     PERFORM 4160-PRINT-REPORT-RECAP-TOTAL.                       44110000
441600                                                                  44120000
441700/                                                                 44130000
441800 4110-HEADING-RTN.                                                44140000
441900******************************************************************44150000
442000*   4110-HEADING-RTN.                                            *44160000
442100*      PRINT HEADING LINES                                       *44170000
442200*                                                                *44180000
442300*   PERFORMED BY 2200-PROCESS-NAMES                              *44190000
442400*                4100-PRINT-TOTAL-PAGE                           *44200000
442500******************************************************************44210000
442600                                                                  44220000
442700     SET PI-PRINT-FRONT TO TRUE.                                  44230000
442800                                                                  44240000
442900     MOVE 0 TO PA-LINE-COUNT                                      44250000
443000               PA-SUB.                                            44260000
443100     ADD 1 TO PA-PAGE-COUNT.                                      44270000
443200     MOVE PA-PAGE-COUNT TO DP200O-PAGE-NUMBER.                    44280000
443300     MOVE DP200O-STANDRD-HEADER-200-COLS TO RR-REPORT-RECORD.     44290000
443400     PERFORM 5000-WRITE-REPORT-LINE.                              44300000
443500                                                                  44310000
443600     SET PI-PRINT-BACK TO TRUE.                                   44320000
443700     MOVE 0 TO PA-LINE-NO.                                        44330000
443800     ADD 1 TO PA-PAGE-COUNT.                                      44340000
443900     MOVE PA-PAGE-COUNT TO DP200O-PAGE-NUMBER.                    44350000
444000     MOVE DP200O-STANDRD-HEADER-200-COLS TO RR-REPORT-RECORD.     44360000
444100     PERFORM 5000-WRITE-REPORT-LINE.                              44370000
444200                                                                  44380000
444300     SET PI-PRINT-BOTH TO TRUE.                                   44390000
444400     MOVE H2-HEADING2A TO RR-REPORT-RECORD.                       44400000
444500     MOVE 1 TO PA-LINE-NO.                                        44410000
444600     PERFORM 5000-WRITE-REPORT-LINE.                              44420000
444700     MOVE H2-HEADING2B TO RR-REPORT-RECORD.                       44430000
444800     MOVE 1 TO PA-LINE-NO.                                        44440000
444900     PERFORM 5000-WRITE-REPORT-LINE.                              44450000
445000     MOVE H3-HEADING3 TO RR-REPORT-RECORD.                        44460000
445100     MOVE 1 TO PA-LINE-NO.                                        44470000
445200     PERFORM 5000-WRITE-REPORT-LINE.                              44480000
445300     MOVE SPACES TO RR-REPORT-RECORD.                             44490000
445400     MOVE 1 TO PA-LINE-NO.                                        44500000
445500     PERFORM 5000-WRITE-REPORT-LINE.                              44510000
445600                                                                  44520000
445700/                                                                 44530000
445800 4120-PRINT-REPORT-AP-TOTAL.                                      44540000
445900******************************************************************44550000
446000*   4120-PRINT-REPORT-AP-TOTAL                                   *44560000
446100*      PRINTS THE A/P TOTAL FOR EACH REQUEST.                    *44570000
446200*                                                                *44580000
446300*   PERFORMED BY 4100-PRINT-TOTAL-PAGE                           *44590000
446400******************************************************************44600000
446500                                                                  44610000
446600     MOVE 1 TO PA-LINE-NO.                                        44620000
446700     MOVE  H7-HEADING7A      TO RR-REPORT-RECORD.                 44630000
446800     PERFORM 5000-WRITE-REPORT-LINE.                              44640000
446900     MOVE  H7-HEADING7B      TO RR-REPORT-RECORD.                 44650000
447000     PERFORM 5000-WRITE-REPORT-LINE.                              44660000
447100     MOVE 1 TO PA-LINE-NO.                                        44670000
447200                                                                  44680000
447300                                                                  44690000
447400     MOVE PC-TOTAL                    TO DL-AP-TOTAL.             44700000
447500                                                                  44710000
447600***** THIS YEAR **************************************************44720000
447700*    COMPUTE DL-AP-GROSS-COST ROUNDED =                           44730000
447800*                RT-GROSS-COST / 1000.00.                         44740000
447900*    COMPUTE DL-AP-PURCH-ADJ-COST-TY ROUNDED =                    44750000
448000*                RT-PURCH-ADJ-COST-TY / 1000.00.                  44760000
448100*    COMPUTE DL-AP-NET-COST-TY ROUNDED =                          44770000
448200*                RT-NET-COST-TY / 1000.00.                        44780000
448300*    COMPUTE DL-AP-RTL-PURCH-TY ROUNDED =                         44790000
448400*                RT-RETAIL-PURCH-TY / 1000.00.                    44800000
448500     COMPUTE DL-AP-RECEIPTS-COST-TY ROUNDED =                     44810000
448600             RT-RECEIPTS-COST-TY / 1000.00                        44820000
448700     COMPUTE DL-AP-RECEIPTS-RETAIL-TY ROUNDED =                   44830000
448800             RT-RECEIPTS-RTL-TY / 1000.00                         44840000
448900     COMPUTE DL-AP-PURCHASE-ADJ-COST-TY ROUNDED =                 44850000
449000             RT-PURCH-ADJ-COST-TY / 1000.00                       44860000
449100     COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-TY ROUNDED =               44870000
449200             RT-PURCH-ADJ-RTL-TY / 1000.00                        44880000
449300                                                                  44890000
449400     COMPUTE PV-PERCENT ROUNDED =  RT-INITIAL-MARKON-TY * PC-100  44900000
449500           / RT-RECEIPTS-RTL-TY                                   44910000
449600*          / RT-RETAIL-PURCH-TY                                   44920000
449700         ON SIZE ERROR MOVE 0 TO PV-PERCENT.                      44930000
449800     MOVE PV-PERCENT                  TO DL-AP-INIT-MARKON-TY.    44940000
449900     COMPUTE PV-PERCENT ROUNDED =                                 44950000
450000             RT-NET-MARKON-TY  * PC-100                           44960000
450100           / RT-RETAIL-PURCH-TY                                   44970000
450200          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     44980000
450300     MOVE PV-PERCENT             TO DL-AP-NET-MARKON-TY.          44990000
450400*    COMPUTE DL-AP-PURCH-ADJ-RETAIL ROUNDED =                     45000000
450500*                  RT-PURCH-ADJ-RETAIL / 1000.00.                 45010000
450600                                                                  45020000
450700***** LAST YEAR **************************************************45030000
450800*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            45040000
450900     IF PV-HDG-START-CCYY-LY = PC-1998                            45050000
451000         CONTINUE                                                 45060000
451100     ELSE                                                         45070000
451200*    COMPUTE DL-AP-PURCH-ADJ-COST-LY ROUNDED =                    45080000
451300*                  RT-PURCH-ADJ-COST-LY / 1000.00.                45090000
451400*    COMPUTE DL-AP-NET-COST-LY ROUNDED =                          45100000
451500*                RT-NET-COST-LY   / 1000.00.                      45110000
451600*    COMPUTE DL-AP-RTL-PURCH-LY ROUNDED =                         45120000
451700*                RT-RETAIL-PURCH-LY   / 1000.00.                  45130000
451800         COMPUTE DL-AP-RECEIPTS-COST-LY ROUNDED =                 45140000
451900                 RT-RECEIPTS-COST-LY / 1000.00                    45150000
452000         COMPUTE DL-AP-RECEIPTS-RETAIL-LY ROUNDED =               45160000
452100                 RT-RECEIPTS-RTL-LY / 1000.00                     45170000
452200         COMPUTE DL-AP-PURCHASE-ADJ-COST-LY ROUNDED =             45180000
452300                 RT-PURCH-ADJ-COST-LY / 1000.00                   45190000
452400         COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-LY ROUNDED =           45200000
452500                 RT-PURCH-ADJ-RTL-LY / 1000.00                    45210000
452600         COMPUTE PV-PERCENT ROUNDED =                             45220000
452700                 RT-INITIAL-MARKON-LY * PC-100                    45230000
452800               / RT-RECEIPTS-RTL-LY                               45240000
452900*              / RT-RETAIL-PURCH-LY                               45250000
453000             ON SIZE ERROR MOVE 0 TO PV-PERCENT                   45260000
453100         END-COMPUTE                                              45270000
453200         MOVE PV-PERCENT      TO DL-AP-INIT-MARKON-LY             45280000
453300         COMPUTE PV-PERCENT ROUNDED =                             45290000
453400                 RT-NET-MARKON-LY * PC-100                        45300000
453500               / RT-RETAIL-PURCH-LY                               45310000
453600              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  45320000
453700         END-COMPUTE                                              45330000
453800         MOVE PV-PERCENT       TO DL-AP-NET-MARKON-LY             45340000
453900     END-IF.                                                      45350000
454000                                                                  45360000
454100     MOVE DL-AP-DETAIL-LINE TO RR-REPORT-RECORD.                  45370000
454200     MOVE 1 TO PA-LINE-NO.                                        45380000
454300     PERFORM 6000-CHECK-AP-DETAIL-GT-ZERO.                        45390000
454400     IF PI-PRINT-DETAIL                                           45400000
454500         PERFORM 5000-WRITE-REPORT-LINE                           45410000
454600     END-IF.                                                      45420000
454700     MOVE BL-BAR-LINE TO RR-REPORT-RECORD.                        45430000
454800     MOVE 1 TO PA-LINE-NO.                                        45440000
454900     PERFORM 5000-WRITE-REPORT-LINE.                              45450000
455000                                                                  45460000
455100/                                                                 45470000
455200 4130-PRINT-REPORT-SALES-TOTAL.                                   45480000
455300******************************************************************45490000
455400*   4130-PRINT-REPORT-SALES-TOTAL                                *45500000
455500*      PRINTS THE SALES-TOTAL FOR EACH REQUEST                   *45510000
455600*                                                                *45520000
455700*   PERFORMED BY 4100-PRINT-TOTAL-PAGE                           *45530000
455800******************************************************************45540000
455900                                                                  45550000
456000     MOVE 1 TO PA-LINE-NO.                                        45560000
456100     MOVE  H8-HEADING8A      TO RR-REPORT-RECORD.                 45570000
456200     PERFORM 5000-WRITE-REPORT-LINE.                              45580000
456300     MOVE  H8-HEADING8B      TO RR-REPORT-RECORD.                 45590000
456400     PERFORM 5000-WRITE-REPORT-LINE.                              45600000
456500     MOVE 1 TO PA-LINE-NO.                                        45610000
456600                                                                  45620000
456700     MOVE PC-TOTAL                    TO DL-SL-TOTAL.             45630000
456800                                                                  45640000
456900***** THIS YEAR **************************************************45650000
457000     COMPUTE DL-SL-TOTAL-SALES-TY ROUNDED =                       45660000
457100               RT-TOTAL-SALES-TY / 1000.00                        45670000
457200     COMPUTE DL-SL-REGULAR-SALES-TY ROUNDED =                     45680000
457300               RT-REGULAR-SALES-TY / 1000.00                      45690000
457400     COMPUTE DL-SL-PROMO-SALES-TY ROUNDED =                       45700000
457500               RT-PROMO-SALES-TY / 1000.00                        45710000
457600     COMPUTE DL-SL-GOLDSTAR-SALES-TY ROUNDED =                    45720000
457700               RT-GOLDSTAR-SALES-TY / 1000.00                     45730000
457800     COMPUTE DL-SL-CLEAR-SALES-TY ROUNDED =                       45740000
457900               RT-CLEAR-SALES-TY / 1000.00                        45750000
458000     COMPUTE DL-SL-UNKWN-SALES-TY ROUNDED =                       45760000
458100             RT-UNKWN-SALES-TY / 1000.00                          45770000
458200                                                                  45780000
458300***** LAST YEAR **************************************************45790000
458400*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            45800000
458500     IF PV-HDG-START-CCYY-LY = PC-1998                            45810000
458600         CONTINUE                                                 45820000
458700     ELSE                                                         45830000
458800         COMPUTE DL-SL-TOTAL-SALES-LY ROUNDED =                   45840000
458900                 RT-TOTAL-SALES-LY / 1000.00                      45850000
459000         COMPUTE DL-SL-REGULAR-SALES-LY ROUNDED =                 45860000
459100                 RT-REGULAR-SALES-LY / 1000.00                    45870000
459200         COMPUTE DL-SL-PROMO-SALES-LY ROUNDED =                   45880000
459300                 RT-PROMO-SALES-LY / 1000.00                      45890000
459400         COMPUTE DL-SL-GOLDSTAR-SALES-LY ROUNDED =                45900000
459500                 RT-GOLDSTAR-SALES-LY / 1000.00                   45910000
459600         COMPUTE DL-SL-CLEAR-SALES-LY ROUNDED =                   45920000
459700                 RT-CLEAR-SALES-LY / 1000.00                      45930000
459800         COMPUTE DL-SL-UNKWN-SALES-LY ROUNDED =                   45940000
459900                 RT-UNKWN-SALES-LY / 1000.00                      45950000
460000     END-IF.                                                      45960000
460100                                                                  45970000
460200     MOVE DL-SL-DETAIL-LINE TO RR-REPORT-RECORD.                  45980000
460300     MOVE 1 TO PA-LINE-NO.                                        45990000
460400     PERFORM 6100-CHECK-SL-DETAIL-GT-ZERO                         46000000
460500     IF PI-PRINT-DETAIL                                           46010000
460600         PERFORM 5000-WRITE-REPORT-LINE                           46020000
460700     END-IF.                                                      46030000
460800     MOVE BL-BAR-LINE TO RR-REPORT-RECORD.                        46040000
460900     MOVE 1 TO PA-LINE-NO.                                        46050000
461000     PERFORM 5000-WRITE-REPORT-LINE.                              46060000
461100                                                                  46070000
461200/                                                                 46080000
461300 4140-PRINT-REPORT-PC-TOTAL.                                      46090000
461400******************************************************************46100000
461500*   4140-PRINT-REPORT-PC-TOTAL                                   *46110000
461600*      PRINTS THE PC-TOTAL-FOR EACH REQUEST                      *46120000
461700*                                                                *46130000
461800*   PERFORMED BY 4100-PRINT-TOTAL-PAGE                           *46140000
461900******************************************************************46150000
462000                                                                  46160000
462100     MOVE 1 TO PA-LINE-NO.                                        46170000
462200     MOVE  H9-HEADING9A      TO RR-REPORT-RECORD.                 46180000
462300     PERFORM 5000-WRITE-REPORT-LINE.                              46190000
462400     MOVE  H9-HEADING9B      TO RR-REPORT-RECORD.                 46200000
462500     PERFORM 5000-WRITE-REPORT-LINE.                              46210000
462600     MOVE 1 TO PA-LINE-NO.                                        46220000
462700                                                                  46230000
462800     MOVE PC-TOTAL                    TO DL-PC-TOTAL.             46240000
462900                                                                  46250000
463000***** THIS YEAR **************************************************46260000
463100     COMPUTE DL-PC-TOTAL-MKDN-TY ROUNDED =                        46270000
463200             RT-TOTAL-MKDN-TY / 1000.00.                          46280000
463300     COMPUTE DL-PC-STORE-MKDN-TY ROUNDED =                        46290000
463400             RT-STORE-MKDN-TY / 1000.00.                          46300000
463500     COMPUTE DL-PC-BUYER-MKDN-TY ROUNDED =                        46310000
463600             RT-BUYER-MKDN-TY / 1000.00.                          46320000
463700     COMPUTE DL-PC-PLU-MKDN-TY ROUNDED =                          46330000
463800             RT-PLU-MKDN-TY / 1000.00.                            46340000
463900     COMPUTE DL-PC-PERM-MKDN-TY ROUNDED =                         46350000
464000             RT-PERM-MKDN-TY / 1000.00.                           46360000
464100     COMPUTE DL-PC-OTHER-MKDN-TY ROUNDED =                        46370000
464200             RT-OTHER-MKDN-TY / 1000.00.                          46380000
464300     COMPUTE PV-PERCENT ROUNDED = RT-TOTAL-MKDN-TY                46390000
464400           * PC-100 / RT-TOTAL-SALES-TY                           46400000
464500          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     46410000
464600     MOVE PV-PERCENT                  TO DL-PC-MKDN-PCT-SLS-TY.   46420000
464700     COMPUTE DL-PC-TOTAL-MKUP-TY ROUNDED =                        46430000
464800             RT-TOTAL-MKUP-TY / 1000.00.                          46440000
464900     COMPUTE DL-PC-DEBIT-ALLOW-TY ROUNDED =                       46450000
465000             RT-DEBIT-ALLOW-TY / 1000.00.                         46460000
465100                                                                  46470000
465200***** LAST YEAR **************************************************46480000
465300*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    46490000
465400*    IF PV-HDG-START-CCYY-LY = PC-1998                            46500000
465500     IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                 46510000
465600         CONTINUE                                                 46520000
465700     ELSE                                                         46530000
465800         COMPUTE DL-PC-TOTAL-MKDN-LY ROUNDED =                    46540000
465900                 RT-TOTAL-MKDN-LY / 1000.00                       46550000
466000         COMPUTE PV-PERCENT ROUNDED =                             46560000
466100                 RT-TOTAL-MKDN-LY * PC-100                        46570000
466200               / RT-TOTAL-SALES-LY                                46580000
466300              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  46590000
466400         END-COMPUTE                                              46600000
466500         MOVE PV-PERCENT TO DL-PC-MKDN-PCT-SLS-LY                 46610000
466600         COMPUTE DL-PC-PLU-MKDN-LY ROUNDED =                      46620000
466700                 RT-PLU-MKDN-LY / 1000.00                         46630000
466800         COMPUTE DL-PC-PERM-MKDN-LY ROUNDED =                     46640000
466900                 RT-PERM-MKDN-LY / 1000.00                        46650000
467000         COMPUTE DL-PC-OTHER-MKDN-LY ROUNDED =                    46660000
467100                 RT-OTHER-MKDN-LY / 1000.00                       46670000
467200         COMPUTE DL-PC-TOTAL-MKUP-LY ROUNDED =                    46680000
467300                 RT-TOTAL-MKUP-LY / 1000.00                       46690000
467400     END-IF.                                                      46700000
467500                                                                  46710000
467600     MOVE DL-PC-DETAIL-LINE TO RR-REPORT-RECORD.                  46720000
467700     SET PI-PRINT-FRONT TO TRUE.                                  46730000
467800     MOVE 1 TO PA-LINE-NO.                                        46740000
467900     PERFORM 6200-CHECK-PC-DETAIL-GT-ZERO.                        46750000
468000     IF PI-PRINT-DETAIL                                           46760000
468100         PERFORM 5000-WRITE-REPORT-LINE                           46770000
468200     END-IF.                                                      46780000
468300     MOVE BL-BAR-LINE TO RR-REPORT-RECORD.                        46790000
468400     MOVE 1 TO PA-LINE-NO.                                        46800000
468500     PERFORM 5000-WRITE-REPORT-LINE.                              46810000
468600                                                                  46820000
468700/                                                                 46830000
468800 4150-PRINT-REPORT-MISC-TOTAL.                                    46840000
468900******************************************************************46850000
469000*   4150-PRINT-REPORT-MISC-TOTAL                                 *46860000
469100*      PRINTS THE MISC-TOTAL FOR EACH REQUEST                    *46870000
469200*                                                                *46880000
469300*   PERFORMED BY 4100-PRINT-TOTAL-PAGE                           *46890000
469400******************************************************************46900000
469500                                                                  46910000
469600     MOVE 1                           TO PA-LINE-NO.              46920000
469700     MOVE  H10-HEADING10A             TO RR-REPORT-RECORD.        46930000
469800     PERFORM 5000-WRITE-REPORT-LINE.                              46940000
469900     MOVE  H10-HEADING10B             TO RR-REPORT-RECORD.        46950000
470000     PERFORM 5000-WRITE-REPORT-LINE.                              46960000
470100     MOVE 1                           TO PA-LINE-NO.              46970000
470200     MOVE PC-TOTAL                    TO DL-MI-TOTAL.             46980000
470300                                                                  46990000
470400*****  THIS YEAR  ************************************************47000000
470500*-- EXCLUDE AMOUNTS FROM UNKNOWN VENDOR                           47010000
470600     COMPUTE DL-MI-GROSS-MARGN-TY ROUNDED =                       47020000
470700             RT-GROSS-MARGN-TY / 1000.00.                         47030000
470800*    COMPUTE PV-PERCENT ROUNDED = RT-GROSS-MARGN-TY               47040000
470900*                          * PC-100 / RT-TOTAL-SALES-TY           47050000
471000     COMPUTE PV-PERCENT ROUNDED =                                 47060000
471100           ((RT-GROSS-MARGN-TY - UVRT-GROSS-MARGN-TY)             47070000
471200           * PC-100) / (RT-TOTAL-SALES-TY - UVRT-TOTAL-SALES-TY)  47080000
471300          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     47090000
471400     MOVE PV-PERCENT           TO DL-MI-GR-MARGN-PCT-TY.          47100000
471500                                                                  47110000
471600* J  COMPUTE PV-PERCENT ROUNDED =                                 47120000
471700* J         (RT-RETAIL-PURCH-TY - RT-NET-COST-TY)                 47130000
471800* J        * PC-100 / RT-RETAIL-PURCH-TY                          47140000
471900* J       ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     47150000
472000* J  MOVE PV-PERCENT                  TO DL-MI-MARKON-PCT-TY.     47160000
472100                                                                  47170000
472200     COMPUTE DL-MI-END-INV-COST-TY ROUNDED =                      47180000
472300             RT-END-INV-COST-TY / 1000.00.                        47190000
472400     COMPUTE DL-MI-END-INV-RTL-TY ROUNDED =                       47200000
472500             RT-END-INV-RTL-TY / 1000.00.                         47210000
472600     COMPUTE DL-MI-SHRINK-DLR-TY ROUNDED =                        47220000
472700             RT-SHRINK-DLR-TY / 1000.00.                          47230000
C14666     COMPUTE PV-SHK-PERCENT ROUNDED =                             47240001
472900             RT-SHRINK-DLR-TY * PC-100 /                          47250000
473000             RT-TOTAL-SALES-TY                                    47260000
C14666          ON SIZE ERROR MOVE ZERO TO PV-SHK-PERCENT.              47270001
C14666     MOVE PV-SHK-PERCENT               TO DL-MI-SHRINK-PCT-TY.    47280001
473300     COMPUTE DL-MI-INV-ADJ-TY ROUNDED =                           47290000
473400             RT-INV-ADJ-TY / 1000.00.                             47300000
473500     COMPUTE DL-MI-RET-TO-VENDR-TY ROUNDED =                      47310000
473600             RT-RET-TO-VENDR-TY / 1000.00.                        47320000
473700                                                                  47330000
473800*****  LAST YEAR  ************************************************47340000
473900*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    47350000
474000*    IF PV-HDG-START-CCYY-LY = PC-1998                            47360000
474100     IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                 47370000
474200         CONTINUE                                                 47380000
474300     ELSE                                                         47390000
474400         COMPUTE DL-MI-GROSS-MARGN-LY ROUNDED =                   47400000
474500                 RT-GROSS-MARGN-LY / 1000.00                      47410000
474600                                                                  47420000
474700*    COMPUTE PV-PERCENT ROUNDED = RT-GROSS-MARGN-LY               47430000
474800*                          * PC-100 / RT-TOTAL-SALES-LY           47440000
474900*                          ON SIZE ERROR MOVE 0 TO PV-PERCENT.    47450000
475000*-- SUBTRACT UNKNOWN VENDOR AMOUNTS FROM CALC                     47460000
475100         COMPUTE PV-PERCENT ROUNDED =                             47470000
475200               ((RT-GROSS-MARGN-LY - UVRT-GROSS-MARGN-LY)         47480000
475300               * PC-100)                                          47490000
475400              / (RT-TOTAL-SALES-LY - UVRT-TOTAL-SALES-LY)         47500000
475500         MOVE PV-PERCENT TO DL-MI-GR-MARGN-PCT-LY                 47510000
475600                                                                  47520000
475700         COMPUTE DL-MI-END-INV-RTL-LY ROUNDED =                   47530000
475800                 RT-END-INV-RTL-LY / 1000.00                      47540000
475900         COMPUTE DL-MI-SHRINK-DLR-LY ROUNDED =                    47550000
476000                 RT-SHRINK-DLR-LY / 1000.00                       47560000
476100         COMPUTE DL-MI-INV-ADJ-LY ROUNDED =                       47570000
476200                 RT-INV-ADJ-LY / 1000.00                          47580000
476300     END-IF.                                                      47590000
476400                                                                  47600000
476500     MOVE DL-MI-DETAIL-LINE TO RR-REPORT-RECORD.                  47610000
476600     SET PI-PRINT-FRONT TO TRUE.                                  47620000
476700     MOVE 1 TO PA-LINE-NO.                                        47630000
476800     PERFORM 6300-CHECK-MI-DETAIL-GT-ZERO.                        47640000
476900     IF PI-PRINT-DETAIL                                           47650000
477000         PERFORM 5000-WRITE-REPORT-LINE                           47660000
477100     END-IF.                                                      47670000
477200     MOVE BL-BAR-LINE TO RR-REPORT-RECORD.                        47680000
477300     MOVE 1 TO PA-LINE-NO.                                        47690000
477400     PERFORM 5000-WRITE-REPORT-LINE.                              47700000
477500                                                                  47710000
477600/                                                                 47720000
477700 4160-PRINT-REPORT-RECAP-TOTAL.                                   47730000
477800******************************************************************47740000
477900*   4160-PRINT-REPORT-RECAP-TOTAL                                *47750000
478000*      PRINTS THE RECAP-TOTAL FOR EACH REQUEST                   *47760000
478100*                                                                *47770000
478200*   PERFORMED BY 4100-PRINT-TOTAL-PAGE                           *47780000
478300******************************************************************47790000
478400                                                                  47800000
478500     MOVE PV-HDG-DATE-TY          TO H6-DATE-RANGE-TY.            47810000
478600     MOVE PV-HDG-DATE-LY          TO H6-DATE-RANGE-LY.            47820000
478700     MOVE H6-HEADING6             TO RR-REPORT-RECORD.            47830000
478800     MOVE 1                       TO PA-LINE-NO.                  47840000
478900     PERFORM 5000-WRITE-REPORT-LINE.                              47850000
479000                                                                  47860000
479100     MOVE PV-MON-DATE-TY          TO H6-DATE-RANGE-TY.            47870000
479200     MOVE PV-MON-DATE-LY          TO H6-DATE-RANGE-LY.            47880000
479300     SET PI-PRINT-BACK            TO TRUE.                        47890000
479400     MOVE H6-HEADING6             TO RR-REPORT-RECORD.            47900000
479500     MOVE 1                       TO PA-LINE-NO.                  47910000
479600     PERFORM 5000-WRITE-REPORT-LINE.                              47920000
479700                                                                  47930000
479800     SET PI-PRINT-BOTH TO TRUE.                                   47940000
479900     MOVE BL-BAR-LINE             TO RR-REPORT-RECORD.            47950000
480000     MOVE 1                       TO PA-LINE-NO.                  47960000
480100     PERFORM 5000-WRITE-REPORT-LINE.                              47970000
480200     MOVE H11-HEADING11A          TO RR-REPORT-RECORD             47980000
480300     PERFORM 5000-WRITE-REPORT-LINE.                              47990000
480400     MOVE H11-HEADING11B          TO RR-REPORT-RECORD             48000000
480500     PERFORM 5000-WRITE-REPORT-LINE.                              48010000
480600                                                                  48020000
480700     MOVE PC-TOTAL                 TO DL-SR-TOTAL.                48030000
480800                                                                  48040000
480900*****  THIS YEAR  ************************************************48050000
481000*    COMPUTE DL-SR-GROSS-COST ROUNDED =                           48060000
481100*                           RT-GROSS-COST / 1000.00.              48070000
481200*    COMPUTE DL-SR-PURCH-ADJ-COST-TY ROUNDED =                    48080000
481300*                           RT-PURCH-ADJ-COST-TY / 1000.00.       48090000
481400*    COMPUTE DL-SR-NET-COST-TY ROUNDED =                          48100000
481500*                           RT-NET-COST-TY / 1000.00.             48110000
481600*    COMPUTE DL-SR-RETAIL-PURCH-TY ROUNDED =                      48120000
481700*                           RT-RETAIL-PURCH-TY / 1000.00.         48130000
481800     COMPUTE DL-SR-RECEIPTS-COST-TY ROUNDED =                     48140000
481900             RT-RECEIPTS-COST-TY / 1000.00.                       48150000
482000     COMPUTE DL-SR-RECEIPTS-RETAIL-TY ROUNDED =                   48160000
482100             RT-RECEIPTS-RTL-TY / 1000.00.                        48170000
482200     COMPUTE DL-SR-PURCHASE-ADJ-COST-TY ROUNDED =                 48180000
482300             RT-PURCH-ADJ-COST-TY / 1000.00.                      48190000
482400     COMPUTE DL-SR-PURCHASE-ADJ-RETAIL-TY ROUNDED =               48200000
482500             RT-PURCH-ADJ-RTL-TY / 1000.00.                       48210000
482600                                                                  48220000
482700*-- SUBTRACT THE UNKNOWN VENDOR PORTION FROM THE CUM TO DATES     48230000
482800*-- TO BRING THE CUM-MKUP PCT MORE IN LINE WITH LEDGER            48240000
482900     SUBTRACT UVRT-STD-PURCH-RETAIL-TY FROM                       48250000
483000              RT-CUM-TO-DATE-PURCH-RETAIL-TY.                     48260000
483100     SUBTRACT UVRT-STD-PURCH-COST-TY FROM                         48270000
483200              RT-CUM-TO-DATE-PURCH-COST-TY.                       48280000
483300     COMPUTE PV-PERCENT ROUNDED =                                 48290000
483400           ( RT-CUM-TO-DATE-PURCH-RETAIL-TY                       48300000
483500           - RT-CUM-TO-DATE-PURCH-COST-TY ) * 100.00              48310000
483600           / RT-CUM-TO-DATE-PURCH-RETAIL-TY                       48320000
483700          ON SIZE ERROR MOVE 100 TO PV-PERCENT.                   48330000
483800     MOVE PV-PERCENT             TO DL-SR-CUMM-MARKUP-PCT-TY.     48340000
483900     COMPUTE DL-SR-TOTAL-SALES-TY ROUNDED =                       48350000
484000             RT-TOTAL-SALES-TY / 1000.00.                         48360000
484100     COMPUTE DL-SR-TOTAL-MKDN-TY ROUNDED =                        48370000
484200             RT-TOTAL-MKDN-TY / 1000.00.                          48380000
484300     COMPUTE PV-PERCENT ROUNDED = RT-TOTAL-MKDN-TY * PC-100       48390000
484400           / RT-TOTAL-SALES-TY                                    48400000
484500          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     48410000
484600     MOVE PV-PERCENT           TO DL-SR-TOTAL-MKDN-PCT-TY.        48420000
484700*    COMPUTE PV-PERCENT ROUNDED = RT-GROSS-MARGN-TY               48430000
484800*                           * PC-100 / RT-TOTAL-SALES-TY          48440000
484900*                           ON SIZE ERROR MOVE 0 TO PV-PERCENT.   48450000
485000     COMPUTE PV-PERCENT ROUNDED =                                 48460000
485100           ((RT-GROSS-MARGN-TY - UVRT-GROSS-MARGN-TY)             48470000
485200           * PC-100) / (RT-TOTAL-SALES-TY - UVRT-TOTAL-SALES-TY)  48480000
485300          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     48490000
485400     MOVE PV-PERCENT               TO DL-SR-GROSS-MARGN-PCT-TY.   48500000
485500     COMPUTE DL-SR-END-INV-RTL-TY ROUNDED =                       48510000
485600             RT-END-INV-RTL-TY  / 1000.00.                        48520000
485700                                                                  48530000
485800*****  LAST YEAR  ************************************************48540000
485900*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    48550000
486000*    IF PV-HDG-START-CCYY-LY = PC-1998                            48560000
486100     IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                 48570000
486200         CONTINUE                                                 48580000
486300     ELSE                                                         48590000
486400         COMPUTE DL-SR-NET-COST-LY ROUNDED =                      48600000
486500                 RT-NET-COST-LY / 1000.00                         48610000
486600         COMPUTE DL-SR-RETAIL-PURCH-LY ROUNDED =                  48620000
486700                 RT-RETAIL-PURCH-LY / 1000.00                     48630000
486800*-- SUBTRACT THE UNKNOWN VENDOR PORTION FROM THE CUM TO DATES     48640000
486900*-- TO BRING THE CUM-MKUP PCT MORE IN LINE WITH LEDGER            48650000
487000         SUBTRACT UVRT-STD-PURCH-RETAIL-LY FROM                   48660000
487100                  RT-CUM-TO-DATE-PURCH-RETAIL-LY                  48670000
487200         SUBTRACT UVRT-STD-PURCH-COST-LY FROM                     48680000
487300                  RT-CUM-TO-DATE-PURCH-COST-LY                    48690000
487400         COMPUTE PV-PERCENT ROUNDED =                             48700000
487500               ( RT-CUM-TO-DATE-PURCH-RETAIL-LY                   48710000
487600               - RT-CUM-TO-DATE-PURCH-COST-LY ) * 100.00          48720000
487700               / RT-CUM-TO-DATE-PURCH-RETAIL-LY                   48730000
487800              ON SIZE ERROR MOVE 100 TO PV-PERCENT                48740000
487900         END-COMPUTE                                              48750000
488000         MOVE PV-PERCENT           TO DL-SR-CUMM-MARKUP-PCT-LY    48760000
488100         COMPUTE DL-SR-TOTAL-SALES-LY ROUNDED =                   48770000
488200                 RT-TOTAL-SALES-LY / 1000.00                      48780000
488300         COMPUTE DL-SR-TOTAL-MKDN-LY ROUNDED =                    48790000
488400                 RT-TOTAL-MKDN-LY / 1000.00                       48800000
488500*    COMPUTE PV-PERCENT ROUNDED = RT-GROSS-MARGN-LY               48810000
488600*                             * PC-100 / RT-TOTAL-SALES-LY        48820000
488700*                             ON SIZE ERROR MOVE 0 TO PV-PERCENT. 48830000
488800         COMPUTE PV-PERCENT ROUNDED =                             48840000
488900               ((RT-GROSS-MARGN-LY - UVRT-GROSS-MARGN-LY)         48850000
489000               * PC-100)                                          48860000
489100              / (RT-TOTAL-SALES-LY - UVRT-TOTAL-SALES-LY)         48870000
489200              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  48880000
489300         END-COMPUTE                                              48890000
489400         MOVE PV-PERCENT           TO DL-SR-GROSS-MARGN-PCT-LY    48900000
489500         COMPUTE DL-SR-END-INV-RTL-LY ROUNDED =                   48910000
489600                 RT-END-INV-RTL-LY / 1000.00                      48920000
489700     END-IF.                                                      48930000
489800                                                                  48940000
489900     MOVE DL-SR-DETAIL-LINE  TO RR-REPORT-RECORD.                 48950000
490000     MOVE 1                  TO PA-LINE-NO.                       48960000
490100     PERFORM 6400-CHECK-SR-DETAIL-GT-ZERO.                        48970000
490200     IF PI-PRINT-DETAIL                                           48980000
490300         PERFORM 5000-WRITE-REPORT-LINE                           48990000
490400     END-IF.                                                      49000000
490500                                                                  49010000
490600/                                                                 49020000
490700 4200-PRINT-MISC-VENDOR.                                          49030000
490800******************************************************************49040000
490900*   4200-PRINT-MISC-VENDOR                                       *49050000
491000*      PRINTS THE MISCELLANEOUS VENDOR REPORT PAGES.             *49060000
491100*                                                                *49070000
491200*   PERFORMED BY 4000-EOF-ROUTINE.                               *49080000
491300******************************************************************49090000
491400                                                                  49100000
491500     MOVE 'MISCELLANEOUS'        TO H5-VENDOR-NAME.               49110000
491600     PERFORM 2200-PROCESS-NAMES.                                  49120000
491700     PERFORM 4220-PRINT-MISC-AP-TOTAL.                            49130000
491800     PERFORM 4230-PRINT-MISC-SALES-TOTAL.                         49140000
491900     PERFORM 4240-PRINT-MISC-PC-TOTAL.                            49150000
492000     PERFORM 4250-PRINT-MISC-MISC-TOTAL.                          49160000
492100     PERFORM 4260-PRINT-MISC-RECAP-TOTAL.                         49170000
492200     PERFORM 2830-PRINT-BACK-PAGE.                                49180000
492300                                                                  49190000
492400/                                                                 49200000
492500 4220-PRINT-MISC-AP-TOTAL.                                        49210000
492600******************************************************************49220000
492700*   4220-PRINT-MISC-AP-TOTAL                                     *49230000
492800*      PRINTS THE A/P TOTAL FOR EACH REQUEST.                    *49240000
492900*                                                                *49250000
493000*   PERFORMED BY 4200-PRINT-TOTAL-PAGE                           *49260000
493100******************************************************************49270000
493200                                                                  49280000
493300     SET PI-PRINT-BOTH               TO TRUE.                     49290000
493400     MOVE 1 TO PA-LINE-NO.                                        49300000
493500     MOVE  H7-HEADING7A      TO RR-REPORT-RECORD.                 49310000
493600     PERFORM 5000-WRITE-REPORT-LINE.                              49320000
493700     MOVE  H7-HEADING7B      TO RR-REPORT-RECORD.                 49330000
493800     PERFORM 5000-WRITE-REPORT-LINE.                              49340000
493900     MOVE 1 TO PA-LINE-NO.                                        49350000
494000                                                                  49360000
494100                                                                  49370000
494200     MOVE PC-TOTAL                    TO DL-AP-TOTAL.             49380000
494300                                                                  49390000
494400***** THIS YEAR **************************************************49400000
494500*    COMPUTE DL-AP-GROSS-COST ROUNDED =                           49410000
494600*                MVT-GROSS-COST / 1000.00.                        49420000
494700*    COMPUTE DL-AP-PURCH-ADJ-COST-TY ROUNDED =                    49430000
494800*                MVT-PURCH-ADJ-COST-TY / 1000.00.                 49440000
494900*    COMPUTE DL-AP-NET-COST-TY ROUNDED =                          49450000
495000*                MVT-NET-COST-TY / 1000.00.                       49460000
495100*    COMPUTE DL-AP-RTL-PURCH-TY ROUNDED =                         49470000
495200*                MVT-RETAIL-PURCH-TY / 1000.00.                   49480000
495300                                                                  49490000
495400     COMPUTE DL-AP-RECEIPTS-COST-TY ROUNDED =                     49500000
495500             MVT-RECEIPTS-COST-TY  / 1000.00.                     49510000
495600     COMPUTE DL-AP-RECEIPTS-RETAIL-TY ROUNDED =                   49520000
495700             MVT-RECEIPTS-RTL-TY   / 1000.00.                     49530000
495800     COMPUTE DL-AP-PURCHASE-ADJ-COST-TY ROUNDED =                 49540000
495900             MVT-PURCH-ADJ-COST-TY  / 1000.00.                    49550000
496000     COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-TY ROUNDED =               49560000
496100             MVT-PURCH-ADJ-RTL-TY  / 1000.00.                     49570000
496200                                                                  49580000
496300     COMPUTE PV-PERCENT ROUNDED =  MVT-INITIAL-MARKON-TY * PC-100 49590000
496400           / MVT-RECEIPTS-RTL-TY                                  49600000
496500*          / MVT-RETAIL-PURCH-TY                                  49610000
496600          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     49620000
496700     MOVE PV-PERCENT                  TO DL-AP-INIT-MARKON-TY.    49630000
496800     COMPUTE PV-PERCENT ROUNDED =                                 49640000
496900             MVT-NET-MARKON-TY * PC-100                           49650000
497000           / MVT-RETAIL-PURCH-TY                                  49660000
497100          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     49670000
497200     MOVE PV-PERCENT             TO DL-AP-NET-MARKON-TY.          49680000
497300*    COMPUTE DL-AP-PURCH-ADJ-RETAIL ROUNDED =                     49690000
497400*                  MVT-PURCH-ADJ-RETAIL / 1000.00.                49700000
497500                                                                  49710000
497600***** LAST YEAR **************************************************49720000
497700*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            49730000
497800     IF PV-HDG-START-CCYY-LY = PC-1998                            49740000
497900         CONTINUE                                                 49750000
498000     ELSE                                                         49760000
498100*    COMPUTE DL-AP-PURCH-ADJ-COST-LY ROUNDED =                    49770000
498200*                  MVT-PURCH-ADJ-COST-LY / 1000.00.               49780000
498300*    COMPUTE DL-AP-NET-COST-LY ROUNDED =                          49790000
498400*                MVT-NET-COST-LY  / 1000.00.                      49800000
498500*    COMPUTE DL-AP-RTL-PURCH-LY ROUNDED =                         49810000
498600*                MVT-RETAIL-PURCH-LY  / 1000.00.                  49820000
498700         COMPUTE DL-AP-RECEIPTS-COST-LY ROUNDED =                 49830000
498800                 MVT-RECEIPTS-COST-LY / 1000.00                   49840000
498900         COMPUTE DL-AP-RECEIPTS-RETAIL-LY ROUNDED =               49850000
499000                 MVT-RECEIPTS-RTL-LY / 1000.00                    49860000
499100         COMPUTE DL-AP-PURCHASE-ADJ-COST-LY ROUNDED =             49870000
499200                 MVT-PURCH-ADJ-COST-LY / 1000.00                  49880000
499300         COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-LY ROUNDED =           49890000
499400                 MVT-PURCH-ADJ-RTL-LY / 1000.00                   49900000
499500         COMPUTE PV-PERCENT ROUNDED =                             49910000
499600              MVT-INITIAL-MARKON-LY * PC-100                      49920000
499700            / MVT-RECEIPTS-RTL-LY                                 49930000
499800*           / MVT-RETAIL-PURCH-LY                                 49940000
499900             ON SIZE ERROR MOVE 0 TO PV-PERCENT                   49950000
500000         END-COMPUTE                                              49960000
500100         MOVE PV-PERCENT      TO DL-AP-INIT-MARKON-LY             49970000
500200         COMPUTE PV-PERCENT ROUNDED =                             49980000
500300                 MVT-NET-MARKON-LY * PC-100                       49990000
500400               / MVT-RETAIL-PURCH-LY                              50000000
500500              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  50010000
500600         END-COMPUTE                                              50020000
500700         MOVE PV-PERCENT         TO DL-AP-NET-MARKON-LY           50030000
500800     END-IF.                                                      50040000
500900                                                                  50050000
501000     MOVE DL-AP-DETAIL-LINE TO RR-REPORT-RECORD.                  50060000
501100     SET PI-PRINT-FRONT     TO TRUE.                              50070000
501200     MOVE 1 TO PA-LINE-NO.                                        50080000
501300     PERFORM 6000-CHECK-AP-DETAIL-GT-ZERO.                        50090000
501400     IF PI-PRINT-DETAIL                                           50100000
501500         PERFORM 5000-WRITE-REPORT-LINE                           50110000
501600     ELSE                                                         50120000
501700         MOVE DL-AP-NO-DETAIL        TO RR-REPORT-RECORD          50130000
501800         PERFORM 5000-WRITE-REPORT-LINE                           50140000
501900     END-IF.                                                      50150000
502000     MOVE BL-BAR-LINE TO RR-REPORT-RECORD.                        50160000
502100     MOVE 1 TO PA-LINE-NO.                                        50170000
502200     PERFORM 5000-WRITE-REPORT-LINE.                              50180000
502300                                                                  50190000
502400*     FORMAT THE A/P MISC VENDOR TOTALS LINE FOR THE CURRENT-MONTH50200000
502500     MOVE PC-TOTAL                    TO DL-AP-TOTAL.             50210000
502600                                                                  50220000
502700******  THIS YEAR  ***********************************************50230000
502800*    COMPUTE DL-AP-GROSS-COST ROUNDED =                           50240000
502900*                               MCMT-GROSS-COST / 1000.00.        50250000
503000*    COMPUTE DL-AP-PURCH-ADJ-COST-TY ROUNDED =                    50260000
503100*                               MCMT-PURCH-ADJ-COST-TY / 1000.00. 50270000
503200*    COMPUTE DL-AP-NET-COST-TY ROUNDED =                          50280000
503300*                               MCMT-NET-COST-TY / 1000.00.       50290000
503400*    COMPUTE DL-AP-RTL-PURCH-TY ROUNDED =                         50300000
503500*                               MCMT-RETAIL-PURCH-TY / 1000.00.   50310000
503600     COMPUTE DL-AP-RECEIPTS-COST-TY ROUNDED =                     50320000
503700             MCMT-RECEIPTS-COST-TY  / 1000.00.                    50330000
503800     COMPUTE DL-AP-RECEIPTS-RETAIL-TY ROUNDED =                   50340000
503900             MCMT-RECEIPTS-RTL-TY / 1000.00.                      50350000
504000     COMPUTE DL-AP-PURCHASE-ADJ-COST-TY ROUNDED =                 50360000
504100             MCMT-PURCH-ADJ-COST-TY / 1000.00.                    50370000
504200     COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-TY ROUNDED =               50380000
504300             MCMT-PURCH-ADJ-RTL-TY / 1000.00.                     50390000
504400                                                                  50400000
504500     COMPUTE PV-PERCENT ROUNDED =  MCMT-INITIAL-MARKON-TY * 100   50410000
504600           / MCMT-RECEIPTS-RTL-TY                                 50420000
504700*          / MCMT-RETAIL-PURCH-TY                                 50430000
504800          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     50440000
504900     MOVE PV-PERCENT             TO DL-AP-INIT-MARKON-TY.         50450000
505000     COMPUTE PV-PERCENT ROUNDED =  MCMT-NET-MARKON-TY * PC-100    50460000
505100           / MCMT-RETAIL-PURCH-TY                                 50470000
505200          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     50480000
505300     MOVE PV-PERCENT             TO DL-AP-NET-MARKON-TY.          50490000
505400*    COMPUTE DL-AP-PURCH-ADJ-RETAIL ROUNDED =                     50500000
505500*                              MCMT-PURCH-ADJ-RETAIL / 1000.00.   50510000
505600******  LAST YEAR  ***********************************************50520000
505700*    COMPUTE DL-AP-PURCH-ADJ-COST-LY ROUNDED =                    50530000
505800*                              MCMT-PURCH-ADJ-COST-LY / 1000.00.  50540000
505900*    COMPUTE DL-AP-NET-COST-LY ROUNDED =                          50550000
506000*                              MCMT-NET-COST-LY / 1000.00.        50560000
506100*    COMPUTE DL-AP-RTL-PURCH-LY ROUNDED =                         50570000
506200*                              MCMT-RETAIL-PURCH-LY / 1000.00.    50580000
506300                                                                  50590000
506400*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            50600000
506500     IF PV-HDG-START-CCYY-LY = PC-1998                            50610000
506600         CONTINUE                                                 50620000
506700     ELSE                                                         50630000
506800         COMPUTE DL-AP-RECEIPTS-COST-LY ROUNDED =                 50640000
506900                 MCMT-RECEIPTS-COST-LY / 1000.00                  50650000
507000         COMPUTE DL-AP-RECEIPTS-RETAIL-LY ROUNDED =               50660000
507100                 MCMT-RECEIPTS-RTL-LY / 1000.00                   50670000
507200         COMPUTE DL-AP-PURCHASE-ADJ-COST-LY ROUNDED =             50680000
507300                 MCMT-PURCH-ADJ-COST-LY / 1000.00                 50690000
507400         COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-LY ROUNDED =           50700000
507500                 MCMT-PURCH-ADJ-RTL-LY / 1000.00                  50710000
507600         COMPUTE PV-PERCENT ROUNDED =                             50720000
507700                (MCMT-INITIAL-MARKON-LY * PC-100)                 50730000
507800               / MCMT-RECEIPTS-RTL-LY                             50740000
507900*              / MCMT-RETAIL-PURCH-LY                             50750000
508000              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  50760000
508100         END-COMPUTE                                              50770000
508200         MOVE PV-PERCENT TO DL-AP-INIT-MARKON-LY                  50780000
508300         COMPUTE PV-PERCENT ROUNDED =                             50790000
508400                (MCMT-NET-MARKON-LY * PC-100)                     50800000
508500               / MCMT-RETAIL-PURCH-LY                             50810000
508600              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  50820000
508700         END-COMPUTE                                              50830000
508800         MOVE PV-PERCENT         TO DL-AP-NET-MARKON-LY           50840000
508900     END-IF.                                                      50850000
509000                                                                  50860000
509100     MOVE DL-AP-DETAIL-LINE      TO RR-REPORT-RECORD.             50870000
509200     SET PI-PRINT-BACK           TO TRUE.                         50880000
509300     MOVE 1                      TO PA-LINE-NO.                   50890000
509400                                                                  50900000
509500     PERFORM 6000-CHECK-AP-DETAIL-GT-ZERO.                        50910000
509600     IF PI-PRINT-DETAIL                                           50920000
509700         PERFORM 5000-WRITE-REPORT-LINE                           50930000
509800     ELSE                                                         50940000
509900         MOVE DL-AP-NO-DETAIL    TO RR-REPORT-RECORD              50950000
510000         PERFORM 5000-WRITE-REPORT-LINE                           50960000
510100     END-IF.                                                      50970000
510200     MOVE BL-BAR-LINE            TO RR-REPORT-RECORD.             50980000
510300     MOVE 1                      TO PA-LINE-NO.                   50990000
510400     PERFORM 5000-WRITE-REPORT-LINE.                              51000000
510500                                                                  51010000
510600/                                                                 51020000
510700 4230-PRINT-MISC-SALES-TOTAL.                                     51030000
510800******************************************************************51040000
510900*   4230-PRINT-MISC-SALES-TOTAL                                  *51050000
511000*      PRINTS THE SALES-TOTAL FOR EACH REQUEST                   *51060000
511100*                                                                *51070000
511200*   PERFORMED BY 4200-PRINT-TOTAL-PAGE                           *51080000
511300******************************************************************51090000
511400                                                                  51100000
511500     SET PI-PRINT-BOTH               TO TRUE.                     51110000
511600     MOVE 1 TO PA-LINE-NO.                                        51120000
511700     MOVE  H8-HEADING8A      TO RR-REPORT-RECORD.                 51130000
511800     PERFORM 5000-WRITE-REPORT-LINE.                              51140000
511900     MOVE  H8-HEADING8B      TO RR-REPORT-RECORD.                 51150000
512000     PERFORM 5000-WRITE-REPORT-LINE.                              51160000
512100     MOVE 1 TO PA-LINE-NO.                                        51170000
512200                                                                  51180000
512300     MOVE PC-TOTAL                    TO DL-SL-TOTAL.             51190000
512400                                                                  51200000
512500***** THIS YEAR **************************************************51210000
512600     COMPUTE DL-SL-TOTAL-SALES-TY ROUNDED =                       51220000
512700             MVT-TOTAL-SALES-TY / 1000.00                         51230000
512800     COMPUTE DL-SL-REGULAR-SALES-TY ROUNDED =                     51240000
512900             MVT-REGULAR-SALES-TY / 1000.00                       51250000
513000     COMPUTE DL-SL-PROMO-SALES-TY ROUNDED =                       51260000
513100             MVT-PROMO-SALES-TY / 1000.00                         51270000
513200     COMPUTE DL-SL-GOLDSTAR-SALES-TY ROUNDED =                    51280000
513300             MVT-GOLDSTAR-SALES-TY / 1000.00                      51290000
513400     COMPUTE DL-SL-CLEAR-SALES-TY ROUNDED =                       51300000
513500             MVT-CLEAR-SALES-TY / 1000.00                         51310000
513600     COMPUTE DL-SL-UNKWN-SALES-TY ROUNDED =                       51320000
513700             MVT-UNKWN-SALES-TY / 1000.00                         51330000
513800                                                                  51340000
513900***** LAST YEAR **************************************************51350000
514000*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            51360000
514100     IF PV-HDG-START-CCYY-LY = PC-1998                            51370000
514200         CONTINUE                                                 51380000
514300     ELSE                                                         51390000
514400         COMPUTE DL-SL-TOTAL-SALES-LY ROUNDED =                   51400000
514500                 MVT-TOTAL-SALES-LY / 1000.00                     51410000
514600         COMPUTE DL-SL-REGULAR-SALES-LY ROUNDED =                 51420000
514700                 MVT-REGULAR-SALES-LY / 1000.00                   51430000
514800         COMPUTE DL-SL-PROMO-SALES-LY ROUNDED =                   51440000
514900                 MVT-PROMO-SALES-LY / 1000.00                     51450000
515000         COMPUTE DL-SL-GOLDSTAR-SALES-LY ROUNDED =                51460000
515100                 MVT-GOLDSTAR-SALES-LY / 1000.00                  51470000
515200         COMPUTE DL-SL-CLEAR-SALES-LY ROUNDED =                   51480000
515300                 MVT-CLEAR-SALES-LY / 1000.00                     51490000
515400         COMPUTE DL-SL-UNKWN-SALES-LY ROUNDED =                   51500000
515500                 MVT-UNKWN-SALES-LY / 1000.00                     51510000
515600     END-IF.                                                      51520000
515700                                                                  51530000
515800     MOVE DL-SL-DETAIL-LINE TO RR-REPORT-RECORD.                  51540000
515900     SET PI-PRINT-FRONT TO TRUE.                                  51550000
516000     MOVE 1 TO PA-LINE-NO.                                        51560000
516100     PERFORM 6100-CHECK-SL-DETAIL-GT-ZERO                         51570000
516200     IF PI-PRINT-DETAIL                                           51580000
516300         PERFORM 5000-WRITE-REPORT-LINE                           51590000
516400     ELSE                                                         51600000
516500         MOVE DL-SALES-NO-DETAIL     TO RR-REPORT-RECORD          51610000
516600         PERFORM 5000-WRITE-REPORT-LINE                           51620000
516700     END-IF.                                                      51630000
516800     MOVE BL-BAR-LINE TO RR-REPORT-RECORD.                        51640000
516900     MOVE 1 TO PA-LINE-NO.                                        51650000
517000     PERFORM 5000-WRITE-REPORT-LINE.                              51660000
517100                                                                  51670000
517200*   FORMAT THE SALES MISC VENDOR TOTALS LINE FOR THE CURRENT-MONTH51680000
517300     MOVE PC-TOTAL                    TO DL-SL-TOTAL.             51690000
517400                                                                  51700000
517500***** THIS YEAR **************************************************51710000
517600     COMPUTE DL-SL-TOTAL-SALES-TY ROUNDED =                       51720000
517700             MCMT-TOTAL-SALES-TY / 1000.00.                       51730000
517800     COMPUTE DL-SL-REGULAR-SALES-TY ROUNDED =                     51740000
517900             MCMT-REGULAR-SALES-TY / 1000.00.                     51750000
518000     COMPUTE DL-SL-PROMO-SALES-TY ROUNDED =                       51760000
518100             MCMT-PROMO-SALES-TY / 1000.00.                       51770000
518200     COMPUTE DL-SL-GOLDSTAR-SALES-TY ROUNDED =                    51780000
518300             MCMT-GOLDSTAR-SALES-TY / 1000.00.                    51790000
518400     COMPUTE DL-SL-CLEAR-SALES-TY ROUNDED =                       51800000
518500             MCMT-CLEAR-SALES-TY / 1000.00.                       51810000
518600     COMPUTE DL-SL-UNKWN-SALES-TY ROUNDED =                       51820000
518700             MCMT-UNKWN-SALES-TY / 1000.00.                       51830000
518800                                                                  51840000
518900***** LAST YEAR **************************************************51850000
519000*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            51860000
519100     IF PV-HDG-START-CCYY-LY = PC-1998                            51870000
519200         CONTINUE                                                 51880000
519300     ELSE                                                         51890000
519400         COMPUTE DL-SL-TOTAL-SALES-LY ROUNDED =                   51900000
519500                 MCMT-TOTAL-SALES-LY / 1000.00                    51910000
519600         COMPUTE DL-SL-REGULAR-SALES-LY ROUNDED =                 51920000
519700                 MCMT-REGULAR-SALES-LY / 1000.00                  51930000
519800         COMPUTE DL-SL-PROMO-SALES-LY ROUNDED =                   51940000
519900                 MCMT-PROMO-SALES-LY / 1000.00                    51950000
520000         COMPUTE DL-SL-GOLDSTAR-SALES-LY ROUNDED =                51960000
520100                 MCMT-GOLDSTAR-SALES-LY / 1000.00                 51970000
520200         COMPUTE DL-SL-CLEAR-SALES-LY ROUNDED =                   51980000
520300                 MCMT-CLEAR-SALES-LY / 1000.00                    51990000
520400         COMPUTE DL-SL-UNKWN-SALES-LY ROUNDED =                   52000000
520500                 MCMT-UNKWN-SALES-LY / 1000.00                    52010000
520600     END-IF.                                                      52020000
520700                                                                  52030000
520800     MOVE DL-SL-DETAIL-LINE TO RR-REPORT-RECORD.                  52040000
520900     SET PI-PRINT-BACK TO TRUE.                                   52050000
521000     MOVE 1 TO PA-LINE-NO.                                        52060000
521100     PERFORM 6100-CHECK-SL-DETAIL-GT-ZERO.                        52070000
521200     IF PI-PRINT-DETAIL                                           52080000
521300         PERFORM 5000-WRITE-REPORT-LINE                           52090000
521400     ELSE                                                         52100000
521500         MOVE DL-SALES-NO-DETAIL TO RR-REPORT-RECORD              52110000
521600         PERFORM 5000-WRITE-REPORT-LINE                           52120000
521700     END-IF.                                                      52130000
521800     MOVE BL-BAR-LINE TO RR-REPORT-RECORD.                        52140000
521900     MOVE 1 TO PA-LINE-NO.                                        52150000
522000     PERFORM 5000-WRITE-REPORT-LINE.                              52160000
522100                                                                  52170000
522200/                                                                 52180000
522300 4240-PRINT-MISC-PC-TOTAL.                                        52190000
522400******************************************************************52200000
522500*   4240-PRINT-MISC-PC-TOTAL                                     *52210000
522600*      PRINTS THE PC-TOTAL-FOR EACH REQUEST                      *52220000
522700*                                                                *52230000
522800*   PERFORMED BY 4200-PRINT-TOTAL-PAGE                           *52240000
522900******************************************************************52250000
523000                                                                  52260000
523100     SET PI-PRINT-BOTH               TO TRUE.                     52270000
523200     MOVE 1 TO PA-LINE-NO.                                        52280000
523300     MOVE  H9-HEADING9A      TO RR-REPORT-RECORD.                 52290000
523400     PERFORM 5000-WRITE-REPORT-LINE.                              52300000
523500     MOVE  H9-HEADING9B      TO RR-REPORT-RECORD.                 52310000
523600     PERFORM 5000-WRITE-REPORT-LINE.                              52320000
523700     MOVE 1 TO PA-LINE-NO.                                        52330000
523800                                                                  52340000
523900     MOVE PC-TOTAL                    TO DL-PC-TOTAL.             52350000
524000                                                                  52360000
524100***** THIS YEAR **************************************************52370000
524200     COMPUTE DL-PC-TOTAL-MKDN-TY ROUNDED =                        52380000
524300             MVT-TOTAL-MKDN-TY / 1000.00.                         52390000
524400     COMPUTE DL-PC-STORE-MKDN-TY ROUNDED =                        52400000
524500             MVT-STORE-MKDN-TY / 1000.00.                         52410000
524600     COMPUTE DL-PC-BUYER-MKDN-TY ROUNDED =                        52420000
524700             MVT-BUYER-MKDN-TY / 1000.00.                         52430000
524800     COMPUTE DL-PC-PLU-MKDN-TY ROUNDED =                          52440000
524900             MVT-PLU-MKDN-TY / 1000.00.                           52450000
525000     COMPUTE DL-PC-PERM-MKDN-TY ROUNDED =                         52460000
525100             MVT-PERM-MKDN-TY / 1000.00.                          52470000
525200     COMPUTE DL-PC-OTHER-MKDN-TY ROUNDED =                        52480000
525300             MVT-OTHER-MKDN-TY / 1000.00.                         52490000
525400     COMPUTE PV-PERCENT ROUNDED = MVT-TOTAL-MKDN-TY               52500000
525500           * PC-100 / MVT-TOTAL-SALES-TY                          52510000
525600          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     52520000
525700     MOVE PV-PERCENT             TO DL-PC-MKDN-PCT-SLS-TY.        52530000
525800     COMPUTE DL-PC-TOTAL-MKUP-TY ROUNDED =                        52540000
525900             MVT-TOTAL-MKUP-TY / 1000.00.                         52550000
526000     COMPUTE DL-PC-DEBIT-ALLOW-TY ROUNDED =                       52560000
526100             MVT-DEBIT-ALLOW-TY / 1000.00.                        52570000
526200                                                                  52580000
526300***** LAST YEAR **************************************************52590000
526400*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    52600000
526500*    IF PV-HDG-START-CCYY-LY = PC-1998                            52610000
526600     IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                 52620000
526700         CONTINUE                                                 52630000
526800     ELSE                                                         52640000
526900         COMPUTE DL-PC-TOTAL-MKDN-LY ROUNDED =                    52650000
527000                 MVT-TOTAL-MKDN-LY / 1000.00                      52660000
527100         COMPUTE PV-PERCENT ROUNDED = MVT-TOTAL-MKDN-LY           52670000
527200               * PC-100 / MVT-TOTAL-SALES-LY                      52680000
527300              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  52690000
527400         END-COMPUTE                                              52700000
527500         MOVE PV-PERCENT TO DL-PC-MKDN-PCT-SLS-LY                 52710000
527600         COMPUTE DL-PC-PLU-MKDN-LY ROUNDED =                      52720000
527700                 MVT-PLU-MKDN-LY / 1000.00                        52730000
527800         COMPUTE DL-PC-PERM-MKDN-LY ROUNDED =                     52740000
527900                 MVT-PERM-MKDN-LY / 1000.00                       52750000
528000         COMPUTE DL-PC-OTHER-MKDN-LY ROUNDED =                    52760000
528100                 MVT-OTHER-MKDN-LY / 1000.00                      52770000
528200         COMPUTE DL-PC-TOTAL-MKUP-LY ROUNDED =                    52780000
528300                 MVT-TOTAL-MKUP-LY / 1000.00                      52790000
528400     END-IF.                                                      52800000
528500                                                                  52810000
528600     MOVE DL-PC-DETAIL-LINE TO RR-REPORT-RECORD.                  52820000
528700     SET PI-PRINT-FRONT TO TRUE.                                  52830000
528800     MOVE 1 TO PA-LINE-NO.                                        52840000
528900     PERFORM 6200-CHECK-PC-DETAIL-GT-ZERO.                        52850000
529000     IF PI-PRINT-DETAIL                                           52860000
529100         PERFORM 5000-WRITE-REPORT-LINE                           52870000
529200     ELSE                                                         52880000
529300         MOVE DL-PC-NO-DETAIL TO RR-REPORT-RECORD                 52890000
529400         PERFORM 5000-WRITE-REPORT-LINE                           52900000
529500     END-IF.                                                      52910000
529600     MOVE BL-BAR-LINE TO RR-REPORT-RECORD.                        52920000
529700     MOVE 1 TO PA-LINE-NO.                                        52930000
529800     PERFORM 5000-WRITE-REPORT-LINE.                              52940000
529900                                                                  52950000
530000*   FORMAT THE PC MISC VENDOR TOTALS LINE FOR THE CURRENT-MONTH   52960000
530100     MOVE PC-TOTAL                    TO DL-PC-TOTAL.             52970000
530200                                                                  52980000
530300****** THIS YEAR ************************************************ 52990000
530400     COMPUTE DL-PC-TOTAL-MKDN-TY ROUNDED =                        53000000
530500             MCMT-TOTAL-MKDN-TY / 1000.00.                        53010000
530600     COMPUTE DL-PC-STORE-MKDN-TY ROUNDED =                        53020000
530700             MCMT-STORE-MKDN-TY / 1000.00.                        53030000
530800     COMPUTE DL-PC-BUYER-MKDN-TY ROUNDED =                        53040000
530900             MCMT-BUYER-MKDN-TY / 1000.00.                        53050000
531000     COMPUTE DL-PC-PLU-MKDN-TY ROUNDED =                          53060000
531100             MCMT-PLU-MKDN-TY / 1000.00.                          53070000
531200     COMPUTE DL-PC-PERM-MKDN-TY ROUNDED =                         53080000
531300             MCMT-PERM-MKDN-TY / 1000.00.                         53090000
531400     COMPUTE DL-PC-OTHER-MKDN-TY ROUNDED =                        53100000
531500             MCMT-OTHER-MKDN-TY / 1000.00.                        53110000
531600     COMPUTE PV-PERCENT ROUNDED = MCMT-TOTAL-MKDN-TY              53120000
531700           * PC-100 / MCMT-TOTAL-SALES-TY                         53130000
531800          ON SIZE ERROR MOVE 0 TO PV-PERCENT                      53140000
531900     END-COMPUTE.                                                 53150000
532000     MOVE PV-PERCENT           TO DL-PC-MKDN-PCT-SLS-TY.          53160000
532100     COMPUTE DL-PC-TOTAL-MKUP-TY ROUNDED =                        53170000
532200             MCMT-TOTAL-MKUP-TY / 1000.00.                        53180000
532300     COMPUTE DL-PC-DEBIT-ALLOW-TY ROUNDED =                       53190000
532400             MCMT-DEBIT-ALLOW-TY / 1000.00.                       53200000
532500                                                                  53210000
532600****** LAST YEAR ************************************************ 53220000
532700*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    53230000
532800*    IF PV-HDG-START-CCYY-LY = PC-1998                            53240000
532900     IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                 53250000
533000         CONTINUE                                                 53260000
533100     ELSE                                                         53270000
533200         COMPUTE DL-PC-TOTAL-MKDN-LY ROUNDED =                    53280000
533300                 MCMT-TOTAL-MKDN-LY / 1000.00                     53290000
533400         COMPUTE PV-PERCENT ROUNDED = MCMT-TOTAL-MKDN-LY          53300000
533500               * PC-100 / MCMT-TOTAL-SALES-LY                     53310000
533600              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  53320000
533700         END-COMPUTE                                              53330000
533800         MOVE PV-PERCENT TO DL-PC-MKDN-PCT-SLS-LY                 53340000
533900         COMPUTE DL-PC-PLU-MKDN-LY ROUNDED =                      53350000
534000                 MCMT-PLU-MKDN-LY / 1000.00                       53360000
534100         COMPUTE DL-PC-PERM-MKDN-LY ROUNDED =                     53370000
534200                 MCMT-PERM-MKDN-LY / 1000.00                      53380000
534300         COMPUTE DL-PC-OTHER-MKDN-LY ROUNDED =                    53390000
534400                MCMT-OTHER-MKDN-LY / 1000.00                      53400000
534500         COMPUTE DL-PC-TOTAL-MKUP-LY ROUNDED =                    53410000
534600                 MCMT-TOTAL-MKUP-LY / 1000.00                     53420000
534700     END-IF.                                                      53430000
534800                                                                  53440000
534900     MOVE DL-PC-DETAIL-LINE TO RR-REPORT-RECORD.                  53450000
535000     SET PI-PRINT-BACK TO TRUE.                                   53460000
535100     MOVE 1 TO PA-LINE-NO.                                        53470000
535200     PERFORM 6200-CHECK-PC-DETAIL-GT-ZERO.                        53480000
535300     IF PI-PRINT-DETAIL                                           53490000
535400         PERFORM 5000-WRITE-REPORT-LINE                           53500000
535500     ELSE                                                         53510000
535600         MOVE DL-PC-NO-DETAIL TO RR-REPORT-RECORD                 53520000
535700         PERFORM 5000-WRITE-REPORT-LINE                           53530000
535800     END-IF.                                                      53540000
535900     MOVE BL-BAR-LINE TO RR-REPORT-RECORD.                        53550000
536000     MOVE 1 TO PA-LINE-NO.                                        53560000
536100     PERFORM 5000-WRITE-REPORT-LINE.                              53570000
536200                                                                  53580000
536300/                                                                 53590000
536400 4250-PRINT-MISC-MISC-TOTAL.                                      53600000
536500******************************************************************53610000
536600*   4250-PRINT-MISC-MISC-TOTAL                                   *53620000
536700*      PRINTS THE MISC-TOTAL FOR EACH REQUEST                    *53630000
536800*                                                                *53640000
536900*   PERFORMED BY 4200-PRINT-TOTAL-PAGE                           *53650000
537000******************************************************************53660000
537100                                                                  53670000
537200     SET PI-PRINT-BOTH               TO TRUE.                     53680000
537300     MOVE 1                           TO PA-LINE-NO.              53690000
537400     MOVE  H10-HEADING10A             TO RR-REPORT-RECORD.        53700000
537500     PERFORM 5000-WRITE-REPORT-LINE.                              53710000
537600     MOVE  H10-HEADING10B             TO RR-REPORT-RECORD.        53720000
537700     PERFORM 5000-WRITE-REPORT-LINE.                              53730000
537800     MOVE 1                           TO PA-LINE-NO.              53740000
537900     MOVE PC-TOTAL                    TO DL-MI-TOTAL.             53750000
538000                                                                  53760000
538100*****  THIS YEAR  ************************************************53770000
538200     COMPUTE DL-MI-GROSS-MARGN-TY ROUNDED =                       53780000
538300             MVT-GROSS-MARGN-TY / 1000.00.                        53790000
538400     COMPUTE PV-PERCENT ROUNDED = MVT-GROSS-MARGN-TY              53800000
538500           * PC-100 / MVT-TOTAL-SALES-TY                          53810000
538600          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     53820000
538700     MOVE PV-PERCENT           TO DL-MI-GR-MARGN-PCT-TY.          53830000
538800                                                                  53840000
538900* J  COMPUTE PV-PERCENT ROUNDED =                                 53850000
539000* J         (MVT-RETAIL-PURCH-TY - MVT-NET-COST-TY)               53860000
539100* J        * PC-100 / MVT-RETAIL-PURCH-TY                         53870000
539200* J       ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     53880000
539300* J  MOVE PV-PERCENT                  TO DL-MI-MARKON-PCT-TY.     53890000
539400                                                                  53900000
539500     COMPUTE DL-MI-END-INV-COST-TY ROUNDED =                      53910000
539600             MVT-END-INV-COST-TY / 1000.00.                       53920000
539700     COMPUTE DL-MI-END-INV-RTL-TY ROUNDED =                       53930000
539800             MVT-END-INV-RTL-TY / 1000.00.                        53940000
539900     COMPUTE DL-MI-SHRINK-DLR-TY ROUNDED =                        53950000
540000             MVT-SHRINK-DLR-TY / 1000.00.                         53960000
C14666     COMPUTE PV-SHK-PERCENT ROUNDED =                             53970001
540200             MVT-SHRINK-DLR-TY * PC-100 /                         53980000
540300             MVT-TOTAL-SALES-TY                                   53990000
C14666          ON SIZE ERROR MOVE ZERO TO PV-SHK-PERCENT.              54000001
C14666     MOVE PV-SHK-PERCENT          TO DL-MI-SHRINK-PCT-TY.         54010001
540600     COMPUTE DL-MI-INV-ADJ-TY ROUNDED =                           54020000
540700             MVT-INV-ADJ-TY / 1000.00.                            54030000
540800     COMPUTE DL-MI-RET-TO-VENDR-TY ROUNDED =                      54040000
540900             MVT-RET-TO-VENDR-TY / 1000.00.                       54050000
541000                                                                  54060000
541100*****  LAST YEAR  ************************************************54070000
541200*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    54080000
541300*    IF PV-HDG-START-CCYY-LY = PC-1998                            54090000
541400     IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                 54100000
541500         CONTINUE                                                 54110000
541600     ELSE                                                         54120000
541700         COMPUTE DL-MI-GROSS-MARGN-LY ROUNDED =                   54130000
541800                 MVT-GROSS-MARGN-LY / 1000.00                     54140000
541900         COMPUTE PV-PERCENT ROUNDED = MVT-GROSS-MARGN-LY          54150000
542000               * PC-100 / MVT-TOTAL-SALES-LY                      54160000
542100              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  54170000
542200         END-COMPUTE                                              54180000
542300         MOVE PV-PERCENT TO DL-MI-GR-MARGN-PCT-LY                 54190000
542400         COMPUTE DL-MI-END-INV-RTL-LY ROUNDED =                   54200000
542500                 MVT-END-INV-RTL-LY / 1000.00                     54210000
542600         COMPUTE DL-MI-SHRINK-DLR-LY ROUNDED =                    54220000
542700                 MVT-SHRINK-DLR-LY / 1000.00                      54230000
542800         COMPUTE DL-MI-INV-ADJ-LY ROUNDED =                       54240000
542900                 MVT-INV-ADJ-LY / 1000.00                         54250000
543000     END-IF.                                                      54260000
543100                                                                  54270000
543200     MOVE DL-MI-DETAIL-LINE TO RR-REPORT-RECORD.                  54280000
543300     SET PI-PRINT-FRONT TO TRUE.                                  54290000
543400     MOVE 1 TO PA-LINE-NO.                                        54300000
543500     PERFORM 6300-CHECK-MI-DETAIL-GT-ZERO.                        54310000
543600     IF PI-PRINT-DETAIL                                           54320000
543700         PERFORM 5000-WRITE-REPORT-LINE                           54330000
543800     ELSE                                                         54340000
543900         MOVE DL-MISC-NO-DETAIL       TO RR-REPORT-RECORD         54350000
544000         PERFORM 5000-WRITE-REPORT-LINE                           54360000
544100     END-IF.                                                      54370000
544200     MOVE BL-BAR-LINE TO RR-REPORT-RECORD.                        54380000
544300     MOVE 1 TO PA-LINE-NO.                                        54390000
544400     PERFORM 5000-WRITE-REPORT-LINE.                              54400000
544500                                                                  54410000
544600*   FORMAT THE OTHER INFO MISC VENDOR TOTALS LINE FOR THE         54420000
544700*   CURRENT-MONTH                                                 54430000
544800     MOVE PC-TOTAL                         TO DL-MI-TOTAL.        54440000
544900******  THIS YEAR *********************************************** 54450000
545000     COMPUTE DL-MI-GROSS-MARGN-TY ROUNDED =                       54460000
545100             MCMT-GROSS-MARGN-TY / 1000.00.                       54470000
545200     COMPUTE PV-PERCENT ROUNDED = MCMT-GROSS-MARGN-TY             54480000
545300           * PC-100 / MCMT-TOTAL-SALES-TY                         54490000
545400          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     54500000
545500     MOVE PV-PERCENT           TO DL-MI-GR-MARGN-PCT-TY.          54510000
545600                                                                  54520000
545700* J  COMPUTE PV-PERCENT ROUNDED =                                 54530000
545800* J         (MCMT-RETAIL-PURCH-TY - MCMT-NET-COST-TY)             54540000
545900* J        * PC-100 / MCMT-RETAIL-PURCH-TY                        54550000
546000* J       ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     54560000
546100* J  MOVE PV-PERCENT           TO DL-MI-MARKON-PCT-TY.            54570000
546200                                                                  54580000
546300     COMPUTE DL-MI-END-INV-COST-TY ROUNDED =                      54590000
546400             MCMT-END-INV-COST-TY / 1000.00.                      54600000
546500     COMPUTE DL-MI-END-INV-RTL-TY ROUNDED =                       54610000
546600             MCMT-END-INV-RTL-TY / 1000.00.                       54620000
546700     COMPUTE DL-MI-SHRINK-DLR-TY ROUNDED =                        54630000
546800             MCMT-SHRINK-DLR-TY / 1000.00.                        54640000
C14666     COMPUTE PV-SHK-PERCENT ROUNDED =                             54650001
547000             MCMT-SHRINK-DLR-TY * PC-100 /                        54660000
547100             MCMT-TOTAL-SALES-TY                                  54670000
C14666          ON SIZE ERROR MOVE ZERO TO PV-SHK-PERCENT.              54680001
C14666     MOVE PV-SHK-PERCENT          TO DL-MI-SHRINK-PCT-TY.         54690001
547400     COMPUTE DL-MI-INV-ADJ-TY ROUNDED =                           54700000
547500             MCMT-INV-ADJ-TY / 1000.00.                           54710000
547600     COMPUTE DL-MI-RET-TO-VENDR-TY ROUNDED =                      54720000
547700             MCMT-RET-TO-VENDR-TY / 1000.00.                      54730000
547800                                                                  54740000
547900******  LAST YEAR *********************************************** 54750000
548000*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    54760000
548100*    IF PV-HDG-START-CCYY-LY = PC-1998                            54770000
548200     IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                 54780000
548300         CONTINUE                                                 54790000
548400     ELSE                                                         54800000
548500         COMPUTE DL-MI-GROSS-MARGN-LY ROUNDED =                   54810000
548600                 MCMT-GROSS-MARGN-LY / 1000.00                    54820000
548700         COMPUTE PV-PERCENT ROUNDED = MCMT-GROSS-MARGN-LY         54830000
548800               * PC-100 / MCMT-TOTAL-SALES-LY                     54840000
548900              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  54850000
549000         END-COMPUTE                                              54860000
549100         MOVE PV-PERCENT       TO DL-MI-GR-MARGN-PCT-LY           54870000
549200         COMPUTE DL-MI-END-INV-RTL-LY ROUNDED =                   54880000
549300                 MCMT-END-INV-RTL-LY / 1000.00                    54890000
549400         COMPUTE DL-MI-SHRINK-DLR-LY ROUNDED =                    54900000
549500                 MCMT-SHRINK-DLR-LY / 1000.00                     54910000
549600         COMPUTE DL-MI-INV-ADJ-LY ROUNDED =                       54920000
549700                 MCMT-INV-ADJ-LY / 1000.00                        54930000
549800     END-IF.                                                      54940000
549900                                                                  54950000
550000     MOVE DL-MI-DETAIL-LINE             TO RR-REPORT-RECORD.      54960000
550100     SET PI-PRINT-BACK                  TO TRUE.                  54970000
550200     MOVE 1                             TO PA-LINE-NO.            54980000
550300     PERFORM 6300-CHECK-MI-DETAIL-GT-ZERO.                        54990000
550400     IF PI-PRINT-DETAIL                                           55000000
550500         PERFORM 5000-WRITE-REPORT-LINE                           55010000
550600     ELSE                                                         55020000
550700         MOVE DL-MISC-NO-DETAIL         TO RR-REPORT-RECORD       55030000
550800         PERFORM 5000-WRITE-REPORT-LINE                           55040000
550900     END-IF.                                                      55050000
551000     MOVE BL-BAR-LINE                   TO RR-REPORT-RECORD.      55060000
551100     MOVE 1                             TO PA-LINE-NO.            55070000
551200     PERFORM 5000-WRITE-REPORT-LINE.                              55080000
551300                                                                  55090000
551400/                                                                 55100000
551500 4260-PRINT-MISC-RECAP-TOTAL.                                     55110000
551600******************************************************************55120000
551700*   4260-PRINT-MISC-RECAP-TOTAL                                  *55130000
551800*      PRINTS THE RECAP-TOTAL FOR EACH REQUEST                   *55140000
551900*                                                                *55150000
552000*   PERFORMED BY 4200-PRINT-TOTAL-PAGE                           *55160000
552100******************************************************************55170000
552200                                                                  55180000
552300     SET PI-PRINT-FRONT           TO TRUE.                        55190000
552400     MOVE PV-HDG-DATE-TY          TO H6-DATE-RANGE-TY.            55200000
552500     MOVE PV-HDG-DATE-LY          TO H6-DATE-RANGE-LY.            55210000
552600     MOVE H6-HEADING6             TO RR-REPORT-RECORD.            55220000
552700     MOVE 1                       TO PA-LINE-NO.                  55230000
552800     PERFORM 5000-WRITE-REPORT-LINE.                              55240000
552900                                                                  55250000
553000     MOVE PV-MON-DATE-TY          TO H6-DATE-RANGE-TY.            55260000
553100     MOVE PV-MON-DATE-LY          TO H6-DATE-RANGE-LY.            55270000
553200     SET PI-PRINT-BACK            TO TRUE.                        55280000
553300     MOVE H6-HEADING6             TO RR-REPORT-RECORD.            55290000
553400     MOVE 1                       TO PA-LINE-NO.                  55300000
553500     PERFORM 5000-WRITE-REPORT-LINE.                              55310000
553600                                                                  55320000
553700     SET PI-PRINT-BOTH TO TRUE.                                   55330000
553800     MOVE BL-BAR-LINE             TO RR-REPORT-RECORD.            55340000
553900     MOVE 1                       TO PA-LINE-NO.                  55350000
554000     PERFORM 5000-WRITE-REPORT-LINE.                              55360000
554100     MOVE H11-HEADING11A          TO RR-REPORT-RECORD             55370000
554200     PERFORM 5000-WRITE-REPORT-LINE.                              55380000
554300     MOVE H11-HEADING11B          TO RR-REPORT-RECORD             55390000
554400     PERFORM 5000-WRITE-REPORT-LINE.                              55400000
554500                                                                  55410000
554600     MOVE PC-TOTAL                 TO DL-SR-TOTAL.                55420000
554700                                                                  55430000
554800*****  THIS YEAR  ************************************************55440000
554900*    COMPUTE DL-SR-GROSS-COST ROUNDED =                           55450000
555000*                           MVT-GROSS-COST / 1000.00.             55460000
555100*    COMPUTE DL-SR-PURCH-ADJ-COST-TY ROUNDED =                    55470000
555200*                           MVT-PURCH-ADJ-COST-TY / 1000.00.      55480000
555300*    COMPUTE DL-SR-NET-COST-TY ROUNDED =                          55490000
555400*                           MVT-NET-COST-TY / 1000.00.            55500000
555500*    COMPUTE DL-SR-RETAIL-PURCH-TY ROUNDED =                      55510000
555600*                           MVT-RETAIL-PURCH-TY / 1000.00.        55520000
555700     COMPUTE DL-AP-RECEIPTS-COST-TY ROUNDED =                     55530000
555800             MVT-RECEIPTS-COST-TY  / 1000.00.                     55540000
555900     COMPUTE DL-AP-RECEIPTS-RETAIL-TY ROUNDED =                   55550000
556000             MVT-RECEIPTS-RTL-TY / 1000.00.                       55560000
556100     COMPUTE DL-AP-PURCHASE-ADJ-COST-TY ROUNDED =                 55570000
556200             MVT-PURCH-ADJ-COST-TY / 1000.00.                     55580000
556300     COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-TY ROUNDED =               55590000
556400             MVT-PURCH-ADJ-RTL-TY / 1000.00.                      55600000
556500                                                                  55610000
556600     COMPUTE PV-PERCENT ROUNDED =                                 55620000
556700           ( MVT-CUM-TO-DATE-PURCH-RTL-TY                         55630000
556800           - MVT-CUM-TO-DATE-PURCH-COST-TY ) * 100.00             55640000
556900           / MVT-CUM-TO-DATE-PURCH-RTL-TY                         55650000
557000          ON SIZE ERROR MOVE 100 TO PV-PERCENT.                   55660000
557100     MOVE PV-PERCENT             TO DL-SR-CUMM-MARKUP-PCT-TY.     55670000
557200     COMPUTE DL-SR-TOTAL-SALES-TY ROUNDED =                       55680000
557300             MVT-TOTAL-SALES-TY / 1000.00.                        55690000
557400     COMPUTE DL-SR-TOTAL-MKDN-TY ROUNDED =                        55700000
557500             MVT-TOTAL-MKDN-TY / 1000.00.                         55710000
557600     COMPUTE PV-PERCENT ROUNDED = MVT-TOTAL-MKDN-TY * PC-100      55720000
557700           / MVT-TOTAL-SALES-TY                                   55730000
557800          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     55740000
557900     MOVE PV-PERCENT           TO DL-SR-TOTAL-MKDN-PCT-TY.        55750000
558000     COMPUTE PV-PERCENT ROUNDED = MVT-GROSS-MARGN-TY              55760000
558100           * PC-100 / MVT-TOTAL-SALES-TY                          55770000
558200          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     55780000
558300     MOVE PV-PERCENT               TO DL-SR-GROSS-MARGN-PCT-TY.   55790000
558400     COMPUTE DL-SR-END-INV-RTL-TY ROUNDED =                       55800000
558500             MVT-END-INV-RTL-TY / 1000.00.                        55810000
558600                                                                  55820000
558700*****  LAST YEAR  ************************************************55830000
558800     IF PV-HDG-START-CCYY-LY = PC-1998                            55840000
558900         CONTINUE                                                 55850000
559000     ELSE                                                         55860000
559100         COMPUTE DL-SR-NET-COST-LY ROUNDED =                      55870000
559200                 MVT-NET-COST-LY / 1000.00                        55880000
559300         COMPUTE DL-SR-RETAIL-PURCH-LY ROUNDED =                  55890000
559400                 MVT-RETAIL-PURCH-LY / 1000.00                    55900000
559500         COMPUTE DL-SR-TOTAL-SALES-LY ROUNDED =                   55910000
559600                 MVT-TOTAL-SALES-LY / 1000.00                     55920000
559700*--     DO NOT PRINT 1999 DATA (LAST YEAR)                        55930000
559800         IF PV-HDG-START-CCYY-LY = PC-1999                        55940000
559900             CONTINUE                                             55950000
560000         ELSE                                                     55960000
560100             COMPUTE PV-PERCENT ROUNDED =                         55970000
560200                   ( MVT-CUM-TO-DATE-PURCH-RTL-LY                 55980000
560300                   - MVT-CUM-TO-DATE-PURCH-COST-LY ) * 100.00     55990000
560400                   / MVT-CUM-TO-DATE-PURCH-RTL-LY                 56000000
560500                  ON SIZE ERROR MOVE 100 TO PV-PERCENT            56010000
560600             END-COMPUTE                                          56020000
560700             MOVE PV-PERCENT TO DL-SR-CUMM-MARKUP-PCT-LY          56030000
560800             COMPUTE DL-SR-TOTAL-MKDN-LY ROUNDED =                56040000
560900                     MVT-TOTAL-MKDN-LY / 1000.00                  56050000
561000             COMPUTE PV-PERCENT ROUNDED = MVT-GROSS-MARGN-LY      56060000
561100                   * PC-100 / MVT-TOTAL-SALES-LY                  56070000
561200                  ON SIZE ERROR MOVE 0 TO PV-PERCENT              56080000
561300             END-COMPUTE                                          56090000
561400             MOVE PV-PERCENT       TO DL-SR-GROSS-MARGN-PCT-LY    56100000
561500             COMPUTE DL-SR-END-INV-RTL-LY ROUNDED =               56110000
561600                     MVT-END-INV-RTL-LY / 1000.00                 56120000
561700         END-IF                                                   56130000
561800     END-IF.                                                      56140000
561900                                                                  56150000
562000     MOVE DL-SR-DETAIL-LINE  TO RR-REPORT-RECORD.                 56160000
562100     SET PI-PRINT-FRONT      TO TRUE.                             56170000
562200     MOVE 1                  TO PA-LINE-NO.                       56180000
562300     PERFORM 6400-CHECK-SR-DETAIL-GT-ZERO.                        56190000
562400     IF PI-PRINT-DETAIL                                           56200000
562500         PERFORM 5000-WRITE-REPORT-LINE                           56210000
562600     END-IF.                                                      56220000
562700                                                                  56230000
562800*   FORMAT THE SUMMARY RECAP MISC VENDOR TOTALS LINE FOR THE      56240000
562900*   CURRENT-MONTH                                                 56250000
563000     MOVE PC-TOTAL                 TO DL-SR-TOTAL.                56260000
563100*****  THIS YEAR  ************************************************56270000
563200*    COMPUTE DL-SR-GROSS-COST ROUNDED =                           56280000
563300*                       MCMT-GROSS-COST / 1000.00.                56290000
563400*    COMPUTE DL-SR-PURCH-ADJ-COST-TY ROUNDED =                    56300000
563500*                       MCMT-PURCH-ADJ-COST-TY / 1000.00.         56310000
563600*    COMPUTE DL-SR-NET-COST-TY ROUNDED =                          56320000
563700*                       MCMT-NET-COST-TY / 1000.00.               56330000
563800*    COMPUTE DL-SR-RETAIL-PURCH-TY ROUNDED =                      56340000
563900*                       MCMT-RETAIL-PURCH-TY / 1000.00.           56350000
564000     COMPUTE DL-AP-RECEIPTS-COST-TY ROUNDED =                     56360000
564100             MCMT-RECEIPTS-COST-TY  / 1000.00.                    56370000
564200     COMPUTE DL-AP-RECEIPTS-RETAIL-TY ROUNDED =                   56380000
564300             MCMT-RECEIPTS-RTL-TY / 1000.00.                      56390000
564400     COMPUTE DL-AP-PURCHASE-ADJ-COST-TY ROUNDED =                 56400000
564500             MCMT-PURCH-ADJ-COST-TY / 1000.00.                    56410000
564600     COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-TY ROUNDED =               56420000
564700             MCMT-PURCH-ADJ-RTL-TY / 1000.00.                     56430000
564800     COMPUTE PV-PERCENT ROUNDED =                                 56440000
564900           ( MCMT-CUM-TO-DATE-PURCH-RTL-TY                        56450000
565000           - MCMT-CUM-TO-DATE-PURCH-COST-TY ) * 100.00            56460000
565100           / MCMT-CUM-TO-DATE-PURCH-RTL-TY                        56470000
565200          ON SIZE ERROR MOVE 100 TO PV-PERCENT.                   56480000
565300     MOVE PV-PERCENT             TO DL-SR-CUMM-MARKUP-PCT-TY.     56490000
565400     COMPUTE DL-SR-TOTAL-SALES-TY ROUNDED =                       56500000
565500             MCMT-TOTAL-SALES-TY / 1000.00.                       56510000
565600     COMPUTE DL-SR-TOTAL-MKDN-TY ROUNDED =                        56520000
565700             MCMT-TOTAL-MKDN-TY / 1000.00.                        56530000
565800     COMPUTE PV-PERCENT ROUNDED = MCMT-TOTAL-MKDN-TY * PC-100     56540000
565900           / MCMT-TOTAL-SALES-TY                                  56550000
566000          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     56560000
566100     MOVE PV-PERCENT           TO DL-SR-TOTAL-MKDN-PCT-TY.        56570000
566200     COMPUTE PV-PERCENT ROUNDED = MCMT-GROSS-MARGN-TY             56580000
566300           * PC-100 / MCMT-TOTAL-SALES-TY                         56590000
566400          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     56600000
566500     MOVE PV-PERCENT           TO DL-SR-GROSS-MARGN-PCT-TY.       56610000
566600     COMPUTE DL-SR-END-INV-RTL-TY ROUNDED =                       56620000
566700             MCMT-END-INV-RTL-TY / 1000.00.                       56630000
566800                                                                  56640000
566900*****  LAST YEAR  ************************************************56650000
567000*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            56660000
567100     IF PV-HDG-START-CCYY-LY = PC-1998                            56670000
567200         CONTINUE                                                 56680000
567300     ELSE                                                         56690000
567400         COMPUTE DL-SR-NET-COST-LY ROUNDED =                      56700000
567500                 MCMT-NET-COST-LY / 1000.00                       56710000
567600         COMPUTE DL-SR-RETAIL-PURCH-LY ROUNDED =                  56720000
567700                 MCMT-RETAIL-PURCH-LY / 1000.00                   56730000
567800         COMPUTE DL-SR-TOTAL-SALES-LY ROUNDED =                   56740000
567900                 MCMT-TOTAL-SALES-LY / 1000.00                    56750000
568000*--     DO NOT PRINT 1999 DATA (LAST YEAR)                        56760000
568100         IF PV-HDG-START-CCYY-LY = PC-1999                        56770000
568200             CONTINUE                                             56780000
568300         ELSE                                                     56790000
568400             COMPUTE PV-PERCENT ROUNDED =                         56800000
568500                   ( MCMT-CUM-TO-DATE-PURCH-RTL-LY                56810000
568600                   - MCMT-CUM-TO-DATE-PURCH-COST-LY ) * 100.00    56820000
568700                   / MCMT-CUM-TO-DATE-PURCH-RTL-LY                56830000
568800                  ON SIZE ERROR MOVE 100 TO PV-PERCENT            56840000
568900             END-COMPUTE                                          56850000
569000             MOVE PV-PERCENT TO DL-SR-CUMM-MARKUP-PCT-LY          56860000
569100             COMPUTE DL-SR-TOTAL-MKDN-LY ROUNDED =                56870000
569200                     MCMT-TOTAL-MKDN-LY / 1000.00                 56880000
569300             COMPUTE PV-PERCENT ROUNDED = MCMT-GROSS-MARGN-LY     56890000
569400                   * PC-100 / MCMT-TOTAL-SALES-LY                 56900000
569500                  ON SIZE ERROR MOVE 0 TO PV-PERCENT              56910000
569600             END-COMPUTE                                          56920000
569700             MOVE PV-PERCENT       TO DL-SR-GROSS-MARGN-PCT-LY    56930000
569800             COMPUTE DL-SR-END-INV-RTL-LY ROUNDED =               56940000
569900                     MCMT-END-INV-RTL-LY / 1000.00                56950000
570000         END-IF                                                   56960000
570100     END-IF.                                                      56970000
570200                                                                  56980000
570300     MOVE DL-SR-DETAIL-LINE                TO RR-REPORT-RECORD.   56990000
570400     SET PI-PRINT-BACK                     TO TRUE.               57000000
570500     MOVE 1                                TO PA-LINE-NO.         57010000
570600     PERFORM 6400-CHECK-SR-DETAIL-GT-ZERO.                        57020000
570700     IF PI-PRINT-DETAIL                                           57030000
570800         PERFORM 5000-WRITE-REPORT-LINE                           57040000
570900     END-IF.                                                      57050000
571000                                                                  57060000
571100/                                                                 57070000
571200 4400-VENDOR-TOTAL-CURRENT-MTH.                                   57080000
571300******************************************************************57090000
571400* PRINT THE CURRENT MONTH TOTAL REPORT.                          *57100000
571500*                                                                *57110000
571600* PERFORMED BY 4000-EOF-ROUTINE.                                 *57120000
571700******************************************************************57130000
571800     MOVE 0 TO PA-LINE-NO.                                        57140000
571900     SUBTRACT 1 FROM PA-PAGE-COUNT.                               57150000
572000     PERFORM 4110-HEADING-RTN.                                    57160000
572100                                                                  57170000
572200     MOVE SPACES                 TO H4-MANAGER-NMBR.              57180000
572300     MOVE PC-REPORT-MONTH        TO H4-MANAGER-NAME.              57190000
572400     MOVE 1 TO PA-LINE-NO.                                        57200000
572500     MOVE  H4-HEADING4A          TO RR-REPORT-RECORD.             57210000
572600     PERFORM 5000-WRITE-REPORT-LINE.                              57220000
572700                                                                  57230000
572800     MOVE SPACES                 TO H4-BUYER-NMBR.                57240000
572900     MOVE SPACES                 TO H4-BUYER-NAME.                57250000
573000     MOVE 1 TO PA-LINE-NO.                                        57260000
573100     MOVE  H4-HEADING4B          TO RR-REPORT-RECORD.             57270000
573200     PERFORM 5000-WRITE-REPORT-LINE.                              57280000
573300                                                                  57290000
573400     MOVE SPACES                 TO H4-DEPT-NMBR.                 57300000
573500     MOVE SPACES                 TO H4-DEPT-DESC.                 57310000
573600     MOVE 1 TO PA-LINE-NO.                                        57320000
573700     MOVE  H4-HEADING4C          TO RR-REPORT-RECORD.             57330000
573800     PERFORM 5000-WRITE-REPORT-LINE.                              57340000
573900                                                                  57350000
574000     MOVE SPACES                 TO H5-VENDOR-NAME.               57360000
574100     MOVE 1 TO PA-LINE-NO.                                        57370000
574200     MOVE  H5-HEADING5           TO RR-REPORT-RECORD.             57380000
574300     PERFORM 5000-WRITE-REPORT-LINE.                              57390000
574400                                                                  57400000
574500     MOVE PV-MON-DATE-TY         TO H6-DATE-RANGE-TY.             57410000
574600     MOVE PV-MON-DATE-LY         TO H6-DATE-RANGE-LY.             57420000
574700     MOVE H6-HEADING6            TO RR-REPORT-RECORD.             57430000
574800     MOVE 1 TO PA-LINE-NO.                                        57440000
574900     PERFORM 5000-WRITE-REPORT-LINE.                              57450000
575000                                                                  57460000
575100     MOVE BL-BAR-LINE            TO RR-REPORT-RECORD.             57470000
575200     MOVE 1                      TO PA-LINE-NO.                   57480000
575300     PERFORM 5000-WRITE-REPORT-LINE.                              57490000
575400                                                                  57500000
575500     PERFORM 4410-CURRENT-MONTH-AP.                               57510000
575600     PERFORM 4420-CURRENT-MONTH-SALES.                            57520000
575700     PERFORM 4430-CURRENT-MONTH-PC.                               57530000
575800     PERFORM 4440-CURRENT-MONTH-MISC.                             57540000
575900     PERFORM 4450-CURRENT-MONTH-RECAP.                            57550000
576000*                                                                 57560000
576100 4410-CURRENT-MONTH-AP.                                           57570000
576200******************************************************************57580000
576300*  PRINT THE AP CURRENT MONTH TOTAL                              *57590000
576400*                                                                *57600000
576500*  PERFORMED BY 4400-VENDOR-TOTAL-CURRENT-MTH.                   *57610000
576600******************************************************************57620000
576700*  AP                                                            *57630000
576800*                                                                *57640000
576900******  THIS YEAR  ***********************************************57650000
577000     MOVE PC-TOTAL                    TO DL-AP-TOTAL.             57660000
577100     MOVE 1 TO PA-LINE-NO.                                        57670000
577200     MOVE  H7-HEADING7A      TO RR-REPORT-RECORD.                 57680000
577300     PERFORM 5000-WRITE-REPORT-LINE.                              57690000
577400     MOVE  H7-HEADING7B      TO RR-REPORT-RECORD.                 57700000
577500     PERFORM 5000-WRITE-REPORT-LINE.                              57710000
577600     MOVE 1 TO PA-LINE-NO.                                        57720000
577700                                                                  57730000
577800     MOVE PC-TOTAL                    TO DL-AP-TOTAL.             57740000
577900                                                                  57750000
578000*                                                                 57760000
578100*    COMPUTE DL-AP-GROSS-COST ROUNDED =                           57770000
578200*                              TCMT-GROSS-COST  / 1000.00.        57780000
578300*    COMPUTE DL-AP-PURCH-ADJ-COST-TY ROUNDED =                    57790000
578400*                              TCMT-PURCH-ADJ-COST-TY / 1000.00.  57800000
578500*    COMPUTE DL-AP-NET-COST-TY ROUNDED =                          57810000
578600*                              TCMT-NET-COST-TY / 1000.00.        57820000
578700*    COMPUTE DL-AP-RTL-PURCH-TY ROUNDED =                         57830000
578800*                              TCMT-RETAIL-PURCH-TY  / 1000.00.   57840000
578900     COMPUTE DL-AP-RECEIPTS-COST-TY ROUNDED =                     57850000
579000            TCMT-RECEIPTS-COST-TY / 1000.00.                      57860000
579100     COMPUTE DL-AP-RECEIPTS-RETAIL-TY ROUNDED =                   57870000
579200            TCMT-RECEIPTS-RTL-TY / 1000.00.                       57880000
579300     COMPUTE DL-AP-PURCHASE-ADJ-COST-TY ROUNDED =                 57890000
579400            TCMT-PURCH-ADJ-COST-TY / 1000.00.                     57900000
579500     COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-TY ROUNDED =               57910000
579600            TCMT-PURCH-ADJ-RTL-TY / 1000.00.                      57920000
579700                                                                  57930000
579800     COMPUTE PV-PERCENT ROUNDED = TCMT-INITIAL-MARKON-TY * PC-100 57940000
579900           / TCMT-RECEIPTS-RTL-TY                                 57950000
580000          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     57960000
580100     MOVE PV-PERCENT             TO DL-AP-INIT-MARKON-TY.         57970000
580200     COMPUTE PV-PERCENT ROUNDED = TCMT-NET-MARKON-TY * PC-100     57980000
580300           / TCMT-RETAIL-PURCH-TY                                 57990000
580400          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     58000000
580500     MOVE PV-PERCENT             TO DL-AP-NET-MARKON-TY.          58010000
580600*    COMPUTE DL-AP-PURCH-ADJ-RETAIL ROUNDED =                     58020000
580700*                             TCMT-PURCH-ADJ-RETAIL / 1000.00.    58030000
580800******  LAST YEAR  ***********************************************58040000
580900*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            58050000
581000     IF PV-HDG-START-CCYY-LY = PC-1998                            58060000
581100         CONTINUE                                                 58070000
581200     ELSE                                                         58080000
581300*    COMPUTE DL-AP-PURCH-ADJ-COST-LY ROUNDED =                    58090000
581400*                             TCMT-PURCH-ADJ-COST-LY / 1000.00.   58100000
581500*    COMPUTE DL-AP-NET-COST-LY ROUNDED =                          58110000
581600*                             TCMT-NET-COST-LY / 1000.00.         58120000
581700*    COMPUTE DL-AP-RTL-PURCH-LY ROUNDED =                         58130000
581800*                             TCMT-RETAIL-PURCH-LY / 1000.00.     58140000
581900         COMPUTE DL-AP-RECEIPTS-COST-LY ROUNDED =                 58150000
582000                TCMT-RECEIPTS-COST-LY / 1000.00                   58160000
582100         COMPUTE DL-AP-RECEIPTS-RETAIL-LY ROUNDED =               58170000
582200                TCMT-RECEIPTS-RTL-LY / 1000.00                    58180000
582300         COMPUTE DL-AP-PURCHASE-ADJ-COST-LY ROUNDED =             58190000
582400                TCMT-PURCH-ADJ-COST-LY / 1000.00                  58200000
582500         COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-LY ROUNDED =           58210000
582600                TCMT-PURCH-ADJ-RTL-LY / 1000.00                   58220000
582700                                                                  58230000
582800         COMPUTE PV-PERCENT ROUNDED =                             58240000
582900                TCMT-INITIAL-MARKON-LY * PC-100                   58250000
583000               / TCMT-RECEIPTS-RTL-LY                             58260000
583100              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  58270000
583200         END-COMPUTE                                              58280000
583300         MOVE PV-PERCENT              TO DL-AP-INIT-MARKON-LY     58290000
583400       COMPUTE PV-PERCENT ROUNDED = TCMT-NET-MARKON-LY * PC-100   58300000
583500               / TCMT-RETAIL-PURCH-LY                             58310000
583600              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  58320000
583700         END-COMPUTE                                              58330000
583800         MOVE PV-PERCENT         TO DL-AP-NET-MARKON-LY           58340000
583900     END-IF.                                                      58350000
584000                                                                  58360000
584100     MOVE DL-AP-DETAIL-LINE      TO RR-REPORT-RECORD.             58370000
584200*    SET PI-PRINT-BACK           TO TRUE.                         58380000
584300     MOVE 1                      TO PA-LINE-NO.                   58390000
584400                                                                  58400000
584500*    PERFORM 6000-CHECK-AP-DETAIL-GT-ZERO.                        58410000
584600*    IF PI-PRINT-DETAIL                                           58420000
584700         PERFORM 5000-WRITE-REPORT-LINE                           58430000
584800*    ELSE                                                         58440000
584900*        MOVE DL-AP-NO-DETAIL    TO RR-REPORT-RECORD              58450000
585000*        PERFORM 5000-WRITE-REPORT-LINE                           58460000
585100*    END-IF.                                                      58470000
585200     MOVE BL-BAR-LINE            TO RR-REPORT-RECORD.             58480000
585300     MOVE 1                      TO PA-LINE-NO.                   58490000
585400     PERFORM 5000-WRITE-REPORT-LINE.                              58500000
585500*                                                                 58510000
585600 4420-CURRENT-MONTH-SALES.                                        58520000
585700******************************************************************58530000
585800*  PRINTS THE SALES CURRENT MONTH TOTAL.                         *58540000
585900*                                                                *58550000
586000*  PERFORMED BY 4400-VENDOR-TOTAL-CURRENT-MTH.                   *58560000
586100******************************************************************58570000
586200*                                                                *58580000
586300*  SALES                                                         *58590000
586400*                                                                *58600000
586500***** THIS YEAR **************************************************58610000
586600     MOVE 1 TO PA-LINE-NO.                                        58620000
586700     MOVE  H8-HEADING8A      TO RR-REPORT-RECORD.                 58630000
586800     PERFORM 5000-WRITE-REPORT-LINE.                              58640000
586900     MOVE  H8-HEADING8B      TO RR-REPORT-RECORD.                 58650000
587000     PERFORM 5000-WRITE-REPORT-LINE.                              58660000
587100     MOVE 1 TO PA-LINE-NO.                                        58670000
587200                                                                  58680000
587300     MOVE PC-TOTAL                    TO DL-SL-TOTAL.             58690000
587400                                                                  58700000
587500*                                                                 58710000
587600     COMPUTE DL-SL-TOTAL-SALES-TY ROUNDED =                       58720000
587700                            TCMT-TOTAL-SALES-TY / 1000.00.        58730000
587800     COMPUTE DL-SL-REGULAR-SALES-TY ROUNDED =                     58740000
587900                            TCMT-REGULAR-SALES-TY / 1000.00.      58750000
588000     COMPUTE DL-SL-PROMO-SALES-TY ROUNDED =                       58760000
588100                            TCMT-PROMO-SALES-TY / 1000.00.        58770000
588200     COMPUTE DL-SL-GOLDSTAR-SALES-TY ROUNDED =                    58780000
588300                            TCMT-GOLDSTAR-SALES-TY / 1000.00.     58790000
588400     COMPUTE DL-SL-CLEAR-SALES-TY ROUNDED =                       58800000
588500                            TCMT-CLEAR-SALES-TY / 1000.00.        58810000
588600     COMPUTE DL-SL-UNKWN-SALES-TY ROUNDED =                       58820000
588700                            TCMT-UNKWN-SALES-TY / 1000.00.        58830000
588800                                                                  58840000
588900***** LAST YEAR **************************************************58850000
589000*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            58860000
589100     IF PV-HDG-START-CCYY-LY = PC-1998                            58870000
589200         CONTINUE                                                 58880000
589300     ELSE                                                         58890000
589400         COMPUTE DL-SL-TOTAL-SALES-LY ROUNDED =                   58900000
589500                TCMT-TOTAL-SALES-LY / 1000.00                     58910000
589600         COMPUTE DL-SL-REGULAR-SALES-LY ROUNDED =                 58920000
589700                TCMT-REGULAR-SALES-LY / 1000.00                   58930000
589800         COMPUTE DL-SL-PROMO-SALES-LY ROUNDED =                   58940000
589900                TCMT-PROMO-SALES-LY / 1000.00                     58950000
590000         COMPUTE DL-SL-GOLDSTAR-SALES-LY ROUNDED =                58960000
590100                TCMT-GOLDSTAR-SALES-LY / 1000.00                  58970000
590200         COMPUTE DL-SL-CLEAR-SALES-LY ROUNDED =                   58980000
590300                TCMT-CLEAR-SALES-LY / 1000.00                     58990000
590400         COMPUTE DL-SL-UNKWN-SALES-LY ROUNDED =                   59000000
590500                TCMT-UNKWN-SALES-LY / 1000.00                     59010000
590600     END-IF.                                                      59020000
590700                                                                  59030000
590800     MOVE DL-SL-DETAIL-LINE TO RR-REPORT-RECORD.                  59040000
590900*    SET PI-PRINT-BACK TO TRUE.                                   59050000
591000     MOVE 1 TO PA-LINE-NO.                                        59060000
591100*    PERFORM 6100-CHECK-SL-DETAIL-GT-ZERO.                        59070000
591200*    IF PI-PRINT-DETAIL                                           59080000
591300         PERFORM 5000-WRITE-REPORT-LINE                           59090000
591400*    ELSE                                                         59100000
591500*        MOVE DL-SALES-NO-DETAIL TO RR-REPORT-RECORD              59110000
591600*        PERFORM 5000-WRITE-REPORT-LINE                           59120000
591700*    END-IF.                                                      59130000
591800     MOVE BL-BAR-LINE TO RR-REPORT-RECORD.                        59140000
591900     MOVE 1 TO PA-LINE-NO.                                        59150000
592000     PERFORM 5000-WRITE-REPORT-LINE.                              59160000
592100*                                                                 59170000
592200 4430-CURRENT-MONTH-PC.                                           59180000
592300******************************************************************59190000
592400*  PRINTS THE PC CURRENT MONTH TOTAL                             *59200000
592500*                                                                *59210000
592600*  PERFORMED BY 4400-VENDOR-TOTAL-CURRENT-MTH.                   *59220000
592700******************************************************************59230000
592800*                                                                *59240000
592900*    PC                                                          *59250000
593000*                                                                *59260000
593100****** THIS YEAR *************************************************59270000
593200     MOVE 1 TO PA-LINE-NO.                                        59280000
593300     MOVE  H9-HEADING9A      TO RR-REPORT-RECORD.                 59290000
593400     PERFORM 5000-WRITE-REPORT-LINE.                              59300000
593500     MOVE  H9-HEADING9B      TO RR-REPORT-RECORD.                 59310000
593600     PERFORM 5000-WRITE-REPORT-LINE.                              59320000
593700     MOVE 1 TO PA-LINE-NO.                                        59330000
593800                                                                  59340000
593900     MOVE PC-TOTAL                    TO DL-PC-TOTAL.             59350000
594000                                                                  59360000
594100     COMPUTE DL-PC-TOTAL-MKDN-TY ROUNDED =                        59370000
594200                          TCMT-TOTAL-MKDN-TY / 1000.00.           59380000
594300     COMPUTE DL-PC-STORE-MKDN-TY ROUNDED =                        59390000
594400                          TCMT-STORE-MKDN-TY / 1000.00.           59400000
594500     COMPUTE DL-PC-BUYER-MKDN-TY ROUNDED =                        59410000
594600                          TCMT-BUYER-MKDN-TY / 1000.00.           59420000
594700     COMPUTE DL-PC-PLU-MKDN-TY ROUNDED =                          59430000
594800                          TCMT-PLU-MKDN-TY / 1000.00.             59440000
594900     COMPUTE DL-PC-PERM-MKDN-TY ROUNDED =                         59450000
595000                          TCMT-PERM-MKDN-TY / 1000.00.            59460000
595100     COMPUTE DL-PC-OTHER-MKDN-TY ROUNDED =                        59470000
595200                          TCMT-OTHER-MKDN-TY / 1000.00.           59480000
595300     COMPUTE PV-PERCENT ROUNDED = TCMT-TOTAL-MKDN-TY              59490000
595400           * PC-100 / TCMT-TOTAL-SALES-TY                         59500000
595500          ON SIZE ERROR MOVE 0 TO PV-PERCENT                      59510000
595600     END-COMPUTE.                                                 59520000
595700     MOVE PV-PERCENT                  TO DL-PC-MKDN-PCT-SLS-TY.   59530000
595800     COMPUTE DL-PC-TOTAL-MKUP-TY ROUNDED =                        59540000
595900            TCMT-TOTAL-MKUP-TY / 1000.00.                         59550000
596000     COMPUTE DL-PC-DEBIT-ALLOW-TY ROUNDED =                       59560000
596100            TCMT-DEBIT-ALLOW-TY / 1000.00.                        59570000
596200                                                                  59580000
596300****** LAST YEAR ************************************************ 59590000
596400*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    59600000
596500*     IF PV-HDG-START-CCYY-LY = PC-1998                           59610000
596600      IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                59620000
596700         CONTINUE                                                 59630000
596800     ELSE                                                         59640000
596900         COMPUTE DL-PC-TOTAL-MKDN-LY ROUNDED =                    59650000
597000                TCMT-TOTAL-MKDN-LY / 1000.00                      59660000
597100         COMPUTE PV-PERCENT ROUNDED = TCMT-TOTAL-MKDN-LY          59670000
597200               * PC-100 / TCMT-TOTAL-SALES-LY                     59680000
597300              ON SIZE ERROR MOVE 0 TO PV-PERCENT                  59690000
597400         END-COMPUTE                                              59700000
597500         MOVE PV-PERCENT       TO DL-PC-MKDN-PCT-SLS-LY           59710000
597600         COMPUTE DL-PC-PLU-MKDN-LY ROUNDED =                      59720000
597700                TCMT-PLU-MKDN-LY / 1000.00                        59730000
597800         COMPUTE DL-PC-PERM-MKDN-LY ROUNDED =                     59740000
597900                TCMT-PERM-MKDN-LY / 1000.00                       59750000
598000         COMPUTE DL-PC-OTHER-MKDN-LY ROUNDED =                    59760000
598100                TCMT-OTHER-MKDN-LY / 1000.00                      59770000
598200         COMPUTE DL-PC-TOTAL-MKUP-LY ROUNDED =                    59780000
598300                TCMT-TOTAL-MKUP-LY / 1000.00                      59790000
598400     END-IF.                                                      59800000
598500                                                                  59810000
598600     MOVE DL-PC-DETAIL-LINE TO RR-REPORT-RECORD.                  59820000
598700*    SET PI-PRINT-BACK TO TRUE.                                   59830000
598800     MOVE 1 TO PA-LINE-NO.                                        59840000
598900*    PERFORM 6200-CHECK-PC-DETAIL-GT-ZERO.                        59850000
599000*    IF PI-PRINT-DETAIL                                           59860000
599100         PERFORM 5000-WRITE-REPORT-LINE                           59870000
599200*    ELSE                                                         59880000
599300*        MOVE DL-PC-NO-DETAIL TO RR-REPORT-RECORD                 59890000
599400*        PERFORM 5000-WRITE-REPORT-LINE                           59900000
599500*    END-IF.                                                      59910000
599600     MOVE BL-BAR-LINE TO RR-REPORT-RECORD.                        59920000
599700     MOVE 1 TO PA-LINE-NO.                                        59930000
599800     PERFORM 5000-WRITE-REPORT-LINE.                              59940000
599900*                                                                 59950000
600000 4440-CURRENT-MONTH-MISC.                                         59960000
600100******************************************************************59970000
600200*  PRINTS THE MISC CURRENT MONTH TOTAL.                          *59980000
600300*                                                                *59990000
600400*  PERFORMED BY 4400-VENDOR-TOTAL-CURRENT-MTH.                   *60000000
600500******************************************************************60010000
600600*                                                                *60020000
600700*   MISC                                                         *60030000
600800*                                                                *60040000
600900******  THIS YEAR ************************************************60050000
601000                                                                  60060000
601100     MOVE 1                           TO PA-LINE-NO.              60070000
601200     MOVE  H10-HEADING10A             TO RR-REPORT-RECORD.        60080000
601300     PERFORM 5000-WRITE-REPORT-LINE.                              60090000
601400     MOVE  H10-HEADING10B             TO RR-REPORT-RECORD.        60100000
601500     PERFORM 5000-WRITE-REPORT-LINE.                              60110000
601600     MOVE 1                           TO PA-LINE-NO.              60120000
601700                                                                  60130000
601800     MOVE PC-TOTAL                         TO DL-MI-TOTAL.        60140000
601900     COMPUTE DL-MI-GROSS-MARGN-TY ROUNDED =                       60150000
602000            TCMT-GROSS-MARGN-TY / 1000.00.                        60160000
602100*    COMPUTE PV-PERCENT ROUNDED = TCMT-GROSS-MARGN-TY             60170000
602200*          * PC-100 / TCMT-TOTAL-SALES-TY                         60180000
602300*         ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     60190000
602400     COMPUTE PV-PERCENT ROUNDED =                                 60200000
602500           ((TCMT-GROSS-MARGN-TY - TUVRT-GROSS-MARGN-TY)          60210000
602600       * PC-100) / (TCMT-TOTAL-SALES-TY - TUVRT-TOTAL-SALES-TY)   60220000
602700          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     60230000
602800     MOVE PV-PERCENT           TO DL-MI-GR-MARGN-PCT-TY.          60240000
602900                                                                  60250000
603000* J  COMPUTE PV-PERCENT ROUNDED =                                 60260000
603100* J         (TCMT-RETAIL-PURCH-TY - TCMT-NET-COST-TY)             60270000
603200* J        * PC-100 / TCMT-RETAIL-PURCH-TY                        60280000
603300* J       ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     60290000
603400* J  MOVE PV-PERCENT                  TO DL-MI-MARKON-PCT-TY.     60300000
603500                                                                  60310000
603600     COMPUTE DL-MI-END-INV-COST-TY ROUNDED =                      60320000
603700            TCMT-END-INV-COST-TY / 1000.00.                       60330000
603800     COMPUTE DL-MI-END-INV-RTL-TY ROUNDED =                       60340000
603900            TCMT-END-INV-RTL-TY / 1000.00.                        60350000
604000     COMPUTE DL-MI-SHRINK-DLR-TY ROUNDED =                        60360000
604100            TCMT-SHRINK-DLR-TY / 1000.00.                         60370000
C14666     COMPUTE PV-SHK-PERCENT ROUNDED =                             60380001
604300            TCMT-SHRINK-DLR-TY * PC-100 /                         60390000
604400            TCMT-TOTAL-SALES-TY                                   60400000
C14666          ON SIZE ERROR MOVE ZERO TO PV-SHK-PERCENT.              60410001
C14666     MOVE PV-SHK-PERCENT               TO DL-MI-SHRINK-PCT-TY.    60420001
604700     COMPUTE DL-MI-INV-ADJ-TY ROUNDED =                           60430000
604800            TCMT-INV-ADJ-TY / 1000.00.                            60440000
604900     COMPUTE DL-MI-RET-TO-VENDR-TY ROUNDED =                      60450000
605000            TCMT-RET-TO-VENDR-TY / 1000.00.                       60460000
605100                                                                  60470000
605200******  LAST YEAR *********************************************** 60480000
605300*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    60490000
605400*    IF PV-HDG-START-CCYY-LY = PC-1998                            60500000
605500     IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                 60510000
605600         CONTINUE                                                 60520000
605700     ELSE                                                         60530000
605800         COMPUTE DL-MI-GROSS-MARGN-LY ROUNDED =                   60540000
605900                TCMT-GROSS-MARGN-LY / 1000.00                     60550000
606000*        COMPUTE PV-PERCENT ROUNDED = TCMT-GROSS-MARGN-LY         60560000
606100*              * PC-100 / TCMT-TOTAL-SALES-LY                     60570000
606200*             ON SIZE ERROR MOVE 0 TO PV-PERCENT                  60580000
606300     COMPUTE PV-PERCENT ROUNDED =                                 60590000
606400           ((TCMT-GROSS-MARGN-LY - TUVRT-GROSS-MARGN-LY)          60600000
606500       * PC-100) / (TCMT-TOTAL-SALES-LY - TUVRT-TOTAL-SALES-LY)   60610000
606600          ON SIZE ERROR MOVE 0 TO PV-PERCENT                      60620000
606700         END-COMPUTE                                              60630000
606800         MOVE PV-PERCENT           TO DL-MI-GR-MARGN-PCT-LY       60640000
606900         COMPUTE DL-MI-END-INV-RTL-LY ROUNDED =                   60650000
607000                TCMT-END-INV-RTL-LY / 1000.00                     60660000
607100         COMPUTE DL-MI-SHRINK-DLR-LY ROUNDED =                    60670000
607200                TCMT-SHRINK-DLR-LY / 1000.00                      60680000
607300         COMPUTE DL-MI-INV-ADJ-LY ROUNDED =                       60690000
607400                TCMT-INV-ADJ-LY / 1000.00                         60700000
607500     END-IF.                                                      60710000
607600                                                                  60720000
607700     MOVE DL-MI-DETAIL-LINE             TO RR-REPORT-RECORD.      60730000
607800*    SET PI-PRINT-BACK                  TO TRUE.                  60740000
607900     MOVE 1                             TO PA-LINE-NO.            60750000
608000*    PERFORM 6300-CHECK-MI-DETAIL-GT-ZERO.                        60760000
608100*    IF PI-PRINT-DETAIL                                           60770000
608200         PERFORM 5000-WRITE-REPORT-LINE                           60780000
608300*    ELSE                                                         60790000
608400*        MOVE DL-MISC-NO-DETAIL         TO RR-REPORT-RECORD       60800000
608500*        PERFORM 5000-WRITE-REPORT-LINE                           60810000
608600*    END-IF.                                                      60820000
608700     MOVE BL-BAR-LINE                   TO RR-REPORT-RECORD.      60830000
608800     MOVE 1                             TO PA-LINE-NO.            60840000
608900     PERFORM 5000-WRITE-REPORT-LINE.                              60850000
609000                                                                  60860000
609100*                                                                 60870000
609200 4450-CURRENT-MONTH-RECAP.                                        60880000
609300******************************************************************60890000
609400*  PRINTS THE RECAP CURRENT MONTH TOTAL.                         *60900000
609500*                                                                *60910000
609600*  PERFORMED BY 4400-VENDOR-TOTAL-CURRENT-MTH.                   *60920000
609700******************************************************************60930000
609800*                                                                *60940000
609900*  RECAP SUMM                                                    *60950000
610000*                                                                *60960000
610100******  THIS YEAR  ***********************************************60970000
610200     MOVE PV-MON-DATE-TY          TO H6-DATE-RANGE-TY.            60980000
610300     MOVE PV-MON-DATE-LY          TO H6-DATE-RANGE-LY.            60990000
610400     MOVE H6-HEADING6             TO RR-REPORT-RECORD.            61000000
610500     MOVE 1                       TO PA-LINE-NO.                  61010000
610600     PERFORM 5000-WRITE-REPORT-LINE.                              61020000
610700                                                                  61030000
610800     MOVE PV-MON-DATE-TY          TO H6-DATE-RANGE-TY.            61040000
610900     MOVE PV-MON-DATE-LY          TO H6-DATE-RANGE-LY.            61050000
611000     SET PI-PRINT-BACK            TO TRUE.                        61060000
611100     MOVE H6-HEADING6             TO RR-REPORT-RECORD.            61070000
611200     MOVE 1                       TO PA-LINE-NO.                  61080000
611300     PERFORM 5000-WRITE-REPORT-LINE.                              61090000
611400                                                                  61100000
611500     SET PI-PRINT-BOTH TO TRUE.                                   61110000
611600     MOVE BL-BAR-LINE             TO RR-REPORT-RECORD.            61120000
611700     MOVE 1                       TO PA-LINE-NO.                  61130000
611800     PERFORM 5000-WRITE-REPORT-LINE.                              61140000
611900     MOVE H11-HEADING11A          TO RR-REPORT-RECORD             61150000
612000     PERFORM 5000-WRITE-REPORT-LINE.                              61160000
612100     MOVE H11-HEADING11B          TO RR-REPORT-RECORD             61170000
612200     PERFORM 5000-WRITE-REPORT-LINE.                              61180000
612300                                                                  61190000
612400     MOVE PC-TOTAL                 TO DL-SR-TOTAL.                61200000
612500                                                                  61210000
612600*    COMPUTE DL-SR-GROSS-COST ROUNDED =                           61220000
612700*                               TCMT-GROSS-COST / 1000.00.        61230000
612800*    COMPUTE DL-SR-PURCH-ADJ-COST-TY ROUNDED =                    61240000
612900*                               TCMT-PURCH-ADJ-COST-TY / 1000.00. 61250000
613000*    COMPUTE DL-SR-NET-COST-TY ROUNDED =                          61260000
613100*                               TCMT-NET-COST-TY / 1000.00.       61270000
613200*    COMPUTE DL-SR-RETAIL-PURCH-TY ROUNDED =                      61280000
613300*                               TCMT-RETAIL-PURCH-TY / 1000.00.   61290000
613400     COMPUTE DL-SR-RECEIPTS-COST-TY ROUNDED =                     61300000
613500             TCMT-RECEIPTS-COST-TY  / 1000.00.                    61310000
613600     COMPUTE DL-SR-RECEIPTS-RETAIL-TY ROUNDED =                   61320000
613700             TCMT-RECEIPTS-RTL-TY / 1000.00.                      61330000
613800     COMPUTE DL-SR-PURCHASE-ADJ-COST-TY ROUNDED =                 61340000
613900             TCMT-PURCH-ADJ-COST-TY / 1000.00.                    61350000
614000     COMPUTE DL-SR-PURCHASE-ADJ-RETAIL-TY ROUNDED =               61360000
614100             TCMT-PURCH-ADJ-RTL-TY / 1000.00.                     61370000
614200                                                                  61380000
614300*-- TO BRING THE CUM-MKUP PCT MORE IN LINE WITH LEDGER            61390000
614400     SUBTRACT TUVRT-STD-PURCH-RETAIL-TY FROM                      61400000
614500              TCMT-CUM-TO-DATE-PURCH-RTL-TY.                      61410000
614600     SUBTRACT TUVRT-STD-PURCH-COST-TY FROM                        61420000
614700              TCMT-CUM-TO-DATE-PURCH-COST-TY.                     61430000
614800     COMPUTE PV-PERCENT ROUNDED =                                 61440000
614900           ( TCMT-CUM-TO-DATE-PURCH-RTL-TY                        61450000
615000           - TCMT-CUM-TO-DATE-PURCH-COST-TY ) * 100.00            61460000
615100           / TCMT-CUM-TO-DATE-PURCH-RTL-TY                        61470000
615200          ON SIZE ERROR MOVE 100 TO PV-PERCENT.                   61480000
615300     MOVE PV-PERCENT             TO DL-SR-CUMM-MARKUP-PCT-TY.     61490000
615400     COMPUTE DL-SR-TOTAL-SALES-TY ROUNDED =                       61500000
615500             TCMT-TOTAL-SALES-TY / 1000.00.                       61510000
615600     COMPUTE DL-SR-TOTAL-MKDN-TY ROUNDED =                        61520000
615700             TCMT-TOTAL-MKDN-TY / 1000.00.                        61530000
615800     COMPUTE PV-PERCENT ROUNDED = TCMT-TOTAL-MKDN-TY * PC-100     61540000
615900           / TCMT-TOTAL-SALES-TY                                  61550000
616000          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     61560000
616100     MOVE PV-PERCENT           TO DL-SR-TOTAL-MKDN-PCT-TY.        61570000
616200*    COMPUTE PV-PERCENT ROUNDED = TCMT-GROSS-MARGN-TY             61580000
616300*          * PC-100 / TCMT-TOTAL-SALES-TY                         61590000
616400*         ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     61600000
616500     COMPUTE PV-PERCENT ROUNDED =                                 61610000
616600           ((TCMT-GROSS-MARGN-TY - TUVRT-GROSS-MARGN-TY)          61620000
616700      * PC-100) / (TCMT-TOTAL-SALES-TY - TUVRT-TOTAL-SALES-TY)    61630000
616800          ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     61640000
616900     MOVE PV-PERCENT           TO DL-SR-GROSS-MARGN-PCT-TY.       61650000
617000     COMPUTE DL-SR-END-INV-RTL-TY ROUNDED =                       61660000
617100             TCMT-END-INV-RTL-TY / 1000.00.                       61670000
617200                                                                  61680000
617300* -  COMPUTE PV-PERCENT ROUNDED =  TCMT-INITIAL-MARKON-TY * 100   61690000
617400* -        / TCMT-RETAIL-PURCH-TY                                 61700000
617500* --      ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     61710000
617600* -  MOVE PV-PERCENT             TO DL-AP-INIT-MARKON-TY.         61720000
617700* -  COMPUTE PV-PERCENT ROUNDED =  TCMT-NET-MARKON-TY * PC-100    61730000
617800* -        / TCMT-RETAIL-PURCH-TY                                 61740000
617900* -       ON SIZE ERROR MOVE 0 TO PV-PERCENT.                     61750000
618000* -  MOVE PV-PERCENT             TO DL-AP-NET-MARKON-TY.          61760000
618100*    COMPUTE DL-AP-PURCH-ADJ-RETAIL ROUNDED =                     61770000
618200*                              TCMT-PURCH-ADJ-RETAIL / 1000.00.   61780000
618300******  LAST YEAR  ***********************************************61790000
618400*    COMPUTE DL-AP-PURCH-ADJ-COST-LY ROUNDED =                    61800000
618500*                              TCMT-PURCH-ADJ-COST-LY / 1000.00.  61810000
618600*    COMPUTE DL-AP-NET-COST-LY ROUNDED =                          61820000
618700*                              TCMT-NET-COST-LY / 1000.00.        61830000
618800*    COMPUTE DL-AP-RTL-PURCH-LY ROUNDED =                         61840000
618900*                              TCMT-RETAIL-PURCH-LY / 1000.00.    61850000
619000                                                                  61860000
619100*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            61870000
619200*    IF PV-HDG-START-CCYY-LY = PC-1998                            61880000
619300*        CONTINUE                                                 61890000
619400*    ELSE                                                         61900000
619500*        COMPUTE DL-AP-RECEIPTS-COST-LY ROUNDED =                 61910000
619600*                TCMT-RECEIPTS-COST-LY / 1000.00                  61920000
619700*        COMPUTE DL-AP-RECEIPTS-RETAIL-LY ROUNDED =               61930000
619800*                TCMT-RECEIPTS-RTL-LY / 1000.00                   61940000
619900*        COMPUTE DL-AP-PURCHASE-ADJ-COST-LY ROUNDED =             61950000
620000*                TCMT-PURCH-ADJ-COST-LY / 1000.00                 61960000
620100*        COMPUTE DL-AP-PURCHASE-ADJ-RETAIL-LY ROUNDED =           61970000
620200*                TCMT-PURCH-ADJ-RTL-LY / 1000.00                  61980000
620300*        COMPUTE PV-PERCENT ROUNDED =                             61990000
620400*               (TCMT-INITIAL-MARKON-LY * PC-100)                 62000000
620500*              / TCMT-RETAIL-PURCH-LY                             62010000
620600*             ON SIZE ERROR MOVE 0 TO PV-PERCENT                  62020000
620700*        END-COMPUTE                                              62030000
620800*        MOVE PV-PERCENT TO DL-AP-INIT-MARKON-LY                  62040000
620900*        COMPUTE PV-PERCENT ROUNDED =                             62050000
621000*               (TCMT-NET-MARKON-LY * PC-100)                     62060000
621100*              / TCMT-RETAIL-PURCH-LY                             62070000
621200*             ON SIZE ERROR MOVE 0 TO PV-PERCENT                  62080000
621300*        END-COMPUTE                                              62090000
621400*        MOVE PV-PERCENT         TO DL-AP-NET-MARKON-LY           62100000
621500*    END-IF.                                                      62110000
621600                                                                  62120000
621700     IF PV-HDG-START-CCYY-LY = PC-1998                            62130000
621800         CONTINUE                                                 62140000
621900     ELSE                                                         62150000
622000         COMPUTE DL-SR-NET-COST-LY ROUNDED =                      62160000
622100                TCMT-NET-COST-LY / 1000.00                        62170000
622200         COMPUTE DL-SR-RETAIL-PURCH-LY ROUNDED =                  62180000
622300                TCMT-RETAIL-PURCH-LY / 1000.00                    62190000
622400         COMPUTE DL-SR-TOTAL-SALES-LY ROUNDED =                   62200000
622500                TCMT-TOTAL-SALES-LY / 1000.00                     62210000
622600*--     DO NOT PRINT 1999 DATA (LAST YEAR)                        62220000
622700         IF PV-HDG-START-CCYY-LY = PC-1999                        62230000
622800             CONTINUE                                             62240000
622900         ELSE                                                     62250000
623000             SUBTRACT TUVRT-STD-PURCH-RETAIL-LY FROM              62260000
623100                      TCMT-CUM-TO-DATE-PURCH-RTL-LY               62270000
623200             SUBTRACT TUVRT-STD-PURCH-COST-LY FROM                62280000
623300                      TCMT-CUM-TO-DATE-PURCH-COST-LY              62290000
623400             COMPUTE PV-PERCENT ROUNDED =                         62300000
623500                   ( TCMT-CUM-TO-DATE-PURCH-RTL-LY                62310000
623600                   - TCMT-CUM-TO-DATE-PURCH-COST-LY ) * 100.00    62320000
623700                   / TCMT-CUM-TO-DATE-PURCH-RTL-LY                62330000
623800                  ON SIZE ERROR MOVE 100 TO PV-PERCENT            62340000
623900             END-COMPUTE                                          62350000
624000             MOVE PV-PERCENT TO DL-SR-CUMM-MARKUP-PCT-LY          62360000
624100             COMPUTE DL-SR-TOTAL-MKDN-LY ROUNDED =                62370000
624200                    TCMT-TOTAL-MKDN-LY / 1000.00                  62380000
624300*            COMPUTE PV-PERCENT ROUNDED = TCMT-GROSS-MARGN-LY     62390000
624400*                  * PC-100 / TCMT-TOTAL-SALES-LY                 62400000
624500         COMPUTE PV-PERCENT ROUNDED =                             62410000
624600               ((TCMT-GROSS-MARGN-LY - TUVRT-GROSS-MARGN-LY)      62420000
624700               * PC-100)                                          62430000
624800              / (TCMT-TOTAL-SALES-LY - TUVRT-TOTAL-SALES-LY)      62440000
624900                  ON SIZE ERROR MOVE 0 TO PV-PERCENT              62450000
625000             END-COMPUTE                                          62460000
625100             MOVE PV-PERCENT       TO DL-SR-GROSS-MARGN-PCT-LY    62470000
625200             COMPUTE DL-SR-END-INV-RTL-LY ROUNDED =               62480000
625300                    TCMT-END-INV-RTL-LY / 1000.00                 62490000
625400         END-IF                                                   62500000
625500     END-IF.                                                      62510000
625600                                                                  62520000
625700     MOVE DL-SR-DETAIL-LINE      TO RR-REPORT-RECORD.             62530000
625800*    SET PI-PRINT-BACK           TO TRUE.                         62540000
625900     MOVE 1                      TO PA-LINE-NO.                   62550000
626000                                                                  62560000
626100     PERFORM 6400-CHECK-SR-DETAIL-GT-ZERO.                        62570000
626200     IF PI-PRINT-DETAIL                                           62580000
626300         PERFORM 5000-WRITE-REPORT-LINE                           62590000
626400     END-IF.                                                      62600000
626500     MOVE BL-BAR-LINE            TO RR-REPORT-RECORD.             62610000
626600     MOVE 1                      TO PA-LINE-NO.                   62620000
626700     PERFORM 5000-WRITE-REPORT-LINE.                              62630000
626800                                                                  62640000
626900/                                                                 62650000
627000 5000-WRITE-REPORT-LINE.                                          62660000
627100******************************************************************62670000
627200*   5000-WRITE-REPORT-LINE                                       *62680000
627300*      PRINT REPORT-LINE.  THIS IS CONTROLLED BY AN INDICATOR,   *62690000
627400*      'PI-PRINT-IND'.  BEFORE THIS PARAGRAPH IS PERFORMED,      *62700000
627500*      THE INDICATOR IS FIRST SET TO INDICATE WHETHER LINE IS    *62710000
627600*      BE PRINTED AT THE FRONT, BACK OR BOTH.  WHEN A LINE IS TO *62720000
627700*      BE PRINTED AT THE FRONT, THIS LINE  IS PRINTED NORMALLY.  *62730000
627800*      WHEN THE LINE IS TO BE PRINTED AT THE BACK, THE LINE IS   *62740000
627900*      STORED TO A TABLE, WHICH IS PRINTED WHEN A BREAK          *62750000
628000*      IN REQ#, DEPT# OR ENT ID HAS OCCURRED.                    *62760000
628100*      PAGE-EJECTS OR LINE ADVANCING IS CONTROLLED BY A FIELD    *62770000
628200*      CALLED 'PA-LINE-NO'.                                      *62780000
628300*                                                                *62790000
628400*   PERFORMED BY:  2200-PROCESS-NAMES                            *62800000
628500*                  2300-PROCESS-AP                               *62810000
628600*                  2400-PROCESS-SALES                            *62820000
628700*                  2500-PROCESS-PC                               *62830000
628800*                  2600-PROCESS-MISC                             *62840000
628900*                  2821-PRINT-RECAP-HEADING                      *62850000
629000*                  2823-PRINT-RECAP-CLASS                        *62860000
629100*                  2824-PRINT-RECAP-TOTAL                        *62870000
629200*                  3100-PRINT-AP-YTD                             *62880000
629300*                  3110-PRINT-AP-CURR-MONTH                      *62890000
629400*                  3200-PRINT-SALES-TOTAL                        *62900000
629500*                  3210-PRINT-SALES-CURR-MONTH                   *62910000
629600*                  3220-PRINT-SALES-CURR-MONTH                   *62920000
629700*                  3300-PRINT-PC-TOTAL                           *62930000
629800*                  3310-PRINT-PC-CURR-MONTH                      *62940000
629900*                  3320-PRINT-PC-CURR-MONTH                      *62950000
630000*                  3400-PRINT-MISC-TOTAL                         *62960000
630100*                  3410-PRINT-MISC-CURR-MONTH                    *62970000
630200*                  3420-PRINT-MISC-CURR-MONTH                    *62980000
630300*                  4100-PRINT-TOTAL-PAGE                         *62990000
630400*                  4110-HEADING-RTN                              *63000000
630500*                  4120-PRINT-REPORT-AP-TOTAL                    *63010000
630600*                  4130-PRINT-REPORT-SALES-TOTAL                 *63020000
630700*                  4140-PRINT-REPORT-PC-TOTAL                    *63030000
630800*                  4150-PRINT-REPORT-MISC-TOTAL                  *63040000
630900*                  4160-PRINT-REPORT-RECAP-TOTAL                 *63050000
631000*                                                                *63060000
631100*                                                                *63070000
631200******************************************************************63080000
631300                                                                  63090000
631400     EVALUATE PI-PRINT-IND                                        63100000
631500         WHEN 'F'                                                 63110000
631600             IF PA-LINE-NO = 0                                    63120000
631700                 WRITE RR-REPORT-RECORD AFTER ADVANCING PAGE      63130000
631800             ELSE                                                 63140000
631900                 WRITE RR-REPORT-RECORD                           63150000
632000                            AFTER ADVANCING PA-LINE-NO LINES      63160000
632100             END-IF                                               63170000
632200         WHEN 'B'                                                 63180000
632300             IF PA-LINE-NO = 0                                    63190000
632400                 MOVE 1                 TO PA-LINE-COUNT          63200000
632500             ELSE                                                 63210000
632600                 ADD PA-LINE-NO TO PA-LINE-COUNT                  63220000
632700             END-IF                                               63230000
632800             MOVE RR-REPORT-RECORD                                63240000
632900                             TO PT-REPORT-LINE (PA-LINE-COUNT)    63250000
633000         WHEN 'H'                                                 63260000
633100             IF PA-LINE-NO = 0                                    63270000
633200                 WRITE RR-REPORT-RECORD AFTER ADVANCING PAGE      63280000
633300             ELSE                                                 63290000
633400                 WRITE RR-REPORT-RECORD                           63300000
633500                            AFTER ADVANCING PA-LINE-NO LINES      63310000
633600             END-IF                                               63320000
633700             IF PA-LINE-NO = 0                                    63330000
633800                 MOVE 1                 TO PA-LINE-COUNT          63340000
633900             ELSE                                                 63350000
634000                 ADD PA-LINE-NO TO PA-LINE-COUNT                  63360000
634100             END-IF                                               63370000
634200             MOVE RR-REPORT-RECORD                                63380000
634300                           TO PT-REPORT-LINE (PA-LINE-COUNT)      63390000
634400     END-EVALUATE.                                                63400000
634500                                                                  63410000
634600     INITIALIZE DL-AP-DETAIL-LINE.                                63420000
634700     INITIALIZE DL-SL-DETAIL-LINE.                                63430000
634800     INITIALIZE DL-PC-DETAIL-LINE.                                63440000
634900     INITIALIZE DL-MI-DETAIL-LINE.                                63450000
635000     INITIALIZE DL-SR-DETAIL-LINE.                                63460000
635100                                                                  63470000
635200/                                                                 63480000
635300 6000-CHECK-AP-DETAIL-GT-ZERO.                                    63490000
635400******************************************************************63500000
635500*   6000-CHECK-AP-DETAIL-GT-ZERO.                                *63510000
635600*      CHECK THE DOLLAR FIELDS IN THE DETAIL LINE IN ORDER TO    *63520000
635700*      DETERMINE IF ONE IS GOING TO BE GREATER THAN ZERO.  IF    *63530000
635800*      NO FIELDS WILL BE GREATER THAN ZERO THE DETAIL LINE IS    *63540000
635900*      SUBSEQUENTLY NOT PRINTED.                                 *63550000
636000*                                                                *63560000
636100******************************************************************63570000
636200                                                                  63580000
636300     SET PI-PRINT-DETAIL TO TRUE.                                 63590000
636400* DO NOT CHECK LAST YEAR IF LAST YEAR WAS 1998                    63600000
636500     IF PV-HDG-START-CCYY-LY = PC-1998                            63610000
636600         IF DL-AP-RECEIPTS-COST-TY       = SPACES AND             63620000
636700            DL-AP-RECEIPTS-RETAIL-TY     = SPACES AND             63630000
636800            DL-AP-PURCHASE-ADJ-COST-TY   = SPACES AND             63640000
636900            DL-AP-PURCHASE-ADJ-RETAIL-TY = SPACES AND             63650000
637000            DL-AP-INIT-MARKON-TY         = SPACES AND             63660000
637100            DL-AP-NET-MARKON-TY          = SPACES AND             63670000
637200            DL-AP-INIT-MARKON-TY         = SPACES AND             63680000
637300            DL-AP-NET-MARKON-TY          = SPACES                 63690000
637400         SET PI-NO-PRINT-DETAIL TO TRUE                           63700000
637500         INITIALIZE DL-AP-DETAIL-LINE                             63710000
637600         END-IF                                                   63720000
637700     ELSE                                                         63730000
637800         IF DL-AP-RECEIPTS-COST-TY       = SPACES AND             63740000
637900            DL-AP-RECEIPTS-RETAIL-TY     = SPACES AND             63750000
638000            DL-AP-PURCHASE-ADJ-COST-TY   = SPACES AND             63760000
638100            DL-AP-PURCHASE-ADJ-RETAIL-TY = SPACES AND             63770000
638200            DL-AP-INIT-MARKON-TY         = SPACES AND             63780000
638300            DL-AP-NET-MARKON-TY          = SPACES AND             63790000
638400            DL-AP-INIT-MARKON-TY         = SPACES AND             63800000
638500            DL-AP-NET-MARKON-TY          = SPACES AND             63810000
638600            DL-AP-RECEIPTS-COST-LY       = SPACES AND             63820000
638700            DL-AP-RECEIPTS-RETAIL-LY     = SPACES AND             63830000
638800            DL-AP-PURCHASE-ADJ-COST-LY   = SPACES AND             63840000
638900            DL-AP-PURCHASE-ADJ-RETAIL-LY = SPACES AND             63850000
639000            DL-AP-INIT-MARKON-LY         = SPACES AND             63860000
639100            DL-AP-NET-MARKON-LY          = SPACES                 63870000
639200             SET PI-NO-PRINT-DETAIL TO TRUE                       63880000
639300             INITIALIZE DL-AP-DETAIL-LINE                         63890000
639400         END-IF                                                   63900000
639500     END-IF.                                                      63910000
639600                                                                  63920000
639700/                                                                 63930000
639800 6100-CHECK-SL-DETAIL-GT-ZERO.                                    63940000
639900******************************************************************63950000
640000*   6100-CHECK-SL-DETAIL-GT-ZERO.                                *63960000
640100*      CHECK THE SALES DETAIL LINE DOLLAR FIELDS IN ORDER TO     *63970000
640200*      DETERMINE IF ONE IS GOING TO BE GREATER THAN ZERO.  IF    *63980000
640300*      NO FIELDS WILL BE GREATER THAN ZERO THE DETAIL LINE IS    *63990000
640400*      SUBSEQUENTLY NOT PRINTED.                                 *64000000
640500*                                                                *64010000
640600******************************************************************64020000
640700                                                                  64030000
640800     SET PI-PRINT-DETAIL TO TRUE.                                 64040000
640900                                                                  64050000
641000* DO NOT CHECK LAST YEAR IF LAST YEAR WAS 1998                    64060000
641100     IF PV-HDG-START-CCYY-LY = PC-1998                            64070000
641200         IF DL-SL-TOTAL-SALES-TY        = SPACES AND              64080000
641300            DL-SL-REGULAR-SALES-TY      = SPACES AND              64090000
641400            DL-SL-PROMO-SALES-TY        = SPACES AND              64100000
641500            DL-SL-GOLDSTAR-SALES-TY     = SPACES AND              64110000
641600            DL-SL-CLEAR-SALES-TY        = SPACES AND              64120000
641700            DL-SL-UNKWN-SALES-TY        = SPACES                  64130000
641800            SET PI-NO-PRINT-DETAIL TO TRUE                        64140000
641900        END-IF                                                    64150000
642000     ELSE                                                         64160000
642100         IF DL-SL-TOTAL-SALES-TY        = SPACES AND              64170000
642200            DL-SL-REGULAR-SALES-TY      = SPACES AND              64180000
642300            DL-SL-PROMO-SALES-TY        = SPACES AND              64190000
642400            DL-SL-GOLDSTAR-SALES-TY     = SPACES AND              64200000
642500            DL-SL-CLEAR-SALES-TY        = SPACES AND              64210000
642600            DL-SL-UNKWN-SALES-TY        = SPACES AND              64220000
642700            DL-SL-TOTAL-SALES-LY        = SPACES AND              64230000
642800            DL-SL-REGULAR-SALES-LY      = SPACES AND              64240000
642900            DL-SL-PROMO-SALES-LY        = SPACES AND              64250000
643000            DL-SL-GOLDSTAR-SALES-LY     = SPACES AND              64260000
643100            DL-SL-CLEAR-SALES-LY        = SPACES AND              64270000
643200            DL-SL-UNKWN-SALES-LY        = SPACES                  64280000
643300             SET PI-NO-PRINT-DETAIL TO TRUE                       64290000
643400         END-IF                                                   64300000
643500     END-IF.                                                      64310000
643600                                                                  64320000
643700/                                                                 64330000
643800 6200-CHECK-PC-DETAIL-GT-ZERO.                                    64340000
643900******************************************************************64350000
644000*   6200-CHECK-PC-DETAIL-GT-ZERO.                                *64360000
644100*      CHECK THE PRICE CHG DETAIL LINE DOLLAR FIELDS IN ORDER TO *64370000
644200*      DETERMINE IF ONE IS GOING TO BE GREATER THAN ZERO.  IF    *64380000
644300*      NO FIELDS WILL BE GREATER THAN ZERO THE DETAIL LINE IS    *64390000
644400*      SUBSEQUENTLY NOT PRINTED.                                 *64400000
644500*                                                                *64410000
644600******************************************************************64420000
644700                                                                  64430000
644800     SET PI-PRINT-DETAIL TO TRUE.                                 64440000
644900                                                                  64450000
645000*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    64460000
645100*    IF PV-HDG-START-CCYY-LY = PC-1998                            64470000
645200     IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                 64480000
645300         IF DL-PC-TOTAL-MKDN-TY         = SPACES AND              64490000
645400            DL-PC-STORE-MKDN-TY         = SPACES AND              64500000
645500            DL-PC-BUYER-MKDN-TY         = SPACES AND              64510000
645600            DL-PC-PLU-MKDN-TY           = SPACES AND              64520000
645700            DL-PC-PERM-MKDN-TY          = SPACES AND              64530000
645800            DL-PC-OTHER-MKDN-TY         = SPACES AND              64540000
645900            DL-PC-MKDN-PCT-SLS-TY       = SPACES AND              64550000
646000            DL-PC-TOTAL-MKUP-TY         = SPACES AND              64560000
646100            DL-PC-DEBIT-ALLOW-TY        = SPACES                  64570000
646200             SET PI-NO-PRINT-DETAIL TO TRUE                       64580000
646300         END-IF                                                   64590000
646400     ELSE                                                         64600000
646500         IF DL-PC-TOTAL-MKDN-TY         = SPACES AND              64610000
646600            DL-PC-STORE-MKDN-TY         = SPACES AND              64620000
646700            DL-PC-BUYER-MKDN-TY         = SPACES AND              64630000
646800            DL-PC-PLU-MKDN-TY           = SPACES AND              64640000
646900            DL-PC-PERM-MKDN-TY          = SPACES AND              64650000
647000            DL-PC-OTHER-MKDN-TY         = SPACES AND              64660000
647100            DL-PC-MKDN-PCT-SLS-TY       = SPACES AND              64670000
647200            DL-PC-TOTAL-MKUP-TY         = SPACES AND              64680000
647300            DL-PC-DEBIT-ALLOW-TY        = SPACES AND              64690000
647400            DL-PC-TOTAL-MKDN-LY         = SPACES AND              64700000
647500            DL-PC-MKDN-PCT-SLS-LY       = SPACES AND              64710000
647600            DL-PC-PLU-MKDN-LY           = SPACES AND              64720000
647700            DL-PC-PERM-MKDN-LY          = SPACES AND              64730000
647800            DL-PC-OTHER-MKDN-LY         = SPACES AND              64740000
647900            DL-PC-TOTAL-MKUP-LY         = SPACES                  64750000
648000             SET PI-NO-PRINT-DETAIL TO TRUE                       64760000
648100         END-IF                                                   64770000
648200     END-IF.                                                      64780000
648300                                                                  64790000
648400/                                                                 64800000
648500 6300-CHECK-MI-DETAIL-GT-ZERO.                                    64810000
648600******************************************************************64820000
648700*   6300-CHECK-MI-DETAIL-GT-ZERO.                                *64830000
648800*      CHECK THE MISC. DETAIL LINE DOLLAR FIELDS IN ORDER TO     *64840000
648900*      DETERMINE IF ONE IS GOING TO BE GREATER THAN ZERO.  IF    *64850000
649000*      NO FIELDS WILL BE GREATER THAN ZERO THE DETAIL LINE IS    *64860000
649100*      SUBSEQUENTLY NOT PRINTED.                                 *64870000
649200*                                                                *64880000
649300******************************************************************64890000
649400                                                                  64900000
649500     SET PI-PRINT-DETAIL TO TRUE.                                 64910000
649600                                                                  64920000
649700*-- DO NOT PRINT 1998 OR 1999 DATA (LAST YEAR)                    64930000
649800*     IF PV-HDG-START-CCYY-LY = PC-1998                           64940000
649900      IF PV-HDG-START-CCYY-LY = PC-1998 OR PC-1999                64950000
650000         IF DL-MI-GROSS-MARGN-TY        = SPACES AND              64960000
650100            DL-MI-GR-MARGN-PCT-TY       = SPACES AND              64970000
650200*           DL-MI-MARKON-PCT-TY         = SPACES AND              64980000
650300            DL-MI-END-INV-COST-TY       = SPACES AND              64990000
650400            DL-MI-END-INV-RTL-TY        = SPACES AND              65000000
650500            DL-MI-SHRINK-DLR-TY         = SPACES AND              65010000
650600            DL-MI-SHRINK-PCT-TY         = SPACES AND              65020000
650700            DL-MI-INV-ADJ-TY            = SPACES AND              65030000
650800            DL-MI-RET-TO-VENDR-TY       = SPACES                  65040000
650900             SET PI-NO-PRINT-DETAIL TO TRUE                       65050000
651000         END-IF                                                   65060000
651100     ELSE                                                         65070000
651200         IF DL-MI-GROSS-MARGN-TY        = SPACES AND              65080000
651300            DL-MI-GR-MARGN-PCT-TY       = SPACES AND              65090000
651400*           DL-MI-MARKON-PCT-TY         = SPACES AND              65100000
651500            DL-MI-END-INV-COST-TY       = SPACES AND              65110000
651600            DL-MI-END-INV-RTL-TY        = SPACES AND              65120000
651700            DL-MI-SHRINK-DLR-TY         = SPACES AND              65130000
651800            DL-MI-SHRINK-PCT-TY         = SPACES AND              65140000
651900            DL-MI-INV-ADJ-TY            = SPACES AND              65150000
652000            DL-MI-RET-TO-VENDR-TY       = SPACES AND              65160000
652100            DL-MI-GROSS-MARGN-LY        = SPACES AND              65170000
652200            DL-MI-GR-MARGN-PCT-LY       = SPACES AND              65180000
652300            DL-MI-END-INV-RTL-LY        = SPACES AND              65190000
652400            DL-MI-SHRINK-DLR-LY         = SPACES AND              65200000
652500            DL-MI-INV-ADJ-LY            = SPACES                  65210000
652600             SET PI-NO-PRINT-DETAIL TO TRUE                       65220000
652700         END-IF                                                   65230000
652800     END-IF.                                                      65240000
652900                                                                  65250000
653000/                                                                 65260000
653100 6400-CHECK-SR-DETAIL-GT-ZERO.                                    65270000
653200******************************************************************65280000
653300*   6400-CHECK-SR-DETAIL-GT-ZERO.                                *65290000
653400*      CHECK THE SUMMARY RECAP DETAIL LINE DOLLAR FIELDS IN ORDER*65300000
653500*      TO DETERMINE IF ONE IS GOING TO BE GREATER THAN ZERO.  IF *65310000
653600*      NO FIELDS WILL BE GREATER THAN ZERO THE DETAIL LINE IS    *65320000
653700*      SUBSEQUENTLY NOT PRINTED.                                 *65330000
653800*                                                                *65340000
653900******************************************************************65350000
654000                                                                  65360000
654100     SET PI-PRINT-DETAIL TO TRUE.                                 65370000
654200                                                                  65380000
654300*    IF DL-SR-GROSS-COST                = SPACES AND              65390000
654400*       DL-SR-PURCH-ADJ-COST-TY         = SPACES AND              65400000
654500*       DL-SR-NET-COST-TY               = SPACES AND              65410000
654600*       DL-SR-RETAIL-PURCH-TY           = SPACES AND              65420000
654700*-- DO NOT PRINT 1998 DATA (LAST YEAR)                            65430000
654800     IF PV-HDG-START-CCYY-LY = PC-1998                            65440000
654900         IF DL-AP-RECEIPTS-COST-TY       = SPACES AND             65450000
655000            DL-AP-RECEIPTS-RETAIL-TY     = SPACES AND             65460000
655100            DL-AP-PURCHASE-ADJ-COST-TY   = SPACES AND             65470000
655200            DL-AP-PURCHASE-ADJ-RETAIL-TY = SPACES AND             65480000
655300            DL-SR-CUMM-MARKUP-PCT-TY     = '    100.0 ' AND       65490000
655400            DL-SR-TOTAL-SALES-TY         = SPACES AND             65500000
655500            DL-SR-TOTAL-MKDN-TY          = SPACES AND             65510000
655600            DL-SR-TOTAL-MKDN-PCT-TY      = SPACES AND             65520000
655700            DL-SR-GROSS-MARGN-PCT-TY     = SPACES AND             65530000
655800            DL-SR-END-INV-RTL-TY         = SPACES                 65540000
655900             SET PI-NO-PRINT-DETAIL TO TRUE                       65550000
656000         END-IF                                                   65560000
656100     ELSE                                                         65570000
656200         IF DL-AP-RECEIPTS-COST-TY       = SPACES AND             65580000
656300            DL-AP-RECEIPTS-RETAIL-TY     = SPACES AND             65590000
656400            DL-AP-PURCHASE-ADJ-COST-TY   = SPACES AND             65600000
656500            DL-AP-PURCHASE-ADJ-RETAIL-TY = SPACES AND             65610000
656600            DL-AP-RECEIPTS-COST-LY       = SPACES AND             65620000
656700            DL-AP-RECEIPTS-RETAIL-LY     = SPACES AND             65630000
656800            DL-AP-PURCHASE-ADJ-COST-LY   = SPACES AND             65640000
656900            DL-AP-PURCHASE-ADJ-RETAIL-LY = SPACES AND             65650000
657000            DL-SR-CUMM-MARKUP-PCT-TY     = '    100.0 ' AND       65660000
657100            DL-SR-TOTAL-SALES-TY         = SPACES AND             65670000
657200            DL-SR-TOTAL-MKDN-TY          = SPACES AND             65680000
657300            DL-SR-TOTAL-MKDN-PCT-TY      = SPACES AND             65690000
657400            DL-SR-GROSS-MARGN-PCT-TY     = SPACES AND             65700000
657500            DL-SR-END-INV-RTL-TY         = SPACES AND             65710000
657600            DL-SR-NET-COST-LY            = SPACES AND             65720000
657700            DL-SR-RETAIL-PURCH-LY        = SPACES AND             65730000
657800            DL-SR-CUMM-MARKUP-PCT-LY     = '    100.0 ' AND       65740000
657900            DL-SR-TOTAL-SALES-LY         = SPACES AND             65750000
658000            DL-SR-TOTAL-MKDN-LY          = SPACES AND             65760000
658100            DL-SR-GROSS-MARGN-PCT-LY     = SPACES AND             65770000
658200            DL-SR-END-INV-RTL-LY         = SPACES                 65780000
658300             SET PI-NO-PRINT-DETAIL TO TRUE                       65790000
658400         END-IF                                                   65800000
658500     END-IF.                                                      65810000
658600                                                                  65820000
658700 7000-SELECT-TMLCNTL.                                             65830000
658800******************************************************************65840000
658900*   7000-SELECT-TMLCNTL.                                         *65850000
659000*      OBTAIN THE OPEN FISCAL MONTH DATE IN ORDER TO ACCESS      *65860000
659100*      TDTATTR TABLE FIELDS.                                     *65870000
659200******************************************************************65880000
659300*                                                                 65890000
659400     EXEC SQL                                                     65900000
W02191*******  SELECT OPN_FSCL_MN_DTE                                   65910000
W02191         SELECT PSTG_FSCL_MN_DTE                                  65920000
659600         INTO  :PV-OPN-FSCL-MN-DTE                                65930000
659700         FROM TMLCNTL                                             65940000
659800     END-EXEC.                                                    65950000
659900                                                                  65960000
660000     EVALUATE TRUE                                                65970000
660100         WHEN SQLCODE = ZERO                                      65980000
660200             CONTINUE                                             65990000
660300         WHEN OTHER                                               66000000
660400             MOVE '7000-SELECT-TMLCNTL'                           66010000
660500                                 TO AA-PARAGRAPH-NAME             66020000
660600             MOVE 'TMLCNTL ROW NOT FOUND'                         66030000
660700                                 TO AA-MESSAGE                    66040000
660800             MOVE 'SELECT'       TO AA-DB2-OPERATION              66050000
660900             PERFORM 9901-SQL-ERROR                               66060000
661000     END-EVALUATE.                                                66070000
661100                                                                  66080000
661200 EJECT                                                            66090000
661300                                                                  66100000
661400 7100-SELECT-CURR-YR-TDTATTR.                                     66110000
661500******************************************************************66120000
661600*   7100-SELECT-CURR-YR-TDTATTR.                                 *66130000
661700*      OBTAIN THE OPEN FISCAL MONTH DATE'S FISCAL YEAR AND MONTH *66140000
661800*      NUMBERS.                                                  *66150000
661900******************************************************************66160000
662000*                                                                 66170000
662100     EXEC SQL                                                     66180000
662200         SELECT FSCL_YR_NBR,                                      66190000
662300                FSCL_MN_NBR,                                      66200000
662400                SEA_BEG_DTE,                                      66210000
662500                LY_THIS_DAY_KY_DTE                                66220000
662600         INTO   :DTATTR-FSCL-YR-NBR,                              66230000
662700                :DTATTR-FSCL-MN-NBR,                              66240000
662800                :DTATTR-SEA-BEG-DTE,                              66250000
662900                :DTATTR-LY-THIS-DAY-KY-DTE                        66260000
663000         FROM   TDTATTR                                           66270000
663100         WHERE  KY_DTE = :PV-OPN-FSCL-MN-DTE                      66280000
663200     END-EXEC.                                                    66290000
663300                                                                  66300000
663400     EVALUATE TRUE                                                66310000
663500         WHEN SQLCODE = 0                                         66320000
663600             MOVE DTATTR-FSCL-YR-NBR (1:4)                        66330000
663700                                 TO PV-FISCAL-TY-CCYY             66340000
663800             MOVE DTATTR-FSCL-MN-NBR                              66350000
663900                                 TO PV-FISCAL-TY-END-MONTH        66360000
664000         WHEN SQLCODE = +100                                      66370000
664100             MOVE '7100-SELECT-CURR-YR-TDTATTR'                   66380000
664200                                 TO AA-PARAGRAPH-NAME             66390000
664300             MOVE 'TDTATTR ROW NOT FOUND'                         66400000
664400                                 TO AA-MESSAGE                    66410000
664500             MOVE 'SELECT'       TO AA-DB2-OPERATION              66420000
664600             PERFORM 9901-SQL-ERROR                               66430000
664700         WHEN OTHER                                               66440000
664800             MOVE '7100-SELECT-CURR-YR-TDTATTR'                   66450000
664900                                 TO AA-PARAGRAPH-NAME             66460000
665000             MOVE 'TDTATTR TABLE ERROR'                           66470000
665100                                 TO AA-MESSAGE                    66480000
665200             MOVE 'SELECT'       TO AA-DB2-OPERATION              66490000
665300             PERFORM 9901-SQL-ERROR                               66500000
665400     END-EVALUATE.                                                66510000
665500                                                                  66520000
665600 EJECT                                                            66530000
665710                                                                  66540000
665720 7125-GET-LY-THIS-DAY-MIN-7DAYS.                                  66550000
665730******************************************************************66560000
665740*   7125-GET-LY-THIS-DAY-MIN-7DAYS                               *66570000
665750*      GET LY-THIS-DAY WHEN WE ARE IN THE LAST MONTH OF A 53RD   *66571000
665760*      WEEK YEAR.                                                *66572000
665770******************************************************************66573000
665780*                                                                 66574000
665790     EXEC SQL                                                     66575000
665794         SELECT LY_THIS_DAY_KY_DTE                                66576000
665795         INTO   :DTATTR-LY-THIS-DAY-KY-DTE                        66577000
665799         FROM   TDTATTR                                           66578000
665800         WHERE  KY_DTE = DATE(:PV-OPN-FSCL-MN-DTE) - 7 DAYS       66579000
665801     END-EXEC.                                                    66580000
665802                                                                  66580100
665803     EVALUATE TRUE                                                66580200
665804         WHEN SQLCODE = 0                                         66580300
665805             CONTINUE                                             66580400
665809         WHEN SQLCODE = +100                                      66580500
665810             MOVE '7125-GET-LY-THIS-DAY-MIN-7DAYS'                66580600
665811                                 TO AA-PARAGRAPH-NAME             66580700
665812             MOVE 'TDTATTR ROW NOT FOUND'                         66580800
665813                                 TO AA-MESSAGE                    66580900
665814             MOVE 'SELECT'       TO AA-DB2-OPERATION              66581000
665815             PERFORM 9901-SQL-ERROR                               66581100
665816         WHEN OTHER                                               66581200
665817             MOVE '7125-GET-LY-THIS-DAY-MIN-7DAYS'                66581300
665818                                 TO AA-PARAGRAPH-NAME             66581400
665819             MOVE 'TDTATTR TABLE ERROR'                           66581500
665820                                 TO AA-MESSAGE                    66581600
665821             MOVE 'SELECT'       TO AA-DB2-OPERATION              66581700
665822             PERFORM 9901-SQL-ERROR                               66581800
665823     END-EVALUATE.                                                66581900
665824                                                                  66582000
665825 EJECT                                                            66582100
665826                                                                  66582200
665830 7150-SELECT-TY-SEA-BEG-TDTATTR.                                  66582300
665900******************************************************************66582400
666000*   7150-SELECT-TY-SEA-BEG-TDTATTR.                              *66582500
666100*      OBTAIN THIS YEAR SEASON BEGIN MONTH DATE'S FISCAL YEAR    *66582600
666200*      AND MONTH NUMBERS.                                        *66582700
666300******************************************************************66582800
666400*                                                                 66582900
666500     EXEC SQL                                                     66583000
666600         SELECT FSCL_MN_NBR                                       66584000
666700         INTO   :DTATTR-FSCL-MN-NBR                               66585000
666800         FROM   TDTATTR                                           66586000
666900         WHERE  KY_DTE = :DTATTR-SEA-BEG-DTE                      66587000
667000     END-EXEC.                                                    66588000
667100                                                                  66589000
667200     EVALUATE TRUE                                                66590000
667300         WHEN SQLCODE = 0                                         66600000
667400             MOVE DTATTR-FSCL-MN-NBR                              66610000
667500                                 TO PV-FISCAL-TY-BEG-MONTH        66620000
667600         WHEN SQLCODE = +100                                      66630000
667700             MOVE '7150-SELECT-TY-SEA-BEG-TDTATTR'                66640000
667800                                 TO AA-PARAGRAPH-NAME             66650000
667900             MOVE 'TDTATTR ROW NOT FOUND'                         66660000
668000                                 TO AA-MESSAGE                    66670000
668100             MOVE 'SELECT'       TO AA-DB2-OPERATION              66680000
668200             PERFORM 9901-SQL-ERROR                               66690000
668300         WHEN OTHER                                               66700000
668400             MOVE '7150-SELECT-TY-SEA-BEG-TDTATTR'                66710000
668500                                 TO AA-PARAGRAPH-NAME             66720000
668600             MOVE 'TDTATTR TABLE ERROR'                           66730000
668700                                 TO AA-MESSAGE                    66740000
668800             MOVE 'SELECT'       TO AA-DB2-OPERATION              66750000
668900             PERFORM 9901-SQL-ERROR                               66760000
669000     END-EVALUATE.                                                66770000
669100                                                                  66780000
669200 EJECT                                                            66790000
669300                                                                  66800000
669400 7200-SELECT-LAST-YR-TDTATTR.                                     66810000
669500******************************************************************66820000
669600*   7200-SELECT-LAST-YR-TDTATTR.                                 *66830000
669700*      OBTAIN THE OPEN FISCAL MONTH DATE'S FISCAL YEAR AND MONTH *66840000
669800*      NUMBERS.                                                  *66850000
669900******************************************************************66860000
670000*                                                                 66870000
670100     EXEC SQL                                                     66880000
670200         SELECT FSCL_YR_NBR,                                      66890000
670300                FSCL_MN_NBR,                                      66900000
670400                SEA_BEG_DTE                                       66910000
670500         INTO   :DTATTR-FSCL-YR-NBR,                              66920000
670600                :DTATTR-FSCL-MN-NBR,                              66930000
670700                :DTATTR-SEA-BEG-DTE                               66940000
670800         FROM   TDTATTR                                           66950000
670900         WHERE  KY_DTE = :DTATTR-LY-THIS-DAY-KY-DTE               66960000
671000     END-EXEC.                                                    66970000
671100                                                                  66980000
671200     EVALUATE TRUE                                                66990000
671300         WHEN SQLCODE = 0                                         67000000
671400             MOVE DTATTR-FSCL-YR-NBR (1:4)                        67010000
671500                                 TO PV-FISCAL-LY-CCYY             67020000
671600             MOVE DTATTR-FSCL-MN-NBR                              67030000
671700                                 TO PV-FISCAL-LY-END-MONTH        67040000
671800         WHEN SQLCODE = +100                                      67050000
671900             MOVE '7200-SELECT-LAST-YR-TDTATTR'                   67060000
672000                                 TO AA-PARAGRAPH-NAME             67070000
672100             MOVE 'TDTATTR ROW NOT FOUND'                         67080000
672200                                 TO AA-MESSAGE                    67090000
672300             MOVE 'SELECT'       TO AA-DB2-OPERATION              67100000
672400             PERFORM 9901-SQL-ERROR                               67110000
672500         WHEN OTHER                                               67120000
672600             MOVE '7200-SELECT-LAST-YR-TDTATTR'                   67130000
672700                                 TO AA-PARAGRAPH-NAME             67140000
672800             MOVE 'TDTATTR TABLE ERROR'                           67150000
672900                                 TO AA-MESSAGE                    67160000
673000             MOVE 'SELECT'       TO AA-DB2-OPERATION              67170000
673100             PERFORM 9901-SQL-ERROR                               67180000
673200     END-EVALUATE.                                                67190000
673300                                                                  67200000
673400 8000-READ-INPUT.                                                 67210000
673500******************************************************************67220000
673600*   8000-READ-INPUT                                              *67230000
673700*      READ THE INPUT FILE                                       *67240000
673800*                                                                *67250000
673900*   PERFORMED BY:  1000-HOUSEKEEPING                             *67260000
674000*                  2000-MAIN-ROUTINE                             *67270000
674100******************************************************************67280000
674200                                                                  67290000
674300     READ VA-REPORT-EXTRACT-FILE INTO ML202-VENDOR-EXTRACT        67300000
674400         AT END                                                   67310000
674500             SET PI-INPUT-EOF TO TRUE                             67320000
674600             MOVE SPACES TO ML202-VENDOR-EXTRACT                  67330000
674700         NOT AT END                                               67340000
674800             ADD 1 TO PA-IN-COUNT                                 67350000
674900     END-READ.                                                    67360000
675000                                                                  67370000
675100 9901-SQL-ERROR.                                                  67380000
675200******************************************************************67390000
675300*   9901-SQL-ERROR.                                              *67400000
675400*      SQL ERROR ABEND ROUTINE.                                  *67410000
675500******************************************************************67420000
675600                                                                  67430000
675700     DISPLAY AA-ABEND-LIT.                                        67440000
675800     DISPLAY AA-DB2-ERROR-LIT.                                    67450000
675900     DISPLAY AA-PROGRAM-LIT.                                      67460000
676000     DISPLAY AA-PARAGRAPH-LIT.                                    67470000
676100     DISPLAY AA-MESSAGE-LINE.                                     67480000
676200     DISPLAY AA-DB2-OPERATION-LIT.                                67490000
676300     SET AC-DB2-ERROR TO TRUE.                                    67500000
676400     MOVE +4013                  TO ABEND-CODE.                   67510000
676500                                                                  67520000
676600     COPY DPPD004.                                                67530000
676700     CALL 'ILBOABN0' USING ABEND-CODE.                            67540000
